{"title": "Engineering Manager, Computer Vision -  Zurich", "level": "", "location": "Zurich, Switzerland", "description": "The Reality Labs (RL) organization at Meta is helping people around the world come together and connect through world-class Augmented and Virtual reality (AR/VR) products. With global departments dedicated to research and development in computer vision, machine learning, haptics, social interaction, and more, RL is committed to driving the state of the art forward through relentless innovation. The potential to change the world is immense - and we’re just getting started.\n\nAugmented and Virtual reality will transform the way people come together to work and play. By developing new hardware and software products capable of understanding human appearance, movement and expression, we aim to make it possible for people to feel like they are directly in front of each other, despite being separated by vast distances. By developing new products capable of understanding the human environments, we will enable a metaverse where people can share virtual experiences which interact seamlessly with the real world.\n\nOur XR Tech organization in Zurich is focused on research and development of machine perception technologies from early concepts to production level across all of Meta’s RL products and surfaces including AR/VR products and Family of Apps (Facebook, Instagram, Messenger, WhatsApp). We develop core capabilities across a range of product domains including mixed reality, scene and object understanding, world-scale mapping, avatars, AR/VR remote presence / calling, digital fashion, AR Sharing, and more.\n\nYour job will be to both manage and partner with groups working across the full spectrum from research to product development, managing our technical investment portfolio supporting Tracking and SLAM for AR/VR products across different timelines. You will oversee and be responsible for a broad array of state-of-the-art technology areas and product integrations. Prospective candidates should have sufficient technical depth and breadth in the associated set of technologies to make portfolio management, resourcing and roadmap decisions.", "salary": "", "key_qualifications": "BS degree in Engineering, Physics, Computer Science or equivalent experience.\nExperience of people management in multi-disciplinary global teams at the intersection of tech and product, including building performing teams and organization.\nExperience supporting an engineering and research organization through technical leadership.\nDemonstrated experience in recruiting and managing technical teams, including performance management.\nExperience in managing teams productizing Computer Vision or AI/Machine Learning technologies from conception to end.\nLeadership and interpersonal communication experience in working across many disciplines, driving best practices, and mentoring team members.\nTechnical experience in leading teams/projects in one or more of the technical domains of machine perception (i.e., machine vision, deep learning, sensors and robotics).", "preferred_qualifications": "Ms or PhD in a related field of Computer Vision, or AI/Machine Learning in domains related to SLAM/Position Tracking, 3D reconstruction, depth sensing, bayesian filtering, information theory, or 3D geometry.\nExperience managing joint hardware-software development and associated rapid prototyping projects.\nExperience in leading teams interfacing with HW (sensors, silicon) teams in setting requirements and product tradeoffs.\nFlexibility and resilience in a dynamic environment.", "responsibilities": "Leading an organization comprised of applied scientists and engineers from prototyping across development and integration of advanced systems relying heavily on Computer Vision and Machine Learning technologies.\nOwning the development of system requirements, and collaborating with respective teams to mature and integrate technologies necessary to create product architectures that can deliver these requirements.\nEngaging cross-functionally with other researchers and engineers to develop concepts that advance the entire product pipeline across hardware, software, integration, infrastructure, and applications.\nChampion engineering and operational excellence, establishing metrics and processes for regular assessment and improvement.\nRecruit world-class talent and provide technical leadership and guidance to both your team members and your project peers.\nSet clear expectations and create a positive work environment based on accountability, in collaboration with the engineering and management teams.\nCoordinating with research, user research, art, partnership and legal to both define and execute technology development with key partners & suppliers.\nOperate strategically and tactically. Working closely with various organizations to define and execute the long-term strategies and roadmaps and help set direction while staying on top of the day to day software development.\nProvide technical leadership and guidance to both your team members and your project peers.", "company": "meta", "url": "https://www.metacareers.com/jobs/129978940197464"}