{"title": "Software Engineer (Security Leadership) - Enterprise Trust", "level": "", "location": "London, UK", "description": "We're building products to power the future of work in the metaverse - enabling a world where you can collaborate and feel present with your teammates regardless of your physical location.\n\nEnabling the metaverse for businesses poses unique challenges and one of our focuses is on enabling our products to build deep trust amongst businesses and end users. Our work spans everything from the core data and product models underlying how users can interact through to data security, privacy and protection from bad actors.\n\nWe are seeking an experienced Software Engineer to join our teams building the core technology that enables businesses and users to trust our products for the future of work. Want to solve unique, large scale, highly complex technical problems that can change the way we all work? Join us!", "salary": "", "key_qualifications": "Experience building security products and processes to protect enterprise assets\nExperience leading projects with company/industry-wide impact\nDeep experience communicating and working across functions to drive solutions\nSignificant experience in mentoring/influencing senior engineers across organizations\nProven track record of planning multi-year roadmap in which shorter-term projects ladder to the long-term vision\nExperience in driving large cross-functional/industry-wide engineering efforts\nExpert level programming experience\nSignificant experience with building large-scale applications and operating at scale\nExtensive experience with web or mobile server & client technologies", "preferred_qualifications": "B.S. Computer Science or related field\nExperience building and scaling large products or systems", "responsibilities": "Set clear guardrails to ensure all work products nail enterprise security expectations\nEffectively communicate complex features and systems in detail\nUnderstand infosec industry & company-wide trends to help assess & develop new technologies\nPartner & collaborate with organization leaders to help improve the level of performance of the team & organization\nIdentify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas\nCreate products and features that build trust in work products\nLead long term technical vision and roadmap for large cross-company efforts", "company": "meta", "url": "https://www.metacareers.com/jobs/131063420015960"}