{"title": "Application Engineer, Salesforce", "level": "", "location": "Austin, TX | Menlo Park, CA | Fremont, CA", "description": "Meta's People Engineering Team is responsible for building integrated, scalable, and robust enterprise applications. As an Application Engineer, you will play a key role in re-imagining productivity by shipping transformative products that serve Meta’s employees and various business groups.", "salary": "US$166,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 7+ years of experience developing business applications in Salesforce, PHP, Java, C++, Python, or similar. 7+ years of experience with Salesforce Web Services APIs like SOAP and REST-based Web Service APIs, the Bulk API, and the Metadata API. 3+ years of experience in Visualforce/Lightning Web Components/Apex incorporating JS frameworks like React, Bootstrap or Angular.", "preferred_qualifications": "Platform Developer II certification. Experience building on MuleSoft. Experience building and supporting production quality software. Experience owning projects from end-to-end. Expertise with data management: structured and unstructured DBs, SQL and RDBMS technologies, SOA design principles. SQL experience in handling volumes of data, performance tuning. Experience in understanding code bases, including API design techniques. Knowledge in UI/UX, which can be reflected in your work.", "responsibilities": "Technical ownership of projects and managing resources. Work with product managers to drive strategic value through custom applications built on Salesforce, as well as our internal software stack. Architect highly available, scalable, and secure systems. Comply with change management policies to ensure data integrity and system stability. Understand performance metrics for business value. Build interfaces for complex systems and high-quality tools.", "company": "meta", "url": "https://www.metacareers.com/jobs/177217168597878"}