{"title": "Product Manager, Monetization", "level": "", "location": "Bellevue, WA", "description": "From making valuable connections between people and businesses to building premium services that deliver high-value experiences, the monetization organization at Meta empowers people and businesses to succeed in the global economy. As Meta focuses on building the next evolution of social experiences, the monetization team plays a crucial role in shaping the communication pathways and financial tools that all sized businesses, especially small to medium ones, need to thrive in the new digital economic environment. And we achieve that from end-to-end product and technology innovation.\n\nAs a Product Manager on the monetization team at Meta, you can help build cutting-edge full-stack technologies that will transform the way people and businesses connect and communicate. You’ll help develop industry-leading solutions that power next-generation, large-scale platforms and AI services to help connect billions of people around the world.", "salary": "US$171,000/year to US$238,000/year + bonus + equity + benefits", "key_qualifications": "8+ years product management or related industry experience. Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2+ years of experience in the following. Experience in product management or product design. Experience working in a technical environment with a broad, cross functional team to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Experience in delivering technical presentations. Experience in analyzing complex, large-scale data sets and making decisions based on data. Experience in gathering requirements across diverse areas and users, and converting and developing them into a product solution. Technical experience with analytical tools, methodologies, and design. Proven communication skills", "preferred_qualifications": "Experience defining vision and strategy for a product. Experience going through a full product lifecycle, integrating customer feedback into product requirements, driving prioritization and pre/post-launch execution. Experience recruiting and leading a cross-functional team of world-class individuals. Enthusiastic and resilient in a constantly evolving environment where the process is fluid and creative solutions are the norm.", "responsibilities": "Is the primary driver for identifying significant opportunities, and driving product vision, strategies and roadmaps in the context of broader organizational strategies and goals. Understand Meta’s strategic and competitive position and deliver products that are aligned with our mission and recognized best in the industry. Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm. Incorporate data, research, and market analysis to inform product strategies and roadmaps. Plan, initiate, and manage information technology projects for web-based products and platforms. Lead the ideation, technical development, and launch of innovative tools, platforms, and/or products. Drive product development with teams of world-class engineers and designers, while maintaining team health. Work closely with cross-functional teams to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Integrate usability studies, research, and market analysis into product requirements to improve engineer productivity and enhance user satisfaction. Define and analyze metrics that inform the success of products. Identify and track key performance metrics. Displaying leadership, organizational and execution skills.", "company": "meta", "url": "https://www.metacareers.com/jobs/189263380344239"}