{"title": "Product Designer", "level": "", "location": "Bellevue, WA | Menlo Park, CA | Seattle, WA | New York, NY | San Francisco, CA | Remote, US", "description": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary design teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe. Product Designers at Meta play a central role in the way we build products, ensuring our products and features are valuable for people, easy to use and of the highest level of craft and execution. By focusing on people and doing the simple things first, we develop quality experiences for some of the world’s biggest, most challenging problems. Product Designers help creatively solve big, complicated, real-world problems. We utilize a full range of product design skills to contribute to high-level strategic decisions with the rest of the product and executive teams. Join a diverse group of thinkers and do some of the most meaningful work of your career. This posting represents different full-time roles across the Meta company.", "salary": "US$196,000/year to US$272,000/year + bonus + equity + benefits", "key_qualifications": "8+ years of experience building and shipping applications or software at company-level scale level, leading the end-to-end experience within a large-scale, ambiguous domain. 8+ years of interaction design experience with knowledge defining and evangelizing how an experience should behave based on understanding people's needs, plus consideration of how this innovation will scale and examples of the use of appropriate prototyping tools to demonstrate how a particular interaction will work. 8+ years of visual design experience with proficiency in typography, desktop/mobile UI, color, layout, iconography and aesthetic sense and how these elements impact product function. 8+ years of strategic product thinking with the experience developing product goals, identifying opportunities in a global market, and making decisions based on the impact to people and the company. Experience representing work to senior executives, clearly and succinctly articulating the goals and concepts.", "preferred_qualifications": "Experience showcasing your end-to-end design process across multiple projects, that include interaction and visual design artifacts, multiple iterations, high-fidelity prototypes, and consideration of the impact and scale of work. Experience connecting your work with other industry-leading related initiatives across the company while driving collaboration. Examples of leadership in non-product dimensions that have made a team stronger and positively impacted the work environment.", "responsibilities": "Take broad, conceptual ideas and turn them into something useful and valuable for our 2 billion plus users and drive product strategy and innovation across a large organization. Design leading-edge concepts through the craft of end-to-end flows which impact broad sets of users at scale while using the appropriate prototyping tools. Design new experiences or layouts that evolve visual systems. Play an active role in communicating strategic decisions around the future direction of Facebook products. Give and solicit feedback from a broader product team in order to continually raise our bar for quality, while also taking on mentorship and coaching opportunities. Lead a partnership with Product Managers, engineers, researchers and content strategists to oversee the user experience of a product from conception until launch.", "company": "meta", "url": "https://www.metacareers.com/jobs/191511740525547"}