{"title": "Research Engineer - Reality Labs", "level": "", "location": "Menlo Park, CA, Burlingame, CA, New York, NY", "description": "Meta Reality Labs is looking for a Research Engineer to help us unleash human potential by eliminating the bottlenecks between intent and action. To achieve this, we're building a practical neural interface drawing on the rich neuromotor signals that can be measured non-invasively using electromyography (EMG). Our research lies at the intersection of computational neuroscience, machine learning, signal processing, statistics, biophysics, motor learning, AR/VR and human-computer interaction. We're looking for people who want to shape the future of this technology and are excited about joining our collaborative research team. As a Research Engineer working at the Reality Labs, you will be responsible for the implementation and acceleration of our EMG machine learning platform; creating new AI models, tools, and infrastructure that unlock the capabilities of our technology; productionizing our research results, and working with scientists, software engineers, hardware engineers and designers to advance the company's AI-driven AR/VR agenda.", "salary": "US$70.67/hour to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Masters degree in Computer Science, Computer Engineering, or relevant technical field. Experience with developing machine learning models at scale from inception to business impact. Research experience in machine learning, deep learning, computer vision and/or natural language processing. Programming experience in Python and hands-on experience with frameworks such as PyTorch. Exposure to architectural patterns of large scale software applications.", "preferred_qualifications": "Ph.D. degree and publications in machine learning, speech and language technologies, signal processing, electrical engineering, computer science, computational neuroscience, statistics, physics, or related fields. First-author publications at peer-reviewed AI or signal processing conferences (e.g. NeurIPS, CVPR, ICML, ICLR, ICCV, ACL, Interspeech and ICASSP). Comfort with rapid prototyping and disciplined software development processes. Experience with productizing new research results.", "responsibilities": "Research and develop Deep Learning or other computational models with at least one of Computer Vision, Natural Language Processing, and EMG signal processing. Design methods, tools and infrastructure to analyze and leverage rich multimodal data sets. Collaborate with research scientists and research engineers to develop innovative deep learning models that define the next generation EMG-based AR/VR interaction techniques. Define short-term research goals, informed by practical engineering concerns. Help transition and deliver our work from research into product. Adapt standard machine learning and signal processing methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU).", "company": "meta", "url": "https://www.metacareers.com/jobs/196849226735699"}