{"title": "Software Engineer, Security", "level": "", "location": "Redmond, WA; Burlingame, CA", "description": "Reality Labs' mission is to give people the tools to feel connected anytime, anywhere. We create new, category-defining consumer hardware and software that are immersive, social, and increase the depth of people's connections. The team is a diverse group of problem solvers, inventors, and proven visionaries who are relentless about transforming everyday occurrences into rich experiences that have the potential to improve the way billions of people live. Facebook Reality Labs hardware, enables people to defy distance—connecting with each other and the world—through world-class VR hardware and software. The Reality Labs Trust team is part of the Reality Labs organization at Meta, responsible for developing hardware products and the software platforms that run on them — and defining the roadmap for the organization. As a Software Engineer on the Reality Labs Trust team, you'll be a part of a groundbreaking team and will ensure that internally and externally found vulnerabilities are remediated. The ideal candidate will share our passion for vulnerability management and designing secure systems.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Bachelors in Computer Science or related field. Experience with common security vulnerabilities on web apps and mobile apps. Familiarity with device, app, and web security concepts. Experience programming in Python/C/C++. Android and/or Linux experience. Evaluate and verify security systems via manual and automated testing, such as fuzzing. 5+ years of security industry experience.", "preferred_qualities": "Security patents, technical security conference presentations or other indicators of industry grade security expertise. 3+ years of industry grade code review experience. Secure manufacturing systems experience. Static and Dynamic Analysis experience. Vulnerability Management experience. Experience authoring and managing key management systems. Familiarity with ARM based embedded systems. Python and Shell script familiarity.", "responsibilities": "Design and implement systems that enhance the security and privacy of Meta Reality Labs’ products and infrastructure, through, for example, developing static and dynamic analysis tools and integration of tools into build and test systems. Conduct design and code reviews, improvements that enhance the security of RL products and infrastructure. Use your knowledge of technical systems, such as key management systems, to respond to security/privacy incidents and other severe issues. Drive effort to fix vulnerabilities and regressions across the organization through communication, technical solutions, and automation efficiency. Work with cross functional teams to prioritize security engineering effort. Recommend and help scale adoption of processes to enhance security of RL products and infrastructure. Provide guidance and technical direction to full time employees or contingent workers to ensure that vulnerabilities are remediated properly.", "company": "meta", "url": "https://www.metacareers.com/jobs/217907874599912"}