{"title": "Data Scientist, Product Analytics", "level": "", "location": "Sunnyvale, CA, Bellevue, WA, Menlo Park, CA, Seattle, WA, Burlingame, CA, Remote, US, New York, NY, San Francisco, CA", "description": "As a Data Scientist at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Oculus). By applying your technical skills, analytical mindset, and product intuition to one of the richest data sets in the world, you will help define the experiences we build for billions of people and hundreds of millions of businesses around the world. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will use data and analysis to identify and solve product development’s biggest challenges. You will influence product strategy and investment decisions with data, be focused on impact, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.", "salary": "US$173,000/year to US$242,000/year + bonus + equity + benefits", "key_qualifications": "A minimum of 6 years of work experience in analytics (minimum of 4 years with a Ph.D.), Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent practical experience, Experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), and/or statistical/mathematical software (e.g. R), Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Masters or Ph.D. Degree in a quantitative field.", "responsibilities": "Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses. Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions.", "company": "meta", "url": "https://www.metacareers.com/jobs/232160156423087"}