{"title": "Product Design Engineer, Reality Labs", "level": "", "location": "Sunnyvale, CA", "description": "At Reality Labs we aim to bring together the brightest cross-disciplinary minds in one place to deliver on our mission: build tools that help people feel connected, anytime, anywhere. As a Product Design Engineer, you will take a critical role in developing hardware systems for AR, VR, or New Technology Initiatives. You will become part of a team exploring developing concepts through prototyping and into mass-production consumer electronics. You will work as part of a cross functional team requiring collaboration and curiosity in domains other than mechanical engineering. Our ideal candidate has strong mechanical engineering fundamentals, prototyping skills, CAD fluency, manufacturing process knowledge, and experience designing consumer electronics.", "salary": "US$129,000/year to US$200,000/year + bonus + equity + benefits", "key_qualifications": "BS in Mechanical Engineering or equivalent industry experience; 3+ years of industry experience in mechanical design; Experience in Design for Manufacturability (DFM), Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, GD&T, and 3D/2D CAD; Working knowledge in material properties, such as plastics, metal, adhesive, and glass; Testing and analysis experience (FEA, Simulation, Design of Experiments, etc.); Knowledge of high-volume manufacturing techniques (stamping, machining, 3D printing, injection molding, etc.)", "preferred_qualifications": "5+ years of product design and development experience of handheld and/or wearable high volume consumer electronics, including complex subsystems and/or full systems ownership; Experience with NX CAD; Experience with highly cosmetic products and working with Industrial Design; Fluency in Mandarin and/or Cantonese; Experience designing for human factors; Experience designing and shipping products with Asia-based supply chain; MS or PhD in Mechanical Engineering", "responsibilities": "Lead the mechanical design for a particular component, feature or system while having end-to-end product development understanding; Contribute to mechanical solutions as part of a highly cross-functional team; Model, build, test, and refine prototypes and characterization test systems; Work across the full product development cycle, from concept inception to shipping product; Collaborate and manage work with Asia-based Supply Chain; Push state-of-the-art technologies and approaches to solving complex mechanical problems while working with cross functional technical teams; Travel to external vendors up to 20%", "company": "meta", "url": "https://www.metacareers.com/jobs/257198760138338"}