{"title": "Director, AI Research", "level": "", "location": "London, UK", "description": "At Reality Labs Research (RL Research), we have built a world class team of researchers and engineers, working together across a broad range of disciplines from machine perception and artificial intelligence to operating systems and hardware. The Surreal team at RL Research is seeking an exceptional Research Director that can accelerate our mission to build a new class of spatial and contextualized AI, and lay the foundations for a new computing paradigm that is built from the ground to understand the physical world from egocentric devices. We’re seeking an experienced Research Director to head our London-base research group composed of world class Research Scientists and Research Engineers. The focus will be on advancing the next wave of egocentric 3D machine perception capabilities, which are crucial for enabling contextual AI and powering future AR devices.", "salary": "", "key_qualifications": "Proven track record in leading high-risk, high-reward research and applied research projects. Experience managing high-performing R&D teams, communicating at an executive level, and recruiting world-class talent. Broad knowledge and experience in 3D machine perception, encompassing state-of-the-art ML and AI techniques, as well as foundational knowledge in 3D computer vision, state estimation, mathematics, statistics, and compute and sensor architecture. Strong ability to communicate and collaborate effectively with a diverse range of individuals and functions, from deep research domain experts and generalist software engineers to product management. Capability to bridge communication and engagement from contributing to world-class scientific publications to developing real-time prototype systems. Experience working with incubation and product partners. Ph.D. in Computer Vision, Robotics, State Estimation, 3D Reconstruction, Object Tracking, or a related field. Experience leading research teams in academia or industry.", "preferred_qualifications": "Experience holding a faculty, industry, or government researcher position in a role with primary emphasis on robotics, machine perception or AI research. Demonstrated track record of significant contributions to the field, evidenced by first-author and last-author publications at peer-reviewed Robotics, Computer Vision (CV), and AI conferences such as ICRA, IROS, RSS, SIGGRAPH, NeurIPS, CVPR, ECCV, and ICCV. Experience serving as a site lead for a world-class research team, showcasing the ability to manage top-tier researchers and drive groundbreaking projects as well as developing and maintaining the local team culture.", "responsibilities": "Drive the team's goals and technical direction, tackling new and ambitious research challenges in always-on, 3D machine perception for egocentric devices, hardware/software co-design, and contextual AI. Partner with organizational leaders to enhance team and organizational performance, ensuring alignment with broader org and company objectives. Oversee day-to-day decision-making, balancing both the scientific/engineering aspects and the progression of research towards incubation for long-term product impact. Identify and drive opportunities for transitioning research into product development, collaborating closely with partners. Effectively communicate strategy, project objectives, and rationale to a broad audience, including scientific, engineering, and executive teams. Manage partner engagement and cultivate future opportunities. Foster a research culture marked by respect, integrity, inclusion, innovation, and productivity. Maintain active engagement with the global academic community and collaborate with internal product and incubation teams to ensure successful technology integration into Meta’s products.", "company": "meta", "url": "https://www.metacareers.com/jobs/273663749141544"}