{"title": "Graphics Software Engineer, Rendering - Reality Labs", "level": "", "location": "Bellevue, WA | Redmond, WA | Seattle, WA | Burlingame, CA | Remote, US", "description": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.\n\nAs a Graphics Software Engineer on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\n6+ years of graphics software engineering experience or 2+ years of graphics software engineering experience with PhD.\n6+ years of experience with C/C++ programming.\n6+ years of object-oriented and component-based design experience.\nProblem-solving and communication skills.", "preferred_qualifications": "Experience delivering AAA Games, working on Graphics subsystems or the Game Engine AR/VR experience.\nKnowledge of ray tracing, rasterization and linear algebra.\nExperience with low level performance profiling and optimization.\nExperience implementing 3D graphics features such as lighting, effects, shaders and other low-level systems.\nExperience with tools such as Maya, Houdini, Blender, 3Ds Max, Arnold, RenderMan, or Cycles.\nExperience with either DirectX/Vulkan/OpenGL/Metal.", "responsibilities": "Develop innovative graphics frameworks, algorithms, and tools to maximize graphics quality and performance.\nPartner closely with various infra and product teams across Meta, on camera, graphics, upcoming hardware, media enhancements, and more to create real-time rendering architecture.\nBuilding tools and pipelines for generating very realistic synthetic images.\nEnable high fidelity experiences through remote compute solutions on smaller devices with limited battery.\nBuilding rendering subsystems for platforms such as Spark AR and Horizon.\nBuild a platform for cloud streamed games.\nDocument and support graphics features.\nWrite high-quality, performant, and maintainable code.\nCollaborate with cross-functional engineering teams to deliver innovation into AR/VR products.", "company": "meta", "url": "https://www.metacareers.com/jobs/276174232022648"}