{"title": "Software Engineer, Computer Vision (Technical Leadership)", "level": "", "location": "Bellevue, WA", "description": "The Reality Labs and AI teams at Meta are helping more people around the world come together and connect through world-class Augmented, Mixed and Virtual Reality hardware and software. With global departments dedicated to AR/VR research, computer vision, haptics, social interaction, and more, we are committed to driving the state-of-the-art forward through relentless innovation. AR/VR's potential to change the world is immense -- and were just getting started.\n\nOur Core Tech teams explore, develop, and deliver new cutting-edge technologies that serve as the foundation of current and future Reality Labs products. From mixed reality and human interaction to natural input and beyond, these teams are focused on taking new technologies from early concept to the product level while iterating, prototyping, and realizing the human value and new experiences they open up.", "salary": "US$213,000/year to US$293,000/year + bonus + equity + benefits", "key_qualifications": "Experience leading projects with industry-wide impact. Vast experience communicating and working across functions to drive solutions. Proven track record of planning multi-year roadmap in which shorter-term projects ladder to the long term-vision. Experience in driving large cross-functional/industry-wide engineering efforts. Significant experience in mentoring/influencing senior engineers across organizations. Significant experience in programming languages with a technical background. Significant experience in one or more of the following areas: artificial intelligence, machine learning, deep learning, computer vision, 3D graphics. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Doctor of Philosophy (Ph.D.) in Computer Engineering, Computer Science, or Electrical Engineering and Computer Sciences. Expertise in Physics, Optics, Computer Vision, Robotics, Sensor Fusion, or Machine Learning. Experience in shipping computer vision or image processing products to millions of customers or have started a new line of product.", "responsibilities": "Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient. Invent, analyze, design, develop and optimize real time VR and AR computer vision algorithms in areas related to 3D reconstruction, SLAM, object detection and tracking, sensor fusion and camera calibration. Technically lead in a team environment across multiple scientific and engineering disciplines, making the architectural trade-offs required to rapidly deliver software solutions. Develop software for a variety of consumer devices, including novel sensing systems, tracking systems, imaging systems and haptic devices. Effectively communicate complex features and systems in detail. Write clean readable code, debug complex problems that span systems, prioritize ruthlessly and get things done with a high level of efficiency. Learn constantly, dive into new areas with unfamiliar technologies, and embrace the ambiguity of AR and VR problem solving. Understand industry & company-wide trends to help assess & develop new technologies. Partner & collaborate with organization leaders to help improve the level of performance of the team & organization. Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas.", "company": "meta", "url": "https://www.metacareers.com/jobs/281209407905800"}