{"title": "AI Marketing Lead", "level": "", "location": "Menlo Park, CA | Seattle, WA | Washington, DC | New York, NY | San Francisco, CA", "description": "Meta's Artificial Intelligence (AI) Marketing Team is looking for an experienced leader to help shape the future of AI Marketing at Meta.\n\nIn this role, you will manage a team of product marketers who manage the current and future AI portfolio. This team is responsible for influencing product strategies and positioning for target audiences, driving go-to-marketing (GTM) efforts that drive awareness and adoption, and working cross functionally with partners throughout the company. Our ideal candidate is an accomplished marketing leader, who has worked on new and emerging technologies, is data and results driven, possesses sharp strategic instincts, and is deeply passionate about building, supporting, and inspiring a multi-disciplinary marketing team to do the best work of their careers. If you are a strategic marketer who is analytical, excel at leading complex projects in fast-paced environments and are passionate about connecting customers with great products, then we'd like to connect with you.\n\nThis is a full-time position.", "salary": "US$180,000/year to US$252,000/year + bonus + equity + benefits", "key_qualifications": "BA/BS degree; 10+ years’ experience in marketing or product management; Experience working with Product Management, Marketing and Communications teams at all levels of management; Solid analytical and problem solving skills; Experience marketing new and emerging technologies; Experience developing GTM strategies based on audience driven insights; Experience driving presentations with executives and cross functional teams; Project and program management experience", "preferred_qualifications": "Experience leading Marketing teams focused on new and emerging technologies; Direct experience in Product Marketing", "responsibilities": "Build, manage, and nurture the product marketing team responsible for the AI portfolio. This includes modeling inclusive behaviors and building a diverse organization that values, respects, and taps into different backgrounds and perspectives.\nInfluence and shape product strategies, positioning and narratives through the use of data and insights for target audiences in close collaboration with Product Management, App marketing, Research, Communications and Brand.\nDevelop and execute GTM strategies including goals, metrics for success, asset development and integrated launch planning with cross functional partners for large, complex launches across the company while minimizing risk.\nWork across all AI workstreams and GTMs to ensure leadership visibility, awareness and consistency in strategy, messaging and approach.\nOwn critical process and operations efforts. Partner with brand and integrated marketing on outbound marketing strategies and programs to drive awareness, adoption and long term engagement.\nEstablish strong partnerships with cross-functional teams across Marketing as well as Communications, Marketing Insights, Product Management and more.\nTackle complex, highly visible and sensitive issues with a strategic, data-driven mindset.\nFast learner, eager to learn new technologies. Roll-up-your-sleeves work ethic and willingness to take the initiative and make things happen.", "company": "meta", "url": "https://www.metacareers.com/jobs/289708604136592"}