{"title": "Quality Assurance Manager, Product Quality", "level": "", "location": "Menlo Park, CA", "description": "Product quality organization at Meta is responsible for testing and assessing products' launch readiness to market from a correctness perspective. The team’s charter is across Meta core products which we call the Family of Apps (e.g. Facebook, Instagram, Messenger, Threads, Ads products). The team has a clear focus to shift left to enable early testing and automation development to prevent issues leaking to production. We are seeking a Quality Assurance Manager who is hands-on engineering leader to build out a new team focused enhancing automation coverage and effectiveness across the Family of Apps. You will have a great influence on the whole quality assurance process and methodology for the product development. The ideal candidate is a quality assurance leadership expert with strong communication skills and previous experience as a detail-oriented QA engineer. The candidate should also have a passion for building great hardware and software products and consumer electronics device experience, this includes a deep understanding of varying testing techniques and the ability to come up with new methods through out-of-the-box thinking.", "salary": "US$158,000/year to US$219,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree and/or Master's degree in Computer Science or equivalent and/or related work experience. 5+ years of management experience 10+ years of relevant QA/testing automation experience", "preferred_qualifications": "Experience setting the technical vision for developing test automation and continuous integration Experience in creating and implementing test automation strategies, automated testing methodologies, and approaches, tools, techniques (unit, functional, integration), executing automated test suites, and debugging test failures Experience and conviction around measures to quantify software quality", "responsibilities": "Build and manage QA team, including hiring, coaching, and mentoring team members. Building on existing and creating new automation strategies to enable and drive Engineering teams across Meta to build automation at scale. Build product expertise to identify and close gaps in automation and functional test coverage in our products. Establish team metrics for measurement of quality and operational excellence and a consistent, regular process for assessment and improvements. Lead the improvement and implementation of best practices, methodologies, and tooling to meet quality coverage needs for products. Be the advocate for testability, drive best engineering practices and defect prevention. Understand the ins and outs of our product and identify gaps in functional & automated test coverage. Grow a highly effective QA team. Ensuring Compliance: The QA Manager ensures that all testing and quality assurance processes comply with industry standards and regulations. Plan, develop and execute a test strategy across core Family of Apps products and platforms in close collaboration with the product engineering team. Drive cross-platform engineering challenges and contribute creative ideas to improve quality. Implement and evolve QA processes to get effective test signals and scale testing efforts across multiple products.", "company": "meta", "url": "https://www.metacareers.com/jobs/295767843489612"}