{"title": "Product Manager (Leadership)", "level": "", "location": "Sunnyvale, CA", "description": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary product teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe.\n\nMeta Product Management Leaders work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for extremely entrepreneurial Product Management Leaders to help innovate and execute product initiatives across the company and value moving quickly. This job description represents different full-time roles across our product suite.", "salary": "US$249,000/year to US$323,000/year + bonus + equity + benefits", "key_qualifications": "12+ years of experience in Product Management and/or Product Design\n12+ years of experience working collaboratively with engineering, design and user research teams\n8+ years of experience hiring, managing, and developing both individual contributors and senior leaders\nCritical thinking/analytical leadership experience\nExperience presenting to senior executive audiences\nBA/BS in Computer Science or related field", "preferred_qualifications": "Experience in a consumer focused technology company\nExperience building 0-1 products, platform/ecosystem products, or marketplaces", "responsibilities": "Lead a team through the ideation, technical development, and launch of innovative products\nDrive product development with a team of world-class engineers and designers\nAttract, build, manage, and develop a talented, diverse, equitable and inclusive team of product managers and product leaders\nEstablish shared vision across the company by building consensus on priorities leading to product execution\nIntegrate usability studies, research and market analysis into product requirements to enhance user satisfaction\nDefine and analyze metrics that inform the success of products\nUnderstand Facebook’s strategic and competitive position and deliver products that are recognized best in the industry\nMaximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm\nManage multiple products and priorities, scale teams, and ensure org is effective, healthy and set up for success by establishing clear and measurable goals\nIdentify and initiate opportunities for new projects or focus areas and builds teams necessary to execute", "company": "meta", "url": "https://www.metacareers.com/jobs/300760325782735"}