{"title": "Product Growth Analyst", "level": "", "location": "Menlo Park, CA | Seattle, WA | Burlingame, CA | New York, NY | San Francisco, CA", "description": "We’re looking for growth leaders for products used by billions of people and businesses all over the world across our apps including Facebook, Instagram, WhatsApp and Oculus. This is a leadership opportunity to drive impact end-to-end through the product development life cycle. The product growth analyst role is embedded within product teams and requires using a mix of skills including analysis, creative product ideation, and cross-functional collaboration. Success in the role is tied directly to product goals and the team rewards results-based performance.\n\nThe Growth practice was started right here at Meta, putting you at the forefront of the industry with great opportunity to learn about growth from experts. It is a lean and highly regarded team with a strong and close-knit culture and emphasis on regular sharing of successful strategies, tactics and insights across products. Our team values are to own the outcome, focus on driving sustainable impact, and put team success first. There is great opportunity to be a leader and influence the direction of high-visibility and high-impact initiatives, and to see your work come to life in some of the most widely used apps in the world.\n\nMeta is an equal opportunity employer that provides competitive benefits to reward good talent. Our benefits include generous paid time off, retirement investment plans with employer matching, holistic wellness program including physical and mental health and internal community and mentorship groups.", "salary": "US$128,000/year to US$185,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience. 6+ years experience working in an analytical or product role. Proven to effectively collaborate across variety of technical and non-technical functions to drive towards common product goals. Experience working with and influencing multi disciplinary product teams consisting but not limited to software engineers, designers, product managers and data scientists. Proficiency in quantitative analysis geared towards drawing actionable insights from complex datasets. Experience performing exploratory analysis with minimal direction to answer ambiguous open ended questions. Experimentation experience to design multivariate tests, synthesize test results and build frameworks to make data-informed launch decisions. Creative product ideation skills to apply growth tactics broadly to different product areas and think through detailed elements of a product experience. Experience with data querying languages (e.g. SQL). Experience working on a product or service used by diverse communities.", "preferred_qualifications": "", "responsibilities": "Lead growth strategy across a large product area and drive cross-team alignment. Drive long term growth of Meta Inc products through a combination of data analysis, product ideation, and experimentation to optimize product experiences. Understand trends in user behavior and product usage to influence growth strategy. Identify opportunities to drive growth and prioritize them to maximize long-term growth. Execute on projects by working closely with engineering and other members of product teams to land impact on product goals. Lead experimentation from designing tests to analyzing results that lead to launch decisions.", "company": "meta", "url": "https://www.metacareers.com/jobs/303528645508791"}