{"title": "Content Manager, GenAI", "level": "", "location": "Menlo Park, CA, New York, NY", "description": "GenAI Content is a horizontal function supporting initiatives across the broader GenAI Org and is seeking an experienced content manager to join the team.\n \nGenAI Content supports products through quality control, prompt engineering, fine tuning and creative execution. The team is comprised of content experts with diverse backgrounds in journalism, social media, creative storytelling, writing, editing, visual arts, film & TV production and more. Content Managers partner closely with technical teams to prompt engineer, build and ship products from lab to production, across different modalities and mediums. They serve as a point of contact for internal stakeholders working across AI on priority product initiatives, and aim to build products and creative tools that entertain, inform and delight.\n \nThe ideal candidate will have strong editorial judgment and a keen eye for crafting thorough, nuanced and objective guidelines that establish and measure content quality. They will also have creative skills to build products like AI Agents, editing and fact-checking skills to fine tune foundational models, visual expertise to assess image and video generations, and strategic product thinking to put user needs at the forefront of our work.\n \nIf you’re innately curious about the future of generative artificial intelligence, fascinated by new developments in research and product development, take pride in identifying efficiencies in process and operations and motivated by ambiguity, we encourage you to apply.", "salary": "US$159,000/year to US$223,000/year + bonus + equity + benefits", "key_qualifications": "8+ years of experience with digital content strategy, journalism, production and relevant skills; 6+ months experience working in Generative AI, prompt engineering, and annotation; Experience with content labeling and analysis around creative and serious topics; Demonstrated critical thinking skills and impeccable track record of editorial judgment around nuanced topics (politics, bias, gender, religion etc.) to quality control large datasets of annotations for model training; Experience leading and collaborating on XFN projects to build products, respond to urgent needs, preempt issues and address concerns in collaborative and timely fashion; Experience building products related to diverse communities and niche topics; Experience working independently and autonomously; Previous experience collaborating with product and technical teams; Proven knowledge of industry trends and news; Proven editing skills.", "preferred_qualifications": "Experience bringing a creative content perspective to help drive product execution and user-facing experiences; Experience engaging with product and engineering teams from roadmap to delivery around sensitive and high profile product areas; Familiarity with AP Style and other writing standards.", "responsibilities": "Deliver completion of high-quality editorial work in a fast-paced, dynamic work environment; Develop guidelines and build measurement frameworks that set quality standards for products and features; Generate content-focused insights that both fuel ideation and product strategy; Lead through influence and collaboration within GenAI Content team and relevant stakeholders; Identify processes and opportunities to influence through scale.", "company": "meta", "url": "https://www.metacareers.com/jobs/304354179376109"}