{"title": "Display Algorithm Architect", "level": "", "location": "Sunnyvale, CA | Redmond, WA", "description": "Meta Reality Lab is the world leader in the design of virtual and augmented reality systems. Come work alongside expert engineers and research scientists to create the technology that makes VR pervasive and universal. Join the adventure of a lifetime as we make science fiction real and change the world.\n\nThe Display Architecture Team within the VR organization is seeking a Display Algorithm Architect to lead the development of Meta’s proprietary display IP for VR displays. As a member of the VR Display Team, the successful candidate will be working closely with Display Driver IC (DDIC) and pixel pipeline engineers, Visual Quality team, and DDIC vendors to design, evaluate performance, and embed Meta’s proprietary visual quality IP within the vendor's DDIC or in SoC for future VR products. This role offers involvement in a mix of forward-looking and product-critical projects, and requires close collaboration with multiple teams within the Meta Reality Labs.", "salary": "US$204,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "Masters Degree in Electrical Engineering, or Computer Engineering, or equivalent work experience. 12+ years of industry experience including 5+ years of technical leadership working with multiple internal and external teams. Prior experience with architecture and design of display IP such as sub-pixel rendering, foveation, Mura, burn-in compensation algorithms. Proficient in at least one programming language such as Matlab, Python or C++. Effective communication skills and a record of publications.", "preferred_qualification": "Ph.D. in Electrical Engineering. Good understanding of the front-end digital design flow: RTL design, logic synthesis, timing verification. Good understanding of pixel pipeline for Displays and DDIC architecture. Experience with FPGA prototyping. Familiar with compression IP design such as DSC.", "responsibilities": "Lead architecture and development of proprietary display IP for VR displays including owning the reference software model for the algorithms. Collaborate with DDIC pixel pipeline architects to optimize algorithms for optimal gate-count and timing. Collaborate with visual quality teams to evaluate performance. Collaborate with hardware prototyping teams to create hardware evaluation and platforms. Collaborate with the system and DDIC engineers to bring up and test the algorithms for production readiness.", "company": "meta", "url": "https://www.metacareers.com/jobs/312397111252268"}