{"title": "QA Engineering Lead, Reality Labs (Metaverse)", "level": "", "location": "Los Angeles, CA | Burlingame, CA", "description": "Reality Labs is a world leader in the design of virtual and augmented reality systems. Come work alongside expert software engineers and research scientists to create the technology that makes VR and AR pervasive and universal. Join the adventure of a lifetime as we make science fiction real and change the world.\n\nAs a QA Engineering Lead at Meta Reality Labs (RL), you'll ensure the delivery of a high-quality software and platform for RL product lines. You'll be responsible for building and executing test strategy and plans across multiple products and platforms while working with engineering teams to identify and resolve defects. The ideal candidate is a detail-oriented engineer, with experience building great software products and improving engineering efficiency. You'll also debug issues across the hardware and software stack including consumer electronics devices, mobile apps, games, and web. You are methodical, a self-starter, and meticulous about quality.", "salary": "US$186,000/year to US$254,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\n15+ years of driving QA strategy and/or equivalent experience\n5+ years of test ownership of an entire product or product lines\nExperience in test planning, test design and execution, performance and stress testing, and implementing and maintaining quality test automation.\nExperience debugging applications on Platform, PC, and mobile components.\nExperience building, shipping, and maintaining commercial software.\nExperience coding in Python, PHP, Java, C, or C++.", "preferred_qualifications": "Experience in managing black box and white box testing.\nExperience  building, shipping, and maintaining games and/or game engines", "responsibilities": "Ensure the delivery of a high-quality software and platform for Reality Labs product lines.\nBuild a test-driven engineering culture that drives improvements in quality.\nImplement process changes to scale testing efforts across multiple products.\nPlan, develop, and execute test coverage for multiple platforms.\nIdentify both objective and subjective quality trends, track and report on KPIs throughout project lifecycles, and deliver comprehensive analyses to senior Reality Labs leadership.\nDiagnose issues, report defects, and propose regression tests to discover reoccurrences.\nWork with engineers and project leads to triage and prioritize issues for resolution.\nOwn the process of creating metrics to measure and monitor product performance.\nPartner with Automation and Infrastructure team to leverage automation to allow better reliability and scalability.", "company": "meta", "url": "https://www.metacareers.com/jobs/319327391113751"}