{"title": "Research Scientist - Central Applied Science", "level": "", "location": "Menlo Park, CA, Burlingame, CA, New York, NY", "description": "We are looking for researchers and applied scientists to join the Core Data Science team. Core Data Science is an interdisciplinary team of quantitative scientists that aims to deliver research and innovation that fundamentally contribute to Meta's success. By applying your expertise in quantitative methods, you will be empowered to drive impact across a range of products, infrastructure and company operations. Individuals in this role are expected to have expertise and publications within research areas including artificial intelligence, machine learning, statistics, causal inference and experimentation. The ideal candidate will have a passion for building data-driven products and forming research frameworks to solve challenging, real-world problems.", "salary": "US$70.67/hour to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. MS degree with 4+ years of relevant experience, or PhD in computer science, statistics or a related field. Publications in Machine Learning, AI, computer science, statistics, data science, or related technical fields. Experience analyzing datasets using languages like Python or R. Experience using machine learning and deep learning frameworks, such as PyTorch, TensorFlow or scikit-learn. Experience developing algorithms in languages like Python, C, C++ or Java. Experience analyzing large datasets using tools like Presto, Hive or Spark. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "", "responsibilities": "Work with vast amounts of data, generate research questions that push the state-of-the-art, and build data-driven products. Develop novel quantitative methods on top of Meta's unparalleled data infrastructure. Work towards long-term ambitious research goals, while identifying intermediate milestones. Communicate best practices in quantitative analysis to partners. Work both independently and collaboratively with other scientists, engineers, UX researchers, and product managers to accomplish complex tasks that deliver demonstrable value to Meta's community of over 3.8 billion users. Actively identify new opportunities within Meta's long term roadmap for data science contributions.", "company": "meta", "url": "https://www.metacareers.com/jobs/319377314029612"}