{"title": "AI Research Engineer, Computer Vision - FAIR", "level": "", "location": "Menlo Park, CA | Seattle, WA | New York, NY | San Francisco, CA", "description": "Meta FAIR is one of the top industrial research organizations in the world. In the FAIR Perception team, we publish groundbreaking papers (e.g., Segment Anything, Masked Autoencoders, Hiera) and collaborate closely with Applied Research and Meta production teams to bring the latest research findings to Meta's products for connecting billions of users.\n\nWe are driving an ambitious agenda building on the success of Segment Anything and other related works to create foundation models for computer vision and language.  We drive impact by developing state-of-the-art models, massive scale datasets, and compelling interactive demos.  We are looking for strong engineers who are enthusiastic about software engineering and computer vision research.", "salary": "US$70.67/hour to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Masters degree in Computer Science or related technical field, or equivalent practical experience. 3+ years of experience in one or more of the following areas: Deep Learning, Computer Vision, Computer Graphics, Robotics, or AI-Infrastructure. Experience writing software and executing complex experiments. Research experience in one or more of these areas: computer vision, multimodal perception, NLP, or HCI+perception. Experience with Python and PyTorch.", "preferred_qualifications": "PhD in computer vision and/or machine learning or related areas. Publication record in AI conferences like ICCV, CVPR, NeurIPS, ICML, ACL, NAACL, CHI, ISMAR, UIST, VR, etc. Experience with C++, CUDA and model optimization.", "responsibilities": "Leading, collaborating, and executing on research that pushes forward the state of the art in computer vision. Contributing to experimental design, implementation, evaluation, and reporting results. Working with and creating large datasets and evaluation benchmarks. Collaborating with scientists and engineers in a large cross-functional team. Building optimized software tooling and infrastructure to accelerate research outcomes.", "company": "meta", "url": "https://www.metacareers.com/jobs/336175832762945"}