{"title": "Industrial Design Architect", "level": "", "location": "Seattle, WA", "description": "Meta’s Reality Labs team is shaping the future of consumer electronics in the emerging Augmented and Virtual Reality industries. As an Industrial Design Architect on the Reality Labs ID team, you will help bring next generation hardware and experiences to life. You bring creative problem solving and hands-on mechanical design skills to create delightful, holistically considered products. You have experience designing, engineering, and shipping consumer products. And you excel working collaboratively with cross-discipline teams.\n\nFrom developing ergonomic solutions to addressing complex architectural challenges, from smile-inducing mechanisms to innovative manufacturing processes, you will work tirelessly with the ID team to create products as amazing as the experiences they enable. A deep mechanical aptitude and a high degree of DFM expertise will allow you to take things from “outlandish idea” to “plan of record”. You will need to move quickly between high-level experience concepts and detailed, functional prototypes that will inform the product decisions and help our teams make the impossible possible.", "salary": "US$170,000/year to US$240,000/year + bonus + equity + benefits", "key_qualifications": "A bachelor's degree in Mechanical Engineering, Industrial Design, or a related field\n5+ years of experience developing consumer electronics or similar products\nExperience leading technical projects and directing development activities\nExpertise in creating high-fidelity mockups, mechanisms, and rapid prototypes\nExperience designing plastic and metal parts for high volume manufacturing processes\nExperience defining product level mechanical architectures\nExpertise in 3D CAD modeling at the detail and assembly level in NX, Creo, or Solidworks, including complex surfacing\nExperience working collaboratively with ID, ME, and EE teams\nProven communication, visualization, and problem solving skills", "preferred_qualifications": "", "responsibilities": "Collaborate closely with the Industrial Design team to create and prototype integrated mechanical/design solutions\nDrive rapid mechanical design iteration, exploration, and evolution to deliver elegant, intuitive product solutions\nPush the state of the art of physical technology integration and manufacturing processes\nCreate and refine effective ways to address complex ergonomic challenges\nBring a creative and pragmatic mindset to challenging technical problems to help the team create innovative yet feasible solutions\nPartner closely with Product Design Engineering and other internal teams to align intent and rapidly move projects forward\nLeverage external partners as needed to implement novel manufacturing solutions\nAbility to travel internationally", "company": "meta", "url": "https://www.metacareers.com/jobs/337533745675389"}