{"title": "Technical Program Manager, Network Infra Sustainability", "level": "", "location": "Denver, CO", "description": "Meta is committed to attaining Net Zero emissions across our value chain in 2030. To support this, Meta is seeking a Technical Program Manager (TPM) experienced in network infrastructure and sustainability, defining and implementing Net Zero emissions programs, focused on value chain emissions (Scope 3). This position will set goals, create strategies, and execute plans to reduce network infrastructure value chain emissions, in partnership with Meta’s Net Zero and Sustainability, Sourcing, Hardware Engineering, Fleet Sustaining, Datacenter Operations, Finance, and Capacity Planning teams. This position will provide program management support for cross-functional teams on topics including greenhouse gas emissions accounting, reporting, and forecasting, as well as emissions reduction initiatives such as design optimization, circularity, and re-use programs. Success will drive major contributions in reducing total emissions, by targeting and avoiding, reducing, or eliminating major sources. This role requires expertise in network infrastructure, complemented by domain expertise in sustainability and emissions. Broadly, this role is responsible for designing and embedding Scope 3 Net Zero practices in Meta’s network infrastructure organization (data center networking, backbone engineering, edge, and fiber). This includes institutionalizing processes for emissions data capture and reporting in Meta’s network infrastructure, design optimization for reduced emissions, developing and driving education programs with cross-functional teams, and developing business cases to drive further reductions. This role will reside within the Network Infrastructure organization and partner with Net Zero and Sustainability, Capacity Planning, Data Center Infrastructure, Hardware Engineering, Finance, and Infrastructure sourcing teams. This role will partner and drive Meta’s Network Infrastructure organization and its partners to achieve Meta’s goals efficiently, with the lowest possible added effort and overhead.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Computer Science, Electrical Engineering or a related technical discipline, or equivalent experience; 8+ years of systems engineering, hardware engineering, software engineering, or technical product/program management experience; Experience delivering complex tech programs and/or products from inception to delivery; Knowledge of user needs, gathering requirements, and defining scope; Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership; Communication experience and experience working with technical management teams to develop systems, solutions, and products; Organizational, coordination and multi-tasking experience; Analytical and problem-solving experience with large-scale systems; Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones; Proven working knowledge of Scope 1, 2, and 3 emissions standards and policy; Working knowledge of GHG accounting principles and methods; Experience playing coordinating/leadership role in building partnerships with internal stakeholders in a corporate environment; Proven technical experience with greenhouse gas emissions (GHG) accounting, carbon reduction strategies, technology and evaluation techniques.", "preferred_qualifications": "Graduate degree preferred in Computer Science, Electrical Engineering or a related technical discipline, or equivalent experience; Applied understanding and experience with carbon emissions of network hardware manufacturing and fiber construction, including and beyond raw material extraction; Knowledge of networking hardware and technologies; Experience with silicon development; Experience with data center architecture and deployment; Experience working with capacity planning, migration and turn-up; Web or Internet start-up environment and technical infrastructure management experience; Experience setting and reporting on corporate GHG reduction targets and commitments (e.g. Net Zero, SBTi); Demonstrated leadership in developing value chain emissions reduction strategy for large corporations; Experience delivering projects aligned with large scale corporate goals through influence and collaboration; Technical knowledge of carbon reduction strategies, technology and evaluation techniques.", "responsibilities": "Own Meta Network Infrastructure’s overall Net Zero program design, implementation, and success spanning three areas in a matrix organization covering a range of areas (Net Zero and Sustainability, Capacity Planning, Data Center Infrastructure, Hardware Engineering, Finance, and Infrastructure sourcing teams) and across multiple physical locations. Area 1: Emissions data capture, reporting, and forecasting, for all hardware and fiber programs. Area 2: Design and integrate Net Zero practices into existing development processes, capturing emissions data from estimate at design inception, to rigorous science-based methods by mass production, and generating emissions-optimized designs. Area 3: Driving business cases and implementation of circularity, re-use, and other emissions avoidance and reductions programs, with partner teams. Create and gather alignment across multiple organizations regarding the business value of: Value propositions to reduce or eliminate emissions in new design programs, lifecycle extension, and circularity. Programs to engage with major suppliers (including components, design manufacturers, integrators) on their emissions roadmaps, partnered with Meta’s supplier management organization. Create execution plans in partnership with technical leads involving: The evolution of Meta’s carbon inventory, forecasting, pricing, and reporting systems. Carbon reduction and avoidance programs (via design optimization, equipment re-use, and targeted avoidance / reduction programs). Lead maturation and streamlining process, continuously improving Net Zero practices in Meta Infrastructure, to be as efficient and integrated with existing development practices as possible. Drive overall communication to leadership, stakeholder and core working teams in regular cadence to bring awareness. Develop and manage the overall program including defining scope, requirements, development model, schedules, and deliverables with engineering teams, partners, and stakeholders. Drive internal process improvements across multiple teams and functions. Provide hands-on support during implementation of new emissions programs and requirements, training partners and teaching while doing. Proactively identify and mitigate risk to the Net Zero efforts.", "company": "meta", "url": "https://www.metacareers.com/jobs/340618205734263"}