{"title": "Ultrasound Research Scientist", "level": "", "location": "Burlingame, CA", "description": "At Reality Labs Research (RL-R), our goal is to explore, innovate and design novel interfaces and hardware subsystems for the next generation of virtual, augmented, and mixed reality experiences. We are looking for a skilled and motivated Ultrasound Research Scientist to join our team, whose mission is to develop next-generation human-computer interfaces for AR/VR. We are specifically looking for a candidate with experience in advanced through-body ultrasound measurement methods and who can work with a team of researchers who are developing hardware to sense user input. More broadly, the chosen candidate will work with a diverse and highly interdisciplinary team of researchers and engineers and will have access to cutting edge technology, resources, and testing facilities.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "PhD degree or equivalent experience in Electrical Engineering or a related field in Acoustics, Physics, Mechanical Engineering, or related fields. 5+ years experience with experimental and data-analysis methods to study wave propagation through human tissue including, but not limited to, ultrasound imaging, elastometry, or laser Doppler vibrometry. 5+ years experience with ultrasound transducers including, but not limited to, loading effects, ultrasound power estimation, coupling methods to soft tissue, or driving-signal generation. 5+ years experience with finite-element acoustics modeling in Ansys, Comsol, or other similar tools. 5+ years experience with programming languages such as MATLAB, Python, C++, or similar. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Experience with transducer assembly design including, but not limited to, backing material, matching layer, or wedges. Experience with shear-wave through-body ultrasound techniques including, but not limited to, shear-wave elastography, transient elastography, or other acoustic radiation force impulse (ARFI)-based imaging methods. Experience with mechanical design in Solid Works, AutoCAD, or other similar CAD tools. Experience with acoustics non-destructive evaluation. Experience with data analysis methods including, but not limited to, dispersion-relation estimation or surface-wave inversion used in, e.g., non-destructive evaluation, structural health monitoring, or seismology.", "responsibilities": "Design and execute experiments on humans and biomimicking phantoms to characterize ultrasound propagation through human tissue. Develop data-analysis methods and models for ultrasound propagation through human tissue. Design, build, and validate prototypes to enable path-finding research. Formulate ultrasound research strategy and direct execution. Work with cross-functional research and engineering partners to define system requirements and mature prototypes to increasing levels of fidelity, ranging from proof-of-concept bench-top demonstrations to wearable integrated systems.", "company": "meta", "url": "https://www.metacareers.com/jobs/346285381726013"}