{"title": "Service Delivery & Oversight Lead", "level": "", "location": "Dublin, Ireland", "description": "The People Service Delivery (PSD) team’s mission is to run the best people focused service delivery business in the industry. Leading with care and empathy, we develop efficient processes, systems, and programs. We aim to ensure employees feel heard and have the resources and support they need during the most important moments so they can do the best work of their careers. As part of PSD, the Service Delivery and Oversight team delivers regional, follow-the-sun service monitoring and governance, escalation management, and sensitive case resolution. This team serves as a People Ops central POC collaborating with key cross functional leaders to ensure the health and integrity of our service delivery. The People Service Delivery Lead is an individual contributor responsible for the overall governance, monitoring, delivery and continuous improvement for one or more large functional areas and supporting vendors. The role reviews and influences key health metrics, then seeks to implement efficiency gains within our delivery model. In the service areas this lead oversees, they should be able to independently support operations and strategic initiatives within the Service Delivery and Oversight organization. The lead will need to dig into the details to improve and resolve service delivery gaps and escalations as well as conduct root cause analysis. This role requires you to be able to quickly understand the current state, identify blockers, and work with cross-functional teams to ensure overall service delivery is optimized. This person will need to effectively communicate with various levels of leadership, assess competing needs, and effectively prioritize to meet Service Delivery KPIs. In this role, the lead will proactively contribute to org-wide initiatives such as major HR system changes, work transitions to supplier, etc. The ideal candidate is a problem solver, critical thinker, collaborator, and effective communicator.", "salary": "", "key_qualifications": "7+ years of experience overseeing one or more service delivery functions (onboarding, offboarding, payroll, benefits, transfers, etc). Experience navigating competing/shifting priorities, operating independently, supporting scalable ops and getting things done in a fast-paced, ambiguous environment. Excellent analytical skills enabling performance of root-cause analysis to problem solve and produce measurable outcomes. Strong communication skills, including defining and simplifying complex concepts and communicating these to stakeholders. Experience collaborating, influencing, and gaining strategic alignment within a matrixed environment.", "preferred_qualifications": "Experience providing day-to-day oversight of a supplier/vendor(s). Agile Project/Program Management Qualification. Bachelor's degree in a business, operations, HR, consulting or equivalent experience.", "responsibilities": "Responsible for service governance & monitoring, day-to-day supplier oversight, escalations management, service health and process improvement across one or more large functional areas. Collaborate with Global Service Delivery & Oversight (SDO) Leaders to support the optimization and evolution of our operations through strong partnerships, project/change management, reporting and forecasting. Support project/change management implementation to drive adoption of new processes or changes. Collaborate cross-functionally across People Service Delivery and People@ stakeholders to solve HR ops challenges, while navigating various levels of sensitivity, complexity and ambiguity across a global team. Monitor regional tiered service health and performance via dashboards, reporting, analytics & insights. Recommend solutions to deflect or eliminate case demand. Identify, prioritize, and execute continuous process improvement initiatives that improve overall service delivery. Simplify existing processes and tools through automation and enhancement of our operations to be more efficient, while keeping employee experience as the utmost priority.", "company": "meta", "url": "https://www.metacareers.com/jobs/353444324257569"}