{"title": "Silicon Validation Engineer", "level": "", "location": "Sunnyvale, CA | Redmond, WA | Austin, TX", "description": "The Reality Labs team is building products that make it easier for people to connect with the ones they love most. We are a team of world-class experts developing and shipping products at the intersection of silicon, hardware, software, and content. The Reality Labs team seeks a Silicon Validation Firmware Engineer.\n\nAs a Silicon Validation Firmware Engineer, you will be part of the End-to-end (E2E) System Prototyping and Validation team at RL Silicon. Your work will focus on silicon validation of ARVR chips in an E2E system context.", "salary": "US$95,400/year to US$166,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.\nExperience writing FW flows and custom scripts using C/C++, Python\nSystem debug experience using tools like Lauterbach, gdb, or similar\nKnowledge in chip architecture, µArchitecture, or design verification experience", "preferred_qualifications": "Understanding of modern CPU architecture, memory subsystems, Cache hierarchies, SoC integration flows and UPF based power management\nSolid understanding of SoC architecture and Pre-Si Systems with a track record of enabling full verification cycles of complex SoCs (involving Graphics, CPU and DSP Cores)\nExperience with Hardware Security IPs, Secure Hardware design for Embedded Systems\nUnderstanding of Startup code, Linker Scripts, Assembly code\nPerformance modeling and power analysis experience\nExperience with IO’s such as MIPI CSI & DSI, USB, PCIE, LPDDR\nExperience of dealing with ambiguity in a fast changing consumer electronics field\nExperience working effectively as an individual and in a multidisciplinary team", "responsibilities": "Develop test plans and verification environments for IP/SoC/System-level flows using the Pre-Si systems\nWrite C/C++ applications to verify the SoC model against architectural specifications, able to debug through layers of SW applications to RTL FSDBs\nMap Protocol Checkers, RTL assertions from SoC UVM models to Emulation and FPGA prototypes\nEnable product-level user scenarios on the Pre-Si platforms and generate data for Power & Performance of different IP Blocks\nBring-up and integrate pre-silicon platforms for SW/FW activities\nValidate Cross IP datapaths, support SoC bring-up and Post-Si debug activities\nWork closely with product engineers, algorithm engineers, software engineers, architects and HW designers to enable pre/post-silicon validation content, quickly prototype new end user experiences and features", "company": "meta", "url": "https://www.metacareers.com/jobs/353752174259647"}