{"title": "Data Center Energy Program Manager", "level": "", "location": "Fremont, CA | Remote, US", "description": "Our data centers are the foundation upon which our rapidly scaling infrastructure efficiently operates to deliver our innovative services. Meta is seeking an experienced, organized and self-motivated individual to support the development of cost-effective energy solutions for our growing fleet of data centers.", "salary": "US$126,000/year to US$179,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in business, engineering, environmental, or energy related discipline; 5+ years of relevant work experience with a utility, energy project developer, design/consulting firm, construction firm or energy intensive consumer; Working knowledge of transmission, distribution and utility interconnection processes and electrical infrastructure; Experience with project development and management for complex, large-scale projects; Proven program management skills to manage multiple projects concurrently; Proven communications skills to develop and maintain partnerships with suppliers and stakeholders; Intermediate Excel and PowerPoint and/or Keynote skills.", "preferred_qualifications": "", "responsibilities": "Support the creation and execution of overarching and site-specific energy infrastructure strategies for Facebook’s data centers; Establish and communicate energy requirements to internal and external stakeholders; Lead negotiations for energy infrastructure agreements that align with Meta's project and company requirements and policies, and present recommendations to leadership for approval; Manage project due diligence, site development, construction, commercial agreements and operational processes for energy related matters; Lead communication and deliverables between utility partners, internal stakeholders, and consultants; Build and maintain relationships with internal partners including site selection, strategic engineering, data center design, construction, facility operations, legal and finance; Identify and drive process improvements to optimize project delivery, resulting in significant time and cost savings; Lead and manage various ad-hoc energy initiatives for Meta and its energy program, driving successful outcomes and delivering value to the organization; Ability to travel domestically, as needed (up to 25%).", "company": "meta", "url": "https://www.metacareers.com/jobs/356240660653374"}