{"title": "Visiting Professor, RTP Data Analytics", "level": "", "location": "Menlo Park, CA", "description": "Facebook is seeking a Visiting Professor, RTP Data Analytics to join our Release to Production Engineering (RTP) team. The role will require the application of state-of-the-art data science and machine learning techniques to help improve our cutting edge power and hardware fleet. Our servers and data centers are the foundation upon which our rapidly scaling infrastructure efficiently operates and upon which our innovative services are delivered. We’re looking for someone who can contribute to this effort.\n\nWe are seeking a Visiting Professor to join us. Individuals in this role are expected to be PhD holding professors who have hands-on experience and can collaborate effectively with partner engineering organizations, fellow data scientists and leadership.\n\nThe term length would be at least 6 months and the ideal candidate should already have a deep background in statistical and machine learning techniques.\n\nAs a Visiting Professor, you will need to develop subject matter expertise, build trust with partners, recognize the biggest opportunities, create and drive strategy, and leverage data science methodologies to solve hard problems. In your work, you may provide guidance and coordinate with other data scientists to help achieve the goals in broad areas of operation.", "salary": "US$163,000/year to US$225,000/year + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Ph.D. in Applied Statistics, Computer Engineering, Computer Science, Electrical & Electronics Engineering, Electrical Engineering, Electrical Engineering and Computer Sciences, Electronics Engineering, Machine Learning, or Mathematics and Statistics 3 or more years of experience with AI/ML related research. Troubleshooting and data tooling skills (data analysis, big data, building analytical models, visualizations). Relevant publications in Computer Architecture, High-Performance Computing, Networking Architecture, Reliability and Resilience Conferences.", "preferred_qualifications": "5 or more years of experience with statistical analysis, statistical hypothesis testing, statistical modeling, or statistics. Machine learning/neural network expertise.", "responsibilities": "Proactively create research ideas, experiments, and data analyses to detect and diagnose hardware health/performance issues, focusing on systemic solutions. Interface with internal hardware and software engineers and operations teams to understand system architectures and failure modes. Share insights with stakeholders and software teams to develop architectures to handle server failures based on hardware health data. Develop and deploy machine learning-powered solutions and research directions for hardware sustaining at scale.", "company": "meta", "url": "https://www.metacareers.com/jobs/357151660517008"}