{"title": "UX Research Manager, Enterprise Products (People and Horizontals Pillars)", "level": "", "location": "Fremont, CA", "description": "We are looking for an experienced UXR leader who is passionate about tackling some of our toughest challenges across a broad scope that extends from recruiting, to career growth and performance, to customer care and foundations  (i.e.,  around creation, discovery and consumption of content). We seek to bring next generation products to our internal workflows to drive connection, collaboration, and efficiency at scale.\n\nGetting work done at Meta isn’t simple or straightforward. Metamates spend a disproportionate amount of time on “work around work”, taking away their ability to focus on their core work. Much of this “work around work” has to do with a highly fragmented ecosystem of products that Metamates use every day to manage our careers, our lives outside of our careers, our teams, and to create, gain and share context, find answers, and stay up to date on what's happening at Meta.\n\nFor example, there are 35+ content tools in our ecosystem of products that support creation, organization, distribution and consumption of content (such as Wiki, Knowledge Base, Workplace, Google Docs, Quip and others). A few of EP investments include efforts to make finding the right content effortless through intelligent search and contextualized discovery as well as GenAI solutions to help create, summarize and improve the quality of content that Metamates create.\n\nOn this team we tackle some of the most complex research problems to gain deeper insights into how we attract and grow our talent at scale, with the right products to unlock productivity, collaboration and skill development. We strive to contribute new ideas to products that will impact all metamates and the impact we bring to our X billion customers.\n\nWe are looking for UX Research Manager to lead our People and Horizontals (Care and Foundations) team with research, communication and people management skills to drive critical aspects of our understanding and product strategy.", "salary": "US$192,000/year to US$265,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or significant experience conducting UX research with meaningful business impact, 18+ years of experience conducting and/or studying research post-Bachelor’s degree, 5+ years of experience directly managing, coaching and developing full-time researchers, Experience navigating and supporting teams through high ambiguity and rapid change, Experience directly managing across different research methodologies, Experience directly conducting primary research (either qualitative or quantitative) end-to-end (i.e., designing, fielding, analyzing and reporting out data), Experience building teams over time through hiring, growing, and retaining high-performing researchers, Experience building and setting research strategy that connects with business strategy, Track record of translating research into business impact, Experience working with a variety of cross-functional peers and stakeholders (e.g., product managers, data scientists, designers, engineers, policy, communications, marketing)", "preferred_qualifications": "Graduate degree, Experience with business products, business insights, and product development, 10+ years of UX research experience, Experience working in games or entertainment", "responsibilities": "Independently manage a research team that is large in size and/or complexity. Identify problems and proactively drive solutions. Have a point of view about strategic decisions, using insights from the team. Understand how to influence stakeholders and leaders to implement the best ideas. Become a trusted, strategic partner to product stakeholders by communicating and demonstrating the value of user research, and by delivering insights that lead to demonstrable business value. Communicate clearly and effectively across all organizational levels. Show care and set clear expectations and goals for individuals and the team. Make staffing decisions based on business priorities, both short term and long term, as well as team strengths and motivation. Identify gaps and solutions for future growth and scale within the team or organization, including system, product, function, partnership, culture and/or organization opportunities. Responsible for the quality of the team, including coaching, growing IC's and managers (if applicable) and coaching under-performing team members. Build a diverse and an inclusive environment across the team, model inclusive behaviors, and hold managers accountable. Give clear, actionable feedback on a timely basis.", "company": "meta", "url": "https://www.metacareers.com/jobs/361838166674698"}