{"title": "Product Validation Lead", "level": "", "location": "Sunnyvale, CA", "description": "The Product Validation Team is a key team in the Wearable Product Organization that focuses on end-to-end systems validation from new product introduction, new technology introduction, factory readiness, product launch and post-launch testing. \n\nAs a Product Validation Lead, you will require working closely with a wide range of cross functional partners. Some of those partners include the mechanical engineering design teams, the electrical hardware design team, the broader core technology teams covering sensors, camera, audio, RF, reliability, as well as embedded firmware and device side app based software. This role will require driving unification of key validation metrics across those teams as well as developing testing and validation plans to quantify those metrics.\n\nYou will be managing and driving execution of electrical and system level validation of products under development. To be successful, you will need a breadth of experience across several technologies including IMU, Display, and capacitive touch and engineering domains such as power management, and signal interfaces. You will work on overall product system validation targeting user KPI and performance of subsystems. You will work with cross-functional teams to define test plans, drive test execution and data collection. You should be prepared to be highly motivated, detail oriented and insist on the highest standards.", "salary": "US$129,000/year to US$200,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Computer Science, Software Engineering, Electrical Engineering or equivalent industry experience; 5+ years of work experience in the consumer electronic industry, shipping consumer devices and end to end hardware development and integration; Experience in system development and verification testing methodologies and concepts for wrist-worn devices; Experience in developing test strategies, encompassing the creation of test plans, design of test cases, development of custom tools, and formulation of testing architectures; Experience in debugging and analysis using metrology, system logs, customer feedback or software traces is required", "preferred_qualifications": "Experience working with embedded systems and software, particularly mobile chipsets; Experience in scripting language using Python or MATLAB to automate test data and analysis; Experience with system coexistence issues and key metrics for evaluating system performance; Experience in characterization and metrology experience in one or more of the following technologies: health related sensors, Capacitive Touch systems,  OLED/LED Display technologies", "responsibilities": "Organize validation efforts efficiently and report regular status to the team using internal tools, progress trackers and by driving bugs and fixes to closure; Convert large amounts of data into a clear summary to communicate to stakeholders at all levels; Steer key performance indicators for system performance and comprehensive product validation; Prompt execution of the product and system testing plan, in collaboration with system, program management and cross functional technology teams, to establish priorities and ensure effective implementation; Direct multiple validation teams in the formulation and execution of comprehensive validation plans; Lead and develop validation strategy through all stages consumer product development, from initial design commitment through post-launch issue resolution; Deliver results from one or multiple areas of device testing, including functional and performance testing, new feature and regression testing; Develop and deliver products that integrate hardware, software, and content; Facilitate cross-functional collaboration to design, develop, and implement system tests that rigorously evaluate prototype hardware and ensure product quality.", "company": "meta", "url": "https://www.metacareers.com/jobs/364017883353178"}