{"title": "Operations Program Manager (Core Technologies)", "level": "", "location": "Sunnyvale, CA", "description": "The Operations Program Manager is the Single Threaded Leader (STL) for their core technology modules and is the primary Operations interface to the product development teams and other functional organizations within RL. It is the responsibility of the STL to keep the Core Team integrated with the Operations workstreams.  STLs must have a strong technical understanding of their modules and have the ability to influence key design and architecture decisions in order to meet Operations KPIs.  The STL owns their program from early architecture through launch. This role requires close collaboration with R&D, Engineering, Advanced Manufacturing and Test, Business Development, Sourcing, and external supplier teams.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "5+ years experience managing supplier technical operations; Broad understanding of optical and mechanical technologies, and demonstrated experience with deployment of manufacturing processes to support complex technologies; Experience working on New Technology Introduction (NTI); Data-driven problem solving skills to address multi-dimensional problems with high levels of uncertainty across multiple functional teams; Interpersonal skills with experience communicating and influencing senior leadership; Experience with defining and implementing systems/tools and mechanisms to bridge integration mechanics  between internal and external partners", "preferred_qualifications": "7+ years experience managing supplier technical operations in consumer electronics industry; Experience working on New Technology Introduction (NTI) with successful transition into New Product Introduction (NPI) phase and scaling at production; Semiconductor Processing and Clean room experience", "responsibilities": "Accountable for end to end manufacturing operations at suppliers to execute development builds per schedule, leading up to ramp and into mass production; Establish the appropriate engagement model and define roles and responsibilities between supplier and internal cross functional teams; Drive supplier readiness activities to execute development builds leading up to ramp, including design and layout of manufacturing lines, development of process qualifications plans, and defining capacity and capex requirements, clearly identifying deliverables and dependencies; Drive Operations teams to ensure materials, equipment, fixtures, systems, staffing, security, training and documentation plans are in place at our manufacturing partners; Establish and lead on-site bring-up and integration activities, coordinating with both internal and external resources; Lead ramp availability with GSM, Manufacturing and Test, Quality, and other internal and external teams; Ensure the successful launch of products towards meeting its stated cost, quality, schedule, and availability goals; Assesses, analyzes, consolidates, and communicates risk and status clearly and succinctly to management, calling out key issues and presenting options for resolution to the cross-functional  executive team through the new product reviews and other executive forums; Actively participate in Engineering design and technology development discussions, providing focus and direction to deliver scalable manufacturing solutions. Be the Operations owner for the partner’s decisions around equipment, tooling and fixture sub suppliers; Provides links from the US based Operations & Engineering Teams to the Manufacturing Partners from various development builds through new product introduction; Liaison across multiple cross-functional teams to ensure product cost, manufacturability, reliability, product quality, safety and compliance, and delivery commitments are met; Lead program readiness reviews representing supplier technical operations and overall readiness, and drive closure on design/technical and operations issues; Ability to travel at least 35% on-site to suppliers during critical bring-up and build activities.", "company": "meta", "url": "https://www.metacareers.com/jobs/365022256543395"}