{"title": "Revenue Accounting Manager", "level": "", "location": "Dublin, Ireland", "description": "Meta is seeking a Revenue Accounting Manager to support their EMEA finance team, located in our Dublin office. The ideal candidate would have previous experience in a global tech organisation, ideally in the area of Revenue Recognition/ OTC Billing field who can work well with internal and external stakeholders at all levels. They will be expected to problem solve, recommend solutions, and exercise good business judgment while performing their function. This is a full-time position reporting to the Revenue Accounting Manager, based in our Dublin office.", "salary": "", "key_qualifications": "5+ years of experience working as an accountant or related field; Knowledge of US GAAP, particularly ASC606; Previous experience with commonly used accounting software and related technologies including Excel; Previous experience analyzing processes and implementing scalable automated solutions considering risk mitigation and strong control environments; Previous experience working in an environment where an emphasis on continuous improvement and and attention to detail was expected", "preferred_qualifications": "Recognized accounting qualification preferred (ACA, CIMA, ACCA, CPA or equivalent); Experience with large multi-national organizations; Knowledge of local GAAP and SOX", "responsibilities": "Manage multiple aspects of revenue accounting for established business initiatives including preparation and review of journals and reconciliations within monthly close deadlines; Develop and maintain strong cross-functional relationships with business and engineering partners to support the business area of responsibility; Partner with cross functional teams to automate, improve, and/or outsource global processes; Ensure compliance with key controls and audit requirements including close coordination with both external and internal auditors; Drive process efficiencies within the team", "company": "meta", "url": "https://www.metacareers.com/jobs/365722359672122"}