{"title": "Product Marketing Manager, Business Experiences", "level": "", "location": "Menlo Park, CA", "description": "At Meta, we make advertising meaningful for everyone: for people, and for the 7 million businesses who use our platform to connect with people across the Meta family of apps. We build tools that empower our advertisers and internal sales and marketing teams to help them drive economic value at scale. We're looking for an experienced leader who is passionate about technology, innovation and advertising to join our Product Marketing Team and shape and grow these types of internal and external tools. The Product Marketing Manager will be responsible for driving product requirements gathering, executing internal product launches and driving adoption across the tooling and interfaces our internal teams and external advertisers use. Must have a proven track record demonstrating strong analytical skills, strategic thinking, and decision making under uncertainty. He or she must thrive with cross-functional teams and exhibit excellent analytical and communication skills.", "salary": "US$158,000/year to US$223,000/year + bonus + equity + benefits", "key_qualifications": "BA/BS degree; 8+ years relevant work experience, with at least 2 years experience working in a product marketing or product management capacity (working with sales and or engineering leadership); Quantitative analytical experience and communication skills; Demonstrated problem solving skills with experience providing business insights and recommendations from multiple input sources (e.g. data sets, interview feedback, research)", "preferred_qualifications": "Master’s degree; Demonstrated cross-functional leadership within a dynamic, rapidly changing environment; Background in online marketing, ad operations, analytics, customer relationship management, and/or strategy consulting", "responsibilities": "Lead market assessment, quantitative analysis, qualitative feedback, and represent the requirements of the market internally with Product Management and Engineering; Demonstrate a strong understanding of the broader Facebook ecosystem to develop strategic product direction and positioning; Lead market segmentation and opportunity assessment efforts to prioritize product opportunities for helping Facebook sales and marketing teams work more efficiently and effectively serve client needs; Plan and lead cross-functional efforts to drive successful product beta programs and launches; Drive product adoption and usage by developing and managing detailed, long-term adoption plans; Partner effectively with Product Management and all sales channels to create world-class product marketing communications, including all sales-facing materials and training", "company": "meta", "url": "https://www.metacareers.com/jobs/366925175980583"}