{"title": "Client Partner", "level": "", "location": "Mexico City, Mexico", "description": "Meta (formerly the Facebook company) is seeking an experienced sales and marketing professional to help build and sell Meta’s advertising solutions to large online advertisers. You’ll contribute to a high-caliber team in a business that is experiencing rapid and dramatic growth. We are looking for a sales professional with flexibility, management experience and outstanding decision-making skills, and you're able to use quantitative abilities to make effective, strategic decisions. This role will require a self-starter who has also demonstrated previous solid performance and work in a constantly changing environment, dealing with ambiguity, and demonstrate problem-solving leadership with limited oversight. Ideal candidates will have experience in a sales environment as well as extensive experience selling cross-network online marketing solutions such as integrated sponsorships and display advertising. This role will be located in our Mexico City office.", "salary": "", "key_qualifications": "5+ years of Marketing, Brand and Performance Advertising, Media Sales. 5+ years managing client accounts - sales. Knowledge of social media, reseller channels and vertical markets a plus. Ability to win the support of key stakeholders. Relationships with top marketing decision makers at traditional companies and agencies. Proven track record of reaching and exceeding sales revenue goals. Demonstrated success as a leader of change, achieving operational excellence by introducing new performance measures, processes and systems. Understanding of user behavior and how technology works and the ability to explain each in ordinary terms. BA or BS degree. Advanced English. Fluency in Spanish and English are required.", "preferred_qualifications": "", "responsibilities": "Help define Meta's overall approach and focus within the Industry. Identify and prioritize business opportunities. Partner with other vertical teams on structuring and executing operational and strategic initiatives - developing work plans, synthesizing market related data, leading analysis and defining the overall business approach to Meta’s success in the Vertical. Increase the effectiveness of the team by recognizing opportunities for new approaches. Develop and implement best practices for client interaction, sales and services for Meta, including a good understanding of working with advertisers and agencies. Prospect and penetrate large organizations to obtain branded and performance advertising. Develop metrics to measure the growth and performance of the sales team, and provide reports as needed. Create persuasive sales presentations using market trends, case studies and Meta network solutions. Analyze campaign performance statistics and recommend optimized media solutions. Exceed sales, pricing and yield goals for yourself and your team. Ensure that our clients receive the highest level of sales and operational customer service. Have a deep understanding of the Advertising Ecosystem in Mexico.", "company": "meta", "url": "https://www.metacareers.com/jobs/367200482519159"}