{"title": "Category Sales Manager - Metaverse Digital Content", "level": "", "location": "Seattle, WA | Burlingame, CA", "description": "Are you a strategic thinker with a passion for driving business growth? Do you have experience in category management and sales performance optimization? If so, we have an exciting opportunity for you to join our team as a Category Manager supporting the Metaverse Business Group.\n\nThe Category Manager will be responsible for managing the strategy and sales velocity for digital content and products in the metaverse, including digital gift cards. This role involves a blend of strategic planning, market analysis, and cross-functional collaboration to drive product adoption and sales performance. \n\nThis role is pivotal in driving the strategic direction and operational execution for digital content and products in the metaverse, ensuring that the company remains competitive and responsive to market and customer needs.\n\nIn this role, you will be responsible for creating go-to channel plans, managing sales performance and growth, and providing direction for future investments related to driving sales velocity. You will also have the opportunity to work with a diverse range of stakeholders, including product marketing managers, sales leaders, and channel partners, to drive business results and achieve our goals.\n\nIf you are a results-driven professional with a track record of success in category management and sales performance optimization, we encourage you to apply for this exciting opportunity. Join us and help shape the future of the metaverse!", "salary": "US$150,000/year to US$211,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Business, Marketing, or related field. Experience in category management, sales strategy, or a related field within digital content and products. Experience with consumer research and proficiently using data and insights to inform product, Go-To-Market and Go-to-Channel strategy. Experience collaborating, and working in a cross-functional environment. Analytical skills and experience with market research and data analysis. Experience in conducting path to purchase, sales competitive analysis and identifying opportunities for differentiation. Experience developing sales strategies and evaluate sales opportunities that help develop and grow the category. Experience presenting, and influencing and persuading stakeholders. Experience working independently and adapting in a fast-paced, entrepreneurial, ambiguous and fluid environment, identifying and escalating issues early and often.", "preferred_qualifications": "10+ years of professional experience in consumer facing industry. Experience in consumer electronics with a demonstrated interest in new and emerging tech. Knowledge of the metaverse, digital gift cards, and related digital products. Master's Degree in Business, Marketing or related field.", "responsibilities": "Strategy Development and Execution: Develop and implement go-to-channel (GTC) strategies to enhance product sales, including conducting path-to-purchase analysis, understanding customer behavior, identifying key touchpoints, and optimizing the customer journey. Sales and Launch Readiness: Align and define annual and lifetime sales goals across various channels, ensuring all necessary resources and capabilities are in place. Customer and Market Insights: Develop and execute strategies for managing customer feedback, ensuring that customer needs are met and feedback is incorporated into product development. Cross-functional Collaboration: Work closely with global and regional sales leaders to develop and execute sales plans, ensuring effective communication and collaboration with cross-functional teams. Regional and Global Alignment: Develop and implement regional sales strategies that align with the global category plan. Compliance and Optimization: Ensure compliance with local regulations and laws that enable sales in the region.", "company": "meta", "url": "https://www.metacareers.com/jobs/367366249791789"}