{"title": "Fundamental AI Research Scientist, FAIR (PhD)", "level": "", "location": "Paris, France", "description": "Meta is seeking a Research Scientist to join the Fundamental AI Research (FAIR) team, a research organization focused on advancing the state-of-the-art in AI. Individuals in this role are expected to be recognized experts in identified research areas such as artificial intelligence, machine learning, computational statistics, and applied mathematics, particularly including topics such as deep learning, natural language processing, speech and vision,  multimodality, multilinguality, representation learning,  AI safety, foundations of generative modeling, and social implications of AI. The ideal candidate will have a keen interest in producing new science to understand intelligence and technology towards achieving advanced machine intelligence.", "salary": "", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree in the field of Computer Science, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Research background in machine learning, artificial intelligence, computational statistics, applied mathematics, or related areas. Research publications reflecting experience in theoretical or empirical research. Experience in developing and debugging in Python or similar programming languages. Experience in analyzing and collecting data from various sources. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Research and engineering experience demonstrated via grants, fellowships, patents, internships, work experience, and/or coding competitions. First-authored publications at peer-reviewed conferences, such as ICML, NeuRIPS, ACL, EMNLP, ICLR, FacCT, CCS, IEEE S&P, and other similar venues. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience collaborating in a team environment on research projects. Experience communicating research for public audiences of peers.", "responsibilities": "Perform research to advance the science and technology of intelligent machines. Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities). Work towards long-term ambitious research goals, while identifying immediate milestones. Influence progress of relevant research communities by producing publications. Open source high quality code and produce reproducible research.", "company": "meta", "url": "https://www.metacareers.com/jobs/371308916064554"}