{"title": "Network Production Engineer - Backbone", "level": "", "location": "Menlo Park, CA | Seattle, WA", "description": "You will be joining the team that is responsible for the end-to-end health (performance and reliability) of Meta's backbone networks. You will build tools and use automation to efficiently scale how we mitigate real-time impact to the network, identify and investigate long-term trends into performance and risks in our backbone, and drive innovative solutions to monitor and improve Meta's current and future backbone network products.", "salary": "US$105,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. 4+ years experience coding in higher-level languages (e.g., Python, C++, Go, etc.) 2+ years experience in one or more of BGP, MPLS, ISIS or similar routing protocols - knowledge in typical configurations and performance tuning 2+ years experience understanding and mitigating network hardware and topology failures Experience in configuration and maintenance of network devices and NMS systems, or applications such as web servers, load balancers, relational databases, storage systems and messaging systems Experience learning software, frameworks and APIs Experience developing and understanding network device configuration for at least one vendor (Juniper, Cisco, Arista, Brocade, etc.) Knowledge in routing and switching - hardware design and knowledge of forwarding and data planes", "preferred_qualifications": "BS or MS in Computer Science, Computer Engineering, or Network Engineering. Expert knowledge of TCP/IP and IPv6. Experience operating and designing SDN-based backbone networks. Experience working in a multi-vendor network environment. Experience with developing distributed systems and operating them at scale. Experience with automation frameworks and tools such as Ansible, Puppet, or Chef.", "responsibilities": "Write and review code, develop documentation and capacity plans, and debug the hardest problems, live, on some of the largest and most complex networks and systems in the world Participate in a weekly on-call rotation and be an escalation contact for service incidents Perform deep dives on complex technical issues across networks, ranging from automated tooling to hardware failures and network issues Manage and maintain multi-vendor, multi-protocol backbone and edge networks Analyze data to diagnose and identify root causes to network issues Define, develop, and optimize automated network monitoring systems to mitigate and remediate network events Proactively identify gaps across our systems and own the resolution", "company": "meta", "url": "https://www.metacareers.com/jobs/372257448602144"}