{"title": "GenAI Content Manager", "level": "", "location": "Bellevue, WA", "description": "The GenAI Content team is looking for an experienced person to improve the data quality leveraged across the GenAI org. This person will leverage deep expertise in different content types to improve our models and FoA integration leveraging GenAI technology. The work will include helping to set the quality bar for our models and scaling that quality across multimodalities. They will ensure that work is integrated across the company’s GenAI initiatives and help connect the research and platform work with content-focused product initiatives across the GenAI org. Candidates should have a proven track record of holding a high quality bar and creatively scaling that across different content types and teams. Strong collaboration and communication skills are essential given the nature of the company's work in the space.\n\nGenAI Content is a horizontal function supporting initiatives across the broader GenAI Org and is seeking an experienced content manager to join the team.\n\nGenAI Content supports products through quality control, prompt engineering, fine tuning and creative execution. The team is comprised of content experts with diverse backgrounds in journalism, social media, creative storytelling, writing, editing, visual arts, film & TV production and more. Content Managers partner closely with technical teams to prompt engineer, build and ship products from lab to production, across different modalities and mediums. They serve as a point of contact for internal stakeholders working across AI on priority product initiatives, and aim to build products and creative tools that entertain, inform and delight.\n\nCandidates should have a proven track record of holding a high quality bar and creatively scaling that across different content types and teams. Strong collaboration and communication skills are essential given the nature of the company's work in the space.\n\nThe ideal candidate will have strong editorial judgment and a keen eye for crafting thorough, nuanced and objective guidelines that establish and measure content quality. They will also have creative skills to build products like AI Agents, editing and fact-checking skills to fine tune foundational models, visual expertise to assess image and video generations, and strategic product thinking to put user needs at the forefront of our work.\n\nIf you’re innately curious about the future of generative artificial intelligence, fascinated by new developments in research and product development, take pride in identifying efficiencies in process and operations and motivated by ambiguity, we encourage you to apply.", "salary": "US$189,000/year to US$258,000/year + bonus + equity + benefits", "key_qualifications": "10+ years as a leader in the media and/or technology space. Track record of leading or guiding product development, at every stage. Experience communicating to different stakeholders at the highest levels. Experience working collaboratively across disciplines and time zones.", "preferred_qualifications": "Experience with AI prompt engineering, annotation and/or within an AI product team. Experience contributing to major company initiatives/work that moves quickly.", "responsibilities": "Improving the quality of the team's work across multimodalities, including text, image, video and speech. Leading through influence and collaboration within the GenAI Content team and relevant stakeholders. Finding content-oriented solutions for some of the biggest GenAI challenges, and rallying the team and stakeholders around those solutions.", "company": "meta", "url": "https://www.metacareers.com/jobs/372805488523871"}