{"title": "Lead Software Engineer - Computer Vision, Synthetic Image Generation", "level": "", "location": "Redmond, WA | Burlingame, CA", "description": "Meta Reality Labs is looking for a lead computer vision engineer to drive synthetic data generation and simulation for our AR/VR products including the Quest line. This role will contribute to the creation of next-gen AR/VR interaction technologies in a cross-functional team of software, infra, computer vision, machine learning, simulation, and AI image generation engineers. This role leverages expertise in computer vision, synthetic data, and AI-based image generation to contribute to ML models shipped in Meta AR/VR products. This role collaborates with cross-functional teams on image simulation, core AI, computer graphics, machine vision research, HW design.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Proven technical background in one or more of the following areas: Machine Learning, Deep Learning, Neural Networks, Image Processing, Computer Vision, Image Synthesis, Generative AI. Experience in developing computer vision algorithms and deep learning models in Pytorch, Tensorflow and similar platforms. Working knowledge of synthetic image generation using deep generative models, computer graphics, or physics-based simulation. 5+ years of technical leadership experience driving medium to large-scale cross-functional R&D projects focused on machine learning and computer vision. Proven programming skills in Python and C/C++. Experience with distributed computing and large-scale data processing. Problem-solving and interpersonal skills and experience to lead technical projects independently. Proven communication and collaboration skills.", "preferred_qualifications": "Ph.D. in Computer Science, Electrical Engineering, Data Science, or equivalent field. Publication track record in image generation and computer vision in top conferences including CVPR, NeurIPS, ICCV, ICML, etc. Experience in computer graphics, procedural generation, and avatar rendering. Experience in classical image processing and pose estimation. Work experience in AR/VR industry.", "responsibilities": "Tech lead for development and launch of CV/ML solutions for generating and synthesizing images used in training of AR/VR models and system design. Drive cross-functional collaborations with partner teams including but not limited to RL research, simulation, data systems, CoreAI, and GenAI. Hands-on contribution to synthetic image generation using deep generative models, computer graphics, or physics-based simulation. Explore, innovate, and leverage novel technologies, from internal and external publications, to improve the realism, diversity, controllability, and generalizability of image synthesis including techniques to enhance appearance and geometric realism. Co-own strategic planning, OKR setting, and roadmap generation for synthetic data sub-team. Co-create roadmap and vision for R&D initiatives. Contribute to recruitment, mentoring, onboarding, and growing ML engineers/scientist, interns, and contractors. Work with RL leadership and cross-functional teams to understand business requirements and translate them into machine learning projects. Optimize machine learning models for performance, scalability, and maintainability.", "company": "meta", "url": "https://www.metacareers.com/jobs/375116722007611"}