{"title": "User Studies Program Manager", "level": "", "location": "Redmond, WA", "description": "We are seeking an experienced Program Manager to lead the execution of user studies for the Reality Labs Audio Research team. The successful candidate will play a pivotal role in study planning and execution by interfacing with research scientists and user experience researchers to prioritize, design, and ensure the seamless execution of user studies aimed at enhancing our audio technologies. This role involves managing a diverse team, including Research Assistants and a Study Coordinator. This is an opportunity to work in a collaborative environment with a dedicated and passionate team, and support innovative research that impacts real-world applications.", "salary": "US$94,000/year to US$136,000/year + bonus + equity + benefits", "key_qualifications": "Proven experience in managing human subjects research studies or complex projects in a research or academic setting (e.g., as a lab manager). Leadership skills with experience managing multidisciplinary teams. Proven organizational, communication, and interpersonal skills. Knowledge of IRB regulations and privacy laws relevant to human subjects research. Experience in prioritizing tasks, manage multiple projects simultaneously, and meet deadlines. Bachelor’s or Master’s degree in Business Administration, Psychology, or a related field.", "preferred_qualifications": "", "responsibilities": "Study Planning and Management: Coordinate with research scientists to understand study requirements and establish priorities. Oversee the user study design process and ensure alignment with project goals. Team Leadership: Manage a team of Research Assistants and a Study Coordinator. Ensure effective allocation of team resources across various projects. Regulatory Compliance and Approvals: Lead the process for study review and approval, including external IRB (Institutional Review Board) compliance, to uphold ethical standards and privacy regulations. Training and Development: Develop comprehensive training programs for RAs, including specialization in specific study types, to enhance skills and ensure high-quality research output. Collaboration and Communication: Facilitate communication between team members and research scientists to ensure clarity of goals and methodologies. Address and resolve any issues that impact team performance or study progression. Collaborate with the broader Reality Labs Research organization to implement improvements and cover gaps. Lab Environment Organization: Coordinate the availability and usage of lab sites with stakeholders and operations. Ensure spaces and equipment are available and setup timelines are feasible to execute studies. Monitoring and Reporting: Track the progress of user studies, report on milestones and challenges, and adjust project timelines and strategies as necessary. Generate operational metrics and implement reporting as well as procedural improvements based on analysis. Promoting Team Health: Foster a positive team environment that encourages professional growth and supports the overall health and well-being of team members.", "company": "meta", "url": "https://www.metacareers.com/jobs/376526092102657"}