{"title": "Privacy Engineer, Implementation Review", "level": "", "location": "Seattle, WA", "description": "Meta's Privacy Engineering organization is seeking a passionate engineer to identify, advise, investigate and mitigate privacy violations and/or exposures in our products. Your skills will be the foundation for understanding privacy risks in Meta initiatives by being the technical advocate for privacy decisions and discussions across the company. You will be relied upon to provide engineering and product teams with the privacy expertise necessary to make confident product decisions.", "salary": "US$105,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "2+ years work experience in a role coding in Python, PHP, Java, C/C++ (or equivalent language) including code maintenance and review. 3+ years Application Security experience (conducting security reviews) or 2+ years privacy experience with GDPR or CCPA implementation.", "preferred_qualifications": "Experience making contributions to the security or privacy community (public research, blogging, presentations, etc.) Experience within a corporate environment communicating technical issues and their implications to other areas of the business. B.S. or M.S. in Computer Science.", "responsibilities": "Play a key role in driving code and architecture reviews as well as large cross-company privacy reviews of products and features. Conduct technical reviews for new features and identify privacy concerns. Work closely with technical and non-technical teams, including Engineering, Product and Legal. Provide product teams with the guidance and best practices to help protect users privacy and mitigate any risk. Work closely with Security and Privacy leaders to help define goals that are properly aligned to company-wide goals. Define and articulate a clear vision for privacy, and influence leaders across all of Facebook to adopt a balanced view of product and privacy goals in overall decision-making.", "company": "meta", "url": "https://www.metacareers.com/jobs/377018341524298"}