{"title": "Postdoctoral Researcher, FAIR", "level": "", "location": "Pittsburgh, PA | Menlo Park, CA | Seattle, WA | New York, NY | San Francisco, CA", "description": "Meta is seeking a Postdoctoral Researcher to join Fundamental AI Research (FAIR), a research organization focused on making significant progress in AI. Individuals in this role are expected to be recognized experts in identified research areas such as speech, multimodality, artificial intelligence and machine learning. The ideal candidate should have a keen interest in producing new, open science to further advance multimodal language modeling research. Postdoctoral positions are one to two year fixed-term positions.", "salary": "US$117,000/year to US$173,000/year + benefits", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree in the field of Artificial Intelligence, Speech, Multimodality, Natural Language Processing, a related field, or equivalent practical experience. Degree must be completed prior to joining Meta. Experience in deep learning frameworks (such as PyTorch, TensorFlow), C, C++, Python. Experience in AI frameworks like Hugging Face or other systems. Experience in training and use of language models and Transformers. Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as publications at leading AI conferences (NeurIPS, ICML, ICLR), Speech (Interspeech, ICASSP) and NLP (ACL, NAACL, EMNLP). Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.", "preferred_qualifications": "Demonstrated research and software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub). Experience building systems based on machine learning and/or deep learning methods. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment. Research experience in machine learning, representation learning, optimization, statistics, applied mathematics, or data science.", "responsibilities": "Perform research to push the scientific and technological frontiers of multimodal language modeling. Invent/improve novel data-driven paradigms for multimodal generation. Enable reasoning with multimodal understanding and generation systems. Develop the next generation of platforms for AI & multimodal research.", "company": "meta", "url": "https://www.metacareers.com/jobs/380024285008047"}