{"title": "Director, Research Infrastructure", "level": "", "location": "Bellevue, WA | Menlo Park, CA | Seattle, WA | San Francisco, CA", "description": "Our UX Research team is positioned to define the path in how people work at Meta, which requires us to deeply understand the behaviors and outcomes of the product experiences we build within Meta’s Infrastructure. Meta UX researchers tackle some of the most complex challenges to gain deeper insights into how people interact with each other, the tools and products that power the company to connect the world as well as work collaboratively to contribute new ideas to products that impact the experiences of billions of people on a global scale. We employ a variety of qualitative and quantitative methods to accomplish our goals, including surveys, focus groups, foundational & field studies, usability tests, and 1:1 interviews. We value a diverse range of perspectives and stem from many different backgrounds— geographically, culturally, educationally, philosophically. We come from industry and academia, with roots in anthropology, design research, economics, HCI, human factors, market research, political science, sociology, social computing, and social psychology, among others. Meta is looking for an experienced research leader with seasoned research, communication and people management skills. The successful candidate has a proven track record of translating research into product decisions. It's not enough to answer interesting questions about user behavior; our team focuses on impact. You will oversee a team of world-class researchers across multiple research disciplines. The successful candidate must be an expert researcher who can generate and socialize insights that impact the strategy and product roadmaps of complex and diverse products. The role also requires a proven track record of building and managing high-performing teams, preferably with researchers of different disciplines. Candidates must be able to articulate the vision of the team to cross-functional partners and be a strong advocate for the role of research in product development. We enable building better infrastructure and world class tooling, to unlock, deliver, and maintain state-of-the-art Developer, Data and AI tools. In service of this vision we partner with countless cross-functional partners across dozens of tools, services and frameworks. It’s our role as designers and researchers to ensure the solutions we create are deeply thoughtful, human and responsible. As a research leader this means leveraging your craft and skills as a proven leader to lead an organization of researchers who can produce insights that teams can take action on; and stories that our range of partners can comprehend. We take extra care and attention into our research methods, research execution, and synthesis - because in the end, these insights guide action that support our bottom line and impact billions of users lives.", "salary": "US$239,000/year to US$308,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or significant experience conducting UX research with meaningful business impact; 18+ years of experience conducting and/or studying research post-Bachelor’s degree; 8+ years directly managing, coaching and developing full-time researchers; 5+ years experience managing managers; Have directly managed across different research methodologies; Experience directly conducting primary research (either qualitative or quantitative) end-to-end (i.e., designing, fielding, analyzing and reporting out data); Experience building teams over time through hiring, growing, and retaining high-performing researchers; Experience building and setting research strategy that connects with business strategy; Track record of translating research into business impact; Experience working with a variety of cross-functional peers and stakeholders (e.g., product managers, data scientists, designers, engineers, policy, communications, marketing).", "preferred_qualifications": "Graduate degree; Experience with consumer products, consumer insights, or product development; 5+ years of UX research experience; An understanding of developer tooling and the software development process; AI/ML foundational knowledge, both in tooling and model management.", "responsibilities": "Manage a research area with broad scope in size and complexity; Manage multiple research managers and ICs across multiple broad initiatives; Identify ways to elevate and uplevel Research with product leadership; Influence and drive strategy; calls out risks and opportunities across multiple teams; Consider factors beyond your immediate team to innovate, take appropriate risks, and balance short, medium, and long-term needs; Identify gaps and solutions for future growth and scale within the org, including system, product, function, partnership, culture and/or organization opportunities; Responsible for the quality of the team, including coaching, growing ICs and managers and addressing under-performance; Responsible for developing a cohesive and strong leadership team of managers; Be a role model for inclusive behaviors and build a diverse organization that values, respects and taps into different backgrounds and perspectives; Understands org health (engagement, retention, feedback); effectively diagnose and make recommendations to solve complex issues that may span multiple teams; Communicate team purpose, contribution, and how it fits in with the broader mission of the company; Make the company better through engaging in cross-company efforts like recruiting, XFNs, diversity & inclusion, or site initiatives; Actively recruit and close top tier talent to fill strategic open positions for both IC and management roles beyond your immediate organization; Drive team execution, culture, and process across the FB research community, broader FB community and/or externally; Form internal partnerships, influence, resolve conflict, build alignment, and work effectively across teams and disciplines throughout the company to execute the strategy; Proactively identify the largest problems impacting your team's execution and effectively resolve and manage dependencies; Identify relevant metrics and track trends to report progress relative to goals. (E.g., team health, research impact, product goals)", "company": "meta", "url": "https://www.metacareers.com/jobs/388028336989888"}