{"title": "Application Manager, Identity & Access Management", "level": "", "location": "Austin, TX", "description": "Facebook’s Business Applications team is responsible for building integrated, scalable, and robust enterprise applications. We are currently looking for an experienced, insightful, forward-thinking Product Specialist with a strong ability to design and execute third-party products that power the enterprise. As a member of Enterprise Engineering, you will play a key role in reimagining productivity by shipping transformative products that serve diverse aspects of the enterprise.", "salary": "US$140,000/year to US$195,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience contributing to IAM applications design; 7+ years of experience in building/supporting IAM tools; Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Bachelors Degree in Computer Science; Experience with Okta, Sailpoint, Workday and Active Directory; 4+ years working on data models with hands-on SQL experience to draft queries and perform data analysis; Experience in understanding code bases, including API design techniques and Python.", "responsibilities": "Communicate effectively with internal customers, enabling informed decision making within the team; Identify risks within the business function, deliver clear documentation, and work directly with vendor support for escalations; Analyze issues of complexity, addressing configuration, implementation, and function or process fails; Lead/Support all business readiness activities including end user training, product testing and roll-outs; Participate in source control and code review process; Develop and maintain a well-coordinated internal relationship with key decision makers and with the wider Enterprise Engineering organization; Track key application metrics, drive insights and builds dashboards to measure results against goals; Support and provide subject matter expertise with Identity & Access Management (IAM) processes and tools; Triage and disposition production support tickets effectively, accurately and efficiently; Responsible for application support and configuration of multiple tools/applications in the IAM space; Influence enhancements and new projects to improve the IAM processes, products and end-user experience; Understand application data models, draft SQL queries and perform data analysis to discover and fix underlying causes of bugs; Draft process extensions to support business needs.", "company": "meta", "url": "https://www.metacareers.com/jobs/391148213884957"}