{"title": "Employee Relations Business Partner", "level": "", "location": "Austin, TX, Menlo Park, CA, Seattle, WA, New York, NY", "description": "The Meta Global Employee Relations team is a trusted partner to the very core of our business, our People. At Meta Global Employee Relations, we redefine the individual experience with empathy, inclusion and respect.  We are truly there in the moments that matter.\n\nIf you are an Employee Relations expert with deep experience in coaching, handling complex performance and complaint casework, and you have a passion for finding creative solutions to enhance processes along the way, then you'll thrive in our fast paced and collaborative environment.  Join a world-class team of employee relations professionals with a knack for problem solving, risk assessment and care in handling interpersonal and other employee relations matters to ensure fair, objective and consistent outcomes. Partner both hands-on and strategically with critical cross functional partners, people managers and employees through performance management and workplace conflict issues to cultivate an innovative, high-performing, and inclusive culture.  At Meta Employee Relations, we take pride in continuing to enhance the individual experience through everyday interactions but also in continuing to bring creative and effective ideas and solutions at a global scale. Join us!", "salary": "US$143,000/year to US$205,000/year + bonus + equity + benefits", "key_qualifications": "8+ years experience in an Employee Relations, HR Business Partner or equivalent role. Demonstrates solid judgment and experience assessing risk relative to the business. Effective communication and critical thinking skills. Demonstrates empathy and experience driving inclusion work. Demonstrates project management and change management experience. Demonstrated experience learning and thriving in a constantly changing environment and to cultivate relationships across teams. Experience using data to identify insights that drive action. Experience helping global and/or matrixed organizations scale. Demonstrated experience in influencing and strategically solve problems. Consulting, coaching and facilitation skills. Proven experience leading, growing, and scaling experienced HR professionals.", "preferred_qualifications": "BA/BS degree", "responsibilities": "Design and deliver targeted solutions with a high degree of focus on scale and growth, including conflict resolution and mediation, strategic planning on people policies and processes and change management. Provide strategic Employee Relations support, business partnership, thought partnership, and coaching to all levels of the organization. Proactively assess team and manager development needs, make recommendations, and implement appropriate solutions. Triage employee relations casework, identifies potential solutions to address different case types and actions appropriately using guidelines. Provide rigorous data analysis and reporting solutions based on business needs, highlighting key trends in employee relations to actively drive proactive solutions to minimize reactive work. Help balance risk, taking into account employee, business and company perspectives. Help design and facilitate Manager Training based on data analysis. Integrate and partner with HR colleagues in the HR Business Partner, Legal, Investigations, Learning & Development, and HR Programs teams to implement solutions and help scale the business. Partner closely with regional HR partners on global strategy and execution. Plan, execute, and evaluates complex assignments that have an impact in region or with the clients supported. Participate and lead projects as an integral member of the extended HR community and influence others within the organization. Build collaborative and productive working relationships. Lead with integrity, respect, high personal standards and build personal credibility. Builds internal community (e.g. supports others, shows respect, acts as an ally, onboards new hires, connects people, collaborates well, drives inclusion). Actively involved in interviewing and on-boarding new employees.", "company": "meta", "url": "https://www.metacareers.com/jobs/393630923218715"}