{"title": "Content Designer", "level": "", "location": "Menlo Park, CA", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.", "salary": "US$140,769/year to US$159,720/year + bonus + equity + benefits", "key_qualifications": "Requires a Bachelor’s degree (3 or 4-year Bachelor’s degree accepted) in Content Design, Journalism, Communications, or a related field and 24 months of experience in the job offered or related occupation. Alternatively, employer will accept 60 months of professional experience in the job offered or a related occupation in lieu of a Bachelor's degree and 24 months of experience. Requires 24 months of experience in the following skills: User experience writing, Product and systems planning, Figma and Sketch design software, Basic programming using Java and HTML, User experience research, Research data analysis, Data metrics analysis, Waterfall project management, Agile project management, Adobe Creative Suite including Dreamweaver, InDesign, Photoshop.", "preferred_qualifications": "", "responsibilities": "Plan, write, edit, test, and improve content including interface language, product education materials, product names, navigational nomenclature, and other content throughout Meta’s experiences. Apply and maintain consistency with content standards, and evolve Meta’s voice. Collaborate with designers, researchers, product managers, product marketers, and engineers to serve a global content audience. Contribute to the creation, execution, and measurement of web and mobile interfaces. Work with technical staff to make products and content easier to use. Manage the content strategy implementation, community management, analytics, and measurement throughout Meta. Interpret social and digital trends into understandings that drive the most efficient and engaging strategies.", "company": "meta", "url": "https://www.metacareers.com/jobs/393923169903000"}