{"title": "Employee Relations Data Analyst", "level": "", "location": "Menlo Park, CA", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. To apply, click “Apply to Job” online on this web page.", "salary": "US$184,526/year to US$203,280/year + bonus + equity + benefits", "key_qualifications": "Requires a Master’s degree in Business Analytics, Project Management, Computer Science, Social Sciences, Physical Sciences, Math, Engineering, Statistics, or related field and two years of experience in the job offered or in a data analytics-related occupation. Requires two years of experience in the following: 1. SQL 2. Tableau 3. Building and maintaining dashboards for XFN partners and senior leadership 4. Data management, specifically with validating and auditing data and reports from multiple systems 5. Data modeling, data governance, and data preparation 6. Presto and Salesforce 7. Manipulating large data sets through statistical software.", "preferred_qualifications": "", "responsibilities": "Deliver useful and accurate reporting to inform people-related strategies and policies for the Employee Relations and Investigations teams. Partner closely with the lead Analytics Business Partner (ABP) to deliver ad-hoc reports, establish data governance, and to build and maintain dashboards and automated reports. Support accurate and efficient tracking of case data in Salesforce and secure augmented reporting with HR data. Manage concurrent projects while working with a global team to drive outcomes and informs and influences stakeholders with data and insights. Partner with ABP’s and cross functional groups (XFN) to understand stakeholder analytics needs and deliver accurate reports and dashboards to meet their requirements. Act as the data subject matter expert for Employee Relations and Investigations to ensure data infrastructure accurately reflects stakeholder needs. Partner with Salesforce and Data Engineering teams to ensure case data is accurately captured and tracked across multiple platforms. Build and maintain data tables, queries and data pipelines in HIVE for analysis. Partner with the wider People Analytics team to align on data definitions, metrics, and overall data governance. Proactively manage stakeholder expectations, manage escalations and resolve issues in a timely manner.", "company": "meta", "url": "https://www.metacareers.com/jobs/394588356855257"}