{"title": "People Development Program Manager, Onboarding", "level": "", "location": "Menlo Park, CA | San Francisco, CA", "description": "We are seeking a People Development Program Manager, Onboarding to join our team at Meta. In this critical role, you will be responsible for connecting new hires to our company, culture and community through compelling programs and experiences. You will report to the Director, Onboarding and Operation and work closely with various stakeholders to manage New Hire Orientation and related onboarding programs.", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of experience in L&D, HR, Event Management, Marketing or Communications; Accomplished in public facilitating with proven experience to lead, motivate, and engage participants; Customer service, communication and cross group collaboration experience; Proven capacity for context-switching and connecting the dots across many different topics and stakeholders at all levels (junior to exec); Proven organizational skills, effective communications skills, and be demonstrate to shift seamlessly between strategic counsel and smaller daily tasks; Team player point of view, fosters demonstrate collaboration with others working to achieve shared goals; Eager to work in an intense volume, fast-paced, high-expectations environment", "preferred_qualifications": "Experience supporting organizations through scale and change; Experience with data analysis and insight reporting; Project Management (PMP/PMI) certification; Facilitation certification", "responsibilities": "Manage our flagship New Hire Orientation program at Meta headquarters and help build out the end-to-end onboarding experience in support of our mission and business needs; Lead weekly New Hire Orientation at Meta headquarters, acting as event host and backup facilitator when needed; Source and manage executive presenters and expert panelists for orientation programming, providing feedback; Partner with cross-functional teams to provide exceptional onboarding experiences by designing and executing innovative, scalable solutions that inspire, connect and prepare new hires for building the future of Meta; Stay ahead of cultural and innovation change and proactively update orientation content to be relevant and engaging; Engage with new hires directly through pre-start community building and seizing in-the-moment connection opportunities; Track and analyze the impact of Onboarding Programs with analytics partners. Provide actionable insights and develop recommendations for continuous improvement; Flexibility to travel to other Meta offices on an as-needed basis is required.", "company": "meta", "url": "https://www.metacareers.com/jobs/395475519512340"}