{"title": "Product Manager, AI/HPC", "level": "", "location": "Austin, TX", "description": "We are hiring a Product Manager to help build the next generation of Meta’s AI infrastructure. The ideal candidate for this role will be passionate about identifying, delivering and scaling the next generation of AI systems (hardware accelerators, compute, network fabrics) and have a proven track record of effectively guiding product teams, influencing and aligning the org behind company priorities, and quarterbacking strategic cross-functional programs. Successful candidates must be comfortable working in a dynamic cross-functional environment and exhibit high signal-to-noise synthesis abilities and communication.\n\nAbout the AI/HPC org:\nWe define and build AI systems that are deployed across our global data center fleet and through which all Meta applications and AI user experiences are delivered.", "salary": "US$202,000/year to US$277,000/year + bonus + equity + benefits", "key_qualifications": "Masters degree in a STEM field plus MBA. 15+ years of experience in product management in any one of the following domains: hardware, AI, silicon, infrastructure, compute. Experience managing definition, integration and delivery of new technologies, from idea through development, integration, and launch into multiple generation of products. Highly effective communication and presentation skills, with extensive experience in aligning and presenting to various stakeholders and leadership. Experience building relationships and influencing a matrix organization. Self-motivated and experience working in a rapidly changing environment.", "preferred_qualifications": "Be an 0-1 entrepreneurial thinker, prior experience working in a start-up", "responsibilities": "Establish a shared vision and strategy for a portfolio of products that enable efficient and reliable infrastructure. Lead the ideation, definition, and launch of innovative AI platforms in areas of significant strategic ambiguity. Build strong relationships with platform development teams, as well as with system architects, hardware and software product leads. Collaborate with cross-functional teams to drive product development and deliver products that are recognized as best in the industry. Align roadmap with future product requirements, targeted product workloads and customer experiences Responsible for condensing customer requirements, competitive and industry landscape into compelling value proposition and requirements needed for future hardware platforms. Maintain a detailed understanding of the vendor and competitive landscape and ensure org leaders have an objective point-of-view of commercial options and our position vis-a-vis our contemporaries. Communicate AI hardware systems strategy, roadmap, plans, and priorities to stakeholders and leadership. Identify and initiate opportunities for new projects or focus areas in pursuit of leadership. Analyze metrics to inform the success of products and ensure products meet business needs.", "company": "meta", "url": "https://www.metacareers.com/jobs/398602449759821"}