{"title": "Systems Integration Engineer", "level": "", "location": "Austin, TX | Fort Worth, TX | Fremont, CA", "description": "The Systems Integration Engineer (SIE) is responsible for the successful Integration of new hardware platforms & new infrastructure technologies into the data center. This includes leading the system design for serviceability (DFS) requirements development, implementation along with validating new data center hardware tooling & automation readiness for deployment at scale. Meta is seeking a forward thinking, experienced engineer with deep technical leadership experience and skills in Server Hardware, high performance Compute, Storage, ASICs, Accelerators (GPU), and/or Networking in a data center environment. The ideal candidate has expertise in introduction of new hardware platforms into data centers and has either developed robust hardware system test plans, or validation planning as a systems engineer supporting AI/ML, compute, storage & network hardware in a data center environment. These skills will be used to develop test plans for operational integration of future AI/ML, compute, storage and networking products into the existing software tooling infrastructure. This candidate must possess excellent communication, leadership, interpersonal and organizational skills, plus strong engineering, program management and analytical skills. This role will interact with cross functional teams and individuals of all levels. This role requires an experienced, dedicated professional to effectively collaborate and influence internal stakeholders on the validation of infrastructure tooling support for Meta designed hardware. If you have a strong appetite for technology and enjoy working in small, agile, empowered teams solving complex problems within a high energy, dynamic environment then this is the role for you. This position is full-time.", "salary": "US$170,000/year to US$240,000/year + bonus + equity + benefits", "key_qualifications": "BS engineering or commensurate technical experience. 10+ years of experience in hardware development, system administration or engineering, software or hardware validation testing, or acceptance testing of AI/ML, compute, storage or networking equipment. Effective technical aptitude demonstrated by familiarity with ASIC, compute, storage & network architecture and components, hardware troubleshooting and diagnosis skills, and/or hardware manufacturing. Experience developing test plans derived from specifications and executing to those plans using industry standard testing tools for successful completion. Proven track record of dealing with ambiguity and developing processes for new technologies and taking them to production. Effective interpersonal skills and a solution-oriented behavior. Experience working in a cross-cultural environment. Python/C++ (object-oriented) and troubleshooting skills. Effective communications skills and demonstrated experience to influence cross functional teams", "preferred_qualifications": "MS or PhD in a technical field or equivalent technical work experience. Experience with hardware architecture reviews and requirement definitions. Experience with developing for, or managing large-scale server installations. Experience with AI/ML hardware development and deployment at scale. Experience with Linux operating systems and utilities. Knowledge of out-of-band/lights-out server communication methods, such as IPMI and serial console. Proficiency with git or similar SCM tools. Experience with test-driven software development. Familiar with configuration management systems like Puppet or Chef.", "responsibilities": "Lead new product introduction and associated processes for the successful launch of new hardware platforms into our data centers globally. Lead architecture reviews with hardware engineering teams to analyze and develop diagnostic coverage plans for both hardware and software. Lead hardware reviews and drive system Design for Serviceability requirements to ensure form, fit and function for new hardware development in our existing data center environment/architecture. Partner with cross functional development partners in HW Engineering and HW Technical Program Management to become conversant in the Meta AI/ML, compute, storage and networking infrastructure road map. Lead the development and execution of Data Center readiness tooling validation testing based on tooling development plans. Early engagement with design development teams (both internal and external) to drive improvements and influence hardware and tooling architecture. Partner with cross functional teams & development partners to deliver aligned new hardware platform roadmaps and gain agreement on implementation milestones. Partner with cross functional partners in Meta’s Data Center Operations team to understand infrastructure deployment and operational requirements. Collaborate with Production Engineers, Hardware Validation Engineers, Tooling Automation Engineers, and Data Center Operations Engineers to build thorough test strategy and test plans for validating the software needed for Data Center Operations. Work with ODM/OEM vendors as needed to define the product specifications, development plans & test plans. Capturing lessons learned for issues in Production and creating test cases to address those issues in future hardware platforms. 15% domestic and/or international travel required to Meta Data Centers/ offices.", "company": "meta", "url": "https://www.metacareers.com/jobs/400169409626896"}