{"title": "AI Research Scientist, FAIR (London or Paris)", "level": "", "location": "Paris, France", "description": "Meta is seeking Research Scientists, at all experience levels, to join our Fundamental AI Research (FAIR) team, an organization focused on making research breakthroughs in AI. Individuals in this role are expected to be world-leading experts in research areas such as ML theory, responsible AI, reinforcement learning, computer vision, audio, and/or NLP. To learn more about our research, visit https://ai.meta.com/. Ideal candidates for these positions will have a track record in producing new science that is seminal to understanding intelligence, with particular experience in building and analyzing large-scale models for vision, language, speech, or general agents.", "salary": "", "key_qualifications": "Ph.D. and established track record of leading and/or contributing to influential research, e.g. as evidenced by high-impact publications at peer-reviewed AI conferences (e.g. NeurIPS, CVPR, ICML, ICLR, ICCV, ACL, Interspeech and ICASSP) Experience communicating research for public audiences of peers, as well as non-technical audiences Knowledge in a programming language", "preferred_qualifications": "2+ years of work experience in a faculty, industry, or government research position with primary emphasis on AI research Experience driving original scholarship in collaboration with a team Track record of translating research into business impact Experience in developing and debugging in C/C++, Python, or C#", "responsibilities": "Lead research to advance the science and technology of intelligent machines Work towards long-term ambitious research goals, while identifying intermediate milestones Influence progress of relevant research communities by producing publications Contribute research that can be applied to Meta product development Lead and collaborate on research projects within a globally based team", "company": "meta", "url": "https://www.metacareers.com/jobs/400242872753151"}