{"title": "Industry Manager, Andean Region", "level": "", "location": "Bogotá, Colombia", "description": "Meta is seeking an experienced sales and marketing leader with demonstrated success managing established and emerging business clients. The Industry Manager, Andean Region, will lead the Meta book of business strategy for the Andean Region operation in Bogotá, Colombia. The successful candidate will be responsible for providing annual sales guidance, aligning goals to the sales annual plan, managing the sales budget, analyzing sales metrics, managing the sales cycle, and identifying and closing gaps to goal. The ideal candidate will be a creative thinker with the ability to work cross-functionally to develop scalable solutions for their clients and their teams. They will build impactful cross-vertical relevant narratives that go beyond individual client needs and build the industry’s belief in Meta’s products and solutions. They will build and manage a strategically focused/consultative sales team, selling Meta’s advertising solutions to advertisers. We are looking for a self-starter with an entrepreneur mindset who has demonstrated success in dealing with ambiguity, successfully managing teams and problem-solving leadership skills with limited oversight. Ideal candidates will have in-depth marketing background, proven management experience in a fast-paced sales environment as well as extensive experience selling cross-network and multi-platform marketing solutions and a business acumen to manage a portfolio of clients. This position is located in our Bogotá, Colombia, office and reports to the Regional Director of PanLatam & Andean regions  who sits in Miami, Florida.", "salary": "", "key_qualifications": "Bachelor’s Degree in Economics, Finance, Business Administration or related field. Master in Business Administration or equivalent experience. 10+ years of experience with sales or marketing with 5+ years of experience with digital media/marketing, sales performance management in the B2C  or SaaS industry. Minimum 10+ years of experience as people manager managing diverse medium to large sales teams under fast-paced conditions, high ambiguity, and diverse backgrounds. Experience with  the Andean market (Colombia, Peru, Ecuador) and Latin America as a whole: culture nuances, market challenges, economic conditions, political unrest, etc. Experience managing a variety of industries and verticals (eCommerce, Retail, CPG, Financial Services, Travel, etc) Experience building full funnel advertising campaigns and demonstrated experience using advertising data to craft media strategy. Proven track record of providing annual sales guidance, aligning goals to the sales annual plan, managing the sales budget, and analyzing sales metrics. Deep Knowledge of advertising technology and data/performance measurement practices of clients. Experience driving revenue growth by building on emerging and established opportunities and establishing CXO level partnerships across clients and agencies with a hunting mentality to keep expanding the footprint of the region around revenue incremental & YoY growth. Storyteller with experience translating client jobs to be done into holistic solutions relevant and meaningful to clients. Ability to leverage internal Meta capabilities in a consistent, collaborative and coherent manner to land impact with clients. Advanced communication and presentation experience with experience in public speaking translating insights, product information, and data into client value. Knowledge of the media landscape, business model, industry trends, reseller channels in the Andean region and its nuances among media spend and competitor landscape in Colombia, Peru, and Ecuador. Proven managerial experience managing large teams of senior people with the complexity of a large portfolio of clients and partners to maximize resources and guarantee best in class consulting support. Outstanding communication skills with peers, team, clients, manager to create best in class ambiance to guarantee flow of communication and interpersonal relationships. Experience working under pressure, in a fast-paced environment, under high-ambiguity situations, in complex markets while keeping common sense, business structure, and calm to make accurate business decisions. Project management skills", "preferred_qualifications": "Hands on experience @Meta managing these industries (eCommerce, Retail, CPG, Financial Services, Tech-Telco, CPG, etc) for Ad products is highly preferred. People management experience @Meta is a plus OR vast experience as a people manager Spanish & English fluent  (Portuguese a plus). Experience managing regional organizations that encompass more than 2 countries. Master’s Degree in Business or related field (Analytics, Finance, Business Administration, etc).", "responsibilities": "Provide annual sales guidance by analyzing market trends, identifying opportunities for revenue growth, and developing and executing sales plans. Own and be accountable for quarterly and annual revenue goals, rhythm of business, pipeline management and growth goals across a diversified book of the largest clients in Colombia, Peru, and Ecuador. Have control over BoB performance around forecasting models and clients' financial performance indicators. The IM should have a deep understanding of financial KPIs (P&L, EBITDA, ROI, operating cash flow, net profit margin, etc) and be able to have in-depth conversations with clients around their business objectives and how Meta can contribute to their success. Develop a deep understanding of the relevant industries and the role of Meta across different industries, and build partnerships through C-suite relationships to drive business impact. Translate into a vision for the industry that positions the Andean team as the best strategic team within the digital media ecosystem with this translating into growth and incremental revenue for the operation. Solve the biggest business and marketing problems for all clients across the full brand life cycle by owning vertical & horizontal work streams that will deliver narratives and solutions at scale and in depth. Expand the Andean portfolio of clients by developing a market expansion strategy (acquisition) in alignment with the Regional Director, that brings new clients to the Book of Business, increases revenue, and helps the operation get back to double digit growth. Support development of the Sales team in the required areas of the managed roles (CPs & CSMs) that goes in alignment with the expansion of the portfolio, YoY growth and improves productivity of the team. Work cross-functionally with Partnerships Teams, Business Operations, Business Marketing, Creative, Measurement, and Product Marketing to optimize our client efforts. Act as player/coach to build, train and maintain a high performing team of Client Partners (CP) and Client Solution Managers (CSM). Develop deep and meaningful relationships with decision makers and stakeholders of the whole portfolio of clients to be able to influence business decisions throughout the positioning of our suite of performance and branding solutions. Build short/mid term skills while building longer term careers for the team and create a strategic vision at the intersection of best practices for client interaction, sales and service excellence for Meta, including a good understanding of working with advertisers, partners, and agencies. Feed into the longer term product and GTM vision to solve for all verticals and traditional businesses who invest on Meta hunting mentality to identify account opportunities that could increase the revenue for the region and solidifies the portfolio strategy in the verticals of expertise (CPG, Finance, Retail, Education, Travel). Develop a strong performance strategy for the Andean portfolio of clients that increases product adoption of our newest automated solutions and helps bring incremental revenue from traditional clients developing their lower funnel strategies. Be a strategic ally to the local team supporting the vision developed by the Regional Director to keep permeating clients and stakeholders in their investment decisions in digital advertising by building relationships based on trust, optimal outcomes, and platform knowledge. Manage the sales budget by tracking expenses, identifying cost-saving opportunities, and ensuring effective resource allocation. Analyze sales metrics by monitoring performance, identifying trends, and making recommendations for improvement. Manage the sales cycle by developing and executing sales processes, providing training and support, and ensuring effective communication and collaboration. Identify and close gaps to goal by monitoring performance, identifying areas for improvement, and taking corrective action.", "company": "meta", "url": "https://www.metacareers.com/jobs/400472902876052"}