{"title": "Connectivity Engineer", "level": "", "location": "Prineville, OR | Crook County, OR", "description": "Meta is seeking a Connectivity Engineer to join the Design Engineering and Construction (DEC) team. Our data centers are the foundation upon which our innovative services are delivered, and our rapidly scaling infrastructure operates. The team lights up Meta ’s global data centers, delivering the physical infrastructure that connects the world to the videos, feeds, and other information stored on Meta ’s server banks.\n\nThe DEC Connectivity Engineer will provide site level support to ensure DEC telecommunication projects are being executed on schedule, within budget and at the level of quality specified. Connectivity Engineer will be the key point of contact for managing the full project life-cycle including project kick-off all the way through production turnover into operations. DEC Connectivity Engineer is highly collaborative with cross-functional partners at the Data Center Headquarters, our on-site contractor, and other data centers globally.", "salary": "US$122,000/year to US$169,000/year + bonus + equity + benefits", "key_qualifications": "5+ years’ experience in project management.\nExperience engaging and guiding stakeholders.\nExperience providing solutions to construction related problems.\nExperience with MS Office (Word, Excel, and PowerPoint) and MS Project.", "preferred_qualifications": "Experience reviewing and leading installations to design documents and specifications\nData center development and/or construction management experience.\nExperience with Primavera 6.\nExperience managing IT or IP Network deployment projects in a mission critical environment requiring coordination across multiple disciplines for the delivery of a common goal.\nExperience in leading deployments of Network/Structure cabling infrastructure.\nExperience with fiber optic testing at scale inclusive of complex troubleshooting.\nExperience with outside plant cabling (OSP) deployments including OTDR/OLTS testing.\nExperience with Quality Assurance and Quality Control, including progressive inspections and acceptance.", "responsibilities": "Project Planning & Control - Create, maintain, and report on site project and program scope, schedules and milestones. Work closely with site project management team throughout the project lifecycle from the creation of project and program plans through project close out.\nLearnings - Continually review ongoing projects for efficiencies in schedule, budget, and opportunities to enable cross-functional partners to be successful. Document data points to assist with field coordination of projects. Support development of project management best practices and initiatives, coordinating SOPs/SIPs with vendors, and participating in global and regional standards. Coordinate lessons learned with the DEC Center of Excellence.\nForecasting - Support project controls team with forecasting and budget efforts as required. Share current project status with upstream and downstream partners, ensuring crisp and complete handoffs between teams.\nTechnical Reviews - Establish milestones for equipment purchase and track and report against these milestones Assist with the selection and review of a contractor to support the structured cabling work within a data center.\nMetrics - Report progress and risks on site projects and other initiatives to key stakeholders.\nWorkflow - Work with installation partners to establish and track milestones. Conduct pre-project planning, project handoffs, and ensure design delivery and verification. Identify and respond to project risks and high-priority issues rapidly and effectively through effective action and appropriate escalation. Track and manage project change order requests.\nVendor Field Management - Responsible for all connectivity activities within construction, projects on site including tracking and reporting actual progress related to schedule expectations. Set and communicate clear expectations together with the immediate site team, build key relationships with our installation partners and drive a culture of best practice, safe working environment and execute to a vision of ‘right first time.’\nQuality Assurance - Perform physical inspections to ensure vendor work meets DEC quality standards throughout the lifecycle of the data center. Validate physical installs, test reports, build accuracy, material and local code compliance including constructability reviews on multiple design phases.\nTechnical Field Lead - Technical lead for industry and Meta standards, responsible to lead product evaluation, design, and installation methods in the field including scope clarification, design and installation details as the owner of the Request for Information process.\nTechnical Coordination - Develop solutions to in-field scope-gap or clash issues. Partner with DEC design and engineering teams to digitally support design reviews, BOM reviews, and as-built drawing validations.\nCommunications & Cross functional team engagement - Liaise with construction partners to ensure deliverables are met during new builds and retrofits. Coordinate with logistics partners, vendors, and suppliers to ensure a smooth end to end flow of materials as needed. Work closely with the relevant teams to proactively communicate progress and project risks and initiatives to key stakeholders.\nSafety - Ensure that vendors adhere to safety obligations in accordance with local regulations and DEC Safety best practices. Lead a 'safety first' culture, with open and transparent communication. Acknowledging good EHS practices.", "company": "meta", "url": "https://www.metacareers.com/jobs/403528699272052"}