{"title": "Research Scientist, Neuromotor Interfaces", "level": "", "location": "Burlingame, CA | New York, NY", "description": "Reality Labs at Meta is seeking Research Scientists with experience in product-focused machine learning and signal processing research to advance our pioneering work in neuromotor interfaces, which has grown out of the acquisition of CTRL-labs. We’re building a practical interface drawing on the rich neuromotor signals that can be measured non-invasively via surface electromyography (EMG) with single motor neuron resolution. This technology could become one of the main pillars for interaction with virtual and augmented worlds.\n\nWe are a multi-disciplinary team of researchers investigating the nature of human neuromotor signals, developing novel signal processing and machine learning methods to infer a user’s intent, and creating novel interaction techniques and user experiences. Help us unleash human potential by removing the bottlenecks between user intent and action.", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Currently has a PhD, in systems neuroscience, computational neuroscience, machine learning, biophysics, electrical engineering, computer science, statistics, or related fields. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment. Research-oriented software engineering skills, including fluency with libraries for scientific computing (e.g. SciPy ecosystem). Proficiency with quantitative methods (mathematics, statistics) and experience acquiring new technical knowledge and skills rapidly.", "preferred_qualifications": "2+ years of experience after PhD working autonomously to design, execute, interpret, and present research studies. Experience in the analysis and modeling of high dimensional time series, such as neural signals, other physiological signals, audio recordings, robotic sensory signals, financial time series, video, or other sensor modalities. Experience in deep learning or probabilistic graphical models. Fluency with libraries for deep learning and machine learning (e.g., PyTorch, TensorFlow, Scikit-learn). Experience with scientific communication tools (jupyter, matplotlib). Experience in software engineering in industry. Experience bringing machine learning-based products from research to production.", "responsibilities": "Plan and execute cutting-edge applied research to advance neuromotor interface capabilities. Design experiments to collect neuromotor and interaction data and evaluate human and model performance. Collaborate with engineering and Human-Computer Interactions (HCI) teams to deploy models that leverage fundamental scientific knowledge into new technology and user experiences. Use quantitative research methods to define, iterate upon, and advance key areas of our research agenda. Autonomously set technical and research direction.", "company": "meta", "url": "https://www.metacareers.com/jobs/404883425259502"}