{"title": "Product Marketing Manager - Rx Channels", "level": "", "location": "Los Angeles, CA", "description": "At Meta Reality Labs, we build tools that help people feel connected anytime, anywhere. We’re on a mission to build the next computing platform by putting people at the center of emerging hardware and software technologies, whether on the go with wearables and augmented reality, in the home or at work, or fully immersed in alternate virtual reality worlds.\n\nThe Meta Reality Labs Product Marketing organization leads inbound product marketing, product launch strategy, and in-market business growth. The Product Marketing team influences early stage product development and roadmaps, creates go-to-market plans, supports in-market growth of the ecosystem, and provides direction for future investments.\n\nWe're looking for an experienced Consumer Product Marketing Manager, specializing in prescription optical products and channels, to join our growing product marketing team and support a global audience. You will be responsible for influencing product strategies and positioning for target audiences, driving go-to-market efforts and prescription smart glasses distribution strategy, and working cross functionally with partners throughout the company. A successful candidate will have in-depth experience in the prescription optical industry, prescription regulatory and compliance considerations, analytics, consumer insights, and product commercialization in B2C contexts.", "salary": "US$158,000/year to US$223,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience in product marketing, product management, management consulting, business strategy in vision correction and/or eye health fields. Experience with prescription and health data regulations and compliance. Experience building partnerships with Product Management and cross-functional teams, and shaping product roadmaps and go-to-market strategies. Experience analyzing data, and translating to insights that support product development and go to market strategies. Experience leading implementation of complex product or service offerings. Experience working with technical partners to translate between technical and consumer languages. Experience collaborating with external vendors and partners. Bachelor's degree.", "preferred_qualifications": "Experience working independently and adapting in a fast-paced, entrepreneurial, and fluid environment, identifying and escalating issues early and often. Experience balancing creative and analytical thinking, putting forth best-in-class execution within a measurable and data-driven framework. Experience working with consumer electronics channels and retailers. MS/MBA degree.", "responsibilities": "Work with internal and external partners to optimize the prescription smart glasses customer experience and drive product adoption. Create go-to-market (GTM) strategy to drive product adoption & engagement. Work with Channel Strategy and Sales teams to identify opportunities for Rx smart glasses distribution. Identify market strategy and target audiences, develop product positioning, pricing, and placement, inform forecasting with data and insights, and collaborate across cross-functional teams (marketing, sales, communications, partnerships, etc.) to achieve launch goals. Influence product development and support a case for business investment by synthesizing, analyzing, and implementing learnings from customer feedback sources (e.g. in-market feedback, industry reports, competitive assessments, customer research, alpha/beta tests, etc) to strengthen outcomes for product-market-fit. Manage prescription data & analytics with internal and external partners, and uncover actionable insights to drive access and adoption in existing and new channels. Serve as the subject matter expert on prescription wearer and channel needs and mindsets. Manage prescription product claims, content and pricing in B2C and B2B contexts and for wearers with and without insurance.", "company": "meta", "url": "https://www.metacareers.com/jobs/407704502293317"}