{"title": "Program Manager, Compliance", "level": "", "location": "Dublin, Ireland", "description": "Meta People Group strives to run a great business and ensure that we comply with our regulatory and compliance obligations. Meta is seeking a Program Manager to develop and execute strategic programs that meet globally evolving employment regulation. Our organization is responsible for designing, implementing, monitoring, and maintaining Meta People Group’s governance and compliance system. We develop frameworks and execute solutions that make certain that Meta's global offices meet their jurisdiction's employment compliance — all while maintaining Facebook’s core culture. We partner with teams across People Operations, People Engineering, and Employment & Privacy Legal to build an industry-leading People compliance program. The Compliance Program Manager will join the People Risk, Privacy, Compliance (PRPC) team; leading programs to scale our global compliance coverage. HR compliance solutions developed will take into account the full life cycle, from understanding how new regulation will impact our business to measuring quality and reporting evidence to regulators. The ideal person will have proven risk management skills, systems thinking, attention to detail, be self-motivated, and have a collaborative and positive attitude.", "salary": "", "key_qualifications": "Demonstrate analytical skills, creativity, and experience working with attention to detail. Risk management or Compliance expertise. HR domain expertise. Program Management expertise. Working knowledge or willingness to quickly learn the content and requirements of various employment laws, regulations, industry guidance, and company compliance policies.", "preferred_qualifications": "Preferably 2nd line of defense risk management or internal audit experience within a Tech company. Experience in policy development.", "responsibilities": "Support the design, build and execution of industry leading first line of defense/second line of defense compliance management. Manage cross functional dependencies, risks, and changes effectively by optimizing scope, schedule, and resources. Develop and own communication plans to effectively and proactively convey program status, issues, and risks to stakeholders. Define and track key metrics and performance indicators that align cross functional execution of program deliverables. Drive process improvements across multiple teams and functions, including the reduction of manual efforts through automation. Manage relationships both internal and external to Meta People organization. Exercise excellent people skills. Be a team player with a bias to action.", "company": "meta", "url": "https://www.metacareers.com/jobs/407945918911385"}