{"title": "Integrity Compliance Lead -  Governance & Reporting", "level": "", "location": "Dublin, Ireland | London, UK", "description": "Meta is looking for a Compliance Manager to design, build and operationalise the  Governance & Reporting pillar in Meta’s Integrity Compliance Function. This role is responsible for the governance structure and best practice models to support transparent and effective involvement of Meta’s Integrity Compliance Function. In this context the role will work closely with leads of the Compliance function to develop reports, agendas, minutes, action and decision logs, and key meeting/briefing materials. The ideal candidate is an experienced, motivated compliance professional with a keen interest in designing and operationalising statutory/best practice reporting requirements in a maturing compliance governance environment, in an increasingly scrutinised sector.", "salary": "", "key_qualifications": "5+ years of experience in leading governance/reporting teams. 5+ years of cross-functional collaboration re Board updates, risk management and evolving governance frameworks/forums within a global company. Demonstrable experience liaising with internal and external audiences such as regulators and auditors. Deep interpersonal experience interfacing with all levels of partners and stakeholders. Experience in Legal and/or Compliance related programs or Internal Audit with specific subject matter expertise, a business understanding of risks, controls, and issues and the delivery of associated statutory reporting requirements.", "preferred_qualifications": "Comfortable with ambiguity. Operational experience of working in a high-volume environment with changing priorities and processes. Experience of maintaining awareness of function goals within the context of wider organisation goals as they impact governance matters, submissions, correspondence and other official documents prepared by and released by Meta. Collaborative, team-oriented approach to solving problems. Analytical thinking experience with an outcome-based approach and prioritisation experience to deliver on time while juggling numerous responsibilities.", "responsibilities": "Design and operationalise a governance & reporting pillar to support the discharge of statutory reporting obligations e.g. per Digital Service Act requirements. Provide high level analysis and advice to support the compliance function’s leadership and teams to meet key reporting requirements associated with the execution of the function - including funding, assurance and policy compliance requirements. Design and maintain a schedule of key reporting timeframes and manage the effective planning and delivery of all reporting artifacts including MPIL Board submissions, regulatory briefings, senior leadership briefings and key stakeholder engagement and relationship management resources. Manage the Compliance Office programme governance framework, identifying areas for process and procedural improvement. Provide deep support for external audits and ensure ongoing compliance with whole of function assurance and reporting requirements. Actively participate and contribute to communications and updates to ensure clear, concise and consistent compliance programme messaging for all stakeholders. Build effective working relationships with key internal and external stakeholders. Ensure programme leads are effectively involved in governance planning and delivery and contribute to timely and effective briefings and updates. Build relationships and interface closely with a diverse set of Compliance, Legal, Risk, Integrity and Operations partners, subject matter experts, internal control partners and/or first line risk management professionals. Actively support the Head of the Compliance function in the rapid operationalisation of a compliance programme.", "company": "meta", "url": "https://www.metacareers.com/jobs/410195851825407"}