{"title": "Hardware Test Engineer, Verification", "level": "", "location": "Zurich, Switzerland", "description": "The Hardware Test Engineer for Verification applies the highest level of skill and knowledge of computer vision, sensor fusion and robotics domains in designing, developing and deploying full end-to-end tracking verification solutions for Meta Reality Labs AR/VR products. You will drive conceptual hardware design with internal and external cross-functional partners early in the product exploration phase and validate the first article in the lab or onsite. You will lead the end-to-end development of software and hardware integration with first-party or third-party partners, which includes verification software pipeline, instrument control, robotic/motion platform control, data capture and process, as well as integration of advanced algorithms. You will lead documenting and troubleshooting station hardware and software issues on test systems and bridge to the production. You will drive the development and deployment of hardware test systems with manufacturing partners and third-party integrators. You will be heavily involved in troubleshooting software issues on test equipment and automation systems. You will help define overall product test strategy, evaluate test equipment and qualification processes, and lead and facilitate integration of test systems into our existing data tracking networks and factory control systems. You will be designing and documenting new manufacturing equipment with standardization and reliability as a priority and creating test plans for validating existing equipment. The ideal candidate will be a self-driven individual working in a cross-functional team environment and be responsible to lead the design, development, and implementation of factory test/calibration systems. You will have the opportunity to work with top-tier product designers, electrical engineers and computer vision scientists on cutting-edge AR/VR technologies. You will enforce and ensure that manufacturability, testability and cost-effective solutions are implemented to deliver top quality tracking system calibrations. This position will be responsible for both NTI and NPI developments and bridge to sustaining support of mass production. You must be responsive, flexible, and able to succeed within open collaborations. You must have a productive mindset and can apply your expertise to solve problems in creative and insightful ways in a very fast paced environment.", "salary": "", "key_qualifications": "Bachelor’s degree in Mechatronics, Automation, Robotics or equivalent with 1+ years of experience in developing test solutions in a consumer electronics or related field. Experience with programming languages such as Python, C/C++/C#, and data processing tools such as MATLAB, JMP and Minitab. Knowledge of sensor fusion (camera, IMU, etc) concepts and experience with its calibration flows. Experience designing and executing development projects with a design of experiment approach (DOE) to service, troubleshoot, and solve engineering problems. Knowledge in statistical methods (6s, SPC, Cpk) for data analytics. Effective communication in English and team collaboration skills required.", "preferred_qualifications": "Master/Ph.D. in relevant subjects with background in robotics and mechatronics. Experience in SLAM, sensor based tracking system, and/or depth sensing is a plus. Strong programming skills with Python, C/C++/C# or other script-based programming language in robust fault-tolerant instrumentation and/or automation applications. Experience developing end-to-end test solutions (HW, SW, integration) for complex computer-vision based tracking systems. Experience developing hardware test solutions utilizing robotics/mechatronics design and programming with both internal and third-party. Deep knowledge of multiple sensor calibration for applications such as stereo vision system, SLAM, depth sensing and 3D reconstruction. Understanding multi-dimensional transformations, pinhole camera model, stereo vision model is a plus. Experience in factory tests and calibrations for consumer electronics products for NPI and mass production.", "responsibilities": "Develop and deploy manufacturing ready end-to-end verification solutions for tracking systems on Meta RL AR/VR products, including algorithm test sequence, motion stage/robotics control, image capturing/processing and data transaction interface to defined IT infrastructure. Analyze, evaluate, design, integrate and test the first article fixture to meet specification and proof of concept. Develops tracking calibration solution specifications, procedures, and debugging guides. Lead and drive cross-functional decisions on hardware and software development and architecture. Validation of test SW/FW releases, including repeatability and negative testing, and coordinate SW upgrades with fixture integrator and CM/JDM partners. Troubleshoot and debug test systems and automation solutions from a software and hardware perspective in full autonomy. Oversee rollout and validation of SW/FW releases at manufacturing partners. Coordinates third-party vendors in designing, fabricating and developing test systems. Drive test station qualification at NPI phase and mange and hand over sustaining at MP phase. Support failure analysis on systems returned from the field and use data to improve test strategies and processes. Works closely with other functional groups (TPMs, Electrical Engineering, software/firmware Engineering) to bring the test systems development from the R&D stage all the way through to mass production. Travel required: up to 20%, includes domestics and International travels for collaboration with R&D teams and prototype builds support.", "company": "meta", "url": "https://www.metacareers.com/jobs/411088368408770"}