{"title": "Network Engineer, Foundation & Support", "level": "", "location": "Reston, VA", "description": "Are you passionate about cutting-edge technology and its implementation on a global scale? This exciting role within the ENS Foundation Design team offers a unique opportunity to tackle the challenges of introducing innovative compute and networking technologies across Meta's global data centers and network edge presence. By collaborating with cross-functional teams such as Planning, Network Engineering, Data Center Connectivity, Facility Engineering/Operations, and SiteOps, you will execute and support ENS's new product introduction process, thus ensuring that new network technologies can be deployed and managed at scale. In this role, your focus will be on backbone/long haul optical and IP systems, ensuring that we have defined and executable deployment and operations processes and tooling in place to onboard these various technologies using standard methods.", "salary": "US$161,000/year to US$225,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 7+ years of work experience with designing and deploying large-scale data center network infrastructure. Experience with data center design, structured cabling, and fiber optic network infrastructure. Demonstrated knowledge of NICs, optical transceivers, AOC, and DAC for high-speed interconnects. Demonstrated knowledge of TCP, IPv4/6, Routing Protocols, and related network services (DHCP, DNS). Experience with implementing tooling and automation for network configuration and monitoring. Track record of solving complex problems, executing tactically, and delivering on infrastructure projects. Experience to work independently, stay organized, multitask, prioritize, and communicate effectively.", "preferred_qualifications": "Experience with network architectures used for backbone/long haul optical and IP systems. Experience with network architectures used for high-bandwidth, low-latency applications. Experience developing new network solutions and managing through New Product Introduction (NPI) at scale. Experience leading and contributing to large cross-functional projects in a global environment. Experience working on a global team in a matrixed environment with limited supervision. Familiarity with the Linux based systems and experience with scripting and automation (Bash, Python, Perl).", "responsibilities": "Actively participate in the New Product Introduction (NPI) process for new network platforms and topologies including backbone/long haul optical and IP systems, and network related components for AI/ML infrastructure. Integrate new networking technologies to evolve and scale our data centers. Lead projects and develop design packages for standardized deployment across locations. Develop new operational support models for deploying and operating new data center infrastructure. Influence design of data center, network, server, and applications to ensure seamless integration. Publish technical reference, process, and training documentation for a global network deployment and operations teams. Build and nurture business relationships with key stakeholders, partners, and vendors. Up to 15-20% of travel required based on project demand.", "company": "meta", "url": "https://www.metacareers.com/jobs/411281868488710"}