{"title": "Data Science Manager, ML Infra and Experimentation", "level": "", "location": "Sunnyvale, CA | Bellevue, WA | Menlo Park, CA | Seattle, WA | New York, NY | Remote, US", "description": "As a Data Science Manager at Meta, you will help shape the future of the experiences we build for billions of people and hundreds of millions of businesses, creators, and partners around the world.\n\nWe are looking for a Data Science Manager who is passionate about analytics for large scale ML systems to help drive data-informed decisions for the Monetization Infrastructure team and help shape the long term strategic direction of the development of this system.\n\nThis Data Science Manager will partner with Engineering and Product leads across Meta Ads, and AI infrastructure to guide the strategic direction for one of the largest-scale ML infrastructure systems in the world, developing new ML infrastructure capabilities. The ideal candidate has experience with large-scale systems and a data product background.\n\nThe Monetization infrastructure team builds and operates one of the largest monetization infrastructure systems in the world. The team is at the heart of the Meta ads system, driving Meta’s advertising quality and revenue.", "salary": "US$206,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "Experience communicating both in low-level technical details as well as high-level strategies. BS degree in a quantitative discipline (e.g., statistics, operations research, econometrics, computer science, engineering), or BS/MS in a quantitative discipline with equivalent working experience. A minimum of 7 years of work experience (3+ years with a Ph.D.) in applied quantitative field, including a minimum of 2 years of experience managing analytics teams. 5+ years of experience in a team leadership role, including 2+ years of experience with people management through layers. Experience in cross-functional partnership among teams of Engineering, Design, PM, Data Engineering. Track-record driving product roadmap and execution.", "preferred_qualifications": "Master’s or Ph.D. degree in Mathematics, Statistics, Computer Science, Engineering, Economics, or another quantitative field. Proven track record of leading high-performing analytics teams. 7+ years of experience doing quantitative analysis, statistical modeling or machine learning in the experimentation space, including 3+ years of experience in the gaming or media industry. Knowledge and understanding of content lifecycle (sourcing, greenlight, launch, etc.), creator ecosystems, platform interactions. Experience partnering with and influencing stakeholders of all layers and functions, from Content to Product to Marketing. Knowledge of content greenlight processes and analysis. Knowledge of high impact industry data sources.", "responsibilities": "Drive analytics projects end-to-end in partnership with teams from Engineering, Product Management and across the Analytics community to inform, influence, support, and execute product strategy and investment decisions. Inspire, lead, and grow a team of data scientists and manager(s) to fulfill our longer term vision. Actively influences the design of the strategy and shaping of the roadmap within this scope. Generate and use team insights to set and prioritize longer term goals. Develop understanding of complex distributed systems and sub-components, as well as broader industry challenges, to identify present and future risks and opportunities. Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. Grow analytics expertise around you, upskilling your team, engineers, and others, to increase overall team impact.", "company": "meta", "url": "https://www.metacareers.com/jobs/412038274911341"}