{"title": "Product Design Prototyper", "level": "", "location": "Seattle, WA | Burlingame, CA", "description": "As a Product Design Prototyper on the Reality Labs team, you will be working on the cutting edge of Virtual and Augmented Reality experiences. With our team, you will explore, prototype, and build experiences that define the future of how people interact with wearable technology. Join a world-class team experimenting with bold ideas in areas including optics, haptics, tracking, displays, computer vision, user experience, audio, perceptual psychology, and generative AI. Work alongside expert Scientists, Mechanical Engineers, Electrical Engineers and Software Engineers to create the technology that makes AR/VR pervasive and universal. Join the adventure of a lifetime as we make science fiction real and change the world. You’ll be responsible for researching, designing and prototyping interactions for RL. You’ll work closely with engineers, designers, and researchers at Reality Labs.", "salary": "US$135,000/year to US$194,000/year + bonus + equity + benefits", "key_qualifications": "Experience thinking at a high level about product strategy and vision; 4+ years of experience in shipping software products; Design skills and experience leading in cross-functional environments; Knowledge of qualitative and quantitative methods for user research; Portfolio featuring examples of interaction and prototyping work; Experience prototyping experiences leveraging ML / AI models", "preferred_qualifications": "Experience coding in Unity with C# or C++; Experience working with researchers; Experience building prototypes in short timeframes", "responsibilities": "Define and synthesize user requirements; Help establish design processes to align cross-functional teams; Contribute to strategic decisions, working with engineering and research teams; Design and create user experience prototypes and individually contribute to the feature set; Establish pipelines & best practices for leveraging ML / AI models in prototypes; Work with user research to user test and iterate on the prototypes; Give and solicit feedback from others to raise the quality and craftsmanship of the product; Partner with PMs, engineers, researchers and content designers, overseeing the implementation of the user experience; Quickly solve issues with your cross-functional leads; Clearly articulate design decisions to a vast set of internal stakeholders; Help build product strategy; Advocate for product design within Facebook; Thrive in dynamic, fast-paced environments.", "company": "meta", "url": "https://www.metacareers.com/jobs/412506247949277"}