{"title": "Commercial Supplier Manager, Global Supply Chain", "level": "", "location": "Bellevue, WA", "description": "Meta is seeking a Commercial Supplier Manager to be responsible for developing and incubating a strategic sourcing program within Infrastructure Supply Chain + Engineering’s supply base.  Supply base includes all hardware manufacturing supplier segments and products/services for Meta’s Data Center Infrastructure (inclusive of compute, storage, and networking hardware). This role will engage with data center suppliers who provide goods and services to support Meta's global supply chain.", "salary": "US$115,000/year to US$170,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience in strategic sourcing, supply chain management, and supplier management. Experience using data and metrics to determine and drive improvement. Experience working cross functionally with tech and non-tech teams. Experience in cross functional partnership and enabling the success of others. Experience transforming business systems, models, and achieving results relative to goals. Demonstrated skills questioning the norm, thinking out-of-bounds, and delivering. Proven executive presence in managing suppliers with effective communication and presentation skills for an executive audience.", "preferred_qualifications": "3+ years of program or project management experience. Experience reviewing/executing commercial agreements/contracts. Advanced degree in business, supply chain, legal or a related technical discipline, or equivalent experience. Experience with data center hardware architecture and deployment.", "responsibilities": "Oversight of a third-party vendor to map supply chain’s supplier base and Meta-specific commodities (down to the Tier-N, level), including Contracting Installed, Contractor Furnished and Installed (CFCI) products. Enable the development of this database and visualization to understand geographic dependencies of all of the aforementioned commodities. Develop a sustaining program where data is refreshed regularly, to include supplier financial, regulatory, ESG/Net Zero/carbon emissions, compliance, and other critical risk data. Regular communication to key internal stakeholders and cross-functional partners on risks identified so the appropriate supplier strategies can be developed (e.g., additional sources/identification of alternate supplies, buffer strategies, supplier executive engagement/escalation, etc.). Develop and implement a centralized and comprehensive supply chain third-party supplier/vendor (“supplier” and “vendor” used interchangeably) risk management framework (beginning with geographic dependencies) of Meta’s data center infrastructure supply base.   Demonstrate proactivity, transparency, and accountability for identifying and managing conduct risks to develop and maintain a geographic other related risk-parameter program to enable critical reporting for Product/Strategy groups, Trade Operations, Risk, Sustainability, sourcing peers, etc. Conduct supplier deep dive analysis to identify control gaps, concentration risks, or other risk themes, where warranted. Conducting a thorough risk assessment to identify potential supplier risks, including: coordinating internal teams and managing relationships with consultants and external subject matter experts, evaluating and leveraging supplier and MPN mapping down to the Tier-N level to develop risk analysis on global geographic dependency, by supplier, and evolving program to include evaluate additional factors such as supplier financial stability, reputation, compliance history, and operational capabilities. Leveraging existing third-party tools (including training/tool adoption) provided by consultants and integrated with any current supply chain analytics/insights.  Derive insights from complex risk data set(s).  Insights will include influencing sourcing category plans managed by Global Technology Sourcing (by category) or materials manners in planning. Once risks are identified through the assessment process, conduct deeper investigations on high-risk suppliers to gather more detailed information about their practices, policies, and overall business operations. Review and prioritize risk-based mitigation recommendations, partnering with internal stakeholders (e.g., sourcing manager, inventory managers, etc.) on opportunities (e.g., alternate supplies, buffer strategy, third-party executive communication/escalation, etc.).  Present assessment results to stakeholders and leaders throughout the business to drive alignment on risk management strategies. In collaboration with Global Technology Sourcing, Capacity Planning Manufacturing Delivery, and key ISCE pillars, manage existing suppliers in order to mitigate risks. Supplier influence include: Drive supplier engagements, with relevant SMs, or independently as required in order to develop/execute commercial roadmap (including location strategy, supply/demand strategy, buffer strategy, prioritization, etc.). Identify and develop potential commercial models/supplier model(s) (“business models”) that require development of requirements (RFx to award/contract).  Onboard new supplier model includes supplier business review and overall supplier management.   Driving supplier commercial and/or technical process improvement plans to mitigate risks while maintaining cost/quality parity. Maintaining a sustaining program to continuously monitor/supplier performance to detect any emerging risks.", "company": "meta", "url": "https://www.metacareers.com/jobs/413234831590276"}