{"title": "Public Policy Manager, Indonesia", "level": "", "location": "Jakarta, Indonesia", "description": "Meta is seeking a highly organised, motivated, and detail-oriented professional to join our Public Policy team based in our Jakarta office. The person will combine a passion for technology's potential to create opportunity and to connect the community in a safe and responsible manner, with deep knowledge of the political and regulatory dynamics in Indonesia.\n\nYou will work on issues related to the Internet and Meta's mission of giving people the power to build community and bringing the world closer together. In this role, you will be responsible for understanding Meta’s policies and business priorities, being able to communicate those to policymakers, NGOs, civil society and other stakeholders, and providing input into the development of regulation of the internet sector – with the goal of furthering the company’s mission. Additionally, you will collaborate with colleagues across the business and the globe, engage with trade associations and third party groups.\n\nThe successful applicant will become part of a team that is dealing with some of the most interesting public policy challenges of our times including privacy, safety, freedom of expression and growth of the digital economy. \n\nThis position will be based in our Jakarta office.", "salary": "", "key_qualifications": "7+ years of experience in related areas of public policy such as legislation and/or government relations and advocacy. Demonstrated understanding of Indonesia's political systems and relevant policy and civil society institutions. Ability to exercise sound judgment, communication and persuasive skills. Ability to drive and manage multiple projects and campaigns simultaneously. Ability to think, plan and execute resourcefully and creatively in a dynamic environment. Ability to partner and collaborate effectively with cross-functional partners at all levels in a fast-paced environment.", "preferred_qualifications": "Experience in public policy in the tech sector. Experience in engaging government stakeholders. Experience in working with or for private sector. Having legal background is a plus.", "responsibilities": "Monitor the political and regulatory environment in Indonesia, identify and evaluate the impact of legislative, regulatory and industry proposals, risks and opportunities to the company. Work with policymakers, non-governmental organizations (NGOs) and private sector organizations on issues of safety, security, content policy and other technology-relevant public policy concerns. Represent Meta in meetings and public events with policymakers and stakeholders. Assist in the development and management of Meta's policies on particular issues or product areas. Work with cross functional teams across product, legal, marketing and communications across the company. Respond to questions and consultations from external stakeholders on relevant policy issues.", "company": "meta", "url": "https://www.metacareers.com/jobs/413394118291081"}