{"title": "Program Manager, Accommodations", "level": "", "location": "Austin, TX | Menlo Park, CA", "description": "The People Risk, Privacy & Compliance team is responsible for developing and implementing employment compliance obligations across the globe. Our compliance programs are designed with scale, experience and systems-led strategies.  Accommodations is one such program focused on efficient and simple people processes, systems, policies, and programs. We take a data-driven approach to support Candidates and Employees in their journey through the company. We manage people knowledge and build project management capability across our company. Our work also ensures Meta remains protected and compliant. We strive to ensure employees feel heard and given the resources and support they need during the most important moments during their careers.\n\nThe Program Manager, Accommodations will play a pivotal role in supporting the overall accommodations programs.. The ideal candidate will be a self-starter with strong initiative as well as the ability to think critically through ambiguous situations and prioritize while maintaining a high-level of confidentiality in a fast-paced environment.", "salary": "US$140,000/year to US$206,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of demonstrated experience designing, implementing, and executing end-to-end programs. Applied systems thinking with experience having optimized workflows into case management systems. Analytical skills, creativity, and experience working with attention to detail. Demonstrated communication experience working in a multi-matrixed environment, including experience communicating concepts to different audiences across an organization. Analytical and problem solving skills and experience to effectively use data to drive recommendations. Experience building relationships and influencing others while working cross-functionally. Working knowledge or willingness to quickly learn the content and requirements of various employment laws, regulations, and company compliance policies.", "preferred_qualifications": "BA/BS in Human Resources. HR domain expertise. Excel experience including pivot tables, VLOOKUPS, and charts/graphs. Experience with Salesforce and Workday.", "responsibilities": "Lead the design, build and execution of industry leading Global Accommodations programs. Drive cross functional initiatives ensuring we support the business with company strategy impacting Candidates and Employees.  with various cross functional partners to define program requirements, set priorities, and establish scope which includes the roadmap and long-term strategy of the teams and respective leadership. Manage cross functional dependencies, risks, changes effectively by optimizing scope, schedule and resources. Drive internal and external process improvements across multiple teams and functions including reducing the manual efforts through automation. Produce and analyze reports and metrics, including ad hoc reports concerning accommodation trends. Handle private and sensitive data in accordance with company policy and legal requirements. Demonstrate excellent judgment and discretion in supporting complex and private employee matters. Define and track key metrics and performance indicators that align with program deliverables.", "company": "meta", "url": "https://www.metacareers.com/jobs/418499691100855"}