{"title": "Quantitative UX Research Manager", "level": "", "location": "Menlo Park, CA", "description": "Facebook is looking for a Quantitative UX Research Manager with proven research, communication and people management skills.  What makes a good candidate? Someone who has a breadth and depth of quantitative research skills - who understands the balance and trade-offs between scrappy and rigor, and ultimately how research translates into design and product recommendations and decisions. It's not enough to answer interesting questions about user behavior; our team focuses on impact. You will oversee a team of world-class researchers from multiple research disciplines but all focused on developing metrics and insights the inform Facebook leadership about the health of the app. The role requires you to be an expert researcher with a proven track record of doing quantitative research that impacts a complex and diverse product. In addition, you need to have a proven track record of building and managing high-performing teams, preferably with quant researchers. You will be required to articulate the vision of the quant research team to design and product leadership and be a strong advocate for the role of  quantitative research in product development. You must become a trusted, strategic partner to FB leadership and product stakeholders by communicating and demonstrating the value of quantitative user research, and by delivering insights that lead to measurable business value. You must contribute to design and strategic discussions and be an overall expert in the relationship between research, design, marketing and product. You must build strong relationships with other research teams at Meta to ensure a cohesive and cross-functional vision for Research at Facebook and Meta.", "salary": "US$163,000/year to US$226,000/year + bonus + equity + benefits", "key_qualifications": "4 or more years of experience with consumer or enterprise products, consumer or employee insights, or product development. 10 or more years of experience with user research, quantitative research. 2 or more years of experience directly managing, coaching and developing full-time quantitative researchers. Track record of translating research into design and product. Proven track record of building and managing high-performing quant research teams, with researchers of different levels of seniority.", "preferred_qualifications": "Expertise in survey methodology, complex data analysis methods (e.g., causal modeling, trade-off analysis, sample weighting). Experience vetting and managing vendors of survey respondent panels. Experience documenting complex processes and workflows. Experience managing senior researchers.", "responsibilities": "Guide the development of surveys and quantitative research. Advocate passionately for Best Practices in research that are fit for purpose to meet needs of users and products. Build a measurement strategy and roadmap for the Facebook App to inform Senior Leadership about the health of the app and progress on company-wide strategy. Build and influence meaningful cross-functional relationships. This role is within a horizontal team requiring development of meaningful relationships with UXRs embedded in product teams. Deliver actionable and relevant insights aligned to both strategic and tactical product and designs decisions. Identify and prioritize short-term and long-term research that delivers impact. Allocate resources to ensure we are always focusing on the highest priority things, focusing both on the short term needs as well as looking ahead to the next big challenge. Hire, develop, and retain talent.", "company": "meta", "url": "https://www.metacareers.com/jobs/421953117112991"}