{"title": "Data Scientist, Monetization", "level": "", "location": "Menlo Park, CA | Seattle, WA | New York, NY", "description": "As a Data Scientist in our Monetization organization, you will work closely with a diverse group of cross-functional partners to solve complex product and technical problems. Our advertising tools and interfaces are the primary means by which businesses interact with Meta, and they play a critical role in managing the majority of Meta's revenue.\n\nOur Monetization Orgs mission is to facilitate meaningful connections between people and businesses. We achieve this through our delivery products, ads optimization products, signals, ads ranking, ads infrastructure, and generative AI work, which touch all advertisers and all ads across all of Meta's apps, including Facebook, Instagram, WhatsApp, Messenger, and more.\n\nWe are seeking a seasoned leader who can navigate the technical complexity of the space while also managing and supporting a broad and diverse range of stakeholders. The ideal candidate will have a proven track record of working closely with Engineering and Product leads, and a strong technical/statistical background. You will use data and analysis to identify and solve product development's biggest challenges, influence product strategy and investment decisions with data, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.", "salary": "US$206,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\n\n5+ years of work experience leading analytics work in IC capacity, working collaboratively with Engineering and cross-functional partners, and guiding data-influenced product planning, prioritization and strategy development.\n\nExperience working effectively with multiple stakeholders and cross-functional teams, including Engineering, PM/TPM, Analytics and Finance.\n\nTechnical knowledge in the Ads domain, and their application in consumer and business products, and intellectual curiosity for continued learning.\n\nIntellectual curiosity and drive, decisiveness, with ambiguity and complexity.", "preferred_qualifications": "LLM, GenAI research or application experience.\n\nPhD in a STEM field.\n\nExperience with predictive modeling, machine learning, and experimentation/causal inference methods.", "responsibilities": "Build analytical framework to facilitate product strategies and prioritizations.\n\nWork with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches.\n\nApply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses.\n\nDefine, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations.\n\nProject and measure product outcome and financial implications.\n\nWork closely with our engineering and product team to define and measure the quality of GenAI models.", "company": "meta", "url": "https://www.metacareers.com/jobs/423784140645133"}