{"title": "Data Science Manager, MFT Financial Integrity", "level": "", "location": "Tel Aviv, Israel", "description": "As a Data Science Manager at MFT Financial Integrity, you will help shape the future of the payment experiences we build for billions of people and hundreds of millions of businesses around the world.\n\nYou will apply your people leadership, project management, analytical, and technical skills, creativity, and product intuition to one of the largest data sets in the world. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will influence product strategy and investment decisions with data, be focused on impact, and lead and grow a high-performing team. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.", "salary": "", "key_qualifications": "MS degree in a quantitative discipline (e.g., statistics, operations research, econometrics, computer science, engineering), or BS/MS in a quantitative discipline with equivalent working experience. Proven track record partnering with Product, Engineering, and other functions to drive results, guided by data-influenced strategy and product development. Minimum 3 years experience in the Payments Risk domain. Minimum 3 years experience as people manager. Comfortable engaging in both low-level technical details as well as high-level strategies and communication to senior leadership.", "preferred_qualifications": "", "responsibilities": "Partner with Product, Engineering, Operations, and other disciplines to develop, influence, support, and execute product strategy and investment decisions. Inspire, lead, and grow a team of data scientists to partner with other disciplines to fulfill the mission. Provide mentorship to the team on both technical and strategic direction. Proactively identify opportunities to better fulfill the product vision and strategy. Apply expertise in quantitative analysis, experimentation and data presentation to uplevel the work of the team. Ensure decisions are made with a high level of rigor using the most relevant data.", "company": "meta", "url": "https://www.metacareers.com/jobs/423909833754662"}