{"title": "Public Affairs Manager, Security Engineering", "level": "", "location": "Los Angeles, CA | Menlo Park, CA | Washington, DC | New York, NY | San Francisco, CA | Remote, US", "description": "Meta is looking for a Public Affairs Manager to join its Security Communications Team. In this role, you will support our cross-company information security efforts in developing and executing communications programs from scratch. You will be a vital voice in helping us tell the story of our work to secure and protect people from new and emerging threats. The ideal candidate is passionate about security and translating complex security ideas and innovations to both technical and non-technical audiences. This is a hands-on, fast-paced role for someone who can easily build and execute creative and bold proactive programs independently, quickly assess risks and stay calm in crisis situations, and work effectively with journalists and high-level executives. Experience managing a large volume of incoming press inquiries while delivering on proactive long-term priorities is essential. You should be passionate about technical details behind our security work, services we provide and the people that we serve.", "salary": "US$174,000/year to US$242,000/year + bonus + equity + benefits", "key_qualifications": "10+ years of experience in policy communications, public policy, public affairs, or issues management; Knowledge of the information security industry and press; Experience distilling complex security technology or policy concepts into plain language for non-expert audiences; Experience creating messaging materials, and working collaboratively with cross-functional groups including Engineering, Investigations, Legal, Public Policy, Marketing, and Data Science; Experience managing crisis communications situations autonomously; Experience building outreach programs and managing stakeholder relations at a national or international level", "preferred_qualifications": "Media relationships with a diverse range of security reporters and bloggers; Experience managing diverse cross-functional stakeholder relations in fast-paced environments; Familiarity with information security community dynamics and researcher relations; Experience with consumer communications around complex security topics", "responsibilities": "Build and execute proactive communications programs for press, policy makers, and other groups that highlight the work Meta does to protect our community and company. Manage in-bound press inquiries on a range of time-sensitive issues with high stakes and visibility. Develop and pitch stories to a range of press, including technical security, business, policy, and consumer reporters. Prepare messaging and other external materials such as blog posts, speeches, and videos. Partner closely with executives to create successful communications outcomes for interviews, speeches, panels, and other external engagements. Directly manage communications for product launches, policy issues, and other announcements. Work with our global Product, Engineering, Infrastructure, and Policy teams, along with others around the company, to build, understand, and communicate corporate and product security technology and policies. Represent the Public Affairs and Communications team in a wide range of internal, high-impact discussions.", "company": "meta", "url": "https://www.metacareers.com/jobs/430059642751360"}