{"title": "Marketing Science Partner, Specialty", "level": "", "location": "Menlo Park, CA | New York, NY", "description": "This position will work with internal and external stakeholders to advise clients and the industry on measurement strategy and work with them on an ongoing basis to adopt better measurement as a way to improve business performance. To accomplish this, the person in this role will drive industry adoption of Facebook preferred measurement methods and products and design and execute empirical research for individual clients and at the industry-level. Driving good measurement with clients will require designing tests and doing research to help clients understand and improve the effectiveness of their advertising across digital platforms and across media. Facebook is seeking exceptional candidates to join this new team: we’re looking for people with strong analytical and critical thinking skills as well as familiarity with large data sets and data tools. To successfully influence how clients conduct and use measurement, the candidate will need to be able to work cross-functionally with advertisers, sales teams, and other members of the Marketing Science team.", "salary": "US$95,000/year to US$149,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in an analytical field such as Computer Science, Engineering, Mathematics, Statistics, Economics, Finance, or similar. 5yrs+ consulting, research or analytics research experience and experience using data and numbers to formulate insights. Experience analyzing and manipulating data sets to understand patterns and provide client insights. Knowledge of advertising measurement methods and technologies. Client-facing experience, including experience driving change through adoption of new products or research methods. Experience communicating technical content to general audiences and influencing decisions. Experience communicating technical content to all types of audiences and influencing at senior levels. Experience analyzing and manipulating data sets using R, Python, SQL and etc. and applying statistics where appropriate to understand patterns and provide insights. Experience with advertising measurement methods and technologies for direct response outcomes, including field experiments, experimental designs and etc.", "preferred_qualifications": "Direct experience with direct response attribution measurement methodologies, tools and data sets. Experience in retail and/or eCommerce industry is an asset. Experience working with or in support of diverse communities.", "responsibilities": "Manage complex and technical driven clients in Retail and eCommerce vertical. Engage with clients and both Meta and client’s product and data science partners to measure true business value by building and operationalizing measurement strategies that highlight how the client can improve business outcomes by employing highly customized measurement techniques. Innovate and drive client, vertical, and industry adoption of preferred measurement methodologies, products, and approaches. Drive client, vertical, and industry adoption of preferred measurement methodologies, products, and approaches. Design tests to showcase the power of good measurement using client data and Meta or third-party technology tools. Conduct in-depth custom ad effectiveness studies and bespoke analyses to understand the relative impact of different marketing strategies across digital platforms and across media. Communicate complex research results to a general audience. Provide feedback to and collaborate with Product, Business Engineering and Partnership to identify opportunities for new features, products, and partnerships and drive client engagement around measurement innovation, including product alphas and beta. Partner closely with cross-functional partners such as Sales, Product, R&D, Ads Research, Creative Shop etc.", "company": "meta", "url": "https://www.metacareers.com/jobs/433254559416688"}