{"title": "Enterprise Engineer", "level": "", "location": "Fremont, CA", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. To apply, click “Apply to Job” online on this web page.", "salary": "US$180,583/year to US$200,200/year + bonus + equity + benefits", "key_qualifications": "Requires a Master's degree in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and two years of work experience in the job offered or a computer-related occupation. Requires two years of experience in the following: 1. Building intuitive systems in Java, PHP, C++ or JavaScript technologies such as ReactJS or AngularJS 2. Working with code bases building micro services, and REST APIs 3. Modelling data flows between systems to enable transactional workflows and upstream or downstream integrations 4. Building secure software with auditable access controls and permissions 5. Object-oriented programming 6. Unix or Linux 7. Python and JavaScript.", "preferred_qualifications": "", "responsibilities": "Develop, design, create, modify, and/or test software systems for various software services. Build industry leading enterprise systems that are highly available, intuitive, scalable, and secure. Work with product managers, designers and other engineers to create software that optimizes for business metrics. Produce highly reliable and performant code with appropriate monitoring and alerting. Conduct design and code reviews to ensure scalability, performance and alignment with standards and best practices. Follow release management policies to ensure data integrity, compliance and system stability. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions.", "company": "meta", "url": "https://www.metacareers.com/jobs/433988192841833"}