{"title": "Security Partner - Mergers & Acquisitions (M&A)", "level": "", "location": "Menlo Park, CA | Seattle, WA | Washington, DC | New York, NY | Remote, US", "description": "Do you love designing secure-by-default solutions and building security programs? Security Partners have a deep understanding of one or more areas of Meta's expanding portfolio and partner with engineering leaders to ensure that security is built-in from the get-go. Broadly, this might be securing end-to-end messaging encryption, protecting next-generation gaming and media services from exploitation, validating secure boot processes and certificate storage, infusing security into SoC hardware designs, or creating security programs for our expanding portfolio.\n\nWe are currently looking for someone with a broad security background who loves weaving security into the fabric of M&As.\n\nIn this role, you will have the opportunity to solve complex business and security problems, while minimizing friction and maximizing productivity and impact. You will be required to use both broad and deep technical knowledge across a range of security disciplines in order to make recommendations to leadership on resourcing, roadmaps, and processes, as well as helping teams build. Security Partners communicate at the highest levels of the organization and use data-driven arguments to ensure resources are properly allocated and employed to address the most critical security and privacy risks.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "10+ years of hands-on security engineering experience in distributed infrastructure and/or network security. Technical experience across security disciplines. Experience communicating risks and roadmaps to senior leadership. Experience building relationships with stakeholders and business leaders. Self-motivated and experience thriving in an ambiguous environment. Proficiency with at least one scripting or coding language.", "preferred_qualifications": "10+ years of security domain experience in hands-on engineering work. Experience working on or managing projects that have enterprise-wide impact and/or multi-organization cross functional stakeholders. Experience leading and empowering teammates. Experience contributing to the security community (open source, academic research, industry research, blogs, presentations, etc.)", "responsibilities": "Discover needs and drive security solutions across one or more of Meta’s business units. Represent the security organization in product strategy and roadmap development with PMs, TPMs and engineers. Build deep relationships with product and engineering leaders. Drive security risk decisions and initiatives, and influence technical architecture. Act as the primary liaison between the product/engineering teams and the Meta security team. Develop and maintain deep industry expertise in the assigned area(s).", "company": "meta", "url": "https://www.metacareers.com/jobs/434101785938739"}