{"title": "System Technical Program Manager, Reality Labs", "level": "", "location": "Sunnyvale, CA | Redmond, WA | Burlingame, CA", "description": "The Meta AR team focuses on delivering Meta's vision through Augmented Reality (AR). As a Technical Program Manager, your job will be figuring out what we need to do to build it and deliver it. You'll be a critical member of a multi-disciplinary team contributing to our efforts to gain a scientific understanding of haptics, human and machine perception, audio, input, optics, display technology and translating it into the ultimate AR experience for our users.\n\nOur product engineering team explores, develops and delivers new cutting-edge technologies into products. We are focused on integrating and launching new technologies from early concept to launch while iterating, prototyping and realizing the human value and new experiences they open up.\n\nAs a Technical Program Manager for System, you will play a key role in the definition, planning and execution of our next gen programs. You will guide a broad cross-functional team across the phase gated product development process, including planning of product features and requirements, managing schedules, identifying and tracking risks and associated mitigations, and managing system level builds leading to product qualification. You will be responsible for communication of program status and risk to program stakeholders. In this role, you will have a major impact on future products.\n\nWe look for Technical Program Managers who have a strong technical foundation and are natural motivators, cross-functional relationship builders, and champions for driving the right level of process to ensure smooth and predictable program execution in a fast-paced innovative environment.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "BS in Engineering field, or equivalent experience. 10+ years experience as a Program Manager managing Systems Engineering programs from concept to mass production. Experience with phase gate approach to technology development projects. Experience with system, component and module qualification, validation and characterization processes. Knowledge of program issue/ bug tracking and risk management. Communication experience and experience working with technical teams. Problem solving and organizational experience. Experience building relationships and collaborating with cross-functional teams.", "preferred_qualifications": "Experience managing consumer electronic device hardware programs.", "responsibilities": "Work closely with across engineering, product management, architecture, operations and other teams, driving and tracking the investigation, definition and delivery of next generation products. Create development, delivery and qualification strategies and schedules based on system requirements, technical challenges, lead times and business needs. Manage communication within and between internal engineering and external vendor teams. Work with teams to set milestones, communicate program status and identify/ address potential setbacks. Drive engineering teams to bring technical issues to closure. Work cross-functionally to develop best practices and technology development processes in a quickly changing and dynamic environment to ensure on time delivery. Manage system level engineering builds from early prototyping through qualification builds. Ensure program documents are complete, current and available for staff and leadership review. Contribute to resource planning to ensure program success. Up to 25% travel domestically and internationally based on program needs.", "company": "meta", "url": "https://www.metacareers.com/jobs/436784815519394"}