{"title": "Supply Chain Solutions Program Manager", "level": "", "location": "Fremont, CA", "description": "As Meta Data Center infrastructure grows its scope and scale, our partner’s Manufacturing footprint also expands. This requires more organization and integration of activities within Meta and between Meta and multiple manufacturing sites. Meta is seeking a highly motivated and experienced Program Manager, to drive Transformation, Automation and Process Efficiency projects in Supply chain and Manufacturing Process, Systems and tools, Master Data and Product data focused.", "salary": "US$151,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "12+ years of experience with program management of manufacturing supply chain execution, product lifecycle, manufacturing test processes, Business transformation. Experience identifying problem statements and structuring into a program with clear and measurable goals and milestones. Experience executing against strategy and managing through obstacles and ambiguity. Experience proactively identifying risk and establishing risk mitigation plans for execution. Stakeholder Influence and Strategy: Experience establishing partnerships with stakeholders to define and drive roadmaps and direction. Experience creating and following a structured communication strategy to keep stakeholders and customers informed. Bachelor's degree in a directly related field, or equivalent practical experience.", "preferred_qualifications": "End-to-end Supply Chain solutions architecture experience, across technology stacks (Custom, and/or out of the shelf) and suites (ERPs, PLM and Master Data solutions, Manufacturing and Test Engineering). Masters degree in business administration, Engineering or Supply chain related fields", "responsibilities": "Engage with business stakeholders, by partnering with the engineering, operations leads and strategic Subject Matter Experts, to understand their strategic objectives, initiatives, pain points and needs for transforming their supply chain. Partner with IT, Automation engineering, Supplier Technical teams and other groups to develop an E2E go forward solutions architecture that integrates across Meta, to address the business priorities. Develop, maintain and evolve a related Supply Chain roadmap that best suits business priorities while enabling the go forward architecture. Lead implementation programs, ensuring quality delivery and expected outcomes. This includes the gathering of business requirements, development of process flows, high level solution design, training and change management and Adoption best practices. Self ideate opportunities to improve Meta processes in relation to Master data management, Rack manufacturing collaboration and manufacturing quality engineering practices. Influence teams to prioritized transformation, efficiency and optimization programs to enable their run the business processes. Establish clear metrics for Projects around process and tools improvements and drive continuous measurement and improvements. Provide mentorship and development support for peers, especially in manufacturing, data and supply chain best practices.", "company": "meta", "url": "https://www.metacareers.com/jobs/439055651920113"}