{"title": "Product Manager, Machine Learning", "level": "", "location": "Menlo Park, CA | Seattle, WA", "description": "Meta Product Managers work with cross-functional teams of engineers, designers, data scientists and researchers to build products. We are looking for extremely entrepreneurial Product Managers with Machine Learning expertise who value moving quickly, and can help innovate and coherently drive product initiatives across the company.", "salary": "US$202,000/year to US$277,000/year + bonus + equity + benefits", "key_qualifications": "10+ years product management or related industry experience with domain specific expertise in Machine Learning. 10+ years of experience working collaboratively with engineering, design and user research teams. Requires a Bachelor's degree (or foreign degree equivalent) in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field and 2+ years of experience in the following: Experience working in a technical environment with a broad, cross functional team to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Experience delivering technical presentations. Experience in analyzing complex, large-scale data sets and making decisions based on data. Experience in gathering requirements across diverse areas and users, and converting and developing them into a product solution. Displaying leadership, organizational and execution skills. Proven communication skills.", "preferred_qualifications": "Experience defining vision and strategy for a product. Experience going through a full product lifecycle, integrating customer feedback into product requirements, driving prioritization and pre/post-launch execution. Experience with leveraging ML/AI to build large scale consumer products. Experience recruiting and leading a cross-functional team of world-class individuals. Enthusiastic and resilient in a constantly evolving environment where the process is fluid and creative solutions are the norm.", "responsibilities": "Display strong leadership, organizational and execution skills. Is the primary driver for identifying significant opportunities, and driving product vision, strategies and roadmaps in the context of broader organizational strategies and goals. Incorporate data, research and market analysis to inform product strategies and roadmaps. Leads and motivates a team of engineers and other cross-functional representatives, and maintains team health. Understand Meta's strategic and competitive position and deliver products that are aligned with our mission and recognized best in the industry. Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm.", "company": "meta", "url": "https://www.metacareers.com/jobs/441824678796248"}