{"title": "Machine Learning ASIC Engineer, Architecture", "level": "", "location": "Sunnyvale, CA | Austin, TX", "description": "Meta is seeking an ASIC Engineer, Architecture to join our Infrastructure organization. Our servers and data centers are the foundation upon which our rapidly scaling infrastructure efficiently operates and upon which our innovative services are delivered. By holding this role, you will be an integral member of an ASIC team to build accelerators for some of our top workloads enabling our data centers to scale efficiently. You will have an opportunity to work with AI/ML and video codec experts in the company, help architect state-of-the art machine learning accelerators and contribute to modeling these accelerators. Come work and learn alongside our expert engineers to build 'Green' data center accelerators.", "salary": "US$136,000/year to US$203,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 5+ experience in either silicon architecture, silicon modeling, performance architecture, kernel development, or building tools for silicon. Programming in C, C++, Python, or related Programming Languages. Experience and knowledge of Computer Architecture, or tools for silicon development. Experience and knowledge working in building custom silicon.", "preferred_qualifications": "Master’s or PhD degree in Electrical Engineering, Computer Engineering or related areas Experience driving power and performance trade-offs", "responsibilities": "Work on developing Data Center Machine Learning ASIC architecture, algorithms, models, or tools. Analyze and map data center workloads to ASIC architecture, as well as develop performance and functional models to validate the architecture. Implement various reference silicon architecture models needed for the validation of the accelerators.", "company": "meta", "url": "https://www.metacareers.com/jobs/443507618281178"}