{"title": "US Indirect Tax Director", "level": "", "location": "Menlo Park, CA", "description": "Meta is seeking a highly experienced and motivated US Indirect Tax Director to join Meta’s state and local tax team. The successful candidate will be responsible for overseeing Meta’s US indirect tax strategy, compliance, and reporting functions. This role requires deep knowledge of US sales/use tax laws and regulations, strong team management skills, and the ability to collaborate effectively with stakeholders across the organization.", "salary": "US$224,000/year to US$296,000/year + bonus + equity + benefits", "key_qualifications": "Graduate degree with emphasis in Tax, JD / LLM. 18+ years of progressive experience in US indirect taxes at multinational corporation, public accounting, or law firm. Comprehensive knowledge of US indirect tax laws and regulations across multiple jurisdictions. Proven track record of effectively directing and developing high-performing teams. Proven analytical, problem-solving, and decision-making skills, with the experience to navigate complex issues and provide clear guidance. Proven communication and interpersonal skills, with the experience to collaborate effectively with both internal and external stakeholders. Experience to thrive in a fast-paced environment, managing multiple priorities and adapting to evolving business demands.", "preferred_qualifications": "", "responsibilities": "Direct a team of US indirect tax professionals, providing guidance, training, and mentorship to ensure they have the resources to excel in their roles. Collaborate with cross-functional teams to provide guidance on US indirect tax implications for new products, services, and business initiatives. Monitor legislative and regulatory changes, identifying potential impacts, implementing necessary solutions, and supporting tax policy initiatives. Develop and implement US indirect tax strategies, ensuring full compliance with applicable laws and regulations. Oversee the preparation and timely filing of all US indirect tax returns, ensuring accuracy and completeness. Design, implement, and maintain internal controls and procedures to ensure accurate calculation, reporting, and payment of US indirect taxes. Establish and maintain strong relationships with tax authorities to facilitate effective audit resolution. Stay abreast of industry trends and best practices with the focus on continually seeking opportunities to enhance processes and drive efficiency.", "company": "meta", "url": "https://www.metacareers.com/jobs/444725154867623"}