{"title": "Research Scientist, Demography and Survey Science", "level": "", "location": "Menlo Park, CA | Seattle, WA | New York, NY", "description": "The Demography and Survey Science team's mission is to improve the way we make decisions and measure impact both within and outside of Meta. We collect and analyze rich survey and behavioral datasets to understand new challenges, solve problems, and shape decisions. We are looking for quantitative social scientists with experience answering complex research questions to join us in this effort.\n\nOur interdisciplinary team includes those with expertise in statistical inference, survey methodology, causal inference and econometrics, regression modeling, exploratory data analysis, and mathematical demography, among other areas. In this role, you’ll own research end-to-end. This means you’ll navigate trade-offs while designing projects, proposing appropriate methodologies, analyzing data, and communicating results to diverse audiences in order to drive impactful decisions.\n\nStrong candidates may include social scientists, applied statisticians, or other applied researchers with expertise in quantitative research methods, experience working with large datasets and relational databases, and experience with survey methodology (e.g., bias correction, sampling). We are looking for candidates who can demonstrate methodological rigor, strong communication skills, and the ability to make research design choices that balance competing tradeoffs effectively.", "salary": "US$109,000/year to US$171,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's, Master’s, or PhD in social sciences (e.g., Economics, Political Science, Sociology, Psychology, Communication), or in a quantitative field (e.g., Statistics, Informatics, Econometrics) with experience answering social questions. Skilled in at least three or more of the following skills: statistical inference, survey methodology, regression modeling, exploratory data analysis, and experimental design. Knowledge of statistical analysis and programming languages (such as R/Stata, Python, SQL/Hive). Experience communicating analyses and results to diverse audiences. Experience initiating and driving research projects to completion with minimal guidance. Demonstrated experience in designing original research to address complex questions. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience with large data sets and distributed computing (Hive/Hadoop). Experience with Bayesian statistical models. Experience with primary data collection. Experience with survey sampling and weighting. Experience with observational causal inference (e.g., regression adjustment, matching, propensity score stratification), or quasi-experimental methods (e.g., instrumental variables, regression discontinuity, interrupted time series). Familiarity with qualitative research (e.g., focus groups, interviews, cognitive walkthroughs).", "responsibilities": "Develop a research agenda and drive research projects from end-to-end. Collaborate with cross-functional teams across the company to define relevant research questions. Design and deploy appropriate research methodologies to answer those questions. Develop innovate new approaches to resolve challenging problems. Provide teams with usable measurement strategies and methodologies to make better decisions. Deliver insights and recommendations clearly to relevant audiences.", "company": "meta", "url": "https://www.metacareers.com/jobs/445412144889759"}