{"title": "Component Quality Engineer, Silicon Products", "level": "", "location": "Fremont, CA", "description": "Meta is seeking a Component Quality Engineer responsible for working with Meta’s suppliers and manufacturing partners to develop and implement world class quality programs for advanced silicon products used in Facebook AI/ML, Compute, Storage and Networking products.", "salary": "US$170,000/year to US$240,000/year + bonus + equity + benefits", "key_qualifications": "BS Electrical Engineering or Computer Science, or equivalent. 5+ years experience in advanced silicon product design, fabrication, test, reliability or product engineering. Experiences with CPU, GPU or ASIC validation, functionality, test and reliability. Experience with chiplet based products. Experience with advanced logic foundry process and 2.5/3D packaging technologies. Knowledge of reliability mechanisms and modeling/predictive fail rate analyses. Proven understanding of quality systems, audit experience and knowledge of statistical quality tools to drive and assist suppliers in continuous improvement initiatives. Experience working with and managing off shore contract manufacturers. Proven communication skills.", "preferred_qualifications": "", "responsibilities": "Responsible for managing end-to-end quality, working closely with suppliers and internal teams to assure new product readiness and ensure performance meets the key Facebook quality and reliability metrics. Responsible for Supply Chain and Data Center quality excursion management through root cause analysis while driving implementation and validation of process improvement and corrective actions. Develop and implement component quality programs including continuous quality improvement initiatives. Use reliability prediction tools and techniques to evaluate product reliability performance on new products. Perform regular audits of manufacturing facilities. Monitor supplier’s adherence to new product introduction schedules to ensure predictable and stable mass production volume ramp. Conduct supplier capability and technology roadmap assessments to assist supply chain and hardware teams in vendor selection. Create and maintain all production process and quality documentation. Review all supplier product, process and engineering change notifications. 10% International travel may be required.", "company": "meta", "url": "https://www.metacareers.com/jobs/445638034646426"}