{"title": "Research Scientist - Generative AI (PhD)", "level": "", "location": "Menlo Park, CA | Seattle, WA | New York, NY", "description": "Meta is seeking a Research Scientist to join Monetization Generative AI (MGenAI). In the past year, generative AI has seen some of the most significant breakthroughs ever achieved, particularly in large language models and generative image models. Meta Monetization GenAI’s mission is to lead the charge in generative AI technology and build products that will help businesses become more productive and efficient. The team is particularly focused on image creative generation. Individuals in this role are expected to be recognized experts in AI and machine learning, particularly in areas such as generative AI and computer vision. The ideal candidate will have a keen interest in producing new applied science to make computers more intelligent, and more importantly convert that into production at a large scale.", "salary": "US$117,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree in Computer Science or related field or relevant experience. Track record of publications that demonstrate experience in a quantitative domain. Experience collaborating within a team to solve analytical problems using quantitative approaches. Experience manipulating and analyzing high-volume, high-dimensionality data from varying sources. Knowledge in a programming language. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.", "preferred_qualifications": "First-author publications at peer-reviewed AI conferences (e.g. CVPR, ICCV, ECCV, NeurIPS, ICML and ICLR). Experience conducting original research that can be applied to Generative AI research at Meta.", "responsibilities": "Collaborate on research that enables AI-based image/video synthesis and editing. Collaborate on research that enables learning the semantics of data (images, video, text, audio, and other modalities). Contribute research that can be applied to Meta product development. Influence progress of relevant research communities by producing publications. Collaborate and increase productivity on existing Meta AI projects as a contributing team member.", "company": "meta", "url": "https://www.metacareers.com/jobs/447260114581349"}