{"title": "SW Technical Program Manager, Mixed Reality OS Release", "level": "", "location": "Sunnyvale, CA | Burlingame, CA | New York, NY", "description": "Are you looking to shape the future of computing? Meta Reality Labs is bringing together cutting-edge research and engineering to deliver products and experiences for the future of immersive computing and connecting humans with entertainment, information, and each other. Meta Reality Labs is building software for all realities - Augmented or Virtual or Mixed for billions of users across the globe. \n\nOur team is expanding and we’re looking for experienced SW TPM, MR OS Release to help manage our MR OS software releases.", "salary": "US$134,000/year to US$196,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Engineering, Computer Science or a related technical discipline, or equivalent experience. 7+ years of software release management, systems engineering, hardware engineering, software engineering, or technical product/program management experience. Proven track record of successfully managing software releases for complex products or platforms at significant scale. Proven project management skills with demonstrated experience managing cross-functional programs in a matrix organization covering a range of areas. Effective communication and interpersonal skills, with the Experience to work effectively with cross-functional teams. Experience with release management tools and systems. Experience working in a fast-paced and dynamic environment. Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership. Experience in leading complex execution across multiple teams in different time zones, anticipating roadblocks and creating a path forward. Analytical and problem-solving experience with large-scale systems. Communicator who can translate high-level goals into tangible action plans, and vice-versa & expertise communicating with technical and non-technical stakeholders.", "preferred_qualifications": "Experience working with AOSP. (Preferred but not required)", "responsibilities": "Plan, coordinate, and execute software releases for our products. Facilitate release plans and schedules in collaboration with cross-functional teams. Facilitate communication and coordination between development, quality assurance, product management, and other stakeholders to ensure successful software releases. Monitor and report on release progress, including risks and issues, and take necessary actions to mitigate them. Develop and maintain release processes, procedures, and documentation. Drive visibility, accountability, and execution across their areas of software development for the organization. Resolve conflicts, maintain clarity on priorities and drive progress on execution. Stay up-to-date with industry trends and best practices related to release management. Find ways to achieve efficiencies in the release process through technology.", "company": "meta", "url": "https://www.metacareers.com/jobs/447681587800109"}