{"title": "Connectivity Design Engineer", "level": "", "location": "Denver, CO", "description": "Meta is seeking a Connectivity Design Engineer to join our DEC Design team. Our Data Centers are the foundation upon which our rapidly growing infrastructure efficiently operates and our innovative services are delivered. This role is responsible for the design of inside and outside plant structured cabling and infrastructure for our data center installations – including new builds, retrofits, special projects, and technology modifications. Design Engineers must be capable of developing designs as well providing effective oversight of outsourced design work. In addition to assuring timely delivery of designs that meet (or exceed) project requirements, Design Engineers are expected to drive best practices and establish tools, processes, and standards consistent with large-scale data center deployments. Full design lifecycle engagement is required – with lessons learned from field deployments rolled into future programmatic designs. The Design Engineer is expected to collaborate effectively with internal and external stakeholders – assuring all structured cabling design requirements are met in design execution.", "salary": "US$144,000/year to US$201,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor of Science degree in engineering or equivalent practical experience. 10+ years of experience delivering engineering results. Demonstrated expertise in physical infrastructure design including structured cabling and fiber-optic cabling. Proven leadership experience such as leading large complex projects, leading teams, coordinating with a wide variety and diverse number of stakeholders. Comprehensive knowledge of and experience with fiber optic components, cabling, interconnect products, technologies, and standards. Effective prioritization skills to continuously analyze workload and qualify priorities based on impact and effort, often involving shifting deadlines and quick turnaround. Workflow efficiency and automation – demonstrated experience in improving/developing processes to drive efficiency, automating wherever possible. Construction experience such as site walks, punch lists, field coordination, RFIs, clash detection, lessons learned feedback loops, etc. Mission critical engineering project experience. Detail oriented, experience providing solutions to complex problems, and proven skill to effectively manage deadlines. Demonstrated experience effectively engaging with diverse stakeholders (internal and external) to extract, analyze, and qualify requirements to drive solutions from inception to completion. Experience with construction management applications (e.g. e-Builder, Unifier, BIM360, Procore).", "preferred_qualifications": "Network design experience, including  Network/Transport Certification (CCNA or equivalent). Working knowledge of 40/100/400G Ethernet and CWDM, DWDM and optical transport network technologies. Experience with fiber topology evolution to achieve resiliency, and latency requirements. Experience with tooling & automation development (i.e. computer programming/scripting, database integration, dashboards, APIs). BICSI accreditation - RCDD / DCDC certification. PMP accreditation or similar.", "responsibilities": "Drive designated program initiatives end-to-end – from requirements gathering, to design development, cross-functional validation, and rollout. For special programs, drive global project execution in addition to program development. Actively seek and promote best design practices, processes, and improvements to establish program designs conducive to large-scale builds. Actively incorporate lessons learned from previous builds and design generations. Fluent interfacing with network transport and network architecture requirements. Oversee the design execution of complete and correct construction documents, schematic diagrams, pathways, rack systems, rack elevations, cable matrices, and bills of materials, as needed for all OSP, ISP, and Network structured cabling and infrastructure elements. Assist with request for proposal (RFP) process & bid documentation coordination for both design and construction contracts as required. Streamline deployment of project deliverables on short timelines. Validate and proof project deliverables and executable design documentation at each design milestone. Engage in construction administration phase for design-driven elements that require technical depth that cannot be resolved directly by the Design Consultant or at the Site Level– such as change coordination and request for information (RFI) responses. Partner with internal and external teams to drive programmatically approved changes across applicable projects. Oversee and maintain documents reflecting project completion deliverables (i.e. as-built documentation), updating as required. Collaborate with internal stakeholders to deliver project designs meeting capacity and network requirements as well as rollout timelines. Drive scalable structured cabling solutions throughout Meta owned or operated data center spaces and support facilities. Serve as a Technical SME for programs and projects that one leads. Provide regular project status updates and support GDCC and corporate dashboards that capture delivery, cost, quality, and other established metrics. Participate in various team syncs to drive alignment, visibility, and consistency in program and project execution. Identify and respond to risks and high-priority issues timely and effectively. Travel as required (~10-25%) to review projects and coordinate with onsite personnel and contractors at project locations.", "company": "meta", "url": "https://www.metacareers.com/jobs/447930221201920"}