{"title": "Enterprise Engineer", "level": "", "location": "Warsaw, Poland", "description": "The Infra Operations Products & services (IOPS) team builds, operates and provide best-in-class operational products and services for monitoring, troubleshooting and remediation of Meta's infrastructure. Our products consistently influence the enterprise software industry by defining new standards for how our customers, internally and externally, relate to their daily work. We are looking for experienced Enterprise Engineers who share a passion for tackling complexity and develop complex systems with high scalability, availability, data integrity, and reliability.", "salary": "", "key_qualifications": "Experience building intuitive systems in Java, PHP, C++, Python or Javascript; Experience with product design/systems design; Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience; 3+ years of demonstrated experience driving change within an organization and leading complex technical projects; 3+ years of experience building maintainable and testable code bases, including API design and unit testing techniques; 3+ years of experience working with relational databases and SQL", "preferred_qualifications": "Experience with Data pipelines and troubleshooting data pipelines; Experience with GenAI use cases", "responsibilities": "Build industry leading enterprise systems that are highly available, intuitive, scalable, and secure; Produce highly reliable and performant code with appropriate monitoring and alerting; Work with different sets of product managers, designers and other engineers to create software that optimizes for business metrics; Effectively communicate features and systems in detail; Execute on the teams' goals and technical direction and pursue opportunities that make the teams more efficient; Contribute towards long term technical vision and roadmap for your group of teams", "company": "meta", "url": "https://www.metacareers.com/jobs/451805613998689"}