{"title": "Director, Retail", "level": "", "location": "Atlanta, GA | New York, NY", "description": "Meta is seeking an experienced sales and marketing leader with demonstrated success managing established and emerging business categories. The Director will lead the Meta monetization strategy for a large omni-channel retail businesses within the US. The ideal candidate will be a strategic thinker with the ability to work cross-functionally to develop scalable solutions for their clients and their teams. They will build and manage a strategically focused/consultative sales team, selling Facebook’s marketing solutions to advertisers. We are looking for a self-starter who has demonstrated success dealing with ambiguity, managing c-suite relationships, building strategic plans, and problem-solving with limited oversight. Ideal candidates will have retail, home improvement, grocery, and/or e-commerce experience with strong management skills to successfully motivate and lead in a sales environment. Candidates should understand the role that consumer experience, data, tech, creative, and brand marketing play in customer acquisition and retention.", "salary": "US$223,000/year to US$297,000/year + bonus + equity + benefits", "key_qualifications": "10 or more years of experience with sales, marketing and/or retail; 5 or more years of experience with digital media; Experience driving revenue growth with emerging opportunities and established partnerships; Proven experience as a leader of change, achieving operational excellence by introducing performance measures, processes and systems; Experience building top-to-bottom relationships with marketing decision makers at brands and agencies; Demonstrated experience using advertising data to craft media strategy; Knowledge of the advertising technology and data/performance measurement trends; Communication and presentation experience translating insights, product information, and data into client value; Retail, grocery, and/or ecommerce experience with management skills to successfully motivate and lead in a sales environment", "preferred_qualifications": "5 or more years of experience with people management; Strategy/Consulting experience", "responsibilities": "Candidates should understand the role that consumer experience, data, tech, creative, and brand marketing play in customer acquisition and retention; Develop a deep understanding of the Retail category and the role of content across these industries, and convert VP through C-suite relationships to impact; Build, grow, and inspire a high-performing team. Act as player/coach by driving long-term opportunity and coaching team through short-term sales strategies; Own and be accountable for quarterly and yearly revenue goals, pipeline management and growth goals across a diversified book of business; Play the lead role in developing the holistic business of a full lifecycle marketer by owning vertical workstreams and/or strategic pillars of success; Work cross-functionally with GBG In-Market teams, Product, Marketing Science, Creative Shop, Sales Strategy, Planning & Operations, Agency, and Product Marketing to optimize our client efforts", "company": "meta", "url": "https://www.metacareers.com/jobs/454454787449425"}