{"title": "Network Engineer, Deployment & Support", "level": "", "location": "Singapore", "description": "Meta is looking for an Optical Deployment Engineer who will be responsible for the deployment and support of one of the world’s largest and most complex networks. As a member of this team, you will have a unique opportunity to be involved in projects related to implementation & scaling of the optical network at Meta. The ideal candidate is an engineer who is comfortable working in a fast-paced environment and constantly evolving network. A quick learner, proactive, and highly motivated engineer that is not afraid to challenge the status quo, with a creative mind to find solutions and workarounds for day-to-day problems. As an Optical Deployment Engineer, you are not afraid to propose new ideas, gather constructive feedback from others, and push forward to make these ideas a reality.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Demonstrated hands-on experience deploying optical networks. Experience with optical network design, installation and maintenance for service providers or enterprise networks. Knowledge of optical theory, transport technologies and the operation of optical transport systems. Experience with field-based work on Subsea Deployments, POPs, ISP, data centers and central office environments. Experience with optical test equipment and optical troubleshooting experience using OTDR, OSA, BERT and optical power meters. Experience creating rack elevations and other planned/install/as-built documentation. Effective time management and organization.", "preferred_qualifications": "Knowledge of coding in at least one language (i.e. Python), preferably for network or systems automation with knowledge of scripting languages. Knowledge of TCP/IP protocol, network management protocol, network routing protocol (like BGP), Layer 2 concepts (e.g. STP, VLANs etc.), ipv6 and network monitoring. Knowledge of Cable Landing Station & Data Center design and operational best practices. Experience working in a large cross functional global team environment.", "responsibilities": "Deploy, configure, and support a large-scale production optical network that spans longhaul terrestrial, regional metros and subsea networks, interconnecting data centers and Points of Presence (POP) sites across all regions with a primary focus on APAC region. Create and maintain Engineering Design Packages for subsea, metro, regional and long-haul DWDM rings/systems. Generate implementation plans and provide technical leadership and guidance during deployment activities. Collaborate with vendors/manufacturers to evaluate new hardware/software and create optical standards for network deployment teams. Review Acceptance Documents provided by vendors and subcontractors deploying equipment on our network. Provide technical expertise to network provisioning engineers for troubleshooting out-of-service or faulty circuits. Plan, schedule and perform complex network migrations. Work closely with the cross functional teams of Network Engineers, Planners, Logistics Vendors, and Fiber Providers to ensure seamless introduction of new optical technologies into the production network. Proactively contribute to documentation, automation and processes as they evolve. This role will involve some pre-planned travel from time to time.", "company": "meta", "url": "https://www.metacareers.com/jobs/454581094092814"}