{"title": "Network Engineer, Foundation and Support", "level": "", "location": "Reston, VA | DeKalb, IL | Fremont, CA", "description": "The Edge & Network Services (ENS) team at Meta is seeking passionate individuals to help us tackle the unique challenges and opportunities we face while contributing to our mission of connecting the world. This global team offers a unique career opportunity to work with cutting-edge network infrastructure technologies and talented engineers solving complex problems in the industry. For this role, we are looking for a Network Infrastructure Design Engineer with demonstrated experience in developing and deploying network connectivity solutions at scale in a data center or similar mission-critical data processing environment. Are you ready to shape the future of Meta's data center designs? As a member of the ENS Foundation Design team, you will collaborate with technical teams across the organization to ensure that critical networks supporting seamless commissioning, provisioning, and ongoing operations of our global data centers have their cooling, space, power, and network connectivity needs met in new infrastructure design initiatives. Your mission is crucial - to guarantee that Meta's new data center designs incorporate the network infrastructure needs of ENS and its stakeholders. Join us in this exciting endeavor and make a real impact on Meta's future!", "salary": "US$161,000/year to US$225,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 10+ years of work experience with designing and deploying large-scale data center connectivity infrastructure. Thorough knowledge of structured cabling and fiber optic infrastructure including design and installation best practices, industry standards, application, and limitations. Thorough knowledge of fault tolerant cooling and electrical architectures used for supporting network and compute hardware in a high availability environment. Thorough knowledge of the data center design, construction, and start up/commissioning processes. Experience leading cross-functional teams through partnership and driving large-scale data center or similar infrastructure design initiatives. Track record of solving problems, setting strategic direction, and executing tactically, and achieving measurable outcomes. Working knowledge of internet networking technologies (TCP/UDP, DHCP, DNS, routing, switching concepts), optical transport technologies (DWDM and Optical transceivers), and network diversity/redundancy concepts. Demonstrated experience to work effectively in a fast-paced, ambiguous environment and collaborate with global cross-functional teams to develop and execute plans that meet evolving business needs. Proven scoping, prioritization, multitasking, and communication skills required.", "preferred_qualifications": "Demonstrated 5+ years of experience leading and managing matrixed technical teams. Demonstrated experience leading electrical infrastructure new product development initiatives. Advanced Engineering degree in mechanical or electrical engineering disciplines. Experience working with on-site construction teams, and managing contractors and vendor relationships. Working knowledge of data center facilities management practices and supporting Operational Technology(OT)/Industrial Control Systems (ICS) including Building Management Systems, Distributed Antenna Systems, corporate WIFI, Precision Timing Protocol, fire protection, physical security access control systems. Working knowledge of data center infrastructure management (DCIM). Data center design or relevant telecommunications/Professional Engineering licensure. Proficiency with AutoDesk design tools (ACC/Revit/BIM 360). Familiarity with the Linux based systems and experience with scripting and automation (Bash, Python, Perl).", "responsibilities": "Act as a subject matter expert representing the network infrastructure design and deployment needs for Operational Technology(OT)/Industrial Control Systems (ICS) and other internal networks supporting the commissioning, provisioning, and ongoing operations of our global data centers. Collaborate across highly technical teams including network engineering, data center design and construction, and data center connectivity to develop, document, and incorporate network infrastructure cooling, space, power, and connectivity requirements into Meta data center product designs and standards. Build and nurture business relationships with key stakeholders, partners, and vendors. Initiate and lead strategic initiatives driving efficiency, innovation, and standardization of network infrastructure within the data center environment. Contribute to organizational level strategy and establish team roadmaps and goals that align with current business priorities and organizational strategy. Influence future iterations of data center and network designs to ensure seamless integration of new infrastructure technologies. Accountable for driving improvements in technical references, process, and training documentation in support of operational excellence initiatives. Support automation and tooling to drive consistency and efficiency in all aspects of infrastructure design, deployment, and operations. Lead network equipment rack level power product development and monitoring improvement initiatives. Perform site visits and work cross-functionally with construction, design architects/engineers, and contractors to validate cabling infrastructure and network builds according to Meta standards. Educate site design, construction, deployment, and operations teams on data center product design intent to minimize and proactively address site level design deviations and their impact. 20% to 30% travel required based on project demand.", "company": "meta", "url": "https://www.metacareers.com/jobs/455873346771807"}