{"title": "Quality Measurement Specialist - German", "level": "", "location": "Dublin, Ireland", "description": "The Global Quality Expert Review team drives accountability for operational excellence, quality metrics, continuous improvements, and lead the implementation of our quality systems at scale within a global network of vendors supporting content moderation. We partner directly with the vendors on quality metrics delivery, root cause analysis and drive cross functional alignment on action plans to drive improvements. We are looking for a passionate problem solver who is comfortable taking on new challenges, a strong communicator who embraces continuous learning, and a strategic thinker who can understand Meta’s overall integrity ecosystem. Successful candidates for this team are driven, adaptable, creative, proactive, and action oriented. They demonstrate a growth mindset and can successfully contribute to initiatives across various teams, countries and time zones.", "salary": "", "key_qualifications": "Bachelor's degree and/or masters or equivalent experience. Fluency in written and conversational English, German are essential. Strong analytical and creative problem-solving skills with excellent attention to detail. Passion for supporting the Facebook and Instagram community. Ability to work with potentially graphic and objectionable content. Self-starting, intellectually curious and creative individual comfortable operating in a fast paced, ever changing environment. Excellent communication and collaboration skills.", "preferred_qualifications": "Technical and data skills such as Excel and SQL and experience with visualisation tools such as Tableau to drive efficient analytics and reporting", "responsibilities": "Perform expert review of content and ads on Meta’s platforms against a set of guidelines. Gather and deliver market specific insights Meta’s platforms and use it to develop tailored recommendations to improve Meta’s Integrity outcomes. Communicate market specific insights to cross-functional partners to collaborate and improve our policies, processes and tools. This role may involve exposure to potentially graphic and/or objectionable content including but not limited to graphic images, videos, audio and writings, offensive or derogatory language, and other potential objectionable material, i.e. child exploitation, graphic violence, self-injury, animal abuse, and other content which may be considered offensive or disturbing. Partner with vendor operations to ensure that performance feedback is being shared with relevant teams and proactively track the impact and success of remediation plans. Develop and share subject matter expertise across areas of safety abuse and/or account support at global level. Contribute to projects that increase the effectiveness and efficiency of the Quality Expert Review team.", "company": "meta", "url": "https://www.metacareers.com/jobs/456265807258539"}