{"title": "Software Engineer, Computer Vision - Reality Labs", "level": "", "location": "Burlingame, CA", "description": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.\n\nAs Computer Vision Software Engineer on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.\n\nMeta is seeking AI Software Engineers to join our Research & Development teams. The ideal candidate will have industry experience working on computer vision related topics. The position will involve taking these skills and applying them to solve for some of the most crucial & exciting problems that exist on the web. We are hiring in multiple locations.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Experience in one or more of the following areas: Deep Learning, Computer Vision, AR/VR, Machine Learning or artificial intelligence\nBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\nExperience developing computer vision algorithms or computer vision infrastructure in C/C++ or Python", "preferred_qualifications": "Experience with distributed systems or on-device algorithm development\nExperience in deep learning and PyTorch\nExperience in language guided vision systems", "responsibilities": "Apply relevant AI and machine learning techniques to build intelligent rich perception systems that improve Meta's products and experiences\nAssist in goal setting related to project impact, AI system design, and ML excellence\nDrive large efforts across multiple teams\nMentor other AI Engineers & improve the quality of AI work in the broader team\nDevelop custom/novel architectures, define use cases, and develop methodology & benchmarks to evaluate different approaches\nApply in-depth knowledge of how the machine learning system interacts with the other systems around it", "company": "meta", "url": "https://www.metacareers.com/jobs/456282644017417"}