{"title": "Creative Strategist (Global Creative Scaling Team Hong Kong)", "level": "", "location": "Hong Kong", "description": "Come be part of the creative team at Meta that is leading the industry in new ways to build advertising ideas in the rapidly changing media, mobile and marketing world. As a Creative Strategist on the Global Creative Scaling team, you’ll be an essential team member tasked with transforming the creative output of thousands of clients across Greater China export businesses and clients across the globe. We are looking for someone with deep experience of Performance-driven digital advertising, either from within an eCommerce organization, or with extensive experience at a creative agency in China and/or for China eCommerce or has worked with Performance/Creative agencies in China. Your background could be Brand Strategist, Strategic Planner or Creative. You should have a strong understanding of how to develop and articulate creative ideas, and how to bring those ideas to life and apply them at scale. The ability to get hands on with our products such as Reels is an advantage. Most of all you should be happy getting your hands dirty making creative work and inspiring others to make their work for our platforms better. This position is based in our Hong Kong Office.", "salary": "", "key_qualifications": "5+ Years Experience in advertising, e-commerce or tech; Fluent in all aspects of our products and services, specifically Instagram and Facebook; Creative - You are able to come up with strategically grounded, insight driven ideas or creative opportunities and apply that at scale; Have the ability to bring an idea to life on a white board or presentation; Strategic - Understanding of brand marketing and how to build strategies across multiple verticals; Fluency in English and Mandarin", "preferred_qualifications": "Data fluency – you are happy getting your hands dirty with data, measurement and you are willing to learn new tools and distill creative and performance data into unique insights; A strong passion for people and desire to uncover consumer behavior, to help our global clients connect with customers in an impactful way; Entrepreneurial. We’re still only 1% done – this team is inventing everyday and it takes tenacity, bravery and the ability to see the big opportunities to thrive here; Experience with InDesign, Illustrator and Photoshop", "responsibilities": "Increase the creative sophistication and product adoption of the Greater China Export book of business through scaled solutions and initiatives; Work closely with sales and cross functional teams to understand the needs of the Greater China book of business and develop solutions to address them; Inspires the industry by representing Creative Shop and Meta at events in the market; Contribute to Global Creative Scaling team workstreams and programs through strategy and executional content development at a global level; Own sales relationships within your market and tier of business.", "company": "meta", "url": "https://www.metacareers.com/jobs/456702480213748"}