{"title": "Account Manager, Nordics (Norway)", "level": "", "location": "Dublin, Ireland", "description": "Meta's Small and Medium Business group contributes to Meta's mission by connecting businesses around the world with their customers through Meta's full suite of advertising solutions. We succeed when we help our customers grow their business. People joining our team will have an outstanding opportunity to build client and agency relationships. Account Managers will leverage customer insights to help clients build their business using Meta to drive success. The ideal candidate will be a proactive individual passionate for sales and marketing. The role of the account manager will be to establish, own and manage an expanding portfolio of direct customers, focusing on driving revenue via account planning, product adoption, education and customer satisfaction. Success in this position requires strong consultative sales skills, a focus on customer service, and the ability to thrive in a dynamic and data-driven, team-focused environment delivering against tight deadlines. This position is based in Meta's EMEA Headquarters in Dublin.", "salary": "", "key_qualifications": "Bachelors or Masters degree or equivalent practical experience. Critical thinking, analytical skills with an entrepreneurial and proactive mind-set. Ability to effectively prioritise tasks and manage time, even under high-pressure situations. Ability to articulate complex data stories, in simple language to customers via day to day communications and regular presentation. Customer management experience. Strong team working skills and adaptability. Ability to present key client issues in an effort to be the customer advocate within Meta. Fluency in English and a Nordic language (Danish, Norwegian, Swedish, Finnish).", "preferred_qualities": "Language proficiency in Norwegian. Previous experience in sales, account management, sales support, agency account management or consulting.", "responsibilities": "Manage a portfolio of clients, with a focus on driving revenue growth. Drive product and best-practice adoption across the portfolio. Build mutually beneficial relationships with advertisers to grow their spend. Identify growth opportunities and trends across the portfolio. Effectively manage priorities and time in order to meet deadlines and administrative tasks.", "company": "meta", "url": "https://www.metacareers.com/jobs/457003560465911"}