{"title": "Client Solutions Manager (CSM) - Ecommerce & Omni-Channel, Turkey", "level": "", "location": "London, UK", "description": "The Client Solutions Manager for Meta’s Global Business Group team partners with our most strategic clients to make sure they are successful with Meta. This is an outstanding opportunity to build and manage key relationships, serve as a consultative product expert and a trusted adviser in marketing, leading strategy, media planning, creative, tech integration, and measurement for our top clients across various verticals including Ecommerce, Retail, CPG and other industries in Turkey.\n\nThe Client Solutions Manager is a strategic solution-driver with a focus on developing ROI-positive marketing strategies, driving growth by constantly improving performance for advertisers and implementing measurement & attribution solutions. This role is responsible for optimizing complex opportunities and using data and analytics to build consultative and technical solutions for our customers, providing business insights, driving revenue, advertiser education, and satisfaction through a consultative, data-driven approach.\n\nSuccess in this position requires strong consultative sales and analytical skills, a focus on client service and commercial acumen, and the ability to thrive in a dynamic, team-focused environment. You should have a deep passion for Facebook, Instagram, Meta’s advertising solutions and the overall marketing/tech ecosystem.\n\nThis role will be located in our office in London, UK.", "salary": "", "key_qualifications": "5+ years of experience in customer acquisition or in marketing, media, and/or consulting. Experience to communicate, collaborate and work effectively in a team, with cross-functional teams and with multiple layers within the organization (internally and externally). Demonstrated experience with digital media platforms, advertising metrics, and industry trends (Direct Response marketing, data and technology solutions, ad-tech, partnerships) Experience and passion for working with numbers, analyzing large datasets and delivering actionable insights Experience working directly in marketing, media and/or consulting firms. Ability to turn data into actionable insights that inform strategies. Able to lead multiple cross-functional projects with a high attention to detail. Self-starter with a strong work ethic and ability to work independently with high intensity and urgency. Effective and creative problem-solving and decision-making skills. Ability to travel as needed for client and partner meetings. Consultative selling skills. Fluency in both Turkish and English.", "preferred_qualifications": "Experience with business case modeling and market/opportunity sizing. Passion for ad tech, working with data, knowledge of Python, SQL, and/or statistical packages a plus. Experience in digital marketing measurement solutions, MMPs and attribution models.", "responsibilities": "Identify, create, and implement marketing solutions grounded on achieving measurable business results for our clients. Develop vertical expertise, including industry research and perspective, to drive overall business objectives and marketing solutions for advertisers. Including 1st party data, ecomm platforms and attribution and measurement systems. Work with businesses to understand their objectives and develop the Meta strategy in partnership with the Client Partner, which will constitute building on insights, crafting marketing strategies and media plans, creative guidance and measurement recommendations. Provide dedicated account management to top clients, to develop, manage, optimize, and support strategic account plans, and leverage data to create business solutions for clients. Project Management - Work and collaborate with a diverse group of internal cross-functional teams, managing complex work streams to optimize marketing objectives for clients. Manage analytics and dashboards to advise clients (e.g. daily client facing data/insights reporting, understanding performance across multiple accounts across multiple country used by clients). Manage strategic marketing conversations with clients, agencies, and partners (media, creative, measurement partners, MarTech, etc.) Advise clients on media and creative strategy, planning, measurement and optimization of campaigns to deliver against Key Performance Indicators. Use data and insights to guide strategy and implementation of Meta solutions against client's marketing objectives. Manage internal account operations (revenue delivery, media recommendations, troubleshooting issues, optimization opportunities). Manage planning, execution, ongoing reporting and optimisation of campaigns (oversee budget spend, manage internal analytics and dashboards, provide optimisation and real time recommendations).", "company": "meta", "url": "https://www.metacareers.com/jobs/458162480270803"}