{"title": "Research Scientist, AI Core Machine Learning", "level": "", "location": "Sunnyvale, CA", "description": "Meta is seeking a Research Scientist to join the Ads Ranking team within the Monetization org to advance the state-of-the-art in AI. We value key investments to ship breakthrough Ads ranking models and infrastructure to enable multiple products through a combination of fundamental research, new ML tools, and platforms which are designed for reuse. Individuals in this role are expected to be recognized experts in identified research areas such as Artificial Intelligence, Machine Learning, Computational Statistics, and Applied Mathematics, particularly including topics such as Deep learning, Data Representation, Sequential Decision Making, Reinforcement learning, and Graph Learning. The ideal candidate will have an interest in producing new science to understand intelligence and technology to make computers smarter, and an equal interest in taking the new research findings and implementing it towards product needs. Our mission is to cultivate enduring business growth and amplify efficiency through the development of state of the art AI technology designed to address intricate Monetization problems and aligned with our core business objectives.", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Currently has, or is in the process of obtaining a Ph.D. degree in Machine Learning, AI, Computer Science, Statistics, Applied Mathematics, Data Science, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Experience in solving modeling problems using AI or ML methodologies. Experience with Python, C++, Java, or other related languages. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment. Research experience in Deep learning, Data Representation, Sequential Decision Making, Reinforcement learning, and/or Graph Learning.", "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, ICML, ICLR, AAAI, etc. Experience with developing Machine Learning models at scale from inception to business impact. Experience working and communicating cross-functionally in a team environment. Demonstrated research and software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub). Experience manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.", "responsibilities": "Help advance the science and technology of intelligent machines. Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities). Lead research to advance the science and technology of Deep Learning. Work on research projects, strategies, and problems of moderate to high complexity and scope. Identify and define both short and medium term objectives for the Monetization org. Produce and present publications that influence the progress of AI or Machine Learning in relevant research communities. Design policies, processes, procedures, methods, tests, and/or components, from inception for end-to-end systems. Collaborate closely with cross-functional partners and contribute towards Meta's research product development.", "company": "meta", "url": "https://www.metacareers.com/jobs/458872820167199"}