{"title": "Postdoctoral Researcher FAIR (PhD), AI Security - Paris", "level": "", "location": "Paris, France", "description": "Meta is seeking a Postdoctoral Researcher to join a new AI Security team at FAIR (Fundamental AI Research).\n\nWe publish groundbreaking papers and release frameworks/libraries that are widely used in the open-source community. Recent examples include the Seamless family of translation models, the Audiobox speech generation model and their applications. We closely collaborate with other organizations at Meta to bring the latest research findings to production.\n\nWe are looking for a Postdoctoral Researcher to join a FAIR team exploring new approaches to making AI safer, fighting deepfakes and preventing harmful content. Past work in that space include watermarking models such as Stable Signature or AudioSeal. The mission is to develop state of the art algorithm with a focus on open research and scientific novelty.\n\nAs a Postdoctoral Researcher, you will help us develop innovative models and algorithms at the cutting edge of AI Research. The ideal candidate should have a strong background in multimodal modeling, computer vision or speech synthesis/recognition.", "salary": "", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree in the field of Artificial Intelligence, Machine Learning, Neuroscience, Neuroimaging, or equivalent practical experience. Degree must be completed prior to joining Meta.\n\nResearch experience in one or more of these areas: speech recognition, speech synthesis, machine translation, audiovisual understanding or generation, machine learning, deep learning, or related fields.\n\nExperience working with machine learning libraries like Pytorch, Tensorflow, etc.\n\nKnowledge of deep learning and neural networks.\n\nExperience with scripting languages such as Python and shell scripts.\n\nMust obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience with developing scalable machine learning models in at least one of the following areas: speech recognition, machine translation, unsupervised/semi-supervised training, on-device modeling, acoustic modeling, or relevant areas.\n\nExperience with developing machine learning models for both server-based and embedded solutions.\n\nExperience with large scale model training, implementing algorithms, and evaluating speech and language systems.\n\nProven track record of achieving significant results as demonstrated by publications at leading conferences such as NeurIPS, ICLR, ACL, EMNLP, ICASSP, INTERSPEECH, or similar.\n\nExperience working and communicating cross functionally in a team environment.", "responsibilities": "Perform research to tackle unsolved real-world problems and push the state of the art in AI security, including watermarking.\n\nIndependently design and implement algorithms, train state of the art models on large data, and evaluate their performance.\n\nWrite publications and revise them based on the feedback from colleagues, mentor(s) and reviewers.", "company": "meta", "url": "https://www.metacareers.com/jobs/459320546673205"}