{"title": "Pre-Discovery Hardware Engineer", "level": "", "location": "Sunnyvale, CA | Redmond, WA", "description": "At Meta Reality Labs we aim to bring together the brightest cross-disciplinary minds in one place to deliver on our mission: build tools that help people feel connected, anytime, anywhere. As a Hardware Engineer on the Pre-Discovery team, you will take a critical role in exploring products and experiences for MR, AR, or other new technology initiatives. You will become part of a team exploring developing concepts through prototyping and into mass-production consumer electronics. You will work as part of a cross functional team requiring collaboration and curiosity in domains other than mechanical engineering. Our ideal candidate has strong mechanical engineering fundamentals, prototyping skills, CAD fluency, manufacturing process knowledge, and experience designing consumer electronics.", "salary": "US$204,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "BS in Mechanical Engineering or equivalent industry experience; 5+ years of industry experience in mechanical design, including shipping consumer electronics; Experience in Design for Manufacturability (DFM), Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, geometric tolerancing, and 3D/2D CAD; Working knowledge in material properties, such as plastics, metal, adhesive, glass, etc; Testing and analysis experience (FEA, Simulation, Design of Experiments, etc.); Knowledge of high-volume manufacturing techniques (stamping, machining, injection molding, etc.)", "preferred_qualifications": "MS or PhD in Mechanical Engineering; 7+ years of product design and development experience of handheld and/or wearable electronics for high volume manufacturing, including full systems ownership; Experience designing handheld and wearable electronics for high volume manufacturing; Experience with NX; Experience with products cosmetic surface treatments and interfacing with industrial design teams; Experience designing for human factors", "responsibilities": "Lead early mechanical and product architecture definition or provide technical leadership to a larger development team; Model, build, test, and refine prototypes and characterization test systems; Collaborate in a team environment and work across engineering disciplines to develop systems and manage trade offs across electronics, mechanics, optics, sensors, haptics, firmware and software; Push state-of-the-art technologies and approaches to solving complex mechanical problems; Leverage external teams (CM/JDM/Vendors) to maximize the focus of our internal resources on adding value and differentiation to our products; Conduct feasibility studies and analysis to evaluate new technologies and components. Propose innovative solutions to enhance product performance and features.", "company": "meta", "url": "https://www.metacareers.com/jobs/460770616547099"}