{"title": "Data Science Manager, WhatsApp Business", "level": "", "location": "Menlo Park, CA", "description": "As a Data Science Manager at Meta, you will help shape the future of the experiences we build for billions of people and hundreds of millions of businesses, creators, and partners around the world.\n\nBuilding a big business that is good for our users is a key priority for WhatsApp.  The role is within the Business product team. The team is responsible for building best in class products for business that will enable WhatsApp to achieve it's monetisation objectives.\n\nWe are looking for a Data Science Manager to lead a multi-layered team of data scientists and partner with product managers, software engineers, product designers, and other disciplines to fulfill our mission. As critical members of the product leadership team, our data scientists bring their expertise to define the metrics and frameworks that shape the overall priorities of our teams, design cutting-edge measurement to put high-fidelity data behind these artifacts, and perform product, ecosystem, and experimental analyses to drive long-term strategy as well as day-to-day product development.\n\nAbout the role:\n\nProduct leadership: You will use data to understand the product and business ecosystem, quantify new opportunities, identify upcoming challenges, and shape product development to bring value to people, businesses, and Meta. You will help develop strategy and support leadership in prioritizing what to build and setting goals for execution.\n\nAnalytics: You will guide product teams using data and insights. You will focus on developing hypotheses and employ a diverse toolkit of rigorous analytical approaches, different methodologies, frameworks, and technical approaches to test them.\n\nCommunication and influence: You won’t simply present data, but tell data-driven stories. You will convince and influence leaders using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.\n\nPeople leadership: You will inspire, lead and grow a world-class team of data scientists and data science leaders.", "salary": "US$206,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience in a team leadership role, including 2+ years of experience with people management through layers.\nExperience communicating both in low-level technical details as well as high-level strategies.\nBS degree in a quantitative discipline (e.g., statistics, operations research, econometrics, computer science, engineering), or BS/MS in a quantitative discipline with equivalent working experience.\nA minimum of 7 years of work experience (3+ years with a Ph.D.) in applied quantitative field, including a minimum of 2 years of experience managing analytics teams.\nExperience in cross-functional partnership among teams of Engineering, Design, PM, Data Engineering.\nTrack-record driving product roadmap and execution.", "preferred_qualifications": "Master’s or Ph.D. degree in Mathematics, Statistics, Computer Science, Engineering, Economics, or another quantitative field.\n7+ years of experience doing quantitative analysis, statistical modeling or machine learning in the experimentation space, including 3+ years of experience in the gaming or media industry.\nExperience partnering with and influencing stakeholders of all layers and functions, from Content to Product to Marketing.\nYou can be technically hands on when needed, especially with translating ambiguous concept to measurement or understanding ecosystem trends.\nProven track record of leading high-performing analytics teams and up-leveling the team.", "responsibilities": "Inspire, lead, and grow a team of data scientists and manager(s) to fulfill our longer term vision.\nActively influences the design of the strategy and shaping of the roadmap within this scope. Generate and use team insights to set and prioritize longer term goals.\nDrive analytics projects end-to-end in partnership with teams from Engineering, Product Management and across the Analytics community to inform, influence, support, and execute product strategy and investment decisions.\nDevelop understanding of complex distributed systems and sub-components, as well as broader industry challenges, to identify present and future risks and opportunities.\nWork with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches.\nGrow analytics expertise around you, upskilling your team, engineers, and others, to increase overall team impact.", "company": "meta", "url": "https://www.metacareers.com/jobs/461701599796315"}