{"title": "Lead, Product Content Operations", "level": "", "location": "Los Angeles, CA | Menlo Park, CA", "description": "Meta’s Product Content Operations team is a global group of content experts whose remit is to improve content experiences at scale across platforms and products. The team is looking for a skilled people manager to support our US West Coast and APAC teams, reporting to the Head of PCO Content Recommendations. The ideal candidate will have a combined technical/editorial background that includes an ability to translate engineering and product requirements into actionable work flows, including products involving Machine Learning and Generative AI. All candidates are expected to have strong organizational and communications skills with demonstrated skill in Excel/Google Sheets, data analytics, query experience and product tools, in addition to previous professional experience in content management, content creation, or journalism. This position will support direct reports who serve 7 days/week across multiple time zones, so the candidate must be flexible and agile with experience on 24/7 teams. This person will play a leadership role across not only the Global Partnerships + Content Org, but also with engineering and product leaders within Facebook, Instagram, Threads and WhatsApp. Candidates should have proven editorial judgment, as well as experience managing content teams through every stage of product development, including roadmap formation, iterative testing, and quality control efforts. Experience with Human-in-the-Loop interventions is required.", "salary": "US$159,000/year to US$223,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of professional experience in hiring, managing and developing individual contributors; 10+ years of professional experience in content or social media management or journalism, with combined experience in software or technology industry, partnering directly with engineering/product teams; Demonstrated project management experience (3+ years), in a technology environment; Critical thinking/analytical leadership experience; Experience presenting and communicating to senior leadership; Proficiency in the Google suite of professional products, including Google Sheets; Proven track record of collaborative approach to problem solving, experience building internal relationships and operating effectively with cross-functional partners in a fast-moving environment; Proven to manage a team across multiple countries, characterized by a culture of inclusion and a growth mindset", "preferred_qualifications": "Fluency in multiple languages", "responsibilities": "Manage and develop operations across an always-on, 24/7 global team of content managers serving a complex set of overlapping engineering and product teams; Manage and develop a talented and diverse group of content managers across regions; Drive deliverables – including data-driven analyses – on a fast-paced schedule; Manage cross-functional relationships with strong upward and outward communication and organizational skills; Drive project development across recommendations systems, including Generative AI products across the Meta Family of Apps; Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm", "company": "meta", "url": "https://www.metacareers.com/jobs/462598693193886"}