{"title": "Technical Program Manager, AR Systems Software", "level": "", "location": "Burlingame, CA", "description": "Our team is expanding and we are looking for an experienced Technical Program Manager (SW TPM) to help manage the integration of new Software and Firmware technologies for our AR product lines. As a Systems Software TPM, you will be responsible for planning, coordinating, and executing the integration and release of technologies that provide the software foundation for our next generation AR Glasses and wearable products. This TPM will work across organizations to plan the feature development from pre-Silicon to post launch/in-market for custom ASICs, off-the-shelf chipsets and sensors. We are looking for TPMs with a proven track record developing and releasing high quality products, leveraging a deep understanding of software and hardware interaction, along with skills in managing large, complex projects will help make our products a success. This role will have the opportunity to work closely with world-class development teams and leaders across the organization to deliver cutting edge technology into AR products at Meta.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "Project management skills with demonstrated experience managing cross-functional programs in a matrix organization covering a range of areas. B.S. in Engineering, Computer Science, or a related technical discipline, or equivalent experience. 7+ years of systems engineering, hardware engineering, software engineering, or technical product/program management experience. Experience operating autonomously across multiple teams, demonstrated critical thinking, thought leadership, and an experience to lead teams through ambiguity to clarity. Demonstrate knowledge of firmware development and integration processes for consumer electronics devices, including experience with embedded systems and real-time operating systems. Experience in leading complex execution across multiple teams in different time zones, anticipating roadblocks and creating a path forward. Analytical and problem-solving experience with large-scale systems.", "preferred_qualifications": "Experience implementing and managing the development process for highly constrained, consumer device products. Knowledge of Continuous Integration and Continuous Delivery (CD/CI) pipelines. Experience in working with DevOps and Agile methodologies. Working knowledge of Software Development Lifecycle. Good understanding of application infrastructure, system architecture, operating systems, and power/thermal management. Evaluate and clearly communicate tradeoffs for technical solutions in the Shiproom. Experience developing and deploying products using Android operating system (AOSP).", "responsibilities": "Lead the integration of Systems Software (OS, Firmware, Drivers, Power Management) into our AR products, working closely with cross-functional teams including hardware, software, and quality assurance. Develop and manage project plans and schedules for Software/Firmware integration projects related to AR devices. Dive deep into technical systems to triage risks and issues found, take necessary actions to mitigate them and stay connected to the details to help make the right integration trade-offs. Identify and mitigate risks, and develop contingency plans as needed. Drive effective teamwork, communication, collaboration, and commitment across cross functional teams (quality assurance, product management, and other stakeholders) with varied priorities. Monitor and report on progress, and escalate any issues or delays to management as necessary. Collaborate with other TPMs, Engineers, Product Managers and cross functional partners to ensure that Systems software integration plans align with overall product development goals and objectives. Work closely with leadership to develop and implement strategies for improving processes across the organization. Stay up-to-date with industry trends and best practices in software integration and AR devices to identify opportunities for process improvement. Represent Meta with external chipset providers to define system software requirements, align roadmaps, solution change requests, and drive resolution of open issues. Communicator who can translate high-level goals into tangible action plans, and vice-versa & expertise communicating with technical and non-technical stakeholders in a variety of forums and formats.", "company": "meta", "url": "https://www.metacareers.com/jobs/463821079761080"}