{"title": "Associate General Counsel, Litigation", "level": "", "location": "Los Angeles, CA, Menlo Park, CA, Seattle, WA, Washington, DC, New York, NY, San Francisco, CA, Chicago, IL", "description": "Meta seeks an experienced, highly motivated attorney to serve as Associate General Counsel on the North American Litigation team. This role requires good judgment, a strong work ethic, excellent communication and relationship-building skills, and a strong interest in learning about new technologies and areas of the law. This is a unique opportunity to work on novel issues in an exciting, fast-paced environment.", "salary": "US$198,000/year to US$266,000/year + bonus + equity + benefits", "key_qualifications": "J.D. degree (or foreign equivalent) and membership in at least one U.S. state bar; 8+ years of commercial litigation experience at a law firm, government, and/or in-house role; Experience thinking strategically to solve complex legal challenges and managing multiple high priority projects simultaneously", "preferred_qualifications": "Experience working with cross functional teams, including experience managing relationships outside of legal; Drafting and advocacy skills; Trial and appellate experience; Experience with highly-technical, software-related subject matters", "responsibilities": "Manage and drive strategy for a variety of litigation and pre-litigation matters, including intellectual property litigation (trademark and/or copyright), regulatory litigation, consumer class actions, antitrust, constitutional, and commercial disputes, and other content-related matters; Collaborate with and manage outside counsel; Advise cross functional teams on litigation strategy and risk; Coordinate and actively participate in internal discovery activities in partnership with our eDiscovery team; Develop creative approaches to managing legal risks and resolving disputes; Maintain flexibility and willingness to work on projects in other areas and assist other team members with matters as needed", "company": "meta", "url": "https://www.metacareers.com/jobs/464279503066489"}