{"title": "Global Head of Media, Reality Labs", "level": "", "location": "Los Angeles, CA | Burlingame, CA | New York, NY", "description": "At Meta Reality Labs, we're building tools that help people feel connected, anytime, anywhere. This includes Meta Quest, Ray-Ban Metas, AR and MR software and content, research and development labs.\n\nWe're looking for an accomplished consumer media marketing leader for the global media team for Meta Reality Labs. This person will be responsible for leading the team driving our integrated media campaigns, determining the right media and communications strategies, locations and distribution for our marketing campaigns to increase awareness and consideration, ultimately generating demand and driving conversion across the full marketing funnel, while strengthening our Meta brand overall.\n\nThe ideal candidate possesses sharp strategic, operational and creative instincts across brand and performance media honed at the world's best brands, experience demonstrating short- and long-term media effectiveness, a deep understanding of the value of various channels and the ability to support and inspire a team to do the best work of their careers while partnering deeply with an agency team. They are an innovator who can advise and oversee execution, effectively collaborate with cross-functional leadership, and establish operational excellence to maximize impact across the team.\n\nThe candidate will join our Global Media team as part of our Consumer Marketing Organization. The global media team at Meta works across our consumer efforts across our family of apps and services.", "salary": "US$227,000/year to US$296,000/year + bonus + equity + benefits", "key_qualifications": "15+ years media experience within marketing/advertising organizations\n8+ years management experience, including experience managing people managers\nLeadership experience at a Media company/agency\nExperience overseeing marketing work with a portfolio of products at global scale\nPerformance marketing and digital media experience\nProven experience influencing\nKnowledge of industry trends and innovation in media, tracking, analytics and research\nKnowledge of consumer and cultural media trends\nExperience leading media strategy across a variety of channels and audiences (Digital, Social, TV, OOH, Audio, Sponsorships, Partnerships, etc.)", "preferred_qualifications": "Bachelor's degree\nExperience working in-house at a consumer technology company\nExperience working with products that are sold through a variety of retail channels  (D2C, Big Box, specialty retailers)\nExperience working and thriving in a self-starter, fast-paced and changing environment\nExperience leading in a complex, cross-functional organization across a portfolio of brands\nDigital-first approach to solving complex brand and product challenges", "responsibilities": "Lead the global media team for Meta Reality Labs, including strategic planning, media planning, plan delivery and measurement.\nSet vision, articulate opportunity and lead the media strategy and plans for all Meta Reality Labs brands, including Meta Quest, Meta Horizon, Ray Ban Meta and other current and future products to deliver business outcomes.\nBuild strong working relationships and influence cross-functional partners across Marketing, Creative, Insights & Analytics, Social and Brand Strategy in order to develop innovative, impactful and integrated work and definitions of success.\nIdentify and proactively craft new processes and approaches to leverage paid media to drive brand healthy and business growth.\nDrive a results driven mindset throughout the team and instill a high level sense of accountability to achieve goals.\nDrive performance and efficacy across individual and collective media channels, leveraging quantitative and qualitative insights to influence media business strategies, and inform tactical planning, execution and optimization.\nDrive capability for the media discipline at scale globally through partnership with Global Media leadership and other internal partners, effectively building full funnel growth for our products and services.\nOversee and optimize agency collaboration and model to deliver business goals.\nSteward team's development, impact and career growth while modeling inclusive behaviors as a cross-functional leader and people manager.\nPartner with media and marketing leadership across the Meta family of brands.", "company": "meta", "url": "https://www.metacareers.com/jobs/467745239175294"}