{"title": "Direct to Consumer Sales Manager", "level": "", "location": "Seattle, WA | Burlingame, CA", "description": "Meta Reality Labs is looking for a highly talented Direct to Consumer Sales Manager focused on driving the performance of our digital products globally. Reporting to the Global Director of DTC Sales, this role will lead all related sales activity for digital products across three regions. The right candidate will possess leadership and analytical skills as well as have the ability to effectively influence and communicate cross functionally with all levels of management. The candidate will thrive in a fast-paced, team-oriented environment, working cross-functionally with the Merchandising, Order Operations, Sales Analytics and other cross functional teams to optimize our opportunity and drive sales results.", "salary": "US$129,000/year to US$187,000/year + bonus + equity + benefits", "key_qualifications": "Knowledge of the VR market, industry trends, market conditions, and competitive landscape. Proven track record in delivery of sales quotas against business plans. 8+ years experience in online sales experience. Experience managing digital products with global scope. Experience managing workload within fast paced timeframes.", "preferred_qualifications": "MBA / Masters degree. Capacity to get things done at short notice while collecting information from a variety of internal and external sources.", "responsibilities": "Drive performance of our digital products across all DTC surfaces and capabilities globally. Create and present DTC channel specific strategy to executives and internal stakeholders to align resources and achieve mutual goals. Build and grow relationships with cross functional teams and other channel leaders to drive DTC channel goals as well as cross channel alignment. Seek out data, provide insights, and deliver foresight that drives the growth of our DTC sales. Define and manage an annual business plan for digital products across key activities to be carried out each quarter. Partner with cross-functional peers in Merchandising, Order Ops, Sales Analytics, Finance etc. to optimize our DTC business. Own forecast planning inputs with Demand Planning. Review sell out data to identify new opportunities within existing product ranges. Provide an objective viewpoint based on an in-depth understanding of commercial and competitive information. Achieve monthly/quarterly/annual targets.", "company": "meta", "url": "https://www.metacareers.com/jobs/468415052215287"}