{"title": "Clinical Study Lead, Health and Wellbeing", "level": "", "location": "Burlingame, CA", "description": "The Meta Health and Wellbeing team is seeking a highly experienced clinical study manager to support clinical research operations. The Clinical study manager will work closely with other clinical operations team members and clinical research scientists on digital health projects aimed at improving morbidity, mortality and inequity in health outcomes throughout the world. The ideal candidate will have expertise in clinical research operations, including working with research scientists/ investigators on a variety of research studies (in academic or industry settings), interacting with institutional review boards, and successful execution and quality monitoring of clinical research protocols. They can work on multiple concurrent clinical research studies, including a range of study types and clinical areas. The ideal candidate also brings a deep experience working in interdisciplinary teams. A successful candidate in this role is highly collaborative as well as self-driven, passionate, and able to execute consistently in a fast-paced environment.", "salary": "US$116,000/year to US$166,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience with clinical research coordination/operations in industry and/or academic settings, and/or work in a clinical setting in North America. Experience with digital health/health and wellbeing/medical device research. Proven knowledge and skills with regard to conduct of human subjects clinical research. Bachelor with minimum 7 years experience or Master with minimum 5 years experience, PhD or equivalent with minimum 2 years experience", "preferred_qualifications": "Industry experience, ideally including digital health and/or consumer health product research experience. Experience working with contract research organizations, and with virtual or remote clinical studies. Experience with multi-center clinical research projects, regulatory studies, and a variety of clinical study designs and modes of study data capture and management.", "responsibilities": "Support clinical research infrastructure and operations with contract research organizations and/or academic institutions. Partner on clinical research protocol development, execution, and quality management as a key contributor on the health and wellbeing research team, and in collaboration with engineering, product management and other cross-functional teams. Day-to-day execution of study roadmaps, including documentation, recruiting, data management, data quality monitoring and reporting. Develop and train clinical study coordinators on standard operating procedures, use of electronic data capturing systems, and data monitoring procedures. Travel at least 25%.", "company": "meta", "url": "https://www.metacareers.com/jobs/468558638908058"}