{"title": "Project Manager, Problem Integrity Operations", "level": "", "location": "London, UK", "description": "The Global Operations Integrity Operations Team strives to create a safe atmosphere for the Meta communities by way of outstanding support, education, and care for the various people around the world who use our platforms. We pride ourselves in helping prevent online and real-world harm by building fast, scalable support systems to address safety-related incidents on our products, and by influencing others to collaborate on cross-functional initiatives.\n\nWe are seeking an experienced self-starter with a passion for mitigating real world harm and protecting our community to join our Integrity Operations Team. We count on our project managers to deliver both qualitative and quantitative insight into user behavior in order to drive prevention and detection solutions at scale. By working cross functionally, we identify and pursue areas for process and product improvement, enabling us to better protect our community at scale. And by focusing on decision quality, we ensure that we are held accountable for our actions. This role will work closely with partners across Engineering, Policy, and other Meta teams to drive operational projects in a fast paced and data driven environment.", "salary": "", "key_qualifications": "4+ years of experience working in an Operations, Analytics, Product, Engineering, Consulting, Project Management or equivalent team. 3+ years of project/program management experience driving end to end initiatives with minimal guidance. 2+ years of experience analyzing large datasets in SQL, Google Sheets, or similar tools. Experience communicating results of technical analyses with non-technical partners and leadership teams to influence the strategy of those teams. Experience working in, communicating with, and leading global cross-functional project teams. Demonstrated experience navigating ambiguity and achieving outcomes in fast paced environments. Strategic thinker with analytical and creative problem-solving skills. Ability to work with potentially graphic and objectionable content.", "preferred_qualifications": "1+ years working in integrity, trust and safety, or policy. 1+ years experience using SQL queries or R to perform quantitative analysis. Experience operating autonomously across multiple teams.", "responsibilities": "Deliver projects involving quantitative analysis, industry research, and strategy development, working directly with global cross-functional teams to implement next-generation community experiences through process, policy, and product improvements. Manage and improve day-to-day operations against quality and efficiency targets in a highly dynamic and fast-paced environment. Analyze data to identify user trends and malicious behavior and suggest recommendations to improve operations. Use problem solving skills to resolve large and complex business problems. Work with vendor facing teams to develop, support and improve scaled review processes supporting Meta’s global user base. Help create scalable policies and processes to solve complex business problems and ensure the safety of the community. Develop a deep understanding of the integrity issues and how they affect our community. Address sensitive content issues, including but not limited to graphic images, videos and writings, offensive or derogatory language, and other objectionable material.", "company": "meta", "url": "https://www.metacareers.com/jobs/469818642448120"}