{"title": "Hardware Systems Engineer, NPI", "level": "", "location": "Menlo Park, CA", "description": "Meta is seeking an engineer to join our Release to Production (RTP) team. Our servers and data centers are the foundation upon which our rapidly scaling infrastructure operates efficiently to deliver our innovative services. The RTP team is responsible for the Hardware Lifecycle of all Meta servers including pre-production hands-on system and hardware debugging and stress testing, enabling production-ready system monitoring, automated provisioning and automated remediation of issues. RTP Engineers within the NPI team are responsible for quickly onboarding and evaluating the next generation of Meta servers, and ensuring they are efficient, reliable, and can be sustained at large scale in Meta infrastructure. They work closely with hardware designers, system manufacturers, component vendors, capacity engineering, production engineering, Meta services, and data center operations teams to test systems before release to our production data centers, and track the health and lifecycle of servers in production.", "salary": "US$104,000/year to US$155,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. 3+ years of work experience in one or more of domains such as: CPU SOCs (x86, ARM), storage (SAS, NVMe), device management (OOBM, I2C, I3C), AI-ML hardware (GPUs & TPUs), data center network hardware (switching, l2, l3, fabric), high speed interfaces (e.g. PCIe, CXL, DDR5), interconnect technologies (e.g. - Optics, DAC), power (PSU, battery backup units, AC/DC conversion). 3+ years experience in changing system configurations, measuring change impact within x86 environments, and scripting with Python or similar. Knowledge of server architecture and components, with knowledge of or experience working through full lifecycle for different server system/data center products and components, including troubleshooting and analytical experience.", "preferred_qualifications": "Familiar with lab equipment, protocol analyzers, oscilloscopes, power meters, air flow chambers. 2+ years experience in 24x7 Production support at scale (e.g. 10K storage servers and over 100K HDD). 3+ years experience scripting automation in Python or PHP or Perl, in full system technologies (including PCIe). 3+ years experience supporting ASIC development (silicon bringup, characterization).", "responsibilities": "Interface with external vendors and internal hardware, mechanical, power, thermal, manufacturing and software engineers to understand system architecture to develop and execute the test suites for various architectures. Proactively create experiments and tooling to detect and diagnose hardware/firmware/software health issues. Develop test framework for large-scale test automation inside fleet during product development and after mass production. Implement remediations across software and hardware stack according to plan, while keeping a thorough procedural record and data log. Develop and publish updates on resolutions and communicate findings internally. Troubleshoot, diagnose and root cause of system failures and isolate the components/failure scenarios while working with internal & external stakeholders. Develop visibility through data visualization and implement systemic solutions to hardware health issues. Drive necessary discussion with external and internal teams on test specification and methodologies to improve test quality continuously, both within Meta, and in the broader industry.", "company": "meta", "url": "https://www.metacareers.com/jobs/471080555517497"}