{"title": "Color, Material and Finish Developer", "level": "", "location": "Seattle, WA", "description": "Meta’s RL team is shaping the future of consumer electronics in the emerging Augmented and Virtual Reality industry. As a Color, Material, and Finish Developer on the RL Industrial Design team, you bring extensive knowledge of industrial materials and finishes as well as a passion for sourcing and developing new materials, methods and processes.  You have a record of helping ship successful products in the Consumer Electronics, Wearable Technology, Fashion, or Eyewear industries and are comfortable working collaboratively with cross-disciplined teams and manufacturing partners.  Your insights, experience and development efforts will help guide the unique style and distinctive look of our brand.​ This position is full-time.", "salary": "US$170,000/year to US$240,000/year + bonus + equity + benefits", "key_qualifications": "Bachelors of Industrial Design from an accredited college or university, or relevant professional experience; 5+ years' experience working as a CMF Designer/Developer​; Proficiency in communicating design vision, and concepts using traditional technique; Working knowledge of plastic injection molding, metal fabrication techniques, resin development, coating technologies, plastics decoration processes, fabrics and textiles", "preferred_qualifications": "3D CAD and visualization experience", "responsibilities": "Support the industrial design team through implementation of material design specifications; Establish and maintain quality standards and consistency across a portfolio of materials; Interface with industry and manufacturing partners to research and develop proprietary material combinations and new production techniques; Assist in the resolution of design, prototyping and manufacturing issues during the development phase; Communicate and resolve manufacturing and prototyping challenges​; Manage and maintain CMF product specifications for products in development from concept to production; Occasional domestic and international travel is a requirement for this position", "company": "meta", "url": "https://www.metacareers.com/jobs/471144548901397"}