{"title": "Product Technical Program Manager, Ads Infra", "level": "", "location": "Sunnyvale, CA", "description": "Ads Infra team at Meta is responsible for leading innovations in the company to empower, guide and scale ads ranking innovations, by collaborating closely with partner teams across the company. The products built by this team empower the Ads Ranking, Instagram, FB Shops and others teams for building platforms and tooling for the ranking and prediction models. We use these models to power every advertisement shown on our family of products (including Facebook app and Instagram). Our platform powers services for ads serving and ads data infrastructure. As a TPM on this team you will work with Engineering teams to build and launch new products, improve engineering efficiencies, as well as drive scalability and reliability of Ads services. In this role, you will also define the vision for the future of our Ads platform while making a big impact on our revenue. As a TPM on Ads Infra team, your work will directly make a big impact on Meta’s Revenue as well as Privacy goals since this team is positioned on a critical path within the company to achieve these goals. You will dig deep technically to define product vision, roadmaps, success metrics and for that you should come with a strong product mindset as well as a strong technical background. The role also requires working closely and forming partnerships with folks across all functions - Eng, Data Science, Product and PE to collaboratively work towards delivering revenue and Privacy goals. From designing and building new infrastructure, to working with teams to make existing systems better, to building new privacy-related product features, you will be one of our core product TPMs on the team.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Computer Science or a related technical discipline, or equivalent experience. 10+ years of software engineering, systems engineering, hardware engineering, or technical product/program management experience. Hands-on experience in improving and measuring revenue, AI/ML development or optimizing for ad engagement. Experience driving and delivering complex tech programs or products from inception to delivery. Experience defining strategic direction and identifying new opportunities for impact amongst products, platforms and programs. Knowledge of user needs, gathering requirements, and defining scope. Experience operating autonomously across multiple teams and functions, demonstrated critical thinking, and thought leadership. Communication experience at executive level and experience influencing senior leadership and technical management teams to develop systems, solutions, and products. Organizational, coordination and multi-tasking experience. Analytical and problem-solving experience with large-scale systems. Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones.", "preferred_qualifications": "", "responsibilities": "Develop and manage end-to-end technical product solutions and ensure on-time delivery. Manage and own cross-functional products and programs execution in a matrix organization. Drive and influence technical and product strategy, proactively identify risks and develop mitigation strategies, align on priorities, and set direction for a broadly cross-functional area. Help define the roadmap and long-term strategy of the teams that you are working with. Design measurements to track impact and drive internal process improvements. Articulate the technology, requirements, goals and milestones of your team. Collaboratively define the vision for building Meta-scale, state-of-the-art, global products. Develop and manage end-to-end project plans to ensure on-time delivery, provide day-to-day coordination, and quality assurance for tasks. Move fast in a flat organization by working in concert with technical program managers, product managers and engineers across Meta to establish a shared vision for improving execution and building solutions. Ongoing communication of planning, project status, issues and risks in a timely fashion to stakeholders. Help drive product decisions to align with higher company initiative.", "company": "meta", "url": "https://www.metacareers.com/jobs/471516385354792"}