{"title": "Technical Program Manager, APAC System HW TPM, Meta MR", "level": "", "location": "Shanghai, China", "description": "MR builds products that make it easier for people to connect with the ones they love most. We are a team of world-class experts developing and shipping products at the intersection of hardware, software, and health.\nThe Asia Pacific (APAC) System HW TPM will focus on supporting and driving factory builds across multiple programs. We are looking for a motivated, self driven individual who has experience running builds and working collaboratively with Operations, Quality, Suppliers, and Contract Manufacturers.  This position will manage the engineering builds onsite at our Asia CMs from Proto through DVT, partnering with our US based design team.", "salary": "", "key_qualifications": "BS in Mechanical or Electrical engineering\nFluency in English and Mandarin", "preferred_qualifications": "3+ years of hands-on experience managing system builds as a Program Manager at a factory, preferably in Consumer Electronics\nExperience working with CM/JDM/ODM partners and component level suppliers\nExperience with consumer electronics design and manufacturing processes (injection molding, stamping, die cutting, CNC, etc)\nExperience with consumer electronics products, mobile platforms and audio and video technologies\nKnowledge of manufacturing processes", "responsibilities": "Partner closely with various cross-functional teams at the FATP (CM) site (factory engineers, TPM, Operations, Logistics, Quality, etc) to support and drive the day-to-day onsite activities to enable successful HW builds.\nMonitor CTB (cleared to build) matrix to ensure material sufficiency for all configurations.\nRun the daily opening and closing meetings at the CM site.\nRun the MIL (master issues list) meetings to ensure engineering related issues are addressed and brought to closure in a timely manner.\nConduct weekly build matrix and BOM reviews with the CM.\nMake necessary adjustments when plan of record changes.\nSend daily build reports capturing engineering issues found during the build and related FA/CA (failure analysis / corrective actions) report.\nWork with CM to optimize their reporting and process.\nDrive escalations and actions to address build blockers related to engineering issues.\nMonitor unit allocation activities driven by CM TPMs/EPS.", "company": "meta", "url": "https://www.metacareers.com/jobs/474517145523509"}