{"title": "Account Manager, Korea (Based in Singapore)", "level": "", "location": "Singapore", "description": "The Account Management team is a sales team and part of Meta’s Global Business Group.\n\nThe team is focused on enabling businesses to grow by connecting them to customers across Meta platforms using Meta advertising solutions.\n\nAccount Managers are directly responsible for driving revenue, building relationships and helping clients grow their own business results on Meta through client-centric consultation, education, and support. Ideal candidates will have experience in pipeline management, ability to drive marketing strategy coupled with a willingness to roll up their sleeves and execute their sales tactics. Success in this position requires exceptional consultative sales, coaching, and client service skills; a willingness to experiment; the ability to thrive in a dynamic, team-focused environment; and a passion for helping others to achieve results.\n\nThis position is full-time and located in our Singapore Office.", "salary": "", "key_qualifications": "3+ years of experience in performance marketing, digital marketing/agency, consulting or related account management roles. Fluency in English and Korean is required as this role will collaborate with stakeholders internally and externally whose usual business language is English and Korean. Strong problem solving and quantitative analytical skills. Ability to influence C level and build effective relationships.", "preferred_qualifications": "Bachelor's degree or equivalent practical experiences. Knowledge of the media landscape of Korea and digital media is a bonus.", "responsibilities": "Drive revenue growth for our organization and the businesses we support. Be an expert in Meta's solutions for businesses of all sizes and tailor recommendations strategically to suit varying client needs. Improve performance of our clients marketing spend in a client-centric manner. Align clients KPIs with Meta solutions to drive incremental value. Grow revenue, educate and lead strategic conversations with business of all size and complexity. Ability to effectively prioritize and manage tasks within a fast-paced environment while maintaining strict attention to detail. Become an expert in Meta's solutions for businesses of all sizes and adapt recommendations quickly to suit varying client needs. Demonstrate expertise in all matters relevant to your book of business, including escalation and troubleshooting to resolve client issues.", "company": "meta", "url": "https://www.metacareers.com/jobs/475862651629299"}