{"title": "Localization Program Manager, Reality Labs Testing", "level": "", "location": "Bellevue, WA, Menlo Park, CA, Seattle, WA, New York, NY", "description": "Languages are key to our mission of bringing the world closer together. The Meta family of products is currently available in 100+ languages and we are adding many more. Over 70% of people use our products in a language other than English, and ~90% are outside of North America. As a Localization Program Manager for Reality Labs Testing, you will partner with stakeholders across Reality Labs and the rest of internationalization teams to ensure extended reality experiences on our products feel local in each market.", "salary": "US$129,000/year to US$185,000/year + bonus + equity + benefits", "key_qualifications": "5+ years experience in program management, including experience shipping large-scale global products. Track record of gaining alignment with cross-org stakeholders with competing priorities and goals. Experience using SQL to aggregate, analyze and interpret complex data sets to inform business decisions. Experience implementing and managing localization testing programs for software and web content. Skilled in building simple and optimized workflows to support complex product launches. Experience communicating and driving results with a variety of cross-functional stakeholders, working across time zones and international offices. Track record of staying focused, prioritizing and creating structure across large, ambiguous programs and setting goals for long-term initiatives. Thorough understanding of translation technologies like translation memories, machine translation, and CAT tools.", "preferred_qualifications": "Experience with localization testing of hardware products. Experience managing localization programs for large scale hardware or software launches. Familiarity and passion for AR/MR products and experiences. Experience launching global retail hardware products. Knowledge of additional languages other than English. Thorough understanding of product Quality Assurance processes and best practices. Experience using Python to process and analyze data.", "responsibilities": "Design and implement a scalable localization testing framework to ensure high-quality localized extended reality experiences across hardware, software and retail surfaces for rapidly developing products. Engage and build relationships with cross functional teams and stakeholders to drive adoption and maximize coverage of the scalable localization testing program. Partner with Reality Labs Localization Program Managers to craft localization testing strategies for priority products and technologies. Improve scalability via automation and standardization to the highest degree possible while ensuring maximum value to Reality Labs products and extended reality experiences. Provide expertise on localization testing best practices to other localization program managers and stakeholders across Meta. Partner with localization testing vendors to onboard, train, prioritize and manage testing work to meet program requirements. Utilize signals coming from Localization Testing outcomes to determine actions to improve localized product quality.", "company": "meta", "url": "https://www.metacareers.com/jobs/484504290569452"}