{"title": "Integrity Risk Program Manager", "level": "", "location": "Bellevue, WA", "description": "We are creating an operationally effective and highly efficient “service of common concern” for all Integrity, Security, Support, and Operations (ISSO) Governance, Risk, and Compliance (GRC) needs, ensuring Integrity, Security, Support, and Operations continue to meet global regulatory requirements and manage risk.\n\nMeta's ISSO GRC is the central engine driving risk management and compliance at the company, supporting Meta and the family of apps. We’re seeking deeply experienced Integrity talent to help enable and safeguard Meta’s products and services, which have a truly global scale, by upholding existing Content Regulation requirements and meeting emergent compliance obligations. ISSO GRC is simultaneously responsible for, (a) enabling the business to achieve its goals at scale and pace; (b) safeguarding the business against real world security risks; and (c) addressing the regulatory scrutiny the business faces. Our goal is to make Meta the premier place to work for governance, risk, compliance, security, and Integrity professionals.\n\nWe are seeking a motivated, highly organized, detail-oriented candidate with deep knowledge of risk management, compliance, and/or Meta Integrity functions. This position will play a key role in leading regulatory risk assessments and internal risk management. You should have excellent communication skills and proven success building and maintaining relationships across a wide range of global stakeholders. You will drive strong cross-functional engagement, monitor emerging regulatory policies, and communicate progress updates within the program to key stakeholders. In this role, you will need to work well in high-pressure situations, be comfortable with ambiguity, and be able to pivot quickly and effectively when necessary. The ideal candidate is an experienced trust & safety professional who can translate work across compliance and Integrity teams seamlessly and act as the human API between GRC, Legal, Regulatory Offices, and the business, maintaining deep Integrity subject matter expertise.", "salary": "US$173,000/year to US$247,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s Degree and 6+ years of experience in professional services or another technology company. 11+ years experience performing programmatic work in support of risk assessments, investigating issues, and developing practical solutions in spaces such as integrity, trust & safety, security, and/or privacy. Experience in analyzing, assessing risk and drawing insights from available data sources (financial, operational and qualitative) and collaborating to drive issue resolution in partnership with key stakeholders. Communication skills, with proven success influencing a variety of audiences including senior leadership across both technical and non-technical teams.", "preferred_qualifications": "Experience in designing and managing risk functions, risk and control self-assessments, defining and tracking KPIs, risk quantification framework, and standards compliance. Applicable experience overseeing and maturing compliance programs and executing on time bound regulatory compliance obligations. An advanced degree and/or certification in legal or business discipline preferred. Advanced Program management skills including planning, organizing, pre-empting risks/blockers, and communicating with global stakeholders to deliver successful programs or projects, while operating with minimal guidance.", "responsibilities": "Advise GRC leadership and other company leaders on Meta's integrity risk management. Lead the development, strategy, and execution of certain regulatory risk assessments and their reporting and incorporation with internal processes and management. Work with the rest of GRC, Policy, and Legal to analyze integrity risk signals and incorporate them into internal and regulatory risk assessments. Design, establishment, and tracking of KPIs and KRIs against risk appetite statements. Provide consideration, and guidance on regulatory matters and mitigate against uncertainty. Ensure adherence to defined standards in order for Meta to maintain legal and regulatory compliance. Identify risk domain specific risks and determine safeguards to reduce an incident’s probability of occurrence and impact. Collaborate on establishing a system of indicators for Meta to evaluate overall current risk at a glance for executive review and decision making. Facilitating effective risk domain management and evaluating Meta risk domain governance controls for Meta infrastructure that Meta relies on.", "company": "meta", "url": "https://www.metacareers.com/jobs/487251940566991"}