{"title": "Hardware Thermal Engineer", "level": "", "location": "Austin, TX | Menlo Park, CA", "description": "Meta is seeking a Thermal Engineer to join our Hardware Design Team. Our systems and data-centers are the foundation upon which our rapidly scaling infrastructure operates and upon which our innovative services are delivered. Our team is responsible for the Thermal hardware design across AI, network, compute and storage. As well as evaluating and advancing current and emerging thermal technologies, from liquid cooling to thermal packaging, and optimizing our hardware for high performing, efficient data center operation. A candidate selected for this role will be an integral member of the Thermal Hardware Team, responsible for owning thermal design and optimization for new hardware and evaluating thermal technology. The engineer will be responsible for solving heat transfer problems occurring in complex subcomponents or full hardware systems, using comprehensive thermal design fundamentals and analytical tools, and hands on execution of hardware validation. The ideal candidate would have a solid grasp of thermal fundamentals, and ability to work with our team, partners and vendors to deepen their knowledge base. The candidate will adapt/learn quickly, and is willing and able to work collaboratively across fast-paced, multi-disciplinary teams. This role is a great opportunity for candidates to learn end-to-end thermal aspects of hardware: from thermal design for systems, to DC environments. This includes getting involved in Thermal technology advancement, hands-on platform design, lab test development and thermal operational support. Doing so with a scalable and reliable methodology in mind.", "salary": "US$102,000/year to US$164,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Mechanical Engineering and/or with 2+ years relevant experience in thermal design related to server/hardware or advanced packaging. Familiarity with computational thermal simulation software, such as Flotherm/Future Facilities/Icepak used for optimizing hardware cooling design. Record of using lab equipment such as data acquisition systems, air flow chambers, and environmental chambers for thermal validation and troubleshooting. Experience in designing and optimizing thermal cooling solutions, such as custom-made heat sink designs, and/or fan speed control algorithms. Experience to create mechanical system schematics by using 3D CAD tool.", "preferred_qualifications": "M.S./Ph.D. in relevant thermal discipline. 2+ years relevant experience in thermal design related to adv. cooling solutions. Familiarity with custom thermal solutions including heat sinks, cold plates, and TIM materials for use in hardware systems. Familiarity with design and optimization of control systems for components such as fans or pumps. Familiarity with data center cooling system designs. Experience in Unix / Linux environment and/or familiarity with scripting and coding in python. Experience in manufacturing processes such as Design for Manufacturability (DFM) and Design for Assembly (DFA). Experience to create mathematical, computational and numerical models of industrial cooling systems, using MATLAB or comparable tools.", "responsibilities": "Engage with the Hardware Design team to ensure proper component design and with the Data Center Operations team to ensure smooth product deployment. Develop and execute test plans to measure thermal performance/efficiency of hardware and thermal technologies. Quantitatively simulate and analyze hardware cooling schemes. Design and investigate innovative thermal cooling solutions for advanced packaging and hardware systems for large scale deployment. Create analytical and numerical models using various Computational Fluid Dynamics tools or relevant simulation tools to describe system thermodynamics and heat transfer. Engage with external vendors including ODM and component vendors on design, test and production. Develop and publish case studies/technical papers describing thermal analysis of cooling systems and technologies. Establish the parameters for thermal design/testing, and correlation of the design/test results in order to model predictions.", "company": "meta", "url": "https://www.metacareers.com/jobs/491527520001648"}