{"title": "Postdoctoral Researcher, Systems for ML (PhD)", "level": "", "location": "Menlo Park, CA, Boston, MA, New York, NY", "description": "Meta is seeking a Postdoctoral Researcher to join Fundamental AI Research (FAIR). We are committed to advancing the field of artificial intelligence by making fundamental advances in technologies to help interact with and understand our world. The mission of Meta FAIR's Systems for ML research is to advance the state of AI through open science innovations. We explore, design, and build AI systems and infrastructures at scale to enable next-generation AI technologies. We aim to develop a broader and deeper understanding for critical but underinvested research directions for AI systems, from the design of programming framework and the compiler to the variety of AI hardware-software co-design. To increase the usability of AI systems and performance portability, we develop software system stack to unlock the performance potentials promised by the AI hardware. Furthermore, as AI becomes more and more pervasive, we must innovate with responsibility in mind when building the next generation AI systems and by developing greener, environmentally-sustainable AI technologies.\n\nIn this role, you will embed deeply with researchers at FAIR and develop prototypes at the frontier of AI research. You will engage with research work in the intersection between systems and machine learning, build deep expertise with Meta data and tools, apply high standards to the research code around you and develop abilities to identify and carry out highly impactful projects in a complex and unexplored domain. You will gain valuable experience in Systems and ML, publish academic papers and thereby advance the field of AI. Postdoc positions are 1 to 2 year fixed-term positions.", "salary": "US$117,000/year to US$173,000/year + benefits", "key_qualifications": "Currently has or is in the process of obtaining a PhD in the field of Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Research experience at the intersection of Systems and Machine Learning. Experience in C, C++, Python, Rust or other related programming language. Experience devising data-driven models and real-system experiments and design implementation for AI system optimization. Experience with scalable machine learning systems, resource-efficient AI data and algorithm scaling, or neural network architectures. Experience with memory and energy-efficient AI systems, environmentally-sustainable AI system designs, or AI-driven system optimization. Must obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment.", "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences such as NeurIPS, ICML, ICLR, MLSys, ISCA, ASPLOS, CGO, PLDI, PACT, HPCA, MICRO. Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub). Experience developing and optimizing systems for at-scale machine learning execution. Experience in real-system implementations. Experience solving analytical problems using quantitative approaches. Experience to manipulate and analyze complex, large scale, high-dimensionality data from varying sources. Experience in utilizing theoretical and empirical research to solve problems. Experience building systems based on machine learning and/or deep learning methods. Experience solving complex problems and comparing alternative solutions, trade-offs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment.", "responsibilities": "Perform state of the art research to advance the science and technology of machine learning systems. Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities). Devise better data-driven models of AI system design and optimization. Contribute and publish research that leads to innovations in: scalable machine learning systems, resource-efficient AI data and algorithm scaling and neural network architectures, memory and energy-efficient AI systems, environmentally-sustainable AI system and hardware designs. Collaborate with researchers and cross-functional partners including communicating research plans, progress, and results.", "company": "meta", "url": "https://www.metacareers.com/jobs/492365073224870"}