{"title": "Client Solutions Manager, Financial Services", "level": "", "location": "New York, NY | Chicago, IL", "description": "The Client Solutions Manager (CSM) for Meta's Global Business Group plays a crucial role in driving success by fostering strong client relationships and being an expert in platform, products, media strategy, and measurement for our Fortune 1000 advertisers. This position requires a consultative approach using data analytics to develop tailored solutions while closely collaborating with team mates and cross-functional partners to generate revenue and build relationships. To excel in this role, one needs high levels of consultative skills, analytical abilities, proactiveness, and a solution-driven mindset while working in a fast-paced, team-oriented environment under tight deadlines.", "salary": "US$29.81/hour to US$100,000/year + bonus + equity + benefits", "key_qualifications": "3+ years of experience in performance marketing and/or account management roles; Expertise in analyzing data from a variety of different sources (quantitative and qualitative), presenting the data in a clear and concise manner, and developing actionable insights; Effective presentation skills to senior executives", "preferred_qualifications": "Experience with business case modeling and market/opportunity sizing; Experience Meta’s full suite of advertising solutions; Experience working cross-functionally with Product teams to improve products features and functionalities; Prior experience in Financial Services or Insurance categories", "responsibilities": "Oversee account operations (e.g. troubleshooting issues, account set up, etc.); Work and collaborate with diverse group of internal cross-functional teams to project manage complex workstreams; Drive proactive media & measurement strategy, implementation, and optimizations to increase performance and investments; Build and manage relationships with key clients and agency partners (media, creative, marketing partners, etc.); Act as a product & insights expert, in partnership with Client Partner, to identify and implement marketing solutions that drive measurable business results for our partners; Craft narratives and recommendations pairing custom insights with creative ideas for presentations to sr. business stakeholders; Design experimentation initiatives, develop experiment tracking, analyze results and present recommendations; Serve as external product consultant educating clients and agencies on product solutions and best practices, and ultimately grow existing business partnership; Domestic travel up to 30% required", "company": "meta", "url": "https://www.metacareers.com/jobs/492892476477604"}