{"title": "Enterprise Infrastructure Engineer", "level": "", "location": "Seattle, WA; Fremont, CA", "description": "Meta is looking for an Enterprise Infrastructure Engineer who is ready to revolutionize the way we think about mobile device management. If you're passionate about technology, solving complex business challenges, and reimagining the future of computing, we want you to join our team!\n\nAs an Enterprise Infrastructure Engineer at Meta, you'll have the opportunity to work with cutting-edge technologies like Quest and build tooling and automation that will help us scale and deliver top-notch MDM services to our end users. You'll be part of the Enterprise Engineering CPE team that's dedicated to managing, implementing, and supporting MDM solutions that enable the company to grow rapidly and connect the world. If you're up for the challenge and want to be a part of something truly innovative, apply now!", "salary": "US$107,000/year to US$161,000/year + bonus + equity + benefits", "key_qualifications": "Experience designing, deploying, and monitoring MDM services across tens of thousands of devices; 2+ years of experience with Enterprise Mobility Platform (MDM) such as Airwatch, MobileIron, Intune, DEP, Android/Apple Enterprise Device Management; 2+ Experience with Python and Shell and any other languages used in system tooling (eg. Ruby, Perl); 2+ years experience working with monitoring and configuration management tools such as Puppet or Chef, Solarwinds or similar; Experience using source control, such as git or mercurial; Experience with documentation and presentations for both technical and non-technical audiences; Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience", "preferred_qualifications": "Deep knowledge of MDM architecture, design, and implementation; Experience with APIs to streamline administration, management, and monitoring of MDM environment; Experience working with enterprise/open-source MDM Platform; Experience managing, maintaining, troubleshooting and optimizing the mobile cloud environment and its related mobile devices, and can make adjustments and new system designs for future needs; Experience with open source management tools such as Chef, Munki, and MicroMDM; Experience with scripting and automation in Bash, Python, Ruby, or Golang; Experience working with or in support of diverse communities", "responsibilities": "The MDM Engineer will act at the Tier-3 level and is responsible for system architecture, tracking, and troubleshooting mobile devices and adding automation to administer the MDM environment for Meta; Work with iPhone/Android mobile device management features to secure and manage these devices across an enterprise users; Collaborate with the Quest engineering team to integrate MDM solutions with Quest hardware and software; Work with the Apple Device Enrollment Program (DEP)/Google Zero Touch to deliver mobile device provisioning, deployment, and support; Develop tools to automate Quest device provisioning, configuration, and management; Configure and deploy user certificates to mobile devices for encryption and authentications; Responsible for tracking of device inventory in the MDM cloud environment and performing audits of the MDM system; Monitor and control mobile devices and provide metrics that illuminate efficiencies or opportunities for growth; Act as liaison to external and internal partners by assisting in meeting business goals; Lead large, cross-functional projects affecting multiple organizations; Provide guidance and ensure that all mobile devices and activations are in compliance with Meta policies and procedures; Participate in on-call rotation to provide 24/7 support for MDM infrastructure", "company": "meta", "url": "https://www.metacareers.com/jobs/495914169577864"}