{"title": "Electrical Engineer", "level": "", "location": "Shenzhen, China", "description": "At Meta Reality Labs, we aim to bring together the brightest cross-disciplinary minds in one place to deliver on our mission: build tools that help people feel connected, anytime, anywhere. As a Electrical Engineer, you will take a critical role in developing hardware systems for AR and its New Technology Initiatives. You will become part of a team exploring developing concepts through prototyping and into mass-production consumer electronics. You will work as part of a cross functional team requiring collaboration and curiosity in domains other than electrical engineering. Our ideal candidate has strong electrical engineering fundamentals, debugging skills, Orcad/Allegro fluency, manufacturing process knowledge, and experience designing consumer electronics.", "salary": "", "key_qualifications": "- 8+ years of system design or consumer electrical system design.\n- Bachelor or above degree in Electrical Engineering or equivalent field.\n- Proven knowledge of electrical engineering fundamentals.\n- Experience with schematic and board design using Cadence OrCAD, Altium or equivalent.\n- Effective communication, collaboration and partnership with colleagues, cross-functional partners in dynamic and evolving development environments.", "preferred_qualifications": "- Experience with analog/mixed signal IC design, fabrication, and validation process.\n- Experience in subsystem design of power and display interface (MIPI, eDP, etc)\n- Experience with display electrical subsystem design/testing/implementation and system integration, display validation.\n- Experience with EMI and ESD risks and mitigation techniques.", "responsibilities": "- Support the Smart Glasses electrical subsystem development, qualification and system integration from the concept phase to mass production.\n- Support system stakeholder for electrical system design, performing proving for various design options by designing the experiments.\n- Perform bring up, debug, troubleshooting.\n- Support SMT and FATP build.\n- Work with internal cross functional teams to establish display module system integration and analysis.", "company": "meta", "url": "https://www.metacareers.com/jobs/498567472603922"}