{"title": "Research Scientist, Systems ML - SW/HW Co-design (PhD)", "level": "", "location": "Sunnyvale, CA | Redmond, WA | Austin, TX", "description": "Meta Reality Labs brings together a world-class team of researchers, developers, and engineers to create the future of virtual and augmented reality, which together will become as universal and essential as smartphones and personal computers are today. The compute performance and power efficiency requirements of Virtual and Augmented Reality require custom silicon.  Meta is seeking a Research Scientist to join our Research & Development teams. The ideal candidate will have experience working on AI Infrastructure and models related topics. The position will involve taking these skills and applying them to solve for some of the most crucial & exciting problems that exist in Reality Labs. The primary objective will be to develop creative solutions that enable compute and power efficient training and on-device inference of vision and language models for use cases in AR, VR and edge devices. We are hiring in multiple locations.", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Specialized experience in one or more of the following machine learning/deep learning domains: Model compression, hardware aware model optimizations, hardware accelerators architecture, GPU architecture, machine learning compilers, or ML systems, AI infrastructure, high performance computing, performance optimizations, or Machine learning frameworks (e.g. PyTorch), numerics and SW/HW co-design. Experience developing AI-System infrastructure , AI algorithms or AI hardware acceleration in C/C++ or Python. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience or knowledge of training/inference of Large scale AI models. Experience or knowledge of distributed systems or on-device algorithm development. Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as publications at leading workshops, journals or conferences such as CLR, NeurIPS, CVPR, ACL, ICML, MLSys, ISCA, MICRO, DAC etc. Demonstrated research and software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub). Experience working and communicating cross functionally in a team environment. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.", "responsibilities": "Apply relevant AI infrastructure, AI algorithms and hardware acceleration techniques to build & optimize our intelligent ML systems that improve Meta’s products and experiences. Develop state-of-the art model compression and scalability techniques using Numerics, pruning, distillation etc. Optimize models on hardware to achieve the best performance given various real time latency and power constraints. Goal setting related to project impact, AI algorithms, AI system design, and infrastructure/developer efficiency. Directly or influencing partners to deliver impact through deep, thorough data-driven analysis. Define use cases, and develop methodology & benchmarks to evaluate different approaches. Apply in-depth knowledge of how the ML infra interacts with the other systems around it.", "company": "meta", "url": "https://www.metacareers.com/jobs/498648102574139"}