{"title": "Linguistic Engineer, Computer Vision", "level": "", "location": "Redmond, WA | Burlingame, CA", "description": "Meta's AR/VR division is developing future products in augmented reality and virtual reality. Our work in conversational AI, computer vision, advanced optics, eye tracking, machine learning & reasoning will enable and empower consumers and businesses in new ways.\n\nAs a Linguistic Engineer (LE), you will focus on helping deliver datasets, models, and knowledge that power the ML systems across all components in the voice assistant product, such as ASR/TTS, NLU, NLG, Dialog, Reasoning, and the Knowledge Graph. The Linguistic Engineer delivers datasets, consistent models and representations across languages and areas, as well as data infrastructure that powers the voice assistant product.\n\nThe ideal candidate has strong technical, analytical, and collaboration skills with experience in building datasets for ML applications. Experience as an ML practitioner is useful but not required as the role focuses on the datasets and provides an opportunity to interface and work directly with ML teams as part of the greater voice assistant organization.\n\nExperience with data tools, pipelines, and analytics is needed for this role. The ideal candidate will have an interest in NLP and/or conversational AI systems and being at the cutting edge of their development. A plus is experience in any subfield of computational linguistics, though that is not specifically a requirement for the role.", "salary": "US$124,000/year to US$182,000/year + bonus + equity + benefits", "key_qualifications": "2+ years of work experience as data scientist, software engineer, computational linguist or in similar role. Experience with programming and data analysis with languages and platforms such as Python, SQL, PHP/Hack. Experience with video data collection and labeling for computer vision AI models. Experience with text analysis, scripting, relational database, No SQL databases or similar. Experience shipping multiple products across various platforms. Knowledge of Large Language Models and how to evaluate, improve, and/or utilize them.", "preferred_qualifications": "5+ years of work experience as data scientist/software engineer/computational linguist, with experience in machine learning and knowledge graph integrations with lexicons or ontologies. Experience with the evaluation, improvement, and/or utilization of Large Language Models. Deep understanding of the relationship between data and machine learning models. Experience with larger scripting projects that involve combining language data from different sources, computing complex metrics over large datasets, etc. Experience with version control, unit tests, and other programming best practices. Fluency in additional spoken languages. Advanced coursework and/or research in Computer Science, Data Science, Computational Linguistics, Information Systems, or related fields. Experience designing and conducting data experiments.", "responsibilities": "Build datasets, pipelines, and computer vision models for ML applications. Clearly communicate with project stakeholders. Identify best practices and improve procedures across data systems. Drive and deliver projects from conceptualization through launch and beyond with continual improvement and support. Design and conduct product experiments. Work in a dynamic, ambiguous work environment. Collaborate seamlessly with cross-functional teams. Be self-driven and prioritize multiple work streams.", "company": "meta", "url": "https://www.metacareers.com/jobs/498650575828837"}