{"title": "Enterprise Engineer", "level": "", "location": "Warsaw, Poland", "description": "Infra Operations products & services team builds, operates and provide best-in-class operational products and services for monitoring, troubleshooting and remediation of Meta's infrastructure. Our products consistently influence the enterprise software industry by defining new standards for how our customers, internally and externally, relate to their daily work. We are looking for experienced Enterprise Engineers who share a passion for tackling complexity, coaching and mentoring others, while defining the strategy and vision that guide the team to develop complex transactional systems with high availability, data integrity, and reliability.", "salary": "", "key_qualifications": "BSc or MSc in Computer Science or related field (or equivalent industry experience). Experience owning projects from end-to-end. Experience building intuitive systems in Java, PHP, C++ or Javascript technologies such as ReactJS or AngularJS. Experience working with code bases building micro services, REST APIs, GraphQL. Experience modelling data flows between systems to enable complex workflows and upstream/downstream integrations. 7+ years of experience building scalable, distributed systems. 7+ years of demonstrated experience driving change within an organization and leading complex technical projects.", "preferred_qualifications": "Experience building and supporting production quality software. Experience with GenAI use cases. Experience with Data pipelines and troubleshooting data pipelines.", "responsibilities": "Communicate technology and product strategy effectively to both internal and external stakeholders and leadership. Build industry leading enterprise systems that are highly available, intuitive, scalable, and secure. Own product architecture and collaborate with product managers, designers and other engineers to set the technical direction and create software that optimises for business metrics. Produce highly reliable and performant code with appropriate monitoring and alerting. Follow release management policies to ensure data integrity, compliance and system stability. Analyse and improve efficiency, scalability, and stability of various system resources. Conduct design and code reviews to ensure scalability, performance and alignment with standards and best practices.", "company": "meta", "url": "https://www.metacareers.com/jobs/502976488761320"}