{"title": "Payment Partnerships Manager, APAC Region", "level": "", "location": "Singapore", "description": "Meta is seeking a highly motivated, results-driven and talented Payments professional to work with the APAC team in optimizing payments for Meta and enabling new experiences and products for our clients and users. The ideal candidate will possess strong analytical skills, a deep understanding of cards processing and operations, local payment methods, the APAC payment ecosystem, and the ability to manage key relationships, both internally and externally, effectively. This is a position based in our Singapore office.", "salary": "", "key_qualifications": "7+ years of experience in the payments processing sector in APAC, ideally in a regional role. Proven track record leading payments optimization and anti-fraud programs, ideally for a digital merchant. Proactive, data-driven, strategic thinker with a passion for payments and new payment products. Excellent communication skills. Experience working in a cross-functional, collaborative organization.", "preferred_qualifications": "Working experience with acquirers, payment service providers, wallet providers and/or digital merchants in the APAC region is desired. MBA or MS Degree or equivalent experience.", "responsibilities": "Data Analysis and Reporting: Gather and analyze payments data to derive actionable insights. Prepare reports highlighting key performance metrics and improvement opportunities. Payments Optimization: Triage payments issues and work with partners and internal stakeholders to identify and resolve. Identify opportunities to streamline payment issues/operation workflows. Risk and Fraud Assessment: Analyze data to assess fraud impact across APAC countries. Coordinate with partners and internal stakeholders to align risk management strategies. Market Research and Analysis: Conduct comprehensive market research to identify trends, competitors, and growth opportunities. Relationship Management and Business Development: Manage relationships with payment partners including card networks, acquirers and key card issuing banks in the APAC region. Negotiate local deals and sign contracts with payment partners. New Product Development: Support product and engineering teams in new product development by providing local payments knowledge and enabling local payment partnerships.", "company": "meta", "url": "https://www.metacareers.com/jobs/506726298587995"}