{"title": "Software Engineer - Language (Technical Leadership)", "level": "", "location": "Bellevue, WA, Menlo Park, CA, Seattle, WA, Burlingame, CA, New York, NY, San Francisco, CA", "description": "Meta is seeking AI Software Engineers to join our Research & Development teams. The ideal candidate will have industry experience working on Language related topics. The position will involve taking these skills and applying them to solve for some of the most crucial & exciting problems that exist on the web. We are hiring in multiple locations.", "salary": "US$213,000/year to US$293,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Specialized experience in one or more of the following machine learning/deep learning domains: Language: NLP, ASR, TTS, Conversational AI. Experience developing language algorithms or language infrastructure in C/C++ or Python", "preferred_qualifications": "Experience in deep learning and PyTorch. Experience with distributed systems or on-device algorithm development. Experience contributing to AI Publications. Proven track record of planning multi-year roadmap in which shorter-term projects ladder to the long term-vision. Experience in driving large cross-functional/industry-wide engineering efforts. Significant experience in mentoring/influencing senior engineers across organizations", "responsibilities": "Apply relevant AI and machine learning techniques to build intelligent rich language systems that improve Meta's products and experiences. Assist in goal setting related to project impact, AI system design, and ML excellence. Develop custom/novel architectures, define use cases, and develop methodology & benchmarks to evaluate different approaches. Apply in-depth knowledge of how the machine learning system interacts with the other systems around it. Technically lead in a team environment across multiple scientific and engineering disciplines, making the architectural trade-offs required to rapidly deliver software solutions. Mentor other AI Engineers & improve the quality of AI work in the broader team. Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient. Effectively communicate complex features and systems in detail. Write clean readable code, debug complex problems that span systems, prioritize ruthlessly and get things done with a high level of efficiency. Understand industry & company-wide trends to help assess & develop new technologies. Partner & collaborate with organization leaders to help improve the level of performance of the team & organization. Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas.", "company": "meta", "url": "https://www.metacareers.com/jobs/557932376210167"}