{"title": "Data Scientist, GBG Data Science", "level": "", "location": "Menlo Park, CA", "description": "The massive scale and heavy engagement of the people using our products make the Meta ads platform the most powerful growth vehicle for businesses in the world. The team is driving advancements in ad auction and ad delivery research, developing/vetting advanced advertising tactics, and bootstrapping new products that meet large but nuanced use cases of complex advertisers. In this role, you will delve into the multifaceted ad ranking product stack, employing advanced modeling, and machine learning to unravel the complexities of modern advertising. You must also be able to work with external marketers as this role will give you the opportunity to meet with the most sophisticated advertisers to understand their pain points, build product intuition, and drive nuanced understanding externally. By deeply understanding our ads products and advertiser use cases you will discover novel problems and regularly drive meaningful business impact.\n\nThe team is made up of data scientists with a diverse set of backgrounds. Specifically, we have team members with various levels of academic attainment (Bachelor's, Master's and PhD), work experience, and professional backgrounds. The ideal candidate for this position is a versatile data scientist that excels in machine learning, statistical inference, data visualization, data analysis, and writing code. They should be excited to learn a complicated new technical domain and deploy a data science skill set to challenge core assumptions about that domain. They must have solid product intuition and be willing to talk to customers to develop and challenge that intuition.  They will have a proven track record of analyzing and deriving insights from data. They will be intellectually curious, a great communicator, data-driven, a fast learner, and able to move fast while keeping focused on high-impact projects.  As this team is fundamentally focused on R&D, the candidate must be comfortable with ambiguity and answering broad research questions.", "salary": "US$134,000/year to US$204,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent practical experience.\nExperience doing statistical analysis (e.g. regression, probability) using tools such as Python, R, MATLAB, SPSS, SAS, Stata, etc.\nExperience in building, validating, and deploying predictive models using machine learning libraries like scikit-learn, TensorFlow, PyTorch\nExperience with data visualization tools such as Matplotlib, Seaborn, Tableau, etc\nExperience in working with large datasets and using SQL or similar tools for data extraction and manipulation\nExperience delivering and driving action based on data-driven insights\nExperience influencing and partnering with stakeholders across organizations\n3+ years of analytics experience\nBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Advanced degree  in an analytical field (such as Computer Science, Engineering, Mathematics, Statistics, Physics, Economics, Finance, etc)\nStrong programming skills to prototype solutions that are deployed in production environments\nExperience with experimental design\nExperience with digital advertising or ads monetization", "responsibilities": "Apply analytical skills to complex quantitative problems, presenting and driving actions from insights to key stakeholders both reactively and proactively\nDevelop deep understanding of the Meta ads auction, analyzing a dynamic system and developing new optimizations for ad delivery and marketing strategies\nResearch applied machine learning questions in our ads ranking to improve system efficiency and drive company wide understanding\nIdentify novel marketing strategies for improving advertiser performance across Meta's ads auction\nWork closely with our sales and cross-functional teams, as well as advertisers directly to build product intuition and to identify, analyze, and scale performance opportunities\nPresent polished findings and recommendations directly to stakeholders\nElevate key themes to our product teams and alpha testing of new opportunities", "company": "meta", "url": "https://www.metacareers.com/jobs/590599296610212"}