{"title": "Fundamental AI Research Scientist, CoreML - FAIR", "level": "", "location": "Pittsburgh, PA | Menlo Park, CA | Seattle, WA | New York, NY", "description": "Meta is seeking a Research Scientist to join the Fundamental AI Research (FAIR) team, a research organization focused on advancing the state-of-the-art in AI. Individuals in this role are expected to be recognized experts in identified research areas such as artificial intelligence, machine learning, computational statistics, and applied mathematics, particularly including topics such as deep learning, computer perception, optimization, reinforcement learning, representation learning, privacy in machine learning, security of AI systems, foundations of generative modeling, compression and information theory, and social implications of AI. The ideal candidate will have a keen interest in producing new science to understand intelligence and technology towards achieving advanced machine intelligence.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. A PhD degree in AI, computer science, data science, or related technical fields. Experience holding an industry, postdoctoral, faculty, or government researcher position. Research background in machine learning, artificial intelligence, computational statistics, or applied mathematics, or related areas. Proven track record of recent and consistent publications reflecting expertise in theoretical and/or empirical research. Experience in developing and debugging in Python or similar programming languages. Experience in analyzing and collecting data from various sources. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Research and engineering experience demonstrated via publications, grants, fellowships, patents, work experience, open source code, and / or coding competitions. First-authored publications at peer-reviewed conferences, such as ICML, NeuRIPS, ICLR, FacCT, CCS, IEEE S&P, and other similar venues. Experience in solving complex problems, proposing novel solutions, and comparing alternative approaches, trade-offs, and diverse points of view. Experience in leading, planning and coordinating long-term research projects in a team environment. Experience communicating research findings to public audiences of peers.", "responsibilities": "Perform research to advance the science and technology of intelligent machines. Perform research that enables learning the semantics of data (images, video, text, audio, and other modalities). Work towards long-term ambitious research goals, while identifying immediate milestones. Initiate and lead research projects within a team and collaborate with cross-functional partners. Influence progress of relevant research communities by producing publications. Open source high quality code and produce reproducible research.", "company": "meta", "url": "https://www.metacareers.com/jobs/613693480929044"}