{"title": "Enterprise Systems Engineer", "level": "", "location": "Pittsburgh, PA", "description": "Enterprise Engineering is at the heart of Meta. By transforming the way businesses function, we are helping to bring billions of people around the world closer together. The mission of the Enterprise Infrastructure & Security (EIS) team is to provide best-in-class infrastructure, data, and security services to Meta and its partners. This requires unconventional thinking and lightning-fast, nimble solutions. We build enterprise products for Meta first.\n\nThe ARC team works closely with Reality Labs Research teams to implement mid sized GPU clusters tailored to meet individual team needs. ARC is engaged at nearly every layer of the deployments beginning with hardware selection and design, all the way through deployment, configuration, and life cycle management.\n\nAs one of the leading engineering teams in the enterprise world, our goal is to provide a solid foundation and platform for Meta businesses to build services and run workloads. As an Enterprise Systems Engineer on the Enterprise Messaging team, you will build the infrastructure for our high traffic, high visibility services. You will provide operational support for critical services that enable connected experiences found across Meta. We constantly review our processes, automate wherever possible, and develop our own toolchains when necessary. Join us and become part of a world-class team that allows Meta to deliver top-tier services to its employees.", "salary": "US$137,000/year to US$199,000/year + bonus + equity + benefits", "key_qualifications": "BS in Computer Science, Engineering, or a related technical discipline or equivalent experience; 5+ years system administration experience working in a Linux environment; 5+ years experience in shell scripting; 5+ years experience coding in at least one of the following languages: PHP, Ruby, Python, or Go; 5+ years experience working with monitoring and configuration management tools such as Puppet and Chef", "preferred_qualifications": "Experience supporting configuration management in a multi-region environment; Experience building services; Experience building PaaS or internal clouds; Experience with job schedulers (Kubernetes, Slurm, etc); MS in Computer Science", "responsibilities": "Build, scale, and secure Facebook’s corporate infrastructure, focusing specifically on the Linux environment; Combine open-source and commercial technologies to build services that will have an impact on the business; Work in a heterogeneous environment containing diverse operating systems and applications, and make them work well together; Apply modern engineering methodologies such as infrastructure as code, Linux container orchestration, and software-defined storage to scale Facebook's rapidly growing Enterprise infrastructure; Find ways to leverage the scale and complexity of the larger Meta infrastructure to solve problems for Enterprise customers; Be the final escalation point for issues related to Enterprise Linux systems; Produce systems that are scalable, automated, and well-documented, and train others to take on operations.", "company": "meta", "url": "https://www.metacareers.com/jobs/626090149679972"}