{"title": "UX Researcher, Qualitative", "level": "", "location": "Bellevue, WA", "description": "Our UX Research team is designing for the global diversity of human needs, which requires us to deeply understand the behaviors of the people behind them. Our researchers tackle some of the most complex challenges to gain deeper insights into how people interact with each other and the world around them, and work collaboratively to contribute new ideas to products that impact the experiences of billions of people on a global scale. This job description represents different full-time roles across Meta.\n\nWe use a variety of qualitative and quantitative methods to accomplish our goals, including surveys, focus groups, field studies, usability tests, and 1:1 interviews. We value a diverse range of perspectives and stem from many different backgrounds.\n\nWe’re looking for excellent communicators who are knowledgeable about research devoted to understanding people, and curious about the relationship between technology and society. They will also need to be comfortable in a fast-moving organization, open-minded about learning new research methods, committed to high-quality and rigorous research, and focused on influencing the future of Meta.", "salary": "US$123,000/year to US$192,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree with 7+ years of relevant experience within user experience, applied research setting and/or product research and development, Master’s degree and 5+ years relevant experience, or a PhD with 2+ years of relevant experience. Experience conducting In-Depth Interviews or Focus Groups and Concept Testing or Usability Testing. Interest in and experience executing hands-on, primary research. Experience translating research findings into strategic narratives.", "preferred_qualifications": "Degrees in a human behavior related field, such as Human-Computer Interaction, Psychology, Sociology, Communication, Information Science, Media Studies, Computer Science, or Economics. Experience with consumer products, consumer insights, or product development.", "responsibilities": "Work closely with product and business teams to identify research topics. Act as a thought leader in the domain of research, while advocating for the people who could use our products. Design and execute end-to-end custom primary research using a wide variety of methods. Design studies that address both user behavior and attitudes. Ability to work independently and autonomously. Effectively manage and prioritize research plans through ambiguous and fast-changing environments, align and efficiently execute critical insights and work with a large group of stakeholders. Communicate results and illustrate suggestions in compelling and creative ways. Work cross-functionally with design, product management, content strategy, engineering and marketing. Generate insights that both fuel ideation and evaluate designs.", "company": "meta", "url": "https://www.metacareers.com/jobs/638857250931296"}