{"title": "Electrical Engineer, Reality Labs", "level": "", "location": "Sunnyvale, CA | Redmond, WA", "description": "At Meta Reality Labs we aim to bring together the brightest cross-disciplinary minds in one place to deliver on our mission: build tools that help people feel connected, anytime, anywhere. As an Electrical Engineer on the AR, VR, or New Technology Team, you will design, build, and test prototype electrical systems for future consumer experiences within Facebook’s Family of Products. You will become part of a team exploring new concepts through fast iterative prototyping. You will work cross-functionally with teams that will dynamically change depending on the problem and potentially include mechanical, optical, firmware, software, and research experts. We want people who work well in teams, can take a board definition and implement with electrical schematic and layout, and can transition these designs into a high-volume consumer product.\n\nWe’re looking for system or board level Electrical Engineers with experience in high volume consumer products or developing technology leading prototypes to inform Reality Lab’s roadmap. The ideal candidate is comfortable designing mixed domain high-speed digital circuit boards, an experienced troubleshooter at the board and system level, and has familiarity with consumer product development processes. In the role you will be working with emerging technologies across the AR/VR space with the opportunity to learn from the industry leaders and help Meta achieve its goal of helping people feel connected, anytime, anywhere.", "salary": "US$111,000/year to US$164,000/year + bonus + equity + benefits", "key_qualifications": "BS in Electrical Engineering or Computer Engineering, or equivalent industry experience; Proven knowledge of electrical engineering fundamentals; Experience with schematic and board design using Cadence OrCAD, Altium or equivalent; Experience working with one of these technologies: use of oscilloscopes, high speed digital test equipment, logic analyzers, or function generators; Experience working with one of these technologies: digital signal processing, real-time image processing, display engineering, camera modules, mobile SoC and PMIC, or Battery Management System; Proven technical communication skills", "preferred_qualifications": "MS or PHD in Electrical Engineering or Computer Engineering; Experience with high speed signaling over DP, MIPI, HDMI, and USB SS; Experience with IMUs/sensor physical sensor systems with an understanding of calibration methods; Experience with vision systems; Experience with audio technologies; Experience programming in languages like Python or C/C++; Experience with circuit design in high speed circuits, Verilog/FPGAs, microcontrollers, microprocessors, firmware, and/or programmable logic based development; Consumer Electronics experience and/or working within a mass production environment", "responsibilities": "Contribute to the development of complex subsystems, own the development of moderately complex subsystems, or own the development of simple systems under the direction of a technical lead; Design schematics, evaluate components, direct board layout, conduct design reviews and draft design documentations; Manage bring up and debug, support manufacturing and assembly build; Collaborate in a team environment and work across engineering disciplines to develop systems and manage trade offs across electronics, mechanics, optics, sensors, haptics, firmware and software; Evaluate vendor reference design and transform these into custom solutions which meet product and form factor constraints; Work in distributed team environment; Contribute to building and sustaining internal Meta community through recruitment, mentorship, allyship, and a commitment to Meta’s diversity equity and inclusion goals; Travel both domestically and internationally.", "company": "meta", "url": "https://www.metacareers.com/jobs/645001477082778"}