{"title": "Research Engineer, Language - Generative AI", "level": "", "location": "Bellevue, WA", "description": "Meta is seeking a Research Engineer to join our Large Language Model (LLM) Research team. We conduct focused research and engineering to build state-of-the-art LLMs, which we often open-source, like our team’s recent Llama 2. We are looking for strong engineers who have a background in generative AI and NLP, with experience in areas like language model evaluation; data processing for pre-training and fine-tuning; responsible LLMs; LLM alignment; reinforcement learning for language model tuning; efficient training and inference; and/or multilingual and multimodal modeling.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Research experience in machine learning, deep learning, and/or natural language processing. Experience with developing machine learning models at scale from inception to business impact. Programming experience in Python and hands-on experience with frameworks such as PyTorch. Exposure to architectural patterns of large scale software applications.", "preferred_qualifications": "Master's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. A PhD in AI, computer science, data science, or related technical fields. Direct experience in generative AI and LLM research. First author publications at peer-reviewed AI conferences (e.g., NeurIPS, CVPR, ICML, ICLR, ICCV, and ACL).", "responsibilities": "Design methods, tools, and infrastructure to push forward the state of the art in large language models. Define research goals informed by practical engineering concerns. Contribute to experiments, including designing experimental details, writing reusable code, running evaluations, and organizing results. Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU). Work with a large and globally distributed team. Contribute to publications and open-sourcing efforts.", "company": "meta", "url": "https://www.metacareers.com/jobs/657040463014594"}