{"title": "Market Specialist, Czech and Slovak Markets, Global Risk Operations", "level": "", "location": "Dublin, Ireland", "description": "Global Risk Operations focuses on supporting users through scalable solutions that match the observed community needs. We are looking for influencers who can align cross-functional partners to ensure the best possible experience for users on our platforms. The Global Risk Operations SEO (Specialized Enforcement Operations) team is seeking a solutions-oriented, data-savvy Market Expert who is passionate about providing a great support experience for our community of users. The successful candidate will work with the Europe team to review and enforce on content reported for potential abuse, resolve user account issues, improve the overall support experience for Czech Republic and Slovakia, as well as solve enforcement issues across a wide range of Meta markets. In SEO the team specifically focuses on high priority, complex or regulatory enforcement demand, where our systems or scaled solutions need specialized support. SEO’s team is flexible and agile, bringing enforcement expertise that can be deployed to shifting priorities and dynamic emergent situations, necessitating local context, language, policy, community or functional expertise. The Market Specialist will be part of a data-driven analysis culture that works to protect our communities by enforcing on and will also help scale our operations by optimizing and automating processes, solving challenging problems and, most importantly, helping to prevent them. This position is full time and is based in our Dublin, Ireland office.", "salary": "", "key_qualifications": "Bachelors degree and/or masters or equivalent experience. Fluency in written and conversational English, Czech and Slovak are essential. 2+ years of professional experience within an operations environment. Experience communicating with a variety of audiences and stakeholders from the Czech & Slovak markets. Strategic thinker with strong analytical and creative problem-solving skills. Passion for supporting the Facebook and Instagram community. Excellent communication and collaboration skills. Self-starting, intellectually curious and creative individual comfortable operating in a fast paced, ever changing environment.", "preferred_qualifications": "Experience with vendor management. Technical and data skills such as Excel and SQL and experience with visualisation tools such as Tableau to drive efficient analytics and reporting. Experience with training, quality assurance or metrics analysis.", "responsibilities": "Work as part of the Europe team, enforcing on crisis response within the region while specifically representing the Czech & Slovak markets. Work as part of an On-call Operational structure to enforce on critical content within SEO Markets with a higher focus on Czech & Slovak markets. Use a combination of Language and Czech & Slovak markets geopolitical knowledge, deep understanding of cultural, language nuances and minority communities, to capture signals and insights to enforce and solve for complex risk and operational issues within the region. Scope scalable solutions to improve the support of our community of users in the Czech & Slovak markets and in partnership with other regions. Investigate and resolve issues that are reported on META products, such as requests for account support and reports of potentially abusive content including but not limited to graphic images, videos and writings, offensive or derogatory language, and other objectionable material. Support enforcement efforts on agnostic content that originates from multiple sources globally, where language expertise is not required. Support enforcement efforts identifying integrity risks to our local and regional advertising business and enforce on these risks. Support region wide programs of work supporting peak season buying initiatives, protecting advertisers, businesses and removing friction in the ad delivery process. Analyze key metrics and collaborate with cross-functional teams to improve our processes and tools. Build subject matter expertise around abuse areas prevalent in the region and work with the team on enforcement efforts to manage and control impacts. Investigate emerging risk across the region and influence cross functional resolution. Provide input and support on policy recommendations using geopolitical as well as operational understanding with XFN partners. Liaise closely with our Meta vendor teams to ensure all operational KPIs meet and exceed targets and work collaboratively to improve processes and tools and scale solutions. Remain up to date on key workflow changes, operational guidelines, policy updates and our Community Standards. Support the training and onboarding Meta partners.", "company": "meta", "url": "https://www.metacareers.com/jobs/687779823504678"}