{"title": "Site Loss Control Specialist - Construction Safety", "level": "", "location": "Kansas City, MO | Temple, TX | Jeffersonville, IN | Altoona, IA | Rosemount, MN", "description": "Meta is seeking a seasoned professional to join our Infrastructure Construction Management team as a Site Loss Control Specialist - Construction Safety. The Site Loss Control Specialist must be experienced in providing guidance on complex construction activities related to safety, insurance, regulatory agency compliance and risk management. The Site Loss Control Specialist will be a vital component in ensuring the success of the Owner Controlled Insurance Program (OCIP).\n\nThe Infrastructure Construction Management team builds the data centers that are the foundation upon which our software operates with efficient ease. Building and operating data centers the 'right' way from the day they go live is synonymous with ensuring capacity availability and capital conservatism. Architecting, constructing, operating and continually innovating the telecommunications and structured cabling infrastructure within our data centers is fundamental to ensuring high availability, the capacity to meet our extreme growth demands and obtaining the most robust and cost effective online service in the world! The successful candidate will provide the jobsite with loss control services that assist the project team in delivering a safe job. This is a full-time onsite position.", "salary": "US$122,000/year to US$169,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of construction experience in a dedicated safety role. Experience working within an OCIP environment. Experience with the implementation of Environmental Health & Safety enhancement programs. Experience partnering with team members and contractors. Industry knowledge to understand the design and deployment of technical electrical and mechanical systems as related to data center construction processes. Knowledge of practices in design and construction industry, including knowledge of fast-track design-build process and associated documents and contracts. Experience with ground-up construction and greenfield site development requirements. Experience with retrofit projects in live mission-critical environments or occupied spaces.", "preferred_qualifications": "Bachelor's degree in occupational health and safety from an accredited university. Certified Safety Professional (CSP), or Construction Health and Safety Technician (CHST) current designation through Board of Certified Safety Professionals (BCSP). OSHA 500 certification.", "responsibilities": "Perform risk assessments for all construction related tasks. Maintain a working relationship with project team to facilitate zero incidents. Provide guidance to the project team, and our contractors, to implement effective safety methodologies on site. Facilitate incident investigation, root cause analysis and reporting for corrective actions. Work in conjunction with ICM loss control team to ensure deliverables and job functions maintain minimum standards. Participate and assist with on-site training to enhance safety efforts. Be actively engaged in maintaining cross-functional relationships to foster cooperation and enhance safety endeavors. Effectively integrate into the construction sequence on site to facilitate best in class safety performance. Function within an OCIP environment effectively. This position is primarily site based, but will be asked to travel to gain knowledge and render support where it may be needed (generally between 0-30%).", "company": "meta", "url": "https://www.metacareers.com/jobs/689498886655726"}