{"title": "Production Systems Engineer, Hardware", "level": "", "location": "Dublin, Ireland", "description": "Meta is seeking a Production Systems Engineer to join our Release to Production (RTP) team in Dublin. Our servers and data centers are the foundation upon which our rapidly scaling infrastructure operates efficiently to deliver our innovative services. The RTP team is responsible for the end-to-end Hardware Lifecycle of all Meta servers, from exploration and development to production health. RTP Engineers work closely with Production Engineering teams, Enterprise Networking, Hardware Designers, Networking Teams, Manufacturers, Vendors, Datacenter Operation teams and New Product Introduction teams to ensure the smooth operation of systems across the planet.\n\nWe encounter problems from the very smallest of scales (errors occurring at the microscopic scale, within single registers of a CPU) up to the very largest - deploying solutions to our entire millions-strong fleet. We look for people with curiosity and drive, who want to tackle the hardest problems in the domain.\n\nTypically we will hire engineers from backgrounds such as Site Reliability Engineer (SRE), Software Engineer, Systems Engineer, Systems Development Engineer, DevOps Engineer, Systems Administrator, or similar.\n\nYou will have excellent technical ability, be adept at managing complex cross-functional demands, and have a demonstrated ability to drive a program of work to successful business outcomes.", "salary": "", "key_qualifications": "Bachelors degree in computer science, a related technical discipline, or equivalent work experience\n6+ years experience coding in a higher-level language (Python, PHP, Java, Go, Rust, C++)\nExperience building, maintaining and debugging production services or platforms - usually (but not necessarily) in a linux/unix environment\nKnowledge of server architecture and components across Compute/Storage/AI Systems/Networking\nScientific approach to troubleshooting, root-cause analysis and investigation\nGood communication skills, able to collaborate easily with others", "preferred_qualifications": "", "responsibilities": "Build and develop tooling solutions to automate business critical processes in service of managing the health of the Meta production fleet\nTroubleshoot, diagnose and root cause system failures, working with key partners to identify and deliver solutions\nProactively identify opportunities to fix or enhance tooling, hardware and processes\nBuild subject matter expertise in one or more of the specialist areas covered by the RTP team in Dublin - Firmware Deployment, Edge/CDN hardware, or Silicon Sustaining", "company": "meta", "url": "https://www.metacareers.com/jobs/708633168072461"}