{"title": "Research Scientist, NLP, GenAI (PhD)", "level": "", "location": "Paris, France, London, UK", "description": "Meta is seeking Research Scientists specialized in NLP to join its Generative AI (GenAI) organization. We publish groundbreaking papers such as the recently released Llama-2 paper. We are currently seeking talented researchers with experience in NLP to join our Paris sites and work with us on extending the capabilities of large foundation models through fine-tuning. The chosen candidate(s) will work with a diverse and highly interdisciplinary team of scientists, engineers, and cross-functional partners, and will have access to cutting edge technology, resources, and research facilities.", "salary": "", "key_qualifications": "Currently has or is in the process of obtaining a PhD in the field of  Computer Science, Mathematics, or similar quantitative field. First-author publications at peer-reviewed AI conferences (e.g. *ACL, EMNLP, NeurIPS, ICML, ICLR). Experience in training, fine-tuning, and/or experimenting with foundation models beyond black-box use. Familiarity with one or more deep learning frameworks (e.g. pytorch, tensorflow, …). Ability to communicate complex research both in writing and orally for public audiences of peers. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "High-impact publications at peer-reviewed AI conferences (e.g. *ACL, EMNLP, NeurIPS, ICML, ICLR), as witnessed by citations and other signs of influencing the research community. Experience in AI research beyond completing a PhD. Experience in developing and debugging beyond ML experimentation. Experience in working in an industry research environment. Experience in coordinating the research of PhD students or other researchers. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment.", "responsibilities": "Conduct research that extends the capabilities of foundation models through model fine-tuning. Work towards long-term ambitious research goals, while identifying intermediate milestones. Influence progress of relevant research communities by producing publications. Contribute research that can be applied to Meta product development. Lead and collaborate on research projects within a globally based team.", "company": "meta", "url": "https://www.metacareers.com/jobs/721461896779109"}