{"title": "Communications Manager, Intelligence (APAC and India)", "level": "", "location": "Singapore", "description": "We are seeking a Media Intelligence Lead to join our Communications Measurement team at Meta. You will be responsible for monitoring traditional media and social trends on topics critical to the business - spanning across product, tech policy and business strategy. You will be expected to editorialize your monitoring into compelling insights that shape decision making at every level of the company. You will be a strategic partner to the Communication & Public Affairs team in gathering media and social intelligence on the most business-critical priorities and combining that with longitudinal data analysis done across the Communications Measurement Team to inform strategy and learning. This role will be based in Singapore.", "salary": "", "key_qualifications": "10+ years of experience in media, politics, campaigns or corporate environment. Excellent written and verbal communication skills, with the ability to present findings and insights effectively. Strong analytical skills with the ability to interpret complex data and translate it into actionable recommendations. Strong attention to detail and the ability to work independently as well as collaboratively in a fast-paced environment.", "preferred_qualifications": "Experience working on political campaigns is a plus. Experience in carrying out measurement projects using data platforms to monitor media coverage and analyze social media conversation or understanding of metrics and analytics within the media environment is a plus. Experience reporting social media trends and analytics is a plus. Familiarity with data visualization tools and techniques is a plus.", "responsibilities": "Determine monitoring priorities and run intelligence operations for their region. Monitor, analyze and report on media cycles and social trends for specific moments, cycles, themes and business-periods. Work cross-functionally within the Communications Measurement team to identify patterns in media/social data. Collaborate with cross-functional teams, including analysts, data scientists, market researchers, and communication managers, to produce actionable insights to optimize media strategies and campaigns. Be prepared to manage a team of analysts, agencies and/or contract workers.", "company": "meta", "url": "https://www.metacareers.com/jobs/731625805651932"}