{"title": "Software Engineer (Leadership) - Product", "level": "", "location": "London, UK", "description": "We are the teams who create all of Facebook’s product used by 1.5 billion+ people around the world. Want to build new features and improve existing products like Commerce, Ads, Video, Groups, News Feed, Search, and more? Want to solve unique, large scale, highly complex technical problems? Facebook is seeking experienced full-stack software engineers to join our product teams. You can help build the next generation of products that help us connect the next billion people, create new features that have billions of interactions per day, and be a part of a team that’s working to help people connect around the globe. Join us!", "salary": "", "key_qualifications": "Experience leading projects with industry-wide impact; Vast experience communicating and working across functions to drive solutions; Significant experience in mentoring/influencing senior engineers across organizations; Proven track record of planning multi-year roadmap in which shorter-term projects ladder to the long-term vision; Experience in driving large cross-functional/industry-wide engineering efforts; Expert level programming experience; Significant experience with building large-scale applications and operating at scale; Extensive experience with web or mobile technologies.", "preferred_qualifications": "B.S. Computer Science or related field; Experience in shipping products to millions of customers or have started a new line of product; Experience building and scaling large products or systems.", "responsibilities": "Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient; Effectively communicate complex features and systems in detail; Understand industry & company-wide trends to help assess & develop new technologies; Partner & collaborate with organization leaders to help improve the level of performance of the team & organization; Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas; Create consumer products and features on a large scale; Lead long term technical vision and roadmap for large cross-company efforts; Partner closely with infrastructure and operations teams to build and scale back-end services.", "company": "meta", "url": "https://www.metacareers.com/jobs/734583462074202"}