{"title": "Applied Research Scientist, Speech", "level": "", "location": "Menlo Park, CA | Seattle, WA | New York, NY", "description": "We are looking for a Applied Research Scientist to join the Meta AI Speech team. The AI Speech team creates spoken language technology to make it faster and easier for people to build community and connect with others around the world. Our mission is to conduct product-motivated research in ML/AI and design, develop and deploy state of the art models to the rest of Meta. We work in all aspects of AI for speech and audio processing, including speech recognition, speech synthesis, speaker identification, keyword spotting, and acoustic event detection. Our work is largely focused on the areas of voice interfaces, including speech technologies for RayBan Meta, Oculus VR headsets, the Metaverse, Family of Apps (Instagram, Messenger, WhatsApp etc) and video understanding, including transcription, captioning, and content understanding.\n\nAs a Applied Research Scientist, you will help us develop innovative models and algorithms and apply them to large-scale production speech tasks. We are looking for a research scientist with a focus on automatic speech recognition. The ideal candidate should have a strong background in automatic speech recognition, end-to-end ASR, acoustic modeling, machine learning, or related areas, and have a passion for speech technology and voice interfaces.", "salary": "US$70.67/hour to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Currently has or is in the process of obtaining a PhD in the field of Artificial Intelligence, a related field, or equivalent practical experience. Degree must be completed prior to joining Meta.\nBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\nResearch experience in one or more of these areas:  speech recognition, speech processing, machine learning, deep learning, or related fields.\nExperience with development and implementation of speech recognition algorithm/systems and model training.\nExperience working with machine learning libraries like Pytorch, Tensorflow, etc.\nKnowledge of deep learning and neural networks.\nFamiliar with scripting languages such as Python and shell scripts.\nMust obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience with developing scalable machine learning models in at least one of the following areas: automatic speech recognition, end-to-end ASR, unsupervised/semi-supervised training, on-device modeling, acoustic modeling, or relevant areas.\nExperience with developing machine learning models for both server-based and embedded solutions.\nExperience with large scale model training, implementing algorithms, and evaluating ASR systems.\nProven track record of achieving significant results as demonstrated by publications at leading workshops, journals or conferences such as ICASSP, INTERSPEECH, or similar.\nExperience taking ideas from research to production.\nExperience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.\nExperience working and communicating cross functionally in a team environment.", "responsibilities": "Independently design and implement algorithms, train state of the art speech recognition models on large data, and evaluate their performance.\nDevelop machine learning models for both server-based and embedded systems.\nContribute research that can be applied to Meta product development, especially tackle the issues of edge computing for large speech models (like quantization, compression).", "company": "meta", "url": "https://www.metacareers.com/jobs/744350084480602"}