{"title": "Market Specialist, Global Response Operations - SEO South Asia", "level": "", "location": "Singapore", "description": "The Global Response Operations organization within Global Operations responds to real-time crises, proactively identifies and evaluates emerging risks, conducts risk-related investigations, and assesses what we could be doing to best benefit our community. By understanding and consistently managing incidents and real-time crises to resolution, the organization drives continuous improvement with our partners across Meta.\n\nAs the operational arm of Meta’s work in Trust and Safety, the Specialized Enforcement Operations (SEO) team is committed to tackling high-priority, complex, or regulatory enforcement challenges that necessitate specialized operational support, including local knowledge, policy comprehension, and cultural and language insights, beyond what our standard systems or scaled solutions can provide.\n\nThe successful candidate will work with stakeholders in Operations, Policy, legal, Process and Product teams to review and enforce on content reported for potential abuse, resolve user account issues, improve the overall support experience for South Asia Region, as well as solve enforcement issues across a wide range of Meta markets.\n\nThe Market Specialist will be part of a data-driven analysis culture that works to protect our communities by enforcing on and will also help scale our operations by optimizing and automating processes, solving challenging problems and, most importantly, helping to prevent them.\n\nThis position is full time and is based in Singapore.", "salary": "", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree. Degree must be completed prior to joining Meta. Fluency in written and conversational Bengali to support operations in the local language. 1+ years of professional experience within an operations environment. Experience communicating with a variety of audiences and stakeholders. Strategic thinker with strong analytical and creative problem-solving skills. Strong interpersonal skills and ability to build relationships with internal and external partners. Ability to work with graphic and/or objectionable content. Proven ability to work independently and manage multiple priorities in a dynamic environment. Experience working with ambiguity and developing new processes or solutions in response to changing circumstances.", "preferred_qualifications": "A background or understanding of the Trust & Safety Domain. Technical and data skills such as Excel and SQL and experience with visualisation tools such as Tableau to drive efficient analytics and reporting. Language proficiency in additional South Asian Languages is preferred as the candidate will be supporting operations for the South Asia region. Excellent analytical, project management, and problem-solving skills, with an interest in innovation and technology.", "responsibilities": "Work as part of the SEO South Asia team, enforcing on paid and organic (non-paid/user) content during a crisis response within the South Asia region while specifically representing the Bengali markets. Work as part of an on-call operational structure to enforce on critical content, particularly in response to Government, Regulatory and Trusted Partner escalations, within SEO Regions with a higher focus on South Asia. Draw upon linguistic and cultural expertise in South Asia's Bengali market, to identify crucial risk signals and gain valuable content insights that can help address complex operational and risk-related issues present in both advertisements and user-generated content across the region. Use a combination of market knowledge and operational expertise to support new policy and product initiatives/launches in South Asia Bengali markets and the broader South Asia Region. Support development of scalable operational solutions to enhance support for our user community in the Bengali markets, while also collaborating effectively with other regions. Conduct root cause analysis and address issues reported on Meta products such as requests for account support as and reports of potentially abusive content including but not limited to graphic images, videos and writings, offensive or derogatory language, and other objectionable material. Support enforcement efforts on agnostic and paid content that originates from multiple sources globally, where language expertise is not required. Support enforcement efforts identifying integrity risks to our local and regional advertising business and enforce on these risks. Support region wide programs of work supporting peak season buying initiatives, protecting advertisers, businesses and removing friction in the ad delivery process. Assess top-line operational metrics and collaborate with internal cross-functional teams to improve our processes and tools. Liaise closely with our Meta vendor teams to ensure all operational KPIs meet and exceed targets and work collaboratively to improve processes and tools and scale solutions. Collaborate with regional cross-functional teams on leading or supporting key integrity initiatives in the market and/or the broader region. Build subject matter expertise in a key area of integrity concern or theme, and support this by developing strategies and outlining and implementing comprehensive enforcement solutions. This role may involve exposure to graphic and/or objectionable content including but not limited to graphic images, videos and writings, offensive or derogatory language, and other potential objectionable material, i.e. child exploitation, graphic violence, self-injury, animal abuse, and other content which may be considered offensive or disturbing.", "company": "meta", "url": "https://www.metacareers.com/jobs/746554304126136"}