{"title": "Data Scientist - Global Business Product Marketing", "level": "", "location": "Austin, TX | Menlo Park, CA", "description": "Global Business Product Marketing (GBPM) contributes directly to Meta's mission by connecting advertisers and businesses with their customers and helping them grow through a variety of advertising solutions. We succeed when we help our customers grow their business. The GBPM team is searching for a Data Scientist. The Data Scientist will run experiments and build models to provide insight into our customer base, identify opportunities, and measure the impact of our marketing strategy and tactics. Ideal candidates love breaking down problems, building solutions, delivering actionable and data-driven insights, and working in a fast-paced, dynamic environment.", "salary": "US$134,000/year to US$204,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience in a data science capacity in a business strategy, marketing, finance, engineering, or analytics organization; 5+ Experience with data querying and manipulation using SQL, Python, or R Experience with experimental design; Experience with data analysis and statistical modeling using the R or Python ecosystems, with packages such as pandas, Statsmodels, Scikit-learn, Tidyverse (dplyr, ggplot2, etc.); Experience with stake holder communication and presentation skills; Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "An MBA or Master’s or Doctorate degree in a quantitative discipline like Math, Statistics, Economics, Computer Science, Physics, Engineering, Operations Research; Self-starter, comfortable with ambiguity, experience initiating and driving projects with minimal oversight and guidance; Proven track record of leveraging data to deliver business value and present data-driven insights to business audiences; Experience developing data pipelines via SQL and Python-based ETL framework; Experience with or in online marketing and advertising data analysis; Comfortable using version control tools such as git or mercurial; Experience building cross functional relationships across a variety of functions to launch projects to drive business value; Experience communicating with and influencing technical and non-technical audiences (engineers, data scientists, program managers, marketers); Experience shipping code into production; Experience working with or in support of diverse communities.", "responsibilities": "Take advantage of massive amounts of structured data to understand how our customers interact with our product and service offerings; Proactively identify opportunities to improve the experience of businesses on the Meta family of apps; Lead the measurement, analysis, and interpretation of results from data requirement gathering, to modeling, and recommendations; Partner with cross-functional teams to identify new opportunities requiring the use of modern analytical and modeling techniques; Design and execute experiments (e.g., A/B testing, multi-armed bandit); Communicate insights and recommendations to business leads and influence strategic decision-making.", "company": "meta", "url": "https://www.metacareers.com/jobs/758501599459244"}