{"title": "Hardware Test Automation Engineer", "level": "", "location": "Sunnyvale, CA | Seattle, WA", "description": "The MR (Mixed Reality) HW Validation Team is responsible for developing and deploying validation capabilities that inform product decisions and drive design maturity for Meta’s MR portfolio. As a Hardware Test Automation Engineer at Meta, you will be responsible for developing test automation frameworks to support HW validation of various MR products. This role requires good communication skills with internal and external team members to understand use cases and actively provide feedback on the test framework and test case implementation. A successful engineer in this role must be able to work with minimal supervision on multiple projects in parallel in a fast-paced environment.", "salary": "US$129,000/year to US$200,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's Degree or higher in Computer Science, Computer Engineering, Electrical Engineering, a related technical field or equivalent work experience. 5+ years of experience in system level testing, hardware testing, and software test tool development. Experience with test equipment and measurement techniques to verify and validate product requirements. Proficiency in Python with familiarity of best practices (linting, typing, unit testing, etc.). Project management skills to track and communicate status of all project work. Experience using version control (SVN, Git, hg, etc.).", "preferred_qualities": "Experience working in Consumer Electronics and/or battery powered devices. Understanding of electrical schematics and system architecture to analyze and improve test coverage at system level. Experience working with Qualcomm chipsets for mobile or VR applications. Experience developing Continuous Integration (CI) pipelines for testing of hardware devices. Experience with Python testing frameworks (unittest, pytest, OpenHTF, etc.). Experience with automating Data Acquisition (DAQ) systems (LabJack, National Instruments DAQmx, DEWESoft, etc.). Experience with SQL and database schema creation.", "responsibilities": "Design and develop modular, reusable test automation solutions to support HW validation of VR products throughout the entire development cycle. Scope of automation includes power, haptics, sensors, stress tests, battery life, etc. Write tooling in Python and other programming languages to interact with units under test and standard lab equipment. Develop new capabilities to enable analysis of test data, providing a clear view of system level performance against product KPI's. Work with validation team, design engineers, and other cross-functional teams to drive development of automation infrastructure based on business needs. Maintain and troubleshoot existing automation infrastructure, working closely with cross functional teams to root cause and address failures. Develop tools that enable periodic deployment of software builds, execution of tests at the hardware level and data analysis as part of an end-to-end automation framework. Domestic and or International travel up to 10%.", "company": "meta", "url": "https://www.metacareers.com/jobs/758612449576881"}