{"title": "Research Engineer - FAIR Core Learning", "level": "", "location": "Bellevue, WA", "description": "Meta is seeking a Research Engineer to join our Fundamental AI Research (FAIR) Team, a research organization focused on making significant progress in AI. Advances in AI are key to our mission, spanning some of the most pressing research challenges of our generation across such areas as artificial intelligence, machine learning, computational statistics, and applied mathematics, particularly including areas such as deep learning, generative models, reinforcement learning, computer perception, natural language processing. The ideal candidate will have a keen interest in producing new science to understand intelligence and technology to make computers more intelligent, or to work on more applied problems across the company.", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has or is in the process of obtaining a PhD in the field of Computer Science, Artificial Intelligence, a related field, or equivalent practical experience. Degree must be completed prior to joining Meta. One or more years experience in reinforcement learning and/or generative modeling. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Experience developing machine learning algorithms or machine learning infrastructure in Python and PyTorch. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Industry research experience in reinforcement learning and/or generative modeling. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment. Publication track record at conferences such as NeurIPS, ICML, ICLR, etc. Software engineer experience demonstrated via an internship, work experience, coding competitions.", "responsibilities": "Develop highly scalable algorithms based on machine learning and neural network methodologies. Collaborate with FAIR scientists on novel research in generative modeling, complex systems, and reinforcement learning. Apply knowledge of relevant research domains and coding skills to platform and framework development projects. Adapt machine learning and neural network algorithms to best exploit modern parallel environments (e.g. distributed clusters, GPUs, TPUs, etc.).", "company": "meta", "url": "https://www.metacareers.com/jobs/763579312113843"}