{"title": "Software Engineer - ML Systems (Technical Leadership)", "level": "", "location": "Sunnyvale, CA | Bellevue, WA | Menlo Park, CA | Burlingame, CA | New York, NY", "description": "Meta is seeking an AI Software Engineer to join our Research & Development teams. The ideal candidate will have industry experience working on AI Infrastructure related topics. The position will involve taking these skills and applying them to solve for some of the most crucial & exciting problems that exist on the web. We are hiring in multiple locations.", "salary": "US$213,000/year to US$293,000/year + bonus + equity + benefits", "key_qualifications": "Vast experience communicating and working across functions to drive solutions. Experience in driving large cross-functional/industry-wide engineering efforts. Proven track record of planning multi-year roadmap in which shorter-term projects ladder to the long term-vision. Experience leading projects with industry-wide impact. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Significant experience in mentoring/influencing senior engineers across organizations. Specialized experience in one or more of the following machine learning/deep learning domains: ML systems: AI infrastructure, machine learning accelerators, high performance computing, machine learning compilers, GPU architecture, machine learning frameworks, on-device optimization. Experience developing AI algorithms or AI-System infrastructure in C/C++ or Python.", "preferred_qualifications": "Experience with distributed systems or on-device algorithm development", "responsibilities": "Drive the organization’s goal towards relevant machine learning techniques to build & optimize our intelligent systems that improve Meta’s products and experiences. Effectively communicate complex features and systems in detail while advocating for higher product quality and engineering efficiency. Assist in goal setting related to project impact, AI system design, and ML excellence. Develop custom/novel architectures, define use cases, and develop methodology & benchmarks to evaluate different approaches. Apply in depth knowledge of how the machine learning system interacts with the other systems around it. Understand industry and Meta wide technology trends in computing technology to help assess & develop new technologies within the ML Systems roadmap. Drive the team's goals and technical direction to pursue opportunities that make your larger organization more efficient. Partner & collaborate with organizational leaders to help improve the level of performance of the team & organization.", "company": "meta", "url": "https://www.metacareers.com/jobs/766862191098663"}