{"title": "AI Research Scientist - Language (Technical Leadership)", "level": "", "location": "Bellevue, WA; Menlo Park, CA; Seattle, WA; New York, NY", "description": "Meta is seeking Research Scientists to join our AI Research and Development organizations. The ideal candidate will have industry experience working on Language related topics and the ability to apply relevant AI and machine learning techniques to build intelligent rich language systems that improve Meta's products and experiences. Candidates should have an equal interest in taking new research findings in this area and implementing them towards product needs. We are hiring in multiple locations.", "salary": "US$213,000/year to US$293,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Experience holding a faculty, industry, or government researcher position. Ph.D. and publications in machine learning, AI, computer science, statistics, applied mathematics, data science, or related technical fields. Proven track record of recent and consistent publication/citation history. Experience leading a team in solving modeling problems using AI/ML approaches. Experience in applying research to production problems. Experience communicating research for public audiences of peers. Experience in developing and debugging in Python, C/C++, or C#. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "4+ years of work experience post PhD in a university, industry, or government lab(s), in a role with primary emphasis on AI research. 4+ years of experience as technical lead for a project of 4 or more individuals. First-author publications at peer-reviewed AI conferences (e.g., NeurIPS, ICML, ICLR, AAAI). Experience with interdisciplinary and/or cross-cultural collaboration. Experience bringing machine learning-based products from research to production.", "responsibilities": "Help advance the science and technology of intelligent machines. Work on research projects, strategies, and problems of moderate to high complexity and scope. Can identify and define both short & medium term objectives. Influence progress of relevant research communities by producing publications. Establish strong connection with cross-functional partners and contribute research with the goal of applying to Meta's product development. Lead and collaborate on research projects within a team. Design policies, processes, procedures, methods, tests, and/or components, from the ground up for end-to-end systems. Apply in-depth knowledge of how the machine learning system interacts with the other systems around it.", "company": "meta", "url": "https://www.metacareers.com/jobs/770620888257616"}