{"title": "Network Engineer, Deployment & Support", "level": "", "location": "Gallatin, TN | Kuna, ID", "description": "Meta's Edge & Network Service (ENS) team is actively looking for passionate people to help us tackle the unique set of challenges and opportunities we face, while contributing to our company mission of connecting the world. Our team is the execution arm of the Facebook network team and is responsible for the deployment and support of all production networks (Edge, Backbone, Optical, and Datacenter) as well as our content delivery network (CDN) across the globe. This truly global team offers a unique career opportunity to work with all of the latest network technologies and talented engineers solving some of the most complex problems in the industry.", "salary": "US$132,000/year to US$190,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Experience configuring and troubleshooting routing and switching protocols (BGP, IS-IS, MPLS, RSVP-TE, VRRP). Working knowledge of physical infrastructure design including structured cabling and fiber-optic cabling. Proven experience working in a global team environment and solving problems with limited supervision. Working knowledge of network protocols (TCP/UDP, DHCP, DNS) and experience with IPv4 and IPv6. 6+ years of work experience responsible for designing, deploying and operating large-scale networks. Experience working in a multi-vendor environment with hands-on experience with networking hardware. Proven experience managing multiple projects simultaneously and deliver against mission critical deadlines.", "preferred_qualifications": "Working knowledge of data center power and cooling infrastructure and critical facility operational best practices. Technical leadership skills and people management experience. Experience with field-based work in Data Centers, Colocation Facilities, Internet Exchanges, or Central Offices. Familiarity with the Linux based systems and experience with scripting and automation (Bash, Python, Perl). Working knowledge of 40/100G Ethernet and CWDM, DWDM and optical transport network technologies.", "responsibilities": "Deployment, configuration, and management of all network infrastructure on our colocation sites. Work with partner teams and vendors to manage day-to-day operations and reliability of the regional network. Schedule and perform maintenance including upgrades, migrations, and decommissioning of production networks. Create deployment packages and maintain as-built documentation and asset database for installed network gear. Establish and implement global best practices and contribute to the design of new scalable network solutions. Support the development, testing and integration of new hardware and software platforms into the network. Participate in an on-call rotation to support the regional network infrastructure 24x7. 10% of travel required, up to 30% based on projects.", "company": "meta", "url": "https://www.metacareers.com/jobs/772677311458977"}