{"title": "NORAM Relocation Partner", "level": "", "location": "Austin, TX, Menlo Park, CA, Seattle, WA, New York, NY", "description": "Meta is seeking a NORAM Relocation Partner on our Global Mobility Relocation team. In this hands-on role you will have progressive global mobility relocation experience and be heavily focused on supporting our Relocation Programs in NORAM. You will be an integral member of the Global Mobility Relocation team and partner across our Global Mobility team to deliver holistic people movement solutions. You will be responsible to scale experiences to ensure the successful delivery of our programs including managing the day-to-day with our employees, cross functional partners (HRBPs, Recruiting, Benefits, Legal & HR operations), vendors, managing escalations and exceptions within a tiered support model, technology, and continuous process improvements. This is an individual contributor role that reports to the Director of Global Mobility Relocation & M&A.", "salary": "US$109,000/year to US$159,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of progressive experience in Relocation within Global Mobility. Experience exercising independent judgment and discretion while utilizing company policies and practices to determine appropriate action. Advanced knowledge of key global mobility lifecycle processes and methodologies. Experience working through queries requiring root cause analysis and providing end-to-end solutions, contribute to improving the processes and help identify systematic blind spots. Experience to handle complex, sensitive and/or ambiguous situations, exercising demonstrate critical thinking skills and manage escalations quickly to closure. Experience working effectively with data, analyze and present insights and identify key trends, develop and deliver presentations of key results. Experience to thrive in a constantly changing environment and demonstrated skill operating in a fast-paced, high growth and highly collaborative environment.", "preferred_qualifications": "Project management experience across multiple disciplines and stakeholders – driving projects from conception to implementation. Experience managing full suite of global mobility vendors with a focus on performance management, accountability, escalation & exception protocol, training and relationships. Experience working with or in support of diverse communities and their specific relocation needs. Advanced user of MS Excel data analysis and manipulation, including pivot tables, VLOOKUP and chart creation, Workday, Salesforce, AssignmentPro, and/or other HR-centric systems. Bachelor's degree in human resources, international studies or related area. Consulting or professional services experience. Global Mobility or related credential(s) e.g., GMS, CPA, CRP, GPHR.", "responsibilities": "Manage day-to-day interactions with a complex and high performing set of mobility vendors across the NORAM region to ensure a smooth experience for our employees. Provide consultations and assist with complex relocation related queries raised by our XFN teams and employees, give input on strategies to mitigate risk and provide timely solutions. As part of a tiered support model, manage process flow as it pertains to relocation queries, initiations, vendor contact and employee questions. Partner closely within the Relocation Team and across our Global Mobility team to ensure alignment with program philosophies for relocation, tax and immigration programs, and collaborate on other team initiatives and projects as assigned. Review and manage all exception requests, escalating as needed. Partner with internal cross-functional teams and vendor partners on specialized projects with focus on relocation process stakeholder education, consultation and advising. Deliver on specific technical or compliance driven processes to ensure data integrity, accuracy, and timely completion. Develop and contribute to process optimization, and documentation for our People Services team and vendor partners to manage high-volume inquiry resolution. Ability to travel as needed, currently estimated between 0-10% of time.", "company": "meta", "url": "https://www.metacareers.com/jobs/774211247891938"}