{"title": "WhatsApp Broadcast: Channels", "level": "", "location": "London, UK", "description": "Help build the largest and most private broadcast messaging product in the world. Our core broadcast product, Channels, launched in 2023 and is our fastest-growing new product of the past 5 years. Over the next few years, we're leaning heavily into the core experience, which means improving the follower and admin experience to make channels more engaging and differentiated, with focus on increasing interactivity and optimizing UX to better support channels use cases.", "salary": "", "key_qualifications": "7+ years’ experience in UX writing. Examples of finished wireframes, or design mocks authored using design tools, that have been used to drive decision-making within a team. Experience with simplifying and persuasively communicating complex ideas to stakeholder audiences. Examples of work in design systems and systems thinking. Demonstrated experience leading projects with minimal direction and handling a large degree of ambiguity. Familiarity with tools for managing and updating content at scale.", "preferred_qualifications": "Demonstrate sound judgment and influence product decisions, team direction and strategy. This includes identifying potential risk for users or the company, and aligning stakeholders around significant decisions by illustrating product tradeoffs. Independently and proactively identify and work on projects that span multiple teams. This may involve facilitating or co-facilitating design sprints and workshops to kick off these projects. Collaborate daily with peers in every discipline, including engineering, design, research, marketing and data science, to take products from conception to launch. Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences. Build internal community, provide mentorship and develop skills of other content designers.", "responsibilities": "Demonstrate sound judgment and influence product decisions, team direction and strategy. This includes identifying potential risk for users or the company, and aligning stakeholders around significant decisions by illustrating product tradeoffs. Independently and proactively identify and work on projects that span multiple teams. This may involve facilitating or co-facilitating design sprints and workshops to kick off these projects. Collaborate daily with peers in every discipline, including engineering, design, research, marketing and data science, to take products from conception to launch. Create high-fidelity design mocks using existing components in Figma, and use them to present design solutions. Design, write, edit and test clear, compelling in-product language to help users and teams meet their goals. This includes product flows, interface language, education materials, product names, navigational nomenclature, terminology, taxonomies and other content across Meta products and experiences. Apply systems thinking to the product, whether it’s defining extensible design system guidance, conducting audits of existing experiences or creating information architecture.", "company": "meta", "url": "https://www.metacareers.com/jobs/778701424475051"}