{"title": "Research Scientist - XR Input Perception", "level": "", "location": "Sausalito, CA | Redmond, WA | Burlingame, CA", "description": "At Meta Reality Labs, we’re developing the input technologies that will define the future of the virtual and augmented reality computing platforms. We are looking for a creative, skilled and motivated Research Scientist to join our machine perception team in advancing the state-of-the-art of human understanding, action recognition and statistical text decoding. You will work with research scientists, software engineers and hardware engineers to design technical solutions in a fast-paced multidisciplinary environment.", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. PhD in Computer Science or a related field with published projects in the fields of machine learning, deep learning and/or computer vision. Proven experience in designing data collection protocols and quality control, manifested in solid contributions in constructing high quality computer vision and machine learning datasets. Technical knowledge across a range of topics including machine learning, optimization, Bayesian statistics and state estimation. Experience innovating or extending research ideas for new problem domains or for fitting new constraints. Interpersonal experience: cross-group and cross-culture collaboration.", "preferred_qualifications": "Experience transferring technology from research in computer vision, machine perception or machine learning into a shipping product. Experience with joint hardware-software development and associated rapid prototyping. Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at AI conferences such as CVPR, ECCV/ICCV, SIGGRAPH, NeurIPS, ICLR, ACL or similar. Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub).", "responsibilities": "Contribute to and apply research that advances Meta products by developing novel input technologies for VR, MR and AR systems based on computer vision and machine learning. Design and prototype interactive experiences and evaluate them through user research. Design and prototype data collection systems to accelerate machine learning. Collaborate and work across teams to develop concepts that advance the entire product pipeline (hardware, software, data collection, machine learning, etc.).", "company": "meta", "url": "https://www.metacareers.com/jobs/782606810425134"}