{"title": "Engineering Manager, 3D Imaging & Graphics - XR Graphics", "level": "", "location": "Burlingame, CA", "description": "The XR team at Facebook Reality Labs is helping people around the world come together and connect through world-class Augmented and Virtual Reality technologies. As a 3D Imaging & Graphics Engineering Manager, you will be a leader in our XR Graphics organization, leading the team in developing image processing technologies for remote rendering to enable cutting edge visual experiences on compute constrained AR/VR devices. You will work with a highly cross-functional teams to collaborate in areas of image processing, graphics, vision science, optics, device hardware and silicon.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "BS/MS in Computer Science or a related technical field; 3+ years of professional experience managing 3D Imaging and Graphics engineers; 5+ years experience C++ with real-time rendering or image processing environment; Experience managing external vendors and incorporating them with internal teams; Experience in any of the following: realistic graphics development (Knowledge of ray tracing, rasterization and linear algebra), computer graphics, image processing, physics-based simulation, advanced optimization techniques or 3D geometry; Experience thriving in a dynamic environment where goals and requirements may be changing; Experience developing, debugging, and shipping software", "preferred_qualifications": "Bachelor’s degree in Computer Science, Computer Engineering or equivalent combination of education and experience; Experience with building image processing & graphics solutions for different architectures, processors and hardware silicon blocks; Experience with: implementing advanced 3D graphics (features such as lighting, effects, shaders and other low-level system), image processing or computer vision techniques, imaging system simulation, machine learning, HDR video processing, visual effects (VFX), color tuning, 3D rendering, 3D reconstruction, mobile CPU/GPU/DSP programming; Track record of taking novel zero to one technologies from incubation into production; Experience with tools such as Unreal Engine, Unity, Maya, Houdini, and Blender; Experience in VR, MR, or AR device development", "responsibilities": "Build and lead the development of imaging & graphics algorithms on mobile processors, GPU, DSP and ML accelerators for visual quality, performance, latency, power, and memory to enable efficient high performance, high quality graphics in current and future AR/VR devices. Work closely with product management, technical program managers, architects, and our cross functional partners to support state of the art prototyping and implementation of new imaging & graphics pipelines and UX for future hardware and silicon. Drive an excellent customer experience, continually raising the bar on functionality, usability, and simplicity. Support and grow an external vendor network. Champion engineering and operational excellence, establishing metrics and processes for regular assessment and improvement. Establish a solid project framework and excellent development processes. Provide technical leadership and guidance to both your team members and your project peers. Set clear expectations and create a positive work environment based on accountability, in collaboration with the engineering, product management, product design, and management teams. Operate strategically and tactically. Work on strategy and help set direction while staying on top of the day to day framework development. Manage engineering capacity to achieve dynamic product ship goals at the highest quality possible for our customers.", "company": "meta", "url": "https://www.metacareers.com/jobs/786537863452957"}