{"title": "Network Threat Detection Engineer", "level": "", "location": "Denver, CO | Reston, VA | Menlo Park, CA | Washington, DC", "description": "Meta’s Network Threat Detection team is seeking an experienced engineer to help secure the infrastructure that connects over a billion users. You will be responsible for building, implementing and operationally supporting network detection efforts throughout our entire infrastructure. We are looking for a candidate with a passion for security and innovation, who will research and develop new solutions to help protect our infrastructure and our users.\n\nThis candidate should thrive on finding security issues and eradicating them as well as a desire to make life hard for the bad guys. With focuses that range from signal development, data pipelines, data enrichment, detection engineering & security tool development. We defend against internal and external attacks and our scope delivers great opportunities to push your skills further while having a significant impact.", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of experience in offensive/defensive security or systems engineering. 3+ years of development experience in at least one programming language (Python, Go, etc.) with experience applying that to security tool development, automation, and overall programmatic solutions that will be used to defend infrastructure. Knowledge of network protocols (TCP/IP, computer networking, routing and switching) and Unix based systems. Experience researching, building, and implementing defensive security systems that are used against internal and external attack vectors. Experience designing and building out application and network security monitoring to aid in detection or forensic investigations. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Background in intrusion detection, security investigations, and incident response. Understanding of MITRE ATT&CK Framework and associated threat actor techniques. Experience investigating network-based data for anomalies in order to identify suspicious behavior. Experience “threat hunting”, i.e. using threat intel to proactively and iteratively investigate these potential risks and finding suspicious behavior in the network.", "responsibilities": "Iterate network security posture to better protect against attacks and detect new vectors. Develop automation and utilize frameworks to scale both protection and mitigation tools. Mentor and evangelize security practices through cross functional work with engineering teams throughout Meta. Keep Meta safe through active operation and defense of critical network infrastructure. Apply security expertise to guide the teams direction. ensure we're collectively working on the most impactful projects.", "company": "meta", "url": "https://www.metacareers.com/jobs/787180373367279"}