{"title": "Strategic Partner Manager, Data Transparency and Research", "level": "", "location": "Austin, TX | Menlo Park, CA | Seattle, WA | New York, NY", "description": "The Data Transparency & Research Partnerships team is focused on building relationships within the academic community and finding solutions to enable research on Facebook or with the data for which we are stewards. They support the academic community in conducting most critical research concerning Facebook products including their impact on people and society. This team will work closely with researchers and associated academic institutions to onboard, manage, educate, and explore new opportunities to strengthen our researcher platform, api, and dataset offerings.", "salary": "US$159,000/year to US$223,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of relevant work experience in partnerships, business development, product management, developer platforms, policy, research, and/or technology/internet media industry. Proven track record of reaching and exceeding partner growth and/or partner net promoter score. Experience in partner advocacy, expectation setting, collecting actionable insights, and adoption of product.", "preferred_qualifications": "MBA and/or other advanced degree. Advanced knowledge in the space of academia, research, policy, and/or platform development. Experience working with or in support of diverse researcher communities. Effective communication and interpersonal skills to manage across and up. Experience in designing scaled partner growth programs to upskill and/or educate on key topics. Experience negotiating contract terms and/or supporting contract development.", "responsibilities": "Execute partner strategy to support Researchers (and associated institutions) across Meta’s research & dataset offerings. Build new frameworks to scale support and relationships with a large number of strategic research partners. Develop, plan and execute programs with researchers that help them achieve their research objectives via new api or dataset offerings and adoption of those offerings. Evangelize the research platform and policies with current and potential researcher partners. Gather and analyze large amounts of information quickly in order to solve ambiguous problems and drive decision-making effectively with Facebook executive teams. Manage KPIs (e.g., onboarding targets) and create new strategies build trust with this researcher community. Collaborate and communicate across large cross-functional teams and influence decision-making within leadership audiences. Work closely with members of product, engineering, policy, communications, legal, finance, human resources (among others) to execute, improve processes, and identify opportunities for improved efficiency.", "company": "meta", "url": "https://www.metacareers.com/jobs/787407656807099"}