{"title": "Associate General Counsel, Product & Privacy", "level": "", "location": "Los Angeles, CA | Menlo Park, CA | Seattle, WA | Washington, DC | New York, NY | San Francisco, CA", "description": "Meta seeks a highly motivated and experienced product counsel to advise the teams responsible for third party risk management, including Meta’s Developer Platform. Product counsel are generalists who serve as the primary legal advisors for Meta product and business teams. This role will require significant cross-functional collaboration with product, engineering, policy, operations, and business teams, as well as other legal subject-matter experts, as you help shape the future of products used by billions of users worldwide. This is an opportunity to work on novel issues in an exciting, fast-paced environment as we build and scale for our global community.  The skills that product counsel use on a daily basis develop candidates into powerful generalists, ready to take on new and diverse challenges in their careers at Meta and beyond.", "salary": "US$198,000/year to US$266,000/year + bonus + equity + benefits", "key_qualifications": "J.D. degree (or foreign equivalent) and active membership in at least one U.S. state bar. 8+ years of legal experience as a practicing attorney, including at a law firm or in-house experience. Experience in one of the following areas: litigation, regulatory, product counseling, data security, privacy and/or client counseling", "preferred_qualifications": "Experience advising clients on risk mitigation across technology product platforms. Proven experience to distill complicated technical concepts for legal colleagues and to distill complicated legal concepts for technical colleagues. Experience working on multiple projects at once. Proven problem-solving, communication and interpersonal skills.", "responsibilities": "Become a deep subject-matter expert in the products you cover, building close connections with your product team through effective communication and collaboration. Serve as the first point of contact for your product team’s legal questions, and for the broader legal team’s questions about your product. Review new and changed products, features, platforms and initiatives to provide practical legal risk mitigation strategies across multiple jurisdictions. Provide and coordinate legal advice across complex and multifaceted legal issues applicable to the product you are supporting, including compliance with newly developing regulatory and legal obligations. Enable product teams to move quickly by proactively identifying and helping to resolve areas of potential legal risk. Support Meta’s global privacy program, including support for external regulatory inquiries and audits. Coordinate with public policy, communications, product management, engineering, product marketing, trust and safety, and other cross-functional teams on external communications, policy development, internal investigations, and product development and launches.", "company": "meta", "url": "https://www.metacareers.com/jobs/795957409308276"}