{"title": "Systems Generalist Software Engineer - Live Telepresence with Codec Avatars", "level": "", "location": "Pittsburgh, PA", "description": "Reality Labs Research (RL-R) brings together a diverse and highly interdisciplinary team of researchers and engineers to create the future of augmented and virtual reality. Software development is vital to empowering our scientific explorations and generating viable paths to the consumer products people will use for decades to come — products that will truly give people superpowers. At RL-R Codec Avatars, we aspire to a vision of social VR and AR where people are able to interact with each other across distances in a way that is indistinguishable from in-person interactions, with Codec Avatars that look like you and move like you. We're just getting started. You can help us make this dream a reality and accomplish your life’s best work here!\n\nA Systems Generalist at Meta typically is a backend engineer, with experience building backend infrastructure software (preferably at large scale), tends to be familiar with C/C++ and python, and is passionate about performance, scalability, and availability. Areas of focus for systems generalists include the following: database systems, operating systems, distributed systems, networking systems, storage systems, performance optimization, computer security, programming languages and compilers.\n\nAs a Systems Generalist on the Live Telepresence team, you will support the scaling of an immersive telepresence platform with Codec Avatars, working on the cutting edge of Virtual and Augmented Reality that will define the future of how people interact. You will work closely with engineers, scientists, and research product managers to scale an XR calling service and solve user and researcher challenges that are unique, complex, and nuanced.", "salary": "US$70.67/hour to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 3+ years experience with modern C++. 3+ years experience with Python. Experience working independently and in highly dynamic environments. Experience developing performant software and systems. Experience with software development practices such as source control, code reviews, unit testing, debugging and profiling. Experience deploying software on large-scale distributed systems. Proven track record of shipping software", "preferred_qualifications": "Experience with software development and debugging on Windows and Linux. Experience with development and debugging of distributed systems. Experience with game engines like Unity. Experience with real-time communication and inter-process communication. Experience developing software for Machine Learning, Computer Graphics, Computer Vision, or Robotics applications", "responsibilities": "Analyze, evaluate, design, develop, integrate, debug and test data collection tooling and infrastructure. Participate in design reviews and code reviews. Ensure that solutions meet the privacy and security expectations of users. Collaborate in a team environment across multiple scientific and engineering disciplines, making architectural trade-offs required to rapidly deliver software solutions. Work with research scientists and engineers to understand what data sets are needed to address technology challenges and how to provide them in a way that is accessible to their workflows. Write clean readable code, debug complex problems that span systems, prioritize ruthlessly and work efficiently. Learn constantly, educate others, dive into new areas with unfamiliar technologies, and embrace the ambiguity of AR/VR problem solving. Propose and implement reliable, maintainable, and scalable system-level software solutions to facilitate research activities.", "company": "meta", "url": "https://www.metacareers.com/jobs/801492218514433"}