{"title": "Product Designer", "level": "", "location": "Singapore", "description": "Building enterprise products is at the heart of Meta's mission. By transforming the way our business functions, we are helping to bring billions of people around the world closer together. On our Meta Enterprise Products teams, we build industry leading, consumer-grade, and highly intuitive products that define new standards for how our internal teams and external customers work. This requires unconventional thinking and lightning-fast, nimble solutions. We are looking for someone that has strong experience building complex systems and is excited by challenging and rewarding problems. This role provides the opportunity to work across a diversity of surfaces and opportunities. These include company-wide, strategic design pattern libraries that scale to hundreds of internal products, as well as product experiences on both mobile and web.", "salary": "", "key_qualifications": "4+ years of experience building and shipping multiple features that are broad/ambiguous in scope and encompass an end-to-end experience across a variety of platforms. 4+ years of interaction design experience with willingness to define how an experience should behave based on understanding people's needs, plus consideration of how this innovation will scale. 4+ years of visual design experience with proficiency in typography, desktop/mobile UI, color, layout, iconography and aesthetic sense and how these elements impact product function. 4+ years of strategic product thinking with experience developing product goals, identify opportunities, and make decisions based on the impact to people and the company. Experience in representing work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts.", "preferred_qualifications": "", "responsibilities": "Take broad, conceptual ideas and turn them into useful and valuable designs. Design new experiences or layouts that evolve and define visual systems and generate new visual language. Design flows and experiences that are incredibly simple and elegant. Contribute to strategic decisions around the future direction of Meta’s Enterprise products. Give and solicit feedback from designers and a broader product team in order to continually raise our bar for quality. Drive a partnership with product managers, engineers, researchers and content strategists to oversee the user experience of a product from conception until launch.", "company": "meta", "url": "https://www.metacareers.com/jobs/802025574686604"}