{"title": "Technical Program Manager, ML / AI", "level": "", "location": "Austin, TX; Burlingame, CA; New York, NY", "description": "Are you looking to shape the future of computing? Reality Labs (RL) is bringing together cutting edge research and engineering to deliver products and experiences for the future of immersive computing and connecting humans with entertainment, information and each other. Reality Labs is building software for all realities - augmented or virtual - for billions of users across the globe. Our team is expanding and we’re looking for an experienced Technical Program Manager (TPM) who will play a key role in defining and driving highly complex, cross-functional feature sets. We are looking for TPM with a proven track record of developing and shipping high quality machine learning or GenAI technologies, APIs, services and integrating them to products and experiences. This role will have the opportunity to work closely with world-class ML, Infra and Experience teams and leaders across the organization to develop and deliver Embodiment / Avatar technologies into our AI Agents / GenAI.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Computer Science or a related technical discipline, or equivalent experience. 7+ years of technical program management, software engineering, or systems engineering experience. Experience building Machine Learning technologies, and shipping them into products. Demonstrated experience leading execution across highly ambiguous, complex products and programs, with experience making technical and product tradeoffs balancing business needs and technical constraints. Knowledge of user needs, gathering requirements, and defining scope. Experience operating autonomously across multiple teams, demonstrating critical thinking, and thought leadership. Experience in leading complex execution across multiple teams in different time zones, anticipating roadblocks and creating a path forward. Analytical and problem-solving experience with large-scale systems. Effective communicator who can translate high-level goals into tangible action plans, and vice-versa & expertise communicating with technical and non-technical stakeholders.", "preferred_qualifications": "", "responsibilities": "Bootstrap programs in ambiguous areas, requires managing multiple cross team interdependencies. Understand technology requirements, roadmap, dependencies, evolution, and develop a plan for mitigating risks and delivering features that meet the requirements across multiple products. Demonstrate end-to-end ownership and thought leadership across multiple teams and influence program direction and plans. Establish expertise in the technology area, becoming the go-to escalation point for execution, leader for driving visibility across the program, and orchestrator for managing the integration across your program area. Drive technical excellence within the team, coordinating and contributing to engineering deliverables including architectural diagrams, specifications, launch criteria, and test plans. Work cross-functionally to develop best practices and development processes in a quickly-changing and dynamic environment, drive impact through deployment of key initiatives and garner adoption of those processes.", "company": "meta", "url": "https://www.metacareers.com/jobs/802810025007771"}