{"title": "Software Engineer - Infrastructure", "level": "", "location": "Tel Aviv, Israel", "description": "We are the teams who create all of Meta's products used by billions of people around the world. Want to build new features and improve existing products like Messenger, Video, Groups, News Feed, Search and more? Want to solve unique, large scale, highly complex technical problems? Meta is seeking experienced full-stack Software Engineers to join our product teams. You can help build products that help us connect the next billion people, create new features that have billions of interactions per day and be a part of a team that’s working to help people connect with each other around the globe. Join us!", "salary": "", "key_qualifications": "Programming experience in a relevant programming language. Relevant experience building large-scale infrastructure applications or similar experience. Experience with scripting languages such as Python, Javascript or Hack. Experience designing, analyzing and improving efficiency, scalability, and stability of various system resources. Experience owning a component, feature or system. Experience building and shipping high quality work and achieving high reliability. Track record of setting technical direction for a team, driving consensus and successful cross-functional partnerships. Experience improving quality through thoughtful code reviews, appropriate testing, proper rollout, monitoring, and proactive changes. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Exposure to architectural patterns of large scale software applications. Experience in programming languages such as C, C++, Java.", "responsibilities": "Design core, backend software components. Code using primarily C/C++, Java, PHP and Hack. Interface with other teams to incorporate their innovations and vice versa. Conduct design and code reviews. Analyze and improve efficiency, scalability, and stability of various system resources. Establish self as an owner of a particular component, feature or system with expert end-to-end understanding. Successfully completes projects at large scope while maintaining a consistent high level of productivity.", "company": "meta", "url": "https://www.metacareers.com/jobs/808953127538169"}