{"title": "Complaints Counsel", "level": "", "location": "Dublin, Ireland | London, UK", "description": "Meta seeks a highly motivated lawyer to serve as Complaints Counsel on Meta’s EMEA Disputes team based in Dublin or London. The successful candidate will be joining an international legal team working on issues in a vibrant, fast-paced environment.\n\nWe’re looking for a Complaints Legal Counsel to handle user complaints as part of a statutory complaint handling process. As a Complaints Legal Counsel you will be embedded in a cross-functional workstream that deals with statutory complaints from users.\n\nYou’ll work on all stages of the complaint from initial engagement with a regulatory body to facilitating an amicable resolution; providing day to day legal advice as a subject matter expert to key stakeholders across the business.;\n\nWe’re looking for someone with the legal experience and ability to effectively analyse legal case outcomes and partner with colleagues across the business to identify possible solutions at individual complaint level while also advocating and managing changes at process and product level more broadly based on insights from the user complaints. The role requires a highly organised individual with a strong work ethic; ability to take ownership for and manage a varied workload; strong drafting and advocacy skills; good commercial judgement; a self-starter; and a keen interest in learning about Meta’s products and services and how they interact with the law.", "salary": "", "key_qualifications": "Qualified lawyer in the UK or an EU jurisdiction with 3+ years PQE in a law firm or relevant in house experience.", "preferred_qualifications": "Strong experience in a regulatory complaints handling process, preferably in privacy, but experience in other regulator environments is highly considered. Familiarity with internet laws and issues, particularly the EU and UK GDPR and its application to online platforms helpful.", "responsibilities": "Managing a docket of complaints of varying complexity and timeframes with a focus on data protection, data security, as well as e-privacy issues in the United Kingdom, Ireland and across the EU. Running internal fact finding investigations with partners across different teams and drafting responses to complaints based on the fact finding. Identifying, analysing and supporting the resolution of complaints and helping to implement improvements at regional or global level. Partnering with key internal stakeholders such as data protection teams, privacy policy and communications colleagues, business and product teams, operational teams and regional leadership. Manage quarterly reporting to senior Legal leadership. Setting up and/or improving internal procedures and know-how. Engage proactively in cross functional teams to provide internal legal advice across subject areas. Actively contributing to the culture where the user experience is a priority. Seeking to go above and beyond by taking real ownership of problems, policies or procedures.", "company": "meta", "url": "https://www.metacareers.com/jobs/808950124154832"}