{"title": "Marketing Strategic Planning & Operations Manager", "level": "", "location": "Singapore", "description": "Meta is a truly international company: The Meta family of apps is currently available in 100+ languages and we are adding many more. ~90% of people already use our products from outside of North America and we continue to expand internationally. Marketing at Meta is a data-driven organization that seeks to understand our customers deeply and drive outcomes that matter. The Marketing Strategic Planning, and Operations (MSP&O) team is responsible for shaping Marketing strategy & plans, spearheading operational excellence, and evolving Marketing and its capabilities.\n\nMSP&O is seeking an experienced professional to partner with International Marketing leadership to enable Marketing work that resonates locally at a global scale, across Consumer, Business and Creator audiences. This role would support the leader of our APAC Marketing organization (based in Singapore) and partner with global teams to influence global Marketing strategy. This is a highly cross-functional role that partners closely with marketing leaders to ensure that smart strategies are set, initiatives are rigorously prioritized, concrete plans are developed, and that our teams are organized to succeed.\n\nWe are looking for someone who thrives in a fast-paced environment, is skilled at leading complex cross-functional initiatives with diverse stakeholders, and is a sharp strategic thinker. This person should see the value of creating inclusive spaces when solving hard problems and will recognize diverse perspectives.", "salary": "", "key_qualifications": "Bachelors degree; 8+ years experience across marketing, operations, or strategy; Demonstrated capacity to communicate complex, large-scale concepts clearly and simply; Success leading complex, cross-functional initiatives under tight deadlines; Experience working in a fast-paced, entrepreneurial environment and effectively balancing between analyzing and executing; Skills in balancing attention to detail with big-picture strategic thinking; Comfort with data analysis / analytical thinking; Comfortable working across multiple time-zones and traveling", "preferred_qualifications": "Prior experience in consumer or business marketing in an international environment; Prior experience in either management consulting or in-house strategy and operations; MBA or related graduate degree; Fluency in a second language", "responsibilities": "Within a global framework, ensure our portfolio is increasingly focused on the most impactful Marketing work, including influencing marketing strategy & resource allocation.\nHelp the APAC senior leader refine their vision & strategy in response to shifting regional context, marketing results and/or business priorities.\nManage the annual planning process and any ad hoc planning processes to ensure the plan is anchored in the regional vision & strategy, builds upon past marketing performance, and ensure that planning inputs are robust, data-backed, and rigorously prioritized.\nDrive trade-off discussions as needed, including leading business case assessments with cross-functional partners such as Decision Science, Finance, Media, Insights, and Marketing to enable informed business decisions.\nDistill business insights from how we’re managing resources (budget, headcount, time to launch).\nDesign, operationalize, and manage consistent, scalable processes that enable the International Marketing team to move fast and do awesome things.\nHelp remove roadblocks, escalate misalignments and ensure teams are set up for successful execution. This includes influencing cross-functional peers, superiors, and senior leaders to prioritize what is right for the business.\nManage the APAC senior leader’s Run of Business for Marketing work, including establishing leadership review cadences & expectations, and managing key forums such as leadership meetings, work reviews, business reviews, and discussions of marketing results.\nPartner with Finance and the regional marketing lead & teams to ensure financial tracking across programs.\nDevelop a clear understanding of where and how APAC Marketing team could improve upon its capabilities, prioritize the most impactful opportunities, and then build & scale solutions for the org.\nLead org-level special projects, as needed and as bandwidth permits.", "company": "meta", "url": "https://www.metacareers.com/jobs/809182810599089"}