{"title": "APAC Business Education Training Partner - Blueprint", "level": "", "location": "Hong Kong", "description": "The Meta Business Education team (BizEd/Blueprint) is committed to empowering growth through digital education. Our mission is to deliver training about the latest and greatest in Meta marketing innovations—from products and services to best practices—to our global customers and partners. We collaborate with teams across the Meta organization, as well as with agencies, marketing partners, and businesses of all sizes, to develop best-in-class training and educational solutions. Our dedicated team strives to provide exceptional learning experiences, enabling partners to fully leverage everything Meta and its family of apps and services have to offer. If you're passionate about developing and deploying both in-person and online training programs and are looking for an opportunity in a rapidly expanding team, this could be your chance. The Business Education Training Partner role is part of the Business Education Training team.", "salary": "", "key_qualifications": "12+ years of relevant experience; Bachelor's degree; Professional fluency in Simplified Chinese (SC), Traditional Chinese, and English; Demonstrable expertise in Meta’s portfolio of advertising tools and solutions, specifically our Direct Response suite of products; Comprehensive knowledge of digital marketing and advertising; Deep understanding of the region’s advertising industry; Training delivery experience; Problem solving skills; Experience working with executive-level leaders.", "preferred_qualifications": "Public communication experience; Meta Blueprint Certification holder (in any exam); Knowledge of Ad-tech, specifically measurement and analytics.", "responsibilities": "You will primarily lead the planning and activation of education programs in the Greater China region (GCR), Hong Kong, and Taiwan. Additionally, you will support the APAC & EMEA Regional Lead in other APAC programs as needed. Develop and implement education strategies that align with regional and global educational priorities. Work closely with the immediate and global team on common/co-worked responsibilities (i.e. attendance organization, educational programs communication, data management, etc). Deliver virtual and in-person training on a regular basis to diverse audiences, focusing on Branding & Performance Marketing solutions and Marketing Science. Build, influence and maintain strong partnerships with sales and cross-functional teams to support business goals through education. Act as the key POC for Meta Business Education offerings in the market and ensure that our portfolio of educational offerings is integrated with other team’s plans. Maintain excellent knowledge of Meta Advertising solutions and act as a world-class training resource. Continuously update training materials to ensure consistency and alignment with global Blueprint team goals & initiatives. Act as an SME (subject matter expert) for all content and certification alignments. Support cross-functional partners with special events and education initiatives that align with global Blueprint team goals. Understand audience needs and priorities to build effective educational strategies and identify opportunities. Synthesize and communicate market needs and feedback to the Business Education team based on scale and scope needs analysis. Lead communications relating to Business Education offerings in partnership with project managers and keep the global team informed of regional activities and results. Support the Regional Team's operations by closely working with the regional lead, global project managers and contractor workers (trainers and coordinators). Act as the “Trainer Lead” to onboard/maintain/upskill the regional trainer’s solution knowledge and delivery skills. Minimum of 40% travel time.", "company": "meta", "url": "https://www.metacareers.com/jobs/815484417335869"}