{"title": "Quantitative Researcher, Growth", "level": "", "location": "Tel Aviv, Israel", "description": "Come join a diverse and collaborative team of researchers who work directly with product and marketing to make the best social platform for Meta's billion+ users. Our primary research ranges from formative to evaluative, using approaches such as quantitative surveys, statistical modeling, focus groups and in-depth interviews. For this position, we are looking for experts in quantitative methods, with an understanding of how to integrate diverse sources of insights. Experience in applying qualitative methods would be an advantage.\n\nThe right candidates will have done rigorous, creative, impactful primary research, and will be excellent communicators, passionate about empowering people with online social platforms, comfortable in a flat, fast-moving organization, excited to collaborate, and focused squarely on bringing compelling and relevant online experiences to as many people as possible around the world.", "salary": "", "key_qualifications": "Ph.D. in social science (e.g., Communication, Sociology, Political Science, Economics, Psychology), or in a quantitative field (e.g., Statistics, Informatics, Econometrics) with experience answering social questions. Knowledge in quantitative research methodologies (e.g., survey sampling and design, significance testing, regression modeling, experimental design, behavioral data analysis). Interest in and experience executing hands-on, primary research. Experience in data manipulation and analysis using statistical tools (R/SAS/Stata, SQL/Hive). Ability to ask, as well as answer, meaningful and impactful questions for businesses. Willingness to travel internationally.", "preferred_qualifications": "3+ years of experience conducting research in an organization or consulting environment, including working with key stakeholders to understand and clarify their people research needs, and communicating analyses to technical and non-technical audiences. 3+ years of experience applying multivariate statistical methods such as GLM, analysis of quasi-experimental research designs with non-equivalent groups (e.g., regression adjustment, matching, propensity score stratification), longitudinal analysis, classification, dimension reduction, clustering, hierarchical linear (random effects) modeling, etc., to people research problems in organizations. Experience in survey design. Experience executing mixed-methods research (combining qualitative and quantitative methods). Experience conducting international/cross-cultural research, particularly in Emerging Markets. Experience with SQL/Hive and/or Python and large datasets (> 1TB). Experience working with cross-functional stakeholders to understand business needs and translate them into research questions.", "responsibilities": "Scope and plan research to provide actionable insights to multiple product teams, based on a thorough understanding of teams' business needs. Rigorously execute the research, end to end, applying relevant quantitative methods. Write up research findings and present them to cross-functional stakeholders, emphasizing research findings, implications and product recommendations.", "company": "meta", "url": "https://www.metacareers.com/jobs/821211773300988"}