{"title": "Art Manager, Avatars Art Team", "level": "", "location": "Burlingame, CA | Remote, US", "description": "Meta's Avatars Art Team is looking for an Art Manager to lead the character look and feel of its Avatars products. This leader will support a group of multidisciplinary industry leading artistic talent, in creating Meta's upcoming digital representation products for the Metaverse. As an Art Manager within Avatars, you will coordinate and drive the art team’s involvement and engagement with cross-functional groups within the Metaverse org and across the Family of Apps. Coming into this role, you will build strong executive relationships and partnerships across multiple internal cross functional groups including product, Engineering, Design, and more. You will oversee the creation of quality content, help our avatars be loved and used by billions of users. And most importantly, you will continue to grow our multidisciplinary, diverse art team.", "salary": "US$175,000/year to US$236,000/year + bonus + equity + benefits", "key_qualifications": "7+ years experience directly managing full-time artists, along with 7+ yrs developing and shipping character-based products in a game development, real-time rendering, or related technical environment. Demonstrated experience to manage the development, maintenance and documentation of art pipelines and vendor-based asset creation. Experience driving changes in operational processes and aligning teams to a strategic vision by solving conflicts and misalignments. Experience with roadmapping, budget management, and financial/performance tracking. Interest for supporting ICs and other managers to produce a collaborative environment, where individuals bring in their best to produce effective results. Effective communication, presentation and diplomatic skills.", "preferred_qualifications": "", "responsibilities": "Lead, manage, mentor, and grow a multidisciplinary team of Artists, Art Leads and Art Managers. Drive progress at people and project-facing levels by supporting team growth and prioritization, nurturing culture, building new partnerships, and more. Become a trusted strategic partner to product stakeholders and executive leadership by communicating and demonstrating the value of art, and by delivering insights that lead to demonstrable business value. Effectively influence key partner leaders to gain alignment in prioritization, resourcing, and budgeting. Engage with PMs, Designers and Engineer & Art Leads to define the art pipelines and components, scope and goals for key features within our various projects. Support managers, technical leaders, and the creative vision by communicating with executive leadership, and championing the team’s needs to build a world-leading avatar system. Provide thought-leadership in establishing, implementing, and improving direction, goals, and processes for executing both near and long term vision. Make staffing decisions based on business priorities, both short term and long term, as well as team strengths and motivation. Build a diverse and inclusive environment across the team, model inclusive behaviors.", "company": "meta", "url": "https://www.metacareers.com/jobs/821281139886296"}