{"title": "Software Engineering Manager, AI Compiler", "level": "", "location": "Bellevue, WA | Menlo Park, CA | New York, NY", "description": "The MTIA (Meta Training & Inference Accelerator) Software team has been developing a comprehensive AI Compiler strategy and optimizing compiler toolchains. This enables training and inference of Meta’s production DL/ML workloads on the specialized MTIA AI accelerator hardware in a highly performant and flexible way.\n\nWe are looking for a Software Engineering Manager who drives the compiler stack development & high performance compilers optimizations and tuning, specific to the MTIA AI accelerator hardware.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Experience with compiler architecture and development, particularly ML compilers or DSLs or static/dynamic languages compilers. 2+ years of experience in managing a team of compiler engineers of varied skill levels. Experience with cross functional collaboration with hardware or AI framework teams. Demonstrated experience recruiting, building, structuring, leading technical organizations, including performance management.", "preferred_qualifications": "Experience with compiler optimizations such as loop optimizations, vectorization, parallelization, HW architecture specific optimizations. Experience in compiling and code generation targeting ML accelerators or custom hardware, GPUs or CPUs. Experience with different programming models for high-performance computations, e.g. GPU CUDA programming or OpenCL or OpenMP programming. Experience with MLIR, or LLVM or IREE or XLA or Triton or TVM or Halide. Knowledge of ML frameworks like PyTorch, TensorFlow, ONNX, MXNet, etc.", "responsibilities": "Grow a team of domain experts within AI Compiler.\nCommunicate, collaborate, and build relationships with clients and peer teams to facilitate cross-functional projects.\nOperate strategically and tactically. Develop vision, strategy and help set direction for the team.\nRemain up-to-date on ongoing software development activities in the team, help work through technical challenges, and be involved in design decisions.", "company": "meta", "url": "https://www.metacareers.com/jobs/821621672954151"}