{"title": "Technical Program Manager, Data Infrastructure", "level": "", "location": "Bellevue, WA | Menlo Park, CA", "description": "Are you passionate about helping those around you be more effective? Do you think about technology as a way to increase efficiency and change how business operates? We are looking for candidates that share our passion for tackling complexity head-on, to help build software platforms that can scale through multiple orders of magnitude.\n\nData Infrastructure team is responsible for the end to end life cycle of data at Meta - from logging, ingesting, processing to making it available to users across the company for AI, ML and Analytics use cases.\n\nAs a Technical Program Manager, you will play a key role within Data Infrastructure team, driving large cross functional projects that span the organization. Our team is comprised of varying levels of experience and backgrounds, from new grads to industry experts. Relevant experience is important, but ultimately less so than your demonstrated abilities and attitude. Meta’s infrastructure is constantly redefining what is possible, and we need program managers that can do the same.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "B.S. in Computer Science or a related technical discipline, or equivalent experience. 10+ years of software engineering, systems engineering, or technical product/program management experience. Experience delivering tech programs or products from inception to delivery. Knowledge of user needs, gathering requirements, and defining scope. Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership. Communication experience and experience working with technical management teams to develop systems, solutions, and products. Organizational, coordination and multi-tasking experience. Analytical and problem-solving experience with large-scale systems. Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones.", "preferred_qualifications": "", "responsibilities": "Build strong and aligned program teams to efficiently deliver on shared goals. Collaborate with Engineering and business owners to define program requirements, set priorities, and establish scope which includes defining the roadmap and long-term strategy of the teams that you are partnering with. Manage cross functional dependencies, risks, and changes effectively by optimizing scope, schedule, and resources accordingly. Develop and own communication plans to effectively and proactively communicate program status, issues, and risks to stakeholders. Partner with cross functional teams to drive technical analysis, design, development, testing, implementation, and post implementation phases. Define and track key metrics and key quality and performance indicators and drive cross functional execution of program deliverables. Proactively identify and analyze complex, long-term, critical infrastructure problems with engineering leaders and stakeholders. Influence product decisions to align with higher company initiatives. Drive internal and external process improvements across multiple teams and functions including reducing the manual efforts through automation.", "company": "meta", "url": "https://www.metacareers.com/jobs/822220603203577"}