{"title": "Production Engineer", "level": "", "location": "New York, NY", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. To apply, click 'Apply to Job' online on this web page.", "salary": "US$140,190/year to US$158,400/year + bonus + equity + benefits", "key_qualifications": "Requires a Master's degree in Computer Science, Engineering, Information Systems, Analytics, Mathematics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: UNIX or Linux operating system fundamentals, TCP/IP network fundamentals, Coding in at least one of the following higher-level programming languages: PHP, Python, C++, or Java, Software frameworks and APIs, Performing 'guerilla capacity planning' for internet service architectures, Familiar with public cloud services like AWS or GCP, Internet service architectures (such as load balancing, LAMP, or CDN’s), Configuring and maintaining applications using at least one of the following: web servers, load balancers, relational databases, storage systems, or messaging systems, Relational Databases including MySQL, Network protocols including at least one of the following: NFS, DHCP, NTP, SSH, DNS, or SNMP, Experience with developing web-based applications using frontend framework like ReactJS or equivalent, backend framework like Flask or equivalent, backend framework like Flask or equivalent, Maintaining web-based applications using at least one of the following: Apache, Memcached, MongoDB, or DynamoDB, Storage Systems including NFS, Network Management tools like DHCP, NTP, SSH, DNS, or SNMP, Diagnosing and troubleshooting issues ranging from low-level hardware issues to large scale failures within datacenter clusters, Experience utilizing high performance query engines (Presto or Spark) for big data.", "preferred_qualifications": "", "responsibilities": "Develop, design, create, modify, and/or test software services to ensure optimal performance and capacity for growth. Own back-end data warehouse services, front-end services like Messenger and Newsfeed, and infrastructure components to ensure services run without incident. Write and review code, develop documentation and capacity plans, and debug the problems in real time in highly complex software systems. Serve as an escalation contact for service incidents. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Develop and maintain tools to automate service deployment, scaling, and monitoring processes, reducing manual intervention and increasing efficiency. Participate in cross-functional projects to improve service reliability, scalability, and security, working closely with other engineering teams to design and implement solutions that meet business requirements. Continuously evaluate new technologies and tools to improve engineering productivity and system performance, making recommendations for adoption where appropriate.", "company": "meta", "url": "https://www.metacareers.com/jobs/826502202911237"}