{"title": "Application Manager, Accounts Payable", "level": "", "location": "Austin, TX", "description": "Meta helps people connect and share. Over the last decade, our products have transformed the way people communicate with one another. Working at Meta offers countless ways to make an impact on the world. As we work to bring the next five billion people online and into the knowledge economy, we seek talented people to join us in our mission.\n\nMeta’s Enterprise Product team is responsible for building integrated, scalable, and robust enterprise applications. We are currently looking for an experienced, insightful, forward-thinking financial application SME with a strong ability to design and execute products that power the enterprise. As a member of the team, you will play a key role in reimagining productivity by shipping transformative products that serve the accounts payable function within Meta.", "salary": "US$140,000/year to US$195,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's Degree Computer Science, Business, Accounting or related field; 5+ years of experience in building Fusion Financial/Procure-to-Pay products (i.e. Accounts Payables, Procurement & Financials); 5+ years of experience configuring and developing process extensions in Procure-to-Pay/Financial applications; 2+ years of experience working on data models with hands-on SQL experience to write queries and perform data analysis; 1+ years of experience designing applications and creating examples through wireframes and mockups; Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Certification on Oracle Financials Cloud: Payables Implementation; Experience integrating AP Payments with SWIFT bureau; Experience in understanding code bases, including API design techniques; Experience implementing Oracle Fusion General Ledger and/ or Purchasing.", "responsibilities": "Providing subject matter expertise, designing and configuring Oracle Fusion Payables and Payments Applications; Responsible for collaborating with Source to Pay business partners for driving innovation and efficiency for timely Payables Period close, proactively managing period close activities and upstream milestones.; Responsible for application design and configuration of Procure-to-Pay Applications (specifically Oracle Fusion Payables and Payments); Identify enhancements and new projects to improve the product and end user experience; Create process extensions in Fusion to elevate business processes, support business needs and manage Payments scale (volume and value); Understand Fusion Payables and Payment data model, write Fusion BIP reports, complex SQL queries.; Perform data analysis to troubleshoot data issues and fix underlying bugs / root causes; Participate in source control and code review process; Provide expertise from an accounts payable process perspective; Communicate effectively with internal customers, enabling informed decision making within the team; Own, direct and manage a team of managed service providers to swiftly resolve support issues ensuring application health and reliability; Track key application metrics, drive insights and build dashboards to measure results against goals; Identify risks within the business function, Deliver clear documentation, and work directly with vendor support for escalations; Analyze issues of moderate complexity addressing configuration, implementation, and function or process fails; Develop and maintain a well-coordinated internal relationship with key decision makers and with the wider enterprise engineering organization; Lead/Support all business readiness activities including end user training, product testing, controls readiness and roll-outs.", "company": "meta", "url": "https://www.metacareers.com/jobs/826924646151578"}