{"title": "Postdoctoral Researcher, Central Applied Science, Adaptive Experimentation (PhD)", "level": "Postdoctoral", "location": "Menlo Park, CA, New York, NY", "description": "Meta is seeking a visiting postdoctoral researcher to join the Adaptive Experimentation team. The mission of the team is to do cutting-edge research and build new tools for sample-efficient learning and decision making (including Bayesian optimization) that democratize new and emerging uses of AI technologies across Meta, including Facebook, Instagram, and Reality Labs. Applications range from AutoML and optimizing Generative AI models, to automating A/B tests, to contextual decision-making to black-box optimization for hardware design.\n\nVisiting Researchers will be expected to conduct cutting-edge applied research at the intersection of Bayesian optimization, AutoML, and Deep Learning, while working collaboratively with teams across the company to solve important problems.", "salary": "US$56.25/hour to US$173,000/year + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.\nCurrently has or is in the process of obtaining a PhD in the field of computer science, machine learning, statistics, operations research, a related field, or equivalent practical experience. Degree must be completed prior to joining Meta.\nExperience with developing and debugging in Python with PyTorch or related deep learning frameworks.\nResearch experience and a publication track record in at least one of the following: Bayesian optimization, active learning, probabilistic methods and/or deep learning.\nMust obtain work authorization in the country of employment at the time of hire and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience with Generative AI.\nExperience with causal inference and/or applied statistics.\nExperience disseminating new methods through open-source projects.\nDemonstrated research and software engineering experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub).\nExperience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward.\nExperience working and communicating cross functionally in a team environment.\nProven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as publications at leading workshops, journals or conferences such as NeurIPS, ICML, ICLR, JMLR, AAAI, UAI, KDD, AISTATS or similar.", "responsibilities": "Develop algorithms and models for adaptive experimentation.\nConduct research to advance the state of the art in Bayesian optimization, active learning, and/or Bayesian modeling.\nContribute to and apply research that advances Meta Platforms products.\nConduct and collaborate on research projects within a distributed team.", "company": "meta", "url": "https://www.metacareers.com/jobs/831683095490690"}