{"title": "Research Manager, Monetization", "level": "", "location": "Menlo Park, CA", "description": "Meta's Monetization Research team creates economic opportunities globally by connecting businesses with potential customers and enabling consumers to discover delightful products/services. We play a vital role in a) evolving Machine Learning (ML) and Artificial Intelligence (AI) through identification of optimal paths, b) innovating rigorous evaluation and measurement methods for product effectiveness and quality, and c) developing solutions that allow businesses to harness the power of our ML and AI. We tackle some of the most important struggles of users with cutting-edge innovations.\n\nWe employ a variety of qualitative and quantitative methods to accomplish our goals, including surveys, causal modeling, contextual inquiry, diary study, usability tests, and 1:1 interviews. We value diverse perspectives and come from various backgrounds—geographically, culturally, educationally, philosophically. Our team members hail from industry and academia, with expertise in anthropology, design research, economics, HCI, human factors, political science, sociology, social computing, and social psychology, among others.\n\nWe seek a UX Research Leader capable of leading a large team comprising both manager and individual contributor roles. This person should possess exceptional people management skills, research expertise, and strong business acumen.", "salary": "US$192,000/year to US$265,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree or significant experience conducting UX research with meaningful business impact; 18+ years of experience conducting and/or studying research post-Bachelor’s degree; 5+ years of experience directly managing, coaching and developing full-time researchers; Experience directly managing across different research methodologies (qualitative and quantitative); Experience directly conducting primary research (either qualitative or quantitative) end-to-end (i.e., designing, fielding, analyzing and reporting out data); Experience building teams over time through hiring, growing, and retaining high-performing researchers; Experience building and setting research strategy that connects with business strategy; Experience translating research into business impact; Experience working with a variety of cross-functional peers and stakeholders (e.g., product managers, engineers, data scientists, designers).", "preferred_qualifications": "Graduate degree +; Experience with enterprise/cloud/SaaS/B2B2C software, in developer experiences, in compliance or auditing; 5+ years of UX research experience; 1+ years experience managing managers.", "responsibilities": "Manage a research team that is large in size and/or complexity, incl. expectation-setting and goals for individual contributors and managers and the team; Make staffing decisions based on business priorities, both short-term and long-term, as well as team strengths and motivation; Adjust management style to best support each team member. Give clear, actionable feedback on a timely basis; Shape team strategy, identifying risks and prioritizing opportunities; Identify gaps and solutions for future growth and scale within the team or organization, including system, product, function, partnership, culture and/or organization opportunities; Uphold quality for the team, including coaching, growing individual contributors and managers and coaching under-performing team members; Build a diverse and an inclusive environment across the team, model inclusive behaviors, and teams accountable; Build our research practice, articulate the vision of the team to cross-functional partners and be a strong advocate for the role of research in product development; Become a trusted, strategic partner to product stakeholders by communicating and demonstrating the value of user research, and by delivering insights that lead to demonstrable business value; Develop and clearly communicate a point of view about strategic decisions, across all organizational levels, and across organizational units, using insights from the team. Understand how to influence stakeholders and leaders to implement the best ideas; Partner with the other org leads to set the vision, mission, and strategy for the organization; Nurture and develop relationships with other organizations across Meta to accelerate the mission of the team; Drive team execution, culture, and process across the Infra Experiences community; Identify ways to elevate and uplevel Research with product leadership.", "company": "meta", "url": "https://www.metacareers.com/jobs/834200841944333"}