{"title": "Technical Program Manager, Software Infrastructure - Core Systems", "level": "", "location": "Bellevue, WA | Menlo Park, CA | New York, NY", "description": "TPMs work at the cross-section between technical execution and business strategy and are expected to partner closely with Business, Engineering and Product teams. Being a TPM at Meta means driving impact by delivering measurable results across a wide range of areas. You'll be responsible for defining and guiding high-level goals and roadmaps, monitoring and communicating progress, and defining functional requirements for new products and features. It also means having a strong technical background, understanding system architecture, and the experience to effectively collaborate across functions and organizations to deliver impact.\n\nMeta’s Core Systems team is seeking a passionate TPM who will work with cross-functional teams to solve complex technical problems and will share the same passion to drive the efficiency of Meta Infrastructure. The ideal candidate will be able to bring strong thought leadership, technical understanding, and execution excellence to major initiatives in the Core Systems space, resulting in robust infrastructure that scales to the next billion people worldwide.", "salary": "US$167,000/year to US$230,000/year + bonus + equity + benefits", "key_qualifications": "BS degree in Computer Science, Computer / Electrical Engineering or other technical field. 7+ years of software engineering, systems engineering, hardware engineering, or technical product/program management experience. Experience delivering complex large scale tech programs spanning across multiple org boundaries. Knowledge of user needs, gathering requirements, and defining scope. Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership. Communication experience and experience working with technical management teams to develop systems, solutions, and products. Analytical and problem-solving experience with large-scale systems.", "preferred_qualifications": "Experience to influence multiple stakeholders, achieve strategic goals and evolve product strategy based on research, data, and industry trends. Deep understanding of or experience with distributed systems", "responsibilities": "Collaborate with Engineering and business owners to define program requirements, set priorities, and establish scope which includes defining the roadmap and long-term strategy of the teams that you are partnering with. Manage cross functional dependencies, risks, and changes effectively by optimizing scope, schedule, and resources accordingly. Partner with cross functional teams to drive technical analysis, design, development, testing, implementation, and post implementation phases. Develop and own communication plans to effectively and proactively communicate program status, issues, and risks to stakeholders. Define and track key metrics and key quality and performance indicators and drive cross functional execution of program deliverables. Drive process improvements across multiple teams and functions including reducing the manual efforts through automation. Proactively identify and analyze complex, long-term, critical infrastructure problems with engineering leaders and stakeholders.", "company": "meta", "url": "https://www.metacareers.com/jobs/835254718449321"}