{"title": "Product Management Director - Privacy", "level": "", "location": "London, UK", "description": "Meta has done a tremendous job of giving people the power to build community and bring the world closer together. To get there, people have shared their information with us that helps to shape and improve their experience with our products. As a result, the world is placing a higher emphasis on Privacy than ever before, as is Meta.\n\nIn Privacy, we’re making a lasting impact by shaping how regulations will govern an entire industry for decades to come. And as we work toward our mission to instill responsible data practices across Meta, our main focus is on meeting our obligations and doing so with increasing efficiency.\n\nIn service of this goal we have multiple high visibility, high impact senior product roles available in Privacy, which will put you right at the heart of some of the company’s most important investments and challenges. You might find yourself working on a company wide regulatory response, supporting product teams across Meta on both strategy and execution. Or you may develop a deep expertise in a particular theme of external pressure, shaping the company product direction and developing centralised systems and tooling to allow the business to execute at pace whilst staying on top of our obligations.\n\nAs you progress through our interview process we will match you with the best role for your skillset and interest.", "salary": "", "key_qualifications": "12+ years in Product Management or equivalent. Experience leading in a technical environment with a broad, cross functional team to drive product vision, define product requirements, coordinate resources from other groups (design, legal, etc.), and guide the team through key milestones. Experience working with, influencing and presenting to executive level stakeholders (VP & C-level). Experience driving highly ambiguous, broad and highly complex topics to extreme clarity of strategy and execution, at pace, in a dynamic environment. Experience identifying company trajectory altering opportunities, and driving product vision, strategies and roadmaps that reshape broader organisational strategies and goals.", "preferred_qualifications": "Privacy Understanding, Consumer Product, Data strategy, AI domain expertise", "responsibilities": "Captain strategic initiatives for company trajectory altering problems, negotiating the approach with executive leadership, developing the execution plan with partner orgs, and ensuring we meet deadlines and commitments without affecting the company's ability to execute. Stand up new Privacy teams in our most highly pressured or ambiguous areas, establishing the direction and setting them on an impactful course with clear plans. Accelerate our ability to meet privacy commitments by developing and landing long term strategies in anticipation of upcoming external pressures. Support product teams across Meta in navigating complex trade offs in their decision making. Identify and execute upon opportunities to create centralised tooling and systems that helps the company to move fast while meeting our obligations. Execute effectively in a constantly evolving environment where the process is fluid and creative solutions are operationalised at a very fast pace. Navigate highly ambiguous, complex pressured situations with grace, and build confidence across the organisation and the product management team. Identify and execute on opportunities to improve the culture and capacity of the product and privacy organisations at Meta.", "company": "meta", "url": "https://www.metacareers.com/jobs/835851865110458"}