{"title": "Hardware Engineer, Power", "level": "", "location": "Menlo Park, CA, Fremont, CA", "description": "Meta’s mission is backed by a massive hardware infrastructure. Our computational challenges are big, complex, and consistently evolving. Your work has the potential to shape the compute hardware and AI hardware going into our cutting-edge data centers affecting billions of users. Meta is seeking a passionate Electrical Engineer to join our Power Systems team.\n\nOur team is responsible for designing rack power solutions covering in-rack AC/DC and DC/DC, to support our fast growing infrastructure at scale. Internally, we work closely with cross-functional teams to define the most efficient power hardware system, and to optimize for data center deployment. Externally, we work closely with industry partners, driving through the design cycle from beginning to end, ensuring high-quality product delivery. Our designs have been contributed to the Open Compute Project.", "salary": "US$129,000/year to US$200,000/year + bonus + equity + benefits", "key_qualifications": "BS in Electrical Engineering or related Engineering Degree, or similar, with 5+ years of industry experience. 5+ years of experience with validation and design of DC-DC voltage regulators (e.g. Control schemes, Power Stage MOSFETs, Magnetics and Decoupling), hot-swap circuitry (e.g. Controller ICs, MOSFET Load Switches, and Current Sense Amplifiers) and PDN design. Experience with low voltage and high current power subsystems of CPU, GPU, SoC, ASIC and/or FPGA, and related schematic and PCB design. Experience with analyzing and resolving power delivery related hardware issues. Experience with power integrity evaluation. Familiar with schematic and PCB CAD programs.", "preferred_qualifications": "MS or PhD in Electrical Engineering with emphasis in power electronics. 7+ years of relevant industry experience in, power delivery validation and design. Experience with end-to-end power delivery network design, simulation (e.g. SIMPLIS, Sigrity PowerDC/SI, ANSYS SIWave or equivalent) and board level correlation. Experience with design and troubleshooting of power management interfaces (e.g. PMBus, AVS, SVID, & SVI2). Familiar with power delivery architecture of one major CPU supplier. Familiar with defining specification and validation of power connectors, cable assemblies, and fuses. Familiar with NPI hardware design and deployment cycle. Knowledge of using Linux for testing and automation/script development. Experience with development of test automation for power validation.", "responsibilities": "Specify, design, and develop power delivery and DC-DC power conversion solutions in hardware systems. Lead the bring-up, validation of power subsystem to achieve highest efficiency, reliability, and scale-ability. Support hyper-scale deployment and proactively gather learning for next generation design. Collaborate with open source hardware community to drive innovation for large scale infrastructure. Contribute to system end to end DC-DC power delivery and voltage conversion technology roadmap.", "company": "meta", "url": "https://www.metacareers.com/jobs/837222021608187"}