{"title": "Software Engineer, Browser - Reality Labs", "level": "", "location": "Bellevue, WA | Burlingame, CA", "description": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.\nAs a Software Engineer, Browser on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.\n\nThe 3D Web Platform team builds the WebXR platform that enables web developers to deliver web-based VR and MR experiences via Meta Quest Browser on all of our Quest headsets. The 3D Web Platform team is an industry leader in this space – we are actively engaged with the W3C to define and evolve the WebXR Web Standard, we have strong relationships with the WebXR developer community, we build and maintain the popular Immersive Web Emulator tool, and we are responsible for the best-in-class WebXR implementation in Meta Quest Browser.\nThe 3D Web Platform team is leading the industry in driving open web standards around MR and VR capabilities. In this role, you will have the opportunity to collaborate with engineers from Apple, Google, and Microsoft on defining the open web standards that will shape the future of MR/VR on the web for years to come.\nYou'll also have the opportunity to interact with 3P developers who are using the features you build, hear their feature requests and pain points, and ultimately deliver a 3D Web Platform that empowers them to build amazing MR and VR experiences delivered via web browser.\nThis is a great opportunity to play a pivotal role in shaping the future of VR/MR development on the web. If you’re interested in learning more, please reach out.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 6+ years of software development experience. 2+ years of experience defining and driving technical work streams and providing technical leadership for software engineering teams. 2+ years of experience with Web browser development. Experience with building and deploying new features at scale in a browser engine or browser. Experience with coding in C++. Experience developing, debugging, and shipping software products on large code bases that span platforms and tools. Experience with debugging performance and reliability issues on Browser Engines.", "preferred_qualifications": "Experience participating in the development of Open Web Standards (W3C, etc.), with a focus on 3D or 2D rendering standards. Experience with building and deploying new features at scale in a Chromium based browser. Experience with debugging performance and reliability issues on Chromium. Experience with Chromium/Blink development. 1+ years of experience developing software for Mobile platforms (Android/iOS).", "responsibilities": "Interface with teams across Reality Labs to identify promising Quest platform features that can be surfaced to web developers. Propose and drive open web standards proposals related to WebXR and VR/MR capabilities on the web. Implement those proposals in Meta Quest Browser to a high level of quality and performance. Interface with 3P web developers to understand their feature asks and pain points, and work with the team to find ways to empower these developers.", "company": "meta", "url": "https://www.metacareers.com/jobs/837454251404806"}