{"title": "Director of Technology Sourcing, Silicon", "level": "", "location": "Fremont, CA", "description": "To support our 3.8B+ users, Meta develops and deploys scale infrastructure globally, across data centers, networks, compute, and storage.  Global Supply Chain Technology Sourcing owns the sourcing strategy development, external business relationships, internal engineering partnerships, and execution from new product ideas to scale deployment.  The team combines commercial, technical, and operations/manufacturing expertise to progress advances in critical infrastructure domains, including artificial intelligence and custom silicon development.\n\nMeta is seeking a leader that creates disruptive value optimizing cost and risk across the supply chain.  Critically, you possess the business and technical capabilities to influence infrastructure product strategy and drive industry level change. In this role, you will be responsible for sourcing across our semiconductor ecosystem, including the commercial, operational and technical performance of our various silicon technologies and related supplier base. Together with your team and numerous internal partners, you will be responsible for quality, product and material availability, and cost that spans all Meta infrastructure.", "salary": "US$215,000/year to US$274,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Electrical Engineering, or related engineering field; 15+ years experience leading and managing teams within an engineering and supply chain organization; Proven understanding of silicon products and development and solutions across AI, compute, storage and scale data centers; Demonstrated experience to successfully negotiate large, complex agreements covering a wide range of technologies; Demonstrated track record of developing and successfully executing complex supply chain strategies in relevant technical domains; Experience delivering results in multiple manufacturing models; Experience in NPI launches, product ramp, sustaining support, and end-of-life cycle for compute hardware products in a large-scale environment; Track record of identifying, developing, and promoting talent; Experience setting vision and executing reliably. Demonstrated experience in hiring, training, and developing source and supply chain teams; Experience in cross functional partnership and enabling the success of others; Experience transforming business systems, models, and achieving results relative to goals. Demonstrated skills questioning the norm, thinking out-of-bounds, and delivering.", "preferred_qualifications": "MBA or Master of Science degree in an engineering field; Program management experience", "responsibilities": "Develop domain strategies to yield optimal economic and supply risk outcomes for all critical silicon and SOC technology infrastructure; Lead the active management of external partner relationships at the C-suite level, including commercial and supply agreements; Influence internal infrastructure product direction both commercially and technically to yield optimal results; Manage supply chain risks and optionality to ensure the timely delivery of quality infrastructure products globally; Develop sourcing strategies that address the unique needs of supply chain and manufacturing at hyperscale; Grow and lead a world class supply chain team, developing talent at all levels.", "company": "meta", "url": "https://www.metacareers.com/jobs/841942081163713"}