{"title": "Clinical Research Coordinator, Health and Wellbeing", "level": "", "location": "Burlingame, CA | New York, NY", "description": "The Health Health and Wellbeing Team at Meta is seeking a Clinical Research Coordinator to support data collection. This role will work with a team of multidisciplinary stakeholders to support planning and execution of multiple levels of research and validation of novel approaches. The appropriate candidate can manage multiple aspects of research including aligning internal stakeholders (i.e. research teams, engineering, legal) and external partners (i.e. vendors, academic collaborators, IRB, regulators) to achieve concrete research and product goals. The ideal candidate brings a wealth of skill in executing high quality scientific research and also understands the goals and needs required to ship high quality digital products.", "salary": "US$116,000/year to US$166,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree or higher in an area requiring significant human subjects research. 2+ years of experience with clinical research in either academic and/or commercial settings, with a proven understanding of the study lifecycle and clinical research ecosystem. A proven knowledge and proficiency in navigating the sensitive issues around human subjects and clinical research in digital health. Technical expertise in study start-up, human subjects enrollment, consenting, data collection and data management. 4+ years experience working with multidisciplinary stakeholders such as research scientists, statisticians, product managers, software engineers.", "preferred_qualifications": "Strong technical experience in digital health and wearable technologies, skills to troubleshoot clinical research related issues. Familiar with software and hardware tooling, electronic data capturing systems that support clinical research studies. Experience in working with contracted research organizations.", "responsibilities": "Coordinate clinical technology validation studies, leading operational planning and day-to-day management of research execution. Serve as primary contact with research participants, vendors, and research leads. Coordinate studies from startup through close-out. Develop and manage data collection processes. Maintain research project databases, develop flow sheets and other relevant study documentation. Maintain research schedule, communicate study milestones and reporting to research team. Assist research team with Institutional Review Board (IRB) submission and compliance management. Align operational aspects of research with the needs of other internal stakeholders including engineering, legal, and product requirements. Assist research team with the assessment and implementation of new processes to gain efficiencies for study set up and administration. Travel at least 30%.", "company": "meta", "url": "https://www.metacareers.com/jobs/843492044301524"}