{"title": "Regional Specialist, Global Response Operations, South Asia", "level": "", "location": "Singapore", "description": "Global Response Operations focuses on supporting users through scalable solutions that match the observed community needs. We are looking for influencers who can align cross-functional partners to ensure the best possible experience for users on our platforms.\n\nThe Global Response Operations SEO (Specialized Enforcement Operations) team is seeking a solutions-oriented, data-savvy Expert who is passionate about providing a great support experience for our community of users.\n\nThe successful candidate will work with the India and South Asia team to review and enforce on content reported for potential abuse, resolve user account issues, improve the overall support experience for users in South Asia, as well as solve enforcement issues across a wide range of Meta markets.\n\nIn SEO the team specifically focuses on high priority, complex or regulatory enforcement demand, where our systems or scaled solutions need specialized support. SEO’s team is flexible and agile, bringing enforcement expertise that can be deployed to shifting priorities and dynamic emergent situations, necessitating local context, language, policy, community or functional expertise.\n\nThe Regional Specialist will be part of a data-driven analysis culture that works to protect our communities by enforcing on and will also help scale our operations by optimizing and automating processes, solving challenging problems and, most importantly, helping to prevent them.\n\nThis position is full time and is based in our Singapore office.", "salary": "", "key_qualifications": "Ability to work with potentially graphic and objectionable content.\nBachelor's degree and/or Master's or equivalent experience\nFluency in written and conversational Hindi, demonstrable ongoing connection with the community in India and detailed knowledge of its culture and common practices\nStrong analytical and creative problem-solving skills\n6+ Years of professional experience in an operations environment.", "preferred_qualifications": "Technical and data skills such as Excel and SQL OR experience with visualisation tools such as Tableau to drive efficient analytics and reporting\nSenior stakeholder negotiation.\nPolicy experience, preferably in content or media governance or trust and safety\nBackground in compliance, audit, or risk management.", "responsibilities": "Work as part of the SEO India team, enforcing on paid and organic (non-paid/user) content during a crisis response within the South Asia region while specifically having fluency in Hindi language.\nWork as part of an On-call Operational structure to enforce on critical content, particularly in response to government, regulatory and Trusted Partner escalations, within the SEO Markets with a higher focus on India.\nIndependently conduct root cause analysis and effectively resolve issues reported on Meta products, covering account support requests and abusive content types like graphic media, offensive language, or other objectionable materials.\nEnsure comprehensive coverage and enforcement of agnostic and paid content that originates from multiple sources globally, where language expertise may not be available.\nDevelop and implement strategies to mitigate integrity risks in the global and regional advertising business during risk events, while protecting users and advertisers and removing friction in the ad delivery process.\nEvaluate top-line operational metrics and drive strategic collaborations with internal cross-functional teams to enhance our processes and tools.\nDrive key integrity initiatives by collaborating with regional cross-functional teams, such as policy and legal, and contibute to stakeholder management across the market and broader region.\nThis role may involve exposure to potentially graphic and/or objectionable content including but not limited to graphic images, videos, audio and writings, offensive or derogatory language, and other potential objectionable material, i.e. child exploitation, graphic violence, self-injury, animal abuse, and other content which may be considered offensive or disturbing.", "company": "meta", "url": "https://www.metacareers.com/jobs/846049440920272"}