{"title": "Executive Administrative Partner (STE - 13 months)", "level": "", "location": "Tel Aviv, Israel", "description": "Meta is seeking an experienced Executive Assistant to join the team supporting the VP, Israel. The ideal candidate will have exceptional communication administrative skills. This person should be process focused, highly organized, energetic, detail oriented, a problem solver and a great content expert.\n\nThis is a Short Term Employment (STE) role of 13 months and will be located in our Tel Aviv office.", "salary": "", "key_qualifications": "2+ years of project management experience; Experience prioritizing and managing multiple projects and tasks; Attention to details and deadlines; Experience working with all levels of management; Written and verbal communication skills; Presentation skills; Experience collaborating and partnering closely with other administrative professionals and key cross functional partners; Computer skills and comprehension of Outlook/MSOffice and Google Suite or similar", "preferred_qualifications": "BA/BS; 2+ years of executive assistant support to a leader in terms of agenda, expenses and admin work; 2+ years of experience coordinating travel logistics on behalf of 1 or more executives; Content strategy expertise and experience", "responsibilities": "Manage complex and fluid calendaring; Coordinate internal and external meetings involving multiple executives; Build cross-functional relationships between departments; Manage and coordinate priorities and content; Respond quickly and accurately to emails, messages, and other communications; Maintain spreadsheets, contacts, distribution lists, etc.; Coordinate domestic and international travel arrangements and visas; Organize team and org events; Manage expenses; Take ownership of organization’s people and business priorities/needs; Ensure and maintain confidentiality of communications and documentation; Manage projects with precise attention to detail", "company": "meta", "url": "https://www.metacareers.com/jobs/847599570574228"}