{"title": "Data Engineer, Analytics", "level": "", "location": "Bellevue, WA | Redmond, WA | Menlo Park, CA | Seattle, WA | Burlingame, CA | Washington, DC | New York, NY", "description": "Are you passionate about Facebook’s product, analytics and technology? The Analytics, Data Engineering team is looking for fast-moving analytics candidates and data junkies who want to make an impact. Our data warehouse team works very closely with Product Managers, Product Analysts and Internet Marketers to figure out ways to acquire new users, retain existing users and optimize user experience - all of this using massive amounts of data. In this role, you will see a direct link between your work, company growth, and user satisfaction. You will work with some of the brightest minds in the industry, and you'll have the opportunity to solve some of the most challenging business problems on the web and mobile Internet, at a scale that few companies can match.", "salary": "US$46.63/hour to US$134,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining, a Bachelors or Masters degree in Computer Science, Mathematics, or related technical field. Programming knowledge in Python or Java. Knowledge of SQL. Knowledge of database systems. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.", "preferred_qualifications": "Experience thriving in a fast-paced work environment. Curious, self-driven, analytical and excited to play with data. Experience in collaborating with individuals and organizations.", "responsibilities": "Architect, implement and deploy new data models and data processes in production. Perform data analysis to generate business insights. Interface with Engineers, Product Managers and Product Analysts to understand product goals and data needs. Build data expertise and own data quality for allocated areas of ownership. Manage data warehouse plans for a product or a group of products. Support critical data processes running in production.", "company": "meta", "url": "https://www.metacareers.com/jobs/851953990062965"}