{"title": "Software Engineer (Leadership) - Machine Learning", "level": "", "location": "Bellevue, WA | Redmond, WA | Menlo Park, CA | Seattle, WA | Burlingame, CA | New York, NY | San Francisco, CA", "description": "Meta is seeking Machine Learning Engineers to join our engineering team. The ideal candidate will have industry experience working on a range of classification and optimization problems like payment fraud, click-through rate prediction, click-fraud detection, search ranking, text/sentiment classification, collaborative filtering/recommendation, or spam detection. The position will involve taking these skills and applying them to some of the most exciting and massive social data and prediction problems that exist on the web.", "salary": "US$264,000/year to US$342,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Experience leading projects with industry-wide impact. Experience communicating and working across functions to drive solutions. Experience in mentoring/influencing senior engineers across organizations. Proven track record of planning multi-year roadmap in which short-term projects ladder to the long-term vision. Experience in driving large cross-functional/industry-wide engineering efforts. 12+ years of experience in programming languages (Python, C++, or Java) with technical background. 8+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining or deep learning based methods.", "preferred_qualifications": "Experience in shipping products to millions of customers or have started a new line of product.", "responsibilities": "Drive the team's goals & technical direction to pursue opportunities that make your larger organization more efficient. Effectively communicate complex features & systems in detail. Understand industry & company-wide trends to help assess & develop new technologies. Partner & collaborate with organization leaders to help improve the level of performance of the team & organization. Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas. Suggest, collect and synthesize requirements and create an effective feature roadmap. Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules-based models. Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU).", "company": "meta", "url": "https://www.metacareers.com/jobs/853069902697552"}