{"title": "Product Manager Lead, Care Customer Support Platform", "level": "", "location": "London, UK", "description": "Meta is searching for a seasoned Product Leader eager to revolutionize enterprise support by setting Meta as the industry benchmark for delivering exceptional customer service through our tools and services. We are looking for extremely entrepreneurial Product Management Leaders to help innovate and execute product initiatives across the company.\n\nOur approach involves developing a cutting-edge, universal platform for customer support that leverages generative AI to incorporate best-in-class user experiences (such as conversational interfaces, chatbots, live chat, and proactive in-product solutions), agent experiences (such as conversation summary, agent copilot, and reply recommendation), reporting and analytics.\n\nIn addition to creating this platform, our role encompasses the onboarding and support of a wide range of internal and external business partners, such as Reality Labs, HR, IT Help Desk, and more. By doing so, we empower these partners to enhance customer service for their end users while concurrently constructing a centralized, scalable customer service platform that benefits Meta as a whole.\n\nAlthough prior experience in this field is highly valued, we welcome generalist PM Leaders who share a passion for addressing these complex, significant challenges.", "salary": "", "key_qualifications": "Experience in Product Management and/or Product Design; Experience working collaboratively with engineering, design and user research teams; Management experience with direct reports under your guidance and leadership; Critical thinking/analytical leadership experience; Experience presenting to senior executive audiences; BA/BS in Computer Science or related field", "preferred_qualifications": "Familiarity with Salesforce Service Cloud or other customer support solutions; Experience in a building Enterprise products; Experience building 0-1 products, platform/ecosystem products, or marketplaces", "responsibilities": "Lead a team through the ideation, technical development, and launch of innovative products; Build, manage, and develop a talented, diverse, equitable and inclusive team of product managers; Establish shared vision across the company by building consensus on strategies and priorities leading to product execution; Drive product development with a team of world-class engineers and designers; Integrate usability studies, research and market analysis into product requirements to enhance user satisfaction; Define and analyze metrics that inform the success of products; Understand Meta’s strategic vision and deliver products that are recognized as best in the industry; Maximize efficiency in a constantly evolving environment where the process is fluid and creative solutions are the norm", "company": "meta", "url": "https://www.metacareers.com/jobs/857772493033776"}