{"title": "Partner Engineer, iOS", "level": "", "location": "Menlo Park, CA | Seattle, WA", "description": "Partner Engineering is a highly technical team that works with our strategic partners to integrate Facebook products into their mobile platforms, apps, and devices. Our Partner Engineering team has enabled various features & services from Facebook family of apps to mobile partner devices, improved media quality in Facebook family of apps and led new mobile OS adoption across Facebook. Partner Engineers bring deep technical knowledge of mobile platforms to lead highly visible initiatives and launch impactful products with our strategic mobile partners.\n\nYou will engage with some of the world's most influential companies to drive Facebook family of apps' compatibility and quality on iOS, and internally with our Product team to enhance those apps. The ideal candidate will combine technical and business skills to make our partners successful and improve Facebook family of app quality on their devices.", "salary": "US$111,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. 2+ years of relevant industry experience - software engineering or partner engineering. B.A/B.S. or M.S. in Computer Science or equivalent degree or experience. Experience with iOS development and using iOS SDKs and other frameworks. Software development experience in languages and environments such as Objective C/Swift, and/or Java/PHP. Experience working with iOS operating system.", "preferred_qualifications": "Experience communicating with external parties. Familiarity with large code bases, including API design techniques.", "responsibilities": "Improve the quality of Facebook apps on our partners' latest iOS devices by providing feedback to product team on gaps/bugs and fix them proactively. Contribute to assigned project/product and technology area on iOS and industry/partners. Provide technical consultation to partners and deliver quality project/integration/partner engagements with direction from the manager or team after scoping. Use broad range of technical and soft skills to build productive relationships with our partners, and resolve technical and business needs. Respond and maintain effective communication with iOS ecosystem partners and internal stakeholders. Develop and manage relationships with external and internal partners. Actively participates in creating a positive atmosphere amongst team and beyond. Understand tools, concepts and processes related to Facebook family of apps, and underlying implementation across iOS. Document and share learning within the team upon completion of projects. Willingness to travel approximately 10% of the time.", "company": "meta", "url": "https://www.metacareers.com/jobs/857940146164781"}