{"title": "Research Scientist, FAIR - Developmental AI (PhD)", "level": "", "location": "New York, NY", "description": "Meta is seeking Research Scientists to join its Fundamental AI Research (FAIR) organization, focused on making significant advances in Developmental AI. Current machine learning algorithms can match human performance in a variety of tasks but require orders of magnitude more data. DevAI aims at building AI agents that learn autonomously from few amounts of real world data and interactions as children do. This covers the design of algorithms that leverage advanced machine learning techniques to improve robustness and sample efficiency, the building of datasets or simulators of ecological data, and benchmarks to compare how fast children and machines learn given similar input. The focus is on grounded language and communication. We publish groundbreaking papers and release frameworks/libraries that are widely used in the open-source community fostering the advancement of AI at its intersection with the study of natural intelligence. We seek researchers with a mixed expertise in machine learning (speech, language, core ML) and cognitive science (developmental or language science) to join our research team to foster cutting-edge research in Developmental AI.", "salary": "US$117,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining, a PhD in mathematics, physics, statistics, computer science, cognitive or language science with a background in both theoretical and empirical approaches. Documented interest in cross-disciplinary research in topics relevant to developmental AI. Evidence of research background with publications in conferences/journals in the related fields. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Proven track record of achieving significant results as demonstrated by grants, or fellowships, as well as publications in *ACL, top speech or CV conferences (eg. Interspeech, CVPR), or machine learning conferences (NeurIPS, ICML). Publications in top cognitive (neuro)science journals or conferences (Cognition, Cognitive Science, etc) a plus. Experience building systems based on machine learning and/or deep learning methods. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment.", "responsibilities": "Publishing state-of-the-art research papers in both high impact machine learning and cognitive science outlets. Conducting independent research that investigates how AI can improve the science of learning in biological organisms and vice versa. Lead and collaborate on research projects within a globally based team. Open sourcing high quality code and reproducible results for the community.", "company": "meta", "url": "https://www.metacareers.com/jobs/858416939651297"}