{"title": "Business Affairs Manager", "level": "", "location": "Los Angeles, CA | New York, NY | San Francisco, CA", "description": "Creative X is a global agency that drives the creative vision for our brands and how they are perceived in the world. We develop the vision for next-generation creative advertising, consumer brand content and experiences for Meta, Facebook, Instagram, WhatsApp and our hardware products.\n\nOur vision is fearless creativity that shapes the future of connection. With some of the industry’s best talent on our team, we create beautiful work that has a purpose. And with an audience of almost five billion across some of the world’s biggest brands, we create brave ideas that demonstrate the full creative potential of our platforms, including industry leading, envy-inducing creative experiences that push the boundaries of traditional advertising.\n\nWe believe in attracting and nurturing world class talent with a focus on diversity, community and career development. We have developed best-in-class collaboration models with agencies and our cross-company creative network to ensure a consistent and strong creative narrative for work that reaches an audience across the globe due to the scale of our products.\n\nYou will be hands-on in the operations of the cross-functional Business Affairs Team and involved in the process of making content from start to finish. You'll combine your production and advertising knowledge, strong business acumen, creativity and growing understanding of Meta’s platforms and products to contribute to an efficient and innovative Business Affairs Team that sets the bar for the entire industry. The ideal candidate will have expertise in, and passion for: digital content, creative production, marketing/advertising law, and entertainment development deals. You’ll have fluency working with advertising agencies, media companies, publishers, networks, and production companies with a solid understanding of a range of content execution strategies. You are entrepreneurial in spirit, ready to roll up your sleeves and dig into the complexities of any business and strategy challenge.", "salary": "US$118,000/year to US$172,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of Business Affairs experience within creative agencies or similar environment. Experience with social networking, platform integrations, publishing platforms, broadcast & new media. Experience with Union requirements, agreements, and negotiations. Experience forming relationships with digital creators, publishers, creative agencies, and studio experience negotiating strategic transactions. Experience managing complex work streams and working with multiple cross-functional partners. Experience operating with a sense of urgency. Must be eligible to work in the US", "preferred_qualifications": "Experience working in a highly matrixed, often ambiguous environment. Experience working collaboratively in a highly cross-functional environment. Experience pursuing emerging technologies. Future-first mindset, and experience creating in new platforms. This may include, but is not limited to: augmented, virtual or mixed reality, gaming, Web3, AI, NFTs, avatars, etc", "responsibilities": "Work across projects on Meta, Reality Labs, Facebook app, Instagram, Messenger and/or WhatsApp managing all CX work and involvement with external agencies. Advise on all Business Affairs matters around creative development, production, post-production and service of all entertainment and business endeavors for Creative X from a legal, financial and strategic perspective. Work with all cross-functional partners that overlap with the Business Affairs team: Legal, Finance, Sourcing, Partnerships, Music and Privacy. Project manage complex work streams. Work with legal team on production legal, litigation, copyright/trademark, music, and rights/clearance matters. Analyze deal opportunities and formulate business strategies with respect to talent and production matters. Maintain relationships with key agencies, managers and attorneys in the entertainment community. Maintain corporate compliance with contractual and legal obligations in regards to Creative X.", "company": "meta", "url": "https://www.metacareers.com/jobs/858521476128917"}