{"title": "Software Engineer, Machine Learning", "level": "", "location": "Tel Aviv, Israel", "description": "Meta is embarking on the most transformative change to its business and technology in company history, and our Machine Learning Engineers are at the forefront of this evolution. By leading crucial projects and initiatives that have never been done before, you have an opportunity to help us advance the way people connect around the world.\n\nThe ideal candidate will have industry experience working on a range of recommendation, classification, and optimization problems. You will bring the ability to own the whole ML life-cycle, define projects and drive excellence across teams. You will work alongside the world’s leading engineers and researchers to solve some of the most exciting and massive social data and prediction problems that exist on the web.", "salary": "", "key_qualifications": "Experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining or artificial intelligence\nProven experience to translate insights into business recommendations\nExperience with Hadoop/HBase/Pig or MapReduce/Sawzall/Bigtable\nKnowledge developing and debugging in C/C++ and Java\nExperience with scripting languages such as Perl, Python, PHP, and shell scripts", "preferred_qualifications": "Exposure to architectural patterns of large scale software applications\nCurrently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "responsibilities": "Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules based models\nSuggest, collect and synthesize requirements and create effective feature roadmap\nCode deliverables in tandem with the engineering team\nAdapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU)", "company": "meta", "url": "https://www.metacareers.com/jobs/859557726051270"}