{"title": "Software Engineer, Product", "level": "", "location": "Menlo Park, CA", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. To apply, click “Apply to Job” online on this web page.", "salary": "US$178,360/year to US$200,200/year + bonus + equity + benefits", "key_qualifications": "Requires a Master's degree in Computer Science, Engineering, Mechanical Engineering, Information Systems, Analytics, Mathematics, Statistics, Physics, Applied Sciences, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: Coding in at least one of the following industry-standard languages: C, C++, Java, or C#; Building large-scale infrastructure applications; Creating web applications using at least one of the following: Python, PHP, or Ruby; Relational databases and SQL; Implementing web interfaces using at least one of the following: JavaScript, HTML, or CSS; Leveraging frameworks including experience in at least one of the following: React or React Native; Conducting design and code reviews.", "preferred_qualifications": "", "responsibilities": "Develop, design, create, modify, and/or test software applications or systems for various products or software services. Develop a strong understanding of relevant product area, codebase, and/or systems. Demonstrate proficiency in data analysis, programming, and software engineering. Produce high-quality code with good test coverage using modern abstractions and frameworks. May be assigned to specific group focused on product or infrastructure. Work on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrate good judgment in selecting methods and techniques for obtaining solutions. Work independently, use available resources to get unblocked, and complete tasks on schedule by exercising strong judgment and problem solving skills. Master internal development standards from developing to releasing code in order to take on tasks and projects with increasing levels of complexity. Modify existing advertiser growth products, such as Ad4Ad and Coupons, and build new features to drive the growth of small business advertisers on Facebook and our other platforms. Analyze the results of these changes and use this data to identify future iterations on our products. Participate in the support of the team’s portfolio of products by applying best practices to alert response, mitigation, and follow ups.", "company": "meta", "url": "https://www.metacareers.com/jobs/862199259146514"}