{"title": "Client Partner, Apps and Games", "level": "", "location": "Hong Kong", "description": "The Client Partner will build deeply integrated business partnerships with some of our largest and most complex gaming and apps IAA（In apps ads) advertisers. With a proven understanding of performance media, combined with a detailed understanding of your clients business, the ideal candidate will execute strategic plans to fuel long-term growth. Success in this position requires strong consultative sales and analytical skills, a focus on client service, and the ability to thrive in a dynamic, team-focused environment delivering against tight deadlines. This position is based in our Hong Kong office, Meta.", "salary": "", "key_qualifications": "5+ years of experience working in sales, digital media and/or gaming. Excellent communication and presentation skills at all levels of an organization. Strong analytical skills with the ability to tell a powerful story using data. Ability to structure, negotiate, and maintain significant and complex strategic relationships (familiarity with advertising terms & conditions preferable). Ability to thrive in a dynamic, quickly-changing environment. Travel is required. Fluency in English and Mandarin are required as this role will collaborate with external stakeholders whose usual business language is English and Mandarin.", "preferred_qualifications": "Gaming industry experience", "responsibilities": "Strengthen senior-level relationships with a focus on driving revenue, advertiser education and advertiser satisfaction. Set the strategy, accurately forecast and deliver impact across your portfolio of mobile gaming market leaders. Drive operational excellence in managing your book of business. Communicate clearly the progress of monthly/quarterly initiatives to internal and external stakeholders, including the ability to synthesize feedback and adjust plans accordingly. Anticipate industry, consumer, and partner-specific trends in order to influence Facebook’s future business strategies. Activate cross-functional teams internally to meet your clients business objectives. Lead initiatives that scale beyond your direct team to support other verticals and regions globally.", "company": "meta", "url": "https://www.metacareers.com/jobs/868626448407643"}