{"title": "Account Manager, Mid-Market", "level": "", "location": "Bangalore, India, Gurgaon, India, Mumbai, India", "description": "Are you passionate about digital marketing and driven to help businesses succeed? By joining Meta as an Account Manager, you will champion and monetize Meta's advertising solutions by engaging with clients and their agencies across India.\nThe Mid-Market team is dedicated to empowering young and growing businesses across Facebook, Instagram, Messenger, and WhatsApp, helping them achieve remarkable growth through our advertising solutions. You will be at the forefront of driving sales, collaborating and consulting directly with growth accounts to provide unparalleled support and guidance.", "salary": "", "key_qualifications": "Bachelor’s degree; Must possess a minimum of 4 years of experience in account management, brand/performance marketing, digital marketing, sales, or consulting.; Ability to effectively prioritize and manage tasks within a fast-paced environment while maintaining strict attention to detail.; Strong communication and presentation skills.; Structured problem solving and quantitative analytical skills; Ability to influence C-level executives, build effective and impactful relationships.", "preferred_qualifications": "", "responsibilities": "Become an expert in Meta solutions. Establish yourself as a trusted advisor, consulting businesses of all sizes.; Strategically align clients' key performance indicators (KPIs) with Meta solutions to unlock incremental value and achieve exceptional results.; Review campaign performance, meticulously analyze data trends, and craft strategic marketing recommendations.; Develop precise sales plans and flawlessly execute them to achieve assigned quarterly quotas.; Collaborate seamlessly cross-functionally, adeptly handling escalations and troubleshooting to swiftly resolve any issues that may arise.; Exhibit proficiency in all aspects of your portfolio.", "company": "meta", "url": "https://www.metacareers.com/jobs/869486261864680"}