{"title": "Director, RL Global Sales Experiences", "level": "", "location": "Seattle, WA | Burlingame, CA", "description": "Meta is a cutting-edge technology company focused on connecting people, enabling meaningful interactions, and building communities. Our diverse portfolio includes innovative products and platforms that shape the future of communication, collaboration, and connectivity.\n\nAs the leader of Global Sales Experiences, you'll spearhead the creation and implementation of exceptional customer and partner experiences across all touch points, seamlessly integrating our online and offline presence. Your expertise will shape comprehensive channel/trade marketing strategies that boost our brand, captivate a global audience, and drive growth through various channels and touch points. Additionally, you'll empower employees to deliver exceptional partner experiences and foster strategic executive relationships to expand our reach. As a key member of the RL Global Sales Leadership Team, you'll play a vital role in shaping and achieving our overall sales strategy and will be responsible for five main areas: channel strategy and development, content creation and campaign management, audience segmentation and targeting, partnership and relationship management, and performance measurement and reporting.", "salary": "US$296,000/year to US$356,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Marketing, Business, or related field. Proven experience in marketing management with a focus on global channel strategies and driving business growth. Demonstrated understanding of digital marketing trends, physical retail, and emerging technologies. Clear communication and leadership skills with cross-team collaboration experience. Data-driven mindset with analytics tool proficiency and experience informing strategic decisions. Experience adapting to a fast-paced technology landscape and drive innovation. Proven track record of developing and implementing successful omni-channel strategies that drive business growth and customer loyalty. Demonstrated understanding of customer behavior and preferences, informing strategic decisions and driving customer-centricity.", "preferred_qualifications": "Master's degree in Marketing, Business, or related field", "responsibilities": "Develop and execute a visionary, world class, omni-channel customer experience strategy that aligns with our brand's vision and values which drives business growth and customer loyalty. Develop a global channel marketing strategy that Encompasses Merchandising, Field Sales, Field Merch, Demo Tech, Sales Enablement, Executive Engagement and Digital Channel Experiences and aligns with Meta and Reality Lab's overall sales & marketing goals. Identify and prioritize key sales channels for audience engagement, considering Regional nuances and market trends. Collaborate with cross-functional teams to create, world-class integrated channel experiences across multiple customer touch points. Stay up-to-date with Industry trends and emerging technologies. Continuously innovate and enhance the customer experience. Spearhead the development of targeted marketing content that drives engagement and conversion across multiple sales channels and audience segments. Lead the strategic planning, execution, and optimization of integrated channel/trade marketing campaigns that align with business objectives and maximize ROI. Ensure consistent brand messaging and identity across all touchpoints to build recognition and trust. Create high-impact content that resonates with diverse audiences and drives business outcomes. Empower field teams to deliver exceptional customer experiences through customized training programs that enhance skills and knowledge. Collaborate with data analytics teams to identify and refine target audience segments. Analyze customer behavior across the customer journey to inform the development of seamless omni-channel experiences. Execute targeted marketing campaigns to reach specific demographics and personas. Leverage data-driven insights to optimize channel performance, enhance user experiences, and drive business growth. Forge and nurture high-impact partnerships with key global channel partners, influencers, and affiliates across multiple teams to drive business growth and customer engagement. Collaborate with internal teams and external stakeholders to develop and execute aligned channel/trade marketing strategies that maximize ROI and customer value. Leverage partnerships to expand Meta's reach and presence across channels, enhance brand reputation, and create new business opportunities. Ensure strategic alignment with leadership to secure buy-in and support for customer experience initiatives that drive business outcomes. Design and deliver tailored executive-level engagement experiences that foster strong relationships, build trust, and drive mutual long term value with key partners and stakeholders. Develop and implement employee training programs that equip teams with the skills and knowledge needed to deliver exceptional customer experiences that drive loyalty, retention, and growth. Fostering a culture of continuous improvement and customer-centric innovation. Encouraging data-driven decisions that benefit both customers and the business. Develop and monitor key performance indicators (KPIs) to evaluate the impact of channel experiences across multiple teams. Provide actionable insights and recommendations to leadership, highlighting opportunities for growth and improvement. Implement data-driven optimization strategies, including A/B testing, to enhance campaign performance and drive business outcomes.", "company": "meta", "url": "https://www.metacareers.com/jobs/872443408024482"}