{"title": "Product Design Manager", "level": "", "location": "Sunnyvale, CA", "description": "The ideal candidate will have a background and hands-on experience in mechanical engineering/product design and complex system design. This leader will be in charge of building up a multi-disciplinary team of engineers and define and implement a workflow for the development of the next generation of custom wearable systems.\n\nYou will be responsible for the intake of requirements from researchers, engineers, and product managers, you’ll manage program schedules, identify risks and associated mitigation plans, and clearly communicate to program stakeholders. Communication and technical aptitude are critical in this role as you will be the liaison between researchers, mechanical, electrical, and software engineers and you will assist with determining project priorities and feasibility.\n\nAs an expert in your engineering field, you will be in charge of supervising the ME design and architecture of our custom systems. This is a complex and operationally challenging role that will afford the opportunity to lead the development of technologies that have the potential to change the way humans communicate and interact regardless of distance.", "salary": "US$204,000/year to US$281,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor’s degree in Mechanical Engineering or equivalent experience; 7+ years of experience as a hardware leader working across one or more of the following areas: mechanical, electrical systems and software; Experience with cameras, displays, batteries, and other sensors; Demonstrated domain knowledge in compute & systems development, proven track record in building technology & product development; Experience with 3D design modeling and physical prototyping; Experience leading and driving mechanical design from concept, through design for manufacture, assembly, and test", "preferred_qualifications": "Direct experience shipping consumer hardware; Experience with 3D design modeling and physical prototyping; Experience integrating RF technologies such as WIFI, BT, GPS, etc.; Experience in working with JDM partners in the design, manufacture, testing and delivery of next generation hardware solutions", "responsibilities": "Inspire and lead the mechanical engineering efforts; Mentor a team of mechanical engineers and other engineering managers; Collaborate with key partners (Research, Engineering, Leadership, Operations, Legal, Facilities, etc.) to support new and ongoing projects; Manage project meetings, schedules, milestones and delivery; Design, simulate, prototype, and test complex systems which combine electronics, mechanical parts, optics and software; Provide individual technical contributions in your area of expertise where needed; Effectively influence leaders and key partners to gain alignment", "company": "meta", "url": "https://www.metacareers.com/jobs/878557657650824"}