{"title": "Software Engineer, Product", "level": "", "location": "Tel Aviv, Israel", "description": "We are the teams who create all of Meta's products used by billions of people around the world. Want to build new features and improve existing products like Messenger, Video, Groups, News Feed, Search and more? Want to solve unique, large scale, highly complex technical problems? Meta is seeking experienced full-stack Software Engineers to join our product teams. You can help build products that help us connect the next billion people, create new features that have billions of interactions per day and be a part of a team that’s working to help people connect with each other around the globe. Join us!", "salary": "", "key_qualifications": "Programming experience in a relevant language. Experience building large-scale applications or similar experience. Experience identifying, designing and completing medium to large features independently without guidance. Experience with scripting languages such as Python, Javascript or Hack. Experience building and shipping high quality work and achieving high reliability. Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, a relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.", "preferred_qualifications": "Exposure to architectural patterns of large scale software applications. Experience in programming languages such as C, C++, Java, Swift, Kotlin.", "responsibilities": "Full stack web/mobile application development with a variety of coding languages. Create consumer products and features using internal programming language Hack. Implement web or mobile interfaces using XHTML, CSS, and JavaScript. Work closely with our PM and design teams to define feature specifications and build the next generation of products leveraging frameworks such as React & React Native. Work closely with operations and infrastructure to build and scale back-end services. Build report interfaces and data feeds. Complete medium to large features (each with many tasks) independently without guidance. Proactively identify and drive changes as needed for assigned codebase, product area and/or systems.", "company": "meta", "url": "https://www.metacareers.com/jobs/878832303853520"}