{"title": "Embedded Software Engineer, BSP/Kernel - Reality Labs", "level": "", "location": "Taipei, Taiwan", "description": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.\n\nAs an Embedded Software Engineer on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.", "salary": "", "key_qualifications": "Bachelor's or Master's Degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.\n5+ years' Software Engineering experience in the following: device driver development, embedded systems, or operating systems.\n5+ years’ experience working on systems software in a large-scale C/C++ code base.\n2+ years’ experience defining and driving technical work streams and providing technical leadership for software engineering teams.\nExperience with Software Development processes including: source control, bug tracking, and design documentation.\nExperience in hardware bring up using interfaces like ADC, GPIO, SPI, I2C, etc.\nExperience in one or more of the following areas: BSP/Board Support Package, Operating Systems, Android OS, RTOS, Bootloader, Power Management, Linux, Graphics and Display Drivers, MCU (Microcontroller).\nExperience developing, debugging, and shipping software products on large code bases that span platforms and tools.", "preferred_qualifications": "Deep specialized experience in two or more of the following areas: BSP/Board Support Package, Operating Systems, CoreOS, Kernel, Android Kernel, Bootloader, Power Management, Linux, Graphics and Display Drivers, MCU (Microcontroller).\nDemonstrated experience working collaboratively in cross-functional teams.\nStrong experiences working on Qualcomm SoC solutions.", "responsibilities": "Design and implement components at all layers of the system, e.g. kernel, synchronization primitives, resource allocators, memory management, security, I/O systems, persistence, etc.\nDesign and implement drivers and services that operate efficiently in a constrained environment yet when pressed can efficiently deliver large volumes of data with low-latency and high-bandwidth.\nOwn the definition of one or more work streams focused on hardware bring up, peripheral drivers and communication, silicon integration and power and performance management and optimization.\nDebug complex, system-level, multi-component issues that typically span across multiple layers from kernel to application.\nProfile performance problems and drive optimizations that span the entire software stack.\nBring up new devices and lead debugging and performance tuning exercises that span multiple hardware/firmware/software teams.\nUnderstand software components from multiple partner teams, lead the integration of those components into the unified product code base, and drive their continued development.", "company": "meta", "url": "https://www.metacareers.com/jobs/882093907270990"}