{"title": "Fiber Delivery Engineer, Implementation", "level": "", "location": "Denver, CO | Menlo Park, CA", "description": "The Fiber Delivery Engineer is responsible for overall implementation, Deployment and Technical Delivery of Greenfield & Brownfield fiber deployments and leased IRUs into the Meta production environment. Activities will include project managing the day to day activity of network development projects in North America, managing partners/contractors to deliverables, identifying and mitigating project risks and developing and managing project budgets ensuring on-time delivery of network to the business. In this role, you will collaborate with Network Development, Network Planning, Edge Network Deployment, Legal, Finance and other internal stakeholders.", "salary": "US$132,000/year to US$190,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 2+ years of fiber delivery, service delivery or project management experience with a focus on Telecom. Detailed understanding of the life cycle of fiber deployment, including planning, delivery, and performance. Understanding of key telco milestones for delivery of dark fiber routes. Negotiation skills and experience to problem solve. MS Suite proficiency, with experience using spreadsheet tools and/or programs. Experience preparing and presenting quantitative and qualitative comparative analysis and reports. Detail oriented with experience managing multiple cross-functional tasks and projects.", "preferred_qualifications": "Technical delivery and acceptance from vendors of fiber specs, interpretation of OTDR traces, and fiber handover packages. 2+ years of project management experience with a focus on Telecom and/or utility construction preferred. Experience with the procurement of new route construction services and materials. Telecom outside and/or inside plant experience. Knowledge of capital budget management. (ie-project forecasting, management of accruals)", "responsibilities": "Management of the technical delivery and acceptance of Dark Fiber handover packages from vendors including fiber specs, test results, interpretation of OTDR traces, and other technical data as required. Manage new projects including full E2E requirements supporting MPR Development in accordance with Meta Standards. Collaborate across cross-functional teams to synchronize fiber deployment handoff schedules. Collaborate with Network Investment Managers ensuring key technical requirements are included in the contracts. Mitigate risk for the project through pre-planning, innovative planning, and partnership. Communicate upward of projects risks to both timeline and budget. Coordinate and manage build partners, engineering and construction firms and associated project budget/s. Mine and handle data with different tooling creating correlations ensuring clean data sources. Collaborate with Sourcing & Net/Dev on new Project Opportunities, potential partner / vendor identification, buildability & High Level Project Budget. Work closely with finance to develop business plans, budgets, and forecasts. Ability and willingness to travel up to 30% of the time within North America.", "company": "meta", "url": "https://www.metacareers.com/jobs/883337726934859"}