{"title": "Account Manager, Mid Market (Mexico)", "level": "", "location": "Buenos Aires, Argentina", "description": "The Mid Market team contributes directly to this mission by connecting every small and medium businesses in the world with their customers on Meta (formerly the Facebook company) , and then helping them grow through solutions like pages, advertising, and offers. We succeed when we help our customers grow their business. This position will be challenged with having to balance the day-to-day service/support of our scaled customers, while also identifying innovative ways to solve problems. Ideal candidates will have an appetite for scaled operations, comfort working directly with customers, and a strong analytical mindset. This position will be based in our Buenos Aires office.", "salary": "", "key_qualifications": "BA or BS degree or equivalent experience; Communication skills (both written and verbal) and comfortable in engaging communication on any level; 3+ years experience on media sales and/or client support experience - agency, online advertising, marketing or related experience.; Ability to think high-level about product strategy and vision; Passionate about ensuring world-class customer service and delighting clients; Fluent English", "preferred_qualifications": "Prior experience with data or product analysis or similar technical role", "responsibilities": "Support our advertising customers by several channels such as - phone, in person meetings and video conferences and deliver consultative support and education on our Meta products; Support our clients in managing their strategy and needs; Perform data analysis and execute data-informed initiatives that will improve our customer experience and drive business growth; Support and lead strategic programs to grow our business through reactive and proactive service initiatives; Identify trends and develop solutions to optimize team workflows and scale our operations; Work cross-functionally with sales, marketing and product teams within Meta", "company": "meta", "url": "https://www.metacareers.com/jobs/883534383822750"}