{"title": "Financial Accountant", "level": "Permanent full-time", "location": "Dublin, Ireland", "description": "Meta is seeking a Financial Accountant (Permanent full-time position) to join the International Statutory Controllership team in Dublin. This position will be as a Statutory Controller for a portfolio of EMEA legal entities. In addition, the person will also deepen their expertise and become the Meta Statutory expert for some complex areas that impact our International financial statements.  This is a great role for anyone looking to join a team that strives to be the best in class by continuously learning, improving, and delivering to keep Meta compliant.   The successful candidate must be a driven, high energy, detail-oriented individual that can work well with internal and external stakeholders at all levels. They will be expected to problem solve, recommend solutions and exercise good business judgment while performing their function.", "salary": "", "key_qualifications": "Recognised accounting qualification (ACA, CIMA, ACCA, ICAS). Solid knowledge of US GAAP, IFRS and local GAAPs is desirable. Strong computer and analytical skills, including proficiency in Excel. Excellent planning, analytical, interpersonal and communication skills. Excellent team player who is very comfortable working as part of a larger team located in different locations. Proactive and with an appetite to take on new challenges and additional responsibilities.", "preferred_qualifications": "Relevant recent industry experience with large, fast-growing, multi-national company preferred, but not required. Organised and thorough with desire for continuous improvement. Demonstrated career progression and interest in professional development.", "responsibilities": "Managing a portfolio of EMEA entities from a local compliance reporting point of view. Manage processes and stakeholders for the preparation of Statutory Financial Statements. Oversee entity compliance completed by local and international outsourced partners. Lead complex projects requiring specialist technical knowledge. Support processes for the preparation of Corporation tax returns. Assist with the preparation and co-ordination of Statutory Audits. Support the Finance team in design, testing and roll-out of financial reporting systems/tools/processes. Initiate, lead and manage process improvement projects to build for scale.", "company": "meta", "url": "https://www.metacareers.com/jobs/884511610367214"}