{"title": "Software Engineer, Systems ML - Frameworks / Compilers / Kernels | Ingénieur logiciel, Systèmes ML, cadres/Compilateurs/Noyaux", "level": "", "location": "Toronto, ON", "description": "In this role, you will be a member of the MTIA (Meta Training & Inference Accelerator) Software team and part of the bigger industry-leading PyTorch AI framework organization. MTIA Software Team has been developing a comprehensive AI Compiler strategy that delivers a highly flexible platform to train & serve new DL/ML model architectures, combined with auto-tuned high performance for production environments across specialized hardware architectures. The compiler stack, DL graph optimizations, and kernel authoring for specific hardware, directly impacts performance and deployment velocity of both AI training and inference platforms at Meta.\n\nYou will be working on one of the core areas such as PyTorch framework components, AI compiler and runtime, high-performance kernels and tooling to accelerate machine learning workloads on the current & next generation of MTIA AI hardware platforms. You will work closely with AI researchers to analyze deep learning models and lower them efficiently on MTIA hardware. You will also partner with hardware design teams to develop compiler optimizations for high performance. You will apply software development best practices to design features, optimization, and performance tuning techniques. You will gain valuable experience in developing machine learning compiler frameworks and will help in driving next generation hardware software codesign for AI domain specific problems.\n\n-------\n\nDans ce rôle, vous serez membre de l'équipe logicielle MTIA et ferez partie de la plus grande organisation du cadre d'IA PyTorch, à la pointe de l'industrie. L'équipe logicielle de MTIA a développé une stratégie complète de compilateur d'IA qui offre une plateforme très flexible pour former et fournir de nouvelles architectures de modèles DL/ML, combinée à des performances élevées autorégulées pour les environnements de production sur des architectures matérielles spécialisées. La pile de compilateurs, les optimisations de graphes DL et la création de noyaux pour un matériel spécifique ont un impact direct sur les performances et la vitesse de développement des plates-formes d'apprentissage et d'inférence d'IA chez Meta.\n\nVous travaillerez sur l'un des domaines clés tels que les composants du cadre PyTorch, le compilateur et le moteur d'exécution de l'IA, les noyaux de haute performance et l'outillage pour améliorer les charges de travail d'apprentissage automatique sur les plates-formes matérielles d'IA actuelles et de la prochaine génération de MTIA. Vous travaillerez en étroite collaboration avec les chercheurs en IA pour analyser les modèles d'apprentissage profond et les réduire efficacement sur le matériel MTIA. Vous vous associerez également aux équipes de conception de matériel pour développer des optimisations de compilateurs pour obtenir des performances élevées. Vous appliquerez les meilleures pratiques de développement logiciel pour concevoir des fonctionnalités, des techniques d'optimisation et de réglage des performances. Vous bénéficierez d'une expérience précieuse dans le développement de compilateurs d'apprentissage automatique et contribuerez à la conception de logiciels matériels de nouvelle génération pour les problèmes spécifiques du domaine d'IA.", "salary": "CA$133,000/year to CA$176,000/year + bonus + equity + benefits", "key_qualifications": "Proven C/C++ programming skills  | Compétences avérées en programmation C/C++. Experience in AI framework development or accelerating deep learning models on hardware architectures. | Expérience dans le développement des cadres d'IA ou dans l'amélioration des modèles d'apprentissage profond sur des architectures matérielles. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. | Licence en informatique, en génie informatique, dans un domaine technique pertinent, ou expérience pratique équivalente.", "preferred_qualifications": "A Bachelor's degree in Computer Science, Computer Engineering, relevant technical field and 7+ years of experience in AI framework development or accelerating deep learning models on hardware architectures OR a Master's degree in Computer Science, Computer Engineering, relevant technical field and 4+ years of experience in AI framework development or accelerating deep learning models on hardware architectures OR a PhD in Computer Science Computer Engineering, or relevant technical field and 3+ years of experience in AI framework development or accelerating deep learning models on hardware architectures. | Un baccalauréat en informatique, en ingénierie informatique ou dans un domaine technique pertinent et plus de sept ans d'expérience dans le développement de cadres d'IA ou l'amélioration des modèles d'apprentissage profond sur des architectures matérielles OU une maîtrise en informatique, en ingénierie informatique ou dans un domaine technique pertinent et plus de quatre ans d'expérience dans le développement de cadres d'IA ou l'amélioration des modèles d'apprentissage profond sur des architectures matérielles OU un doctorat en informatique, en ingénierie informatique ou dans un domaine technique pertinent et plus de trois ans d'expérience dans le développement de cadres d'IA ou l'amélioration des modèles d'apprentissage profond sur des architectures matérielles.", "responsibilities": "Development of SW stack with one of the following core focus areas: AI frameworks, compiler stack, high performance kernel development and acceleration onto next generation of hardware architectures. | Développement d'une pile de logiciels dans l'un des domaines fondamentaux suivants : Cadre d'IA, pile de compilateurs, développement de noyaux à haute performance et intégration dans les architectures matérielles de la prochaine génération. Contribute to the development of the industry-leading PyTorch AI framework core compilers to support new state of the art inference and training AI hardware accelerators and optimize their performance. | Contribuer au développement des compilateurs de base du cadre d'IA PyTorch, leader sur le marché, afin de prendre en charge les nouveaux intégrateurs matériels d'IA de pointe en matière d'inférence, d'entraînement et d'optimiser leurs performances. Analyze deep learning networks, develop & implement compiler optimization algorithms. | Analyse des réseaux d'apprentissage profond, développement et mise en œuvre d'algorithmes d'optimisation des compilateurs. Collaborating with AI research scientists to accelerate the next generation of deep learning models such as Recommendation systems, Generative AI, Computer vision, NLP etc. | Collaborer avec des chercheurs en IA pour améliorer la prochaine génération de modèles d'apprentissage profond tels que les systèmes de recommandation, l'IA générative, la vision par ordinateur, le traitement automatique des langues, etc. Performance tuning and optimizations of deep learning framework & software components. | Optimisation des performances du cadre d'apprentissage profond et des composants logiciels.", "company": "meta", "url": "https://www.metacareers.com/jobs/887514822839013"}