{"title": "Channel Performance Manager", "level": "", "location": "Menlo Park, CA", "description": "The Business Marketing Group connects businesses with their customers on Facebook, Instagram, WhatsApp, and Messenger to help them grow their businesses through solutions like pages, advertising, messaging, and more. We succeed when we help our customers grow their business leveraging our solutions. The Global Marketing Channels team is responsible for the performance and scalability of our digital marketing channels including web, email, in-product messaging, SEM/SEO, display and Meta ads to provide value for our customers and enable business impact. We focus on developing and executing strategies that make our marketing channels impact levers for the business.\n\nWe are searching for a Channel Performance Manager to play a pivotal role in elevating our cross-channel marketing impact. This individual will be responsible for analyzing and optimizing our digital marketing channels to improve channel effectiveness across our portfolio.\n\nThe ideal candidate is passionate about performance marketing, the customer experience, and driving measurable results at a large scale. As an expert in digital marketing optimization, this individual will be shaping our global approach and the scaled impact of our digital marketing presence. The ideal candidate is an analytically-driven marketer with strong communication skills and business acumen.", "salary": "US$122,000/year to US$176,000/year + bonus + equity + benefits", "key_qualifications": "7+ years of digital marketing, performance marketing or growth marketing experience; Experience in leveraging multiple digital marketing channels (web, email, Meta ads, search, display, etc.) to drive results in a B2B or performance marketing capacity; Experience in developing and executing A/B tests and marketing measurement analyses with clear, actionable interpretation of insights; Experience optimizing digital marketing channels to deliver business results; Cross functional experience with marketing and data science teams to plan and deliver channel strategy", "preferred_qualifications": "Experience optimizing multiple digital marketing channels; Experience with marketing technology platforms such as Salesforce Marketing Cloud; Experience with experimental design and statistical methodologies for optimizing, analyzing, and measuring marketing impact; Project management experience leading and managing multiple projects at the same time; Bachelor's degree or equivalent work experience in digital marketing", "responsibilities": "Optimize the joint effectiveness of our digital marketing channels across the funnel and user journey, through A/B testing, causal experimentation, and opportunity analyses; Work cross functionally with marketing, data science, and engineering to identify, drive and measure performance improvements across marketing channels; Develop and drive strategy for how to increase channel impact contribution; Leverage acumen of digital marketing channels to maximize cross-channel effectiveness to improve marketing campaign performance; Develop learning agendas for continuous measurement and optimization of our channel effectiveness.", "company": "meta", "url": "https://www.metacareers.com/jobs/887512839874588"}