{"title": "Software Engineer", "level": "", "location": "Redmond, WA", "description": "Reality Labs Research (RL-R) brings together a diverse and highly interdisciplinary team of researchers and engineers to create the future of augmented and virtual reality.\n\nOur team aims to define the worldwide standard for extended reality (XR) interaction with unparalleled software that accelerates research and creates novel capabilities.\n\nThis requires a passion for accelerating researchers building models in Human Computer Interaction (HCI) research. In our collaborative environment, you’ll partner with expert research scientists, hardware engineers, and software developers to build groundbreaking wristbands. You will tackle interesting technical challenges in AI to revolutionize how people interact with computing devices. Step into the adventure of a lifetime as we make science fiction real and change the world!\n\nWe are looking for a software engineer who can contribute in a flexible role able to work in multiple areas of AR/VR research, from infra to ML to experience development.  You’ll partner with firmware, software and research engineers to ensure seamless integration across hardware, firmware and software components.\n\nUltimately, you’ll foster scientific explorations and generate viable paths to the consumer products that will connect people in meaningful ways for decades to come. Together, let’s step into the adventure of a lifetime as we make science fiction real and change the world.", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.\n2+ years work experience in a role coding in Python, PHP, Java, C/C++ (or equivalent language) including code maintenance and review.\nExperience with one of the following:  Game engine development, AR/VR development, mobile app development, driver, firmware/OS development, or robotics", "preferred_qualifications": "Driver, firmware, OS or embedded systems development\nHardware bring-up, hardware prototyping, and interfacing with new hardware SDKs\nGame engines such as Unreal or Unity\nMobile software experience (OS and App level)\nDeveloping AR/VR applications\nCamera and sensor technologies\nAI research or development", "responsibilities": "Analyze, evaluate, design, develop, integrate, debug and test real-time AR and VR software for advanced prototypes and user experiences\nBuild software, tools, infrastructure, documentation and other systems that enable research scientists to be more effective and efficient\nCollaborate in a team environment across multiple scientific and engineering disciplines, making the architectural tradeoffs required to rapidly deliver software solutions\nPerform code reviews that improve software engineering quality\nWrite clean readable code, debug complex problems that span systems, prioritize ruthlessly and get things done with a high level of efficiency\nLearn constantly, dive into new areas with unfamiliar technologies, and embrace the ambiguity of AR/VR problem solving", "company": "meta", "url": "https://www.metacareers.com/jobs/892147939597129"}