{"title": "Partner Engineer, Gen AI", "level": "", "location": "Menlo Park, CA", "description": "Meta is seeking a Partner Engineer to join Meta’s Applied AI Partner Engineering team, a highly technical team that works with strategic partners, machine learning leaders across the industry and all major cloud service providers for building and launching new Generative AI product services and experience and taking Large Language Models (LLMs) from research to production. In this role, you will engage with some of the world's most influential companies and work closely with our Llama engineering and AI research teams. The ideal candidate will have industry experience working with PyTorch on a range of deep learning, machine learning, natural language processing, large language models, generative AI, conversational AI, reinforcement learning (RLHF) problems. You will also represent Meta at developer conferences and events. You will be required to develop technical accelerators, case studies, white papers, blogs, reference architectures, and/or presentations to evangelize Meta’s AI design patterns and best practices.", "salary": "US$111,000/year to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 2+ years experience as software engineer, technical consultant or partner/sales engineer. 2+ years of experience in one or more of the following areas: Deep Learning, LLMs, NLP, Speech, Conversational AI,AI-Infrastructure, Fine-tuning and optimizations of PyTorch models. Software development experience in languages like Python, Java, Go, Rust, C/C++. (at least one)", "preferred_qualifications": "BS, MS or Ph.D. degree in Computer Science or related quantitative field. Solid understanding of at least one Deep Learning framework (PyTorch, Tensorflow or MXNet). Experience building Deep Learning - Computer Vision or Natural Language Processing or Recommender Systems models using the frameworks. Apply relevant AI and machine learning techniques to build. Experience influencing and building mindshare convincingly with any audience. Experience working with internal and external partners. Data science background and experience manipulating/transforming data, model selection, model training, model optimization and deployment at scale. Experience deploying production-grade machine learning solutions on public cloud platforms (like AWS). (Nice to have) Experience of launching a product / service or application into market is a plus. (Nice to have) Knowledge of Mobile/IoT for deploying ML models at the edge is a plus. (Nice to have) Contributed to an Open Source project, submitted PRs for features/ fixed bugs and/or created sample applications in OSS or participated in Kaggle competitions.", "responsibilities": "Apply relevant AI and machine learning techniques to build and launch generative AI solutions using Meta’s Llama and other state of the art LLMs. Understand Meta’s AI/Llama frameworks and products and their underlying implementation. Define and execute on a strategy to drive adoption of Llama and other Meta’s AI/ML platform offerings. Work closely with cloud providers (like Azure, AWS, GCP) and Meta’s strategic partners on deep learning & LLM integrations. Be a subject matter technical expert, and have strategic influence on partners and internal teams at Meta. Provide thought leadership, evangelize Meta’s AI and Gen AI services and share best practices through forums such as medium blogs, whitepapers, reference architectures and public-speaking events. Develop reference architectures, samples and other materials to share with the broader Meta developer community. Work with key partners and LLM developer community to optimize existing generative AI models for improved performance, scalability, and efficiency. Leads technical strategy and roadmap for long-term strategic partners with high level of autonomy / Able to own and navigate long term technical relationship with partners. Effectively plan, lead and execute on projects with minimal direction & oversight from leadership. Proactively communicate feedback, updates, status to direct team as well as relevant cross-functional teams. Write clear and concise documentation, including technical specifications, best practices guides, and presentations, to communicate complex AI concepts to both technical and non-technical stakeholders internally and externally.", "company": "meta", "url": "https://www.metacareers.com/jobs/894410812441528"}