{"title": "Metaverse Content, Partner Engineer", "level": "", "location": "Los Angeles, CA", "description": "Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n\nPartner Engineering is a highly technical team that helps create and accelerate new Content Ecosystems on Meta Quest devices. This role in PE is an opportunity to build the future of the Metaverse by working with strategic partners, including developers, creators, and the world’s most influential companies. The goal for the Reality Labs(RL) Content team is to accelerate the adoption of Meta’s Virtual Reality (VR) and Augmented Reality (AR) products by building and deploying solutions that help scale the Metaverse Content ecosystem.", "salary": "US$136,000/year to US$203,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 5+ years professional experience as an engineer or in a technical game design role Knowledge of Android development and usage various SDKs, Frameworks and libraries (e.g. Kotlin, Jetpack Compose) Software development experience in languages and environments such as Java, NDK(C++) Experience working on real-time gameplay mechanics or games systems Experience shipping products requiring stringent runtime performance practices, such as complex mobile or 3D applications or games Proven communication and collaboration skills", "preferred_qualifications": "Involved in developing immersive VR games or experiences Shipped at least one game using Unity, Unreal, or other leading game engine Knowledge of modern GPU pipelines and 3D rendering architectures Master's degree in Computer Science, Mathematics, or related field", "responsibilities": "Be a subject matter expert in various parts of the AR/VR infrastructure stack. Utilize this expertise in scoping, designing, and building new solutions. Collaborate with external partners, internal Engineering and Product partners within Meta teams. Identify and surface insights using metrics on product usage to increase adoption and provide new solutions that address the needs of our partners. Troubleshoot technical issues encountered by our partners in real-time in collaboration with our engineering and product teams. Identify and resolve performance and scalability issues. Work with internal technical teams on resolving those issues. Use a broad range of technical and soft skills to build productive relationships with our partners, and independently resolve complex technical and business needs. Help scale programs by contributing new features, bug fixes, documentation and other educational materials. Mentor and share knowledge with peers, creating a positive atmosphere amongst the team.", "company": "meta", "url": "https://www.metacareers.com/jobs/899620535347987"}