{"title": "Client Partner, Apps & Games, Greater China", "level": "", "location": "Hong Kong", "description": "The Client Partner will build deeply integrated business partnerships with some of our largest and most complex gaming and apps advertisers. With a proven understanding of performance media and detailed understanding of your clients business, the ideal candidate will influence senior client stakeholders to execute strategic plans and fuel long-term growth. Success in this position requires strong consultative sales and analytical skills, a focus on client service, and the ability to thrive in a dynamic and team-focused environment delivering against tight deadlines. This position is based in our Hong Kong office, Meta.", "salary": "", "key_qualifications": "Proven track record of reaching and exceeding sales revenue goals. Demonstrated success as a leader of change, achieving operational excellence by introducing new performance measures, processes and systems. Solid understanding on performance marketing for apps & gaming business, preferably with relevant working experience in the Greater China Region. 5+ years of experience working in sales, digital media and/or gaming. Understanding of user behavior and how technology works and the ability to explain each in ordinary terms. Excellent communication, presentation skills and great team player. Fluency in Mandarin and business fluency in English is essential as the successful candidate will manage accounts and clients whose primary business language is Mandarin and English. Ability to perform well in a highly dynamic and rapidly changing environment. Strong leadership and project management skills.", "preferred_qualifications": "Gaming industry experience", "responsibilities": "Strengthen senior-level relationships with a focus on driving revenue, advertiser education and advertiser satisfaction. Set the strategy, accurately forecast and deliver impact across your portfolio of mobile gaming market leaders. Drive operational excellence in managing your book of business. Communicate clearly the progress of monthly/quarterly initiatives to internal and external stakeholders, including the ability to synthesize feedback and adjust plans accordingly. Anticipate industry, consumer, and partner-specific trends in order to influence Facebook’s future business strategies. Activate cross-functional teams internally to meet your clients business objectives. Lead initiatives that scale beyond your direct team to support other verticals and regions globally.", "company": "meta", "url": "https://www.metacareers.com/jobs/902719638282311"}