{"title": "AR Hardware Product Architect", "level": "", "location": "Sunnyvale, CA | Redmond, WA", "description": "The AR Hardware Product Architect is a technical leadership role responsible for driving innovation and overseeing all aspects of architecture development for AR devices. Working directly under the Head of Hardware, this individual contributor collaborates with cross-functional leaders in electrical engineering, mechanical engineering, display, optics, system architecture, silicon, systems engineering, product management, industrial design, XRTech and computer vision, software, firmware, manufacturing and operations. They must have a proven track record of successfully developing practical product architectures starting with high-level product requirements, demonstrating technical depth, and possessing strong interpersonal and communication skills.", "salary": "US$253,000/year to US$319,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Electrical, Mechanical, or Computer Engineering, or relevant industry experience. 10+ years of experience in hardware product development, with a proven track record of successfully shipping products to market. Experience with multiple full life-cycle product launches. Proven technical expertise in one of the following hardware disciplines: electrical engineering, mechanical engineering, display, optics, and systems engineering. Proven leadership skills, demonstrating the experience to lead cross-functional hardware and technology teams throughout the entire product development cycle. Experience working with Product Development engineers, Product Managers, Researchers and other hardware/software cross-functional teams. Effective communication skills, to articulate complex technical concepts and drive alignment on product requirements and architecture.", "preferred_qualifications": "MS/PhD in Electrical, Mechanical, or Computer Engineering. 15+ years of direct relevant experience. Previous AR, VR, or Wearables product experience. Experience shipping complex products at scale with displays/optics components.", "responsibilities": "Conduct detailed analyses and trade-off studies for complex systems in order to establish a product architecture that is optimized for the product as a whole. Evaluate alternative architecture options from internal and external partners. Engage with technology project leads and various design verticals in creating the overall system architecture as the starting point for product execution. Establish strategic relationships with product peers in engineering, research, business, design, and user research teams to define product requirements and architecture. Perform analyses on product-level requirements to decompose them into concrete design requirements across design verticals (e.g. ME, EE, optics, silicon, thermal, etc.). Communicate technology and product strategy effectively to both internal and external stakeholders. Collaborate effectively across all levels of management and individual contributors both internally and externally. Guide management and partner teams on long term technology investments. Drive business results, optimize overall business objectives, and foster an environment of collaboration and innovation.", "company": "meta", "url": "https://www.metacareers.com/jobs/902838024980711"}