{"title": "Software Engineer, Gameplay - Reality Labs", "level": "", "location": "London, UK", "description": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content. As a Gameplay Engineer on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience; Experience as an engineer building and shipping features within games or 3D interactive products; Experience in writing native C/C++ and/or managed C# code that executes on end user devices (such as VR headsets, cell phones, or game consoles); Familiarity with commercial or proprietary game engines (such as Unity, Unreal, CryEngine, Frostbite)", "preferred_qualifications": "Prior experience in shipping VR, AR or MR games or other interactive applications; Experience in character animation (avatar systems and human representation); Familiarity with developing 3D pipelines and processing models (scenes, textures, materials and animations); Understanding of 3D graphics concepts (meshes, materials, shaders, lighting); Experience in developing shared technology and features that balances the needs of multiple shipping products", "responsibilities": "Design and deliver interactive features for in-VR social presence; Work with product design and technical art to create delightful experiences for our users; Create frameworks, integrations and features that power metaverse for work application portfolio; Write high-quality, performant, and maintainable code; Push the performance envelope (CPU and GPU) to yield the richest experience possible; Collaborate with both technology and application development teams to align and realize mutual goals", "company": "meta", "url": "https://www.metacareers.com/jobs/903808304563239"}