{"title": "Software Engineer, Machine Learning", "level": "", "location": "Sunnyvale, CA", "description": "Meta is embarking on the most transformative change to its business and technology in company history, and our Machine Learning Engineers are at the forefront of this evolution. By leading crucial projects and initiatives that have never been done before, you have an opportunity to help us advance the way people connect around the world. The ideal candidate will have industry experience working on a range of recommendation, classification, and optimization problems. You will bring the ability to own the whole ML life cycle, define projects and drive excellence across teams. You will work alongside the world’s leading engineers and researchers to solve some of the most exciting and massive social data and prediction problems that exist on the web.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "7+ years of experience in software engineering, or a relevant field. 4+ years of experience if you have a PhD. 6+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining, artificial intelligence, or related technical field. Experience with scripting languages such as Python, Javascript or Hack. Experience leading major initiatives successfully. Experience building and shipping high quality work and achieving high reliability. Experience with developing machine learning models at scale from inception to business impact. Knowledge developing and debugging in C/C++ and Java, or experience with scripting languages such as Python, Perl, PHP, and/or shell scripts. Experience demonstrating technical leadership working with teams, owning projects, defining and setting technical direction for projects. Experienced in utilizing data and analysis to explain technical problems and providing detailed feedback and solutions. Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.", "preferred_qualifications": "Masters degree or PhD in Computer Science or a related technical field. Exposure to architectural patterns of large scale software applications. Experience with scripting languages such as Pytorch and TF.", "responsibilities": "Play a critical role in setting the direction and goals for a sizable team, in terms of project impact, ML system design, and ML excellence. Adapt standard machine learning methods to best exploit modern parallel environments (e.g., distributed clusters, multicore SMP, and GPU). Re-evaluate the tradeoffs of already shipped features/ML systems, and you are able to drive large efforts across multiple teams to reduce technical debt, designing from first principles when appropriate. Leading a team from a technical perspective to develop ML best practices and influence engineering culture. Be a go-to person to escalate the most complex online/production performance and evaluation issues, that require an in depth knowledge of how the machine learning system interacts with systems around it. Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules based models. Suggest, collect and synthesize requirements and create effective feature roadmap. Code deliverables in tandem with the engineering team.", "company": "meta", "url": "https://www.metacareers.com/jobs/917648072656133"}