{"title": "Production Systems Engineer, Fleet AI Systems", "level": "", "location": "Bellevue, WA | Menlo Park, CA", "description": "Meta is seeking a Production Systems Engineer to join our Release to Production (RTP) team. Our servers and data centers are the foundation upon which our rapidly scaling infrastructure operates efficiently to deliver our innovative services. The RTP team is responsible for the Hardware Lifecycle of all Meta servers including pre-production hands-on system and hardware debugging and stress testing, enabling production-ready system monitoring, automated provisioning and automated remediation of issues.\n\nRTP Engineers work closely with hardware designers, system manufacturers, component vendors, capacity engineering, production engineering, Facebook services, and data center operations teams to test systems before release to our production data centers, and to track the health and lifecycle of servers in production.", "salary": "US$124,000/year to US$191,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. 2+ years of support in hardware system support. Troubleshooting and analytical experience. Knowledge of server architecture and components. Experience with Linux and scripting. Experience in changing system configurations and measuring change impact. Experience working in a matrix organization. Experience working through full life cycle for computer system products. Experience supporting AI/HPC systems and/or related components at scale. Engineering for different server system/data center products.", "preferred_qualifications": "4+ years experience in Production support at scale (e.g. - 10K storage servers and over 100K HDD). 4+ years experience in full system technologies. Experience in post-production hyperscale post-production environments, solutions.", "responsibilities": "Interface with external vendors and internal hardware, mechanical, power, thermal, manufacturing and software engineers to understand system architecture to develop and execute the test suites for various architectures. Proactively create experiments and tooling to detect and diagnose hardware/firmware/software health issues. Develop test framework for large-scale test automation inside fleet during product development and after mass production. Implement remediations across software and hardware stack according to plan, while keeping a thorough procedural record and data log. Develop and publish updates on resolutions and communicate findings internally. Troubleshoot, diagnose and root cause of system failures and isolate the components/failure scenarios while working with internal & external stakeholders. Develop visibility through data visualization and implement systemic solutions to hardware health issues. Drive necessary discussion with external and internal teams on test specification and methodologies to improve test quality continuously.", "company": "meta", "url": "https://www.metacareers.com/jobs/917961656398096"}