{"title": "Research Engineer", "level": "", "location": "Pittsburgh, PA", "description": "At Meta Reality Labs Research, we aspire to achieve a vision of social presence in VR and AR where people are able to interact with each other across distances in a way that is indistinguishable from in-person interactions. We are looking for exceptional Research Engineers who are excited about innovating upon research prototypes to make them well-engineered systems. You will act as a bridge between world-class researchers and engineers, collaborating together on the innovation necessary to build the foundations of social presence technology. At our lab, you will be exposed to facilities, algorithms, and data that are years ahead of anything else in existence today. We want people who work well across disciplines, are excited about getting research prototypes to really work, and are excited to work in new technology areas.", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. Education or 1+ years experience in one or more of the following fields: Computer Vision, Robotics, Machine Learning, Audio Processing, or Computer Graphics Understanding of computer science fundamentals: algorithms, computer architecture, operating systems, computer networks, and databases 1+ year experience with C++, Python, or other scripting languages Interpersonal experience: cross-group and cross-culture collaboration", "preferred_qualified": "3+ years experience with C++, Python, or other scripting languages 3+ years software development experience in one or more of the following fields: Computer Vision, Robotics, Machine Learning, Audio Processing, or Computer Graphics Experience with designing (products or open-source) software for inertial/optical/acoustic sensing devices Experience in vision-based tracking algorithms and complex multimodal sensor synchronization and geometric calibration Experience in developing an end-to-end ML pipeline that includes data preprocessing, model development, deployment, and optimization, as well as experience integration Experience with deep learning frameworks such as PyTorch Experience in real-time computer graphics and modern GPU programming (OpenGL, Vulkan, CUDA, OpenCL) Experience with code (CPU/GPU) profiling and runtime optimization Publication in leading workshops or conferences such as CVPR, ECCV, ICCV, SIGGRAPH, ICCP, RSS, ICRA, etc Experience with real world data intensive system building and data collection, including design, coding (C++/Python) and evaluation (C++/Python) Experience in database and data management systems at scale Experience in managing and operating computers in Linux environments Experience working independently, handling concurrent projects where timelines may be ambiguous or changing, and prioritizing team roadmap and deliverables by balancing required effort with resulting impact", "responsibilities": "Collaborate with researchers and engineers on design, development, and optimization of cutting-edge technology related to avatars, 3D audio, and 3D environments Work with the team to help design, setup, and run practical experiments and prototype systems related to large-scale long-duration sensing and machine reasoning. Build and operate complex data pipelines at scale such that data can be processed in an efficient and timely manner. Write tools and libraries to support and speed up our research such that technology can be developed and matured faster.", "company": "meta", "url": "https://www.metacareers.com/jobs/918472056186034"}