{"title": "RF Module Engineer", "level": "", "location": "Sunnyvale, CA", "description": "As an RF Module Engineer at Meta Reality Labs, you will develop RF modules/SIP (system in package) for Meta’s Augmented Reality (AR) products. You will work closely with product design, electrical and firmware engineers on advancing the state of AR through research and development, prototyping, and implementation in shipping products. You will own end-to-end RF module design from initial definition through production. You should have deep experience in RF module development, SIP and RF advanced packaging for consumer electronics along with a passion for exploration and experimentation.", "salary": "US$170,000/year to US$240,000/year + bonus + equity + benefits", "key_qualifications": "BSEE or BSc in related engineering discipline, or equivalent experience, 5+ years of relevant industry experience in wireless consumer electronics or similar industries, Experience with advanced packaging technologies and RF module/SIP design, Experience in RF schematic, layout and DFM, Work experience with RF lab equipment for device characterization, debug and component/system performance validation, Experience using circuit, EM, thermal simulation tools such as Ansys HFSS and Keysight ADS/Momentum, Cadence Allegro, Cadence Virtuoso, Ansys Icepak, Flotherm, Experience with developing RF test specifications and conducting RF lab testing with bench equipment (e.g. network analyzers, communication testers, spectrum analyzers, oscilloscope)", "preferred_qualifications": "MS or PhD in EE with emphasis on advanced packaging or RF design, 3+ years of experience in developing RF modules/SIPs, preferably in wireless consumer electronics or similar industries, Experience in RF design and RF advanced packaging technologies, Experience with WiFi, BT, GPS and Cellular RF implementation, Experience in bringing RF modules/SIPs to production, Familiar with regulatory requirements (FCC, CE, etc.)", "responsibilities": "Own end-to-end RF module/SIP development for Meta products from concept to mass production, Responsible for module/SIP technology selection, part selection, vendor evaluation, contract development and perform cost/technology/performance analysis, Develop module architecture, schematic, layout and work with vendors for DFM and manufacturing, Perform simulation (RF circuit simulation, 3D EM Simulation and thermal simulation), factory bring up, lab bench debug, performance tuning and optimization, validation RF modules/SIPs, Design, simulate and validate advanced RF packaging/module/SIP, Collaborate closely with cross-functional teams and vendors to ensure RF performance are met at component, board and system level, Evaluate new advanced packaging technology, including design and validate prototypes, Domestic/international travel to achieve program milestones", "company": "meta", "url": "https://www.metacareers.com/jobs/926458298850941"}