{"title": "Content Manager, Weekend", "level": "", "location": "Sydney, Australia", "description": "Meta’s Product Content Operations (PCO) team is a horizontal function that works across Meta’s products and platforms. Made up of content specialists with technical expertise, PCO works in close partnership with engineering and product teams to deliver the best content experiences at scale. The work is fast-paced and innovative, situated at the intersection of quality content and Meta’s industry-leading ranking and delivery systems.\n\nThe team is looking for content managers to execute across a variety of projects across multiple languages. The main function of a content manager is to aid in surfacing the best content and conversations on Meta platforms. Candidates should have proven editorial judgment, as well as experience managing content teams through every stage of product development, including roadmap formation, iterative testing, and quality control efforts.", "salary": "", "key_qualifications": "5+ years of professional experience in content or social media management or journalism\nCritical thinking/analytical experience\nExperience in presenting and communicating to senior leadership", "preferred_qualifications": "Experience supporting engineering and ranking teams, especially in bringing content expertise to ranking priorities\nExperience working with product teams or programs (or other equivalent fields) from roadmapping through delivery\nExperience with human-assisted Machine Learning\nFluency in a Southeast Asian language is preferred, as this role reviews regional content where usual business language is in a regional language\nSQL and query abilities are a plus", "responsibilities": "Ensure seamless handoff and continuation of projects between weekend and weekday staff, across regional shifts and teams\nIdentify timely and high-value content or content attributes both on- and off-platform across a variety of media types\nManage cross-functional relationships with high flexibility and strong collaboration\nProvide regular progress reports across assignments to team leads and organizational leadership\nDefine and analyze metrics that inform project success\nDraft and edit guidelines that help review content at scale, maintaining commitment to accuracy and consistency\nManage multiple products and priorities while maintaining quality output\nAbility to flex across atypical working hours as needed\nWillingness and proven ability to manage a small contingent workforce as needed\nAbility to analyze data to evaluate performance and make recommendations for improvements or adjustments", "company": "meta", "url": "https://www.metacareers.com/jobs/929404785393563"}