{"title": "Customer Experience Analyst Lead", "level": "", "location": "Sunnyvale, CA", "description": "The Reality Labs Customer Experience (CX) team at Meta is focused on improving customer experiences across the end-to-end customer journey. As the Customer Experience Analyst at Reality Labs, you will be part of a global customer experience practice dedicated to listening and learning from our customers, harnessing the power of customer insights to drive and influence business improvements and bolster customer centric decision-making across the business. You will play a pivotal role in driving customer satisfaction and loyalty by analyzing insights and feedback, identifying areas for improvement, and partnering with cross-functional teams to develop and implement strategies that enhance the overall customer experience. Leveraging your strong background in CX/VoC and expertise in data analysis and storytelling, your passion for customer centricity, you will help shape the future of our customer experience program and contribute to the growth and success of our organization.", "salary": "US$110,000/year to US$158,000/year + bonus + equity + benefits", "key_qualifications": "6+ years of experience in data analytics, including experience in customer feedback or survey analysis, statistical analysis, marketing analytics, data science, or related fields; 3+ years of experience in customer experience or customer insights analytics; Proficiency in crafting compelling stories using multiple sources of data to provide actionable insights tailored to stakeholders’ needs; Experience creating reports, visualizations, and dashboards and communicating results and analyses to technical and non-technical audiences; Experience working with Customer Experience or Voice of Customer metrics (NPS, CSAT, etc.), surveys, and customer feedback; Proven analytical skills working with large datasets and statistical analysis methods. Experience using SQL; Proficiency in data visualization tools (e.g., Tableau, Power BI); Experience with statistical analytics techniques and using R or Python or a similar scripting language/tool for analysis; Demonstrated experience working collaboratively with cross-functional teams; Effective data-led storytelling with the experience conveying complex insights to non-technical stakeholders.", "preferred_qualifications": "Degree in Analytics, Marketing, Business, Statistics, Mathematics, Finance, Computer/Data Science, Engineering, Economics, or related field; Experience working with customer experience platforms (e.g., Medallia, Qualtrics); Background in digital or marketing analytics; Background in ecommerce and direct to consumer business and analytics; Familiarity with consumer electronics or retail business; Knowledge of predictive analytics or ML/AL techniques is a plus; Survey design and CX program management experience is a plus", "responsibilities": "Manage end-to-end analytics, reporting, and partnerships across multiple customer touchpoints including purchase and delivery journeys; Synthesize and analyze customer feedback from multiple sources (e.g., surveys, digital analytics, social media) and channels (e.g., direct to consumer, supply chain) to identify trends, pain points, and areas of improvement; Monitor customer feedback continuously to identify emerging trends and issues, performing deep dive analysis to uncover wins and opportunities; Champion the voice of customers by sharing insights widely and collaborating with relevant business partners to foster customer-centric decision-making; Develop and maintain robust reporting and dashboards to track customer experience metrics and KPIs; Integrate customer feedback data with other transactional, operational, and behavioral data sources to create a comprehensive picture of experience drivers; Advocate for customers and influence corrective actions through periodic and ad-hoc reporting, proactively evangelizing insights among key stakeholders; Collaborate with cross-functional teams to identify root causes of customer issues and develop action plans to remediate and measure effectiveness; Design and implement customer experience improvement initiatives that align with business objectives and priorities; Bring insights and recommendations to the forefront of stakeholders and executives’ mindshare via engaging presentations.", "company": "meta", "url": "https://www.metacareers.com/jobs/930785675216570"}