{"title": "Consumer Marketing Manager, IM APAC", "level": "", "location": "Tokyo, Japan", "description": "Meta is looking for an experienced Marketing professional to join our Consumer Marketing team in APAC. This is a full-time position that sits within the International Marketing org. This role will be responsible for leading the strategic development and execution of marketing initiatives and campaigns that support and build Instagram’s brand and reputation amongst consumers across a variety of channels. The ideal candidate will have extensive experience developing and launching integrated marketing campaigns for consumer facing brands, and a proven track record of strong collaboration. You will be expected to apply analytical rigour, a deep understanding of consumer and culture, and the right mix of brand and product proof-points to deliver effective advertising that exceeds stated goals. This is a highly cross-functional role working in close collaboration with key local and corporate cross-functional teams, including the Product, Policy, Marketing Insights & Analytics, Media, Creator and Business Marketing teams, as well as Creative and Media Agencies. This individual must excel in a fast-paced, entrepreneurial environment and embrace flex between high-level strategic thinking and detail-oriented project management and execution.", "salary": "", "key_qualifications": "8/10+ years of consumer-facing marketing experience at Consumer Tech/Product companies; Strong business acumen and proven strategic, analytical, and creative abilities; Demonstrated experience developing and executing insight-driven integrated marketing campaigns that drove quantitative results at local and/or global levels; Highly collaborative and adept at leading and influencing cross-functional teams effectively, internally as well as at external partners and agencies; Ability to work and thrive in a self-starter, fast-paced dynamic environment; Knowledge of Japanese (Native level proficiency and cultural familiarity)", "preferred_qualifications": "MBA from an accredited university; Experience working internationally on global brands", "responsibilities": "Develop end-to-end strategies and drive execution to achieve consumer marketing goals, with emphasis on driving consumer sentiment and behaviour; Define and manage comprehensive outbound marketing strategy and planning including audience identification, market sizing, media and communications plan, roll-out strategy, and integration with PR; Closely collaborate with cross-functional stakeholders to deliver world-class marketing campaigns and programs that integrate tightly with Creator, Business, & Product Marketing teams; Partner with our Media, Insights and Analytics partners to build framework for testing across the marketing funnel and across channels to drive consumer perception and engagement; Work closely with brand strategy and creative teams to bring strategy to life through quality creative development & deployment.", "company": "meta", "url": "https://www.metacareers.com/jobs/939486594337848"}