{"title": "Marketing Researcher - Public Affairs", "level": "", "location": "Washington, DC | San Francisco, CA", "description": "Help develop outbound marketing campaigns for Public Affairs, communicating Meta’s value and points of view to policy insiders in the US and in global markets. Requires a full-stack partner, with skill collaborating/influencing east-west across multiple teams (Marketing, Comms, DSS, and policy teams).", "salary": "US$160,000/year to US$219,000/year + bonus + equity + benefits", "key_qualifications": "Demonstrated track record of identifying issues and opportunities and using research to develop and drive strategy. Experience directing agencies/vendors to deliver results. Experience with international research. Experience with independently executing full-cycle research from research design to reporting and socialization of results Bachelor’s degree with 6+ years of experience with extensive background in quantitative or qualitative research, including hands-on experience in writing research instruments (e.g., such as discussion guides or survey questionnaires) and analysis (e.g., weighting, data cleaning, regression, cluster/segmentation analysis, content analysis, narrative analysis, thematic analysis). Experience with content creator audience. Experience using primary and secondary research to influence executives and colleagues. Experience with product optimization, brand strategy, creative testing, marketing campaign measurement, or lifecycle research.", "preferred_qualifications": "6+ years relevant experience. Experience with survey programming tool (e.g., Qualtrics or SurveyMonkey).", "responsibilities": "Lead research that addresses core business problems for Meta and our brands and execute innovative quantitative and qualitative research to support the marketing organization, the Family of Apps, and Meta at large. Translate research findings into actionable insights and strategic recommendations that will have an effect on reaching hundreds of millions of people and changing their attitudes. Set campaign strategy and test creative execution Inspire product creation and influence product roadmaps to bring our brand to life. Communicate effectively in order to motivate people to take action in marketing and across the organization. Develop and drive research strategy globally.", "company": "meta", "url": "https://www.metacareers.com/jobs/941505827720635"}