{"title": "GRC Security Program Manager", "level": "", "location": "Bellevue, WA | Menlo Park, CA | Washington, DC | New York, NY", "description": "Meta's Integrity, Security, Support &amp; Operations Global Risk and Compliance (ISSO GRC) serves as the primary hub for risk management and compliance across the company, providing support to Meta and its family of apps. We are creating an operationally effective and highly efficient “service of common concern” for all Integrity, Security, Support, and Operations (ISSO) Governance, Risk, and Compliance (GRC) needs, ensuring Integrity, Security, Support, and Operations continue to meet global regulatory requirements and manage risk.\n\nMeta's ISSO GRC is the central engine driving risk management and compliance at the company, supporting Meta and the family of apps. We’re seeking deeply experienced, integrity and security leadership talent to help enable and safeguard Meta’s products and services which have a truly global scale. ISSO GRC is simultaneously responsible for, (a) enabling the business to achieve its goals at scale and pace; (b) safeguarding the business against real world security risks; and (c) addressing the regulatory scrutiny the business faces. Our goal is to make Meta the premier place to work for governance, risk, compliance, security, and integrity professionals.", "salary": "US$146,000/year to US$203,000/year + bonus + equity + benefits", "key_qualifications": "7+ years of experience in information security, cybersecurity, transparency reporting, integrity, and/or technology risk including one or more domains (e.g., access management, vulnerability management, change management, business continuity, application security, asset management). 5+ years of experience in effectively analyzing data and programs for security risk, compliance, and maturity. 3+ years program management experience in a corporate environment.", "preferred_qualified": "Advanced degree and/or certification. Advanced program management skills including planning, organizing, pre-empting risks/blockers, and communicating with stakeholders to deliver successful programs or projects, while operating with minimal guidance.", "responsibilities": "Collaborate with team members and stakeholders to understand or identify defined work problems and program goals, obtain prioritized deliverables, and discuss program impact. Prioritise program goals, understand and translate other stakeholders’ needs into program goals and prioritised deliverables with minimal assistance, and contribute to decisions on prioritising goals and deliverables. Define the scope of projects and develop, execute, and/or manage project plans for supported program(s). Review key metrics pertaining to a program, monitor potential metric deviations, and define corrective actions for critical deviations. Implement maturity frameworks across multiple programs factoring in emerging regulations and proactive detection of risks. Identify, communicate, and collaborate with relevant stakeholders within one or more teams to drive impact and work toward mutual goals. Establishment of best practices, standardised frameworks and tools across programs and projects. Preparation of the detailed program/project plan along with the “services of common concern.” Establishment of communication modes and cadences with various stakeholders, conducting planned and ad-hoc meetings with various stakeholders to ensure project milestones are on track and to communicate latest status to them, and sharing of meeting minutes and regular updates with various stakeholders. Identification of stakeholders and their roles, keeping them updated on the progress of the project, addressing their concerns, seeking and implementing their feedback. Identification of risks and detailing of mitigation plans to ensure that the projects stays on track, or are brought back on track in the event of delays or blockers. Support business travel on an as needed basis (up to 10%).", "company": "meta", "url": "https://www.metacareers.com/jobs/942171984074863"}