{"title": "Strategic Partnerships Manager, Africa - Telco Ecosystem Partnerships", "level": "", "location": "Johannesburg, South Africa", "description": "Telco Ecosystem Partnerships at Meta is key to our mission to build community and bring the world closer together via connectivity and access. We are looking for a creative thinker & business development leader to grow our partnerships across the Middle East & Africa. This presents a unique opportunity for you to work with leading telco partners across the region and contribute to the success of our family of apps.\n\nIn this role, you will work with your regional and global program teams to develop, scale and manage our product-based partnerships. The projects you will be involved in range from commercially advancing mobile experiences and business messaging to fixed infrastructure developments, AI and the Metaverse. As the face of our brand, you will play a pivotal role in maintaining and evolving our position with the telco ecosystem.  The ideal candidate will have experience in partner management and the ability to synthesize and execute against complex problems and timelines.\n\nYou will be responsible for coordinating the go-to-market of new and existing partnership programs, and driving the implementation of best practices to maximize program impact for Meta and partners in your region. Your deep experience in the mobile industry combined with your analytical and business mindset will help you propose and champion new features and programs that deliver value to our partnerships. You have excellent communication skills and you are used to keeping a lot of people aligned and accountable.\n\nThis full-time position sits within the Growth Partnerships team and is based in our Johannesburg office.\n\nIn accordance with the South Africa Employment Equity Act, preference will be given to candidates who meet the definition of Designated Groups, as defined by the Act.", "salary": "", "key_qualifications": "Extensive experience working within or with the telco industry and strong regional experience in Africa. Demonstrated knowledge of online and mobile business models and Internet/consumer technology. Influencing and negotiation skills to navigate complex deals, that lead to forming & nurturing meaningful strategic partnerships. Ability to meet multiple objectives in an entrepreneurial environment with little supervision, with a proven track record of strategic execution and operationalisation. Experience in collaborating with cross-functional teams, understand their priorities and build relationships. Resourceful, detail-oriented and highly organized in a fast-paced, highly ambiguous environment. Ability to communicate and present effectively to diverse audiences. BA/BS degree or equivalent practical experience.", "preferred_qualifications": "MBA or advanced professional degree. Prior experience working in a high-growth or startup technology company preferred. Experience in working cross-functionally from a remote location is an advantage. Additional language skills is a plus.", "responsibilities": "Build long lasting relationships and partnerships with Mobile Operators. Be a trusted representative and leader for Meta's key telco partners with frequent exchange across all levels and with all relevant partner teams. Understand partners' businesses and drive a long-term sustainable partnership via our programs. Understand and manage cross functional project interdependencies to achieve project objectives for Meta and partners. Drive local execution of growth initiatives, spanning from our family of apps and services, through innovative connectivity technologies to offline and retail driven growth programs. Provide market insights. Identify and monitor strengths, weaknesses, opportunities and threats relevant for adoption of our products and services in the region. Influence and improve the experience of users in your region by identifying product - market fit gaps. Explore, identify and evaluate strategic growth opportunities. Manage growth related partnerships. Be an advocate for people using our family of apps and services in the region.", "company": "meta", "url": "https://www.metacareers.com/jobs/943442177463673"}