{"title": "Product Finance Associate - Reality Labs", "level": "", "location": "Burlingame, CA", "description": "Reality Labs is seeking a highly strategic, driven, and analytical Finance Associate to join our Product Finance team. This is a key role within Finance overseeing Meta's investment in Mixed Reality products and working closely with Product, Business, and Partnership leaders. The role requires analytical acumen, sharp modeling skills, exceptional strategic & financial thinking, good partnership & communication skills, and a bias toward action.\n\nYou will join the team (Product Finance) that oversees our new product investments in headcount, operating expenses, and capital. Responsibilities will include leading forecasting and planning, developing strategic and operational insights, and modeling financial scenarios to guide product and business decisions. Our ideal candidate is a well-rounded top performer who can be a key contributor in a high-energy growth environment.\n\nYou will gain invaluable experience in a position which offers high visibility with product and business partners and exposure to strategic business questions we are looking to solve. You will be challenged to understand and contribute to many facets of a rapidly growing business with the opportunity to have impact on an priority investment area for Meta.", "salary": "US$37.02/hour to US$118,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor degree in Finance, Economics, Engineering, Math, Statistics, or related analytical field; 2+ years of experience in business strategy, finance, or product management; Experience building financial models; Experience in synthesizing strategic insights for executives; Demonstrated experience communicating effectively with senior leadership; Experience working independently and navigating ambiguity.", "preferred_qualifications": "Experience in an management consulting firm, investment bank, or a high-growth tech company; Experience with SQL, Oracle, and Hyperion.", "responsibilities": "Understand, impact, and influence business investment decisions through detailed financial analysis; Provide hands-on analytical support and develop actionable insights throughout the product development process; Drive data driven decision making & analysis of product decisions and strategic roadmap investments; Deep dive into critical capital Investments, HC requirements, and long-term strategic implications of agreements; Provide insights to business partners through scenario based modeling and long-range forecasting; Own ad hoc strategic and operational projects as required, and drive process improvements by partnering with cross functional owners; Create strong business partnerships with various functions across the RL business.", "company": "meta", "url": "https://www.metacareers.com/jobs/951514956659218"}