{"title": "QA Engineer, Twisted Pixel Game Studio", "level": "", "location": "Austin, TX", "description": "Twisted Pixel is an award-winning game development studio. We are working on a new VR game and looking for an experienced QA Engineer to join in the fun.\n\nAs a QA Engineer, you will split your time between utilizing your excellent problem-solving skills to find and resolve various in-game issues and on technical testing needs, data analytics, supporting and creating critical testing tools and ensuring overall quality of the product. In this role, you will spend multiple hours in a VR headset daily. You will be highly collaborative but also have the ability to stay focused when in an isolated environment. Clear communication skills are a must to relay key information to the team and stakeholders, and drive knowledge sharing.\nWhat sets the QA Engineer apart is a specialization in tech, automation and data, a focus on larger scope strategy, independence and confidence coordinating between disciplines and a passion for creating new and exciting products.", "salary": "US$88,000/year to US$129,000/year + bonus + equity + benefits", "key_qualifications": "3+ years of professional QA experience in a game testing environment; 1+ years of professional coding experience using Python, Ruby, C++ or C#; Experience with Unreal / UE4 or 5, Perforce, VS Code Debugger, and Unreal Editor; Experience with Testing Software such as Atlassian Suite, ClickUp, or TestRail; Experience with writing test plans and test cases; Basic data literacy as demonstrated by experience with KPIs, data analytics or statistics; Understanding of playing VR multiple hours a day in a fast paced app/game.", "preferred_qualifications": "Experience working in a QA or Dev role on a VR title; Data management experience; Experience with PowerBI, Tableau, or creating data dashboards; Experience with Blueprints.", "responsibilities": "Work closely with QA team, Directors, and other developers to define acceptance criteria, plan test coverage, assisting in executing day to day testing, identify risks, and build tooling and automation to improve efficiency across the team; Develop a deep understanding of the product from both technical and user perspective and help identify quality improvements for gameplay moments; Apply your strong sense of automation and efficiency, to develop and implement automation test strategies and utilize technical tooling to expand the breadth and depth of our QA coverage and improve efficiencies within the QA department; Report and track data quality and utilize data visualization tools to drive conversations around risks, product quality and development health, and identify root cause; Be a good citizen for your immediate team, participating in team level projects and roadmap discussions; Actively in a VR headset multiple hours a day (5-7hrs) in a fast paced app/game, identifying defects and quality concerns.", "company": "meta", "url": "https://www.metacareers.com/jobs/952245522945672"}