{"title": "Manager, Privacy Engineering", "level": "", "location": "Seattle, WA", "description": "Meta is seeking a Manager, Privacy Engineering for our Implementation Review team. Meta’s users expect us to respect their privacy. This team helps our products meet those expectations by making sure they are designed and built with privacy in mind.\n\nPrivacy Engineers on this team provide guidance and subject-matter expertise to software engineers so they can deliver products and features that meet our customers’ high expectations for privacy. The Manager, Privacy Engineering supports these engineers by hiring and developing the skills of a healthy, high-performance team. They also build relationships with cross-functional partners, such as Product Managers, Engineering Managers, and Legal that help their team stay focused on Meta’s most impactful work.\n\nWe are looking for someone with strong leadership skills, a background in application privacy/security or software engineering, and a passion for supporting engineers in a fast-paced environment. The ideal candidate will also be comfortable working with partners across the company to find innovative ways to preserve the privacy of billions of users.", "salary": "US$177,000/year to US$251,000/year + bonus + equity + benefits", "key_qualifications": "5+ years of work experience in software engineering, privacy engineering or security engineering, including 3+ years of hands-on management of high-performing team of engineers and/or engineering managers. Experience recruiting and managing technical teams, including performance management. Experience building relationships and influencing stakeholders across multiple disciplines. Coding experience in at least one programming language. BS in Computer Science or technical field of study, or equivalent industry experience.", "preferred_qualifications": "Experience running operational teams. Experience communicating highly technical concepts to non-technical audiences.", "responsibilities": "Support a team of highly capable engineers that provide Privacy expertise to ensure that Meta’s most important privacy promises are true in code. Partner with Privacy Leadership and engineering leaders across the company to drive technical (code and architecture) privacy reviews of products and features. Provide leadership in developing and delivering innovative solutions to help enforce privacy practices with consistency and efficiency, at scale. Work closely with technical and non-technical teams, including Engineering, Product and Legal. Grow the team and its impact by recruiting, retaining and growing top industry talent. Develop a roadmap for future work, track progress against it, and evaluate the team’s performance.", "company": "meta", "url": "https://www.metacareers.com/jobs/954321542701883"}