{"title": "Environmental Health Safety Specialist", "level": "", "location": "Redmond, WA", "description": "Environmental, Health and Safety Specialist is a core member of the Pacific Northwest EHS team focusing on compliance program implementation, assessment of operational processes for hazard reduction, incident investigation and corrective action. This role is approximately 75% health and safety and 25% environmental. The EHS Specialist will support EHS initiatives as related to Reality Labs Research and Hardware teams’ development of new technologies. The ideal candidate will have strong chemical processing knowledge and works well in fast-paced matrix organization.", "salary": "US$116,000/year to US$166,000/year + bonus + equity + benefits", "key_qualifications": "Bachelors Degree in chemical, safety or environmental engineering, occupational safety and health or related science degree. 7+ years’ experience implementing and improving EHS programs and systems in a fast-paced environment, i.e. research or manufacturing. Active participation in spill response team and the experience to don self-contained breathing apparatus.", "preferred_qualifications": "Certified Safety Professional, Certified Industrial Hygienist. Semi industry and/or High hazard chemical experience.", "responsibilities": "Develop and implement site specific safe operating procedures, localization of EHS compliance programs and risk assessments for equipment, tasks and work areas. Lead incident investigations with root cause, corrective action and develop action plans to mitigate risks. Conduct training sessions on applicable EHS topics including but not limited waste management, wastewater treatment, chemical safety, respirators, fall protection. Conduct frequent site inspections to assess and correct all environmental, health and safety matters. Partner within EHS team and business partners for evaluation of complex processes, incident response and operational improvement to ensure a safe and environmentally compliant workplace. Ability to travel up to 15%.", "company": "meta", "url": "https://www.metacareers.com/jobs/954788293050741"}