{"title": "Postdoctoral Researcher, Code Generation (PhD)", "level": "", "location": "Paris, France", "description": "Meta is seeking a Postdoctoral Researcher to work on innovative approaches to code generation with LLMs at FAIR (Fundamental AI Research). We publish groundbreaking papers and release frameworks/libraries that are widely used in the open-source community. We closely collaborate with other organizations at Meta to bring the latest research findings to production. We are looking for a Postdoctoral Researcher to join a team exploring new approaches to code analysis and generation with innovative architectures of LLMs. Past work in that space include Code LLama. The mission is to develop state of the art algorithms with a focus on open research and scientific novelty. As a Postdoctoral Researcher, you will help us develop innovative models and algorithms at the cutting edge of AI Research.", "salary": "", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree in the field of Artificial Intelligence, Machine Learning, Natural Language Processing, or equivalent practical experience. Degree must be completed prior to joining Meta. Research experience in one or more of these areas: LLMs, code analysis and generation, machine translation, machine learning, deep learning, or related fields. Experience working with machine learning libraries like Pytorch, Tensorflow, etc. Knowledge of deep learning and neural networks. Experience with scripting languages such as Python and shell scripts. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "Experience with developing scalable machine learning models in at least one of the following areas: code analysis and generation with LLMs, unsupervised/semi-supervised training, or relevant areas. Experience with large scale model training, implementing algorithms, and evaluating LLMs. Proven track record of achieving significant results as demonstrated by publications at leading conferences such as NeurIPS, ICLR, ACL, EMNLP, or similar.", "responsibilities": "Perform research to tackle unsolved real-world problems and push the state of the art in code generation with LLMs, including long-context input and long-form output. Independently design and implement algorithms, train state of the art models on large data, and evaluate their performance. Write publications and revise them based on the feedback from colleagues, mentor(s) and reviewers.", "company": "meta", "url": "https://www.metacareers.com/jobs/955938233199274"}