{"title": "Consumer Product Marketing Manager", "level": "", "location": "Menlo Park, CA | Remote, US | Washington, DC | New York, NY | San Francisco, CA", "description": "We're looking for an experienced Consumer Product Marketing Manager to join our growing product marketing team, and support our global audience. As a Consumer Product Marketer at Meta, you will help grow products used by billions of people and businesses all over the world across our apps including Facebook, Instagram, WhatsApp, Threads, and Reality Labs and drive complex cross-company initiatives. We're looking for data-driven, consumer-focused Product Marketing Managers to join our growing global team. This role is responsible for leading inbound and outbound product marketing initiatives. You will be responsible for influencing product strategies and positioning for target audiences, driving go-to-marketing efforts that drive awareness and adoption and working cross functionally with partners throughout the company. If you are a strategic marketer who is analytical and creative, excel at leading complex projects in fast-paced environments and are passionate about connecting consumers with great products, then we'd like to connect with you. We have opportunities available across our family of apps and platforms.", "salary": "US$122,000/year to US$176,000/year + bonus + equity + benefits", "key_qualifications": "7+ years of full-time experience in Marketing. Direct experience in Product Marketing, partnering closely with Product teams. Experience with consumer GTM strategies based on consumer driven insights. Experience with consumer facing product launches and consumer campaigns. Experience working with product, marketing, policy and communications teams at all levels of management, both internally and externally. Experience driving presentations with executives and cross functional teams. Experience developing and driving analytically rigorous online and offline marketing campaigns with a variety of internal teams and external stakeholders. Project management experience.", "preferred_qualifications": "Bachelor's Degree in Business, Marketing or Creative discipline. MBA. Internet or technology industry experience. International experience. Copywriting experience.", "responsibilities": "Influence and shape product strategies, positioning and narratives through the use of data and insights for target audiences in close collaboration with research, product, comms and policy. Develop and execute on go-to-market strategies including goals, metrics for success, asset development and integrated launch planning with cross functional partners. Partner with brand and integrated marketing on outbound marketing and advertising strategies and programs to drive awareness, adoption and long term engagement. Tackle complex problems with a strategic mindset, and create thoughtful recommendations and action plans for solving those problems.", "company": "meta", "url": "https://www.metacareers.com/jobs/959855888436788"}