{"title": "Senior Technical Designer", "level": "", "location": "Leamington Spa, UK", "description": "Horizon Worlds is a cornerstone of Meta’s core mission to build the Metaverse. Our team is opening this vision out to millions of users yet to own VR headsets by making content that works across VR, mobile, and PC. We are looking for a Senior Technical Designer to create fun and engaging games and other types of experiential content within Horizon Worlds. \n\nIn this role you will be responsible for the design and implementation of our first-party content, working alongside the rest of the content team and supported by other members of the development team (including audio and UI support).", "salary": "", "key_qualifications": "5+ years professional experience in gameplay scripting, technical design, or equivalent educational experience; Understanding of game architecture and ability to identify and implement common game mechanics and patterns in TypeScript or similar scripting languages; Interest in and understanding of a broad variety of game genres and styles on mobile & VR; Understanding of different audiences and their goals & motivations; Strong collaboration and communication skills, including with remote teammates; Understanding differences in interaction design for different input devices (eg PC, console, mobile, VR); Experience debugging and managing performance within a scripting environment.", "preferred_qualifications": "Experience in Unity, Unreal Engine or similar game engines; Experience at developing a Game as a Service or supporting Live Ops; Experience in designing for VR; A portfolio demonstrating a proven track record of delivering gameplay experiences as part of a team; Experience working with UGC editors (eg Roblox); Modding experience.", "responsibilities": "Driving ideation, design, and implementation through to completed gameplay delivered to players on VR, mobile, and PC; Creating reusable scripted gameplay elements to a high level of polish; Prototyping gameplay designs to illustrate concepts; Overseeing cross-platform playtesting and use generated data to iterate design; Generating paper designs for sign-off by stakeholders.", "company": "meta", "url": "https://www.metacareers.com/jobs/962288655371682"}