{"title": "Software Engineer - Calibration Team", "level": "", "location": "Pittsburgh, PA", "description": "Reality Labs Research (RL-R) brings together a diverse and highly interdisciplinary team of researchers and engineers to create the future of augmented and virtual reality. Software development is vital to empowering our scientific explorations and generating viable paths to the consumer products people will use for decades to come — products that will truly give people superpowers. At RL-R Codec Avatars, we aspire to a vision of social VR and AR where people are able to interact with each other across distances in a way that is indistinguishable from in-person interactions, with Codec Avatars that look like you and move like you. We're just getting started. You can help us make this dream a reality and accomplish your life’s best work here!\n\nIn the calibration team, we are looking for a talented and motivated software engineer that can help us build data processing pipelines, as the data move from our motion capture systems and devices to functional codec avatars for photorealistic telepresence applications. Help us build the future of telepresence of the Metaverse!", "salary": "US$56.25/hour to US$173,000/year + bonus + equity + benefits", "key_qualifications": "Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.\n3+ years experience with modern C++ and Python\nExperience with software development practices such as source control, code reviews, unit testing, debugging and profiling\nExperience developing APIs, SDKs and developer tools\nExperience working independently and in highly dynamic environments", "preferred_qualifications": "5+ years hands-on experience with Python and modern C++\nExperience with software development on various operating systems such as Linux, Android, MacOS, and Windows\nExperience developing data engineering pipelines for consumption in machine learning workflows\nExperience with traditional relational databases like MySQL or PostgreSQL\nKnowledge of estimation theory, path planning, optimization, optimal solvers\nComputer vision or computer graphics experience\nExperiences in working with large-scale datasets, developing deep learning training frameworks, and developing PyTorch extensions in C++ or CUDA\nExperience developing, debugging, and shipping software products on large code bases that span platforms and tools\nExperience with parallel computing with GPU’s using CUDA", "responsibilities": "Analyze, evaluate, design, develop, integrate, debug and test calibration algorithms, software tools, processing pipelines\nPrototype software-hardware interfaces for characterizing, modeling and calibration of camera lenses and image sensors\nDesign intuitive software APIs that researchers and engineers can effectively use\nParticipate in design reviews and code review\nCollaborate in a team environment across multiple scientific and engineering disciplines, making architectural trade-offs required to rapidly deliver software solutions\nWork with mechanical, software, research engineers, and research scientists to understand challenges in building state-of-the-art software systems\nWrite clean readable code, debug complex problems that span systems, prioritize ruthlessly, work efficiently\nLearn constantly, educate others, dive into new areas with unfamiliar technologies, and embrace the ambiguity of AR/VR problem solving", "company": "meta", "url": "https://www.metacareers.com/jobs/963079035357061"}