{"title": "Software Engineer, Machine Learning", "level": "", "location": "Sunnyvale, CA", "description": "Meta Platforms, Inc. (Meta), formerly known as Facebook Inc., builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps and services like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.", "salary": "US$234,062/year to US$240,240/year + bonus + equity + benefits", "key_qualifications": "Requires a PhD degree in Statistics, Computer Science, Computer Software, Computer Engineering, Applied Sciences, Mathematics,Physics, or a related field. Requires completion of a university-level course, research project, internship, or thesis in the following: 1. Machine Learning Framework(s): PyTorch, MXNet, or Tensorflow 2. Machine learning, recommendation systems, computer vision, natural language processing, data mining, or distributed systems 3. Translating insights into business recommendations 4. Hadoop, HBase, Pig, MapReduce, Sawzall, Bigtable, or Spark 5. Developing and debugging in C, C++, and Java 6. Scripting languages: Perl, Python, PHP, or shell scripts 7. C, C++, C#, or Java 8. Python, PHP, or Haskell 9. Relational databases and SQL 10. Software development tools: Code editors (VIM or Emacs), and revision control systems (Subversion, GIT, or Perforce) 11. Linux, UNIX, or other *nix-like OS as evidenced by file manipulation, advanced commands, and shell scripting 12. Build highly-scalable performant solutions 13. Data processing, programming languages, databases, networking, operating systems, computer graphics, or human-computer interaction 14. Applying algorithms and core computer science concepts to real world systems as evidenced by recognizing and matching patterns from different areas of computer science in production systems 15. Distributed systems", "preferred_qualifications": "", "responsibilities": "Research, design, develop, and test operating systems-level software, compilers, and network distribution software for massive social data and prediction problems. Have industry experience working on a range of ranking, classification, recommendation, and optimization problems, e.g. payment fraud, click-through or conversion rate prediction, click-fraud detection, ads/feed/search ranking, text/sentiment classification, collaborative filtering/recommendation, or spam detection. Working on problems of moderate scope, develop highly scalable systems, algorithms and tools leveraging deep learning, data regression, and rules based models. Suggest, collect, analyze and synthesize requirements and bottleneck in technology, systems, and tools. Develop solutions that iterate orders of magnitude with a higher efficiency, efficiently leverage orders of magnitude and more data, and explore state-of-the-art deep learning techniques. Receiving general instruction from supervisor, code deliverables in tandem with the engineering team. Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU). Perform feature engineering by preprocessing and transforming raw data into a suitable format for training and testing machine learning models. Improve machine learning model performance by conducting model exploration, training, and evaluation. Build or improve the necessary software infrastructure to train and serve models efficiently.", "company": "meta", "url": "https://www.metacareers.com/jobs/966025901648300"}