{"title": "Director Data Science", "level": "", "location": "Burlingame, CA", "description": "We’re looking for a seasoned analytics leader to drive data-informed decisions for the Reality Labs Business Group. You will play a critical role in helping Meta build the platforms of the future. You will partner with the product and business teams that build and grow our hardware and software products for the future of Meta. You will be focused on results, be proactive, deliver rigorous analyses, and use data to drive change in products, strategies, and organizations.", "salary": "US$314,000/year to US$361,000/year + bonus + equity + benefits", "key_qualifications": "10+ years of work experience managing analytics teams, working collaboratively with Product and Go to Market teams, and guiding data-influenced product and business planning, prioritization and strategy development. Proven experience influencing strategy and driving change across org boundaries through clear and compelling communication of data-driven insights and analyses. Demonstrated experience in hiring, retaining and scaling diverse, geographically dispersed, high-performing teams.", "preferred_qualifications": "Previous experience in consumer electronics, consumer subscription, or omni-channel commerce businesses. Knowledge of gaming and/or entertainment industry, including content lifecycle (sourcing, greenlight, launch, etc.), creator ecosystems, platform interactions. Experience with driving analytics for a brand-new or rapidly scaling business or product line. Experience with both product analytics and business analytics applications.", "responsibilities": "Partner with leadership teams across Content, Sales, Product Marketing, and Marketing organizations to craft business strategies and strengthen a data-inspired culture where we are bringing innovative data insights into the key decisions. Inspire, lead and grow a distributed team of data scientists across North America. Apply your expertise directly and through coaching the team to use quantitative analysis, relatable narratives, and the presentation of data in developing data-informed strategies for building and growing the next computing platform. Establish measurement frameworks and organizational processes in support of content and go to market strategies. Build strong cross functional relationships in order to strengthen data culture and analytics team integration into key product and GTM processes. Help lead the broader analytics organization through change and adapt to ever changing legal and privacy landscape. Be proactive with asking questions, ensuring that the right questions are being answered with appropriate level of rigor and that analyses lead to clear and actionable recommendations and impactful product and business changes.", "company": "meta", "url": "https://www.metacareers.com/jobs/966327858299069"}