{"title": "Computer Vision Engineer (Leadership) - Reality Labs", "level": "", "location": "Zurich, Switzerland; Tel Aviv, Israel", "description": "The Reality Labs team at Meta is looking for Senior/Lead Computer Vision Engineers to support our engineering teams as we build towards our goal of helping more people around the world come together and connect through world-class Augmented, Mixed and Virtual Reality hardware and software. With global departments dedicated to AR/VR research, computer vision, haptics, social interaction, and more, we are committed to driving the state-of-the-art forward through relentless innovation. AR and VR potential to change the world is immense -- and we're just getting started.\n\nMeta is building the Metaverse, the \"spatial internet\" where immersive virtual worlds will coexist with the real world. Augmented and Mixed reality will transform the way people come together to interact, work and play. By developing new hardware and software products capable of understanding the real world and the user within their environment, we aim to make it possible for people to interact with content in their environment and share it with others.\n\nOur Reality Labs division explores, develops and delivers cutting-edge technologies that serve as the foundations for the Metaverse and other future Reality Labs products, such as Oculus headsets, future AR glasses and our FB Family of Apps (Messenger, Instagram, WhatsApp). From Visual Localization, SLAM, 3D reconstruction, Context/Semantic Understanding, Mapping, Tracking, and Sensor Fusion, our team is focused on taking new technologies from early concept to the product level while iterating, prototyping, and realizing the human value and new experiences they open up.", "salary": "", "key_qualifications": "Prototyping and engineering experience in at least one relevant specialization area in either Computer Graphics, Computer Vision or Machine Learning: SLAM, State Estimation, Sensor Fusion, Generative models such as GANs, Pose estimation: Body, Facial, Hand or Eye Tracking, Dense 3D reconstruction, Object detection, segmentation and tracking Scene understanding/Semantic Segmentation, Photorealistic rendering, Factory, HW, Camera or Online Calibration, Visual search and contextual or multimodal AI. BSc degree in Computer Graphics, Computer Science, Computer Vision, Machine Learning, or related technical field. Experience in driving large cross-functional company-wide or industry-wide engineering efforts. Experience in mentoring and influencing senior engineers across organizations. Experience communicating and working across functions to drive solutions.", "preferred_qualifications": "MSc or PhD degree in Computer Graphics, Computer Science, Computer Vision, Machine Learning, Robotics or related technical field. Industry experience working on projects such as: real-time SLAM and 3D reconstruction, sensor fusion and active depth sensing, object and body tracking and pose estimation, and/or image processing. Image and/or semantic segmentation, 2D and 3D key point estimation and surface reconstruction, depth estimation, visual search or contextual AI, generative AI, or photorealistic rendering", "responsibilities": "Lead the design and development of novel computer vision and/or, machine learning algorithms in areas such as: real-time scene and object tracking, reconstruction and understanding, as well as, segmentation, face tracking, body tracking, key point estimation, depth sensing, generative approaches such as GANs, 3D stereo and volumetric reconstruction, avatars, reconstructions and virtual try-ons. Play a critical role in the definition and execution of long-term roadmaps in partnership and cross functional organizations in computer vision, machine learning, graphics, sensors, optics, and silicon. Lead and collaborate with multidisciplinary engineering and research teams to develop technologies from early exploration and incubation to production. Be a go-to person to escalate the most complex online / production performance and evaluation issues that require an in depth knowledge. Develop prototypes for future VR/AR/MR experiences, drive continued development, and integrate robust solutions into products. Participate in cutting edge research in computer vision that can be applied to AR/VR product development. Define projects for other engineers to possibly solve and achieve impact based on your direction.", "company": "meta", "url": "https://www.metacareers.com/jobs/968259088321074"}