{"title": "Health Tech Partnerships Manager", "level": "", "location": "Sunnyvale, CA", "description": "As a Health Tech Partnerships Manager for Meta Reality Labs in the Strategic Sourcing organization, your job is to work with our experts in health tech, hardware, software, validation and go-to-market to build and execute on partner strategies for our wearable devices. There will be a focus on enabling new health technologies in our devices as well as new channel strategies to expand the sales of current and future wearable devices with health, fitness and wellness features. You will need to negotiate deals–including business model considerations, development and licensing terms, statements of work, and cost and commercials–in order to be successful in this role. You'll be part of a multi-disciplinary, cross-functional team that manages key partnerships that will push the user experience and get it out to users.\n\nOur mission is to advance the future of the Metaverse through experiences on our smart glasses, mixed reality and augmented reality devices. The work you do will lay the foundation for health, fitness and wellness experiences for years to come.", "salary": "US$144,000/year to US$201,000/year + bonus + equity + benefits", "key_qualifications": "8+ years track record of working on health/wellness/fitness related features, technologies and devices in the wearables space and bringing them to market. Experience with structuring and negotiating the business, technology and legal aspects of partnership agreements. Experience leading cross-functional projects, and experience working effectively with people at all levels, both internally and externally. Communication skills, with experience compiling clear and concise briefing materials and other communications. Bachelor’s Degree in Engineering, Business, Supply Chain, or related field.", "preferred_qualifications": "Proven experience in building partnerships for new health/fitness/wellness enabled experiences and devices including managing complex processes and negotiations end-to-end. Experience in establishing relationships and presence within the consumer electronics sector or health/medical devices with experience in reaching and exceeding goals. Experience operating with flexibility in a fast-paced, constantly evolving and collaborative environment. Exceptional analytical, communication and presentation skills with technical, contractual and financial issues. Strong desire to contribute to the world by improving the health/fitness/wellness related experience of wearable devices.", "responsibilities": "Develop and expand the vision, strategy and execution plan for partnerships for the Health Tech Partnerships function. Negotiate deals including but not limited to master development and supply agreements, licensing agreements, statements of work, evaluation agreements, and value-added distribution and service agreements. Manage strategic partner relationships up to the executive level. Support exploratory discussions and scout new potential partners to enable new health technologies as well as to support new channel strategies for health/fitness/wellness enabled experiences and devices. Keep and drive alignment with multi-disciplinary, cross-functional teams to ensure that key partners and partner strategies will support our vision and strategy for health, fitness and wellness.", "company": "meta", "url": "https://www.metacareers.com/jobs/971279771169457"}