{"title": "Patent Counsel", "level": "", "location": "Los Angeles, CA", "description": "Meta seeks a highly-motivated, team player to serve as Patent Counsel on the Patent & Trade Secret Team. This position will help counsel clients on patent and trade secret risk, advise on intellectual property strategies, and manage the patent portfolio activities for certain technology areas and will report to the head of Patents & Trade Secrets. You must have the ability to operate independently in a fast-paced environment and work proactively with various teams across the organization including Legal, Product, and Engineering. This is a great opportunity to join a world-class legal team and work on cutting-edge issues in an exciting, fast-paced environment.", "salary": "US$167,000/year to US$233,000/year + bonus + equity + benefits", "key_qualifications": "J.D. Degree (or foreign equivalent) and membership in at least one U.S. state bar; 3+ years of patent prosecution experience; Effective communication, negotiation, and collaboration skills; Experience to adapt and prioritize in a fast-paced environment, maintaining big-picture focus on company goals; Experience with artificial intelligence, virtual/mixed reality, augmented reality, web technologies, social products/technologies/platforms and/or the mobile space", "preferred_qualifications": "In-house experience, especially strategic risk mitigation and patent portfolio development and counseling of R&D leadership; BS or graduate degree in computer science or electrical engineering; Eligible to practice before the US Patent and Trademark Office; Experience with the full lifecycle of patent portfolio development, maintenance, and divestiture; Experience with IP and patent transactions and litigation; Knowledge of physics, optics, chemistry, or related engineering fields, either through degrees conferred or significant industry experience", "responsibilities": "Work with legal, product, and engineering teams to mitigate IP risk and protect products, services, and technologies that map to Meta’s intellectual property strategy; Understand Meta’s strategic and competitive position and think at a high level about patent and trade secret strategy; Manage patent portfolio and related activities for multiple product/technology areas, including invention identification, patent committees, invention disclosure meetings, portfolio mining, and overseeing global patent application preparation and prosecution; Work collaboratively with clients and manage outside counsel and service providers to support patent and trade secret-related work; Train, educate, and counsel product, engineering teams, and other partners in intellectual property matters; Support IP aspects of technology transactions, as well as patent acquisitions, licensing, and litigation.", "company": "meta", "url": "https://www.metacareers.com/jobs/973734951014197"}