{"title": "Biostatistician- Wearable Devices", "level": "", "location": "Burlingame, CA | New York, NY", "description": "The Meta Health and Wellbeing team is seeking a biostatistician who will report to the Manager of Health and Wellbeing Research and work alongside senior members to execute analyses and reporting for digital health projects aimed at improving health outcomes throughout the world. The ideal candidate will have expertise in the development and execution of model evaluation, statistical analysis plans and analytic programming and reporting for clinical/health outcomes research studies and digital health research studies. The ideal candidate brings experience working in interdisciplinary teams, including across both traditional biostatistics and data science/machine learning domains. A successful candidate in this role is highly collaborative as well as self-driven, passionate, and able to execute consistently in a fast-paced environment. In this role, you will work in and closely with interdisciplinary teams of product managers, engineers, clinicians, researchers and senior biostatisticians to plan and execute research of novel digital approaches to measuring and improving health and wellness.", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Master's degree in Biostatistics, Bioinformatics, Biomedical Engineering or other relevant analytic/data science field. Relevant experience in data science, biostatistics, machine learning, clinical/health outcomes research, digital health and wellbeing assessment, in academic or industrial settings. Experience working in multidisciplinary research and/or product development teams. 2+ years of experience with evaluating machine learning models at scale. Expertise in execution and reporting of results of digital health research projects. Programming expertise to execute the above in Python and R, writing reusable and well-documented code, familiar with software development lifecycle.", "preferred_qualifications": "Direct industrial experience in consumer/digital health and wellbeing product development and/or research, with demonstration of success working within and across multidisciplinary teams (e.g. project/product managers, software engineers, research scientists, machine learning data scientists). Experience in deep learning and PyTorch. Experience in developing algorithms and specialized software tools for biomedical measurement data. Familiar with data pipeline and data investigation.", "responsibilities": "Uses a variety of advanced statistical software, methods, and techniques to gather, analyze, and interpret research data to derive useful information for research data, advises and assists in the development of inferences and conclusions, as appropriate. Executes and evaluates machine learning model performance. Maintains the highest of clinical research standards to ensure validity and reproducibility of results. Performs careful data cleaning activities including handling data discrepancies, missing values, outliers, normalization etc. Works effectively across health and wellbeing research, engineering and product, providing analytic expertise that spans traditional biostatistical and data science (e.g. machine learning) methods. Maintains knowledge of current and emerging trends in data science.", "company": "meta", "url": "https://www.metacareers.com/jobs/973736761016035"}