{"title": "Product Design Leader", "level": "", "location": "Bellevue, WA", "description": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary design teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe.  Meta is looking for a Product Design Leader with exceptional design, communication and people management skills. As a Product Design Leader, you will lead and manage teams to ensure our products and features are valuable for people, easy to use, and of the highest level of craft and execution. In this role, you'll be a foundational member on the leadership team, working together with your counterparts in engineering, data science, UX research, content design, and other disciplines to define the strategy, operations and communications that guide the team to build great products addressing real user needs. You’ll be expected to utilize your full range of people management skills, product strategy, product design, interaction design and visual design skills. This posting represents different full-time roles across the Meta company.", "salary": "US$196,000/year to US$272,000/year + bonus + equity + benefits", "key_qualifications": "8+ years of experience in Product Design; 4+ years of design leadership experience with direct reports under your guidance and leadership; 8+ years of experience working collaboratively with product, engineering, design, content and user research teams; Experience building and shipping applications or software across a variety of platforms; Experience leading product direction and strategic thinking with the experience developing product goals, identify opportunities, and make decisions based on the impact to people and the company; Experience representing work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts", "preferred_qualifications": "Experience with delivering 0-1 products from concept stages to launch; Experience working on large scale, complex, ambiguous projects across multiple teams; Experience managing managers", "responsibilities": "Build and manage a talented, diverse, inclusive team of product designers and leaders that consistently delivers on projects and is well-balanced across a range of design skill sets; Responsible for overall team performance and health, resource allocation, project prioritization, and building a culture of design excellence; Lead and oversee the user experience of a product from conception to launch in partnership with product managers, engineers, UX researchers and content designers; Take broad, conceptual ideas and turn them into useful and valuable products for our billions of users; Contribute to strategic decisions around the future direction of Meta’s products; Design end-to-end flows and experiences that are simple and elegant for our supported platforms; Define, craft and evolve designs within visual systems and/or standard; Proactively solicit and provide feedback from designers and a broader product team in order to continually raise our bar for quality, while also taking on mentorship; Cultivate a healthy design process for the team, and be a key contributor to your organization's product strategy; Effectively communicate your team's product goals (both within the team and outside the team), and connect related projects across the company so that problems or joint decisions can be resolved quickly.", "company": "meta", "url": "https://www.metacareers.com/jobs/974708860350194"}