{"title": "Product Marketing Manager, Brand Safety", "level": "", "location": "Menlo Park, CA | New York, NY | San Francisco, CA", "description": "We’re seeking a Product Marketer to help develop our next generation of brand safety solutions that drive value and relevant experience for consumers and advertisers. Meta seeks a seasoned Product Marketing Manager to serve as the representation of the market in product and the representation of product in the market across the broad advertiser ecosystem.\n\nThe successful candidate will have deep industry experience and be a strategic thinker, skilled operator, and expert influencer with the demonstrated ability to drive consensus across product, marketing and sales teams. This individual will synthesize market feedback for product development and collaborate with key stakeholders to set priorities for go-to-market and product. This person should be a skilled communicator and collaborative partner who thrives in a fast-paced, highly cross-functional environment.\n\nIn a time of industry change, we need a true thought leader who can comfortably influence stakeholders in product and sales globally. At the same time, the role requires hands-on operational product work to execute against business objectives.", "salary": "US$128,000/year to US$186,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's Degree; 4+ years of professional experience in strategy consulting, program management, product marketing, product management, partnerships, business development, business strategy, or equivalent experience; Experience in digital technology, advertising, advertising technology or relevant fields; Demonstrated experience working with engineering, product management, design, data science and research functions; Experience setting product priorities and managing and communicating tradeoffs; Experience gathering and analyzing customer and market feedback, translating this information into requirements and functional specifications; Track record of influencing behavior at a variety of levels in the organization, including cross-functional leaders", "preferred_qualifications": "MBA; Deep knowledge of advertising solutions; Understanding of regulatory environment in online advertising", "responsibilities": "Drive multi-year product strategies at the portfolio level and shepherd product development across ideation, alpha, beta and launch, working with Product, Engineering, Marketing for our brand safety solutions; Communications, and other cross-functional partners to bring our products to market and drive alignment internally; Identify product opportunities through customer interviews and qualitative and quantitative analysis; Produce market assessments including competitive analysis, customer segmentation, and product requirements; Work closely with the product management and engineering team to deliver world-class products, including driving prioritization decisions; Manage product alphas and betas to direct product refinements and identify critical customer needs that must be met by the product in order to launch; Lead the development of product positioning, materials, and training for sales, clients and consumers, as necessary; Develop the go-to-market strategy for product releases across multiple Facebook teams, and be able to execute those plans; Support teams in handling customer and consumer questions on measurement tools and partner with engineering and product teams to coordinate troubleshooting these tools; Partner with leadership to set product adoption goals, develop execution strategies, track and analyze performance, and drive adoption of our measurement solutions.", "company": "meta", "url": "https://www.metacareers.com/jobs/976880134085767"}