{"title": "Account Manager, ANZ Mid Market", "level": "", "location": "Singapore", "description": "The Account Management team is a sales team and part of Meta’s Global Business Group. The team is focused on enabling businesses to grow by connecting them to customers across Meta platforms using Meta advertising solutions. Account Managers are directly responsible for driving revenue, building relationships and helping clients grow their own business results on Meta through client-centric consultation and education. Ideal candidates will have experience in pipeline management, ability to drive marketing strategy coupled with a willingness to roll up their sleeves and execute their sales tactics. Success in this position requires exceptional consultative sales, coaching, and client service skills; a willingness to experiment; the ability to thrive in a dynamic, team-focused environment; and a passion for helping others to achieve results. This position is full-time and located in our Singapore Office.", "salary": "", "key_qualifications": "4+ years of experience in B2B sales, performance marketing, digital marketing/agency, consulting or related account management roles. Ability to influence C level and build effective relationships. Strong problem solving and quantitative analytical skills. Manage clients whose usual business language is English.", "preferred_qualifications": "Knowledge of the media landscape of Australia & New Zealand is preferred. Knowledge of digital media is a bonus. Bachelor's degree or equivalent practical experiences.", "responsibilities": "Drive revenue growth for our organization and the businesses we support through: - Being an expert in Meta's solutions for businesses of all sizes and tailor recommendations strategically to suit varying client needs - Improving performance of our clients marketing spend in a client-centric manner - Aligning clients KPIs with Meta solutions to drive incremental value. Ability to effectively prioritize and manage tasks within a fast-paced environment while maintaining strict attention to detail. Grow revenue, educate and lead strategic conversations with clients. Demonstrate expertise in all matters relevant to your book of business, including escalation and troubleshooting to resolve client issues.", "company": "meta", "url": "https://www.metacareers.com/jobs/977859320569279"}