{"title": "Executive Administrative Partner", "level": "", "location": "Menlo Park, CA | San Francisco, CA", "description": "Meta is seeking an experienced Executive Administrative Partner to support a VP and Director in the Meta leadership team. The person in this role will need to be a masterful problem-solver and an organizational force given complex calendaring and heavy travel planning. Additionally, the ideal candidate will have exceptional communication skills, and will be resourceful in building relationships across the larger Meta ecosystem. This position is full-time.", "salary": "US$47.16/hour to US$67.50/hour + bonus + equity + benefits", "key_qualifications": "4+ years of relevant experience providing administrative support to 1 or more executives; 4+ years of relevant experience coordinating travel logistics on behalf of 1 or more executives; 4+ years of relevant calendar management and expense report management experience for 1 or more executives; Experience prioritizing multiple projects; Experience with Microsoft Office and Google Suite", "preferred_qualifications": "Experience working with senior leaders, both within and outside of the company; Experience managing complex calendars with heavy travel schedules; Experience working with business leads or chiefs of staff to run business operations; Experience mentoring and coaching admins, contributing the larger admin community, and bringing a “team-player” mentality; Experience supporting tech functions at a large scale tech company", "responsibilities": "Coordinate internal and external meetings; Manage complex calendar set-up and movement; Prepare expense reports and purchase requisitions; Coordinate both domestic and international travel arrangements; Organize space planning, strategic offsite events and team all-hands meetings; Build cross-functional relationships between departments; Partner closely with organizations lead admins; Communicate key org and company updates to admins and cross-functional partners; General office duties as needed", "company": "meta", "url": "https://www.metacareers.com/jobs/980710460182030"}