{"title": "Network Operations Engineer", "level": "", "location": "Singapore", "description": "Meta is looking for a forward thinking Network Operations Engineer with advanced technical skills in networking, system, and tooling/automation to join the network operation team to improve operations efficiency and reliability of one of the most dynamic, fast-paced networks in the world. The right candidate will be comfortable in a fast moving organization and enjoy digging into operational problems in order to implement the process enhancement and technical solutions to solve them, and are able to quickly learn and pick up new domain expertise and technologies.", "salary": "", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Engineering degree, or a related technical discipline or equivalent experience. 7+ years of experience with network operations while supporting large-scale network infrastructure. Proficient in at least one of the network domains: IP network or CDN/Edge network, including topology, protocol, hardware and architectures. Experience working within a global team and collaborate with cross-functional teams in a fast-paced and dynamic environment with limited supervision. Experience learning new languages, technologies, frameworks and APIs. Experience in implementing/maintaining the monitoring, alerting and repairing systems for production network in a DevOps environment. Proficient in an operations framework and best practices, such as ITIL v.4, CMMi, Lean Six Sigma.", "preferred_qualifications": "BS or MS in Computer Science, Computer Engineering, or a related technical discipline, or equivalent experience. Expert knowledge of TCP/IP and IPv6. Knowledge of data driven analysis. Experience in providing technical guidance to external vendors, through escalation (Tier IV). Experience coding in higher-level languages (e.g., Python, C++, Go, etc.).", "responsibilities": "Be the key Subject Matter Expert on operations of Facebook production networks in a hyper-scale and heterogeneous environment. Formulate the right metrics and definitions of success to drive quality, efficiency, cost, and timeliness, and evolve these over time to match changes to the infrastructure and business requirements. Develop the operational process improvement plans, and transform the improvements to scalable and automated workflows by writing and reviewing the code to improve the operational efficiency. Perform deep dives on complex technical issues across networks, ranging from automated tooling to hardware failures and network issues. Anticipate potential operational risks and develop strategies to mitigate/minimize. Participate and improve escalation and emergency response with detailed postmortem while addressing issues systematically to prevent future occurrences. Build cross-functional relationships with Network Engineering, Systems Engineering, Traffic, Logistics, Program Management, and OEM partners to deliver superb operational results and manage the performance of external vendors. Participate in the oncall rotation with the global operations team. 15% of travel required (domestic and international).", "company": "meta", "url": "https://www.metacareers.com/jobs/982275753603220"}