{"title": "Privacy Engineer, Implementation Review", "level": "", "location": "London, UK", "description": "Meta’s Privacy Engineering organization is seeking a technical leader to identify, advise, investigate and mitigate privacy violations and/or exposures in our products. Your expertise in privacy design will be the foundation of initiatives that protect the data of over 2 billion people, advancing our mission to make privacy a priority in everything we do.\n\nYour skills will be the foundation for understanding privacy risks in Meta initiatives by being the technical advocate for privacy decisions and discussions across the company. You will be relied upon to provide engineering and product teams with the privacy expertise necessary to make confident product decisions.", "salary": "", "key_qualifications": "12+ years industry experience in a role developing software in Python, PHP, Java, C/C++ (or equivalent language), including code maintenance and review\n5+ years experience focusing on security/privacy related design, security/privacy incident management, or security/privacy research\n5+ years experience within a corporate environment with experience communicating technical issues and their implications to leadership and other areas of the business\n2+ years experience mentoring and leading junior engineering teammates and providing growth opportunities to them\nB.S. in Computer Science, Electrical Engineering, or equivalent experience", "preferred_qualifications": "Experience contributing to the security/privacy community (public research, blogging, presentations, etc.)\nExperience assessing architectural designs and implementation details seeking security and privacy shortcomings\nExperience translating regulatory requirements (GDPR, CCPA, ePD) into actionable technical specifications", "responsibilities": "Review technical implementation details and design documentation for new systems and features to ensure compliance with policy and legal requirements, while giving guidance on improving privacy features in those systems.\nPlay a key role in driving code and architecture reviews as well as large cross-company privacy reviews of products and features.\nConduct technical reviews for new features and identify privacy concerns. Work closely with technical and non-technical teams, including Engineering, Product and Legal.\nProvide product teams with the guidance and best practices to help protect users privacy and mitigate any risk. Work closely with Security and Privacy leaders to help define goals that are properly aligned to company-wide goals.\nDefine and articulate a clear vision for privacy, and influence leaders across all of Facebook to adopt a balanced view of product and privacy goals in overall decision-making.\nScale the team’s capabilities via identification and implementation of foundational tooling and process improvements.\nIdentify process and personnel bottlenecks from quantified metrics, uncovering potential optimizations.", "company": "meta", "url": "https://www.metacareers.com/jobs/985308249497323"}