{"title": "Commercial Business Process Manager", "level": "", "location": "Bellevue, WA, Fremont, CA", "description": "Meta is seeking a Commercial Business Process Manager (\"Commercial BPM\") to be responsible for standardizing/optimizing commercial operations across sourcing, contracting, and payment processes (\"Source-to-Pay\") processes across Meta’s Infrastructure Supply Chain organization. This is a critical role engaging with internal stakeholders across supply chain and other source-to-pay organizations to understand synergies and gain efficient processes. This role will maintain a competitive landscape and oversight of existing (and new) business process outsourcing vendors that support all backend S2P processes.", "salary": "US$151,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in a directly related field, or equivalent practical experience. 7+ years program management experience, driving large programs that transform the business and have a cross-functional impact. 5+ years managing processes across sourcing, contracting, payment and/or similar functions (e.g., project controls), defining and building end-to-end processes at a cross organizational level. 3+ years of familiarity of sourcing, contracting, and payment systems including invoicing.", "preferred_qualifications": "Sourcing: 5+ years of knowledge of strategic sourcing including familiarity with RFX (RFIs, prequalifications, prepositioning, RFP, award) through contract management. Contracts Management: 5+ years contracts management experience to hold suppliers accountable for contract services/deliverables. Business Process Outsourcing: knowledge of BPO models (as well as other contractor models and differentiators). Data Center/Critical Infrastructure: 7+ years of data center experience, with knowledge of related sourcing categories/taxonomies.", "responsibilities": "Driving standardization of procurement process(s) (signals to trigger sourcing, contracting, Purchase Requisition/Purchase Order/payment, etc., collectively procurement process or \"source-to-pay/S2P\") and will be able to navigate purchasing needs through all aspects of the procurement process. Identify, initiate, and execute projects to drive quality, time, and stabilization across the source-to-pay (S2P) program. Develop quick wins to enable clear category support across business process outsourcing vendors (\"BPOs\" or \"BPO\") for supply chain and cross-functional stakeholder organizations (Finance S2P, data center project controls and contracting teams, etc.) Collaborate with Legal, Finance/Accounting, Meta corporate procurement, and other key functional stakeholders to influence policies to document and streamline Infrastructure Supply Chain + Engineering (\"ISCE\") process(s) and subsequent tooling compliance. Collaborate with stakeholders, becoming the key contacts to drive for procurement of goods/services support. Work in a collaborative team environment to support ISCE’s procurement processes. Educate and train end users on procurement processes and collaborating with system owners (e.g., Legal for Contracts tools, Engineering (\"EP\") teams for centralized procurement tools, etc.) on roadmaps, requirements, and enhancements. Business Process Outsourcing Transformation: continue audits and transformation with existing BPO vendors that support ISCE’s supply chain organization across source-to-pay functions. Drive triage, purchase requisition, and subsequent purchase order improvements within SLA(s), Drive Purchase Requisition (PR) system compliance to ensure Purchase Orders (POs) are set up accurately and are tracked and managed through the PR initiation through the purchasing cycle, inclusive of delivery. Ensure POs are compliant with corporate policies and procedures. Program manage S2P transformation initiatives, and clearly communicate objectives and status(s).", "company": "meta", "url": "https://www.metacareers.com/jobs/985799799945759"}