{"title": "Product Marketing Manager - Augmented Reality, Reality Labs Performance", "level": "", "location": "Los Angeles, CA | Seattle, WA | Burlingame, CA | New York, NY", "description": "At Meta Reality Labs, we build tools that help people feel connected anytime, anywhere. We’re on a mission to build the next computing platform by putting people at the center of emerging hardware and software technologies, whether on the go with wearables and augmented reality, in the home or at work, or fully immersed in alternate virtual reality worlds. The Meta Reality Labs Product Marketing organization leads inbound product marketing, product launch strategy, and in-market business growth. The Product Marketing team influences early stage product development and roadmaps, creates go-to-market plans, supports in-market growth of the ecosystem, and provides direction for future investments. It’s an exciting time to join the Augmented Reality PMM team. Ray-Ban Meta Smart Glasses have had a strong response from the public, and we are growing the team as we look to accelerate growth – and plan for an expanded portfolio of products in the future. You’ll join a team of In-Market PMMs working in service of unlocking the next phase of augmented reality adoption world wide. We’re looking for a Product Marketing Manager who can help manage the performance of our channels, act as a key steward of insights and learning across the organization, as well as support planning across supply, demand and inventory as needed. You’ll work extremely cross-functionally with Data Science, Marketing Insights, Sales, Ops, Finance, Project Management, external partners and across PMM.", "salary": "US$128,000/year to US$186,000/year + bonus + equity + benefits", "key_qualifications": "5+ years professional experience with product marketing or analytics", "preferred_qualifications": "Strong track record of identifying opportunities to drive business growth. Experience working independently and adapting in a fast-paced, entrepreneurial, and fluid environment, identifying and escalating issues early and often. Prior experience with insights and dashboards, retail channel analytics, sales reporting and demand planning, ideally in Consumer Electronics or physical goods. Prior product marketing experience across a portfolio of products with projects that work across a multi-product portfolio and/or go deep on any one product. Experience driving initiatives that have not been done before – setting goals, communicating a vision, bringing stakeholders along, facilitating cross-functional alignment through execution, measurement and performance assessment. Experience putting forth best-in-class execution within a measurable and data-driven framework with both creative and analytical thinking. MS/MBA degree or equivalent experience.", "responsibilities": "Contribute to the supply and demand planning, in partnership with sales & finance. Contribute to key campaigns and launches by overseeing necessary inventory management changes across retail touchpoints. Act as a steward of customer needs by managing cross-functional Voice of the Customer reports to inform future decision making. Ensure all PMMs are supported with insights, dashboards, and best in class measurement plans to maximize our learnings. Gather data & insights for regular performance and business reviews. Lead efforts to consolidate market feedback across multiple touchpoints to inform future business and product roadmap decisions. Support inventory management for individual SKUs, new SKUs, and end-of-life initiatives.", "company": "meta", "url": "https://www.metacareers.com/jobs/989411759566796"}