{"title": "Software Engineer, Computer Vision", "level": "", "location": "Burlingame, CA", "description": "Join the XR Eyes team at Meta, where we develop cutting-edge Eye Tracking technology. Our solution is revolutionizing how people interact in AR and VR, as well as enable significant improvements to the display and optics designs. We are looking for an exceptional Software Engineers with Computer Vision background to join our team. As we continue to push the boundaries of what's possible in AR and VR, we invite you to be a part of this exciting journey and make a meaningful impact on the future of these technologies.", "salary": "US$85.10/hour to US$251,000/year + bonus + equity + benefits", "key_qualifications": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Skilled in writing efficient and maintainable C++ code. Experience developing Computer Vision algorithms and systems. Experience in designing real-time applications and API layers. Experience developing delightful user-facing applications. Experience communicating effectively.", "preferred_qualifications": "Master's degree or PhD in Computer Science, Computer Engineering or similar relevant discipline. Experience in developing applications for AR or VR devices. Coding skills in C#. Experience developing 3D applications in Unity or Unreal engines. Knowledge of and/or experience working with display rendering pipelines.", "responsibilities": "In this role you'll be transforming fundamental Computer Vision technology (Eye-Tracking) into delightful user experiences. You will use your system design experience to develop system design plan. You will also use your knowledge and understanding of computer vision to extract the right signal from the eye-tracking engine, design API layers, propagate right signals across APIs, and build applications that will meaningfully improve AR/VR devices functionality and user experiences. This role will entail collaboration across multiple teams and disciplines (computer vision, graphics, UX). You will act as a Tech Lead setting technical direction for the project and coordinating across multiple stakeholders. Therefore great communication is must have for this role.", "company": "meta", "url": "https://www.metacareers.com/jobs/990702169500969"}