{"title": "Postdoctoral Researcher, Reinforcement Learning (PhD) - Paris", "level": "", "location": "Paris, France", "description": "Meta is seeking a Postdoctoral Researcher to join a reinforcement learning team at FAIR, our world-class research lab. We are seeking individuals to work with our reinforcement learning team to build novel algorithms grounded in solid principles that can scale to efficiently solve complex real-world problems. Our research spans different aspects of reinforcement learning with particular focus on unsup/self-supervised RL to build behavioral foundation models. The candidate should have a solid background in machine learning and reinforcement learning, with experience in building and managing complex reinforcement learning pipelines at scale.", "salary": "", "key_qualifications": "Currently has or is in the process of obtaining a PhD degree or completing a postdoctoral assignment in the field of Computer Science or similar. Degree must be completed prior to joining Meta. Effective programming skills. Solid background on the foundations of reinforcement learning. Experience in working on complex machine learning code bases at scale. Experience collaborating within a research team to solve complex problems. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment.", "preferred_qualifications": "First-authored publications at peer-reviewed conferences (ICML, ICLR, NeurIPS, CoRL, ICRA, AAAI, AAMAS or similar). Demonstrated machine learning experience in one of the following: internship, open-source activity, data science competitions. Experience in creating high-performance implementations in deep learning frameworks (such as pytorch, tensorflow), C, C++, Python Experience working and communicating cross functionally in a team environment. Experience solving complex problems and comparing alternative solutions, tradeoffs, and diverse points of view to determine a path forward. Experience working and communicating cross functionally in a team environment.", "responsibilities": "Collaborate with the research supervisor and the team to devise novel behavioral foundation models that enable agents to solve a wide range of problems with little to no retraining. Design and implement algorithms, train state of the art models on large data, and evaluate their performance. Share research advancements through publications, libraries, models, or demos.", "company": "meta", "url": "https://www.metacareers.com/jobs/992324862545609"}