{"title": "Global Supplier Operations Program Manager", "level": "", "location": "Los Angeles, CA | Austin, TX | Menlo Park, CA", "description": "Meta is searching for a Global Supplier Operations Program Manager to facilitate and support supplier-related initiatives at Meta. This individual will work collaboratively with key stakeholders in Legal, Finance, Enterprise Products, Internal Audit, across Source-to-Pay (Sourcing, Procurement Operations, Contracts Operations), and numerous Meta business teams. The successful candidate will be responsible for managing complex projects related to our global supplier operations network, ensuring that all projects are delivered on time and suppliers meet Meta’s expectations. This includes helping drive the roadmap, processes, tools, reporting, policies and metrics throughout the lifecycle of the supplier relationship, including developing and implementing risk mitigation plans for Meta’s key supplier relationships and our internal processes. This person must be able to thrive in a flat, fast-moving organization using creative ideas and quick iterations to make a significant impact.", "salary": "US$111,000/year to US$162,000/year + bonus + equity + benefits", "key_qualifications": "B.A. or B.S. degree in business, supply chain, procurement, finance or related discipline; 5+ years of experience in Strategic Supplier Relationship Management, Supplier Performance Management, Third-Party Risk Management, Project/Process Management, Sourcing, or Procurement; Experience evaluating supplier-related performance management solutions and developing and implementing process improvements; Experience in evaluating, developing, and implementing supplier-related performance management solutions; Knowledge of supply chain management principles and practices, including sourcing, procurement, logistics, and their related tooling; Experience driving communication and negotiations with the experience building relationships with suppliers and internal stakeholders", "preferred_qualifications": "Advanced degree", "responsibilities": "Build and foster cross-functional relationships and proactively engage stakeholders to drive adoption of policies, processes and tools. Develop a deep understanding of operational constraints/barriers to process adoption and troubleshoot and improve related processes to reduce risk. Support cross-functional initiatives by conducting research and analysis to identify the root cause of problems and developing optimized solutions to enhance tooling/infrastructure, processes and workflows and strengthen supplier-related performance. Manage both internal and external complex projects related to Source-to-Pay operations, including supplier selection, contract negotiation, performance management. Develop and implement project plans to ensure stakeholder alignment throughout the project life-cycle. Conduct regular project status updates and progress reports with management highlighting any areas of risk and possible mitigation solutions. Collaborate with cross-functional teams, including sourcing, procurement, contract operations, and engineering products, to ensure all project deliverables are met and all stakeholders are satisfied with the outcomes. Ensure compliance with all relevant laws, regulations, and company policies related to suppliers and procurement operations. Provide training and support to internal teams on project management best practices and procedures.", "company": "meta", "url": "https://www.metacareers.com/jobs/992735675502242"}