{"title": "Marketing Sciences Partner", "level": "", "location": "Tel Aviv, Israel", "description": "The Marketing Science team at Meta in Israel is actively seeking a full-time, Marketing Science Partner based in Tel Aviv.\n\nIn Marketing Science, our mission is to help all businesses grow by transforming marketing practices grounded in data and science. We are specifically looking for a candidate with strong analytical and critical thinking skills and a passion for generating data-driven insights. You should have talent for taking complex concepts and distilling them into clear accessible formats. This role will challenge you to not only provide strategic direction to advertisers on their measurement efforts, but also to develop strategic insights for marketers.", "salary": "", "key_qualifications": "4+ years’ experience in research, analytics, or ad effectiveness.\nA bachelor’s degree in a quantitative field\nYou have experience building connections with customers and team members through effective communication and collaborating cross-functionally\nYou have experience inspiring action based on data-driven insights including influencing advertiser planning and buying behavior.\nYou have a track record of operating independently, demonstrating creativity, being detail-oriented, and delivering results in a highly organized manner.", "preferred_qualifications": "An advanced degree in psychology, statistics, economics, behavioral or social science or a related field.\nYou have an understanding of online advertising and familiarity with branding and performance advertising and marketing frameworks, including ad effectiveness measurement techniques.\nYou have experience with statistical analysis, including but not limited to experimental design, modeling, or advertising research.\nYou are comfortable communicating complex topics to a non-technical audience.\nYou have experience in scaling data-based insights and learnings to broad audiences through appropriate channels.", "responsibilities": "You will work with a broad array of Facebook advertisers in measuring true business value and growing their businesses through Facebooks' ad platforms.\nYou will engage in client conversations, presentations of results and partner internally with cross functional and specialist teams to advise on marketing best practices using evidence based insights.\nYou will consult with clients and agencies on products and solutions for different needs and challenges as it pertains to media, marketing, or key measurement questions.\nYou will deliver training/education for internal and external audiences through dedicated sessions, webinars, and events.\nWhere appropriate, you will look to scale learnings and insights from your work with clients or through research to the appropriate internal/external audiences.\nAs opportunities arise, you will execute and/or lead key proactive programs that will help grow our advertisers' businesses (in partnership with product marketing and sales teams).", "company": "meta", "url": "https://www.metacareers.com/jobs/994027265591544"}