{"title": "Security Software Developer - Integrity Investigations, Intelligence, and Events", "level": "", "location": "Bellevue, WA", "description": "The Threat Scaling team within the Integrity Investigations, Intelligence and Events organization provides usable, scalable, and reliable engineering solutions to a group of teams that protect people on Meta's platforms by deeply understanding complex and emerging threats in the world, on the Internet, and on our platforms. Are you passionate about protecting the most vulnerable populations who use our platforms by building engineering solutions? Do you thrive in cross-functional and collaborative environments? Then, join our team to help us make the world a safer place where people can be more open and connected!", "salary": "US$143,000/year to US$208,000/year + bonus + equity + benefits", "key_qualifications": "4+ years experience writing production level code in OOP languages, e.g. PHP, C/C++, etc. Experience working on or contributing to engineering solutions in the Trust and Safety space. Bachelor's degree or equivalent experience in Software Engineering, or a related field. Proven communication skills and high attention to detail", "preferred_qualifications": "M.S. or PhD in Computer Science or related field, or equivalent experience. Experience working with and manipulating data to inform designs and engineering solutions. Experience as a software developer in the Trust and Safety space. Time management, organizational skills and self-motivation. Experience in system, network, and/or application security. Experience contributing to the security community (public research, blogging, presentations, open source contributions, etc.)", "responsibilities": "Design, develop and improve on technical products and capabilities used to facilitate security and intelligence investigations. Work closely with security investigators and intelligence analysts to identify process improvements and countermeasures to stop or prevent abuse. Manage multiple projects at once while effectively prioritizing time based on team and org priorities. Proven attention to details and experience to thrive in an unstructured and \"move fast” environment. Partner with other engineering teams to provide holistic solutions to surfacing and responding to emerging threats. Code using primarily PHP, React, C/C++, and Python (or equivalent language) including code maintenance and review.", "company": "meta", "url": "https://www.metacareers.com/jobs/994345258681375"}