{"title": "IT-Creative", "summary": "Ami lavorare a contatto con le persone? Nel ruolo di Creative, condividerai la tua conoscenza per liberare la creatività sia di chi entra in store per la prima volta sia di clienti abituali. Sarai il pilastro dell’ambiente accogliente dell’Apple Store, un luogo che invita le persone a condividere le idee e a scoprire come dar vita alle intuizioni. Lavorerai con persone esperte che desiderano mettere a disposizione le loro competenze tanto quanto acquisirne di nuove. Proverai la soddisfazione di dare ai clienti gli strumenti per creare qualcosa di meraviglioso. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio.\n\nSono disponibili posizioni part-time e full-time.", "description": "Come Creative, il tuo compito principale all’Apple Store è quello di offrire formazione, sia in piccoli gruppi che in percorsi individuali. Ricorrerai alle tue abilità di presentazione per agire come guida, aiutando gli utenti a configurare i dispositivi, imparare e diventare autonomi.  Oltre che parlare, sai ascoltare, e ti prendi il tempo necessario a capire le aspettative di ogni cliente.  Adattando il tuo stile di insegnamento al livello dell’utente, gestirai con efficienza il tuo tempo e il suo apprendimento. Sei consapevole che l’acquisto di un nuovo prodotto può aiutare ogni cliente a raggiungere i suoi obiettivi. Al lavoro, passerai gran parte del tuo tempo guidando sessioni programmate, ma resterai disponibile a interagire con i clienti in store tra una sessione e l’altra. Con orgoglio arricchirai la vita di clienti e colleghi attraverso uno stile didattico tipicamente Creative.", "key_qualifications": "", "preferred_qualifications": "Passione per l’istruzione e capacità di insegnare a ogni utente lasciando che provi a fare per conto proprio.\nAbilità di insegnare a piccoli gruppi e a più clienti contemporaneamente.\nRisolutezza nell’aiutare l’utente affinché tragga il meglio dal suo dispositivo.\nCapacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare.\nCapacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente.\nHai dimestichezza nella vendita e nell’insegnamento, e sai aiutare i membri del tuo team quando necessario.\nDimostri motivazione e autonomia, e sai rispettare un programma di training rigidamente strutturato.\nSei in grado di consigliare altre opzioni di supporto all’interno dello Store, come i servizi business e il Genius Bar.\nOttima conoscenza della lingua locale.\nDevi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438086"}