{"title": "AT-Business Expert (m/w/x)", "summary": "Im Apple Store informierst du Geschäftsleute und Unternehmer, wie sie Apple Lösungen erfolgreich in ihre Arbeitsabläufe integrieren können. Als Business Expert hilfst du ihnen, Apple Produkte genauer kennenzulernen und ihre vielfältigen Möglichkeiten zu entdecken. Du bist Teil eines Teams, das sich leidenschaftlich dafür einsetzt, Businesskunden auf Erfolgskurs zu bringen. Es bereitet dir große Freude, jedem Kunden leistungsstarke, innovative Lösungen anzubieten. Denn dich begeistern unsere Lösungen und du weißt genau, was Unternehmen brauchen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können.", "description": "Als Business Expert stellst du unseren Kunden Lösungen, Technologien und Services von Apple vor. Im Verkauf triffst du neue und aktuelle Businesskunden und lernst ihre Wünsche und Bedürfnisse kennen. Du knüpfst neue Kontakte und baust Beziehungen auf  am Telefon oder bei Workshops und Events im Apple Store. Bei Briefings erkennst du die Bedürfnisse der Kunden und arbeitest mit dem Business Team zusammen, um passende Angebote vorzubereiten und zu präsentieren. Bei komplexeren Anforderungen erarbeitest du gemeinsam mit dem gesamten Business Team die perfekte Lösung. Und nicht zuletzt informierst du Kunden über die gesamte Palette der Optionen im Bereich Sales Support und bietest diese an. Indem du Kunden dazu anregst, über die Möglichkeiten von Apple Technologien in ihren Unternehmen nachzudenken, trägst du nicht nur zum Erfolg von Apple, sondern auch zum Erfolg unserer Kunden bei.", "key_qualifications": "", "preferred_qualifications": "Wissen und Verständnis, wie Unternehmen moderne Technologien nutzen und was Apple Lösungen ihnen bieten können. Souveränes Interagieren mit Kunden und Positionieren von Businesslösungen per Telefon. Durchführung von Briefings, Workshops und Events im Apple Store, um Businesskunden inspirierende Erfahrungen zu ermöglichen. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du hast Verkaufserfahrung im Businesskundenbereich. Du stellst gerne telefonisch Kontakt zu potenziellen Kunden her. Du zeichnest dich durch ausgeprägte Sozial- und Präsentationskompetenz sowie erstklassige Kommunikationsfähigkeiten in Wort und Schrift aus. Flexible Arbeitszeiten sind kein Problem für dich. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig. Das Bruttojahresgehalt für eine Vollzeitstelle beträgt gemäß dem anzuwenden Kollektivvertrag mindestens €31,206. Das tatsächliche Gehalt orientiert sich an branchenüblichen Gehältern, deinen Qualifikationen und Erfahrungen.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438331"}