{"title": "AU - Specialist: Full-Time or Part-Time, Permanent or Temporary", "summary": "Do you love how it feels to help others? The Apple Store is dedicated to delivering a customer experience that’s unlike any other. As a Specialist, it starts with you discovering customers’ needs. And with the support of your store team members, you match those needs with the right products. Every day is an opportunity for you to turn another Apple Store visitor into a loyal Apple customer. You work with others to foster a culture where everyone belongs and is inspired to do their best work. In this role, you could work full-time, part-time, or part-time temporary.", "description": "As a Specialist, you’ll become highly skilled at uncovering customers’ needs, then following through with meaningful solutions. Not only are you the first person customers meet when they enter the store, but you’ll be the person who guides them — advising, selling, and even setting up their new products. You perform other roles within the store too, whether it’s maintaining visual merchandising or assisting team members. Always curious, you stay on top of news about products and initiatives, ready to apply your learning in customer interactions. You’ll be provided with training to be successful. Your success is measured by team and individual productivity as well as overall store performance. You’re proud to represent Apple, and you get great satisfaction from helping customers develop lifelong relationships with Apple.  Discover even more benefits of doing what you love. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education, and give you special employee pricing on Apple products.  Note: Apple benefits programs vary by country and are subject to eligibility requirements.", "key_qualifications": "", "preferred_qualifications": "You have agility to learn new products and features with an interest in technology, particularly Apple products. Ability to deliver great customer experiences in any environment and to be invigorated by constant personal interaction. Strong communication skills that let you converse as freely and comfortably with small groups as with individual customers. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You’re passionate about Apple and eager to share that passion with others. You’re willing to learn and embrace Apple’s unique style of service. You have strong people skills — you’re approachable, a good listener and empathetic. Your work hours will be based on your availability and business needs and may vary week to week.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114437991"}