{"title": "NL - Specialist: fulltime, parttime en tijdelijk parttime", "summary": "Als Specialist help je mee om een dynamische en enthousiaste sfeer rond onze producten te creëren. Je draagt de juiste oplossingen aan en bent de schakel tussen het product en de klant. Je beseft dat klanten in de Apple Store een ongeëvenaarde dienstverlening moeten genieten. Hiervoor verdiep je je om te beginnen in wat de klant wil. En met de hulp van de andere teamleden in de winkel zoek je daar de juiste producten bij. Elke dag heb je de kans om van iemand die de Store binnenloopt een trouwe Apple klant te maken. Je creëert samen met anderen een cultuur waar alle medewerkers welkom zijn en hun werk optimaal kunnen doen. In deze functie kun je fulltime, parttime of tijdelijk parttime werken.", "description": "Als Specialist versta je de kunst om te achterhalen wat de klant precies wil en daar het juiste product bij te vinden. Je bent niet alleen de eerste medewerker die de klanten bij binnenkomst treffen, maar je bent ook degene die hen begeleidt: je geeft advies, verkoopt producten en helpt hen zo nodig ook op weg met hun aankoop. Je vervult ook andere taken, zoals het aantrekkelijk presenteren van de producten in de winkel en het assisteren van andere teamleden. Met je nieuwsgierige instelling ben je altijd op de hoogte van het laatste nieuws over producten en initiatieven en kun je die kennis direct toepassen in het contact met de klant. Je succes uit zich in de productiviteit van het team en van jou als individu en komt ook terug in de resultaten van de winkel als geheel. Je bent er trots op om voor Apple te werken en het geeft je veel voldoening om klanten te helpen een duurzame relatie met Apple aan te gaan.", "key_qualifications": "", "preferred_qualifications": "In staat om in een zeer levendige omgeving een unieke dienstverlening te bieden en je te laten inspireren door constante persoonlijke interactie. Een grote interesse in technologie, in het bijzonder in Apple producten, en het vermogen om je snel de kennis over nieuwe producten en functies eigen te maken. Goede communicatieve vaardigheden, waardoor je net zo gemakkelijk met kleine groepen als met afzonderlijke klanten een gesprek voert. Bijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn. De waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden. Je bent enthousiast over Apple en wilt dat enthousiasme graag overbrengen op anderen. Je bent bereid om de unieke stijl van dienstverlening van Apple te leren kennen en in de praktijk te brengen. Je kunt goed met mensen omgaan: je staat open voor anderen, je kunt goed luisteren en je kunt je inleven in anderen. Je beheerst de lokale taal uitstekend. Je zult je flexibel moeten opstellen wat je werktijden betreft. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438119"}