{"title": "TR-Bilirkişi", "summary": "Apple Store olağanüstü bir müşteri deneyimi yaşatmaya odaklanmış, benzersiz bir mağaza ortamıdır. Bir Bilirkişi olarak, müşterilerinize Apple'ın heyecan verici dünyasını tanıtır ve meraklı ziyaretçileri sadık müşterilere dönüştürürsünüz. Müşterileriniz ile olduğu kadar ekip üyelerinizle olan etkileşiminiz de  sizi geliştirir. İnsanların Apple'la ömür boyu sürecek bir ilişki geliştirmelerine her gün yardımcı olmak sizi çok mutlu eder. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız. Tam zamanlı ve yarı zamanlı çalışma olanakları mevcuttur.", "description": "Bilirkişi olarak satış, ürün bilgisi ve çözümler konularında lider sizsiniz ve müşterilerinizle iyi ilişkiler kurmada beceriklisiniz. Müşterilerin meraklarını yoğun bir ilgiye ve satın almaya nasıl dönüştüreceğinizi bilirsiniz. Yeni ürünler çıktığında ilk öğrenen, ekip üyeleriyle ilk paylaşan siz olursunuz. Ekip üyelerine yaklaşımınız ve eylemlerinizle ilham verirsiniz. Belirlenen performans hedeflerine her zaman ulaşır ve hatta bu hedeflerin ötesine geçersiniz. Apple'ı temsil etmekten gurur duyar ve müşterilerinizle her temasınızda bunu hissettirirsiniz.", "key_qualifications": "", "preferred_qualifications": "Teknoloji, özellikle de Apple ürünleri konusunda kanıtlanmış yeterlilik ve yeni ürünleri hızla öğrenebilir olmak\nMüşteri sadakatini geliştirmekte olduğu kadar satış ve teknolojik çözümler konusunda da iş tecrübesine sahip olmak\nHer koşulda, sürekli mükemmel bir müşteri deneyimi sunabilme konusunda yetenekli olmak\nFarklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur\nGünün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler\nApple için heyecan duyan ve başkalarını Apple'ın sunduğu her konuda eğiten, ilham veren bir lider olmak\nKonuşmalarınız ve hareketlerinizle Apple'ın benzersiz hizmet tarzının standardının korunmasını sağlamak\nİnsan ilişkileri güçlü; canayakın, iyi bir dinleyici ve empati kurabilen bir lider olmak\nUzman ekip için etkili bir rol model olmak.\nEsnek çalışma saatlerine uyum sağlayabilmek; çalışma saatleriniz işin ihtiyaçlarına bağlı olacaktır.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438165"}