{"title": "MX-Especialista: Tiempo completo, medio tiempo y medio tiempo temporalmente.", "summary": "Como Especialista, ayudas a crear energía y emoción en torno a los productos de Apple, al brindar las soluciones adecuadas y poner los productos en manos de los clientes. Comprendes que el Apple Store está dedicado a entregar una experiencia al cliente inigualable. Todo empieza cuando descubres las necesidades del cliente. Y con la ayuda del equipo de tu tienda, logras cubrir estas necesidades con los productos correctos. Todos los días tienes la oportunidad de convertir a quienes visitan un Apple Store en clientes leales de Apple. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo. En este puesto, puedes trabajar tiempo completo, medio tiempo o medio tiempo temporalmente (cinco meses o menos).", "description": "Como Especialista, debes estar altamente capacitado para descubrir las necesidades de los clientes y dar seguimiento con soluciones brillantes. No solo eres la primera persona con la que se encuentran los clientes al entrar a la tienda, sino que también eres la persona que los guía al asesorar, vender e incluso configurar sus nuevos productos. También tienes otras funciones en la tienda, como estar a cargo de la comercialización visual o ayudar a otros miembros de tu equipo. Siempre con curiosidad, te mantienes al tanto de las noticias sobre productos e iniciativas, listo para aplicar tus conocimientos en la interacción con el cliente. Tu éxito se mide por la productividad individual y de tu equipo, así como también por el desempeño general de la tienda. Estás orgulloso de representar a Apple, y te encanta ayudar a que los clientes desarrollen relaciones permanentes con Apple.", "key_qualifications": "", "preferred_qualifications": "Gran interés por la tecnología, en particular por los productos de Apple, y agilidad para aprender sobre nuevos productos y características. Capacidad para brindar experiencias únicas al cliente en cualquier entorno, y gran pasión por la interacción constante con personas. Excelentes habilidades de comunicación que te permiten conversar libre y cómodamente con grupos pequeños y con clientes individuales. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Te apasiona Apple y quieres compartir tu pasión con el mundo. Estás dispuesto a aprender y seguir los estándares detrás del estilo de servicio único de Apple. Tienes grandes habilidades para interactuar con personas, eres accesible, sabes escuchar y eres empático. Debes tener flexibilidad de horarios. Tus horas de trabajo dependen de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438297"}