{"title": "NL-Business Expert", "summary": "Jij bent in de Apple Store de schakel tussen zakelijke klanten en de Apple oplossingen die zij in hun bedrijf kunnen gebruiken. Als Business Expert informeer je ze over Apple producten en zet je de verschillende mogelijkheden uiteen. Je maakt deel uit van een team dat bedrijven graag helpt op de weg naar succes. Met jouw inzicht in de behoeften van de zakelijke markt en je enthousiasme voor Apple maak je klanten graag blij met krachtige, innovatieve oplossingen. Je creëert samen met anderen een cultuur waar alle medewerkers welkom zijn en hun werk optimaal kunnen doen.", "description": "Als Business Expert laat je zakelijke klanten kennismaken met de oplossingen, technologie en dienstverlening van Apple. Je staat in de Store om nieuwe en bestaande zakelijke klanten te woord te staan en te horen waaraan ze behoefte hebben. Via de telefoon en door middel van workshops en events in de Store leg je contacten met potentiële klanten en bouw je relaties op. Je stelt tijdens Briefings vast wat de klant nodig heeft en stelt samen met het Business-team voorstellen op. Voor klanten met complexe wensen denk je met het gehele Business-team de ideale oplossing uit. Tot slot informeer je klanten over alle beschikbare ondersteuningsopties. Door klanten te laten meedenken over de mogelijkheden van Apple technologie in hun bedrijf lever je een bijdrage aan het succes van je team én dat van de klant.", "key_qualifications": "", "preferred_qualifications": "Inzicht in de toepassing van technologie in bedrijven en in de rol die de oplossingen van Apple daarbij kunnen spelen\nGoede telefonische vaardigheden voor de communicatie met klanten en het aanbieden van zakelijke oplossingen\nIn staat om zakelijke klanten te enthousiasmeren door middel van briefings, workshops en events in de Store\nBijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn\nDe waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden\nJe hebt ervaring als B2B-verkoper.\nJe pakt gemakkelijk de telefoon om veelbelovende leads uit te bouwen.\nJe hebt goede contactuele eigenschappen en presentatievaardigheden en kunt je schriftelijk en mondeling uitstekend uitdrukken.\nJe beheerst de lokale taal uitstekend.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438109"}