{"title": "DE-Expert (m/w/x)", "summary": "Der Apple Store ist eine Einzelhandelsumgebung wie keine andere, denn wir legen größten Wert darauf, unseren Kunden ein inspirierendes Kundenerlebnis zu bieten. Als Expert führst du die Kunden in die faszinierende Welt von Apple ein und verwandelst neugierige Besucher in loyale Kunden. Bei der Interaktion mit Teammitgliedern und Kunden läufst du zu Höchstform auf. Und es erfüllt dich mit großer Zufriedenheit, Tag für Tag Menschen dabei zu helfen, lebenslange Beziehungen zu Apple aufzubauen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Expert bist du äußerst kompetent, was Verkauf, Produktwissen und Lösungen anbelangt, und dein Engagement für unsere Kunden ist vorbildlich. Aber du weißt auch, wie man mit Kunden umgeht, um anfängliche Neugier in starkes Interesse zu verwandeln, das schließlich zum Kauf führt. Du erfährst als Erster von neuen Produkten und Initiativen und teilst Wissen und Inspiration mit den Mitgliedern deines Teams, die dich als zugänglichen und hilfsbereiten Kollegen schätzen. Du erreichst die vorgegebenen Leistungsziele immer und übertriffst sie oftmals sogar. Du bist stolz darauf, Apple zu repräsentieren, und bringst das in all deinen Interaktionen mit Kunden zum Ausdruck.", "key_qualifications": "", "preferred_qualifications": "Hohe technische Kompetenz, insbesondere bei Apple Produkten, und die Fähigkeit, den Umgang mit neuen Produkten schnell zu erlernen. Erfahrung im Verkauf und mit Technologielösungen sowie beim Aufbau von Kundentreue. Fähigkeit, konsistent und in jeder Situation für ein hervorragendes Kundenerlebnis zu sorgen. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du liebst es, deine Leidenschaft für Apple Produkte mit anderen zu teilen und sie über alles zu informieren, was Apple zu bieten hat. Du legst den Standard für den einzigartigen Apple Servicestil durch Wort und Taten fest. Du zeichnest dich durch ausgeprägte Sozialkompetenzen aus – du bist hilfsbereit, einfühlsam und kannst gut zuhören. Du dienst als Vorbild für Specialists. Am Standort kommunizierst du fließend in der dortigen Landessprache. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438035"}