{"title": "MO-Specialist: Full Time or Part Time, Permanent or Temporary", "summary": "Do you love how it feels to help others? The Apple Store is dedicated to delivering a customer experience that’s unlike any other. As a Specialist, it starts with you discovering customers’ needs. And with the support of your store team members, you match those needs with the right products. Every day is an opportunity for you to turn another Apple Store visitor into a loyal Apple customer. You work with others to foster a culture where everyone belongs and is inspired to do their best work. In this role, you could work full-time, part-time, or part-time temporary.", "description": "As a Specialist, you’re highly skilled at uncovering customers’ needs, then following through with enlightening solutions. Not only are you the first person customers meet when they enter the store, but you’re also the person who guides them — advising, selling, and even setting up their new products. You perform other roles within the store too, whether it’s maintaining visual merchandising or assisting team members. Always curious, you stay on top of news about products and initiatives, ready to apply your learning in customer interactions. Your success is measured by team and individual productivity as well as overall store performance. You’re proud to represent Apple, and you get great satisfaction from helping customers develop lifelong relationships with Apple. ", "key_qualifications": "", "preferred_qualifications": "You have agility to learn new products and features with an interest in technology, particularly Apple products. Ability to deliver great customer experiences in any environment and to be invigorated by constant personal interaction. Strong communication skills that let you converse as freely and comfortably with small groups as with individual customers. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You have excellent time management skills and can make decisions quickly. You maintain composure and customer focus while troubleshooting and solving issues. You reassure customers when delivering product diagnoses and potential solutions. You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438282"}