{"title": "BE-Technical Specialist", "summary": "Do you love how it feels to help others? After customers purchase our products, you’re the one who helps them get more out of their new Apple technology. Your day in the Apple Store is filled with a range of focused support and service tasks. Whether you’re helping customers get started with the Mac or finding answers to their questions about other Apple devices, you’re ready to share knowledge and provide exceptional assistance. You gain satisfaction from bringing resolution and insight to each customer, elevating his or her relationship with Apple to the next level. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As a Technical Specialist, you help new owners get started and current ones get quick, efficient support — developing strong, positive relationships with Apple. When a customer needs assistance, you quickly assess their situation. Sometimes you take care of customers with advice or a solution on the spot, using your knowledge of current Apple technology to help with iPod, iPhone, and iPad devices. At other times, you refer customers to support team members who get them up and running again. You even provide personal training for new customers, helping them acquire the basic skills they need to get started on photo, video, and music projects. The entire store team benefits from your commitment to providing the best care for customers. By helping Apple maintain strong relationships with customers, you are instrumental to our success.", "key_qualifications": "", "preferred_qualifications": "Ability to assess customers’ support needs when they arrive, then provide solutions or refer them to other team members, Flexibility to regularly rotate through different technical specialties and skill sets, Ability to thrive on change as products evolve, Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn., Demonstrate Apple’s values of inclusion and diversity in daily activities., You're passionate about Apple and eager to share that passion with others., You're willing to learn and embrace the guidelines behind Apple's unique style of service., You have strong people skills-you're approachable, a good listener, and empathetic., You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438250"}