{"title": "UAE-Creative", "summary": "Do you have a passion for connecting with other people? As a Creative, you inspire creativity by sharing your knowledge with Apple Store visitors — first-timers or longtime loyal customers alike. You’re the foundation of the Apple Store’s welcoming environment that invites individuals to share their ideas and learn how to bring their visions to life. Those who work alongside you are knowledgeable teammates just as eager to share their skills as they are to learn more. Nothing gives you a greater thrill than empowering a customer to create something wonderful. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As a Creative, your main role at the Apple Store is that of instructor, whether guiding small groups to learn or helping individuals. You use your presentation skills to act as a facilitator, helping users get set up, get trained, and get going. But you're also an excellent listener, taking the time to understand what each user hopes to achieve or learn. By adjusting your teaching style to each user's individual skill level, you maximize their understanding and your own time. You recognize that purchasing a new product can sometimes help customers attain their goals. You spend much of your time leading scheduled sessions, but you're still comfortable interacting with store customers between those sessions. You're proud to enrich the lives of others  - whether customers or team members  - through teaching, in the way only a Creative can.", "key_qualifications": "", "preferred_qualifications": "Passion for education and ability to instruct by letting users learn by doing. Ability to teach small groups and multiple customers simultaneously. Tenacity to work with users to help them get the most out of their devices. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You’re comfortable selling as well as teaching, helping your team members out as needed. You’re self-motivated and self-directed, and can adhere to a tightly structured training schedule. You can be adept at recommending other in-store support options, such as business services and the Genius Bar. Multilingual ability is a plus. You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438217"}