{"title": "AT-Technical Specialist (m/w/x)", "summary": "Nachdem Kunden unsere Produkte gekauft haben, hilfst du ihnen als Service Specialist dabei, noch mehr aus den neuen Apple Technologien herauszuholen. Dein Tag im Apple Store ist ausgefüllt mit zielgerichtetem Support und vielfältigen Aufgaben im Kundenservice bei Retail. Du gibst dein Wissen gern weiter und leistest herausragende Unterstützung – egal, ob du Kunden die ersten Schritte mit dem Mac zeigst oder Fragen zu anderen Apple Geräten beantwortest. Es bereitet dir Freude, jedem Kunden Anregungen und Einblicke zu geben und so seiner Beziehung zu Apple eine neue Qualität zu verleihen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Technical Specialist hilfst du neuen Kunden beim Ausprobieren ihrer Produkte und unterstützt geübte Benutzer schnell und effizient. So förderst du eine starke, positive Beziehung zu Apple. Wenn ein Kunde Hilfe benötigt, erfasst du sofort den Sachverhalt. In einigen Fällen gibst du Kunden gleich Ratschläge oder schlägst basierend auf deinem Wissen über die aktuelle Apple Technologie eine passende Lösung vor, um ihnen beim Umgang mit iPod, iPhone und iPad zu helfen. In anderen Fällen verweist du Kunden an Mitglieder des Supportteams, die sich dann weiter um sie kümmern. Zudem führst du persönliche Trainings für neue Kunden durch und unterstützt sie dabei, sich Grundfertigkeiten anzueignen, die sie für den Einstieg in Foto-, Video- und Musikprojekte benötigen. Das gesamte Team im Store profitiert von deinem Engagement, Kunden den bestmöglichen Service zu bieten. Durch den Aufbau beständiger Kundenbeziehungen trägst du entscheidend zu unserem Erfolg bei.", "key_qualifications": "", "preferred_qualifications": "Fähigkeit, den Supportbedarf der Kunden bei ihrem Eintreffen im Store einzuschätzen und ihnen dann passende Lösungen anzubieten oder sie an andere Teammitglieder weiterzuverweisen. Flexibilität, regelmäßig zwischen verschiedenen technischen Bereichen und Anforderungen zu wechseln. Fähigkeit, die Veränderungen bei weiterentwickelten Produkten schnell zu verinnerlichen. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du kannst deine Zeit optimal einteilen und schnell Entscheidungen treffen. Beim Beheben von Fehlern und Lösen von Problemen bleibst du gelassen und kundenorientiert. Du gibst Kunden ein beruhigendes Gefühl, wenn du ihnen Produktdiagnosen präsentierst und mögliche Lösungen vorschlägst. Flexible Arbeitszeiten sind kein Problem für dich. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig. Das Bruttojahresgehalt für eine Vollzeitstelle beträgt gemäß dem anzuwenden Kollektivvertrag mindestens €29,736. Das tatsächliche Gehalt orientiert sich an branchenüblichen Gehältern, deinen Qualifikationen und Erfahrungen.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438339"}