{"title": "FR-Genius", "summary": "À l'Apple Store, c'est à vous qu'il incombe de préserver la confiance des clients dans la technologie Apple, en diagnostiquant les problèmes et en réparant les produits. Votre capacité à résoudre les problèmes et vos qualités relationnelles garantissent aux clients du Genius Bar une résolution rapide de leurs problèmes techniques. Par ailleurs, vous informez les membres de l'équipe sur les produits, tout en veillant à actualiser en permanence votre savoir-faire technique, de façon autonome. Grâce à un sens aigu du service et à une nature bienveillante, vous prodiguez chaque jour des conseils et une assistance hors pair, dignes d'un Genius. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même. Des postes à temps partiel et à temps plein sont disponibles.", "description": "En tant que Genius, vous prodiguez de façon amicale des conseils avisés et une assistance technique pratique aux clients Apple qui en ont besoin. Sur place, vous diagnostiquez rapidement les problèmes affectant les produits, en expliquant chaque situation avec patience et empathie. Après avoir déterminé si une réparation est possible ou s'il faut prévoir un remplacement, vous proposez des solutions qui permettront aux utilisateurs d'être à nouveau opérationnels dans les plus brefs délais. Même si vous avez affaire à plusieurs clients à la fois, vous restez conscient de leurs contraintes de temps, ainsi que des vôtres. Vous remplissez la mission de service que s'est fixée Apple avec élégance, rapidité et talent. Vous gagnez la confiance à la fois des clients et de vos collègues en transmettant conseils, connaissances, astuces et formations.", "key_qualifications": "", "preferred_qualifications": "Fortes qualités relationnelles et don naturel pour résoudre les problèmes. Capacité à garder son calme et à rester à la disposition des clients tout en diagnostiquant et en résolvant des problèmes techniques. Capacité à se plier à un emploi du temps déterminé par les rendez-vous des clients. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre des activités quotidiennes. Vous avez une aptitude à acquérir rapidement des compétences dans le domaine des réparations techniques et faites preuve d'une véritable soif d'apprendre. Vous savez parfaitement gérer votre temps et prendre des décisions sur le vif. Vous parlez couramment la langue locale. Vous devez accepter une certaine souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438062"}