{"title": "BR-Expert", "summary": "A Apple Store é um ambiente de varejo inigualável, com foco exclusivamente em proporcionar experiências incríveis para o cliente. Como Expert, você apresentará aos clientes o mundo da Apple, transformando visitantes curiosos em clientes fiéis. Você deve gostar muito de interagir tanto com os membros da equipe quanto com os clientes. Além disso, você deve gostar muito de ajudar as pessoas a desenvolver relações duradouras com a Apple todos os dias. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas. Há vagas de período integral e meio período.", "description": "Como Expert, você será um líder de vendas, com conhecimentos sobre os produtos e soluções, e terá muita influência no relacionamento com os clientes. Você também precisa saber como transformar a curiosidade moderada de um cliente em um interesse mais profundo - e na compra. Com o surgimento de novos produtos e iniciativas, você deve ser o primeiro a saber, compartilhar e inspirar os membros da sua equipe usando acessibilidade e ação. Você sempre deve atingir, e às vezes superar, os objetivos de desempenho estabelecidos. Você deve ter orgulho de representar a Apple e deve demonstrar isso em todas as suas interações com os clientes.", "key_qualifications": "", "preferred_qualifications": "Proficiência comprovada em tecnologia, especialmente em produtos da Apple, e capacidade de aprender rapidamente sobre novos produtos. Experiência comprovada em soluções de vendas e tecnologia e na fidelização de clientes. Capacidade de proporcionar uma boa experiência ao cliente, sem importar qual seja a situação. Contribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender. Colocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias. Você deve ser apaixonado pela Apple e deve inspirar e ensinar as outras pessoas sobre tudo o que a Apple tem a oferecer. Você deve ser capaz de aplicar o estilo exclusivo de serviço da Apple com palavras e ações. Você deve ter talento com as pessoas: ser acessível, bom ouvinte e simpático. Você será um modelo para os especialistas.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438177"}