{"title": "US - Specialist: Full-Time, Part-Time, and Part-Time Temporary", "summary": "Do you love how it feels to help others? The Apple Store is dedicated to delivering a customer experience that’s unlike any other. As a Specialist, it starts with you discovering customers’ needs. And with the support of your store team members, you match those needs with the right products. Every day is an opportunity for you to turn another Apple Store visitor into a loyal Apple customer. You work with others to foster a culture where everyone belongs and is inspired to do their best work. In this role, you could work full-time, part-time, or part-time temporary.", "description": "As a Specialist, you’ll become highly skilled at uncovering customers’ needs, then following through with meaningful solutions. Not only are you the first person customers meet when they enter the store, but you’ll be the person who guides them — advising, selling, and even setting up their new products. You perform other roles within the store too, whether it’s maintaining visual merchandising or assisting team members. Always curious, you stay on top of news about products and initiatives, ready to apply your learning in customer interactions. You’ll be provided with training to be successful. Your success is measured by team and individual productivity as well as overall store performance. You’re proud to represent Apple, and you get great satisfaction from helping customers develop lifelong relationships with Apple.", "key_qualifications": "", "preferred_qualifications": "You have agility to learn new products and features with an interest in technology, particularly Apple products. Ability to deliver great customer experiences in any environment and to be invigorated by constant personal interaction. Strong communication skills that let you converse as freely and comfortably with small groups as with individual customers. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You're passionate about Apple and eager to share that passion with others. You're willing to learn and embrace the guidelines behind Apple's unique style of service. You have strong people skills-you're approachable, a good listener, and empathetic. Your work hours will be based on your availability and business needs and may vary week to week.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. Your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. For information about pay, if you are interested in roles located in one of our California, Colorado, Hawaii, New York, Washington, or Washington DC locations click here to select a store and view pay information. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438158"}