{"title": "ES-Creativo", "summary": "¿Te apasiona tratar con la gente? Como Creativo, promueves la creatividad compartiendo lo que sabes con quienes vienen al Apple Store, tanto si es su primera vez como si son clientes de siempre. Tu papel es fundamental para que el Apple Store sea un espacio acogedor que invita a todo el mundo a compartir sus ideas y a aprender cómo hacerlas realidad. Contigo trabajan personas con grandes conocimientos que tienen tantas ganas de compartir lo que saben como de seguir aprendiendo. Nada te entusiasma más que enseñar a un cliente a crear algo increíble. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí. Tenemos puestos a jornada parcial y completa.", "description": "Como Creativo, tu función principal en el Apple Store es enseñar tanto a grupos pequeños que están aprendiendo como a personas que necesitan ayuda. Aprovechas tus habilidades de presentación para impartir sesiones y ayudas a los usuarios a configurar sus productos, descubrirlos y empezar a usarlos. Al mismo tiempo, se te da muy bien escuchar y te esfuerzas por entender lo que cada persona quiere conseguir o aprender. Ajustando tu estilo de enseñanza al nivel de cada usuario, consigues que aprenda todo lo posible al tiempo que aprovechas mejor tu tiempo. Sabes que, a veces, comprar un producto nuevo puede ayudar al cliente a alcanzar sus metas. Pasas mucho tiempo presentando sesiones y también disfrutas interactuando con los clientes de la tienda entre una sesión y otra. Consigues enriquecer la vida de los clientes y de tu equipo enseñándoles como solo sabe hacerlo un Creativo, y eso es motivo de orgullo para ti.", "key_qualifications": "", "preferred_qualifications": "Pasión por la enseñanza y capacidad para explicar las cosas de manera práctica, dejando a los usuarios a aprender practicando. Habilidad para enseñar a grupos pequeños y para ayudar simultáneamente a varios clientes. Perseverancia para trabajar con clientes y ayudarles a sacar el máximo provecho a sus dispositivos. Contribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo. Pones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día. Te sientes cómodo vendiendo, impartiendo formación y ayudando a los miembros del equipo en función de sus necesidades. Tienes iniciativa, independencia y capacidad para respetar estrictamente los horarios de las sesiones de formación. Aconsejas con entusiasmo sobre otras opciones de asistencia de la tienda, como los servicios para empresas y el Genius Bar. Hablas el idioma local con fluidez. Es imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438047"}