{"title": "SE-Operations Expert", "summary": "Som Operations Expert vet du bättre än någon annan hur fantastiskt det känns att hålla en helt ny Apple-produkt i sina händer. Därför är det upp till dig att ge kunderna möjligheten att få uppleva samma sak. Genom att handleda och coacha ditt team hjälper du till att tillmötesgå den ständigt växlande efterfrågan och ser till att alla produkter och demonstrationsenheter är på plats. När allt kommer omkring är din organisationsförmåga och ditt engagemang helt avgörande för att Apple Store ska nå sitt mål – att ge kunderna tillgång till produkterna de älskar. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa. Det finns både heltids- och deltidsjobb.", "description": "Som Operations Expert har du och dina medarbetare det fantastiska ansvaret för det sista steget i distributionskedjan: att sätta produkterna i kundernas händer. Du ansvarar för butikens fullständiga lager med produkter, delar, verktyg, material och allt annat. Du ser till att medarbetarna har det stöd, den kunskap och de resurser de behöver för att hålla produkterna tillgängliga, utföra lageruppgifter och hålla ordning på lagret när nya produkter anländer. Du håller ständig kontakt med chefer och ledningsteam och informerar om status för produkter och delar. När nya, spännande produkter anländer till butiken är du först med att packa upp och presentera dem för hela butiksteamet. Apple skapar produkterna, men det är du som sätter hjulen i rullning genom att placera dem i kundernas händer.", "key_qualifications": "", "preferred_qualifications": "Förmåga att fatta snabba beslut och lösa problem, även vid ändrade förutsättningar. God ledarskapsförmåga, kan föregå med gott exempel och handleda ett team. Stark organisationsförmåga och förmåga att snabbt delegera uppgifter. Bidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra. Förverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet. Du kan hantera och hålla flera deadlines på lagret varje vecka. Du är beredd att följa de regler som ser till att produkterna och lagret hanteras på ett säkert sätt. Du talar det lokala språket flytande. Du kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438126"}