{"title": "ES-Experto en Empresas", "summary": "En el Apple Store, ayudas a empresarios y profesionales a encontrar las herramientas que necesitan para implantar las soluciones de Apple en sus negocios. Les informas sobre nuestros productos y juntos exploráis todas las soluciones posibles. Formas parte de un equipo comprometido con el éxito de los clientes de empresa. Conoces bien sus necesidades y eres un fan de Apple: por eso sientes satisfacción cada vez que les ofreces una solución potente e innovadora. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí.", "description": "Como Experto en Empresas de Apple, presentas nuestras soluciones, tecnología y servicios a los clientes de empresa. Pasas parte de tu turno en la zona de ventas atendiendo a clientes nuevos y existentes y descubriendo lo que necesitan. Creas oportunidades y desarrollas relaciones, tanto por teléfono como en los talleres y eventos que se celebran en la tienda. Te reúnes con los clientes para averiguar sus necesidades, y preparas y presentas propuestas junto al equipo de Empresas. Si un cliente necesita una solución más compleja, trabajas con el equipo de Empresas al completo hasta que dais con la solución perfecta para su negocio. Al terminar, informas a los clientes de todas las opciones que puedes ofrecerles. Haces reflexionar a los clientes sobre las posibilidades de la tecnología de Apple en sus empresas y ayudas a que, tanto ellos como Apple, lleguen a lo más alto.", "key_qualifications": "", "preferred_qualifications": "Conocimiento del uso de la tecnología en las empresas y de las soluciones que Apple les puede ofrecer. Soltura atendiendo a los clientes por teléfono y posicionando nuestras soluciones de empresa. Capacidad para desarrollar actividades para empresas como reuniones en la tienda, talleres y eventos. Contribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo. Pones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día. Tienes experiencia en ventas a empresas. Te sientes cómodo iniciando ventas por teléfono. Tienes gran habilidad para las relaciones interpersonales y la presentación de información, así como excelentes dotes de comunicación escrita y verbal. Hablas el idioma local con fluidez. Es imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438046"}