{"title": "BR-Expert em operações", "summary": "Como expert em operações, você conhece melhor do que ninguém a satisfação de ter os produtos mais recentes da Apple em mãos. O seu dever será garantir que os clientes tenham essa mesma satisfação. Liderando e orientando sua equipe, você os ajudará a acompanhar as mudanças de demanda e garantir que todos os produtos e dispositivos de demonstração estejam onde devem estar. Sua habilidade organizacional e dedicação serão vitais para o que a Apple Store faz: conectar pessoas aos produtos que elas adoram. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas.", "description": "Como expert em operações, você e sua equipe terão a incrível responsabilidade de garantir que os produtos cheguem às mãos dos clientes. Você será responsável por todo o estoque da loja: produtos, peças, ferramentas, materiais e tudo mais. Você deverá garantir que sua equipe tenha o suporte, os conhecimentos e os recursos necessários para manter a disponibilidade dos produtos, realizar tarefas de inventário e manter o estoque organizado com a chegada de novos produtos. Você estará sempre em contato com as equipes de gerência e liderança, compartilhando dados sobre o status dos produtos e peças. Quando chegarem novos produtos incríveis, você será o primeiro a abri-los e apresentá-los à toda a equipe da loja. A Apple faz os produtos, mas você os torna realidade para os clientes.", "key_qualifications": "", "preferred_qualifications": "Capacidade de pensar rápido e realizar tarefas para a solução de problemas, mesmo em condições em constante mudança.\nHabilidade de liderança, seja orientando por meio de exemplos ou treinando uma equipe.\nCapacidade organizacional, estabelecendo a ordem rapidamente em todas as situações.\nContribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender.\nColocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias.\nVocê deve ser capaz de gerenciar e respeitar muitos prazos de estoque todas as semanas.\nVocê deve estar disposto a seguir regras para permitir o acesso seguro aos produtos e a movimentação segura no estoque.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438180"}