{"title": "DE-Operations Expert (m/w/x)", "summary": "Als Operations Expert weißt du besser als alle anderen, wie toll es ist, die neuesten Apple Produkte in Händen zu halten. Deshalb kannst du unseren Kunden dieses tolle Gefühl auch vermitteln. Indem du dein Team leitest und als Mentor unterstützt, hilfst du bei der Anpassung an ständig wechselnde Anforderungen und stellst sicher, dass jedes Produkt und Demogerät an seinem Platz ist. Deinem Einsatz und Organisationstalent verdankt der Apple Store seinen wichtigsten Erfolg: Unsere Kunden nehmen die Produkte mit nach Hause, die sie lieben. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Operations Expert trägst du gemeinsam mit deinem Team die große Verantwortung dafür, dass Produkte den letzten Schritt in der Lieferkette zurücklegen und in die Hände der Kunden gelangen. Du bist für das gesamte Inventar des Apple Stores zuständig – für Produkte, Ersatzteile, Werkzeuge, Hilfsmittel und alles andere. Du achtest darauf, dass dein Team über Support, Know-how und Ressourcen verfügt, um Produkte vorrätig und griffbereit zu halten, alle Lagerarbeiten gewissenhaft auszuführen und bei Eintreffen neuer Produkte für ein aufgeräumtes und gut organisiertes Lager zu sorgen. Du hältst ständigen Kontakt zu den Managern und den Leadership Teams und informierst sie über den Status von Produkten und Ersatzteilen. Und niemand sieht die neuen Produkte früher als du. Denn du packst sie aus und präsentierst sie dem Store Team. Apple stellt die Produkte her, aber du stellst sicher, dass sie in die Hände unserer Kunden gelangen.", "key_qualifications": "", "preferred_qualifications": "Schnelle Auffassungsgabe und souveränes Lösen von Problemen auch unter wechselnden Bedingungen. Führungskompetenzen, sowohl beim Vorangehen mit gutem Beispiel als auch beim Coachen einer Gruppe. Außergewöhnliches Organisationstalent und schnelles Ordnungschaffen in jeder Situation. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Zahlreiche Wareneingangstermine pro Woche handhabst du souverän und fristgerecht. Du bist bereit, Richtlinien einzuhalten, damit der sichere Zugang zu Produkten sowie der gefahrlose Zutritt zum Lagerraum gewährleistet sind. Am Standort kommunizierst du fließend in der dortigen Landessprache. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438037"}