{"title": "IT-Esperto Operations", "summary": "Come Esperto Operations, conoscerai meglio di chiunque altro la soddisfazione di avere tra le mani i nostri ultimi prodotti. Proprio per questo, sarà compito tuo assicurarti che i clienti siano altrettanto soddisfatti. Guidando e assistendo il team, contribuirai a tenere il passo con le esigenze del mercato e a garantire che ogni prodotto o unità demo sia al suo posto. Le tue capacità organizzative e la tua dedizione saranno alla base di ciò che fa l’Apple Store: mettere a disposizione delle persone i prodotti che amano. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio. Opportunità di lavoro full-time e part-time.", "description": "Come Esperto Operations, insieme al tuo team avrai la responsabilità di garantire che i prodotti arrivino al più presto nelle mani dei clienti. Ti occuperai di gestire l’intero inventario dello store: prodotti, parti di ricambio, strumenti, forniture e molto altro. Farai in modo che il tuo team abbia l’assistenza, le conoscenze e le risorse necessarie per garantire la disponibilità dei prodotti, completare le attività di magazzino e tenere in ordine la merce quando arrivano nuovi prodotti. Sarai costantemente in contatto con il Leadership Team, con cui condividerai informazioni sullo stato dei prodotti e delle parti di ricambio. E quando arriveranno nuovi prodotti, sarai la prima persona a vederli e a presentarli allo store. Apple crea i prodotti, tu li consegnerai nelle mani dei nostri clienti.", "key_qualifications": "", "preferred_qualifications": "Capacità di pensare rapidamente e risolvere i problemi, anche in contesti mutevoli. Capacità di leadership, ovvero di guidare fungendo da esempio o di istruire un gruppo. Spiccate capacità organizzative, che consentono di mettere ordine velocemente in ogni situazione. Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare. Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente. Sei in grado di gestire e rispettare più scadenze di magazzino alla settimana. Sei disposto a osservare rigide linee guida di sicurezza per l’accesso ai prodotti e la movimentazione in magazzino. Ottima conoscenza della lingua locale. Devi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438089"}