{"title": "ES - Especialista Técnico: Jornada completa, parcial y parcial temporal", "summary": "Eres una pieza clave para que los clientes que han comprado nuestros productos saquen todo el partido a la tecnología de Apple. Trabajas en el Apple Store realizando tareas de asistencia y servicio técnico. Compartes lo que sabes y ofreces un nivel excepcional de asistencia, tanto si se trata de ayudar a los clientes a dar los primeros pasos con el Mac como si tienes que responder a sus preguntas sobre cualquier dispositivo Apple. Te sientes satisfecho cuando tu iniciativa y tus conocimientos mejoran la relación de los clientes con Apple. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí.\n\nEn este puesto puedes trabajar a jornada completa, a tiempo parcial o a tiempo parcial de manera temporal.", "description": "Como Especialista Técnico, ayudas a los nuevos usuarios a empezar a utilizar sus productos y ofreces asistencia de primera a los que ya lo son. De esta forma, consigues que la relación entre los clientes y Apple sea sólida y positiva. Cuando un cliente necesita ayuda, evalúas su problema enseguida. Unas veces te encargas tú mismo de ayudarlos con su iPod, iPhone o iPad y les das consejos y soluciones al momento aprovechando que estás siempre al día sobre la tecnología Apple. Otras, remites a los clientes a tus compañeros del equipo de asistencia técnica para que les ayuden a ponerse en marcha de nuevo. También te encargas de dar formación personalizada a los nuevos clientes y les ayudas a desarrollar las habilidades básicas necesarias para dar los primeros pasos con sus proyectos de fotografía, vídeo y música. Tu compromiso de ofrecer la mejor atención beneficia a todo el equipo. Nos ayudas a mantener la relación con el cliente y por eso eres imprescindible para el éxito de la compañía.", "key_qualifications": "", "preferred_qualifications": "Capacidad para evaluar las necesidades de asistencia de los clientes cuando llegan a la tienda y ofrecerles soluciones adecuadas o remitirlos a otros miembros del equipo.\nFlexibilidad para desarrollar con regularidad funciones técnicas que requieren distintas habilidades.\nCapacidad de adaptación a los cambios a medida que los productos van evolucionando.\nContribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo.\nPones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día.\nSabes gestionar tu tiempo de manera excelente y eres capaz de tomar decisiones rápidamente.\nMantienes la calma y la dedicación al cliente durante la resolución de problemas.\nFomentas la confianza de los clientes cuando evalúas el estado de sus productos y les ofreces posibles soluciones.\nHablas el idioma local con fluidez.\nEs imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438212"}