{"title": "FR-Operations Expert", "summary": "En tant qu’Operations Expert, vous connaissez mieux que personne le bonheur d’avoir en main les tout derniers produits Apple. C’est donc naturellement à vous qu’il revient de veiller à ce que les clients éprouvent cette même satisfaction. En guidant et en accompagnant les membres de votre équipe, vous vous adaptez au fil des demandes changeantes et faites en sorte que chaque produit et chaque ordinateur de démonstration soit toujours à sa place. Au bout du compte, ce sont vos talents d’organisation et votre implication qui sont au cœur de la mission de chaque Apple Store : créer un lien fort entre les gens et les produits qu’ils adorent. Des postes à temps partiel et à temps plein sont disponibles. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même.", "description": "En tant qu’Operations Expert, vous avez la lourde charge de veiller à ce que les produits franchissent la dernière étape de la chaîne logistique pour atterrir entre les mains des clients. Vous êtes responsable de l’ensemble des stocks de l’Apple Store : produits, pièces, outils, fournitures et tout le reste. Vous veillez à ce que votre équipe bénéficie du soutien, des connaissances et des ressources nécessaires afin d’assurer la disponibilité des produits, d’effectuer les tâches d’inventaire et d’organiser les stocks à l’arrivée de nouveaux produits. Vous êtes en contact permanent avec les équipes d’encadrement et de direction et communiquez les données sur le statut des produits et des pièces. Et dès qu’arrivent de nouveaux produits enthousiasmants, vous êtes le premier à les déballer et à les présenter à toute l’équipe du magasin. C’est Apple qui crée les produits, mais c’est vous qui leur donnez une véritable existence en les mettant entre les mains de nos clients.", "key_qualifications": "", "preferred_qualifications": "Capacité à réfléchir vite et à résoudre les problèmes, même dans des conditions en perpétuelle évolution. Compétences de leadership, qu'il s'agisse de guider par l'exemple ou de coacher un groupe. Fortes compétences organisationnelles, avec capacité à faire régner l'ordre dans toutes les situations. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre des activités quotidiennes. Vous êtes capable de gérer et de respecter chaque semaine des délais d'inventaire multiples. Vous respectez des consignes très strictes afin de sécuriser l'accès aux produits et la circulation dans la réserve. Vous parlez couramment la langue locale. Vous devez accepter une certaine souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438063"}