{"title": "NL-Technical Specialist", "summary": "Nadat klanten één van onze producten hebben gekocht, ben jij degene die hen helpt om daar optimaal van gebruik te maken. Jouw dag in de Apple Store bestaat uit het bieden van gerichte ondersteuning en het verlenen van andere diensten. Jij staat paraat om je kennis met onze klanten te delen en hen in alles zo goed mogelijk te helpen.", "description": "Als Technical Specialist help je nieuwe klanten om met hun product aan de slag te gaan. Bestaande klanten bied je snel en efficiënt ondersteuning. Op die manier help je mee om een sterke, positieve relatie tussen onze klanten en Apple op te bouwen. Wanneer iemand op zoek is naar hulp, kun je de situatie snel inschatten. De ene keer kun je meteen je eigen kennis van de Apple technologie gebruiken om klanten te adviseren of ze uit de nood te helpen bij een probleem met hun iPod, iPhone of iPad. De andere keer verwijs je ze door naar iemand van het ondersteuningsteam om ze verder te helpen. Je geeft zelfs persoonlijke trainingen aan nieuwe klanten, waarbij je ze de basisvaardigheden bijbrengt die ze nodig hebben om met hun eigen foto-, video- of muziekproject aan de slag te gaan. Al je collega’s in de Store kunnen dankzij jouw inzet onze klanten zo goed mogelijk van dienst zijn. De manier waarop jij je werk doet, draagt in belangrijke mate bij aan het succes van Apple. Jij helpt ons om een duurzame relatie met onze klanten op te bouwen.", "key_qualifications": "", "preferred_qualifications": "In staat om van klanten die binnenkomen in te schatten welke ondersteuning ze precies zoeken en vervolgens oplossingen aan te dragen of hen door te verwijzen naar een collega\nFlexibel genoeg om regelmatig te wisselen van technische specialiteit en vaardigheden\nIn staat om mee te veranderen met onze producten\nBijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn\nDe waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden\nJe kunt zeer efficiënt omgaan met de beschikbare tijd en je kunt snel beslissingen nemen.\nTijdens het oplossen van technische problemen blijf je kalm en klantgericht.\nJe stelt klanten gerust terwijl je de aard van het probleem onderzoekt en een oplossing probeert te vinden.\nJe beheerst de lokale taal uitstekend.\nJe bent flexibel wat betreft je werktijden. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438211"}