{"title": "FR-Technical Specialist", "summary": "Une fois que les clients ont acheté nos produits, c’est vous qui les aidez à tirer le meilleur parti de leur nouvel outil technologique Apple. Votre journée de travail à l’Apple Store est émaillée de tâches diverses, toutes axées sur le service et l’assistance aux clients. Qu’il s’agisse d’aider un client à faire ses premières armes sur un Mac ou de trouver la réponse à ses questions sur d’autres appareils Apple, vous êtes toujours prêt à partager vos connaissances et à fournir une assistance hors pair. Vous trouvez très satisfaisant de pouvoir apporter des solutions et des éclairages à chacun de nos clients, et de renforcer ainsi la relation que ces derniers entretiennent avec Apple. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même. Des postes à temps partiel et à temps plein sont disponibles.", "description": "En tant que Technical Specialist, votre rôle consiste à aider les nouveaux propriétaires d’outils Apple comme ceux qui possèdent nos produits depuis longtemps à bénéficier d’une aide rapide et efficace, et à développer ainsi une relation forte et positive avec Apple. Vous êtes capable de déterminer rapidement l’aide dont un client a besoin. Il vous arrivera de proposer directement des conseils ou une solution, en exploitant vos propres connaissances des technologies Apple pour fournir de l’aide concernant les iPod, iPhone et iPad. À d’autres moments, vous dirigerez les clients vers d’autres membres de l’équipe d’assistance, qui leur permettront d’être à nouveau opérationnels. Vous assurerez même des formations personnalisées pour les nouveaux clients et les aiderez ainsi à acquérir les compétences nécessaires pour démarrer leurs projets en matière de photo, de vidéo et de musique. Toute l’équipe du magasin bénéficiera de votre engagement à offrir le meilleur service possible à nos clients. En aidant à renforcer les relations qui nous unissent à nos clients, vous contribuerez au succès d’Apple.", "key_qualifications": "", "preferred_qualifications": "Capacité à évaluer les besoins d’assistance des clients à leur arrivée, puis à leur proposer des solutions ou, le cas échéant, à les diriger vers d’autres membres de l’équipe. Flexibilité nécessaire pour basculer entre différentes compétences et spécialités techniques. Capacité à s’épanouir dans le changement, à mesure qu’évoluent les produits. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre des activités quotidiennes. Vous savez parfaitement gérer votre temps et prendre des décisions sur le vif. Vous savez garder votre calme et rester à la disposition des clients, tout en identifiant et en résolvant des problèmes techniques. Vous rassurez les clients en diagnostiquant les problèmes affectant leurs produits et en proposant d’éventuelles solutions. Vous parlez couramment la langue locale.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438206"}