{"title": "DE-Genius (m/w/x)", "summary": "Im Apple Store stärkst du das Vertrauen der Kunden in Apple, indem du als erfahrener Experte die Fehlerbeseitigung und Reparatur ihrer Produkte übernimmst. Du nutzt dein Problemlösungs- und Kommunikationstalent, um sicherzustellen, dass die Kunden an der Genius Bar schnelle Lösungen für ihre technischen Probleme erhalten. Du vermittelst den Teammitgliedern Produktkenntnisse und hältst dein technisches Know-how eigenständig auf dem neuesten Stand. Mit deiner ausgeprägten Servicementalität und Empathie bietest du jeden Tag als Genius Rat und Unterstützung. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Genius gibst du fundierte Ratschläge und leistest freundlichen, interaktiven technischen Support für Apple Kunden, die Hilfe benötigen. Du diagnostizierst Probleme mit Produkten an Ort und Stelle und erklärst die technischen Sachverhalte mit Geduld und Empathie. Nachdem du festgestellt hast, ob eine Reparatur möglich oder ein Ersatzgerät erforderlich ist, bietest du Lösungen an, damit die Kunden ihr Gerät schnellstmöglich wieder nutzen können. Auch wenn du mehrere Kunden betreust, behältst du die zeitlichen Anforderungen der Kunden sowie deine eigenen im Blick. Du setzt den Apple Servicegedanken stilvoll, schnell und versiert um. Du erwirbst dir das Vertrauen von Kunden und Kollegen gleichermaßen, denn du bietest Rat, Know-how und manchmal auch Tipps und Training an.", "key_qualifications": "", "preferred_qualifications": "Freude am Umgang mit Menschen und Lösen von Problemen. Gelassenheit und Kundenorientierung beim Beseitigen von Fehlern und Lösen technischer Probleme. Souveräner Umgang mit einem straffen Zeitplan voller Kundentermine. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du hast Geschick darin, dir Fähigkeiten in technischen Reparaturen anzueignen, und hast Freude am Lernen. Du kannst deine Zeit optimal einteilen und schnell Entscheidungen treffen. Am Standort kommunizierst du fließend in der dortigen Landessprache. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438036"}