{"title": "US-Genius", "summary": "Do you have a passion for hands-on problem solving? Do you love helping others by sharing your technical knowledge? At the Apple Store, you maintain customers’ trust in Apple as a skilled technician, troubleshooting and repairing products. You use your amazing diagnostic and people skills to assure Genius Bar customers of swift resolutions to their technical issues. You offer advice on accompanying accessories that will further improve the customer’s experience with Apple products. You also educate your team members about products, while independently keeping your own technical know-how up to date. With your customer service brilliance and empathetic nature, you provide Genius advice and support to both customers and team members. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As a Genius, you provide insightful advice and friendly, hands-on technical support to Apple customers in need. You quickly diagnose product issues on the spot, explaining situations with patience and compassion. After determining whether repairs can be done or a replacement is needed, you offer solutions to quickly get users up and running again. Even if you’re juggling more than one customer, you stay conscious of their time demands as well as your own. You fulfill Apple’s service commitment with style, speed, and skill. And you earn the trust of customers and coworkers alike as you offer mentorship, knowledge, and even tips and training. At Apple, we care about improving our services. We’re looking for people who identify problems and provide feedback to ensure our customer service stays relevant and current.", "key_qualifications": "", "preferred_qualifications": "Strong people skills and a knack for problem solving. Ability to maintain composure and customer focus while troubleshooting and solving technical issues. Ability to adhere to a schedule of customer appointments. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. An aptitude for acquiring skills in technical repairs and an eagerness to learn about all Apple products and devices. Excellent prioritization skills and an ability to make decisions quickly. Excellent verbal and written communications skills. Success in team environments, demonstrating shared responsibility and accountability with other team members. Flexibility with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. Your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. For information about pay, if you are interested in roles located in one of our California, Colorado, Hawaii, New York, Washington, or Washington DC locations click here to select a store and view pay information. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438151"}