{"title": "BR-Genius", "summary": "Na Apple Store, você será responsável por manter a confiança dos clientes na Apple, como o especialista experiente em solução de problemas e reparo de produtos. Você deverá usar suas habilidades para a solução de problemas e interação com pessoas para garantir que os clientes do Genius Bar obtenham soluções rápidas para seus problemas técnicos. Você também ensinará os membros da sua equipe sobre os produtos e deverá manter seu próprio know-how técnico atualizado de maneira independente. Com seu talento para o atendimento ao cliente e sua simpatia, você fornecerá conselhos e suporte de Genius todos os dias. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas. Há vagas de período integral e meio período.", "description": "Como Genius, você dará conselhos inteligentes e amigáveis e suporte técnico prático aos clientes da Apple. Você diagnosticará rapidamente os problemas do produto, explicando as situações com paciência e simpatia. Depois de determinar se o produto pode ser reparado ou deverá ser substituído, você oferecerá soluções para resolver o problema dos usuários rapidamente. Mesmo que você esteja atendendo mais de um cliente, você deverá ter consciência sobre quanto tempo dedicar a cada um e a você mesmo. Você colocará o compromisso da Apple com o serviço em prática com estilo, velocidade e habilidade. Assim ganhará a confiança dos clientes e colegas de trabalho oferecendo orientação, conhecimentos e até dicas e treinamento.", "key_qualifications": "", "preferred_qualifications": "Talento com pessoas e solução de problemas. Capacidade de manter a calma e o foco no cliente ao resolver problemas e solucionar questões técnicas. Capacidade de atender um cronograma de horários com clientes. Contribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender. Colocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias. Você deve ter aptidão para reparos técnicos e vontade de aprender. Você deve ter habilidades excelentes de gerenciamento de tempo e deve conseguir tomar decisões rapidamente.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438178"}