{"title": "SE-Expert", "summary": "Apple Store liknar ingen annan butik. Vi fokuserar helt och hållet på att leverera en oöverträffad kundupplevelse. I rollen som expert visar du in kunderna i Apples spännande värld och förvandlar nyfikna besökare till stamkunder. Du trivs i möten med såväl medarbetare som kunder och tycker det är otroligt givande att varje dag kunna hjälpa människor att utveckla långvariga relationer till Apple. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa. Det finns både heltids- och deltidsjobb.", "description": "Som expert utgör du en förebild inom försäljning, produktkännedom och lösningar och genom ditt sätt att bemöta kunderna. Du vet också hur man omvandlar nyfikna kunder till entusiaster och köpare. När nya produkter och initiativ dyker upp är du först med att lära dig, dela med dig och inspirera dina medarbetare genom att vara öppen och tillgänglig. Du uppnår alltid dina uppsatta mål – och överträffar dem ibland. Du är stolt över att få vara Apples ansikte utåt och visar prov på det varje gång du möter en kund.", "key_qualifications": "", "preferred_qualifications": "Dokumenterade teknikkunskaper, särskilt om Apples produkter, och förmåga att snabbt lära dig om nya produkter. Dokumenterad erfarenhet inom sälj- och tekniklösningar samt av att utveckla kundlojalitet. Förmåga att alltid kunna ge en fantastisk kundupplevelse, oavsett vilken situation du ställs inför. Bidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra. Förverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet. Du brinner för Apple och inspirerar och utbildar andra om allt som Apple har att erbjuda. Du motiverar butiksteamet i arbetet med att erbjuda Apples unika kundservice i såväl ord som handling. Du har stor social förmåga, är tillmötesgående, förstående och bra på att lyssna. Du kan fungera som en inspiratör för specialisterna. Du talar det lokala språket flytande. Du kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438124"}