{"title": "MX-Especialista Técnico", "summary": "Después de que los clientes compran nuestros productos, eres quien los ayuda a aprovechar al máximo la nueva tecnología de Apple. Tu día en el Apple Store está lleno de un número de actividades enfocadas en el soporte y el servicio. Ya sea que ayudes a los clientes con su Mac o a responder sus preguntas sobre otros dispositivos de Apple, estás listo para compartir el conocimiento y proporcionar asistencia excepcional. Obtienes satisfacción al brindar resolución y conocimientos a cada cliente, llevando su relación con Apple al siguiente nivel. Tenemos trabajos de tiempo completo y de medio tiempo. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo.", "description": "Como Especialista Técnico, ayudas a encaminar a los nuevos dueños y a que los ya existentes obtengan un servicio eficiente y rápido, para que desarrollen relaciones positivas y fuertes con Apple. Cuando un cliente necesita ayuda, evalúas su situación rápidamente. A veces apoyas a los clientes con consejos o con soluciones inmediatas, utilizando tu conocimiento en tecnología de Apple para ayudar con los dispositivos iPod, iPhone y iPad. En otras ocasiones, canalizas a los clientes con el equipo de servicio para que los ayuden a ponerse en marcha. Incluso brindas capacitación personalizada a los nuevos clientes, ayudándolos a adquirir habilidades básicas que necesitarán para iniciar proyectos de fotografía, video y música. Todo el equipo de la tienda se beneficia de tu compromiso por brindar la mejor atención a nuestros clientes. Al ayudar a Apple a mantener relaciones fuertes con los clientes, te conviertes en una pieza clave de nuestro éxito.", "key_qualifications": "", "preferred_qualifications": "Capacidad de evaluar las necesidades de servicio al cliente cuando éstos llegan a la tienda, proporcionar soluciones o llevarlos con otros miembros del equipo. Flexibilidad para rotar regularmente entre las distintas especialidades técnicas y conjuntos de habilidades. Capacidad para adaptarse al cambio conforme el producto evoluciona. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Tienes excelentes habilidades de administración del tiempo y puedes tomar decisiones con rapidez. Mantienes la calma y el enfoque al cliente mientras resuelves problemas. Tranquilizas a los clientes al brindarles diagnósticos de los productos y posibles soluciones. Debes tener flexibilidad de horarios. Tus horas de trabajo dependen de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438287"}