{"title": "BR-Criativo", "summary": "Você adora interagir com outras pessoas? Como Creative, você compartilha seus conhecimentos e desperta a criatividade tanto das pessoas que visitam a Apple Store pela primeira vez como das que já são clientes habituais. Você é a base do ambiente acolhedor da Apple Store e incentiva as pessoas a compartilhar suas ideias e colocá-las em prática. Você trabalha com pessoas bem informadas, ansiosas por compartilhar o que sabem e ao mesmo tempo continuar aprendendo. Seu maior prazer é ajudar um cliente a criar algo incrível. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas.", "description": "Como Creative, sua função principal na Apple Store é instruir, compartilhando seus conhecimentos com pequenos grupos ou individualmente. Você usa suas habilidades de apresentação em sessões nas quais ajuda as pessoas a configurar, conhecer e começar a usar seus dispositivos. Você também é um bom ouvinte, com paciência para entender o que cada pessoa quer aprender ou criar. Ajustando seu estilo de ensino às habilidades individuais de cada pessoa, você otimiza o aprendizado e seu próprio tempo. Você reconhece que comprar um produto novo pode ajudar um cliente a atingir seus objetivos. Você passa muito tempo apresentando sessões, mas também gosta de interagir com os clientes da loja entre uma sessão e outra. Você tem orgulho de enriquecer a vida das pessoas, sejam elas clientes ou colegas de equipe.", "key_qualifications": "", "preferred_qualifications": "Paixão por ensinar permitindo que as pessoas aprendam fazendo. Habilidade para ensinar grupos pequenos e vários clientes simultaneamente. Tenacidade para ajudar os clientes a aproveitarem seus dispositivos ao máximo. Contribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender. Colocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias. Você deve gostar de vender e de ensinar, ajudando os membros da sua equipe conforme necessário. Você deve ser motivado, ter autonomia e capacidade de seguir um cronograma de treinamento apertado. Você poderá recomendar outras opções de suporte na loja, como os serviços de negócios e o Genius Bar.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438179"}