{"title": "MX-Experto en Empresas", "summary": "En el Apple Store, conectas a los profesionales empresariales y a los emprendedores con las herramientas que necesitan para utilizar las soluciones de Apple en sus empresas. Como Experto en Empresas, les ayudas a saber más sobre los productos Apple y a explorar varias posibilidades. Eres parte de un equipo apasionado por ayudar a que las empresas tengan éxito. Con tu comprensión de las necesidades empresariales y tu entusiasmo por Apple, estarás muy satisfecho al poder ofrecer soluciones innovadoras y poderosas a cada cliente. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo.", "description": "Como Experto en Empresas, brindas soluciones, tecnología y servicios de Apple a los clientes empresariales. Pasas tiempo en el área de ventas, recibiendo a clientes empresariales nuevos o ya conocidos y aprendiendo sobre sus necesidades. Generas nuevos clientes potenciales y creas relaciones, ya sea conectándote a través del teléfono o en talleres y eventos en la tienda. Descubres las necesidades de los clientes mediante sesiones informativas y trabajas con el equipo de Empresas para preparar y presentar propuestas. Para los clientes con necesidades más complejas, trabajas con todo el equipo de Empresas para crear soluciones ideales. Finalmente, informas y ofreces a los clientes un conjunto completo de opciones de servicio. Al invitar a los clientes a pensar en las posibilidades de utilizar la tecnología de Apple en sus negocios, ayudas a construir el éxito, no sólo para tu equipo, sino también para nuestros clientes.", "key_qualifications": "", "preferred_qualifications": "Conocimientos sobre cómo las empresas utilizan la tecnología y qué soluciones les ofrece Apple. Comodidad para utilizar el teléfono para interactuar con los clientes y para proponer soluciones empresariales. Capacidad de brindar experiencias empresariales mediante sesiones informativas, talleres y eventos en la tienda. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Debes tener mínimo un año de experiencia en ventas en el mercado empresarial. Te sientes cómodo al desarrollar contactos cualificados por teléfono. Tienes grandes habilidades de presentación y para interactuar con personas, así como excelentes habilidades de comunicación verbal y escrita. Debes tener flexibilidad de horarios. Tus horas de trabajo dependen de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438292"}