{"title": "TR-Kurumsal Müşteriler Eksperi", "summary": "Apple Store’da, şirket profesyonelleri ve girişimcilere, Apple’ın sunduğu çözümleri şirketlerinde kullanabilmeleri için gereken araçları sağlarsınız. Kurumsal Müşteriler Eksperi olarak, Apple ürünleri hakkında bilgi edinmelerine ve farklı olanakları keşfetmelerine yardımcı olursunuz. Şirketlerin başarı kazanmasına yardımcı olma tutkusuna sahip bir ekibin parçası haline gelirsiniz. Şirketlerin ihtiyaçlarını anlamanız ve Apple tutkunuz sayesinde, her müşteriye güçlü ve yenilikçi çözümler sunmaktan büyük mutluluk duyarsınız. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız.", "description": "Kurumsal Müşteriler Eksperi olarak; Apple çözümlerini, teknolojisini ve hizmetlerini kurumsal müşterilere tanıtırsınız. Satış katında zaman geçirir, ilk kez gelen ve mevcut kurumsal müşterilerin gereksinimlerini öğrenirsiniz. Telefonla veya mağaza içi atölye çalışmalarında ve etkinliklerde kurduğunuz bağlantılarla yeni potansiyel müşteriler yaratır ve ilişkilerinizi geliştirirsiniz. Briefing’lerle müşteri gereksinimlerini ortaya çıkarır, teklifleri hazırlamak ve sunmak için Kurumsal Müşteriler Ekibi ile birlikte çalışırsınız. Müşterilerinizin daha karmaşık ihtiyaçları için ideal çözümler geliştirmek amacıyla tüm Kurumsal Müşteriler Ekibi ile birlikte çalışırsınız. Son olarak, müşterilerinizi bilgilendirir ve onlara tüm satış destek seçeneklerini sunarsınız. Müşterilerin Apple teknolojisini işletmelerinde kullanma olanakları hakkında düşünmesini sağlayarak, yalnızca ekibinizin değil, müşterilerinizin de başarılı olmasını sağlarsınız.", "key_qualifications": "", "preferred_qualifications": "Şirketlerin teknolojiyi nasıl kullandığı ve Apple çözümlerinin onlara neler sunabileceği konusunda bilgi sahibi olmak\nMüşterilerle telefonda iletişim kurabilmek ve kurumsal çözümleri konumlandırabilmek\nMağaza içi kısa toplantılar, atölye çalışmaları ve etkinliklerle kurumsal müşterileri yönlendirmek\nFarklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur\nGünün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler\nMinimum 1 yıl kurumsal satış konusunda tecrübeli olmak\nTelefonda yeni müşteriler oluşturma konusunda kendini rahat hissetmek\nİnsan ilişkileri ve sunum becerilerinde güçlü, mükemmel yazılı ve sözlü iletişim becerilerine sahip olmak\nEsnek çalışma saatlerine uyum sağlayabilmek; çalışma saatleriniz işin ihtiyaçlarına bağlı olacaktır", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438163"}