{"title": "BR-Especialista", "summary": "Como Especialista, você ajudará a criar a energia e a expectativa em torno de nossos produtos, oferecendo as soluções certas e fazendo os produtos chegarem até os clientes. Você entende que a Apple Store se dedica a proporcionar uma experiência única ao cliente. O primeiro passo é descobrir quais são as necessidades dos clientes. Depois, com o apoio da equipe da sua loja, você encontrará os produtos certos para essas necessidades. Cada dia será uma nova oportunidade para você transformar outro visitante da loja em um cliente fiel da Apple. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas. Há vagas de período integral e meio período.", "description": "Como Especialista, você deve ser capaz de descobrir as necessidades dos clientes e em seguida, oferecer as soluções ideais. Você será a primeira pessoa que os clientes encontrarão quando entrarem na loja e também quem os orientará, aconselhando, vendendo e até mesmo configurando seus produtos novos. Você também desempenhará outras funções na loja, como a manutenção da exposição dos produtos ou ajudar os membros da equipe. Sempre curioso, você deve estar sempre atualizado sobre novos produtos e iniciativas, pronto para aplicar seus conhecimentos na interação com os clientes. Seu sucesso será medido pela produtividade individual e por equipe, e também pelo desempenho geral da loja. Você deve ter orgulho de representar a Apple e deve se sentir satisfeito por ajudar os clientes a desenvolver relações duradouras com a Apple.", "key_qualifications": "", "preferred_qualifications": "Capacidade de oferecer uma ótima experiência ao cliente em um ambiente muito ativo e de se sentir bem com interações pessoais constantes. Grande interesse por tecnologia, especialmente produtos da Apple, e capacidade de aprender sobre novos produtos e recursos rapidamente. Habilidades avançadas de comunicação que permitam conversar de maneira livre e cômoda tanto com um cliente sozinho como em pequenos grupos. Contribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender. Colocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias. Você deve ser apaixonado pela Apple e deve ter vontade de compartilhar essa paixão. Você deve estar disposto a aprender e a adotar o estilo de serviço exclusivo da Apple. Você deve ter talento com as pessoas: ser acessível, bom ouvinte e simpático.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438176"}