{"title": "TR-Operasyon Eksperi", "summary": "Operasyon Eksperi olarak, en yeni Apple ürününü elinize almanın verdiği keyfi herkesten iyi bilirsiniz. Aynı keyfi müşterilerinizin de yaşamasını sağlamak size bağlıdır. Ekibinize kılavuzluk edip mentorluk yaparak değişen taleplere yetişmelerine yardımcı olursunuz. Ayrıca her ürünün ve demo aygıtının gereken yerde bulunmasını sağlarsınız. Organizasyon becerileriniz ve işinize duyduğunuz tutku Apple Store’un çabasının temelini oluşturur: İnsanları sevdikleri ürünlerle buluşturmak. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız.\n\nTam zamanlı ve yarı zamanlı çalışma olanakları mevcuttur.", "description": "Operasyon Eksperi olarak, ekibinizle birlikte ürünleri tedarik zincirinin son halkasına, yani müşterilerin ellerine ulaştırmak gibi inanılmaz bir sorumluluğu üstlenirsiniz. Ürünlerden, parçalardan, araçlardan, malzemelerden ve diğer her şeyden oluşan mağaza envanteri sizin sorumluluğunuzdadır. Ekibinizin ürünlerin stokta bulunmasını sağlaması, envanter görevlerini yerine getirmesi ve stok deposunu yeni ürünler geldikçe düzenli tutması için gereken destek, bilgi ve kaynakları sunarsınız. Yönetim ve liderlik ekipleriyle sürekli temas halinde kalırsınız. Ürünlerin ve parçaların durumuyla ilgili verileri paylaşırsınız. Heyecan verici yeni ürünler geldiğinde, onları ilk açan ve tüm mağaza ekibine tanıtan kişi siz olursunuz. Ürünlerimizi üreten Apple; onları müşterilere ulaştırarak asıl mucizeyi gerçekleştiren ise sizsiniz.", "key_qualifications": "", "preferred_qualifications": "Değişen koşullardan hızlı düşünebilme ve sorun çözme yeteneği\nRol model olarak ya da bir gruba yol göstererek liderlik becerilerini sergileme\nHer durumda hızla analiz edebilecek güçlü organizasyon becerisi\nFarklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur\nGünün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler\nHer hafta birden fazla envanter son teslim tarihiyle karşılaşabilir ve bu tarihlere uymak için çok yoğun çalışabilirsiniz.\nStok deposundaki ürünlere güvenli bir şekilde erişilmesini ve stok hareketlerinin güvenli bir şekilde yapılmasını sağlamak için kurallara istekli bir şekilde uymalısınız.\nEsnek çalışma saatlerine uyum sağlamalısınız; çalışma saatleriniz işin ihtiyaçlarına bağlı olacaktır.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438168"}