{"title": "IT-Esperto", "summary": "L’Apple Store è un punto vendita unico nel suo genere, pensato per offrire ai clienti esperienze straordinarie. Come Esperto, presenterai ai clienti l’incredibile mondo di Apple, trasformando visitatori curiosi in clienti fedeli. Dovrai dare il meglio nelle interazioni con i membri del tuo team e con i clienti. E otterrai grande soddisfazione nell’aiutare ogni giorno le persone a sviluppare relazioni durature con Apple. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio. Opportunità di lavoro full-time e part-time.", "description": "Come Esperto, sarai un leader nel campo delle vendite, della conoscenza dei prodotti e delle soluzioni e sarai altamente influente nel tuo modo di rapportarti con i clienti. Ma saprai anche come trasformare un cliente semplicemente curioso in un utente fortemente interessato, e infine in un proprietario. Quando vengono lanciati nuovi prodotti e iniziative, sarai il primo a imparare, condividere e ispirare i membri del tuo team mostrandoti disponibile e proattivo. Saprai sempre rispettare, e talvolta superare, gli obiettivi di performance che ti sei prefissato. Sarai orgoglioso di rappresentare Apple e lo mostrerai in tutte le tue interazioni con i clienti.", "key_qualifications": "", "preferred_qualifications": "Conoscenza dimostrata delle tecnologie, in particolare dei prodotti Apple, e capacità di imparare rapidamente a usare nuovi prodotti. Comprovata esperienza nel campo delle vendite e delle soluzioni tecnologiche, e nella fidelizzazione dei clienti. Capacità di offrire continuamente ai clienti esperienze eccezionali, indipendentemente dalla situazione. Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare. Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente. Hai una passione per Apple e saprai ispirare e istruire gli altri su ciò che offriamo. Sai definire lo standard dell’esclusivo servizio clienti di Apple sia a parole che in pratica. Hai spiccate capacità interpersonali: sei disponibile e sai ascoltare e comprendere gli altri. Dovrai fungere da ispirazione e modello per gli Specialisti. Ottima conoscenza della lingua locale. Devi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438087"}