{"title": "AT-Specialist (m/w/x)", "summary": "Als Specialist trägst du dazu bei, Begeisterung rund um unsere Produkte zu erzeugen, indem du die richtigen Lösungen anbietest und dafür sorgst, dass die Produkte in die Hände unserer Kunden gelangen. Im Apple Store engagieren wir uns dafür, Kundenerlebnisse zu schaffen, die einzigartig sind. Du hast Erfahrung darin, zunächst die Kundenbedürfnisse einzugrenzen. Mit deinem Store Team unterstützt du Kunden dann bei der Entscheidung, welches Produkt am besten zu ihren Bedürfnissen passt. Du siehst jeden Tag als Chance, Besucher im Apple Store als treue Apple Kunden zu gewinnen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Specialist fällt es dir leicht, Bedürfnisse der Kunden zu erkennen und ihnen interessante Lösungen anzubieten. Du bist ihr erster Kontakt im Store – du begleitest Kunden, informierst sie, verkaufst ihnen ihr neues Produkt und richtest es ihnen ein. Daneben übernimmst du auch noch andere Aufgaben im Store. Du kümmerst dich um Visual Merchandising oder unterstützt Teammitglieder. Du bist wissbegierig, immer bestens über Produkte und Initiativen informiert und bereit, Gelerntes in der Interaktion mit den Kunden anzuwenden. Dein Erfolg wird an deiner Produktivität und an der des Teams gemessen sowie am Gesamterfolg des Stores. Du bist stolz darauf, Apple zu repräsentieren, und es erfüllt dich mit Zufriedenheit, Kunden dabei zu helfen, eine lebenslange Beziehung zu Apple aufzubauen.", "key_qualifications": "", "preferred_qualifications": "Großes Interesse an Technologie, insbesondere an Apple Produkten, und schnelle Auffassungsgabe beim Kennenlernen neuer Produkte und Features. Fähigkeit, in einer sehr lebhaften Umgebung für ein außergewöhnliches Kundenerlebnis zu sorgen, sowie Freude am Umgang mit Menschen. Starkes Kommunikationstalent, Selbstsicherheit beim freien Sprechen vor kleinen Gruppen sowie vor Einzelpersonen. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du bist leidenschaftlicher Apple Fan und liebst es, diese Leidenschaft mit anderen zu teilen. Du bist bereit, dir den einzigartigen Kundenservice von Apple anzueignen. Du zeichnest dich durch ausgeprägte Sozialkompetenzen aus – du bist hilfsbereit, einfühlsam und kannst gut zuhören. Flexible Arbeitszeiten sind kein Problem für dich. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig. Das Bruttojahresgehalt für eine Vollzeitstelle beträgt gemäß dem anzuwenden Kollektivvertrag mindestens €29,736. Das tatsächliche Gehalt orientiert sich an branchenüblichen Gehältern, deinen Qualifikationen und Erfahrungen.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438340"}