{"title": "ES-Experto", "summary": "Los Apple Store son entornos de venta únicos, completamente orientados a ofrecer a los clientes experiencias increíbles. Como Experto, introduces a los visitantes curiosos en el apasionante mundo de Apple y los transformas en clientes fieles. Te gusta la interacción con los demás miembros del equipo y con los usuarios. Sientes una gran satisfacción sabiendo que cada día creas vínculos duraderos entre las personas y Apple. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí. Tenemos puestos a jornada parcial y completa.", "description": "Como Experto, eres un número uno en ventas, conoces los productos y soluciones, y tu manera de relacionarte con los clientes te permite influir sobre ellos. Sabes aprovechar la curiosidad de los usuarios y convertirla en un gran interés que termine en una la venta. A medida que surgen nuevos productos e iniciativas, eres el primero en descubrirlos, compartirlos e inspirar a tu equipo actuando con cercanía. Siempre alcanzas tus objetivos de rendimiento, e incluso los superas. Te sientes orgulloso de representar a Apple y lo demuestras cada vez que interactúas con un cliente.", "key_qualifications": "", "preferred_qualifications": "Conocimientos avanzados demostrados sobre tecnología, en particular sobre los productos de Apple, y capacidad para aprender rápidamente sobre nuevos productos. Experiencia vendiendo soluciones tecnológicas y consiguiendo la fidelidad de los clientes. Capacidad para ofrecer a los clientes un trato fantástico en cualquier situación. Contribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo. Pones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día. Te apasiona Apple, y sabes inspirar y descubrir a los demás todo lo que ofrecemos. Das ejemplo de nuestro estilo único de atención al cliente con tus palabras y tus acciones. Tienes gran habilidad para el trato con el cliente: eres accesible, sabes escuchar y empatizas. Mantienes el entusiasmo de los Especialistas y les sirves de modelo. Hablas el idioma local con fluidez. Es imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438048"}