{"title": "CA-Technical Specialist", "summary": "Do you love how it feels to help others? After customers purchase our products, you’re the one who helps them get more out of their new Apple technology. Your day in the Apple Store is filled with a range of focused support and service tasks. Whether you’re helping customers get started with the Mac or finding answers to their questions about other Apple devices, you’re ready to share knowledge and provide exceptional assistance. You gain satisfaction from bringing resolution and insight to each customer, elevating his or her relationship with Apple to the next level. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As a Technical Specialist, you help new owners get started and current ones get quick, efficient support — developing strong, positive relationships with Apple. When a customer needs assistance, you quickly assess their situation. Sometimes you take care of customers with advice or a solution on the spot, using your knowledge of current Apple technology to help with iPod, iPhone, and iPad devices. At other times, you refer customers to support team members who get them up and running again. You even provide personal training for new customers, helping them acquire the basic skills they need to get started on photo, video, and music projects. The entire store team benefits from your commitment to providing the best care for customers. By helping Apple maintain strong relationships with customers, you are instrumental to our success.", "key_qualifications": "", "preferred_qualifications": "Ability to assess customers’ support needs when they arrive, then provide solutions or refer them to other team members\nFlexibility to regularly rotate through different technical specialties and skill sets\nAbility to thrive on change as products evolve\nContribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn.\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\nYou have excellent time management skills and can make decisions quickly.\nYou maintain composure and customer focus while troubleshooting and solving issues.\nYou reassure customers when delivering product diagnoses and potential solutions.\nYou’ll need to be flexible with your schedule. Your work hours will be based on business needs.\nRoles based in Quebec require French language proficiency.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. Your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation.\n\nYou’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nFor information about pay, if you are interested in roles located in one of our British Columbia locations click here to select a store and view pay information.\nNote: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438200"}