{"title": "CA-Expert", "summary": "Are you passionate about sharing your knowledge of Apple products? We’re looking for people who get great satisfaction from helping people develop lifelong relationships with Apple every day. The Apple Store is a retail environment like no other — uniquely focused on delivering amazing customer experiences. As an Expert, whether you work full-time or part-time, you introduce people to the exciting world of Apple, having meaningful interactions, offering customized solutions, and turning curious visitors into loyal customers. With a deep understanding of Apple products and services, you spend time mentoring team members and serving as a role model for your team. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As an Expert, you are a leader in sales, product knowledge, and solutions, and highly influential in how you engage with customers. But you also know how to turn mild customer curiosity into intense interest - and ownership. As new products and initiatives emerge, you are the first to learn, share, and inspire your team members through approachability and action. You always meet, and at times exceed, your established performance goals. You're proud to represent Apple, and you exemplify that in all your interactions with customers.", "key_qualifications": "", "preferred_qualifications": "Demonstrated proficiency in technology, particularly Apple products, and the ability to quickly learn about new products. Proven experience in sales and technology solutions, as well as in developing customer loyalty. Ability to consistently deliver great customer experiences — no matter what the situation. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You’re passionate about Apple, and you inspire and educate others about all that Apple has to offer. You can set the standard for Apple’s unique style of service through words and action. You have strong people skills — you’re approachable, a good listener and empathetic. You can serve as an engaging role model to Specialists. Multilingual ability is a plus. You’ll need to be flexible with your schedule. Your work hours will be based on business needs. Roles based in Quebec require French language proficiency.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. Your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. For information about pay, if you are interested in roles located in one of our British Columbia locations  click here to select a store and view pay information. Note: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114437996"}