{"title": "DE-Creative (m/w/x)", "summary": "Du hast Spaß an der Arbeit mit anderen Menschen? Als Creative inspirierst du mit deinem Wissen alle im Apple Store dazu, kreativ zu werden – ob sie das erste Mal bei uns sind oder langjährige Kund:innen. Du schaffst eine offene und einladende Atmosphäre im Apple Store, in der alle ihre Ideen teilen und erfahren können, wie sie diese verwirklichen. Du arbeitest in einem kompetenten Team, das seine Skills ebenso gerne teilt wie Neues lernt. Es freut dich besonders, wenn du Kund:innen ermöglichst, etwas Außergewöhnliches zu gestalten. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst bei uns in Vollzeit oder Teilzeit arbeiten.", "description": "Als Creative bist du im Apple Store vor allem Trainer:in – ob du nun mit kleinen Gruppen arbeitest oder einzelne Kund:innen unterstützt. Du nutzt dein Präsentationstalent, um Kund:innen beim Einrichten ihrer neuen Produkte zu unterstützen, und vermittelst dein Wissen, damit sie diese schnell nutzen können. Zugleich kannst du gut zuhören und nimmst dir Zeit, um die Lernziele deiner Kund:innen zu verstehen. Deinen Trainingsstil passt du an den jeweiligen Kenntnisstand der Kund:innen an, um optimale Lernerlebnisse zu gestalten und deine Zeit bestmöglich zu nutzen. Du erkennst, dass der Kauf eines neuen Produkts Kund:innen beim Erreichen ihrer Ziele helfen kann. Einen großen Teil deiner Zeit verbringst du damit, Sessions zu leiten, hast aber auch Freude daran, dazwischen mit den Kund:innen im Store zu kommunizieren. Du bist stolz darauf, das Leben anderer mit deinen Skills als Creative zu bereichern und ihnen etwas Neues beizubringen – egal ob Kund:innen oder andere Teammitglieder.", "key_qualifications": "", "preferred_qualifications": "Du bringst anderen gern Neues bei und kannst sie mit Learning by Doing anleiten. Du kannst kleine Gruppen coachen und mehrere Kund:innen gleichzeitig unterstützen. Du hilfst deinen Kund:innen engagiert dabei, ihre Produkte optimal zu nutzen. Du trägst zu einer inklusiven Arbeitsumgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du bist beim Verkaufen ebenso kompetent wie beim Unterrichten und hilfst deinen Teammitgliedern bei Bedarf gerne aus. Du zeichnest dich durch hohe Eigenmotivation und Eigenständigkeit aus und hältst straff strukturierte Trainingspläne mühelos ein. Du bist versiert darin, weitere Supportoptionen im Apple Store zu empfehlen, etwa Dienste für Unternehmen und die Genius Bar. Am Standort kommunizierst du fließend in der dortigen Landessprache. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438034"}