{"title": "IT-Genius", "summary": "All’Apple Store, dovrai mantenere la fiducia che i clienti ripongono in Apple agendo da punto di riferimento esperto e qualificato per la risoluzione dei problemi e la riparazione dei prodotti. Dovrai usare capacità interpersonali e di problem-solving per assicurare ai clienti del Genius Bar l’immediata risoluzione dei loro problemi tecnici. Dovrai anche istruire i membri del tuo team sui prodotti, e nel contempo mantenere aggiornate le tue conoscenze tecniche autonomamente. Con la tua capacità di comprendere gli altri e la tua abilità nel trattare con i clienti, fornirai ogni giorno consigli e assistenza come Genius. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio. Opportunità di lavoro full-time e part-time.", "description": "Come Genius, dovrai fornire consigli utili e assistenza tecnica ai clienti Apple. Dovrai diagnosticare i problemi dei prodotti all’istante, spiegando la situazione con pazienza e comprensione. Dopo aver valutato se è possibile effettuare una riparazione o se è necessaria una sostituzione, dovrai offrire soluzioni in modo che gli utenti possano tornare subito operativi. Anche se ti stai destreggiando tra più clienti, dovrai tenere sempre presente le loro esigenze in termini di tempo, e le tue. Dovrai mantenere l’impegno del servizio clienti di Apple con stile, velocità e competenza. Offrendo assistenza, conoscenze e talvolta consigli e formazione, guadagnerai la fiducia di clienti e colleghi.", "key_qualifications": "", "preferred_qualifications": "Spiccate capacità interpersonali e un talento innato per il problem-solving. Capacità di mantenere la compostezza e la concentrazione sul cliente durante la risoluzione di problemi tecnici. Capacità di rispettare un programma di appuntamenti con i clienti. Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare. Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente. Hai una predisposizione ad acquisire competenze nelle riparazioni tecniche e una gran voglia di imparare. Hai eccellenti capacità di gestione del tempo e sei in grado di prendere decisioni rapidamente. Ottima conoscenza della lingua locale. Devi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438088"}