{"title": "FR-Business Expert", "summary": "À l’Apple Store, vous reliez les professionnels et chefs d’entreprise aux outils dont ils ont besoin pour déployer les solutions Apple dans leur entreprise. En tant que Business Expert, vous leur permettez d’en savoir plus sur les produits Apple et d’explorer diverses possibilités. Vous faites partie d’une équipe qui veut passionnément aider les entreprises à réussir. Vous comprenez les besoins des professionnels et ressentez un véritable enthousiasme pour Apple, ce qui vous permet de trouver une immense satisfaction dans le fait de proposer à chaque client des solutions efficaces et novatrices. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même.", "description": "En tant que Business Expert, c’est à vous qu’il revient de présenter aux clients professionnels les solutions, les technologies et les services Apple. Vous passez du temps dans l’espace de vente et allez à la rencontre des clients professionnels, actuels et nouveaux, afin d’en savoir davantage sur leurs besoins. Vous identifiez des clients potentiels et nouez des relations, par téléphone ou dans le cadre des ateliers et animations au store. Vous identifiez les besoins des clients au cours de briefings et collaborez avec la Business Team pour préparer et soumettre vos propositions. Pour les clients ayant des besoins plus complexes, vous collaborez avec la Business Team au grand complet afin d’élaborer les solutions professionnelles idéales. Enfin, vous sensibilisez les clients et leur proposez la suite complète des options de service après-vente. En incitant les clients à réfléchir aux possibilités qu’offre la technologie Apple pour leur entreprise, vous favoriserez la réussite, non seulement de votre équipe, mais aussi de nos clients.", "key_qualifications": "", "preferred_qualifications": "Bonne compréhension de l'usage des nouvelles technologies en entreprise et des avantages que les solutions Apple peuvent apporter aux clients professionnels. Parfaite aisance au téléphone pour dialoguer avec les clients et positionner les solutions professionnelles Apple. Capacité à transmettre des expériences professionnelles par le biais de briefings, d'ateliers et d'événements en magasin. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre des activités quotidiennes. Vous avez une expérience dans la vente aux entreprises. Vous êtes à l'aise pour prospecter au téléphone auprès de clients qualifiés. Vous avez une parfaite aisance relationnelle, des qualités de présentation remarquables et un excellent niveau de communication écrite et orale. Vous parlez couramment la langue locale. Vous devez accepter une certaine souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438059"}