{"title": "NL-Creative", "summary": "Maak je graag contact met andere mensen? Als Creative stimuleer je creativiteit door je kennis te delen met Apple klanten, of het nu nieuwe of bestaande trouwe klanten zijn. Je bent de spil van de uitnodigende omgeving van de Apple Store waar klanten zich vrij voelen om hun ideeën te delen en hun idealen te leren verwezenlijken. Je werkt samen met deskundige collega's die zowel graag hun kennis willen delen als meer willen leren. Je geniet ervan om klanten te laten zien hoe ze iets moois kunnen maken. Je creëert samen met anderen een cultuur waar alle medewerkers welkom zijn en hun werk optimaal kunnen doen.\n\nEr zijn zowel fulltime als parttime functies beschikbaar.", "description": "Als Creative is je belangrijkste taak in de Apple Store die van trainer, waarbij je lesgeeft aan kleine groepjes of individuele gebruikers helpt met hun projecten. Je past je presentatievaardigheden toe om ervoor te zorgen dat gebruikers goed voorbereid en goed getraind zijn en aan de slag kunnen. Maar je kunt ook uitstekend luisteren en neemt de tijd om van elke gebruiker te horen wat deze wil bereiken of leren. Je past je lesstijl aan het kennisniveau van de individuele gebruikers aan, waardoor zij optimaal kunnen leren en jij optimaal je tijd benut. Je wijst klanten er in voorkomende gevallen op dat zij hun doelen beter kunnen bereiken door een nieuw product aan te schaffen. Je bent een groot deel van je tijd bezig met ingeplande trainingssessies, maar tussendoor ben je ook klanten in de Store behulpzaam. Je vindt het leuk om het leven van anderen te verrijken, of het nu klanten of teamleden zijn, door ze iets te leren op een manier waarop alleen een Creative dat kan.", "key_qualifications": "", "preferred_qualifications": "Plezier in lesgeven en in staat om gebruikers iets te leren door het ze zelf te laten doen.\nIn staat om les te geven aan kleine groepen en meerdere gebruikers tegelijkertijd te begeleiden.\nVolhardend genoeg om met gebruikers te blijven werken totdat ze meer uit hun apparaten kunnen halen.\nBijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn.\nDe waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden.\nJe houdt net zo gemakkelijk een verkooppraatje als dat je lesgeeft en je staat je teamleden waar nodig bij.\nJe kunt jezelf motiveren en aansturen en kunt je aan een strak trainingsrooster houden.\nJe kunt goed inschatten wanneer je iemand andere diensten kunt aanbevelen, bijvoorbeeld het Business Team of de Genius Bar.\nJe beheerst de lokale taal uitstekend.\nJe zult je flexibel moeten opstellen wat je werktijden betreft. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438110"}