{"title": "HK-Genius", "summary": "Do you have a passion for hands-on problem solving? Do you love helping others by sharing your technical knowledge? At the Apple Store, you maintain customers’ trust in Apple as a skilled technician, troubleshooting and repairing products. You use your amazing diagnostic and people skills to assure Genius Bar customers of swift resolutions to their technical issues. You offer advice on accompanying accessories that will further improve the customer’s experience with Apple products. You also educate your team members about products, while independently keeping your own technical know-how up to date. With your customer service brilliance and empathetic nature, you provide Genius advice and support to both customers and team members. You work with others to foster a culture where everyone belongs and is inspired to do their best work.Both full-time and part-time jobs are available.", "description": "As a Genius, you provide insightful advice and friendly, hands-on technical support to Apple customers in need. You quickly diagnose product issues on the spot, explaining situations with patience and empathy. After determining whether repairs can be done or a replacement is needed, you offer solutions to quickly get users up and running again. Even if you're juggling more than one customer, you stay conscious of their time demands as well as your own. You fulfill Apple's service commitment with style, speed, and skill. And you earn the trust of customers and coworkers alike as you offer guidance, knowledge, and even tips and training.", "key_qualifications": "", "preferred_qualifications": "Strong people skills and a knack for problem solving. Ability to maintain composure and customer focus while troubleshooting and solving technical issues. Ability to adhere to a schedule of customer appointments. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You have an aptitude for acquiring skills in technical repairs and an eagerness to learn. You have excellent time management skills and can make decisions quickly. You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438075"}