{"title": "TR-Teknik Uzman", "summary": "Müşteriler ürünlerimizi satın aldıktan sonra, yeni Apple teknojilerinden en verimli şekilde faydalanmaları için yardımcı olacak kişi sizsiniz. Apple Store'da, birbirinden farklı birçok destek ve hizmet görevlerine odaklı bir gün geçirirsiniz. İster müşterilere Mac kullanmaya başlamaları için yardım ediyor, ister Apple aygıtlarıyla ilgili bir soruyu yanıtlıyor olun, her an bilginizi paylaşmaya ve sıra dışı bir destek sunmaya hazır olun. Müşterilerinize çözüm ve yararlı bilgi sunmak, Apple ile ilişkilerini bir üst düzeye çıkarmak sizi mutlu eder. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız. Tam zamanlı ve yarı zamanlı çalışma olanakları mevcuttur.", "description": "Teknik Uzman olarak, yeni ürün sahiplerinin ürünlerini kullanmaya başlamalarına, mevcut ürün sahiplerininse hızlı ve etkin destek alarak, Apple ile güçlü ve pozitif bir ilişki kurmalarına yardımcı olursunuz. Bir müşterinin yardıma ihtiyacı olduğunda, durumunu hızla değerlendirirsiniz. Müşterilerinize iPod, iPhone ve iPad aygıtları konusunda yardımcı olmak için, mevcut Apple teknolojisi hakkındaki bilginizi kullanarak öneride bulunur veya çözüm sunarsınız. Gerektiğinde, müşterileri diğer destek ekibi üyelerine yönlendirirsiniz. Yeni müşterilere kişisel eğitim vererek fotoğraf, video veya müzik projelerine başlamak için gereksinim duydukları temel becerileri kazanmalarına yardımcı olursunuz. Müşterilerinizle en iyi şekilde ilgilenme kararlılığınız bütün mağaza ekibine fayda sunar. Apple’ın müşterilerle kurduğu güçlü ilişkileri sürdürmesine yardımcı olarak başarımızda önemli bir rol oynarsınız.", "key_qualifications": "", "preferred_qualifications": "Mağazaya gelen müşterilerin destek ihtiyaçlarını  değerlendirme ve çözüm önerme ya da diğer ekip üyelerine yönlendirme becerisi\nDüzenli olarak farklı teknik uzmanlıklar ve beceriler arasında geçiş yapabilme esnekliği\nÜrünler geliştikçe değişime uyum sağlayabilme\nFarklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur\nGünün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler\nZaman yönetim becerilerinde mükemmellik ve hızlı karar verebilme becerisi.\nSorun giderme ve problem çözme aşamasında sakin olmak ve müşteriye odaklanmak.\nÜrünle ilgili tanılarınızı ve potansiyel çözümleri aktarırken müşteriyi rahatlatmak.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438203"}