{"title": "ES-Experto en Operaciones", "summary": "Sabes mejor que nadie lo bien que sienta tener en las manos los últimos productos de Apple. Y tu trabajo es asegurarte de que todos los clientes salgan de la tienda con esa misma sensación. También tienes que dirigir y supervisar al equipo para que se adapten a los constantes cambios en la demanda y para garantizar que cada producto y cada equipo de demo están donde deben estar. La misión de los Apple Store, que es conectar a las personas con productos increíbles, depende de tu capacidad de organización y de tu dedicación. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí.\n\nTenemos puestos a jornada parcial y completa.", "description": "Como Experto en Operaciones, tú y tu equipo tenéis la tremenda responsabilidad de garantizar que los productos lleguen al último eslabón de la cadena: las manos de los clientes. Controlas el inventario de la tienda al completo: productos, piezas, herramientas, materiales y todo lo demás. Compruebas que tu equipo dispone del apoyo, los conocimientos y los recursos necesarios para hacer que siempre haya productos disponibles, realizar las tareas de inventario y mantener el almacén organizado a medida que llegan productos nuevos. Estás siempre en contacto con el equipo de Leadership y les informas sobre el stock de productos y piezas. Cuando llegan productos nuevos, eres el primero en abrirlos y los presentas al resto del equipo. Apple crea los productos, pero tú haces que lleguen a las manos de los clientes.", "key_qualifications": "", "preferred_qualifications": "Capacidad para pensar rápido y resolver problemas en un entorno de cambio constante.\nHabilidades de liderazgo, dando ejemplo y supervisando el equipo.\nGran capacidad de organización y restablecimiento rápido del orden en cualquier situación.\nContribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo.\nPones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día.\nEres capaz de responsabilizarte de los plazos semanales de inventario.\nEstás dispuesto a cumplir todas las normas para que el acceso y el traslado de los productos en el almacén sean seguros.\nHablas el idioma local con fluidez.\nEs imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438050"}