{"title": "MX-Genius", "summary": "En el Apple Store, mantienes la confianza de los clientes en Apple como experto capacitado, resolviendo problemas y reparando productos. Utilizas tus habilidades para resolver problemas e interactuar con personas para garantizar que los clientes del Genius Bar reciban soluciones rápidas para sus problemas técnicos. También capacitas a los miembros del equipo sobre nuestros productos, mientras te mantienes actualizado en tus propios conocimientos técnicos de manera independiente. Con tu carácter empático y gran servicio al cliente, proporcionas asesoría y servicio Genius todos los días. Tenemos trabajos de tiempo completo y de medio tiempo. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo.", "description": "Como Genius, brindas asesoría detallada, así como soporte técnico práctico y amigable a los clientes de Apple que lo necesiten. Diagnosticas los problemas con los productos rápidamente y de inmediato, explicando la situación con paciencia y empatía. Después de determinar si se pueden hacer reparaciones o si es necesario un reemplazo, ofreces las soluciones para que los clientes puedan volver a usar su producto cuanto antes. Aun cuando estés atendiendo a más de un cliente, siempre tienes en cuenta sus exigencias de tiempo y también las tuyas. Cumples con el compromiso de servicio de Apple con estilo, velocidad y habilidad. Y te ganas la confianza de los clientes y de tus compañeros de trabajo al ofrecer asesoría, conocimientos e incluso consejos y capacitación.", "key_qualifications": "", "preferred_qualifications": "Buenas habilidades para interactuar con personas y un don para resolver problemas. Capacidad para mantener la calma y enfocarte en el cliente al detectar y resolver problemas técnicos. Capacidad para apegarte a los horarios de las citas con los clientes. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Tienes la capacidad de adquirir habilidades para las reparaciones técnicas yganas de aprender. Tienes excelentes habilidades de administración del tiempo y puedes tomar decisiones rápidamente. Debes tener flexibilidad de horarios. Tus horas de trabajo dependerán de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438291"}