{"title": "MX-Creativo", "summary": "¿Te apasiona conectar con otras personas? Como Creativo, haces que la gente que visita el Apple Store libere su creatividad al compartir tus conocimientos, no importa si son clientes nuevos o existentes. Eres la base del entorno del Apple Store que ofrece una bienvenida cálida e invita a las personas a compartir sus ideas y hacerlas realidad. Quienes trabajan a tu lado son personas conocedoras que se esfuerzan por compartir sus habilidades y aprender más. Nada te emociona más que capacitar a un cliente para que cree algo maravilloso. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo.", "description": "Como Creativo, tu función principal en el Apple Store es instruir, ya sea enseñando a grupos pequeños o atendiendo a clientes. Utilizas tus habilidades de presentación para actuar como facilitador, ayudando a los usuarios a prepararse, capacitarse y ponerse en marcha. Pero también escuchas atentamente y te tomas el tiempo para entender lo que cada asistente quiere lograr o aprender. Al adaptar tu estilo para enseñar de acuerdo al nivel de conocimientos de cada participante, maximizas su comprensión y también tu tiempo. Reconoces que cuando los clientes compran un nuevo producto podemos impulsar el logro de sus objetivos. Pasas gran parte de tu tiempo impartiendo sesiones programadas, pero también sientes confianza interactuando con los clientes de la tienda entre ellas. Te enorgullece enriquecer la vida de otras personas enseñando, no importa si son clientes o colegas, de un modo que sólo los Creativos pueden.", "key_qualifications": "", "preferred_qualifications": "Pasión por la educación y habilidad para instruir al permitir que los asistentes aprendan mediante la práctica. Habilidad para enseñar a grupos pequeños y a varios clientes simultáneamente. Tenacidad para ayudar a los clientes a aprovechar al máximo sus dispositivos. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Disfrutas de la venta, así como de enseñar y ayudar a los miembros de tu equipo cuando lo necesitan. Sabes motivarte y actuar de manera independiente, y puedes adaptarte a horarios de capacitación estrictamente establecidos. Tienes la habilidad para recomendar otras opciones de servicio en la tienda, como los servicios de empresas y Genius Bar. Debes tener flexibilidad de horarios. Tus horas de trabajo dependen de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438295"}