{"title": "IT-Specialista", "summary": "Come Specialista, contribuirai a creare passione ed entusiasmo per i nostri prodotti, offrendo le giuste soluzioni e consegnando i prodotti nelle mani dei clienti. Sei consapevole del fatto che l’Apple Store è pensato per offrire ai clienti un’esperienza unica nel suo genere. Sarai tu a darle vita individuando le loro esigenze. E con l’aiuto dei membri del team dello Store, abbinerai tali esigenze ai prodotti giusti. Ogni giorno avrai l’opportunità di trasformare un visitatore dello Store in un fedele cliente Apple. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio. Opportunità di lavoro full-time e part-time.", "description": "Come Specialista, dovrai essere particolarmente abile nello scoprire le esigenze dei clienti e nel proporre soluzioni brillanti. Non solo sarai la prima persona che i clienti incontrano quando entrano nello Store, ma sarai anche la persona che li guiderà, consigliandoli, vendendo e perfino configurando i loro nuovi prodotti. Avrai anche altri ruoli all’interno dello Store, come curare l’esposizione della merce o assistere i membri del team. Dovrai sempre restare al passo con le novità su prodotti e iniziative, ed essere pronto ad applicare ciò che sai nelle interazioni con i clienti. Il tuo successo sarà valutato in base alla produttività individuale e a quella del team, nonché alle prestazioni globali dello Store. Sarai orgoglioso di rappresentare Apple e otterrai grande soddisfazione nell’aiutare i clienti a sviluppare relazioni durature con Apple.", "key_qualifications": "", "preferred_qualifications": "Capacità di offrire ai clienti esperienze eccezionali in un ambiente molto dinamico e di essere stimolato da una costante interazione personale. Forte interesse per la tecnologia, in particolare per i prodotti Apple, e capacità di imparare rapidamente a usare nuovi prodotti e funzioni. Eccellenti capacità di comunicazione che ti permettono di conversare liberamente e tranquillamente sia con piccoli gruppi sia con i singoli clienti. Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare. Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente. Hai una passione per Apple e non vedi l’ora di condividerla. Hai voglia di imparare e mettere in pratica i fondamenti dell’esclusivo servizio clienti Apple. Hai spiccate capacità interpersonali: sei disponibile e sai ascoltare e comprendere gli altri. Ottima conoscenza della lingua locale. Devi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438095"}