{"title": "IT-Esperto Business", "summary": "All’Apple Store, proporrai a imprenditori e professionisti gli strumenti giusti per soddisfare le loro esigenze aziendali. Come Esperto Business, li aiuterai a scoprire i prodotti e a esplorare diverse possibilità. Farai parte di un team che lavora con passione per promuovere il successo delle imprese. Sarai felice di offrire soluzioni efficaci e innovative a ogni cliente, grazie alla tua conoscenza delle esigenze business e del tuo entusiasmo per l’azienda. Promuoverai con chiunque una cultura capace di accogliere tutte e tutti, in cui ogni persona sia motivata a dare il meglio.", "description": "Come Esperto Business, presenterai soluzioni, tecnologie e servizi Apple a un pubblico di professionisti. Lavorerai alle vendite, incontrando i clienti business (nuovi o già acquisiti) e imparando a conoscere le loro esigenze. Creerai nuove opportunità di vendita e coltiverai relazioni, sia telefonicamente che attraverso workshop ed eventi in store. Organizzerai meeting con i clienti e scoprirai le loro esigenze. Inoltre, lavorerai con il Team Aziende alla preparazione e alla presentazione delle proposte. Per i clienti con esigenze più complesse, collaborerai con l’intero Team Aziende per trovare la soluzione ideale. Infine, descriverai ai clienti tutte le opzioni di supporto e assistenza disponibili. Parlando ai clienti delle possibilità di applicazione della nostra tecnologia nelle loro aziende, contribuirai al loro successo e a quello del tuo team.", "key_qualifications": "", "preferred_qualifications": "Conoscenza dell’uso della tecnologia in ambito aziendale e delle soluzioni offerte da Apple.,Dimestichezza nell’usare il telefono per interagire con i clienti e proporre soluzioni aziendali.,Capacità di presentare esperienze aziendali tramite briefing, workshop ed eventi all’interno dello Store.,Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare.,Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente.,Hai esperienza di vendita nel mercato business.,Hai dimestichezza nello sviluppare opportunità di vendita telefonicamente.,Hai spiccate capacità interpersonali e di presentazione, ed eccellenti capacità di comunicazione scritta e orale.,Ottima conoscenza della lingua locale.,Devi poter accettare orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438085"}