{"title": "ES-Genius", "summary": "Trabajas en el Apple Store como experto en mantener la confianza de los clientes en Apple ayudándoles en las incidencias con sus productos y las reparaciones. Usas tus habilidades técnicas e interpersonales para asegurarte de que los usuarios del Genius Bar reciben una solución inmediata a su problema. También mantienes al día tus conocimientos y compartes con los miembros de tu equipo información sobre los productos. Como Genius, ofreces consejo y ayuda con empatía y mantienes un nivel excepcional de atención al cliente todos los días. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí.\n\nTenemos puestos a jornada parcial y completa.", "description": "Como Genius, usas tus profundos conocimientos para dar consejos y ofreces asistencia técnica práctica y cercana a los clientes de Apple que lo necesitan. Haces un diagnóstico inmediato de las incidencias en el mismo lugar y explicas la situación con paciencia y empatía. Cuando determinas que se puede hacer una reparación o que es necesario un cambio, ofreces a los clientes soluciones que les vuelven a poner en marcha rápidamente. Aunque tengas que atender a varios usuarios, eres consciente del tiempo que debes dedicarles y del que dispones. Asumes el compromiso de Apple de ofrecer un estilo único de atención al cliente con rapidez y destreza. Te ganas la confianza guiando, compartiendo y si es necesario formando tanto a clientes como a compañeros.", "key_qualifications": "", "preferred_qualifications": "- Grandes dotes para la relación interpersonal y el tratamiento de incidencias.\n- Habilidad para mantener la calma y la dedicación al cliente durante la resolución de problemas.\n- Capacidad para respetar estrictamente los horarios de las citas.\n- Contribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo.\n- Pones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día.\n- Tienes aptitudes y te apasiona aprender sobre reparaciones técnicas.\n- Gestionas el tiempo de manera excelente y tomas decisiones rápidas.\n- Hablas el idioma local con fluidez.\n- Es imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438049"}