{"title": "BR-Expert em negócios", "summary": "Na Apple Store, você conectará empresários e empreendedores com o que eles precisam para colocar as soluções da Apple em funcionamento nas empresas. Como expert em negócios, você os ajudará a aprender sobre os produtos da Apple e explorar várias possibilidades. Você fará parte de uma equipe cuja paixão é ajudar as empresas a ter êxito. Com seus conhecimentos sobre as necessidades dos negócios e entusiasmo pela Apple, você ficará muito satisfeito por poder oferecer soluções avançadas e inovadoras a todos os clientes. Você trabalha em equipe para promover uma cultura em que todas as pessoas sejam bem-vindas e se sintam inspiradas a fazer o melhor trabalho das suas vidas.", "description": "Como expert em negócios, você apresentará as soluções, tecnologias e serviços da Apple a clientes corporativos. Você ficará na loja, conhecendo clientes corporativos novos e frequentes e entendendo suas necessidades. Você deverá gerar novos leads e construir relacionamentos, comunicando-se pelo telefone ou por meio dos workshops e eventos na loja. Você descobrirá as necessidades dos clientes por meio de briefings e trabalhando com a equipe de negócios para preparar e apresentar propostas. Para clientes com necessidades mais complexas, você trabalhará com toda a equipe de negócios para montar uma solução ideal. Finalmente, você informará e oferecerá aos clientes o pacote completo de opções de suporte de vendas. Fazendo os clientes pensarem sobre a possibilidade de ter a tecnologia da Apple em suas empresas, você contribuirá com o sucesso não só da equipe, mas também dos clientes.", "key_qualifications": "", "preferred_qualifications": "Entender como as empresas usam a tecnologia e que soluções a Apple pode oferecer a elas. Capacidade de interagir com clientes e posicionar soluções de negócios pelo telefone. Capacidade de facilitar experiências de negócios por meio de briefings, workshops e eventos na loja. Contribuir para um ambiente inclusivo, respeitando as diferenças individuais e tendo curiosidade de aprender. Colocar em prática os valores de inclusão e diversidade da Apple nas atividades diárias. Você deve ter pelo menos um ano de experiência em vendas no mercado corporativo. Você deve se sentir cômodo desenvolvendo leads de qualidade por telefone. Você deve ter habilidades avançadas com pessoas e apresentações e habilidades excelentes de comunicação escrita e oral.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438175"}