{"title": "FR - Spécialiste", "summary": "En tant que Spécialiste, vous suscitez dynamisme et enthousiasme autour de nos produits, en proposant des solutions appropriées et en permettant aux clients d'avoir les produits entre les mains. Vous comprenez intimement que l'objectif de l'Apple Store est d'offrir à ses clients une expérience hors du commun. Tout commence par l'identification des besoins du client. Puis, avec le soutien de vos coéquipiers, vous associez ces besoins aux bons produits. Chaque jour qui passe vous donne la possibilité de faire d'un visiteur occasionnel un client fidèle à Apple. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même.", "description": "En tant que Spécialiste, vous êtes très doué pour identifier les besoins des clients, puis pour leur proposer des solutions qui leur seront vraiment utiles. Non seulement vous êtes la première personne sur laquelle tombent les clients à leur entrée dans le magasin, mais vous êtes aussi la personne qui les guide, en leur prodiguant des conseils, en leur vendant des produits et même en configurant leurs achats. Vous assumez également d'autres fonctions au sein de l'Apple Store, comme celle de veiller au respect du merchandising visuel ou de venir en aide aux membres de l'équipe. La curiosité toujours en éveil, vous êtes incollable sur les produits et initiatives diverses, et prêt à mettre en œuvre vos connaissances dans les échanges avec les clients. Votre réussite se mesure à la productivité de l'équipe et des individus ainsi qu'aux les résultats généraux du magasin. Vous êtes fier de représenter Apple et trouvez une grande satisfaction dans le fait d'aider les clients à établir une relation à long terme avec Apple.", "key_qualifications": "", "preferred_qualifications": "Capacité à offrir une excellente qualité de service dans un environnement survolté et à être stimulé par une constante interaction avec les autres. Intérêt très marqué pour la technologie, en particulier pour les produits Apple, et facilité à appréhender de nouveaux produits et fonctionnalités. Sens de la communication très développé, vous permettant de converser avec liberté et aisance tant au sein de petits groupes qu'avec des clients individuels. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre des activités quotidiennes. Vous avez, pour Apple, une véritable passion que vous ne demandez qu'à partager. Vous êtes impatient d'apprendre et d'adopter le sens du service qui fait la marque de fabrique d'Apple. Vous avez un véritable sens du contact : vous êtes facilement abordable, avez une bonne capacité d'écoute et savez montrer de l'empathie. Vous parlez couramment la langue locale. Vous devez accepter une certaine souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438069"}