{"title": "UK-Genius", "summary": "Do you have a passion for hands-on problem solving? Do you love helping others by sharing your technical knowledge? At the Apple Store, whether you work full-time or part-time, you maintain customers’ trust in Apple as a skilled technician, troubleshooting and repairing products. You use your amazing diagnostic and people skills to assure Genius Bar customers of swift resolutions to their technical issues. You offer advice on accompanying accessories that will further improve the customer’s experience with Apple products. You also educate your team members about products, while independently keeping your own technical know-how up to date. With your customer service brilliance and empathetic nature, you provide Genius advice and support to both customers and team members. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As a Genius, you provide insightful advice and friendly, hands-on technical support to Apple customers in need. You quickly diagnose product issues on the spot, explaining situations with patience and compassion. After determining whether repairs can be done or a replacement is needed, you offer solutions to quickly get users up and running again. Even if you’re juggling more than one customer, you stay conscious of their time demands as well as your own. You fulfil Apple’s service commitment with style, speed and skill. And you earn the trust of customers and co-workers alike as you offer mentorship, knowledge and even tips and training. At Apple, we care about improving our services. We’re looking for people who identify problems and provide feedback to ensure our customer service stays relevant and current. Discover even more benefits of doing what you love. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Note: Apple benefits programmes vary by country and are subject to eligibility requirements.", "key_qualifications": "", "preferred_qualifications": "Strong people skills and a knack for problem solving. Ability to maintain composure and customer focus while troubleshooting and solving technical issues. Ability to adhere to a schedule of customer appointments. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. An aptitude for acquiring skills in technical repairs and an eagerness to learn about all Apple products and devices. Excellent prioritisation skills and an ability to make decisions quickly. Excellent verbal and written communications skills. Success in team environments, demonstrating shared responsibility and accountability with other team members. You’re fluent in the local language. Flexibility with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438138"}