{"title": "TR-Uzman", "summary": "Uzman olarak, müşterilere doğru çözümleri sunup, ürünlerimizin çevresinde enerji ve heyecan yaratmamıza yardım edersiniz. Apple Store'un başka hiçbir yerde bulunmayan, benzersiz bir müşteri deneyimi sunmaya adanmış olduğunu anlarsınız. Bu deneyim, sizin müşterilerin ihtiyaçlarını keşfetmenizle başlar. Ardından, mağaza ekibi üyelerinin desteğiyle, bu ihtiyaçları doğru ürünlerle eşleştirirsiniz. Her yeni gün, mağazaya gelen bir ziyaretçiyi sadık bir Apple müşterisine dönüştürmeniz için bir fırsattır. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız. Tam zamanlı ve yarı zamanlı çalışma olanakları mevcuttur.", "description": "Uzman olarak, müşterilerin ihtiyaçlarını belirleme ve ardından akılcı çözümleri ortaya koyma konusunda oldukça yeteneklisiniz. Müşterilerin mağazaya girdiklerinde karşılaştıkları ilk kişi olmanızın dışında, onları yönlendirecek, önerilerde bulunacak, satış yapacak ve hatta yeni ürünlerin kurulumunu sağlayacak kişi de sizsiniz. Mağaza içinde, görsel düzeni korumak ve ekip üyelerine yardımcı olmak gibi başka görevleriniz de bulunmakta. Merakınızı her zaman koruyarak, ürünlerle ve kişisel girişimlerle ilgili haberleri sürekli takip eder ve öğrendiklerinizi müşterilerinizle etkileşim halindeyken kullanmaya hazır olursunuz. Başarınız, ekibinizin ve bireysel olarak sizin üretkenliğinizin yanı sıra mağazanızın genel performansıyla da ölçülür. Apple'ı temsil etmekten gurur duyar ve müşterilerin Apple ile ömür boyu sürecek bir ilişki geliştirmelerine yardımcı olmaktan mutluluk duyarsınız.", "key_qualifications": "", "preferred_qualifications": "Dinamik bir ortamda mükemmel müşteri deneyimleri sunabilmek ve kişisel etkileşimlerle kendini sürekli geliştirebilmek, Teknoloji, özellikle de Apple ürünleri ile oldukça ilgili olmak, yeni ürünleri ve özellikleri hızlı öğrenebilmek, Küçük gruplarla olduğu kadar tek tek müşterilerle de kolaylıkla iletişime geçebilmek ve rahatça sohbet edebilmek, Farklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur, Günün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler, Apple için heyecan duymak ve bu heyecanı başkalarıyla paylaşmak için istekli olmak, Apple'ın benzersiz servis anlayışını öğrenmek ve benimsemek için istekli olmak, İnsanlarla ilişkileri güçlü; canayakın, iyi bir dinleyici ve empati kurabilen bir insan olmak, Esnek çalışma saatlerine uyum sağlayabilmek; çalışma saatleriniz işin ihtiyaçlarına bağlı olacaktır.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438164"}