{"title": "MX-Experto en Operaciones", "summary": "Como Experto en Operaciones, sabes mejor que nadie lo bien que se siente tener el producto más reciente de Apple en tus manos. Ahora es tu responsabilidad hacer que los clientes se sientan tan bien como tú. Al guiar y asesorar a tu equipo, ayudas a mantener el ritmo en las demandas de cambios y te aseguras de que todos los productos y las máquinas de demostración estén donde deben estar. Al final, tus habilidades organizacionales y tu dedicación son la base de lo que el Apple Store hace: conectar a las personas con los productos que les encantan. Colaboras con colegas para fomentar una cultura donde todas las personas pertenezcan y encuentren inspiración para hacer su mejor trabajo.", "description": "Como Experto en Operaciones, tú y tu equipo tienen la increíble responsabilidad de asegurar que los productos lleguen al último paso en la cadena de suministro: los clientes. Estás a cargo del inventario completo de la tienda: los productos, las piezas, las herramientas, el suministro y todo lo demás. Te aseguras de que tu equipo tenga el soporte, conocimiento y los recursos necesarios para mantener la disponibilidad de los productos, completar tareas de inventario y mantener el almacén organizado conforme llegan los nuevos productos. Estás en constante contacto con los equipos de administración y liderazgo, compartiendo datos sobre los productos y las piezas. Cuando llegan los increíbles productos nuevos, eres el primero en abrirlos y presentarlos a todo el equipo de la tienda. Apple hace los productos, pero tú haces que todo sea posible al estar listo para entregar nuestros productos a nuestros clientes.", "key_qualifications": "", "preferred_qualifications": "Capacidad para pensar ágilmente y para realizar actividades de resolución de problemas, aún en condiciones de constante cambio. Habilidades de liderazgo, ya sea guiando con el ejemplo o capacitando a un grupo. Grandes habilidades organizacionales y capacidad de evaluar rápidamente cualquier situación. Contribuir a una cultura incluyente mediante el respeto a las diferencias de las demás personas y la curiosidad por aprender. Demostrar los valores de inclusión y diversidad de Apple en las actividades diarias. Puedes gestionar y cumplir con múltiples plazos de inventarios cada semana. Estás dispuesto a seguir lineamientos para permitir el acceso seguro de los productos y su movimiento a través del almacén. Debes tener flexibilidad de horarios. Tus horas de trabajo dependen de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438285"}