{"title": "NL-Expert", "summary": "De Apple Store is een ongeëvenaarde winkelomgeving, die erop is gericht om een unieke klantenservice te bieden. Als Expert leid je klanten binnen in de weergaloze wereld van Apple en maak je van nieuwsgierige bezoekers trouwe klanten. Je geniet van het contact met teamleden en klanten. En het geeft je veel voldoening om elke dag mensen te helpen om een duurzame relatie met Apple aan te gaan. Je creëert samen met anderen een cultuur waar alle medewerkers welkom zijn en hun werk optimaal kunnen doen. Er zijn zowel fulltime- als parttimefuncties beschikbaar.", "description": "Als Expert ben je sterk in verkoop, productkennis en oplossingen en kom je gezaghebbend over. Ook weet je hoe je van een enigszins nieuwsgierige klant een zeer geïnteresseerde klant en zelfs een koper kunt maken. Wanneer er nieuwe producten en initiatieven komen, ben jij de eerste die ervan weet en je teamleden op de hoogte stelt en inspireert door je benaderbare en actieve opstelling. Je haalt altijd je targets of overtreft ze. Je bent er trots op om voor Apple te werken en dat laat je zien in de manier waarop je met klanten omgaat.", "key_qualifications": "", "preferred_qualifications": "Aantoonbare technologische kennis, met name van Apple producten, en in staat om snel kennis over nieuwe producten te vergaren. Aantoonbare ervaring op het gebied van verkoop, technologische oplossingen en het werken aan klantenbinding. In staat om consequent, ongeacht de situatie, een ongekende klantenservice te bieden. Bijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn. De waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden. Je bent enthousiast over Apple en draagt dat enthousiasme uit wanneer je anderen vertelt over alles wat Apple te bieden heeft. Je kunt in woord en daad de unieke stijl van dienstverlening laten zien waar Apple voor staat. Je kunt goed met mensen omgaan: je staat open voor anderen, je kunt goed luisteren en je kunt je inleven in anderen. Je kunt een stimulerende voorbeeldfunctie voor Specialists vervullen. Je beheerst de lokale taal uitstekend. Je zult je flexibel moeten opstellen wat je werktijden betreft. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438111"}