{"title": "ES - Especialista: Jornada completa, parcial y parcial con contrato temporal", "summary": "Como Especialista, contribuyes a crear interés y expectación por nuestra marca, ofreces las soluciones más adecuadas y pones nuestros productos en las manos de los clientes. Entiendes que el objetivo del Apple Store es ofrecer a los usuarios una experiencia única. El primer paso es averiguar las necesidades de los clientes. Y, con el apoyo de los miembros del equipo de la tienda, satisfaces esas necesidades con el producto perfecto. Cada día es una nueva oportunidad de transformar a un visitante de la tienda en un cliente fiel de Apple. Trabajas en equipo para crear un espacio en el que todo el mundo se sienta aceptado y valorado, y pueda dar lo mejor de sí.\n\nEn este puesto puedes trabajar a jornada completa, a tiempo parcial o a tiempo parcial de manera temporal.", "description": "Como Especialista, estás capacitado para averiguar las necesidades de los clientes y responder a ellas con soluciones brillantes. No solo eres la primera persona con la que hablan los clientes al llegar a la tienda, sino que también les guías, les aconsejas, les ofreces productos e incluso se los configuras. También realizas otras tareas dentro de la tienda, como mantener los elementos visuales de marketing o ayudar a otros miembros del equipo. Eres curioso, estás al día de los productos e iniciativas, y te encanta aplicar tus nuevos conocimientos en tu relación con los clientes. Tu éxito se mide a través de tu rendimiento, el de tu equipo y el de la tienda en su conjunto. Te sientes orgulloso de representarnos y sientes una gran satisfacción sabiendo que ayudas a crear vínculos duraderos entre los clientes y Apple.", "key_qualifications": "", "preferred_qualifications": "Capacidad para ofrecer a los clientes un trato excepcional en un entorno siempre cambiante y energía para interactuar con un flujo constante de personas. Interés en la tecnología, especialmente en los productos de Apple, y aprendizaje rápido de nuevos productos y prestaciones. Grandes dotes de comunicación para conversar con libertad y comodidad tanto con pequeños grupos como con clientes individuales. Contribuyes a crear un entorno inclusivo respetando las diferencias de cada persona y demostrando interés por seguir aprendiendo. Pones en práctica los valores de inclusión y diversidad de Apple en las tareas del día a día. Te apasiona Apple y quieres compartir esa pasión con los demás. Te gustaría aplicar nuestro estilo único de atención al cliente. Tienes gran habilidad para el trato con el cliente: eres accesible, sabes escuchar y empatizas. Hablas el idioma local con fluidez. Es imprescindible flexibilidad horaria. Tu horario de trabajo dependerá de las necesidades del negocio.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438056"}