{"title": "SE-Creative", "summary": "Gillar du att skapa relationer med människor? Som Creative inspirerar du till kreativitet genom att dela med dig av din kunskap till alla som besöker Apple Store – nya såväl som återkommande, lojala kunder. Du utgör grunden för butikens välkomnande atmosfär som uppmuntrar besökarna att dela med sig av sina idéer och lära sig hur de kan förverkliga sina visioner. Du arbetar tillsammans med kunniga kollegor som är lika angelägna om att dela med sig av sin kunskap som att lära sig nya saker. Inget gör dig gladare än att förse en kund med de kunskaper och verktyg som behövs för att skapa något underbart. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa. Rollen finns både som heltids- och deltidstjänst.", "description": "Din huvudsakliga uppgift som Creative på Apple Store är att utbilda andra – i mindre grupper eller genom att hjälpa enskilda kunder. Du använder dina färdigheter som presentatör för att leda pass och hjälpa användare att komma igång. Du är dessutom en utmärkt lyssnare som tar dig tid att verkligen förstå vad varje användare hoppas uppnå eller lära sig. Du maximerar kundernas förståelse, såväl som din egen tid, genom att anpassa din undervisningsstil till varje användares individuella kunskapsnivå. Du är medveten om att ett köp av en ny produkt ibland kan hjälpa kunderna att uppnå sina mål. Du ägnar en stor del av din tid åt att leda schemalagda pass, men mellan passen tar du även gärna hand om butikens kunder. Du är stolt över att berika andra, kunder såväl som kollegor, genom att lära ut – på ett sätt som bara en Creative kan.", "key_qualifications": "", "preferred_qualifications": "Brinner för att utbilda och har förmågan att ge användare möjligheten att lära genom att testa själva.\nFörmåga att undervisa små grupper och flera kunder samtidigt.\nSträvan att bistå användarna att få största möjliga nytta och glädje av sina produkter.\nBidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra.\nFörverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet.\nDu känner dig bekväm både i rollen som säljare och som utbildare och kan vid behov hjälpa dina kollegor.\nDu är motiverad och självgående och kan följa ett strukturerat utbildningsschema.\nDu är skicklig på att rekommendera de supportlösningar som erbjuds i butiken, till exempel företagstjänster och Genius Bar.\nDu talar det lokala språket flytande.\nDu kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438123"}