{"title": "TR-Genius", "summary": "Apple Store'da, donanımlı bir uzman olarak sorunları çözümleyip ürünleri onararak müşterilerin Apple'a duydukları güvenin devam etmesini sağlayan sizsiniz. Genius Bar’a gelen müşterilerin teknik problemlerine hızlı çözümler bulmak için problem çözme ve insan ilişkileri konusundaki yeteneklerinizi kullanırsınız. Ayrıca ekip üyelerini ürünler konusunda eğitirken, kendi teknik bilginizi de güncel tutarsınız. Mükemmel müşteri hizmetiniz ve empatik yaklaşımınızla, her gün “Genius” öneriler sunar ve desteklersiniz. Herkesin kendini ait hissettiği ve en iyi işini çıkarma konusunda ilham aldığı bir kültürü desteklemek için başkalarıyla birlikte çalışırsınız.\n\nTam zamanlı ve yarı zamanlı çalışma olanakları mevcuttur.", "description": "Bir “Genius” olarak, ihtiyacı olan Apple müşterilerine uygulamalı teknik destek sağlarken arkadaşça bir yaklaşımla açıklayıcı öneriler sunarsınız. Ürünlerle ilgili sorunları anında tespit eder, sorunun kaynağını müşterilerinize sabırla ve empatiyle anlatırsınız. Ayrıca ürünün onarım ya da parça değişim ihtiyacını belirledikten sonra, müşterilerinize ürünün çabucak kullanılır hale gelmesini sağlayacak çözümler sunarsınız. Birden fazla müşteriyle ilgilenirken bile, hem müşterilerinizin hem kendinizin zamanının değerli olduğunun bilincindesinizdir. Apple'ın hizmet taahhüdünü hızlı ve deneyimli tarzınızla yerine getirirsiniz. Danışmanlık yaparken, eğitim verirken, bilgilerinizi ve hatta ipuçlarını anlatırken, hem müşterilerinizin hem çalışma arkadaşlarınızın güvenini kazanırsınız.", "key_qualifications": "", "preferred_qualifications": "Güçlü insan ilişkileri ve problem çözme becerisine sahip olmak\nTeknik problemleri ve anlık sorunları çözerken soğukkanlılığını ve müşteri odaklı yaklaşımını korumak\nPlanlanan müşteri randevularının zamanında gerçekleşmesini sağlamak\nFarklılıklara saygı göstererek ve öğrenme merakıyla, birlikteliği destekleyen bir ortam oluşturulmasına katkıda bulunur\nGünün her anında Apple’ın kültürel çeşitlilik ve birliktelik değerlerini sergiler\nTeknik onarım becerileri edinmeye yatkın ve öğrenme konusunda istekli olmak\nZaman yönetim becerilerinde mükemmellik ve hızlı karar verebilme becerisine sahip olmak.\nEsnek çalışma saatlerine uyum sağlayabilmek; çalışma saatleriniz işin ihtiyaçlarına bağlı olacaktır.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438166"}