{"title": "AT-Expert (m/w/x)", "summary": "Der Apple Store ist ein Ort wie kein anderer, um das Leben unserer Kunden zu bereichern. Als Expert führst du sie in die faszinierende Welt von Apple ein und machst aus neugierigen Besuchern treue Kunden. Dich motiviert die Interaktion mit Kunden genauso wie die Zusammenarbeit mit deinem Team. Und es erfüllt dich mit großer Zufriedenheit, Tag für Tag Menschen dabei zu helfen, eine lebenslange Beziehung zu Apple aufzubauen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Expert fühlst du dich im Verkauf in deinem Element. Du weißt alles über Apple Produkte und Lösungen und dein Engagement für unsere Kunden ist vorbildlich. Aber du weißt auch, wie du neugierige Kunden begeisterst und sie zu glücklichen Besitzern eines Apple Produkts machst. Du erfährst als Erster von neuen Produkten und Initiativen und teilst Wissen und Inspiration mit den Mitgliedern deines Teams. Dabei bist du zugänglich und hilfsbereit. Du erreichst die vorgegebenen Leistungsziele immer oder übertriffst sie sogar. Du bist stolz darauf, Apple zu repräsentieren, und zeigst das im Gespräch mit Kunden.", "key_qualifications": "", "preferred_qualifications": "Hohe technische Kompetenz, insbesondere bei Apple Produkten, und die Fähigkeit, den Umgang mit neuen Produkten schnell zu erlernen. Erfahrung im Verkauf und mit Technologielösungen sowie beim Aufbau von Kundentreue. Fähigkeit, Kunden in jeder Situation ein einzigartiges Serviceerlebnis zu bieten. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du liebst es, deine Leidenschaft für Apple Produkte mit anderen zu teilen und sie über alles zu informieren, was Apple zu bieten hat. Du setzt den Maßstab für den einzigartigen Service von Apple mit allem, was du sagst und tust. Du zeichnest dich durch ausgeprägte Sozialkompetenzen aus – du bist hilfsbereit, einfühlsam und kannst gut zuhören. Du bist ein Vorbild für Specialists. Flexible Arbeitszeiten sind kein Problem für dich. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig. Das Bruttojahresgehalt für eine Vollzeitstelle beträgt gemäß dem anzuwenden Kollektivvertrag mindestens €31,206. Das tatsächliche Gehalt orientiert sich an branchenüblichen Gehältern, deinen Qualifikationen und Erfahrungen.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438333"}