{"title": "NL-Genius", "summary": "Jij zorgt er in de Apple Store voor dat klanten hun vertrouwen in Apple behouden door problemen op te lossen en producten te repareren. Met je technische kennis en je goede contactuele eigenschappen help je klanten die zich bij de Genius Bar melden snel om problemen met een product op te lossen. Ook fris je de productkennis van je teamleden op en houd je zelfstandig je eigen technische kennis op peil. Met je uitmuntende dienstverlenende instelling en je inlevingsvermogen geef je als Genius dagelijks advies en ondersteuning. Je creëert samen met anderen een cultuur waar alle medewerkers welkom zijn en hun werk optimaal kunnen doen. Er zijn zowel fulltime- als parttimefuncties beschikbaar.", "description": "Als Genius geef je Apple klanten die met een technisch probleem bij je komen deskundig advies en geef je ze vriendelijk praktische, technische ondersteuning. Je beoordeelt snel ter plaatse wat er met een product aan de hand is en licht situaties geduldig en met het nodige inlevingsvermogen toe. Nadat je hebt vastgesteld of er een reparatie kan worden uitgevoerd of dat een product moet worden vervangen, bied je oplossingen aan waardoor de klant snel weer verder kan. Ook als je met meerdere klanten tegelijk te maken hebt, houd je in wederzijds belang een oog op de klok. Je maakt netjes, snel en bekwaam de servicegerichte instelling van Apple waar. En je wint het vertrouwen van zowel klanten als collega's door hen met raad en daad bij te staan en zelfs trainingen te geven.", "key_qualifications": "", "preferred_qualifications": "Goede contactuele eigenschappen en goed in het oplossen van problemen. In staat om tijdens het oplossen van technische problemen kalm en klantgericht te blijven. In staat om stipt volgens een afsprakenrooster te werken. Bijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn. De waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden. Je pikt snel op hoe je technische reparaties uitvoert en je bent leergierig. Je kunt zeer efficiënt omgaan met de beschikbare tijd en je kunt snel beslissingen nemen. Je beheerst de lokale taal uitstekend. Je zult je flexibel moeten opstellen wat je werktijden betreft. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438112"}