{"title": "SE-Technical Specialist", "summary": "När kunderna har köpt våra produkter är du den som hjälper dem att få ut mer av sin nya Apple-teknik. Din arbetsdag på Apple Store består av en rad uppgifter med fokus på service och support. Du är alltid redo att dela med dig av din kunskap och att ge kunderna en enastående upplevelse, vare sig du hjälper en kund att komma igång med sin nya Mac eller hittar svaren på frågor om andra Apple-produkter. Du trivs med att lösa kunders problem, ge dem aha-upplevelser och stärka deras band till Apple. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa.\n\nDet finns både heltids- och deltidsjobb.", "description": "Som Technical Specialist hjälper du nya kunder att komma igång och ger befintliga kunder snabb och effektiv support, samtidigt som du skapar och stärker deras positiva relation till Apple. När en kund behöver hjälp utvärderar du snabbt situationen. Ibland använder du dina kunskaper om dagens Apple-teknik till att direkt ge kunderna goda råd eller presentera lösningar på deras problem med iPod, iPhone eller iPad. Vid andra tillfällen hänvisar du kunder till supportteamet som ser till att de kommer igång igen. Du kan också utbilda nya kunder på tu man hand och lära dem grunderna som behövs för att komma igång med foto-, video- och musikprojekt. Hela butiksteamet drar nytta av ditt starka engagemang för bästa möjliga kundservice. Eftersom du hjälper Apple att skapa och bevara starka relationer till kunderna är du en viktig del av vår framgång.", "key_qualifications": "", "preferred_qualifications": "Förmåga att utvärdera kunders supportbehov när de kommer, för att sedan presentera lösningar eller hänvisa dem till andra medarbetare.\nFlexibilitet att regelbundet kunna växla mellan olika tekniska områden med de färdigheter som krävs.\nFörmåga att stimuleras av förändringar när produkter utvecklas.\nBidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra.\nFörverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet.\nDu är skicklig på att använda din tid på bästa sätt och fatta snabba beslut.\nDu behåller lugnet och kundfokus medan du felsöker och löser problem.\nDu talar det lokala språket flytande.\nDu får kunder att känna sig trygga och väl omhändertagna när du ger produktdiagnoser och möjliga lösningar.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438205"}