{"title": "FR-Créatif", "summary": "Vous adorez interagir avec d’autres personnes ? En tant que Creative, vous encouragez la créativité en partageant vos connaissances avec les personnes qui visitent l’Apple Store, que ce soit des clientes ou clients réguliers ou qui viennent pour la première fois. Vous êtes un élément fondateur de votre Apple Store et savez créer un environnement accueillant propice au partage des idées et des individualités en vue de donner vie à toutes les idées. Les personnes travaillant à vos côtés sont compétentes et ont la même soif de partager leurs aptitudes et d’en apprendre davantage que vous. Rien ne vous satisfait plus que d’aider une personne à créer quelque chose de fabuleux. Vous travaillez avec d’autres pour promouvoir une culture dans laquelle chaque personne se sent acceptée et encouragée à donner le meilleur d’elle-même. Des emplois à temps partiel comme à temps plein sont disponibles.", "description": "En tant que Creative, votre rôle principal au sein de l’Apple Store est de partager vos connaissances, que ce soit à des petits groupes ou à des personnes seules. Vous mettez à profit vos capacités de présentation pour faire l’animation et aider les personnes avec la mise en service de leur appareil, ainsi qu’avec l’apprentissage des étapes suivantes. Vous avez une incroyable capacité d’écoute et prenez le temps de comprendre les besoins de chaque personne. Vous savez ajuster votre style de pédagogie en fonction des compétences de la personne en face de vous, pour optimiser sa compréhension en même temps que votre temps. Vous avez compris que l’achat d’un nouveau produit peut parfois aider la clientèle à satisfaire ses attentes. Vous passez la majeure partie de votre temps à animer des séances planifiées, mais êtes aussi capable d’interagir aisément avec la clientèle du magasin entre deux séances. Vous ressentez beaucoup de fierté à enrichir la vie des gens autour de vous, que ce soit la clientèle comme les membres de l’équipe, à travers vos enseignements.", "key_qualifications": "", "preferred_qualifications": "Passion pour l’enseignement et capacité à enseigner en laissant les personnes apprendre par elles-mêmes. Capacité à enseigner simultanément à des petits groupes et à des personnes seules. Ténacité à travailler avec des personnes en vue de les aider à tirer le meilleur parti de leur appareil. Contribue à promouvoir un environnement inclusif en respectant les différences d’autrui et en s’y intéressant. Met en application les valeurs d’inclusion et de diversité chères à Apple dans le cadre de ses activités quotidiennes. Vous êtes aussi à l'aise dans la vente que dans la formation et aidez les membres de votre équipe en fonction de leurs besoins. Vous êtes autonome, savez être votre propre moteur et n'avez aucun mal à vous soumettre à un programme de formation très structuré. Vous savez recommander d'autres options d'assistance en magasin, telles que les services aux entreprises et le Genius Bar. Vous parlez couramment la langue locale. Vous devez accepter une certaine souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/114438060"}