{"title": "Graphics Core Hardware Verification Engineer", "summary": "Imagine what you could do here.  At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there is no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here.  The people who work here have reinvented entire industries with all Apple Hardware products.  The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it.  The team at our UK GPU Design Centre work on complex, large-scale GPU related projects. The Graphics Core Hardware Verification Engineer will be responsible for subsystem and top-level pre-silicon RTL verification of embedded graphics cores.", "description": "Use SystemVerilog, UVM and C++ with industry leading simulation tools and methodologies to verify complex GPU designs. Develop and drive verification plans. Generate constrained random and directed tests to implement verification plan. Run simulations and debug issues across hardware and software. Craft verification test bench components to monitor and check design. Create functional coverage points, analyze coverage, and enhance test environment to target coverage holes. Create automated verification flows for graphics core verification.", "key_qualifications": "You will have the following experience: Experience in verification of complex hardware at system or component level with ability to debug issues across hardware and software. Experience of working in complex ASIC or SoC designs. Good knowledge of Computer Architecture, General Purpose Microprocessor, graphics architecture and Memory sub-system micro-architecture. Hardware description and verification languages (Verilog, SystemVerilog, Specman, Vera & VHDL), industry standard simulators, formal tools, waveform viewers and coverage flows. Experience in creating verification testplans and driving them to closure. Experience defining coverage space, writing coverage model, analyzing results. Experience in GPU architecture and OpenGL/CL is a plus. Experience with scripting languages like Python, Go, Ruby or Perl a plus. Excellent communication skills and ability to collaborate under aggressive schedules", "preferred_qualifications": "", "education_experience": "BS/MS CE or EE or related field,", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200002558"}