{"title": "Firmware WiFi Engineer", "summary": "Do you imagine what you could do here? At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. Apple is looking for an extraordinary FW engineer to drive state of the art technologies for Apple products. In this role, you will work with a variety of disciplines and products, developing software and firmware at the WiFi MAC Level. You'll ensure that every aspect of our products works both on its own and together. It’s our goal to make Apple products smarter and more efficient than ever before. Join us, and you’ll directly impact the functionality of devices people use worldwide.", "description": "As a senior WiFi MAC Software Engineer, your contributions will include the following: Writing design documents. Designing and implementing software and firmware for WiFi and 802.11 MAC Level features at the MAC. Optimise and fine-tune the firmware and MAC Level algorithms. Involvement in firmware architecture design, and system level requirements from top-level down to block level. Develop and support OSX development tools and kernel drivers. This role requires high sense of responsibility and ability to work in team. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us if you want to help deliver the next amazing Apple product!.", "key_qualifications": "5+ years of Low Level Embedded software/firmware development - Mandatory. Experience and proficiency in C development - Mandatory. Experience with communications protocols and host I/F such as TCP/IP, UDP, USB, PCIe, UART et. Preferable - Experience with developing mobile products and protocols, WiFi, BT, Cellular, etc. Preferable - Experience using other common programming languages, such as Objective- C, Java, C++, Python. Preferable - Experience with ARM micro-controllers. Preferable - Experience with development in OSX and iOS environments. Exceptional problem solving and debugging skills. Independent, highly motivated, with good interpersonal skills.", "preferred_qualifications": "", "education_experience": "B.Sc or higher degree in Computer Science or technically equivalent field is required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200000408"}