{"title": "WiFi System Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability and performance of the product? You will become part of a hands-on development team that furthers engineering perfection, creativity and innovation. Dynamic, inspiring people and innovative technologies are the norm here. We want you to join our team if you are a resourceful engineer with the desire to research and develop solutions that do not yet exist. We are looking for someone like you, to join our Wireless Connectivity group.", "description": "You will engage in a collaborative, fast-paced environment to integrate new technologies into a product category that represents the frontier of consumer electronics, responsible for ensuring the quality of the SOC. Define system level behaviour of the wireless sub-system - HW definitions, HW-FW partition etc. Write system level documentation. Have strong communication skills combined with good collaborative approach to lead complex integration efforts in a specific area of the system. Strong debug capabilities. You will triage problems and understand if it is MAC/PHY, HW/SW and propose FW work around / HW fixes. Work closely with design, FW and micro-architecture teams to define the functional & performance goals of the system. Work independently & lead deliverables to align with the project goals plus support multi-functional engineering efforts", "key_qualifications": "4+ years of experience, 2 out of which in System/ASIC Design/Verification. Deep understanding of communication systems (i.e. more than one discipline), Specific BT / WiFi knowledge - an advantage. Validated experience with integration of complex systems and bring these complex systems to production. Should be a team player with excellent communication skills and the desire to take on diverse challenges. Scripting capabilities (Python / others). Knowledge of verification / ASIC design - an advantage. Knowledge in programming system level simulations in Matlab / C++ - an advantage.", "preferred_qualifications": "", "education_experience": "- B.Sc / M.Sc in Electrical / Computer Engineering.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200000366"}