{"title": "Image Quality and System Validation Engineer - Camera HW and Depth Group", "summary": "Apple designs consumer electronics that have touched millions and changed how we interact and live. Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. \nDo you love working on challenges that no one has solved yet? The Camera HW and Depth group at Apple develops Depth and Image Sensing systems such as the revolutionary True Depth camera that powers FaceID and the recently released LIDAR scanner. This multi-disciplinary group of cutting edge engineers is responsible for architecture, design, development, characterization and validation of these highly complex sensing systems, aimed for Apple products. \nThis team is looking for an Image Quality and System Validation Engineer to work on advanced cutting edge multidisciplinary system development.", "description": "Be part of a core technology team developing advanced imaging and sensing solutions for future products. \nOwn characterization, test, and validation / Image quality aspects of our ground breaking sensing systems, starting at the early phases (lab prototypes) till complete system maturity (Mass Production). \nOwn entire test cycle from design of experiment including lab setups , test execution, analysis and report. \nDevelop new Image quality / validation / characterization concepts and procedures. \nConduct data driven analysis required for decision making.", "key_qualifications": "3-5 years of multidisciplinary R&D background experience as a System / Characterization / Validation / SW  / User experience / Image / Video quality engineer\nDeep understanding of electro optical systems along with design considerations and tradeoffs\nProven Hands-on experience with scripting languages - Matlab and/or Python", "preferred_qualifications": "Proven Hands-on experience with:\nImage quality metrics\nMachine learning based methods for Image quality assessment\nLab automation of image captures, motion stages, robots\nFamiliarity with Image Signal processor (ISP) algorithms", "education_experience": "B. Sc / M. Sc / PhD in Physics or Optical / System / Mechanical / Biomedical Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200049770"}