{"title": "Software Developer for Validation team", "summary": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices In this role, you will be part of a team that develops tools for automated testing of Apple's products. You will design & implement complicated tests and advanced tools, responsible for the development of test flows, testing tools and automation lab infrastructure.You will Investigate the use cases, system-level operation, and performance requirements. Develop software to control automated labs and validate functionality, and performance of the systems.", "description": "Your responsibilities in this role are likely to include: Development of automation infrastructure to control large and small scale labsDevelopment of SW tools for various testing environmentsTest implementation for different SW and HW modulesTest flow definition and implementation.", "key_qualifications": "At least 3 years of software development experience – Mandatory\nProficiency in python or similar - Mandatory\nFailure analysis and troubleshooting with high debug capabilities- Mandatory\nExperience with Object Oriented Programming- Advantage\nExperience in tool development for testing environments - Advantage\nExperience in working with databases - Advantage.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in CE, CS or EE", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200199066"}