{"title": "NL-Business Pro", "summary": "Als Business Pro ben je verantwoordelijk voor het aangaan en uitbouwen van relaties met veelbelovende zakelijke klanten van Apple Retail. Je bent aantoonbaar in staat om op een persoonlijke en oplossingsgerichte manier in te spelen op de behoeften van klanten. Je hebt gevoel voor business en sales. Je hebt veel kennis van branches met kleine en middelgrote ondernemingen, weet voor welke uitdagingen bedrijven staan en bent op de hoogte van relevante lokale ontwikkelingen.", "description": "Speelt een leidende rol bij de interactie met klanten, het uitbouwen van relaties, het bevorderen van de verkoop, het uitdragen van de meerwaarde van Apple oplossingen voor bedrijven en het verhogen van de klantentrouw, met name onder veelbelovende zakelijke klanten. Maakt plannen voor en doet voorspellingen over prestaties van Business via klantenbeheer, bouwt de pipeline uit en beheert Opportunity’s met behulp van CRM en andere tools. Benadert zakelijke klanten met passie en zelfvertrouwen door onze technologie te demonstreren en ze te helpen ontdekken hoe oplossingen en diensten van Apple en andere fabrikanten een andere manier van werken mogelijk maken. Stelt effectieve accountplannen op om Apple oplossingen uit ons hele ecosysteem te implementeren en uit te breiden tot diep in de organisatie van de klant. Geeft en ondersteunt Briefings en maakt gebruik van workshops om klanten te benaderen. Maakt effectief gebruik van CRM voor relatiebeheer, Opportunity’s en taken, om klantgegevens te verzamelen en up-to-date te houden, en om meer inzicht te krijgen in klanten, op basis van best practices. Fungeert voor collega’s als mentor en vraagbaak als het gaat om de behoeften van en oplossingen voor zakelijke klanten. Bekijkt, analyseert, interpreteert en deelt feedback uit Business NPS om de klantervaring steeds verder te verbeteren. Werkt samen met de Business Development Manager en het account-team voor een naadloze overdracht van klanten volgens de Account Engagement-strategie. Volgt alle Retail Business-programma’s en -aanbiedingen op de voet om aan alle richtlijnen en procedures te kunnen voldoen.", "key_qualifications": "", "preferred_qualifications": "Minimaal 3 tot 5 jaar aantoonbare ervaring en bewezen succes met de verkoop van technologische en/of zakelijke oplossingen of vergelijkbaar. Grondige en bewezen kennis over Apple met betrekking tot de toepassing van mobiele oplossingen en de transformatie van bedrijven, met algemene kennis van belangrijke branches met veel kleine en middelgrote bedrijven en van alle trends, uitdagingen en branches op het gebied van technologie. Kan goed luisteren, heeft goede onderhandelings- en sociale vaardigheden en biedt uitstekende klantenservice. Bijdragen aan een inclusieve omgeving door onderlinge verschillen te respecteren en leergierig te zijn. De waarden van Apple op het gebied van inclusiviteit en diversiteit uitdragen tijdens dagelijkse werkzaamheden. Je beschikt over uitmuntende communicatieve vaardigheden, zowel schriftelijk als mondeling, en zowel telefonisch als bij een persoonlijke ontmoeting. Je kunt effectief samenwerken met ondernemers en leidinggevenden in alle lagen van een organisatie. Je beschikt over uitstekende organisatorische vaardigheden, kunt goed processen beheren en bent in staat om prioriteiten te stellen en alert te reageren op verzoeken van klanten. Je kunt je goed aanpassen in een dynamische winkelomgeving.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200125427"}