{"title": "CA-Business Pro", "summary": "Are you passionate about driving sales, building relationships, and consulting with customers on business solutions? Do you want to connect entrepreneurs and professionals with the tools they need to build success? As a Business Pro, you help customers discover how Apple products can transform the way they work — and you build loyalty by maintaining those customer relationships. In this role, you serve as both a resource and a mentor to your fellow Apple Store team members. You also partner with store leadership to find opportunities to connect customers with powerful tools and solutions that help their business thrive. You work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "You lead customer engagement, deepen relationships, drive sales and awareness of Apple’s value proposition for business and build loyalty with a focus on high potential business customers. You plan and forecast business performance through account management, pipeline building, and opportunity management, utilizing CRM and other tools. You are passionate and confident and engage business customers by showcasing our technology and helping them discover how Apple and third-party solutions and services can transform the way they work. You develop effective account plans to start and expand adoption of Apple solutions across our ecosystem platform and deeper in the customer’s organization.  You lead and support briefings and leverage workshops to support customer engagement. You effectively use CRMs to build and maintain accurate customer account information, manage relationships, opportunities, tasks, and develop customer insights based on best practices. You mentor and act as a subject matter expert among peers on business customer needs and solutions. You seek, analyze, interpret, and share feedback from Business NPS to continually improve the customer experience. You partner with the Business Development Manager and account team to seamlessly transition accounts in line with account engagement strategy and ensure a smooth customer experience. You maintain process mastery of all Retail Business programs and offerings to ensure compliance with policies and procedures.", "key_qualifications": "", "preferred_qualifications": "At least three years of success and high performance in sales of technology or business solutions, or equivalent. Proven ability to take a personalized, solution-based approach to customer needs. Advanced consultative expertise in Apple and third-party solutions, mobility adoption, and business transformation. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. Roles based in Quebec require French language proficiency. You have outstanding communication skills, both written and oral, in person and on the phone. You have the ability to work effectively with business owners and executives across all levels of an organization. You have excellent organizational and process management skills, ability to set priorities, and \u2028responsiveness to customer requests. You have the ability to adapt in a dynamic, ever-changing retail environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. Your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. For information about pay, if you are interested in roles located in one of our British Columbia locations click here to select a store and view pay information. Note: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200125332"}