{"title": "Apple Engineering Opportunities", "summary": "Discover Apple. We’re looking for people like you. Apple is a place where people from all backgrounds get together to do their life’s best work. Come join us. At Apple, great ideas have a way of becoming great products, services and customer experiences very quickly. Bring your passion to your job and there’s no telling what you could accomplish. Apple offers a collaborative work environment that fosters creativity and innovation.", "description": "Software and Services Apple engineers have always focused on one person when they build software — the person who will use it. Working with them, you’ll see why every Apple product and service feels intuitive and simple, and why every aspect of this group’s work is built around a respect for the customer’s needs. Machine Learning and AI The people working here in machine learning and AI are building amazing experiences into every Apple product, allowing millions to do what they never imagined. Because Apple fully integrates hardware and software across every device, these researchers and engineers collaborate more effectively to improve the user experience while protecting user data. Come make an impact with the products you create and the research you publish. Hardware Our engineers have created some tough acts to follow, and they continue to lead us to innovative breakthroughs. Because they’re driven not by what would be easy, but by what would be amazing. Design Apple products work beautifully because our designers maintain an intense focus on simplicity and usability. They judge the success of their work not by everything they put into it, but by everything the user gets out of it.", "key_qualifications": "Different together. At Apple, we’re not all the same. And that’s our greatest strength. We are looking for talented engineers across teams at Apple such as:", "preferred_qualifications": "", "education_experience": "BS/MS/PhD in Computer Science, Electrical Engineering, Computer Engineering, Data Science, Design, or related fields.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200156495"}