{"title": "Digital Sculptor (All levels)", "summary": "Digital sculptors on the Apple Industrial Design Team take projects from concept models to final production surfaces and are responsible for the production data sets. We are a group of imaginative, problem solving, creative people always looking to hone the craft of sculpting. We work hand in hand with Industrial Designers and partner closely with engineers, artists, model makers and vendors. A culture of technical excellence, learning and growth...", "description": "The CAD sculptor creates high-quality digital 3D surface models used in the industrial design and product development process. Responsibilities include interpreting and defining the design intent of the industrial designer using Autodesk Alias software, while directly collaborating with mechanical engineering, packaging, and tooling teams. 3D data is used to develop numerous product concepts, detailed appearance models, high-quality renderings, and production level surfaces used in tooling...", "key_qualifications": "A strong passion and enthusiasm for pursuing a lasting career in the craft of 3D modeling. Proficiency in NURBS modeling is preferred (i.e. Alias, Rhino, etc.), as is the ability to go beyond the limitations of software tools and manually manipulate or refine surfaces. An understanding of solid modeling CAD programs is a plus. Candidates must enjoy working at a fast pace and possess perseverance, excellent problem solving, organization, and interpersonal skills. Experience in industrial design...", "preferred_qualifications": "", "education_experience": "Our team includes people with various backgrounds including: Industrial Design, Transportation Design, Computer Graphics, 3D Animation/Modeling, Architecture, Fine Arts and Engineering from all over the world.", "additional_requirements": "Please submit resume and portfolio in PDF format, emphasizing 3D modeling ability to digitalsculptor@apple.com", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200100523"}