{"title": "IT-Business Pro", "summary": "Il/La Business Pro ha il compito di instaurare e coltivare relazioni proficue fra Apple Retail e i clienti aziendali ad alto potenziale.", "description": "Coinvolge i clienti, approfondisce le relazioni, aumenta le vendite e promuove l’offerta di prodotti e servizi Apple per le aziende; rafforza la customer loyalty soprattutto dei clienti business ad alto potenziale. Pianifica e prevede le performance per il segmento business usando piattaforme CRM e altri strumenti di account management, crea le pipeline e gestisce le opportunity. Coinvolge con sicurezza ed entusiasmo ogni cliente aziendale presentando la nostra tecnologia e aiutandolo a scoprire come Apple, insieme a soluzioni e servizi di terze parti, possa aiutarlo a ottimizzare la sua metodologia di lavoro. Crea account plan efficaci per avviare e ampliare l’adozione delle soluzioni Apple, sia nelle piattaforme del nostro ecosistema sia nell’organizzazione del cliente. Conduce e supporta i Business Briefing; usa i workshop come mezzo per coinvolgere i clienti. Usa correttamente le soluzioni CRM per registrare e aggiornare le informazioni sui clienti, nonché per sviluppare relazioni, opportunity, attività e best practice basate su dati concreti. Agisce da SME (Subject Matter Expert) per colleghi e colleghe riguardo alle esigenze dei clienti business e a trovare le soluzioni più adatte. Raccoglie, analizza, interpreta e condivide feedback di NPS Business per migliorare l’esperienza cliente. Collabora con il Business Development Manager e l’Account Team sia per gestire i clienti correttamente in base alla strategia definita sia per garantire un’esperienza impeccabile. Conosce in modo approfondito i programmi e le offerte Retail Business per garantire la conformità con tutte le policy e le procedure interne.", "key_qualifications": "", "preferred_qualifications": "Almeno 3-5 anni di esperienza significativa e prestazioni elevate nella vendita di soluzioni tecnologiche e/o di fascia business o equivalente. Esperienza comprovata nell’integrazione di piattaforme mobili e di trasformazione aziendale, unita a una conoscenza generale dei principali rami di attività, trend tecnologici, sfide e opportunità delle piccole e medie imprese. Ottime capacità di ascolto e negoziazione, spiccate doti interpersonali ed esperienza a contatto con il pubblico. Capacità di creare un ambiente inclusivo promuovendo il rispetto delle differenze reciproche e la voglia di imparare. Capacità di esprimere i valori di inclusione e diversità di Apple nelle attività svolte quotidianamente. Spiccata capacità di comunicazione, sia scritta che orale, di persona e al telefono. Capacità di collaborare correttamente con titolari e responsabili aziendali, a tutti i livelli. Eccellenti capacità di organizzazione, assegnazione delle priorità e gestione delle richieste del cliente. Capacità di adattarsi a un ambiente dinamico e in costante evoluzione.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200125410"}