{"title": "MX-Business Pro", "summary": "Como Business Pro, eres responsable de desarrollar y fortalecer las relaciones con los clientes empresariales altamente potenciales de Apple Retail. Has demostrado tu capacidad para adoptar un enfoque personalizado, que se basa en soluciones, para las necesidades de los clientes...", "description": "Dirige la interacción con el cliente, fortalece las relaciones, impulsa las ventas, informa sobre la propuesta de valor de Apple para las empresas y construye lealtad enfocándose en los clientes empresariales altamente potenciales. Planifica y prevé el desempeño del negocio mediante la administración de cuentas, el desarrollo del Pipeline y la gestión de oportunidades con CRM y otras herramientas. Motiva con entusiasmo y seguridad a los clientes empresariales mostrándoles nuestra tecnología, y ayudándoles a descubrir cómo las soluciones y servicios de Apple, así como proveedores, pueden transformar la forma en que trabajan. Desarrolla planes eficaces para cada cuenta que puedan iniciar y expandir la adopción de soluciones de Apple a través de nuestra plataforma de ecosistemas dentro de la organización del cliente. Dirige y apoya las reuniones de Briefing y aprovecha los talleres para ayudar a la integración de los clientes. Usa CRM eficazmente para crear y mantener información precisa de los clientes, gestiona las relaciones, las oportunidades y las tareas, y busca conocer mejor al cliente con base en las mejores prácticas. Asesora a sus compañeros y actúa como un experto en las necesidades y soluciones para los clientes empresariales. Busca, analiza, interpreta y comparte la retroalimentación del NPS de Empresas para mejorar continuamente la experiencia del cliente. Colabora con el Gerente de Desarrollo de Empresas y el equipo de cuentas para transferir bien las cuentas siguiendo la estrategia de vinculación y así garantizar una experiencia perfecta para el cliente. Mantiene el dominio del proceso de todos los programas que Apple Retail ofrece a las empresas para asegurar el cumplimiento de las políticas y los procedimientos.", "key_qualifications": "", "preferred_qualifications": "Un mínimo de 3 a 5 años de experiencia comprobable y alto rendimiento en venta de equipo tecnológico y soluciones para empresas o equivalente. Amplia experiencia sobre adopción de tecnologías móviles y transformación de empresas, y conocimientos generales de las principales pymes, tendencias tecnológicas y retos de la industria. Excelentes habilidades interpersonales, para escuchar y negociar, así como de atención al cliente. Contribuir a una cultura incluyente mediante el respeto...", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200125422"}