{"title": "IP Design Verification Engineer", "summary": "This role is for a Design Verification Engineer who will enable us to produce fully functional first silicon IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an exceptionally talented Design Verification Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nThe position is relevant to all Apple sites: Herzliya, Haifa and Jerusalem", "description": "In this role, you will be responsible for ensuring bug-free first silicon for part of the IP and are expected to: Develop detailed test and coverage plans based on the micro-architecture Develop verification methodology suitable for the IP, ensuring a scalable and portable environment. Develop verification environment, including all the respective components such as stimulus, checkers, assertions, trackers, coverage and more.", "key_qualifications": "3+ years’ experience in digital logic design verification.\nBasic knowledge of SystemVerilog and UVM.\nExperience developing UVM based IP test-benches\nExperience with complex designs and advanced debug skills ability\nExperience with verification tools such as simulators, waveform viewers, build/run automation, coverage collection and analysis, gate level simulations\nStrong communication skills are a must, as the candidate will interface with a lot of different groups within the company.\nAbility to work well in a team and be productive under tight schedules\nPREFERRED\nExcellent knowledge of one of the scripting languages: Python, Perl, TCL\nExperience with serial/parallel protocols such as PCIe or DRAM\nProven knowledge of formal verification methodology\nIn lieu of UVM knowledge, C/C++ experienced level knowledge\nExperience with Lab hands-on debug", "preferred_qualifications": "", "education_experience": "BSc or MSC in Electrical Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200179663"}