{"title": "Hardware System Integration Engineer - iPhone", "summary": "The iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to create design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!", "description": "This is an outstanding hardware design position that starts at product concept and continues all the way through to mass production. You will be at the center of iPhone product development with a critical impact on overall design. Lead designs that continually push the boundaries of technology and ultimately improve the iPhone user experience. Design and integration of custom hardware into constrained systems. Work daily with multi-functional technology teams in a fast-paced environment. There will be opportunities for international travel.", "key_qualifications": "2+ years EE fundamentals including analog and high speed digital design\nBroad experience across different applications and technologies\nExposure to solving unwanted coupling and interference between subsystems\nDesign of sophisticated system architectures\nAbility to analyze solutions and make system design trade-offs\nStrong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitude\nExcellent verbal, written, and presentation skills\nExperience in many of the following areas:\n- Proven track record of leading dynamic multi-functional teams\n- Familiarity with the challenges of taking a product from early architecture through to production\n- Hands on experience with lab test equipment to debug difficult/intermittent hardware issues\n- Schematic capture and rigid/flexible PCB layout\n- Fundamentals of Signal and Power Integrity\n- Low voltage power regulation and delivery\n- Prototype design and validation with custom silicon\n- Use of scripting languages to assist with hw development", "preferred_qualifications": "", "education_experience": "BS Electrical/Computer Engineering or equivalent required; MS preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200269995"}