{"title": "Performance Modelling Engineer", "summary": "Do you have an uncommon desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do is not easy but you do not take the easy path. We are seeking a highly motivated, innovative and confident individuals to join the GPU Performance Modeling Team; we are a group that is driving advanced exploration for next generation GPU architectures and micro-architectures. In this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting high performant products to millions of customers quickly.", "description": "As a Performance Modeling Engineer you will be part of a team that is defining and optimizing Apple's GPU micro-architecture. With others you will seek out areas for improvement while collecting data and measurements that either confirm the idea or rule it out. You will collaborate with experienced designers in micro-architecture and RTL to assess the feasibility of ideas, refine ideas, and seed new ones. The role requires the analysis of interesting workloads across existing and new product categories to identify bottlenecks and opportunities for improvement. You’ll be architecting new simulator features and brainstorming novel ideas to boost simulation performance. You’ll collaborate with world-class GPU & SoC Architects to steer and improve the implementation of GPU simulators and performance models used for research, performance analysis, and microarchitecture tuning. We also cross-collaborate as a larger architecture and performance team to maintain and improve the simulation environment and look for ways to boost the productivity of the entire team.", "key_qualifications": "You should have strong knowledge of computer architecture and micro-architecture. Be comfortable in an environment of uncertainty and able to work through ambiguities. You will need strong communication, influence and negotiation skills to enable right data driven decisions are taken. Familiarity with a range of performance and/or power simulation environments. Strong coding skills including object-oriented programming with C & C++. Strong understanding of common data structures and algorithms. Knowledgeable in software design patterns. Knowledge of scripting languages such as Perl, Python, or Ruby.", "preferred_qualifications": "", "education_experience": "BS/MS/BEng/MEng/PhD in related field.", "additional_requirements": "Some International travel will be required.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200234377"}