{"title": "GPU Hardware Modelling Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Apple’s GPU Hardware Tech team are responsible for the outstanding graphics in Apple’s chips which power everything from Apple Watch and Apple TV to iPhone, iPad and Mac. We have unique career opportunities open to highly talented individuals interested in applying their hardware and software knowledge towards developing Apple’s cutting-edge GPUs. We’re looking for those with talent and ambition to innovate the way we design graphics processors, to provide the next technological leap and improve customer experiences in areas like real-time graphics, VR/AR, parallel computing and deep learning, and welcome you to work among the industry’s best. Engineers that excel at and love real-time computer graphics and are familiar with computer architecture and modelling, GPU programming, graphics algorithms, and game design are a perfect fit for our team.", "description": "- Work within the modelling team to build bit-accurate C/C++ models of the GPU architecture\n- Collaborate with the content, verification and software teams to identify both model and hardware bugs\n- Integrate functional models, analysing the model's accuracy and presenting results and recommendations\n- Partner with our GPU hardware teams during design bring-up pre / post silicon, in addition to our GPU software teams during driver bring-up\n- You will have the opportunity to collaborate with many other teams to understand functional, performance & power issues in the GPU", "key_qualifications": "- Excellent C++ programming and scripting skills\n- Strong communication skills, self-motivated and well-organised\n- A deep understanding and curiosity of computer architecture (GPU/CPU/SoC micro-architecture knowledge is a plus)\n- Modelling knowledge (experience with interpreting functional specs and developing hardware architectural models is a plus)", "preferred_qualifications": "", "education_experience": "BS/MS/BEng/MEng/PhD in a related field.", "additional_requirements": "Some international travel may be required on occasion.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200237509"}