{"title": "iPhone Systems Electrical Engineer - Audio", "summary": "The iPhone Division is seeking a hard-working System Analog Design Engineer. You will be working in a creative and upbeat engineering team developing future iPhone products with responsibilities for the design, implementation and integration of variety of analog function blocks and subsystems including power, audio, battery management, and sensors. This is a phenomenal opportunity to be at the focal point of many multi-functional interactions with Apple internal HW/SW teams, Contract Manufacturer teams, and IC vendor teams throughout different development stages. We expect you to be familiar with the design of portable low-power products, preferably with experience in a consumer electronics environment taking care of high-volume and high-quality products. Are you ready for a challenge? Come join the team!", "description": "•    Work with multi-functional team for function block system integration, including schematic and layout reviews, production test support, manufacturing support, system validation, and solving. •    Perform hardware prototyping and demonstration. •    Participate in datasheet drafting and reviews for variety of ICs. •    Follow through IC design cycle, including design review, bring up, bench characterization, and bug tracking", "key_qualifications": "5 + years overall experience in industry. Strong analog/mixed-signal fundamentals (noise, linearity, signal-integrity in mixed-signal systems). Deep understanding of mixed-signal building blocks (speaker amp, codec, microphones, op-amps, filters, ADCs, DACs, output drivers). Familiarity with low-power electronics/sensors/sensor-interface circuits. Experience in prototyping, characterization and debugging of mixed-signal hardware. Excellent interpersonal skills with both verbal and written communications. Experience with digital interface such as I2C, SPI, I2S, PDM, etc. Experience with programming languages such as Matlab and Python", "preferred_qualifications": "", "education_experience": "BS/MS EE or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200274207"}