{"title": "Software Engineer, 3D Applications - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "The ideal engineer for this role is comfortable working in a dynamic and creative team charged with exploring an uncharted and rapidly evolving domain. You will be researching and developing an entirely new application paradigm - a challenge that will demand rapid experimentation and prototyping without sacrificing code quality or attention to detail. You'll need a keen understanding of the state of the art in interactive 3D applications and an ambition to discover what the future holds in this space. We are building a passionate and diverse team that will span a broad range of application categories including productivity, communication, and entertainment!", "key_qualifications": "Typically requires a minimum of 6 years of related experience. Proficient in one or more of the following languages: C/C++, Objective-C, Swift. Proficiency in macOS, iOS, tvOS or watchOS development. Experience with low-level graphics APIs (Metal, OpenGL, DirectX). Fundamental knowledge of software engineering technologies, methodologies, ​and practices. Familiarity with 3D math, linear algebra, 3D geometry, graphics, and rendering", "preferred_qualifications": "", "education_experience": "BS in Computer Science OR equivalent experience", "additional_requirements": "Experience developing AR/VR applications. Familiarity with ARKit. Experience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc. Experience with Unix development, daemons, cross-process communication, etc. Interest or proficiency in UI/UX design.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200257219"}