{"title": "Early Careers RTL Design Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. The RTL Design team at the UK GPU Design Centre works on complex, large-scale GPU related projects. We partner with our graphics architecture, functional verification, and physical design teams to deliver high-quality graphics IP in order to meet performance, feature, timing, area, and power goals.", "description": "You will work closely with other designers to refine GPU micro-architectural specifications as well as collaborate with the architecture, physical design & verification teams to identify potential issues as early as possible. You will implement the micro-architecture, targeting cutting-edge technology nodes, balancing energy efficiency, performance and area constraints with project schedule, maintainability and coding elegance. You will review synthesis and power reports, root-cause and resolve timing and power issues and ensure maximal QoR throughout your design. As your design approaches functional completion, your task will be to work closely with the verification team to ensure the design behaves as intended and is tested thoroughly. At this point, there will be ongoing collaboration with the physical design team to help with any adjustments necessary to produce an optimal layout of the design, in its context. Once your design is integrated into the system as a whole, you will be simulating and debugging issues both within and around your design.", "key_qualifications": "Previous exposure to complex IP design; Understanding of implementing modern design techniques; Exposure to energy-efficient & low-power logic design; Understanding of logic optimization, synthesis, timing analysis; Fluency with RTL Verilog/VHDL syntax and hardware modeling; Familiarity with logic simulation and debug environments as well as formal verification; Ability to work well in a team and be productive under tight schedules; Excellent communications skills, self-motivated and well-organized.", "preferred_qualifications": "", "education_experience": "BSc/MSc/BEng/MEng/PhD in related fields.", "additional_requirements": "Some international travel required.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200223598"}