{"title": "Cellular 5G/4G Physical Layer DSP Firmware Engineer", "summary": "At Apple, new ideas have a way of becoming products, services and customer experiences very quickly. Every single day, people do amazing things at Apple. Imagine what you could do here! Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability and performance of the product? You will become part of a hands-on development team that fosters engineering perfection, creativity and innovation. Dynamic, encouraging people and innovative technologies are the norm here. Join us and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world.", "description": "Implement key 3GPP digital signal processing algorithms with very tight time, latency and energy budgets by interfacing to specialized cellular ASIC hardware. Examples of 3GPP algorithmic areas include: Channel Estimation, Channel State Feedback, Interference Cancellation, Cell Search and Measurement, Beam Measurement. Work with systems engineers to refine signal processing algorithms for efficient firmware/hardware execution. Work with silicon designers to define HW interfaces, processors, bus, DMA, accelerator and memory subsystems. Specify, design, and implement the firmware architecture of a state-of-the-art mobile wireless communications system. Assist in the development of pre-silicon emulation systems/virtual platforms and use them for pre-silicon FW design and HW verification. Evaluate and implement leading edge tools for build, formal verification and test. Define methodologies and best practices", "key_qualifications": "5+ years of experience, Experience implementing digital signal processing algorithms using special purpose digital signal processing HW, Working knowledge of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystems, Proficiency debugging embedded software systems, Some mainstream OS application level development and Python or Perl scripting experience, Understanding of 5G and 4G 3GPP protocols.", "preferred_qualifications": "", "education_experience": "Bsc / Msc in electrical engineering or computer science is required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200261592"}