{"title": "iPhone HW System Electrical Engineer Opportunities", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. The iPhone Hardware System Design team is seeking an enthusiastic and experienced Electrical Engineer. You will work as part of a team that drives and influences future iPhone innovation. In this role, you will be at the center of iPhone product development, with a critical impact on overall design.", "description": "This is a unique HW design position that starts at iPhone product concept and continues all the way through to manufacturing ramp. Excellent interpersonal skills are required to work with the multi-functional technology teams. Design integration and validation are fundamental skills for this position. Your ability to analyze and weigh system trade-offs will be a key asset. You will own designs that continually push the boundaries of technology and ultimately improve the iPhone user experience.", "key_qualifications": "Strong EE fundamentals\nAnalog or high-speed digital design\nFast learning skills\nTeamwork and passion\n- OTHER PREFERRED QUALIFICATION:\nComplex system architecture and design experience\nSensor integration experience\nPI/SI for a complex SOC system\nNew silicon and prototype bring up\nCadence Concept and Allegro Tools\nSchematic capture and PCB layout design\nExperience with high-volume manufacturing", "preferred_qualifications": "", "education_experience": "BSEE required. MSEE is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200238575"}