{"title": "PHY Algorithms and SW Developer for Wireless SoC", "summary": "In your role as a senior PHY Algorithms Development Engineer, as part of Apple Connectivity Group, you will be part of a world-class group that pioneers design and development of Physical Layer algorithms for wireless communication systems for Apple products. We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are targeting will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problem in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.", "description": "We are looking for a candidate who can innovate and integrate signal processing technologies, for solving novel and diverse sets of problems in various wireless communication and sensing technologies; - Develop communication signal processing algorithms for best-in-class implementation of various wireless standards - Conduct basic research of existing solutions in literature - Involvement in block level spec definition - Perform mathematical analyses of the given problem and its proposed solutions - Implement floating-point simulations to prove spec compliance of suggested solutions - Implement fixed-point modeling and simulation to allow performance sign-off and RTL bit-exact development - Write detailed design documents that will enable implementation of algorithms by other teams specializing in either RTL design or DSP firmware coding - Optimize and fine-tune the system for spec compliance on silicon in an RF lab environment", "key_qualifications": "Knowledge in digital signal processing algorithms and/or RF systems – mandatory\n5+ years of experience and proficiency in C++ programming language – mandatory\nProficiency in fixed-point modeling using C/C++ – highly preferred\nExperience and proficiency with using MATLAB for algorithm development, modeling, and simulation\nKnowledge in wireless protocols: BlueTooth or WLAN (IEEE 802.11) – highly preferred\nExperience in RF lab work and testing equipment (Spectrum, Analyser, Signal Generator, etc.) –  highly preferred", "preferred_qualifications": "", "education_experience": "M.Sc/Ph.D in Electrical Engineering, Computer Engineering, or related discipline", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200223745"}