{"title": "System UI Engineer - Apple Vision Pro", "summary": "Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us.", "description": "You will work on the applications and system behaviors that define the overall experience of our platforms; ultimately impacting the way our customers use our products. Work closely with Apple's UI framework, Human Interface designers and application teams - pushing you to think outside-the-box, and solve incredibly challenging and interesting problems in spatial computing.  You will work with technologies such as SwiftUI and RealityKit frameworks, UIKit and ARKit. You will have access to a wide variety of internal frameworks and services that will allow you to create applications that are deeply integrated into our operating systems.", "key_qualifications": "- Track record for building complex applications that are functional and delightful\n- Proficient in Swift, C++ or ObjC\n- Familiarity with SwiftUI and/or UIKit\n- Attention to detail, creativity and passion.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or Equivalent and at least 3 years of experience", "additional_requirements": "- 3D math is a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. \n\n Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200295358"}