{"title": "Junior RTL Power Optimisation Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail?\u2028 As part of our Silicon Technologies group, you will help design and manufacture our next-generation, high-performance, power-efficient processor and system-on-chip (SoC). You will ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices .", "description": "In this role, you will be responsible for power analysis and optimisation of Apple’s GPU products. As part of the Power Optimisation team, you will simulate the power consumption of components within the GPU with various workloads. You will analyse the data to look for opportunities to improve the energy efficiency of the components, and work with the design and implementation teams to make improvements to the logic throughout the development process.\n\nYou will be working with RTL and gate level simulations, emulation, and power analysis tools to generate data, analysing that data using scripts, power models, spreadsheets and machine learning. You will summarise and present your conclusions and recommendations to the team.\n\nAs well as driving the optimisation of the GPU logic, you will have the opportunity to enhance the power analysis and optimisation methodologies and develop new techniques.", "key_qualifications": "Good understanding of RTL design\nSelf motivated and independent worker\nGood understanding of circuit-level power consumption and low power design techniques\nProficiency in scripting languages such as Tcl, Python or similar", "preferred_qualifications": "", "education_experience": "BSc/MSc/BEng/MEng/PhD in a related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200222975"}