{"title": "Analog IP Layout Lead", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an exceptionally talented IP layout lead. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  This role is for an analog layout IP lead who will enable us to produce fully functional first silicon IP designs. The responsibilities include all phases of silicon development from definition to high quality production.", "description": "Senior Layout Leads are responsible for delivering Analog Mixed-Signal IP in an SOC flow.  They collaborate with teams of highly skilled individuals to develop the next generation of world-leading SOCs.\nAs a member of the AMS layout team you will be responsible to deliver Physical Design Verification clean layout, this includes the following: \nCrafting complex layout for mixed signal, and analog circuits in deep SubMicron CMOS technologies. \nReviewing and analyzing floor-plans and complex circuits with circuit designers. \nRunning complete set of design verification tools available on AMS blocks. \nWorking with the circuit design team to plan/schedule work and negotiate any necessary layout trade-offs as needed. \nInterpreting LVS, DRC and ERC reports to find the fastest way to complete layout. \nExceeding engineering specifications and expectations by working closely with the circuit design team. \nUtilizing advanced CAD tools and mask design knowledge to deliver correct and robust layout that meet stringent matching performance, area and power requirements.", "key_qualifications": "10+ years of experience in analog/mixed-signal layout design of deep sub micron CMOS circuits and at least 3+ years of recent experience on advance nodes including FinFet technologies.\nExperience crafting tight matching, low noise, and low power analog blocks, resistors, capacitors, pad IO's, ESD structures, etc.\nHigh level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.\nMust understand issues of IR drop, RC delay, electro-migration, self heating and cross capacitance.\nMust recognize failure prone circuit and layout structures, have experience with analog and DFM standard methodologies, and enthusiastically work with circuit designer for the best approach to problems.\nHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc., reports.\nKnowledge of MENTOR GRAPHICS or CADENCE layout tools.\nScripting skills in Perl, Python or SKILL  an advantage.\nExcellent interpersonal skills and ability to work with multi-functional teams.", "preferred_qualifications": "", "education_experience": "Excellent EE Practical Engineers or Bachelors of Science (preferred).", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200253338"}