{"title": "IP Logic Design Lead", "summary": "The IP Design Lead is the centre of a PHY design effort collaborating with architecture, analog, CAD, timing and PD design teams, with a critical impact on delivering elite PHY designs. You will also collaborate with the engineering design team to develop the verification environment for block and SoC developments. At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an exceptionally talented Design Verification Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.", "description": "Participate in the architecture of the next generation PHY.\nRTL implementation of the micro-architecture.\nParticipate in clearly defining specification, testing and verification of the PHY design.\nWork in collaboration with CAD, PD teams to implement RTL design into GDS. Run various design verification flow and provide guidelines to other designers.\nParticipate in establishing CAD and design methodologies for correct by construction designs.\nAssist in flow development for PHY integration.", "key_qualifications": "8+ years of Logic Design experience.\nExperience developing and implementing AMS PHY.\nAdvanced knowledge of standard ASIC verification flows including simulation and testbench development.\nKnowledge about industry standards and practices in PHY Design, including RTL writing, verification tools of RTL.\nDeep Understanding of all aspects of PHY construction, Integration and Physical Design.\nWorking knowledge of Extraction and STA methodology and tools.\nExcellent knowledge of System Verilog, Verilog.\nGood knowledge of C / C++.\nExperience with either Perl/Tcl scripts.\nKnowledge of industry standard interfaces and experience with multiple frontend simulators/debuggers.\nDeep understanding of Design methodology to debug issues at PHY level.\nA teammate with excellent interpersonal skills and the desire to pursue diverse challenges.", "preferred_qualifications": "", "education_experience": "BS.c / MS.c EE or BS.c / MS.c CE", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. If you’d like more information about your EEO rights as an applicant, please click here. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here. Apple participates in the E-Verify program in certain locations as required by law. Learn more. Apple's committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Learn more.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200251189"}