{"title": "Emulation Engineer", "summary": "Apple’s GPU Hardware Tech team are responsible for the outstanding graphics in Apple’s chips which power everything from Apple Watch and Apple TV to iPhone and iPad. We have unique career opportunities for grads interested in applying their hardware and software knowledge towards developing Apple’s cutting-edge GPUs. We’re looking for those with talent and ambition to innovate the way we design graphics processors, to provide the next technological leap and improve customer experiences in areas like real-time graphics, VR/AR, parallel computing and deep learning, and welcome you to work among the industry’s best. In this role you will be responsible for building emulation models, running and debugging test cases, resolving environment issues, and driving emulation and acceleration capabilities for pre- and post- silicon validation.", "description": "In this role you will work with other emulation team members, as well as other verification, design and software teams, to deliver emulation capabilities for Apple’s GPU designs in order to provide verification of functionality, performance and power characteristics. You will assist in the development of automation infrastructure and work with emulation vendors to ensure the most efficient use of emulations resources. As Apple’s GPU designs grow and evolve you will develop emulation based verification IP to validate new features and enable cutting edge methodologies for HW/SW co-verification.", "key_qualifications": "General RTL verification skills, Knowledge of SystemVerilog RTL design/Test Bench, Ability to debug design issues from waveforms, Programming skills with Python, C, C++, Understanding of emulation build, run and debug flows, Knowledge of emulation transactors is desirable, Understanding of GPU architecture and micro-architecture is desirable, Graphics and graphics programming knowledge is desirable", "preferred_qualifications": "", "education_experience": "BSc/MSc/BEng/MEng in related field", "additional_requirements": "Some international travel will be required", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200378869"}