{"title": "Senior RTL Power Optimisation Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you will help design & manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You'll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices.", "description": "In this role, you will be responsible for power analysis and optimisation of Apple’s GPU products. You will estimate the power impact of proposed features, advise on possible improvements, and set power targets. You will work with architecture team to improve energy efficiency of next generation GPUs . You will simulate the consumption of existing components of the GPU with various workloads. You will analyse the data to look for opportunities to improve the energy efficiency of new features and existing logic, and work with the micro-architecture, design and implementation teams to make improvements throughout the development process. You will be reviewing architectural and micro-architecture specifications to estimate their power impact on the GPU. You will be working with RTL and gate level simulations, emulation, and power analysis tools to generate data, analysing that data using scripts, power models, spreadsheets and machine learning. You will summarise and present your conclusions and recommendations to the team. You will share low power best-practices and design principles among the different project stake holders, and drive the development of new tools, and methodologies to aid in the efficient measurement communication and improvement of GPU energy efficiency.", "key_qualifications": "Solid experience with low power RTL design & optimisation of complex digital systems, Excellent understanding of power consumption and estimation of digital designs and low power design techniques, Self motivated & independent worker, Proficiency in scripting languages, such as Tcl, Python or similar, Experience with power estimation tools such as Primetime-PX, Power Artist or Power Pro, Experience in low power RTL design & optimisation", "preferred_qualifications": "", "education_experience": "BSc/MSc/BEng/MEng/PhD in a related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200337851"}