{"title": "IN-Operations Expert", "summary": "Do you love how it feels to make someone’s day?   As an Operations Expert, you know better than anyone else the satisfaction of getting the latest Apple product into your hands. So it’s up to you to make sure customers are just as satisfied. By guiding and mentoring your team, you help keep pace with changing demands and make sure every product and demo machine is where it should be. At the end of the day, it’s your organisational skills and dedication that are at the heart of what the Apple Store does — connecting people to the products they love. You work with others to foster a culture where everyone belongs and is inspired to do their best work. Both full-time and part-time jobs are available.", "description": "As an Operations Expert, you and your team have the incredible responsibility of ensuring products take the final step in the supply chain: getting into customers' hands. You're in charge of the store's entire inventory — products, parts, tools, supplies and everything else. You make sure your team has the support, knowledge and resources required to maintain product availability, complete inventory tasks and keep the stockroom organised as new products arrive. You're in constant contact with the management and leadership teams, sharing data about the status of products and parts. And when exciting new products arrive, you're the first to open them up and present them to the entire store team. Apple makes the products, but you make it happen by being ready to place our products in customers' hands. Discover even more benefits of doing what you love. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Note: Apple benefits programmes vary by country and are subject to eligibility requirements.", "key_qualifications": "", "preferred_qualifications": "Ability to think quickly and perform problem-solving tasks, even within changing conditions. Leadership skills, whether guiding by example or coaching a group. Strong organisational skills, quickly evaluating every situation. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You can manage and meet multiple inventory deadlines each week. You’re willing to observe guidelines to allow secure access to products and movement through the stockroom. You’re fluent in the local language. You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "Not Available", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200314033"}