{"title": "Computational Designers: Industrial Design Group", "summary": "Apple’s Industrial Design Group is looking for Computational Designers to be a key part of our iterative design process.", "description": "For this role, ideal candidates can demonstrate a balanced understanding of aesthetics and technical expertise using computational thinking and parametric methods. Through collaborative work with our Industrial Designers, Human Factors researchers, and CAD Sculptors, you will help shape the future of our products. We are open to seeing work from all levels of experience.", "key_qualifications": "Demonstrable understating of Computational Design for production\nProficiency in Grasshopper and Rhino is preferred. Proficiency with Python or C# is a plus. Curiosity to learn and explore new tools is a must.\nHighly adaptable and able to offer creative solutions for difficult, often ambiguous, problems.\nAbility to comprehend and integrate large data sets into computational models.\nConceptual ability to translate and change parameters.\nProven complex data and file management.\nExcellent communication skills. English proficiency required.", "preferred_qualifications": "", "education_experience": "Bachelor’s or demonstrable experience in Industrial Design, Mechanical Engineering, Architecture or Computational Design required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200393115"}