{"title": "iPhone/iPad Hardware Validation Engineer", "summary": "Do you want to help build the next iPhone or iPad? The system integration team is looking for individuals with real passion for shipping outstanding products. As an iPhone/iPad Hardware Validation Engineer, you will be a motivator in delivering electrical validation breakthroughs from first prototype through launch in a fast-paced environment. Using interpersonal and technical skills, you will operate seamlessly with the iPhone/iPad System Integration Team to yield the highest quality results. You are someone with strong electrical engineering fundamentals, dedicated, willing to be hands-on with debugging efforts, and able to work authoritatively with multiple engineering teams to close a list of critical tasks and improve our designs. In this role, you will have the opportunity to deep-dive into technical issues, develop and maintain validation automation code, and help mitigate project risks.", "description": "As hardware validation engineers, we love the impact we make on the products that reach our customers. Some of the things we do are: Responsible for system-level validation focusing on system performance, margin, and coupling among different subsystems. Communicate technical risks to the project team and to upper management. Define large-scale test plans that rigorously validate each subsystem and uncover underlying problems. Track and lead electrical validation schedules with focus on design breakthroughs. Get involved with hands-on debugging and prototyping of design experiments. Innovate and implement creative validation process improvements, including automation development Work with multi-functional development teams in the US and Asia in order to integrate their work into the project.", "key_qualifications": "Strong electrical engineering fundamentals and experience working on high-volume consumer electronics. Highly organized with willingness for project management and issue tracking. Experience with high-speed and low-speed interfaces (e.g. I2C, SPI, USB, PCIe, MIPI) including protocol and electrical compliance. Hands-on experience with hardware bring-up and bench measurements for signal and power integrity. Expertise with lab test set-up and equipment (e.g. high-speed oscilloscope, logic analyzer, power supplies, spectrum analyzers). Ability to root-cause issues and recommend design improvements. Familiarity with scripting languages and instrument automation (e.g. Python, LabView). Knowledge of power electronics, including DC-DC converters. Excellent verbal and written communication skills. Desire for a fast-paced environment; calm under pressure.", "preferred_qualifications": "", "education_experience": "Bachelor Degree in Engineering, EE/CE degree preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200372488"}