{"title": "iPad Hardware System Design Engineer", "summary": "Do you love crafting elegant solutions to highly complex challenges? Can you intrinsically see the importance in every detail? As part of our System Design group, you’ll help ensure every Apple hardware design meets our high standards throughout the manufacturing process. You’ll design and build complex systems that consist of various modules inside all our products. You and your team will confirm that every product we make performs exactly as intended. Together, our work will be the reason millions of customers feel they can trust their devices every single day. Apple's iPad division is seeking to grow its System EE team based in Shenzhen China. We are a team of electrical engineers that own responsibility for entire products from concept to ship. We sit at the nexus of Apple's wider engineering team, working cross-functionally with mechanical engineering, software, and other module teams such as wireless, battery, camera, sensing, display, multi-touch, factory test, and silicon engineering. Our core EE responsibilities involve design of the main logic board and flex circuits in the product, along with power conditioning and distribution throughout the system. From a system perspective, we define the interfaces between tightly coupled subsystems and drive resolution of all critical issues that arise due to the coexistence of modules in the design.", "description": "Day to day tasks involve electrical design, simulation, bringup, debug, and validation for iPad products. Routine responsibilities also include factory build support, and multi-disciplinary multi-functional collaboration and negotiation.", "key_qualifications": "Strong EE fundamentals, grounded in a proven understanding of E&M physics and first principles\nDemonstrated ability to understand technology and debug problems at varying levels of abstraction, from the system-level down to the silicon/transistor level\nSolid understanding of design and validation requirements for common low-speed and high-speed digital interfaces: I2C/SMBus, SPI, JTAG, I2S/TDM, USB, MIPI, PCIe, HDMI, DisplayPort, Thunderbolt, Ethernet, DDR Memory\nSolid understanding of power design, especially DC-DC power design, debug and characterization.\nUnderstanding of computer architecture and design tradeoffs\nExperience in circuit design for a variety of domains including power, digital, analog, high-speed communications, programmable logic, and/or wireless\nExposure to numerical modeling, simulation, and analysis tools such as SPICE, 2D/3D field solvers, power & signal integrity\nSchematic capture and constraint-drive PCB layout using Cadence tools or similar\nAutomation and data manipulation script development using Python, Lua, and Bash\nData analysis and visualization using Python, Tableau, JMP, R, and/or Matlab\nExperience with PCB bringup and debug, including new or custom silicon, using standard EE lab equipment: Soldering, DMM, Oscilloscope, Logic Analyzer, Spectrum Analyzer\nExcellent written and verbal communication/presentation skills in English and Chinese\n3-5+ years overall experience\nBeyond technical capability, we prize curiosity, creativity, integrity, leadership, collaboration, and a passion for learning.", "preferred_qualifications": "", "education_experience": "BS Electrical/Computer Engineering or equivalent required; MS preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200381126"}