{"title": "FEA Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. The PPO team is searching for a Senior FEA (Finite Element Analysis) Engineer to lead structural, thermal, and dynamic analysis of touch sensors, flat panel displays and their integration processes. Our team supports an outstanding line of products", "description": "This FEA engineer will own and drive analysis of groundbreaking designs, enabling early material, process, and structural design optimization as well as root cause and failure analysis of challenging mechanical problems. \n-  Generate FEA/analytical models of mechanical parts, modules, and assemblies.\n-  Perform static, dynamic, structural, and thermal-mechanical analysis.\n-  Own and drive material characterization and testing plan to support modeling efforts, working knowledge with adhesive material, ACF material, flat panel display material is preferred.\n-  Own, drive, and execute consistent methods of modeling and analysis of modules across programs.\n-  Coordinate and work with other analysts to integrate module models into larger system assemblies.\n-  Communicate and report analysis results to team as well as multi-functional peers and management on a regular basis.\n-  Drive failure analysis, root cause efforts, and design of experiments to resolve difficult problems.\n-  Brainstorm and propose solutions to problems based on analysis data.\n-  Generate applicable engineering specifications and build applicable processes to assure consistent early analysis and design validation of critical issues.", "key_qualifications": "", "preferred_qualifications": "The candidate will have 5+ years of experience in advanced FEA analysis in high-volume consumer electronic products and/or modules. Direct experience with flat panel display, touch sensor, lamination process is preferred.\n- High proficiency in Abaqus (Implicit & Explicit) or ANSYS, and Altair Hyperworks\n- Structural and thermal focus; non-linear FEA experience is highly desirable.\n- Applied knowledge/experience with flex circuits, ACF bonding, adhesives, flat panel display, material science and basic chemistry.\n- Applied knowledge/experience with structural optimization based on FEA automation and/or machine learning is highly desired\n- Excellent written and verbal communication skills and people skills; ability to interact with management, team members, and external vendors\n- The candidate must be able to communicate well with cross-functional team members, be able to efficiently collaborate with team members to achieve project goals, and contribute positively to the engineering community.\n- Must be able to multi-task and set priority in a fast-paced working environment", "education_experience": "B.S. in Mechanical Engineering, Material Science and Engineering, Mechanics of Materials minimum required along with 3+ years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200378521"}