{"title": "Pre-Silicon Engineer", "summary": "We are looking for an engineer to join the ANE Compiler Pre-Silicon team, which is responsible for enabling new hardware features in our simulation environment and doing the initial chip bring up. The ideal candidate will enjoy working across our ANE hardware and software architecture to achieve this, and have a passion for squeezing the best possible performance out of the ANE hardware.", "description": "Implement new functional features in the compiler stack using Apple Neural Engine simulation environment, with an emphasis on performance and power. Drive performance content delivery to the hardware team and triage functional issues. Collaborate with the hardware team to review hardware specifications. Work closely with the design and micro-architecture team to understand the functional and performance goals of the design. Participate in workload selection and preparation of the ANE functional and performance test plan. Deep-dive into hardware investigations to understand and root-cause performance gaps. Evaluate new hardware features and contribute to the definition of architectural changes for future ANEs. Develop features for future products, bringing those features from initial concept, through development, leading to hardware bringup and validation. Partner with the driver/firmware teams to integrate HW acceleration in our software stack. Collaborate more broadly with hardware design, verification, performance and architecture teams within our Silicon Engineering Group", "key_qualifications": "Experience with SoC or/and GPU acceleration for AI, Experience with hardware reference models, Experience with hardware performance and power models, Experience with SW/HW parallelism, and asynchronous processing, Experience with embedded systems, and real time OS development, Excellent programming skills of C/C++, Excellent software design, problem solving and debugging skills, Good understanding of Deep Learning workloads, Excellent communication and teamwork skills", "preferred_qualifications": "", "education_experience": "Masters's degree or higher in Computer Science or equivalent field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200355493"}