{"title": "IN-Business Pro", "summary": "Are you passionate about driving sales, building relationships and consulting with customers on business solutions? Do you want to connect entrepreneurs and professionals with the tools they need to build success? As a Business Pro, you help customers discover how Apple products can transform the way they work — and you build loyalty by maintaining those customer relationships. In this role, you serve as both a resource and a mentor to your fellow Apple Store team members. You also partner with store leadership to find opportunities to connect customers with powerful tools and solutions that help their business thrive. You work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "As a Business Pro, it’s your job to drive sales and awareness of Apple’s products for the business community. You keep customers engaged by leading briefings and workshops that showcase how Apple and third-party technology and services can help them build success. With the help of customer relationship management (CRM) tools, you plan and forecast business performance through account management, pipeline building and opportunity management. You develop account plans to start and expand adoption of solutions across the Apple ecosystem — and deepen adoption within an organisation. To ensure compliance with policies and procedures, you maintain a deep understanding of all retail business programmes and offerings. Working closely with store leadership, you assess accounts’ individual needs and work to support the transition of those accounts to the Apple team that will best meet the customer’s specific needs. Discover even more benefits of doing what you love. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Note: Apple benefits programmes vary by country and are subject to eligibility requirements.", "key_qualifications": "", "preferred_qualifications": "At least three years of success and high performance in sales of technology or business solutions, or equivalent. Proven ability to take a personalised, solution-based approach to customer needs. Advanced consultative expertise in Apple and third-party solutions, mobility adoption and business transformation. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You possess strong business insight, as well as general knowledge of key small business industries, technology trends in communities and business challenges. You have excellent listening, influencing, negotiation and interpersonal skills to establish positive relationships with customers, as well as within Apple and our team. You have extraordinary written and verbal communication skills, in person and on the phone. You can work effectively with business owners and executives across all organisational levels. You have a proven ability to connect with people, manage processes efficiently and prioritise without sacrificing the customer experience. You can adapt in a dynamic, ever-changing retail environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200314003"}