{"title": "RF Systems Integration Engineer", "summary": "Apple System RF team is looking for a Radio Frequency (RF) System Integration Engineer. Come and join us! You will be responsible for developing and optimizing RF automation software systems used on Apple’s products including iPhones, iPads, Apple Watch and more for different wireless technologies. Imagine what you could do here! At Apple, new insights have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability and performance of the product? You will become part of a hands-on development team that furthers engineering precision, creativity and innovation. Dynamic, encouraging people and innovative technologies are the norm here. We want you to join our team if you are an inventive engineer with the desire to research and develop solutions that do not yet exist. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "-  We expect you contribute to a multi-faceted software suite based on C/C++. -  You will be joining the design and validation of RF calibration/testing algorithms. -  You will be working on leading wireless standards. -  You will be responsible for the design, validation and optimization of RF system level performance. -  You will analyze results in conjunction with multi-functional teams to identify and root cause RF issues.", "key_qualifications": "Excellent fundamentals or proven experience in C/C++, Python or a similar language. Good knowledge of RF fundamentals and communications theory. Good understanding and experience with RF metrics and impairment. Basic knowledge of RF/Wireless lab equipment.", "preferred_qualifications": "", "education_experience": "BSEE required, MSEE/PhD. preferred.", "additional_requirements": "-  Experience or understanding of wireless standards (e.g. Cellular, WiFi, BT, NFC, UWB, etc). -  Experience in developing test solutions/systems. -  Familiarity with data processing and statistical tools. -  Verbal and written English skills.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200354634"}