{"title": "Allocation Execution Specialist (12 months contract)", "summary": "The Pacific Operations team at Apple is looking for a dynamic and motivated candidate for the role of the Allocation Execution Specialist. The role is an opportunity for a motivated individual to support demand and supply fulfillment activities for Pacific Countries on assigned products in iPhone, Mac, iPad, Apple Watch and Accessory product lines! This role requires a results-oriented self-starter with a strong work ethic, good communication and analytical skills.", "description": "• SAP tactical transactions, handling OEMs to ensure 100% fulfillment of products within the Asia Pacific region, supporting new product introduction team to ensure excellent execution of product launches.\n• Drive, support and participate in User-Acceptance Test and projects whilst providing inputs on process improvements to scale up the team efficiency is key as well as to lead, drive and facilitate quarter-end management meetings to ensure timely execution of project timelines. \n• Coordinate and facilitate cross functional meetings to ensure timely execution\n• Work closely with various functional teams to ensure timely resolutions of disputes or discrepancies, achieve inventory management targets and potentially to lead and drive a group of specialists to meet operational goals.", "key_qualifications": "Process and Systems oriented. Ability to identify and propose process and system improvement\nExcellent analytical skills, meticulous with strong eye for business and consumer focus\nStrong multi tasking skills, enjoys challenges, and a confident leader\nAbility to maintain a positive attitude in a fast paced, evolving environment\nAbility to quickly understand and make critical decisions in a fast paced environment\nAbility to work well with teams\nStrong Excel knowledge\nStrong communication and presentation skills\nHands-on experience in SAP and Programming is a plus\n1 to 3 years multinational experience in a similar supply chain management role would be an added advantage", "preferred_qualifications": "", "education_experience": "Bachelor Degree or Masters", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative  action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200338254"}