{"title": "Technical Product Manager", "summary": "At Apple, new insights have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love problem solving and thinking beyond an obvious solution? Do you thrive in ambiguity and teams where little direction should fuel your creativity? The GC Channel Sales DMP team is seeking a highly motivated technical program manager (TPM) to drive the development of digital strategies and solutions across Apple channels. This role will be instrumental to catalyze the connection of work between business, product design, UI/UX and our multi-functional engineering teams, to ensure efficient delivery of high-quality technical implementations.", "description": "-  Work with all partners to refine methodology proposals to add maximal value with minimal overhead\n-  Develop methodologies proposals, build concepts, and lead function design\n-  Maintain methodologies once in service to ensure their continued use and acceptable level of quality\n-  Undergo continuous improvement of new methodologies implemented and pre-existing methodologies\n-  Facilitate decision making with relevant partners and drive all open items to closure\n-  Identify risks, generate mitigation plans, and ensure appropriate steps are taken to resolve\n-  Track outstanding actions required to achieve desired timelines\n-  Facilitate communication and collaboration needed to progress product/platform development\n-  Communicate status across different multi-functional groups and management levels, as appropriate - from individual contributors to executive management", "key_qualifications": "", "preferred_qualifications": "Excellent oral and written communication skills in both Mandarin and English, presentation skills with various audience and levels\nExcellent listening skills, can rapidly get up to speed with new ideas and technologies\nEqually comfortable in big-picture strategy and deep technical discussions\nCan work collaboratively and multi-functionally throughout the entire organization\nAble to influence others without authority and build trust with other teams\nExperience in crafting or using efficiency tools\nValidated creative and critical thinking capabilities\nExperiences in product design of algorithm based analytics or business digitalization\nProven understanding in data science or machine learning is a plus", "education_experience": "M.S. in Computer Science, Data Science, Machine Learning or related field or B.S. with equivalent industry experiences", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200329299"}