{"title": "Engineer: Distributed Systems & ML Platform", "summary": "People at Apple don’t just build products — they craft the kind of experience that has revolutionised entire industries. The diverse collection of our people and their ideas encourage innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. If you excel in clear communication, adept at conveying ideas to diverse technical and non-technical teams, both verbally and in writing. Collaborating across various departments, where you'll play a pivotal role in leading and delivering top-tier products within our dynamic, fast-paced environment. This is the role for you. Here, we embrace dynamic, inquisitive individuals and pioneering technologies. Are you ready to join us in shaping solutions that push boundaries and defy convention?", "description": "We are seeking an experienced professional with proven expertise in search and information retrieval, with exposure to technologies such as Apache Solr, Apache Lucene, Elasticsearch/Opensearch, Vespa, Milvus or similar. - Exposure to modern sentinels of information retrieval such as LLMs, CNNs or other context driven information retrieval is a highly desirable skill. - Experience with building and running distributed systems and solving problems such as leader election, sharding etc. is mandatory. - Strong understanding of information and ML platforms, passionate about building and managing cloud infrastructure and can demonstrate to Apple’s high standards. - Develop and maintain large code base by writing readable, modular and well tested code. - Build and maintain cutting edge information retrieval systems with cutting edge technologies - Research the industry advancements and suggest improvements in the core engine.", "key_qualifications": "7+ years of experience in building and managing big-data platforms and programming experience in Java\nWorking experience with search and information retrieval (Lucene, Solr, Elasticsearch, Milvus, Vespa)\nExperience with Docker, Kubernetes or EKS\nExperience with debugging issues on distributed systems.\nKnowledge of software engineering practices and standard methodologies for the full software development lifecycle\nExperience with public cloud (AWS/GCP)\nHave created frameworks to deploy platforms in AWS/Azure/GCP.\nExperience in building, tuning, scaling, and monitoring applications to process real-time, near-real-time and batch data\nGood understanding of AI/ML stack - GPUs, MLFlow, LLM models is a plus.\nUnderstanding of data modeling, data warehousing, and ETL concepts is a plus\nAbility to lead and mentor junior team members, provide technical guidance, and collaborate effectively with multi-functional teams to deliver complex projects.\nCommitment to staying updated with the latest advancements in machine learning and data science, and willingness to learn new tools and technologies as needed.\nUnderstanding of business objectives and the ability to translate them into data-driven solutions that drive value and impact for the organization.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200366998"}