{"title": "Product RF Design Engineer", "summary": "At Apple, you will have a once-in-a-lifetime opportunity to deliver best in class performance for our wireless products. As a member of the Product RF team, you will be at the forefront of wireless technology, as we push the boundaries of achievable performance in wireless for brand-new products. You will become part of a hands-on product development team that shape and influence current and future generations of Apple products. We’re looking for hard-working and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration & wireless communications.", "description": "Product RF Design Engineers should have a broad-based knowledge in aspects RF architecture, design, integration and manufacturing. They have deep theoretical and practical knowledge in one or more areas of electromagnetic theory, RF and Wireless circuit design, communication theory, and product design trade-off. They use electromagnetic and system simulation, hands on prototyping, test and measurement to understand sophisticated system and sub-system interactions, implications to product level design, and manufacturing trade-offs to enable mass production. Product RF Design Engineers apply their expertise in all aspects of product design from concept, architecture definition, integration and prototyping to final production. They work closely with wireless and software architects, industrial designers, and product designers to guide and sculpt the product design with an eye towards optimizing RF functionality for the user. Regular travels to manufacturing facilities are needed to support builds from prototype phase to mass production.", "key_qualifications": "Knowledge of EM or RF or antenna design, Knowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products, Knowledge of RF schematic and PCB layout practices and guidelines, Excellent interpersonal and communication skills.", "preferred_qualifications": "", "education_experience": "BSEE or Equivalent educational background. Coursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "additional_requirements": "As a Product RF engineer, you would have the opportunity to work and expand on multiple aspects of RF technology. While these are not required from you, they will help you in pushing boundaries of innovation at Apple. A non-comprehensive list may include: Knowledge of electromagnetic simulation tools, Hands-on experience with RF lab instrumentation, Ability to debug desense issues and characterize noise sources, Experience with production environment and statistical analysis.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200381053"}