{"title": "Applied Biomechanics Researcher, Apple Design Team", "summary": "The Apple Design Team is seeking an Applied Biomechanics Researcher to support the development and design of future products.", "description": "The Applied Biomechanics Researcher will be an integral part of an interdisciplinary research team within Design, generating insights to support product development.", "key_qualifications": "3-5 years research experience: Musculoskeletal, soft tissue, locomotion, exoskeleton biomechanics, and sports biomechanics\nPrior experience working in industry is highly preferred.\nPrior experience working with designers and engineers is highly preferred.", "preferred_qualifications": "", "education_experience": "Master’s Degree or PhD in related fields.", "additional_requirements": "• Wide range of biomechanics toolboxes: 3D motion capture, inertia measurement unit (IMU),\ninstrumented force/pressure measurements, electromyography (EMG), muscle oxygenation,\nindirect calorimetry, musculoskeletal modeling, finite element modeling for soft tissues.\n• Software: Matlab, Python, LabView, OpenSim.\nPlease send your CV and a visual portfolio that demonstrates your previous research and\ndevelopment experiences.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200396450"}