{"title": "Get Connected: Product Management Roles for Apple Services", "summary": "At Apple, we don’t just create products. We create products, services, and experiences that redefine what customers expect and revolutionize entire industries. Join the team that dreams up what’s next, and that does everything necessary to make it happen. Bring your passion, dedication and focus, and help invent the future! We are seeking talented Product Managers to join our services teams, working across our world-class apps. If you have a strong track record in consumer services to lead the development of new customer experiences and are someone that brings creativity and humility, product sense, and analytical skill, leadership and ability to collaborate, we'd love to invite you to apply to this pipeline. Our Product Managers collaborate with other product managers and cross-functional colleagues across content production, business intelligence, data science, marketing, design, and engineering to drive measurable outcomes for app engagement. Our Product Management roles span across Apple Music, Apple TV+, Sports, Maps and more.", "description": "Define exciting and innovative new features that help customers enjoy our various services across Apple’s ecosystem. Develop platform, experience and business model innovations that become the future of our service. Understand consumption patterns and user journeys on and off platform to create new, engaging experiences. Create product roadmap and pursue alignment across business, engineering, design, and project management. Write clear and concise product definitions that capture the vision, goals, and key elements of new offerings. Work across many teams at Apple to communicate vision and launch products in the most compelling ways. Champion evidence-based strategies to grow adoption and engagement.", "key_qualifications": "Passion for building usable, delightful consumer products that innovate rather than imitate. Conviction to do the right thing for users, with a humbleness to listen and learn. Curiosity to know the competitive set and anticipate evolving consumer trends. Strong verbal and written communication skills, with the ability to create and deliver winning presentations. Ability to engage and influence diverse stakeholders. Flexibility to adapt to change and to thrive in a dynamic, discourse-driven environment. Experience with analytics, experimentation, and data storytelling.", "preferred_qualifications": "", "education_experience": "BS/BA degree or equivalent working experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200318153"}