{"title": "Product Design Engineer - Packaging", "summary": "When was the last time you enjoyed a box as much as the product inside? At Apple, every customer interaction is an opportunity for surprise and delight! This philosophy extends beyond the product to its packaging, where every detail is thoughtfully considered. The Packaging PD team is a diverse group of people responsible for the design and execution of structural packaging for all Apple products - from shippers to finished goods boxes. Our packaging delivers an outstanding customer experience, while protecting products throughout the shipping environment, and advancing Apple’s sustainability goals. We collaborate with a wide range of teams including Industrial Design, Marketing, Environmental, Operations and many others during the design process. We are seeking someone who approaches problem solving with passion, creativity, and curiosity. Apple’s approach to packaging is unique, so we value people who are eager to learn new skills and further improve their knowledge of packaging design, manufacturing processes, and sustainable materials. We welcome fresh influences from outside the standard packaging industry to promote innovation in creative ways.", "description": "Design and execute packaging architecture from initial prototypes to mass production with sustainable packaging materials. Utilize 2D and 3D CAD to design and document all parts and assemblies. Ensure design meets performance requirements throughout its lifecycle by performing materials analysis, stress, and failure analyses. Collaborate with cross-functional teams including industrial design, hardware, environmental, operations, and technology groups to refine and execute on the design on the packaging. Build models and prototypes to articulate design concepts, evaluate functionality, and validate packaging performance. Partner with internal manufacturing teams and external vendors to optimize designs for function, cosmetics, and manufacturability. Travel up to 20% to support engineering build activities including finding root cause for failures and solutions for issues that impede build", "key_qualifications": "Experience working with 3D and 2D CAD. Innovative thinking, high personal motivation, strong engineering fundamentals. Flexibility and comfort working in a quickly changing environment. Effective verbal and written presentation skills. Prototyping experience. Data-driven design approach to complex problems. Experience with design cycle from concept to manufacturing in high volume mass-production. Knowledge of material science and FEA. Knowledge of fiber-based materials", "preferred_qualifications": "", "education_experience": "BS / MS / Ph.D degree with an emphasis in Mechanical Engineering or Packaging Science, with at least 2 years of related industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200345106"}