{"title": "Module Design Lead (LED)", "summary": "Imagine what you could do here. At Apple, excellent ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. This team is seeking outstanding Hardware Engineers to take leadership roles in development of dedication compact illumination modules. Engineers in this role will take leadership and ownership of illumination HW projects from concept to high-production volume ramp. This multidisciplinary role requires engagements with a range of product and technology teams covering many areas of expertise.", "description": "We are looking for hardware engineers with leadership experience to develop dedication LED modules. You will work closely with product and technology teams while taking ownership of LED module design and integration into a system. This is a multi-functional role working with vendors as well as electrical engineering, product design and industrial design teams. International travel to supplier facilities is required for product development and production bring-up. Definition and trade-off studies of optics, emitter design, and packaging. Interaction with electrical, mechanical, and materials engineering teams on product integration of LED modules. Leadership of offshore manufacturing partners on module design evaluation, prototype builds and qualification. Leadership of LED module testing at Apple labs and offshore manufacturing sites. Characterization and failure analysis of LED modules at component, module, and product levels. Documentation of module design, test and manufacturing requirements.", "key_qualifications": "3+ years experience with LED or other optoelectronic module development, lens manufacturing or component SMT. Background in LED device operation, processing, package assembly, electrical boards and optics integration. Leadership and ability to drive a team. Strong interpersonal skills with internal and external partners. Color science understanding related to digital imaging and illumination integration with cameras. PREFERRED CAPABILITIES: Statistical modeling experience working with and interpreting large datasets using JMP or Minitab. Matlab or Python skills. Optical design experience and knowledge of LightTools or similar modeling software. Understanding of battery-based electrical driver architectures. Ability to assess different architectures. Knowledge of injection molding methodology and DFM a plus.", "preferred_qualifications": "", "education_experience": "M.S or Ph.D. in Electrical Engineering, Materials Science, Chemical Engineering, Mechanical Engineering, Optics, Physics or equivalent. Undergraduates with a passion for illumination will be considered if they have proven experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200378162"}