{"title": "Channel Fulfillment Analyst (12 Months Contract)", "summary": "The mission of Pacific Reseller Operations is to be the voice of Reseller Channel within Operations to ensure our products are in the right places at the right time, supporting Sales and our Partners to achieve Apple’s financial goals. We are focused on managing our supply chain as efficiently as possible, in order to maximise sell through while aiming for a frictionless Channel fulfilment experience for our partners. Within the Reseller Operations team, the Channel Fulfilment Analyst is responsible for ensuring orders and returns are managed, executed and delivered on time and applying analytics and insights to streamline or automate fulfilment processes in support of Apple’s Weekly Channel Fulfilment to Resellers.", "description": "- Independently process Order and/or Returns Management activities and manage Reseller inquiries (Order Cancellations, Repricing, Returns &amp; Delivery Escalations) in accordance to Standard Operating Procedures (SOP), Target Service Levels (SLA) and SOX requirements\n- Define and lead the rollout of New Product Introduction Order Management Activities such as System Configurations and Order Transition Plans when required\n- Champion and continuously improve Channel Fulfilment, Order and/or Returns Management processes or Standard Operating Procedures (SOP) for sub-regions and/or lines of businesses\n- Responsible for driving key fulfilment, cost, work driver and service level metrics (KPIs) by identifying and root causing issues, developing scalable preventive solutions and leading its rollout\n- Participate and/or represent Regional/Global Capital Improvement Projects including Business Requirements Definition and User Acceptance Testing (UAT)\n- Coach and train Channel Fulfilment Analysts on Fulfilment, Order and/or Returns Processes", "key_qualifications": "1 to 3 years of experience in an Operations role such as Operations Management, Industrial Engineering, Returns &amp; Delivery Management and/or Logistics. Experience in Order or Returns Management is preferred\nStrong verbal and written communicator with the ability to articulate complex issues, findings or analysis to senior management in a clear and concise manner\nDemonstrate attention to details, capability to manage and prioritise competing tasks and ability to deliver quality results under compressed timelines\nProven analytical problem solver with ability to root cause complex issues using analytics to resolve and design short term remediation and/or long term improvement initiatives within and across functional departments\nStrong relationship management and interpersonal skills with the ability to build new and strengthen existing relationships with cross functional stakeholders and senior management\nExperience in customs and/or regulations within Asian countries is an added advantage\nJapanese and Korean Language proficiency is an added asset (but not required)\nKnowledge/experience of working on SAP is an added advantage\nProven expertise with data analytics and visualisation tools such as Excel, Tableau, Macros etc", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in fields such as Engineering, Statistics, Mathematics, Operations, Business Management or Finance is preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200338277"}