{"title": "Kernel Software Engineer", "summary": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. Apple’s Wireless Inter-Processor Communication (IPC) team is seeking talented, motivated, and tenacious engineers to work across software layers building the kernel drivers, frameworks, and tools that enable cutting-edge wireless technologies. If you want to impact the present and future of Apple products, we want to talk to you.", "description": "The Wireless IPC team within WTE is responsible for the design, implementation, and maintenance of the drivers, frameworks, and tools that are the foundation for almost all communication between devices' wireless modems and application processors. The team investigates high-priority issues under time pressure and brings up new platforms, so skill in balancing urgent obligations against long-term technical goals is critical. Success on this team requires cultivating a broad understanding of the entire system and using it to build cross-functional consensus and negotiate detailed technical alignment. We are a nexus of collaboration for new technologies and innovations between groups with different goals and priorities, including hardware, cellular, wifi, and bluetooth protocol software, kernel, network stack, telephony software, external vendors, and R1. We take pride in building the reliable, performant systems that synthesize these innovations into \"magical\" user experiences.", "key_qualifications": "Experience developing and maintaining kernel drivers for custom hardware. Strong engineering skills including software design, C and C++ programming, testing, and debugging. Careful attention to the details that produce reliable and robust systems. Ability to communicate clearly with multiple teams in multiple time zones on multiple projects. Familiarity with PCIe architectural details is preferred. Familiarity with internet protocols (e.g. TCP, UDP, IP, QUIC) is preferred. Familiarity with secure programming techniques is preferred.", "preferred_qualifications": "", "education_experience": "Bachelor's or Master's in Computer Engineering, Electrical Engineering, or Computer Science, or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200488972"}