{"title": "CPU Physical Design Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level physical design.", "description": "As a CPU Physical Design Engineer you will drive or participate in the following:\n-  Drive RTL-to-GDS design convergence through logic synthesis and place-and-route tools targeting ambitious PPA goals\n-  Will be responsible for block-level physical design delivery along with closure of backend flows, electrical requirements and improving silicon yield\n-  Will work closely with internal CAD and PD methodology teams on industry standard synthesis/PNR tool features and optimizations and their adoption in CPU design\n-  Will work with x-functional top-level teams on the aspects of CPU floorplan, timing, power, reliability, and testability\n-  Will work closely with custom IP teams to define and co-optimize memory macros, library standard cells to improve design PPA", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience\nSolid electrical engineering fundamentals in digital circuits, timing/power concepts, and basics of logic design\nExperienced in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with floor-planing, pin-placement and timing budgeting knowledge\nFamiliar with programming and scripting (Perl, TCL) with strong fundamentals\nAbility to work well in a team, self-motivated and excellent communication skills", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451536"}