{"title": "Signal Integrity - RF Integrity Engineer", "summary": "Do you like to work on groundbreaking technologies that enable amazing new products? We are looking for a hardworking and hard-working RF Integrity Engineer for Apple's IC Packaging team.", "description": "- Conduct 2D/3D EM simulations on design optimization and coupling mitigation for IC, packages and boards.\n- Enhance EM modeling and analysis methodology to achieve accurate correlation between simulation and measurement at various levels.\n- Design high performance RF components, such as transmission line, filter, matching network, in various technologies.\n- Collaborate with IC, package, and product teams to address spur/desense issues in simulation and lab environment.", "key_qualifications": "- BS and 10+ years of relevant industry experience.\n- Excellent problem solving skills in a dynamic and complex environment when boundary is not clearly defined.\n- Strong fundamentals in microwave engineering and 2D/3D EM simulation tools.\n- Deep knowledge on interaction between EM model and other circuit structures.\n- Familiar with RF impairment at block and transceiver levels, including amplifier, filter, PLL, etc.\n- Experience with RF lab equipment, such as VNA, signal generator, spectrum analyzer, real-time scope, probe station, etc.\n- Enthusiasm in learning new technology and willingness to take risks to solve problems.\n- Strong academic training and knowledge on fundamentals of SI and PI issues is a plus.\n- Familiar with RFIC design and simulation flow is preferred\n- Experience in advanced transceiver design and integration is a plus\n- RF system modeling and link budgeting for transceiver chains.\n- Preferred experience on RF module/board development.", "preferred_qualifications": "", "education_experience": "- BS and 10+ years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449097"}