{"title": "Hardware Engineer - Early Career", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here...", "description": "As a part of our team, you'll work on real challenges the team faces as well as upcoming products. To be successful, you need to have a strong technical foundation, ability to show initiative, learn new technologies quickly, and possess excellent interpersonal and communication skills. Ideal candidates are motivated and prepared to work independently...", "key_qualifications": "Previous internship/co-op or project work in computer architecture, VLSI, design, logic design, or circuit design\nStrong teamwork skills with the ability to collaborate with multiple functional teams across a variety of fields\nExperience with C/C++, Verilog, VHDL, Python, Perl, and/or Spice is beneficial\nCurrently enrolled in an undergraduate or graduate program in Computer Engineering, Electrical Engineering, Computer Science or related fields\nWill be graduating with a minimum of a Bachelor's degree by September 2023", "preferred_qualifications": "", "education_experience": "Pursuing an undergraduate or graduate degree in Electrical Engineering, Computer Engineering and/or Computer Science or related field of study.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law...", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200438237"}