{"title": "Reliability Engineer Lead – Custom Silicon Management", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). Join Apple as a Silicon Component Reliability Engineer and work closely with multi-functional groups and third parties to lead introduction and qualification of new products with high quality.", "description": "•You will drive requirements and execution of products, process and package qualification and reliability stress tests conditions and configurations from design stage all the way to successful qualification completion. •Drive and review Design for Reliability and Design for Test to ensure stress-ability and testability. •Lead all aspects of and ensure adequate preparation for qualification including such as corner skew material, BIB/Socket, waveform, electrical bias, thermal effect, lifetime estimation. •Implement POR of process flows, workmanship standards and supervise product performance. •Perform FAI (First Article Inspection) to ensure critical goals are reviewed before engineering, pre-production and production release for Product manufacturing. •Drive investigation and resolution on qualification fallouts and product and process nonconformance of MRB, RMA events through means of FA, CAR, 8D, and reporting. •Support PCN or ECN activities. •Conduct supplier audits when needed. •Assess/perform yield analysis and correlation analysis for all levels of test including Pareto building, statistics, etc. •Drive/guide suppliers for improvement as needed.", "key_qualifications": "BS+10 Years of relevant industry experience\nSemiconductor engineering experience in the Reliability and/or Quality/Product Engineering role from multinational companies\nOutstanding communication skills required.\nExperience in JEDEC reliability and quality related standards, ISO, and the science behind them.\nThe ideal background will have experience of silicon product level reliability qualification and lifetime behavior model.\nYou will know reliability fail modes of silicon/packaging technologies and fail mechanisms with respect to reliability.\nPrior experience defining hardware setups and equipment for life, environmental, ESD, Latch-Up and other tests.\nValidated auditing of supplier sites, materials and processes.\nConfirmed experience driving suppliers in the areas of silicon Fab process / packaging / assembly, test, ongoing reliability monitoring, post-production qualification.\nFamiliar with process flows, specifications, and supervising supplier performance (process Cpk, yield, qualification report, etc.)\nPossess knowledge on practice of FAI to validate the work suppliers are doing prior to production stage.\nTravel is required for this role.", "preferred_qualifications": "", "education_experience": "BS+10 Years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200487919"}