{"title": "CPU Processor Emulation and FPGA Verification Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!", "description": "In this highly visible and interactive role, your primary responsibilities will be:\n-  Create emulation models from RTL\n-  Regress stress test on emulation and FPGA systems\n-  Debug test failures on emulation and FPGA systems\n-  Optimize models to be effectively executed on emulation and FPGA systems\n-  Develop and maintain emulation/FPGA build and regression flow\n-  Boot operating system on emulation/FPGA systems\n-  Release models and support any issues", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nThe primary skills required for this job are RTL design, simulation, expertise in mapping designs to emulation, improving model performance, excellent communication skills, and ability to work in a fast-paced exciting environment.\nThe ideal candidate should have extensive experience in the following areas:\n- Hardware Emulation/FPGA Platforms and tools (Palladium, Zebu, and/or HAPS)\n- Computer Architecture\n- RTL development\n- VHDL, Verilog, SystemVerilog (DPI and transactors)\n- Simulation acceleration knowledge and FPGA prototyping\n- Gate-level understanding of RTL and Synthesis\n- Logic simulation: VCS, NCSIM/Verilog\n- Programming/scripting skills (C, C++, Python)\n- Software Debug tools (e.g. gdb)\n- CPU and SOC system level debugging", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200455835"}