{"title": "Silicon Validation Software Engineer- GPU IP Validation and Integration", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nJoin a team of expert software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to develop graphics validation software and integrate it into system level test environment.", "description": "You will be writing shaders that stress the GPU and cause high bandwidth traffic to and from the memory subsystem.\nYou will apply your deep understanding of GPU architecture to write tests that stress the pipeline and exercise the interaction between the GPU and different IP blocks on the SoC.\nYou will use the necessary driver and firmware APIs to compile shaders and prime operations to move data around in the SoC using the GPU threads/SIMD groups.\nYou will understand the different levels of GPU memory hierarchy (Shared, Global, etc.)\nYou will debug SoC software and hardware issues, and perform system level validation.", "key_qualifications": "Experienced with Graphics, OpenGL, and CUDA\nExperienced with image processing, memory hierarchies, and compilers\nStrong C/C++ programming skills\nImplement and run ML/LLM workloads for GPU characterization\nProficient in Python and GNU Make\nDeep understanding of compute systems, operating systems, and computer architecture\nPassionate about writing code close to the hardware, and debugging\nIn-depth knowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.\nYou enjoy the validation mentality: meticulous, curious, and persistent.\nUnderstanding of the Display pipeline is a plus.", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200457287"}