{"title": "Mac Hardware Systems Engineer", "summary": "The people here at Apple don't just build products - they build the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWe are searching for self-driven, hardworking electrical engineers to provide design, test, validation, failure analysis and manufacturing support to our product. Our products are on the groundbreaking in every way: usability, integration, connectivity, power consumption, fabrication, reliability, manufacturing scale. The candidate will play a meaningful role in the development of Apple products, collaborating with multi-functional design team in the process.", "description": "-  You will participate in design and development of next generation mobile Mac products from concept to mass production.\n\n-  You will support all hardware characterizations both at Cupertino and local sides, analyze test reports and address the conclusions.\n\n-  You are the technical contact at OEM site to support various engineering builds. Represent the EE team in a multi-functional team environment. Helping factory with EE related issues and driving post ramp quality issues.\n\n-  You can identify and prioritize EE related issues. Drive resolution of multi-functional issues including those related to architecture (performance, power consumption, thermal behavior), production (quality, failure analysis, manufacturing), and development (schematic design, PCB layout, and overall system integration). Good ability for issue summary and reporting.\n\n-  You are able to manage vendor EE resources for better technical support.", "key_qualifications": "Had experience in the design and development of high speed digital and/or analog boards and systems.\nDirect experience in high volume computers /communication devices /consumer electronics preferred.\nMust have a proven understanding of the system development process including concept creation, schematics and board development, as well as board and system bring up and debugging.\nMust have direct experience with one or more of the following technologies: high speed bus design, low power design, industry standard protocols (PCIE, USB, wireless, thunderbolt, etc.) and their design issues.\nSoftware and scripting experience a plus.\nOutstanding interpersonal skills in both English and Chinese.", "preferred_qualifications": "", "education_experience": "- Bachelor’s Degree in EE related filed is required. Master's Degree is in EE related is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200440594"}