{"title": "Mixed-Signal IP Machine Learning Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.", "description": "As a member of the mixed-signal design team, you will be part of a dynamic team that is building the most efficient silicons on the planet, powering the next generation of Apple products. Your responsibilities will include: • Develop machine learning models and systems to optimize the Power, Performance, Area, and Robustness (PPAR) of mixed-signal IPs. • Explore and evaluate various machine learning algorithms to identify the most suitable approaches for specific problems. • Collaborate closely with firmware, system architecture, and validation teams in a highly engaging and rewarding environment. • Stay up-to-date with the latest advancements in machine learning and related fields to continually improve our methodologies.", "key_qualifications": "Proven track record of successfully delivering machine learning projects or applications. Strong understanding of a wide range of machine learning algorithms, including logistic regression, deep neural networks, and reinforcement learning. Solid math background with knowledge of algorithms and data structures. Excellent programming skills in Python; familiarity with C is a plus. Understanding of VLSI fundamentals is a plus. Knowledge of signal processing is a plus. Strong communication and collaboration skills, with the ability to work efficiently in cross-functional teams", "preferred_qualifications": "", "education_experience": "BS in Electrical Engineering and 3+ years experience preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200488667"}