{"title": "RFIC Design Engineer (m/f/d)", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies.", "description": "-  Design of analog and RFIC blocks.\n-  Being responsible for the layout and verifying the design to ensure a successful tape-out.\n-  Testing the design and debugging the issues that may arise from early development stages through productization.\n-  Working with the system group to define the requirements for RF and baseband blocks based on the system requirements.\n-  Working with the technology team to understand the capabilities and limits of the technology node to achieve optimum performance.", "key_qualifications": "Typically requires a successfully graduated Master's study and+ demonstrated ability or a Ph.D. in the area of RF/Analog IC design with advanced CMOS technology nodes.\nUnderstanding of RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, TIA, and/or other baseband analog blocks in deep sub-micron CMOS technology.\nKnowledge of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments.\nFamiliar with CMOS device physics, RF device modelling, device noise parameters, and inductor modelling.\nInsights into packaging effects, supply isolations, high-frequency ESD structures, and circuit layout for optimum RF performance.\nFamiliarity with various RF transceiver architectures and their trade-offs and calibration methods used for different RF transceiver architectures.\nFamiliarity with Cadence Virtuoso, Spectre RF, EMX, and similar tools.\nGood understanding of system specifications and working with system architects to translate system requirements into circuit requirements at the IC level.\nExperience in Silicon characterization and debugging.\nEnglish language proficiency is a requirement for this position", "preferred_qualifications": "", "education_experience": "A Master’s or Ph.D. in Electrical Engineering / Electronics or equivalent is required.\nApple is an equal opportunity employer that is committed to inclusion and diversity.", "additional_requirements": "The minimum salary under the CBA amounts to €59,015 gross per year for full-time employment. Actual salaries are oriented at current market salaries and take your qualifications and experience into account.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200490547"}