{"title": "Wireless Systems Engineer – WLAN, BT, UWB, Thread", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Our RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB), and Thread technologies into Apple’s wireless products.", "description": "- You will be responsible for applying wireless system design and characterization knowledge towards addressing wireless technologies towards industry conformance, regulatory compliance carrier, and use case performance requirements in consumer products. Examples of activities you may be involved in are: - Defining comprehensive RF parametric HW characterization and validation test plans to ensure connectivity products conform to industry and regulatory emissions standards - Tracking validation progress, present and bring insight into data and represent status to senior management - Debugging, root-causing and collaborating on corrective action for identified RF issues working with chipset and system partners - Collaborating in optimizing product performance across hardware, firmware, software and algorithms - Aligning test equipment RF feature development plans with that of product platforms -Translating system-level requirements to sub-system, module, component and chipset-level requirements with cross-functional chipset and system teams -Defining sophisticated experiments using modified hardware, experimental setups, circuit and system-level simulations to understand risks and root causes -Performing feasibility investigation on new technologies, RF features, regulatory requirements, test methodologies and RF components", "key_qualifications": "Proficiency in of 802.11, 802.15, BT SIG and worldwide regulatory emissions RF requirements and implications to device and test equipment architectures, and performance tradeoffs Direct hands-on experience and proficient knowledge of underlying theory and techniques used in WLAN, BT, UWB and Thread technologies Proficiency in connectivity transceiver, RF front-end architectures and performance tradeoffs Proficiency in system-level RF parametrics and its sources in RF component characteristics and behavior Direct hands-on system-level debug and optimization experience on RF conducted characteristics Deep knowledge of test setups of sophisticated RF test equipment for hardware validation Experience in characterizing and validating devices towards industry and worldwide regulatory emissions RF standards using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.) Proficiency in device certification processes on at least one of industry certification (e.g. BT SIG or FiRa) and Regulatory conformance (e.g. FCC, EU, China, etc.) Experience with entire product development cycle of connectivity handsets Strong written and verbal communication skills", "preferred_qualifications": "", "education_experience": "BS with 10+ years relevant experience required. MS/PHD preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448277"}