{"title": "Senior Tooling Engineer", "summary": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. At Apple, we believe our products begin with our people! By hiring a team with varied strengths, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers! These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?", "description": "Responsible to review tool concept, layout and DFM. Lead the development of tooling projects to meet a range of product performance and cosmetic requirements. Trouble shooting issues with the use engineering tools/techniques such as decoupled molding, molding approach, Tolerance Analysis, SPC, DOE and Six Sigma techniques. Take a lead in driving improvement of efficiency and quality of plastic part manufacturing, molding and tooling techniques. Serve as Apple’s internal expert for tool design by leveraging a detailed understanding various material properties and tool component fabrication techniques. To take part in new material development, new process development and innovation. Work closely with Supply Management, Product Design, Industrial Design, Quality and Manufacturing Engineering groups on new part designs. Frequent travel to within region is required", "key_qualifications": "Minimum 10 years in plastic tool design, mold making or injection molding industry with minimum 5 years in tool designer position. Familiar with tool fabrication processes and methodology for high volume precision tool. Well-rounded in injection molding tool design, including gate scheme, over-mold, multiple shots and etc. Good knowledge of geometric dimensioning, hot runner systems application and molding technique. Familiar with 3D modelling/simulation software such as Pro/E, Unigraphics, Moldflow, Moldex3D. Good knowledge in materials such as engineering plastic, liquid silicon rubber, thermal plastics, MIM, primer and epoxy. Systematic, analytical & strong trouble shooting skills. Experience in managing and develop precision parts, high pace and mass volume products with multiple vendors in parallel. Proficient in written, presentation, oral communication and effective cross functional communication. Able to work independently", "preferred_qualifications": "", "education_experience": "BS and above  in Engineering, Tool Making, Polymer Technology or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200493381"}