{"title": "System Software Engineer", "summary": "Imagine what you can do here. At Apple, new ideas have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job, and there’s no telling what we can accomplish together.. Do you love crafting elegant solutions to highly complex challenges? Can you intrinsically see the importance in every detail? At Apple, our Platform Architecture group is responsible for connecting our hardware and software into one unified system. Join this team, and you’ll collaborate with engineers across Apple to build and deploy forward-looking prototype systems that contribute to the development of our world renowned hardware and software architecture. You and your team will confirm that every product we make performs exactly as intended. Together, our work will be the reason millions of customers feel they can trust their devices every single day.", "description": "Apple’s Platform Architecture group is seeking a systems engineer to build high performance functional models of advanced SoC designs and to help bridge the gap between Software and Hardware, influencing performance improvements, power efficiency, security, and the programming ease of Apple products. Prototype and analyze architecture and operating system proposals. Interface kernels and drivers with processor & SoC models. Work closely with cross-functional teams across product groups. Promote new opportunities and techniques with other groups.", "key_qualifications": "Background in low-level software, operating systems, or compilers. Excellent programming (C++/C) and scripting skills (Python). Assembly experience a plus. Proficiency with debugging large, complex system software. Experience with kernel, driver, and firmware development a plus. Experience with modeling and simulation a plus. Knowledge of ARM and/or X86 architectures a plus.", "preferred_qualifications": "", "education_experience": "MSCS or MSEE Degree or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200492171"}