{"title": "Platform Security Certifications Engineer", "summary": "Apple's Security Engineering & Architecture organization drives the security of all Apple products. Platform security certification team is passionate about demonstrating the reliability and strength of the key security features of Apple devices and services through a great variety of certification programs.", "description": "Our team is passionate about defining and running the security certification strategy for all the Apple platforms such as Mac, iPhone, iPad, Apple Watch, and Apple TV.", "key_qualifications": "Experience in security and security certifications, Expertise of Common Criteria and FIPS 140-2/3 certifications, Significant understanding of security engineering principles, Passion for performing security testing and code review to improve software security, Experience working with certification bodies and evaluation laboratories, Experience defining and writing security targets, Ability to partner with other software, hardware, marketing, and support teams to provide the best security solutions for Apple’s products, Excellent partnership skills and ability to represent Apple in conversations with internal and external partners, An effective communicator and engaging presenter who can influence multiple audiences from project teams to senior leadership as well as actively engage in developing security standards in collaborative setting outside of Apple, Passion for high quality results within agreed timelines, Consistent time management skills with the ability to lead multiple concurrent global projects", "preferred_qualifications": "", "education_experience": "BS/MS in computer science, engineering or equivalent industry experience", "additional_requirements": "This position will require some travel to other Apple sites, evaluation laboratories and standardization meetings.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200492104"}