{"title": "Cellular Platform Software Engineer, Embedded Analytics", "summary": "Join the Wireless Technology and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "Wireless Technologies team is looking for highly motivated and creative engineer to work on our next generation products. The duties of this position will design, develop, debug baseband platform software, and work with cross functional teams to deliver the features into product", "key_qualifications": "0-2 years of experience in embedded software development. Strong experience in C programming and framework design. Excellent software developing and debugging skills (LLDB or GDB) on embedded real time operating systems. Outstanding verbal and written communication skills. Experience with Cellular standards, an added advantage. Experience with Machine Learning on Embedded systems an added advantage. Experience with Analytics or rules based expert systems an added advantage.", "preferred_qualifications": "", "education_experience": "Bachelor Or Master in Software Engineering, Electrical Engineering, Wireless Communications or equivalent majors.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200463850"}