{"title": "Product Design Engineer (Mechanical)", "summary": "Passion works here. Apple is a place where extraordinary people gather to do their best work. Our community is made up of every kind of individual: artists and designers, engineers and scientists, thinkers and doers. Together we create things and experiences people once couldn’t have imagined — and now can’t imagine living without. So if you’re excited by the idea of making a real impact, a career with Apple might be your dream job. Just be ready to dream big.", "description": "Apple is looking for a Product Design Engineer to be part of Apple’s Product Design Group in Shanghai or Shenzhen in China. We are looking for someone who is passionate about engineering and thrives on innovation. The role will require the ability to handle multiple projects simultaneously with demanding schedule requirements across a large cross functional team. A proven ability to deliver solid design solutions while balancing multiple priorities is key. Experience closely working with suppliers is important as well. The engineer in this role will be very comfortable with applying scientific method and have be able to apply or create the process through which they can solve complex problems.", "key_qualifications": "", "preferred_qualifications": "Basic design skills: tolerances analysis, design for assembly (DFA), design for manufacturing (DFM), simple fixture design, understanding of Statistical Process Controls (SPC), understanding of metrology (basic knowledge of measurement systems). Experience in design cycle from concept through manufacturing. Experience in designing mechanical components for high volume manufacturing - injection molded parts, sheet metal components, die-cast and machined parts. Experience in team work with Contract Manufacturing Partners", "education_experience": "BS/ MS in mechanical engineering related fields", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200455501"}