{"title": "CPU Power Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!", "description": "• Drive the budgeting, measurement, and analysis of overall CPU power\n• Work extensively with Micro-architects, RTL, physical designers, library and technology teams to study and drive power reduction opportunities\n• Collaborate closely with Micro-architect and RTL team to define traces and metrics of interest to track power for various use cases\n• Work with the design implementation team and optimize design operating points and power efficiency\n• Partner with CAD and drive tools and methodologies for power optimization\n• Collaborate closely with the SOC team to model and optimize CPU contribution of power.", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nFamiliarity with high performance microprocessor architecture\nKnowledge of logic design principles along with timing and power implications\nUnderstanding of low power microarchitecture and implementation techniques\nDesign experience in deep submicron technologies and basic device physics\nExperience with scripting in Perl and C is required", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450043"}