{"title": "Senior Security DevOps Engineer", "summary": "Software is often referred to as the “soul” of Apple’s products. In this position you will play a critical role in ensuring the security of the systems and infrastructure used to manage, build, and distribute, Apple’s software. You will be responsible for the rollout and operation of critical security services, development of new detections across our software stack, and assisting engineers implement changes to their software components that improve their security posture. You will need to think strategically, work cross-functionally, and help foster an environment of deep collaboration and accountability towards the success of Apple’s software.", "description": "We’re looking for an exceptional candidate with a proven track record in making a difference in the projects under their purview. Deep experience in security operations, detection & response, and strategic long-term risk assessment. The candidate must uphold Apple’s values, instilling a sense of accountability across the team, and its 24x7 operation. Passion for security and operational excellency is required. In addition to solid technical skills, candidates must also have: - Strong interpersonal and communication skills - Be a self-starters with a strong sense of personal responsibility and ownership - Comfortable with unknowns and have a learning mindset - Ability to mentor engineers", "key_qualifications": "5+ years of experience in security engineering and operations, Naturally accountable, responsible, self-motivated and self-sufficient, Experience developing dataflow diagrams for mission-critical systems, Proven ability to bring security solutions to production and operate them in cloud environments, Demonstrated ability to coordinate incident response in mission-critical systems, Ability to work and influence across teams and organizations", "preferred_qualifications": "", "education_experience": "- BS/MS in Computer Science or related field, - 5+ years in Software Engineering roles", "additional_requirements": "- Experience with distributed systems, - Experience scripting with Python, Bash, Ruby, etc, - Understanding of modern pen-test best practices", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200481261"}