{"title": "Senior Wireless Systems Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!", "description": "In this role, core responsibilities include, but are not limited to, the following: -  Designing and simulating wireless communication systems for very high data rate applications. -  Implementing system models and investigate algorithms for performance enhancements, design and validate them to allow performance sign-off and enable RTL development. -  Implementing system models for the wireless communication system and RF/circuits impairments. -  Defining the control procedures of the physical layer hardware modules to achieve robust and optimal performance of the Modem in a congested radio environment. -  Designing methods/algorithms to alleviate those impairments by calibration, pre-equalization, cancellation, and/or pre-distortion techniques. -  Collaborating with digital designers to realize these methods with power and area efficient digital implementations. -  Collaborating with firmware designers to realize these methods with high efficiency software implementation, and possibly with hardware acceleration. -  Bringing up, testing, characterizing and optimizing real silicon in the lab.", "key_qualifications": "Experience in crafting signal processing and wireless communications systems. Working knowledge of wireless communication systems (e.g., OFDM/MIMO, etc.) and hands-on experience with lab testing and characterization will be necessary. Strong understanding of communication theory & signal processing-related algorithm design (such as timing recovery, signal estimation and detection, MIMO signal estimation and detection, automatic gain control, channel estimation, equalization, coding theory, beamforming, etc.) Deep understanding of components/modules within wireless communication systems, and the possible impairments from those components, and the corresponding calibration and impairment reduction methods/algorithms, digital pre-distortion, PAPR reduction algorithms, Tx power control, etc. Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation. Experience in modem architecture, microprocessor architecture, hardware and software control are a plus. Experience on low power algorithm design for power critical application is a plus. Experience with multi-radio coexistence management is a plus. Experience and knowledge on High Level Synthesis (HLS), silicon prototyping, emulation systems, and virtual platforms will be a plus. Experience on bring up of real silicon in lab and being able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) is helpful. Knowledge in existing wireless communication protocols; such as 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant experience required. MS and PhD preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200452263"}