{"title": "Cellular System Engineer", "summary": "In this role, you will be at the center of a silicon design group responsible for designing and productizing innovative cellular SoCs. As a cellular system engineer, you will be responsible for the architecture, simulation, bring up, and validation of end-to-end cellular systems. Join us, and help us innovate new wireless systems technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries and improve the product experience for our customers across the world!", "description": "Understanding and mapping of systems algorithms and requirements to HW/FW architecture. Simulation-based validation of the control flows and algorithms. Pre-silicon prototyping and emulation-based bring up and validation of the cellular system. Bring up of the cellular end-to-end system including characterization and optimization of performance in the lab.", "key_qualifications": "Experience in the design and bringup of wireless communication systems with expertise in cellular systems preferred. Good understanding of communication theory and signal processing, AGC, beamforming, Tx power control, mitigation of radio impairments, and calibration algorithms. Strong technical background in 5G-NR/LTE/UMTS (3G/2G) physical layer and protocols is a plus. Experience with silicon prototyping, emulation systems, and virtual platforms is a plus. Hands-on experience in the bring up of real silicon in the lab. Ability to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc). Good experience with Matlab, Python, and/ C/C++ and efficient analysis and automation scripting. Strong working knowledge of multiple 4G/5G signaling and physical layer test equipment (Keysight/Anritsu/R&S) along with their automation interfaces is a plus. BS and 10+ years of relevant proven experience is required.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience is required M.Sc. or PhD preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200489611"}