{"title": "RF Test Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our multifaceted group, you will have the outstanding and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day. Apple's RF System Engineering team is looking for passionate, self-motivated individuals to work on system bring-up and validation of multi-radio coexistence of Cellular, Wi-Fi, BT, GPS, NFC, etc. on Apple's newest products.", "description": "You will be responsible for planning, developing, implementing testing setups and procedures in support of assessing platform-level multi-radio coexistence performance during product development and mass-production manufacturing. Your responsibilities may include: Collaborating closely at different contract manufacturing sites with wireless, RF, hardware, software and automation engineers during new product introduction to investigate and troubleshoot issues related to measurement, firmware/software, automation. Defining Test methodologies, developing test sequence, validating firmware / software feature preparedness for characterizing multi-radio coexistence performance. Crafting, developing, and implementing procedures for the testing and evaluation of in product development and mass-production manufacturing to meet Apple standards. Planning and tracking status and preparedness for multi-radio coexistence validation testing to ensure performance covering a wide range of test cases on multiple wireless technologies at both conducted and radiated levels. Identify test related readiness, issues and optimizations throughput the product development cycle. Conducting detail failure analysis, analyze logs; debug test flow and automation, close test gap and correlation issues, come up with mitigation plans and drive resolution. Optimizing and improving of test methodologies to enhance operational efficiency in characterization on product development. Making recommendations for changes required in testing procedures and methodologies, manufacturing processes, and/or new testing requirements.", "key_qualifications": "", "preferred_qualifications": "Experience working on two or more wireless system (Connectivity, Cellular, 5G) bring-up, integration, development, validation and manufacture processes. Practical knowledge of wireless test verification and validation test equipment and systems including building blocks, RF systems characteristics of building blocks, test system design, implementation and commissioning. Experience with wireless system design verification and working with firmware/software engineers to enable such verifications. Solid understanding using UNIX shell, scripting, and communication protocols including TCP/IP network, GPIB. Solid understanding and experience in one or more programming language Swift, Python, C++, Java and C is a plus. Master's degree with 3+ years of experience is preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200479228"}