{"title": "Product Design Engineer - iPhone (India)", "summary": "Apple is a place where extraordinary people gather to do their best work. Passion works here, our community is made up of every kind of individual: artists and designers, engineers and scientists, problem solvers and doers. Together we build things and experiences people once couldn’t have imagined — and now can’t imagine living without. So if you’re excited by the idea of making a real impact, a career with Apple might be your dream job. Just be ready to dream big!", "description": "Apple is looking for a Product Design Engineer to be part of Apple’s iPhone Product Design group at Bengaluru in India. We are looking for someone who is passionate about engineering and thrives on innovation to help build the next generation of the world’s most innovative mobile devices. This role is for someone with strong mechanical design skills, an ability to lead projects in a multi-functional setting, and excellent communication skills with both vendors within Asia and internal teams at Apple. The role will require the ability to deliver outstanding design solutions while balancing multiple priorities on demanding schedules. You will be responsible for building prototypes for design validation and driving failure analysis. As designs mature, you will also primarily work on-site at contract manufacturers within India to implement and integrate iPhones to enable product at scale.", "key_qualifications": "Demonstrated ability in plastic and metal part design including material selection, Experience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing, with focus on high volume manufacturing, Experience with component modules (OLED/LCD, batteries, sensing, acoustic, camera modules, etc.), Integration of wireless antenna (Cellular, GPS, WiFi, BT) into mechanical enclosures, a huge plus, Integration of electrical subsystems (OLED/LCD, sensing, microphone, speaker, receiver, camera), Solid understanding of FEA (stress analysis)", "preferred_qualifications": "Experience with designing consumer electronics products, Experience working with contract manufacturers, highly desirable, Handheld/portable device experience, a huge plus, Siemens NX proficiency preferred, Design of highly cosmetic enclosures with liquid and dust ingress protection, a huge plus", "education_experience": "Bachelors or Masters/PhD degree with a specialisation in Mechanical/Aerospace/Mechatronics Engineering and 3+ years of related proven experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200469842"}