{"title": "Platform Enablement System Engineer", "summary": "Are you passionate about working on products that enrich the lives of millions of people? Do you enjoy understanding how things work in breadth and depth, and how to make them even better? Are you excited to work on cutting-edge technologies and products? If so, we'd love to hear from you! In this role, you will constantly be challenged to learn about how Apple's latest features and technologies work and collaborate with teams to enable this exceptional technology across the Software/Hardware/Silicon organizations. We work with teams to help them identify focus areas, run experiments, analyze data, and develop tools to help achieve efficiency while maintaining a great user experience!", "description": "Work cross-functionally with silicon, hardware, and software teams to help deliver surprise and delight in our latest products while enabling system development and stability. This role requires the technical depth and expertise to understand how things work from the user interface down to the state transitions of each hardware block. This insight is instrumental to drive hardware build readiness, system stability in the presilicon and NPI phase, and convey the overall system stability impact to engineering teams with potential solutions for optimization. Strong problem-solving skills and effective communication are critical for success in this role.", "key_qualifications": "Strong understanding of hardware component and hardware/software interactions\nExcellent debugging/triaging skills to solve challenging problems\nKnowledge of LLDB and other debug tools\nExcellent spoken and written communication skills\nExcellent prioritization skills and focus. Experience developing scripts/tools to distill and visualize data is a plus\nHighly proficient in Python; knowledge of C/C++ is a plus", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent experience in Computer Science, Computer Engineering, or a related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200498362"}