{"title": "Graphics Design Verification Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. The Graphics Design Verification Engineer will be responsible for the unit level pre-silicon RTL verification of embedded graphics IP. This includes developing a deep understanding of the micro-architectural details of relevant units and the greater GPU design. A strong computer architecture background, and solid software skills are key attributes to contributing to the Graphics IP verification effort. Exposure to graphics concepts is a plus but not required.", "description": "-  Develop verification plans in coordination with design leads and architects\n-  Create and maintain verification test bench components and environments\n-  Develop comprehensive constrained random test suites\n-  Run simulations and debug design and environment issues\n-  Create functional coverage points, analyze coverage, and enhance test environment to target coverage holes\n-  Create automated verification flows for block verification\n-  Apply knowledge of hardware description languages (VHDL/Verilog), and logic simulators to verify complex designs\n-  Work with other block and core level engineers to ensure seamless verification flow", "key_qualifications": "The ideal candidate will have minimum 3 years of relevant experience including:\n- Experience developing test plans for advanced hardware designs\n- Experience with SystemVerilog or expertise in object-oriented languages such as C++\n- Knowledge of common verification methodologies such as UVM or OVM\n- Experience with HDL simulators and waveform viewers\n- Experience with Python, Ruby, or Perl; developing tools for workflow automation\n- Experience working under strict schedule deadlines with the ability to manage multiple priorities\n- Excellent communication skills and ability to collaborate", "preferred_qualifications": "", "education_experience": "BS + minimum of 3 years of experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, etc., etc. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449450"}