{"title": "CPU Post-Silicon Performance Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. In this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly.", "description": "• Collaborate with software and system teams to identify and trace and profile critical workloads for CPU performance and power\n• Develop representative benchmarks for CPU critical workloads\n• Capture key workloads from silicon for CPU performance evaluation\n• Identify hardware and software performance bottlenecks\n• Work closely with the Architecture, Micro-Architecture, and RTL teams in identification of solutions\n• Run and analyze workloads on simulators and prototype devices as well as work on developing and automating performance analysis infrastructure", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nExperience with CPU architecture and micro-architecture concepts\nExperience working in a performance modeling environment\nExperience with tracing on silicon for performance evaluation\nProficient in scripting languages such as Python or Perl\nComfortable with C and C++\nKnowledge and experience with common performance benchmarks and workloads\nKnowledge of OS internals and compiler technology is a plus\nExperience in analyzing application performance", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451825"}