{"title": "Silicon Validation Engineer", "summary": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!", "description": "You will be part of a small team responsible for:\n\nBench test, debug, and characterization of embedded on-chip circuitry (PLLs, DLLs, Clocks, Data Converters, DDR Memory, and various I/O Interfaces)\n\nDevelopment of benchtop electrical tests exercising on-chip circuitry through a combination of FPGA, JTAG, SPI, and analog interfaces\n\nDrafting & Execution of scripts to automate tests, extract results, and generate reports using database and analytical\n\nGenerating reports for characterization and/or debugging to provide design feedback\n\nIn-system PI/SI measurements for correlation with simulation models\n\nCollaborating with cross functional teams including Design, System HW, and SW\n\nSupporting ATE and Product Engineering", "key_qualifications": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automation\nStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.\nProficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.\nExperienced in scripting language, Python preferred, to automate test and analyze data\nDiligent & Emphasis on quality of results\nInitiative in taking ownership & responsibility to drive deliverables\nStrong verbal and written communication skills\nHands-on lab experience including soldering/instrumenting systems is a plus", "preferred_qualifications": "", "education_experience": "BSEE is required plus minimum 3 years of industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451962"}