{"title": "GPU Physical Design Engineer", "summary": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU!", "description": "•    Work closely with the FE team to understand chip architecture and drive physical aspects early in design cycle.\n•    Drive outstanding PD construction and optimization recipes for performance, power and Area (PPA).\n•    Work on pioneering designs in the latest technology nodes.\n•    Collaborate to drive methodologies and “best known methods” to streamline PD work, come up with guidelines and checklists, drive execution, and supervise progress.\n•    Drive the work among place and route engineers, set goals and breakthroughs, plan short and long-term work, understand dependencies between different domains like top, STA, block PnR.\n•    Lead and resolve design and flow issues related to physical design, identify potential solutions and drive execution.", "key_qualifications": "•    We value ability in all aspects of ASIC implementation including Synthesis, DFT insertion, Floorplanning, Clock and Power distribution, Place and Route and all aspects of timing, electrical and physical signoff.\n•    Work with FE teams to understand the design architecture to drive optimal floorplanning and physical implementation through early RTL feedback.\n•    Use design knowledge and innovative physical construction and optimization flows to push performance, power, and Area (PPA) of GPU designs.\n•    Experience with multi-voltage, power gated, and power retention will be an advantage.\n•    Practical knowledge with hierarchical design approach, top-down design, budgeting, timing, and physical convergence will be an asset.\n•    Experience on integrating IP from both internal and external vendors and able to specify and drive IP requirements in the physical domain.\n•    Depth of expertise with large GPU designs (>20M gates) with frequencies in excess of 1GHz applying brand-new technologies.\n•    From a CAD tool perspective, experience crafting Floorplanning tools, P&R flows, global timing verification and Physical Design Verification Flows is required.\n•    Familiar with various process related design issues including Design for Yield and Manufacturability, multi Vt strategies and thermal management.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of BS + 3 years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200453774"}