{"title": "CPU Microprocessor Design Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. Apple’s Silicon Engineering Group (SEG) designs high-performance, low power microprocessors that power our innovative products! We are looking to hire talented engineers who are experienced in CPU architecture and microarchitecture to develop our world-class CPU designs. Join us to help deliver the next groundbreaking Apple product!", "description": "As an RTL Engineer, you will own or participate in the following: -  Microarchitecture development and specification - from early high-level architectural exploration through micro architectural research and arriving at a detailed specification -  RTL ownership - development, assessment, and refinement of RTL design to target power, performance, area, and timing goals -  Validation - support test bench development and simulation for functional and performance verification -  Performance exploration and correlation - explore high performance strategies and validate that the RTL design meets targeted performance -  Design delivery - work with multi-functional engineering team to implement and validate physical design on the aspects of timing, area, reliability, testability, and power", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nShould possess direct CPU RTL experience\nThorough knowledge of microprocessor architecture including expertise in one or more of the following areas: instruction fetch and decode, branch prediction, instruction scheduling and register renaming, out-of-order execution, integer and floating point execution, load/store execution, cache and memory subsystems\nExpert in using Verilog and/or VHDL. Experience with simulators and waveform debugging tools\nExpert in logic design principles along with timing and power implications\nMust have deep understanding of high performance and low power techniques and trade-offs in a CPU microarchitecture\nExperience in working with cross-disciplinary teams to define CPU microarchitecture features\nExperience in C or C++ programming is a plus\nExperience using an interpretive language such as Perl or Python", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200461005"}