{"title": "Location Software Engineer", "summary": "Develop and enhance multi-sensor navigation technology as a location software engineer. Craft the next generation of location-aware mobile experiences by working on state-of-the-art technologies to seamlessly integrate people’s digital and physical lives. Are you passionate about building technology that will make a difference? Do you flourish with good creative challenges? Do you love attention to detail? If so, we might just be the team for you.", "description": "Here at Apple, we build devices and services that enrich our customers’ lives. In the location technologies group, we help people connect: with each other, and with our planet. We reach more than a billion people. We help them find their way, and we help them find each other. Every single day, our customers use more than 5,000 years of location services, so what we do and how we do it makes a difference. Join our team, and we’ll help you do the best work of your life. If you join our team, you’ll design, develop, debug, and support location software with a focus on multi-sensor radionavigation technology. You’ll collaborate to qualify performance and support commercialization for hundreds of millions of users on multiple hardware families. You’ll design and implement data structures, threading models, business logic, and system architectures in support of location services. You’ll also optimize performance, robustness, and scalability of new and existing services.", "key_qualifications": "Proficient in C++ or Java. Proficient in modern object-oriented programming concepts and design patterns. Proficient in efficient, real-time software design. Familiar with Linux-based operating systems. Familiar with statistics concepts and statistical data analysis. Comfortable implementing complex mathematical algorithms and bookkeeping schemes. Comfortable working with a development team on a large body of code. Eager to learn new techniques and experiment with cutting-edge navigation technologies.", "preferred_qualifications": "", "education_experience": "Applicants should have a PhD, Master’s or Bachelor’s degree in Computer Science or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $204,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses - including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200498298"}