{"title": "RTL Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. In this role, you will have the opportunity to specify, design, and help in the verification and lab bring-up of advanced mixed-signal circuits (digital side).", "description": "In this job you will be responsible for specifying and/or micro-architecting digital blocks in advanced mixed-signal circuits. You will be also responsible for RTL coding of blocks specified by you or others. You will participate in the design verification and bring-up of such blocks by writing meaningful assertions, debugging code, and otherwise interacting with the design verification team. You will participate in the lab bring-up of those circuits by potentially writing test scripts, analyzing lab data, proposing experiments, etc.", "key_qualifications": "Deep knowledge of mixed signal concepts\nDeep knowledge of RTL design fundamentals\nDeep knowledge of Verilog and System-Verilog\nDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)\nWorking knowledge of synthesis, static timing, DFT is a huge plus\nDeep knowledge of System-Verilog assertions, checkers, and other design verification techniques\nDeep knowledge of scripting languages. Perl and Python are plusses\nDeep knowledge of Algorithm developments\nStrong communication and presentation skills SERDES knowledge is a plus", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451420"}