{"title": "SAP Security Administrator, Enterprise Systems", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts! Join Apple and help us leave the world better than we found it. As a part of Apple's Information Systems & Technology team, the SAP Security Administrator will be responsible for delivering robust security solutions that support SAP Provisioning, Authentication, Authorization, and Application-level security. You are someone with solid grasp of the ERP processes and Information Security principles and disciplines coupled with an appetite for solving problem, critical thinking, superb communication skills.", "description": "- You will lead, research and design solutions to keep pace with an ever-expanding SAP landscape, often providing expertise to address more complicated requirements to meet various project goals. - Propose improvements, both process and technical, to improve and strengthen security in the environment. - Architect solutions and provide direction to the security design of existing and future implementations. - Document and share security information with a multitude of partners to establish rapport and garner support for security improvements. - Work with Information Security, Internal Audit, Compliance, Engineering and Project teams to find opportunities to continually advance SAP security. - You will interact with teams with varied strengths across multiple locations and time zones. - We seek a self-starter, forward-thinking person with strong leadership capabilities. - You will be accountable for the successful completion of multiple projects simultaneously.", "key_qualifications": "Deep knowledge of various aspects of SAP Security, both from a technical as well as business process perspective. Knowledge of SAP authorization concept for both on-premise systems such as ECC, BW, Portal, BPC as well as S/4 HANA and new SAP Cloud solutions. Experience with integration to Identity Management Systems for provisioning to SAP on-premise and Cloud applications, with Directory Services for Authentication via SSO. Experience with SAP GRC Access Control for centralized risk management, compliant provisioning and role administration. Experience in handling Segregation of Duties (SOD) Risks, applying mitigation controls, supervising sensitive access and elevated privileges. Familiarity with continuous monitoring tools such as Solution Manager’s Configuration Validation & System Recommendation or similar products. 5+ years of Security Administration experience or equivalent knowledge of Systems, Network, Application and technical security solutions.", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent work experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200483724"}