{"title": "SoC Embedded Software Engineer", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. At Apple, we go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! Joining Apple as a SoC Embedded Software Engineer, you will craft and implement embedded software for System on a Chip (SoC) bring up and test. You will write software for Apple silicon in a bare metal environment, and work closely with the Silicon Validation and Software Engineering teams to bring up new silicon, and ensure the quality of every device when manufactured.", "description": "-  Design and implementation of firmware for SoC bring up, validation, and test.\n-  Enhancing and maintaining the development and debug environments, tools and methodologies.\n-  Support of functional test environment for device characterization, failure analysis, and mass production.\n-  Generating post-silicon directed diagnostic and stress test cases and debugging failure cases using multiple HW and low level SW platforms.\n-  Leveraging and porting design verification and silicon validation tests to enable improved test coverage of IP in silicon test\n-  Developing software to confirm that the silicon behaves as architected under the various supported modes.\n-  Developing targeted functional tests to screen failures identified during the product lifecycle. Use of soft skills and data driven approach, to effectively collaborate, influence multi-teams decisions to arrive at win-win solutions", "key_qualifications": "We are looking for candidates with a minimum of 10 years of experience and the following:\n- 10 years of embedded software experience, including debugging and characterization\n- Exposure to SoC bring up and complex IPs\n- Expert embedded C programmer.\n- Proven leadership in problem solving, and delivery of high volume and high quality SW\n- Experience using laboratory equipment (e.g., logic analyzer, digital oscilloscope)\n- Experience reading and working from device and board schematics", "preferred_qualifications": "", "education_experience": "A minimum of a BS degree and a minimum of 10 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200459823"}