{"title": "Computer Vision Algorithm Engineer", "summary": "The display technology team features a collaborative environment with creative, smart talents, world-class products and cutting-edge technologies. Team provides opportunities for individuals to contribute across a wide spectrum of disciplines. Best in class engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Pushing the envelope to design and ship innovative products with best-in-class technologies and user experiences are the main goals of the display technology team", "description": "This individual will play a key role in computer vision/image processing algorithms design and development to enable display and other optical components calibration and metrology. You will work closely with cross-functional groups to ensure the success of current and future Apple display/optical products. Candidate will be responsible for, -  Specify, design and implement metrology and calibration algorithms during Apple new product introduction (NPI) process and mass production -  Develop, optimize, qualify and debug the algorithms and software -  Integrate and validate the algorithms in manufacturing test equipment -  Evaluate efficacy of the algorithms as compared to human visual inspection -  Define algorithm performance verification specs and review existing algorithms  -  Collaborate with other team members to deploy the algorithms/SW to factories during the NPI process -  Analyze large amounts of NPI performance data", "key_qualifications": "The ideal candidate will have 5+ years of algorithm development experience. Deep knowledge of image processing and computer vision. Rich experience in algorithm development. Experience in camera-based metrology is a plus. Familiarity with Matlab image processing toolbox or OpenCV. Programming skills in Matlab/C/C++/Python. Experience in data analysis and visualization with Matlab/Python/JMP. Self-motivated, responsible, excellent written and verbal interpersonal skills", "preferred_qualifications": "", "education_experience": "MS/PhD in Electrical Engineering, Computer Engineering, Computer Science, Optics or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200472645"}