{"title": "Packaging Engineer, Packaging Product Design", "summary": "When was the last time you enjoyed a box as much as the product inside? At Apple, every customer interaction is an opportunity for surprise and delight! This philosophy extends beyond the product to its packaging, where every detail is thoughtfully considered. The Packaging PD team is a diverse group of people responsible for the design and execution of structural packaging for all Apple products from shippers to finished goods boxes. Our packaging delivers an outstanding customer experience, while protecting products throughout the shipping environment, and advancing Apple’s sustainability goals. We collaborate with a wide range of teams including Industrial Design, Marketing, Environmental, Operations and many others during the design process. We are seeking someone who approaches problem solving with passion, creativity, and curiosity. Apple’s approach to packaging is unique, so we value people who are eager to learn new skills and further improve their knowledge of packaging design, manufacturing processes, and sustainable materials. We welcome fresh influences from outside the standard packaging industry to promote innovation in creative ways.", "description": "- Develop hardware and software test guidelines and systems to collect analytics on design performance\n- Create arrays of measurements and failure analysis metrics to benchmark designs\n- Work with internal and external teams to refine plans, optimizing value tensions between groups\n- Build positive relationships with supplier teams while driving them to execute validation plans\n- Statistically analyze data to provide risk assessments and technical recommendations\n- Collaborate with project teams reviewing materials, manufacturing processes and evaluation testing standards\n- Travel up to 20% to support engineering build activities and design development", "key_qualifications": "New product development in a fast-paced, at-scale, engineering environment\nData-driven approach to solving complex and novel technical problems\nOwnership of simultaneous projects, including oversight of third-party vendors\nStrong engineering fundamentals with a basic understanding of physics and metrology", "preferred_qualifications": "", "education_experience": "BS degree with an emphasis in Mechanical Engineering, Packaging Science or related field\nComputer industry experience not required; serious consideration will be given to qualified candidates from other analytical fields with robust engineering fundamentals\nEffective verbal and written presentation skills", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200493265"}