{"title": "Audio Hardware Systems Integration Engineer", "summary": "At Apple, ideas have a way of quickly becoming extraordinary products, services, and customer experiences. Sound is a crucial and compelling facet of the customer experience. Apple is assembling a world-class team of engineers who obsesses over the delivery of products that enables our customers to experience music with delight and connect with transparency. The AirPods System HW team consists of outstanding electrical engineers who own and deliver electronic solutions by closely collaborating with multi-functional teams such as industrial design, product design, technologies and manufacturing. The small form factor of these products pushes us to innovate in every aspect of product development that includes areas like sophisticated physical architectures, new RF technologies, and highly power-optimized IC development. We are a diverse team of electrical engineers with a passion for audio, music, and product development.", "description": "- Seeking enthusiastic engineers who will be owning aspects of system HW development like driving product architectures, PCB/flex design, crafting optimized system validation plans, manufacturing test requirements, prototype bringup and testing, data analysis and issue debug.\n- Some travel to support manufacturing is part of the role.\n- Experienced team members will get to influence future AirPods architectures based on findings from optimally delivering their programs.", "key_qualifications": "Consistent track record as a hands-on electrical engineer in designing high volume products from proof of concept to mass production\nExpertise in board and flex designs including schematic and layout with strong abilities to implement to a timeline and deliver high-quality designs\nExpertise in prototype bring-up, electrical measurements, debugging and functional verification\nProven electrical engineering fundamentals covering both analog and digital concepts such as power and data converters, amplifiers, high-speed serial and memory interfaces, digital logic, RF/wireless, and signal integrity\nExperience of working with technology, software, reliability, manufacturing, operations organizations is desirable\nExcellent oral and written communication skills are desired", "preferred_qualifications": "", "education_experience": "-  BS/MS/PHD EE.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200497223"}