{"title": "Wireless Module Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering, ATE, and reliability engineering.", "description": "You will be the technical liaison between internal cross-functional teams and RF vendors, track their development milestones, and resolve technical issues affecting MP goals. You are responsible to take the RF component/module to MP with yields meeting Apple quality requirements. You will communicate component risks to the executive team and work with vendors to integrate their schedules and risk mitigation plan into the project.", "key_qualifications": "7+ years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices. Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable. Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closures. Ability to define best engineering methods for custom Wireless module and component development during prototyping phase. Excellent problem-resolution skills are expected to address technical issues during development and ramp. Excellent communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies. Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus. Ability to travel internationally.", "preferred_qualifications": "", "education_experience": "BSEE + 10 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200473793"}