{"title": "Analog Mixed-Signal Modeling Engineer", "summary": "At Apple, we work every day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? Apple Silicon Engineering Group has an opportunity for a forward-thinking and unusually creative AMS modeling engineer.", "description": "Develop accurate behavioral and electrical models for mixed-signal circuits, including SerDes, PLLs, memory interfaces and data converters Verify the performance and accuracy of the developed models against circuit-level simulations and measurements. Optimize and refine models to ensure accuracy while maintaining efficient simulation performance Collaborate closely with system architects and designers to understand circuit specifications, design intent, and performance requirements Create clear and comprehensive documentation for the developed models, including specifications, usage guidelines, and limitations Contribute to the development of modeling methodologies, best practices, and automation tools to enhance the efficiency and accuracy of circuit mode", "key_qualifications": "Strong experience in analog and mixed-signal circuit modeling, design, or architecture Solid understanding of behavioral modeling techniques, model parameter extraction, and model calibration Strong analytical and problem-solving skills to debug and optimize complex circuit models Innovation: Enthusiasm for exploring new modeling methodologies and techniques to improve circuit design and verification processes Proficiency in programming languages such as C++ or Python Ability to work in a dynamic and fast-paced environment, adapting to changing project requirements and priorities", "preferred_qualifications": "", "education_experience": "BSEE/MSEE with minimum 3 years of industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200446052"}