{"title": "CPU Verification Engineer - Haifa", "summary": "In this visible role, you will be responsible for defining DV methodologies, test-bench infrastructure ramp-up and project execution of multiple all new CPU cores for Apple product lines. You will develop verification test plans, tools, test benches, protocol monitors, and high-coverage stimulus vectors. Apply advanced techniques to achieve verification with the highest quality, productivity, and time-to-market. You will work closely with the design team to ensure timely delivery of quality designs. Applying advanced methods to accelerate verification time. Involvement in Post Silicon Validation.", "description": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple products.", "key_qualifications": "+6 years experience in SoC Verification\nDeep knowledge of CPU core architecture and extensive experience with cores verification\nYou will need to have advanced knowledge of SoC architecture/design, in-depth knowledge of verification flows and broad system view\nExpected to have a deep understanding and shown experience in advanced verification processes, including dynamic, coverage based and formal methods\nExtensive experience with SystemVerilog or UVM\nExperience with verification infrastructure development\nScripting and programming experience using several of the following: Perl, Python, Verilog, System-Verilog, C, C++, and TCL\nKnowledge of ARM / MIPS / VLIW / RISC-V instruction set – an advantage\nKnowledge of formal, hardware acceleration – an advantage", "preferred_qualifications": "", "education_experience": "B.Sc / M.Sc in Electrical or Computer Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200458940"}