{"title": "Apple Shop in Shop Manager (m/w/d), Gütersloh (Part time)", "summary": "Stell dir vor, was du hier alles machen könntest. Bei uns entstehen nicht nur Produkte, sondern auch Ideen, die ganze Branchen revolutionieren. Grundlage dafür ist die Vielfalt unserer Mitarbeiter:innen. Sie ist die Basis für alles, was wir machen – von unseren Technologien bis zum Engagement für die Umwelt. Komm zu Apple und hilf uns, die Welt besser zu hinterlassen, als wir sie vorgefunden haben. Als Apple Channel Store Advisor:in kümmerst du dich selbstständig und eigenmotiviert um den Verkauf, das Merchandising und alle operationellen Aufgaben im Apple Shop bei einem unserer Reseller. Mit deiner Entscheidungsstärke als Business Manager:in und deiner dynamischen Leitung motivierst du die Teams unseres Partnerstores, bringst dich proaktiv ein und zeigst deine Begeisterung für Technologie und Apple. Dein Ziel ist die Förderung der Verkaufszahlen von Apple Produkten im Partnerstore, der noch weitere Marken im Programm hat. Dafür leistest du hervorragenden Kundenservice, gibst Produktdemos für Kund:innen, schulst die Teams vor Ort und stellst die Einhaltung unserer Merchandisingstandards sicher. In dieser Position hängen deine Arbeitsstunden von den geschäftlichen Anforderungen ab und umfassen 24 Stunden pro Woche, einschließlich an Abenden und Wochenenden.", "description": "Aufgaben in dieser Rolle: – Du repräsentierst Apple in einem Partnerstore und unterstützt das dortige Team, Pläne zu entwickeln, um Verkaufsziele zu erreichen und das Geschäftwachstum voranzubringen. – Du arbeitest mit den Teams unseres Partnerstores zusammen und schulst sie zu unseren Produkten, Services und Vorgaben fürs Merchandising, sorgst für hervorragende Kundenerlebnisse und machst sie zu Markenbotschafter:innen. Du informierst die Teams über die neuesten Apple Produkte und Services und motivierst sie, sich auch selbstständig auf dem Laufenden zu halten. – Im direkten Kundenkontakt stellst du das Ökosystem von Apple vor und erklärst durch Demos und Beratung Produktvorteile und Mehrwert – im Einzelgespräch und mit Gruppen. – Du bemühst dich um herausragende Ergebnisse und sorgst dafür, dass die Markenstandards von Apple beim Brand Merchandising bei dir vor Ort perfekt umgesetzt werden. Dabei stellst du sicher, dass unsere Ausstattung im Verkauf und Merchandising sowie die Produktpräsentation immer den aktuellen Vorgaben und Standards von Apple entsprechen. – Du überprüfst die Umsetzung unserer Richtlinien täglich und eskaliert Probleme, damit sie zeitnah und effektiv behoben werden. – Du bereicherst das Kundenerlebnis, indem du Probleme kreativ, neugierig und mit neuen Ideen angehst.", "key_qualifications": "Du hast mindestens 2 Jahre Erfahrung in einem vergleichbaren Bereich. Dir macht es Spaß, Kund:innen und Storepartnern zu vermitteln, wie Apple Technologie Leben bereichern kann. Du lernst immer wieder Neues und teilst dieses Wissen auch gern mit anderen. Du bist außergewöhnlich kundenorientiert. Du verfügst über ausgezeichnete Kommunikations- und Präsentationsfähigkeiten. Du hast die Fähigkeit, anderen Wissen zu vermitteln, sie zu inspirieren und Einfluss auf sie zu nehmen. Es fällt dir leicht, Beziehungen aufzubauen und dich als vertrauenswürdige:r Geschäftspartner:in an einem Point of Sale zu etablieren.", "preferred_qualifications": "", "education_experience": "Fluency in German required.", "additional_requirements": "Weitere Infos zu Jobchancen bei Apple findest du unter http://www.apple.com/jobs/de/. Apple setzt sich für Chancengleichheit am Arbeitsmarkt ein und engagiert sich für Inklusion und Vielfalt. Wir sorgen dafür, dass alle die gleichen Chancen auf Einstellung oder Weiterbildung erhalten, auch Minderheiten, Frauen, alle mit geschütztem Veteranenstatus und Menschen mit Einschränkungen. Apple benachteiligt keine Bewerber:innen, wenn sie sich über ihre Vergütung oder die Vergütung anderer Bewerber:innen informieren oder austauschen. Wir gewährleisten, dass unser Bewerbungs- und Interviewprozess genauso wie unsere essentiellen Aufgaben am Arbeitsplatz für alle offen sind, wir auf die umsetzbaren Bedürfnisse eingehen und Menschen mit Behindertenstatus zusätzlich weitere Arbeitgeberleistungen bei Apple in Anspruch nehmen können. Du brauchst eine Anpassung? Bitte kontaktiere uns.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200498142"}