{"title": "Semi-Custom Physical Design Engineer", "summary": "At Apple, we work constantly to craft products that enrich people’s lives. Do you like changing the game and working on challenges that no one has solved yet? We have an opportunity for a forward-thinking and unusually hardworking Semi-Custom Physical Design Engineer! As a member of our dynamic group, you will have the rare and opening to craft upcoming products that will delight and encourage millions of Apple’s customers every single day!", "description": "As a Semi-Custom Physical Design engineer, you will excel in all phases of Physical Design of sophisticated Analog Mixed Signal designs from RTL to delivery of our final GDSII. Your responsibilities include but are not limited to the following:\n- Generate block level static timing constraints.\n- Build block level floorplan including pin placement and power grid.\n- Develop and validate advanced low power clock distribution network.\n- Perform block level place and route and close the design to meet timing, area and power constraints.\n- Generate and Implement ECOs to fix timing, noise and EM IR violations.\n- Run Physical Design verification flow at block level and to provide guidelines to fix LVS/DRC violations.\n- Participate in establishing accurate CAD and Physical Design methodologies by constructing designs.\n- Assist in flow development for Analog-On-Top integration.\n- Crafting sophisticated layout for mixed signal, and analog circuits in deep sub-micron CMOS technologies.", "key_qualifications": "-  Significant Physical Design experience on mixed-signal and/or SOC designs\n-  Deep knowledge of industry standards and practices in Physical Design, including physically aware synthesis, Floor-planning, and Place & Route\n-  Deep knowledge or experience with digital signal processing filters design, analog-on-top mixed signal physical and timing interface implementation techniques, and a passion to pursue out-of-the-box physical implementation techniques to achieve uncompromised design goals\n-  Validated experience in developing and implementing Power-grid and efficient Clock Distribution Networks\n-  Significant understanding of all aspects of physical construction, Integration, Design-For-Test (DFT), and Physical Verification\n-  Confirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to be able to collaborate with logic design teams for timing fixes. Power user of industry standard Synthesis, Physical Design, Timing & Power Analysis tools\n-  Deep understanding of scripting languages such as Perl/Tcl\n-  Deep understanding and knowledge of STA methodology, constraints, and tools\n-  Solid understanding of Physical Design Verification methodology to debug LVS/DRC issues at block level", "preferred_qualifications": "", "education_experience": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200458638"}