{"title": "Senior Media Applications Engineer (Objective-C, Cocoa)", "summary": "Audio & Media Technologies (AMT) provides the media and graphics foundation across all of Apple's innovative products, including iPhone, HomePod, Apple TV, Apple Watch, iPad, Macs as well as professional and consumer applications from Final Cut to Music, TV and iWork. We take the media experience to the next level on the iOS, tvOS, watchOS and macOS platforms with technologies such as AVFoundation, CoreMedia, CoreAudio, CoreAnimation and Metal. We are looking for an experienced software engineer to join our team! The applications developed by our team are used by millions of customers across all Apple platforms! We are passionate about delivering the best possible media playback experiences for the benefit of applications throughout the Apple ecosystem.", "description": "You will work multi-functionally in both the design and implementation of new software technologies in addition to facilitating their adoption by a wide range of internal and external clients. You will design and implement media playback, editing and system UI APIs for utilization within your immediate organization as well as adoption by other engineering teams. You will also work closely with the user interface design team in the implementation of system media UIs.", "key_qualifications": "5+ years programming skills, preferably with C and Objective-C\nProficiency developing with Cocoa or other application frameworks\nExcellent understanding of optimization and performance issues across OS software layers\nSolid experience at bug screening and triage.", "preferred_qualifications": "", "education_experience": "BS or MS in CS/CE (MS preferred)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495839"}