{"title": "Engineering Manager, iOS & macOS Settings", "summary": "Apple devices have revolutionized how people live, connect, and work. It’s not by chance! By thoughtfully blending beautiful, premium hardware with intuitive, innovative system software, we design and build a uniquely impactful user experience. And at the leading edge of this user experience are the essential apps, components, and frameworks of System Experience. Help us dramatically improve the experience of every iPhone, iPad, and Mac user who’s trying to get their device working and feeling just right for them. Partner with an energetic, hard-working, fun team of managers, engineers, cross-functional teams, and world-class designers to deliver the best system experiences on the planet!", "description": "We’re the System Experience Settings team, and we exist to make configuring and personalizing Apple products intuitive and effortless. We’re looking for a motivated leader to own our roadmap, partner cross-functionally, and make it reality. Is that you? Every customer who uses an iPhone, iPad, or Mac uses Settings. Our ongoing challenge is to deliver an experience that is simple to use and understand even as our system’s features get more advanced. We’ll achieve this by establishing conventions, tooling, and platform support for teams who own Settings experiences, including ourselves. As engineering manager of the Settings team, your responsibilities will include: growing and hiring direct reports, prioritizing work across the team, representing the team’s work within broad efforts, and influencing stakeholders and partners to deliver the needed impact. You’ll lead the charge in an area with incredible breadth — because Settings ultimately spans the whole system, you’ll quickly become familiar with system features. You’ll also collaborate with outstanding engineering and cross-functional colleagues who will help you succeed and grow as we deliver an incredible user experience together.", "key_qualifications": "You have stellar software engineering fundamentals and Objective-C or Swift proficiency. As an exemplary owner, you consistently take initiative to design, commit to, and deliver solutions that achieve the needed outcomes. You expertly manage your team’s commitments by establishing and driving a well-communicated process. As a fast learner and proficient context-switcher, you’re comfortable with a high breadth of ownership. You have outstanding problem-solving, critical thinking, and interpersonal skills. You’re a terrific cross-team and cross-functional partner — every project you participate in is better because of it. You make high-quality user experience-centric product decisions. You have a demonstrated record of success in building a high-performing team. You’ve got 5+ years of software engineering experience.", "preferred_qualifications": "", "education_experience": "Bachelor of Computer Science or equivalent skills and work experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200473342"}