{"title": "AIML - Annotation Analyst - Vietnamese Language Specialist", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple donʼt just craft products - they build the kind of wonder thatʼs revolutionized entire industries. Itʼs the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Are you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send a message, play their favorite song or even take a selfie. The team is passionate about technology with a focus on enriching the Siri customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity and acute attention to detail. Bring passion and dedication to your job and there's no telling what you could accomplish. This position will be based at the Apple corporate campus at Ang Mo Kio.", "description": "Our team is comprised of very talented individuals, who are passionate about AIML and ensuring Apple services are at their best. As part of the Data Operations team you'll play a central role in enhancing the user experience. We work in a fast paced, dynamic, technology focused environment. As an Annotation Analyst, you'll listen and transcribe audio files and evaluate Siri’s response and language usage, from customers who have opted in to the grading program. You'll use your language and cultural knowledge, along with analytical skills, to evaluate responses against guidelines. Your flexibility and the ability to prioritize tasks is essential. We focus on the user experience, thinking creatively on how customers use Siri and use this knowledge for improvements. Because we believe our individual backgrounds, perspectives, and passions help us build the ideas that move all of us forward. We'll train you to be an expert in understanding, supporting and improving the customer experience. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.", "key_qualifications": "Fluency in Vietnamese reading, writing, and comprehension skills to support Vietnamese speaking market; Fluency in English reading, writing and comprehension skills; Excellent active listening skills with the ability to understand verbal nuances in the Vietnamese dialect; Highly organized with strong attention to detail; Understanding of the APAC region and cultural variations where the Vietnamese dialect is spoken; Demonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialect; Ability to independently navigate systems and tools; Demonstrates integrity and focuses on customer privacy; Experience in content review or a similar environment, prior testing experience preferred; Demonstrates flexibility and adaptability to changing work-flows and responsibilities; Grows with a team where expertise is shared and feedback is welcomed; Excels at working independently to make timely decisions and take appropriate actions; Experience as an end user of Siri, similar Intelligent Personal Assistants, or other AI; Successfully meets or exceeds targets, working within tight deadlines; Ability to identify business process solutions that increase efficiencies; Ability to maintain focus and aim for high results through large volumes of task", "preferred_qualifications": "", "education_experience": "Bachelors degree or equivalent work experience preferred", "additional_requirements": "Ability to work Monday through Friday with shifts starting between 7am-9am and ending between 4pm-6pm local time.; with scheduling and work flexibility based on business needs; Positions with language skills require strong grammar and cultural awareness; Successful completion of a pre-employment assessment and background check; Successful completion of initial training and certification testing", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200497481"}