{"title": "IT-Manager", "summary": "Mantenere alto il successo di un Apple Store richiede molteplici abilità di leadership, e come Manager tu le possiedi tutte. Sai mantenere la calma anche nell’ambiente dinamico dello Store, imparando da ogni nuova sfida. Sai costruire e motivare team altamente efficienti composti da persone di talento, capaci di offrire ai clienti un’esperienza positiva in ogni campo: training, acquisto e assistenza. Ma soprattutto sai condividere la visione di Apple con dipendenti e clienti.", "description": "Come Manager dovrai ispirare il tuo team perché crei opportunità di acquisto. Inoltre dovrai guidare i talenti che forniscono assistenza tecnica e training, e lavorare in collaborazione con il Team Aziende. Dietro le quinte sarà tuo compito supervisionare operazioni come l’inventario e il visual merchandising. Avrai un ruolo attivo nella formazione dei tuoi team, occupandoti di assumere, formare e sviluppare i membri del personale in queste e altre discipline. Sostenere la semplicità di Apple è un lavoro complesso: tu lo farai sembrare facile.", "key_qualifications": "", "preferred_qualifications": "Comprovata capacità di saper sviluppare il team per offrire ai clienti un’esperienza straordinaria, ottenendo risultati concreti. Esperienza nel gestire con diplomazia i vari impegni nei confronti di clienti, staff e operazioni. Capacità di adattamento alle sfide che caratterizzano un ambiente retail in costante evoluzione. Hai comprovate capacità di leadership, con esperienza nella vendita diretta ai clienti. È gradita esperienza multi-settoriale. Ottima conoscenza della lingua inglese, scritta e parlata, e della lingua locale. La conoscenza di più lingue rappresenta un valore aggiunto. Ti adatti a orari di lavoro flessibili. L’orario di lavoro dipenderà dalle esigenze aziendali.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200480234"}