{"title": "SWE - Software Build Engineer, Software Delivery", "summary": "The Software Build & Integration team at Apple is at the core of the Apple software development process. We are responsible for delivering the state-of-the-art operating systems and applications to Apple customers. The role empowers build engineers to influence new feature integration into Apple software, by collaborating with engineers from Software, Hardware, Localization, QA, and Project Management teams. Software Build Engineers will have the opportunity to utilize and implement solutions using distributed computing, cloud services, and virtualization technologies to deliver Apple software to customers. This involves engineering innovative solutions for Apple's production build system in support of macOS, iOS, watchOS, tvOS, Xcode, and more!", "description": "-  Demonstrate willingness to ask for clarification and context to understand the big picture \n-  Find multiple solutions to a problem, evaluate tradeoffs, and decide the best approach \n-  Have strong coding ability and testing mindset, e.g. CI/CD, high code coverage, chaos engineering \n-  Understand, retain, and perform complex procedures \n-  Attention to detail, Critical Thinking, Effective Communication, Problem Solving\n-  Familiarity with version control systems such as git or subversion\n-  Develop strong UNIX debugging skills \n-  Communicate status frequently to product teams and engineering program managers \n-  Collaborate with team members, eager to jump and help when is needed, with a Can Do Attitude\n-  Document new processes or update an existing wiki pages\n-  Willingness to learn and master new programming language like: Swift, Go, Python, etc\n-  Comfortable reading backtraces and stack traces", "key_qualifications": "MacOS, iOS, or UNIX development experience\nUNIX administration and strong software debugging skills\nKnowledge of operating system, network, and compiler concepts\nKnowledge of a scripting language (eg Python or Perl)", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.\nApple benefits programmes vary by country and are subject to eligibility requirements.\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200496728"}