{"title": "Wireless SoC Low Power Design Engineer", "summary": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply!", "description": "- Drive SoC low power micro-architecture, definition, implementation, and analysis\n-  Own complex SoC power management, boot flow, clock and reset management\n-  Write micro-architecture specifications and design specifications\n-  Design, implement, and debug complex logic designs\n-  Integrate complex IPs into SoC\n-  Run tools to ensure lint-free and CDC clean design\n-  Support all front end design and integration activities such as  synthesis and timing constraints\n-  Support pre and post silicon validation", "key_qualifications": "5+ years of experiences in Low Power ASIC design and SOC integration\n- Proficiency in ASIC logic design\n- Extensive experience with SoC power management design including power gating, isolation, retention and DVFS techniques\n- SoC level clock mesh / reset design experience desirable\n- Proficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)\n- Deep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLP\n- Hands on experience with PTPX and Power Artist power analysis tools is a plus\n- System architecture knowledge is a bonus\n- Silicon validation / power measurement experience is a plus", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449805"}