{"title": "GPU Architect", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. As part of the GPU Micro-Architecture team, you’ll be responsible for defining a GPU that enriches the lives of millions of people every day.", "description": "As a GPU Micro-Architect you define the fundamental building blocks of the next generation Apple GPU. You will collaborate with experienced architects, designers, and modelers in order to assess the feasibility of ideas, refine ideas, and seed new ones. You will define new micro-architecture and optimize existing ones; you will use your intuition gained from experience as a guide but not as a filter. The role requires the analysis of specific workloads across existing and new product categories to identify bottlenecks and opportunities for improvement. As a member of the GPU micro-architecture you will collaborate to improve our processes and look for ways to boost the productivity of the entire team.", "key_qualifications": "You should have experience and knowledge of CPU or GPU architecture and micro-architecture concepts as well as deep expertise in one or more focused CPU/GPU areas. Areas could include ISA development, core/shader micro-architecture, geometry pipeline, rasterization, vertex/fragment/compute shading, texture pipeline, caching, or memory subsystem design. You will be setting direction thus you must be able to work in an environment of uncertainty and able to work through ambiguities. We believe that there is power in teams working together so you must have strong communication, influence, and negotiation skills. We are a data-driven group and believe in the power of individuals proving their own ideas; therefore we prefer you have relevant hands-on experience with RTL or architectural modeling. Proficiency in high-performance, low power designs. Proficiency in VHDL/Verilog. Proficiency in C/C++. Proficiency in scripting languages such as Perl, Python and Ruby.", "preferred_qualifications": "", "education_experience": "BS + minimum of 10 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448870"}