{"title": "5G/4G Cellular Layer1 Control Firmware Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world.", "description": "-  Specify, design, and implement PHY L1 firmware of an innovative mobile wireless communications system.\n-  Implement key scheduling and control processing in tight timelines, latency, and energy constraints.\n-  Work with Software designers to define interfaces to protocol stack, MAC/RRC, and required processor subsystems.\n-  Assist in developing pre-silicon emulation systems/virtual platforms and use them for pre-silicon L1 FW design and verification.\n-  Evaluate and implement pioneering tools for build, formal verification, and testing.\n-  Define methodologies and standard methodologies.", "key_qualifications": "Minimum BS and 10 + years of relevant industry experience.\nIn-depth, hands-on experience with PHY L1 Software/Firmware in 3G/4G and/or 5G.\nStrong understanding of software engineering principles and core computer science fundamentals.\nStrong understanding of C and/or C++, compilers, build and source code control tools.\nExperience with memory-constrained Real-Time Operating Systems (RTOS) and concurrent programming.\nSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems.\nExperience with silicon prototyping, emulation systems, and virtual platforms.\nStrong experience with debugging embedded software systems.\nFamiliarity with UARTs, JTAG, and oscilloscopes.\nKnowledge and experience of Matlab is a plus.", "preferred_qualifications": "", "education_experience": "Minimum BS and 10 + years of relevant industry experience", "additional_requirements": "-  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n-  We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200485885"}