{"title": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for software engineers with background in embedded software development to join a fast-paced environment.", "description": "•    Develop boot and driver code for Apple SOC, including AP clusters, IO Co-Processor system, fabric, power management, memory and other I/O devices \n•    Design, implement, and enhance Common Firmware Environment (CFE) and other platform software for Apple silicon validation organization \n•    Develop system software to exercise power saving feature (suspend and resume) \n•    Contribute to SDRAM initialization and calibration development \n•    Implement firmware driver for PMIC and battery charging \n•    Participate in the chip bring-up on simulator, emulation, FPGA and silicon\n•    Develop applications covering system level use cases and functional features \n•    Participate in SOC architecture, design specification and board schematics review", "key_qualifications": "•    Proficient in C/C++, assembly a plus\n•    Background in embedded software development, bare metal, RTOS and/or Linux\n•    Solid understanding about ARM specification, computer architecture, operating system\n•    Experience in boot code, CPU & SOC initialization, device drivers\n•    Familiar with IO protocols: I2C, SPMI, UART, GPIO.\n•    Experience in lpDDR4/5, DRAM initialization and calibration a big plus\n•    Good troubleshooting skills in silicon bring-up and embedded software debugging\n•    Experience with script language such as Python, Perl, or Tcl.", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200452776"}