{"title": "CPU Physical Design Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. Join us to help deliver groundbreaking Apple products!", "description": "As a CPU Physical Design Engineer you will drive or participate in the following:\n- Drive RTL-to-GDS design convergence through logic synthesis and place-and-route tools targeting ambitious PPA goals\n- Will be responsible for block-level physical design delivery along with closure of backend flows, electrical requirements and improving silicon yield\n- Will work closely with internal CAD and PD methodology teams on industry standard synthesis/PNR tool features and optimizations and their adoption in CPU design\n- Will work with x-functional top-level teams on the aspects of CPU floorplan, timing, power, reliability, and testability\n- Will work closely with custom IP teams to define and co-optimize memory macros, library standard cells to improve design PPA", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nStrong electrical engineering fundamentals in logic design, digital circuits, and deep sub-micron technology along with timing, power, and area implications\nProficiency in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with timing budgeting, floor-planing, and physical integration and verification to converge complex designs\nSolid understanding of low power, high frequency physical design techniques leveraging advanced syn/PnR tool features and best in class physical design methodology\nProgramming and scripting ability (Perl, TCL) with strong fundamentals\nAbility to work independently and/or lead a physical design partition in collaboration with x-functional teams\nExcellent communication and interpersonal skills", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451541"}