{"title": "CPU Top-Level Verification Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products! In this highly visible role, you will be at the center of a chip design effort collaborating with many disciplines, with a critical impact on getting high quality products to millions of customers quickly.", "description": "As a CPU top-level design verification engineer owning the verification methodology, tools, and flow of a high performance lower power processor design, you will have the responsibilities as follows: -  Work closely with verification engineers and RTL designers on defining effective verification methodology for low power complex processor design. -  Develop test plans, test benches, and test environments -  Develop tests in assembly, and C/C++ -  Drive and develop the tools and flows for advanced verification methodology. -  Developing, verifying, and maintaining efficient testbench environments -  Develop coverage monitors and analyze coverage to ensure all the test cases in the plans are covered", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience, The ideal candidate should have experience in the following areas: Knowledge of digital logic design and processor architecture, Verification tool and verification development experience, Random test generator development, Testbench setup and build experience, Random regression and failure analysis, Driving coverage convergence, Verilog or SystemVerilog, Programming/scripting skills (C, C++, Python), Problem solving skills", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200455850"}