{"title": "Business Development Manager, Apple Pay Ecommerce - Japan", "summary": "At Apple, our team doesn't simply build products; we pioneer groundbreaking innovations that transform industries. It is the diversity of our dedicated individuals and their unique ideas that fuels the innovation driving everything we undertake, from cutting-edge technology to industry-leading environmental initiatives. Can you imagine what you could do here? Apple Pay is revolutionizing how people pay in Japan. More and more customers are adopting the convenience, security and privacy of using favorite payment and transit cards on the platform. We invite you to be part of our world class team! We are seeking an experienced Business Development professional to join the Apple Pay team to develop partnerships and strategic alliances with e-commerce merchants, Payment Service Providers, Processors, and various enablers in Japan and South Korea. Partnerships will be focused on securing acceptance of Apple Pay in merchant Apps. Join Apple and be a part of our mission to make a positive impact on the world and contribute to leaving it better than we found it!", "description": "In this role, you will work closely and effectively with Apple Pay business leaders, Worldwide Developer Relations, product marketing, and engineering product teams to implement partnership strategies, close deals and engage partners to drive usage that impact core business metrics. More specifically: - Identify and create strategic pipeline of prospective partners with scalable approach to increase merchant adoption of Apple Pay. - Successfully navigate partner landscape to identify key decision makers and negotiate deal terms to close. - Participate internally on cross-functional teams to define partners, product requirements, negotiation strategies, integration and testing plans and go-to-market launch programs. - Continually manage partnerships delivering new feature improvements and ongoing support to drive customer trial and usage. - Provide regular communications to internal teams regarding partnership strategy and results.", "key_qualifications": "Experience building and sustaining successful relationships across the e-commerce value chain and have extensive knowledge of all aspects of online payments including its inherent risks (e.g. fraud, acceptance costs) and issues (e.g. low conversion). Proven understanding of the e-commerce ecosystem; emerging mobile payments; and be technically proficient to lead iOS SDK feature enablement discussions. Demonstrated passion to conceptualize, create and deliver new, innovative customer experiences with merchants and their e-commerce vendors though the introduction of Apple Pay is a plus. Ability to promote new payment products and technologies and speak fluidly to positively influence highly technical and non-technical decision makers. Also skilled at helping partners identify, navigate and overcome technical or detailed complexities to drive adoption of new technology", "preferred_qualifications": "", "education_experience": "B.A./B.S. required, MBA preferred", "additional_requirements": "- Extensive business development experience in high growth consumer internet/technology companies- Experience in structuring business and technical terms to close with strategic partners- Direct experience working with various online merchant segments, PSPs, payment schemes, and processors is ideal- Comfortable with technology and a strategic problem solver - instinctively knows what is best for Apple and the customer- Ability to initiate and drive projects to completion with minimal guidance- Team worker with a proven track record of working with initiative both within and across functions- Excellent time and project management skills- Fluency in Japanese and English is must, Korean a plus. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200420956"}