{"title": "SoC Physical Design Machine Learning Engineer", "summary": "As a member of our dynamic ML PD group, you will have the rare and rewarding opportunity to craft and implement methodologies and solutions with a high impact on upcoming products that will delight and inspire millions of Apple’s customers every single day. In this role, you will be part of a very unique team that develop new physical design methodologies using ML, AI and state of the art Algorithms. You will have the opportunity to help each of our SOCs to be even more optimal in terms of Power, Performance, and Area (PPA) and you will help to improve the RTL to GDS cycle. Sites: Herzliya and Haifa", "description": "As a SoC Physical Design Machine Learning Engineer, you will be part of a dynamic team that is building the most efficient application processors on the planet, powering the next generation of Apple products. You will use your experience in physical design and/or machine learning to solve very hard and unique problems. Your work will directly impact vast areas of the flow including logic synthesis, floor planning, power/clock, distribution, place and route, timing/noise analysis, power/thermal analysis, voltage drop analysis, design for manufacturing/yield, and beyond. As part of your work, you will collaborate cross functionally with design, power, post silicon, CAD, software and machine learning teams in an engaging and rewarding environment.", "key_qualifications": "5+ years of experience in physical design, Excellent programming skills in Python or C ++, Practical experience and knowledge in various machine learning algorithms, from logistic regression to deep neural networks and reinforcement learning is a plus, Excellent communication and organizational skills, Solid math background and understanding of algorithms and data structures, Strong intellectual curiosity, Solid understanding of circuit design is a plus, Experience with flow development for a large number of users on a tight schedule is a plus", "preferred_qualifications": "", "education_experience": "Minimum Bachelor's degree in EE.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200476229"}