{"title": "Wireless MAC Standards Manager", "summary": "As the Wireless MAC Standards Manager, you will be responsible for managing a team of wireless standards architects that is focused on driving innovations for the next generation MAC protocols and algorithms, achieving high performance and reliability in all environments, and enabling evolving and emerging wireless communications systems and applications.", "description": "Proven track record of leadership and management experience. Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB or similar technologies. Strong familiarity with MAC protocols and algorithms of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies. In-depth knowledge on wireless communication systems, architectures, protocols, and algorithms. In-depth knowledge of wireless MAC protocols and algorithms, such as channel access, QoS, power save, low latency, coexistence, security, privacy, etc.", "key_qualifications": "Lead team to develop new and innovative MAC protocols and algorithms, influence standards, and generate consensus around company strategic interests in SDOs. Analyze standards contributions to understand performance benefits, implementation complexity, and design and architecture tradeoffs. Work closely with internal teams to align on standards strategy and to communicate standards development and direction. Derive features and requirements from MAC layer standards for internal teams. Lead team to develop innovative proprietary MAC layer protocols and cross-layer algorithms for new and emerging applications. Collaborate closely with internal teams to evaluate and simulate expected system level performance. Work closely with cross-functional teams to innovate and achieve best-in class product performance.", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $286,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200476364"}