{"title": "Analog/Mixed-Signal Layout Engineer", "summary": "Together we could help craft the future's finest devices. New insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish! Our team is searching for a self-motivated engineer for the role of AMS Layout Designer. As a member of the AMS team, we will be working on the forefront of technology nodes to build outstanding custom analog and mixed-signal designs used to connect our world-class products to the world in the most efficient way possible. You will become part of a development team that nurtures engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment. Multifaceted, thoughtful people and inspiring, innovative technologies are the norm here. Will you help us design the next generation of revolutionary Apple products?", "description": "As a part of our team you will be responsible for delivering fully-verified, clean layout. This includes the following: Crafting sophisticated layout for mixed signal and analog circuits in deep sub-micron CMOS technologies. Reviewing and analyzing floorplans and intricate circuits with circuit designers. Running complete sets of design verification tools available on AMS blocks. Working with the circuit design team to plan/schedule work and coordinate vital layout tradeoffs as needed. Interpreting LVS, DRC and ERC reports to find the fastest way to complete layout. Exceeding engineering specifications and expectations by working closely with the circuit design team. Applying sophisticated CAD tools and mask design knowledge to deliver accurate and robust layout that matches performance, area and power requirements.", "key_qualifications": "-  Proven experience in analog/mixed-signal layout design of deep sub-micron CMOS circuits\n-  Experience in implementing analog layouts to achieve tight matching, low noise, and low power consumption. Layouts may include data converters, PLLs, analog blocks, resistors, capacitors, pad IOs, ESD structures, etc.\n-  High level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.\n-  Must understand techniques for leading IR drop, RC delay, electro-migration, self heating and coupling capacitance.\n-  Must recognize failure prone circuit and layout structures, have experience with analog and DFM standard methodologies, and proactively work with circuit designer to identify the best approach to solving problems.\n-  Deep proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. reports.\n-  Knowledge of MENTOR GRAPHICS or CADENCE layout tools.\n-  Scripting skills in PERL or SKILL are considered a plus, but not required.\n-  Excellent communication skills and able to work with multi-functional teams.", "preferred_qualifications": "", "education_experience": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200458648"}