{"title": "CPU Power Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!", "description": "As a CPU power engineer, you will have the following responsibilities: - Generate and drive new ideas in micro-architecture and/or circuits to reduce CPU power- Drive budgeting, measurements and analysis of CPU power for several use cases- Work with micro-architects and physical designers to study power reduction opportunities- Pre and post silicon power modeling and measurement across several use cases on current and future CPU designs- Work with software and platform teams to optimize CPU power efficiency and usage of power management features.- Drive power management feature definition and silicon tuning", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience, The ideal candidate should have broad knowledge related to software, operating systems, computer system organization, circuit analysis and logic design, Familiarity with high performance CPU architecture, Knowledge of logic design principles along with timing and power implications, Solid C programming and perl/python scripting experience, Strong CMOS design and analysis skills, Strong hands on lab experience characterizing and productizing power management features", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449693"}