{"title": "CoreMedia Software Development Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? Audio & Media Technologies (AMT) provides the media and audio foundation across all of Apple's innovative products. The CoreMedia engineering team within AMT is responsible for implementing software services around linear audiovisual media. This includes local media playback, video-on-demand and live streaming of multimedia content. Join us and be part of the team that powers streaming experiences on iPhone, iPad, Apple TV, HomePod, Apple Watch, and the Mac. Our team is looking for a software engineer who will help improve and develop our existing and new features. Skills for this position include, technical and programming background to help screen, triage, or debug issues for our team.", "description": "The successful candidate for this role is a team-oriented professional with good communication skills and is comfortable in a fast-paced environment. The candidate should be able to do initial screening and triaging of bug reports. Tasks in this role would also include making software changes to address issues and enhance existing functionality.", "key_qualifications": "Software development experience in C/ C++, Experience in scripting languages, Python, Bash, Regex, Experience with debugging software systems, preferably in the media domain, Experience with and understanding of real-time multithreaded programming systems, Understanding of Operating Systems fundamentals", "preferred_qualifications": "", "education_experience": "B.S. or M.S. in EE/CS or equivalent domain experience with a focus on software engineering", "additional_requirements": "Desired but not required: Experience with Xcode and the iOS/macOS development toolchain, Experience in developing and debugging media systems, Understanding of modern processor architecture", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200492790"}