{"title": "Graphics Hardware Verification Engineer", "summary": "Do you love creating elegant solutions to highly complex problems? Do you intrinsically see importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining the Apple GPU group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role, you'll be responsible for block and sub-system level pre-silicon RTL verification of embedded graphics cores. You will also support the top and post-silicon validation teams in ensuring the successful integration of our IPs into the full system.", "description": "As a Graphics Core Hardware Verification Engineer, you will be tasked with the following: -  Apply your knowledge of hardware description languages (VHDL/Verilog), hardware verification languages (SystemVerilog), and logic simulators to verify complex GPU RTL designs. -  Collaborate with architecture, design and modeling teams to converge on design specification. -  Develop and drive verification plans and schedules. -  Architect test benches using sophisticated OOP, UVM and vertical reuse techniques. -  Generate constrained random and advised tests to implement verification plan. -  Run simulations and debug issues across hardware and software. -  Deploy Formal Verification techniques to complement simulation flows. -  Build functional coverage, analyze coverage, and improve test environment to target coverage holes. -  Build automated verification flows such as ML-assisted coverage closure for graphics core verification.", "key_qualifications": "We would like you to have 3 years of relevant experience including: - Strong background in verification of sophisticated hardware at system or component level with ability to debug issues across hardware and software. - Deep knowledge of Computer Architecture and Memory sub-system micro-architecture. - Expertise with various HDL simulators and waveform viewers - Strong experience defining coverage space, writing functional coverage, analyzing results. - Deep understanding of both RTL and gate-level simulation issues. - Experience in GPU architecture and standards (OpenGL/CL, Vulcan, Metal) is desired - Experience with Python, Perl, Shell scripting, Makefiles, TCL is a plus. - Experience with Formal Verification techniques and tools such as JasperGold is positive - Able to share ideas and collaborate under ambitious schedules.", "preferred_qualifications": "", "education_experience": "BS + minimum of 3 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448183"}