{"title": "Health Sensing EE Engineer", "summary": "Are you inventive and unusually adept at anticipating what the future holds? Do you have a passion for human health? As part of our Health Technology group, you’ll design innovative ways for customers to learn about and manage their health. Join our team, and you’ll develop the hardware systems that monitor the human body and its data. You’ll work across a variety of disciplines to help develop sensors, systems, and applications for health, wellness, and fitness. You’ll help millions of customers find new ways their personal devices can serve as functional health tools. Join us, and you’ll empower people to make informed decisions that shape their well-being in daily life and beyond. The Health Sensing team design, develop, and launch next-generation Sensor Technologies in Apple products. The key goal of the Health Sensing team is to enable the world’s best user-experience. New challenges arise every day that require the sharp problem-solving skills of dedicated and inquisitive individuals. The team features a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation.", "description": "- Managing multinational vendors and the projects designated for the team, which will span the lifecycle of a new product from initial design and functional specification of new hardware features and overall subsystem design all the way to supporting and validating these features (35%); -  Driving the development of component/module vendors and tester/evaluation plan bring-up to deliver scalable solution to support Apple mass production in a high quality way (35%); -  Reviewing and commenting on schematics and system reviews, developing analysis tools for hardware performance, performing complex system level tests, enhancing and resolving issues in existing products, and performing unit testing and integration testing (15%); -  Collaborating with hardware, electrical, quality, and test engineers that will be applying the health sensing feature, as well as writing design and architecture documents (15%); and -  up to 20% travel required.", "key_qualifications": "3+ years of hands-on experience and proven track record in electrical or system hardware engineering\nStrong electrical engineering background on analog, mixed signal and failure analysis with mass production experience\nProficiency in Python, MATLAB, LabView or similar scripting tools\nExperience in developing test plans, test cases, assessing risk, and filing appropriate defects\nExcellent written and verbal communication skills, as well as solid collaboration and leadership skills\nKnowledge of system and firmware development is a huge plus\nExperience in working overseas manufacturers and vendors is a plus", "preferred_qualifications": "", "education_experience": "• M.S. degree in electrical engineering plus 2 years of factory support or vendor management experience.\n• Minimum of 5 years of relevant consumer electronics experience required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200472057"}