{"title": "Data Architect", "summary": "At Apple, we believe in hard work, a fun environment, and the creativity and innovation that only comes about when hardworking people from diverse backgrounds approach problems from varying perspectives The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Building this environment starts with YOU! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. If you bring passion and dedication to your job and there’s no telling what you could accomplish. This is a visible and important role at Apple in China and will have great impact on Sales Team.", "description": "• Design and maintenance of information architecture. Responsible for the planning and construction of enterprise platform’s data, data products, and provide decision-making basis for strategic and business decisions. • Define roadmap and transition solutions of data centric application and infrastructures. • Develop and enforce data related standards. • Champion of data governance, continuously improve data quality and data security per business requirements. • Coordinate with the business team and vendors to plan data application architecture design, data field model construction, and drive the implementation of all the above. • Responsible for big data application planning, providing guidance to the business team and vendors.  • Responsible for the research and implementation of cutting-edge technologies in the fields of data platform and large-scale distributed systems.", "key_qualifications": "", "preferred_qualifications": "Familiar with Big Data Tec stacks, such as Hadoop, Spark, Flink, Kafka, HDFS, Hive, Druid and/or other mainstream big data systems, have experience to design and implement at least one modern big data infrastructure as a Chief Engineer or similar role. Proficient in RDBMS database systems, such as MySQL, PostgreSQL, Oracle (1/3) and others. Very skillful SQL user. Proficient in Java or Python or Scalar, familiar with microservice frameworks, and have accumulated and practical experience in container/micro service, middleware, open source big data and other technologies Familiar with common Internet, big data, cloud computing, artificial intelligence and other technologies and knowledge, with Internet data center, technology center construction and other technical background is preferred Have good business analysis ability, business and technical program planning and design ability, and strong logical thinking ability Knowledge of AI & ML, ability of architecting platform for AI engineering is a plus.", "education_experience": "BA/BS Degree in Computer Science, Software Engineering or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200437437"}