{"title": "Engineering Project Manager - RF", "summary": "Apple’s Wireless EPM team is seeking a dynamic, hard-working, and highly motivated Engineering Program Manager to lead multi-functional wireless engineering programs. This role offers an outstanding opportunity to be part of Apple’s product introduction process for iPhone, iPad, Apple Watch, Mac, and more, from prototype to mass production. The EPM role demands a strong EE/RF background to understand technical details of multi-functional issues and risks. This role requires a mix of technical knowledge and project management experience to address a wide range of program variables and specific technical issues.", "description": "Lead multi-functional Wireless engineering teams through the NPI process, from prototype to mass production. Serve as the primary Wireless technical leader for products and manufacturing sites. Collaborate with development teams early in the product development lifecycle to define and implement RF Design at both board and system levels. Drive project build plans for development and material preparation. Coordinate multi-functional teams for failure/root cause analysis and implement corrective action measures. Act as the main contact for wireless tests and processes with Contract Manufacturers. Present RF design & test status and corrective actions to technical staff and executive management clearly and concisely. Work with and drive vendors, integrating their deliverables and schedules into the project. Partner with Operations to ensure a smooth transition from NPI to mass production. Lead a sophisticated and constantly evolving environment requiring efficient and timely decision-making. Frequent travel is expected (30-40+%).", "key_qualifications": "", "preferred_qualifications": "Factory NPI program support experience is preferred. Consumer electronics device development and manufacturing experience is helpful. Wireless SW and FW experience is desired. Ability to collaborate with cross functional teams and partners. Excellent organizational, interpersonal, presentation, and communication & debate skills. Eager to collaborate and be part of a team. Willing to learn and share the knowledge.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495699"}