{"title": "iPhone Hardware System Engineer - System Technologies - SoC", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it.", "description": "- Directly work on SOC hardware system integration, schematic and MLB design review and sign off\n- Directly work on current and future iPhone SoC power and performance characterization, and help drive the optimal system level SoC design solution.\n- Directly work on iPhone SoC silicon bring-up, debug, testing, and validation on the system level.\n- Working with broad x-functional HW and SW teams in silicon and system validation, FA, and factory test. \n- Implement comprehensive test flows in various silicon test environments with scripting languages. \n- Creative, enthusiastic and adaptive in problem solving, be able to work closely with system integrators and follow project schedule, in the full process of concept, design, implementation, debug, validation, and production cycle. \n- Be willing to travel to work in factory build environments.", "key_qualifications": "Strong EE fundamentals and problem solving skills\nDeep understanding of mobile SoC architecture and functionality\nStrong experience and knowledge in SOC functionality and performance testing and validation\nHands-on experience in SoC/board/system-level bring up, issue debug, and testing, lab equipments to measure power/thermal/performance\nHigh level of knowledge in mobile system power delivery and PMIC\nProven engineering passion, initiative, innovation, and creativity\nScripting languages (Python, Perl, Shell, etc.)", "preferred_qualifications": "", "education_experience": "BS/MSEE/PhD", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449457"}