{"title": "HI Design Producer", "summary": "Imagine what you could make at Apple. Great ideas have a way of becoming innovative products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Human Interface Design team conceptualizes, designs and ships the user experience for Apple products and services. Your ideas can impact the interaction, graphic, sound, and haptic experiences used by millions of people across the world.", "description": "The Apple Design team strives to solve the question of what a great product should be. The work is driven by the design process, through a collaborative group of specialists focused on creating the best user experience. Our group leads that collaboration through concepts and prototypes. In this role you would be responsible for supporting a team of designers who craft the UI for Apple software platforms and first party app experiences. Your time in the studio will be used to strategically drive product development by being highly collaborative, detail-oriented, and perceptive.", "key_qualifications": "Track record collaborating with creatives and supporting multi-disciplinary teams to ideate, iterate, and launch new product experiences, Experience managing multiple projects, resources, schedules, and priorities across multiple work streams, ensuring high-quality design solutions in a continuously evolving creative environment, Strong storytelling skills utilized to influence design intent across a variety of specialized teams and range of levels within Apple, Expertise in creating project plans and tracking documents including scheduling and meeting notes, Commitment to designing inclusive and accessible products, Portfolio demonstrating your workflow process, creative IQ, and problem solving abilities", "preferred_qualifications": "", "education_experience": "Degree preferred but not required", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200490457"}