{"title": "Design Verification Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an outstandingly hardworking design verification engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.", "description": "In this role, you will be responsible for ensuring bug-free first silicon for part of the SoC / IP and are encouraged to develop detailed test and coverage plans based on the micro-architecture You are responsible for developing verification methodology suitable for the IP, ensuring a scalable and portable environment. You will get to develop verification environment, including all the respective components such as stimulus, checkers, assertions, trackers, coverage. Furtherm...", "key_qualifications": "Deep knowledge of SystemVerilog and UVM\nDeep knowledge in developing scalable and portable test-benches\nProven experience with verification methodologies and tools such as simulators, waveform viewers\nBuild and run automation, coverage collection, gate level simulations\nSome UVM knowledge, C/C++ level knowledge\nDeep experience with serial protocols such as PCIe or USB, parallel protocol such as DDR\nBasic knowledge of formal verification methodology\nSome experience with p...", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that...", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple em...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448074"}