{"title": "Software Engineer, Server Development - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us. The Vision Products Group is seeking a software engineer to help define and implement user experience paradigms for various compute environments across our platforms. This engineer will help architect and build the foundation of novel user experiences. Being successful in this area will result in a delightful experience for all users of our products. Are you passionate about building massively scalable services that surprise and delight? If you are passionate about solving challenging problems and enthusiastic about innovative and cool ideas, we want to hear from you.", "description": "Imagine the freedom of a startup with the funding and laser focus of the most valuable company in the world. We are looking for an innovative engineer who is hungry for challenging problems. As a Senior Software Engineer in the Vision Products Group Services team: -You will participate in initiatives that are essential to the success of Apple -You will participate and collaborate to solve complex problems with the opportunity to invent innovative solutions -You will work for a company where you will have the opportunity to do the best work of your life -You will be responsible for designing and developing large scale platforms that can support future functionality -You will have the opportunity to create foundational frameworks and APIs, explore and contribute to a wide range of technologies in addition to driving technical architecture and engineering, you will work collaboratively with various teams including device, security, privacy and other teams across Apple", "key_qualifications": "8+ years experience in server software programming languages such as Java\nPassion for creating the highest quality software\nExceptional analytical and problem solving skills\nWillingness to explore new technologies and frameworks to design the next generation services\nExperienced in designing & developing highly scalable applications\nTrack record of practicing test-driven development\nStrong communication, collaboration & interpersonal skills\nExperience/understanding of security & cryptography is a plus", "preferred_qualifications": "", "education_experience": "BS or MS in Computer Science/Engineering or related technical field, equivalent practical experience will be considered.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200460189"}