{"title": "SoC Automation Flow Engineer", "summary": "Does making the next phenomenal technology product excite you? Imagine what you could do here. At Apple, our new insights have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us", "description": "-  As a SOC DV flow engineer, you will have responsibilities including:\n-  Develop, deploy, and support robust, configurable, and scalable tools and frameworks to enable SOC hardware development and verification across multiple projects\n-  Work directly with hardware design and verification engineers across multiple sites to deliver dedication solutions throughout the organization\n-  Partner with other Apple-internal automation teams to demonstrate and improve flows in related organizations by driving new requirements and demonstrating standard methodologies\n-  Identify, capture, and analyze metrics for improved automation reliability and efficiency\n-  Work directly with project leads and engineers to support projects from start to finish and to forecast future needs to stay ahead of project demand\n-  Talk to external tool vendors to ensure their tools are accurately integrated and fully leveraged while assisting with the identification and tracking of issues\n-  Find opportunities for the development and deployment of new software and technologies", "key_qualifications": "The ideal candidate will have experience in the development and maintenance of automation within a hardware or software development environment.\n-  Significant experience scripting in Unix environment with Perl, Python, or Ruby\n-  Solid understanding of modern software development processes and standard methodologies\n-  Ability to design quantitative experiments, capture data, and analyze and present results\n-  Experience with batch job / cloud execution environments is a plus\n-  Experience with SQL and database configuration and operation is a plus\n-  Knowledge of hardware design verification tool configuration and operation is a plus\n-  Knowledge of hardware design verification methodologies is a plus", "preferred_qualifications": "", "education_experience": "Minimum of BS + 10 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200455287"}