{"title": "Product Designer", "summary": "The media and services design team is looking for a product designer to design interfaces for internal tools. These tools are the platform that allows content experts within Apple to manage, modify, and publish services content. We are looking for an outstanding human interface designer who is passionate about user experience design and wants to shape the vast machinery behind the curtain that ultimately helps deliver content to millions.", "description": "The ideal candidate will have a passion for designing elegant experiences for the web and desktop. The position requires deliverables to be provided under tight deadlines and with input from many cross-functional stakeholders. Strong collaboration skills are a must, as well as coolness under pressure, problem solving, attention to detail, and the ability to cope with rapid change. Above all, the role requires a dedicated individual who understands Apple’s high standards and design aesthetic to the core.", "key_qualifications": "Experience designing all aspects of large-scale content management systems including content creation, editing, localizing, and publishing.\nA portfolio of work that showcases excellence in interaction design, visual design, and problem solving.\nOutstanding ability to communicate your ideas to designers, engineers, product managers, and leadership through story telling, visuals, and presentations.\nAble to work independently and in a team environment.\n5+ years of design experience with a focus on Web, iOS, and macOS interfaces.\nAbility to clearly communicate concepts and designs through sketches, wireframes, high fidelity comps, and prototypes, using Sketch, Figma, Photoshop, Keynote, and similar tools.\nExpertise documenting interaction details, visual design specifications, and QA of the implemented product.\nExperience in handling several complex projects simultaneously.\nFlexible and comfortable with ambiguity and change during a project.\nA passion for Apple, our products, and our customers is a must.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200420315"}