{"title": "Formal Verification Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.", "description": "As a formal verification engineer working the complete formal verification for single or multiple design blocks and IP’s (CPU, Cellular and Connectivity IP, Audio and Image Processing IP, Neural Networks IP, Memory/DMA Controller, Security IP, Peripheral IP, Interconnects, Power management subsystems, etc.), you will be responsible for: -  Working with Apple Silicon's world-class SOC and IP design engineers to develop a formal micro-architecture specification -  Developing comprehensive formal verification test plan. -  Proving properties of the design, finding design bugs, and working closely with design teams to help improve the micro-architecture -  Crafting novel and creative solutions for verifying complex design micro-architectures -  Developing and implementing re-usable and optimized formal models and verification code base -  Architecting correct-by-construction design methodologies for improved formal verification efficiency and productivity.", "key_qualifications": "Expert in SoC, CPU, GPU, and/or Cellular designs, as well as VLSI and digital logic design and verification techniques, or expert in formal tools and methodology and their application in and industrial setting. Detail oriented mindset and desire to overcome challenges is required.", "preferred_qualifications": "", "education_experience": "A minimum of a BS degree and a minimum of 10 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": " -  Formal Method or Formal Verification technologies experience and abstraction techniques -  Knowledge and experience in interpreting hardware specifications and using temporal logic assertion-based languages such as SVA or PSL or theorem provers -  Experience in using EDA formal tools and tool development experience is a plus -  Strong proficiency in any scripting language with excellent debugging skills -  Extraordinary teammate with excellent interpersonal skills -  Passionate about developing world-class/innovative formal verification solutions", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200464593"}