{"title": "NL-Manager", "summary": "Om een Apple Store te laten floreren, is een scala aan leidinggevende vaardigheden nodig. Als Manager beheers je die allemaal tot in de puntjes. In de snelle en dynamische omgeving van de Store straal jij rust uit, waarbij je bovendien leert van elke nieuwe ervaring. Je stelt uitstekend functionerende teams samen uit unieke mensen die klanten op een positieve manier van dienst zijn als deze langskomen om iets te leren, iets te kopen of iets te vragen. Maar het allerbelangrijkste is je vermogen om de visie van Apple over te brengen op je medewerkers én klanten.", "description": "Als Manager moet je je team zodanig inspireren dat iedereen op de winkelvloer gericht is op de daadwerkelijke verkoop aan klanten. Daarnaast begeleid je de talenten die trainingen geven en technische ondersteuning verlenen en werk je nauw samen met het Business Team. Achter de schermen houd je bovendien zaken als de voorraad en de winkelinrichting in het oog. Je werkt actief aan de opbouw van je teams door op alle terreinen de juiste mensen aan te nemen en op te leiden. De eenvoud van Apple uitdragen is een gecompliceerde baan, die er door jouw invulling toch heel simpel uitziet.", "key_qualifications": "", "preferred_qualifications": "Aantoonbaar in staat om met zelf samengestelde en gecoachte teams klanten uitstekend te helpen, wat zich uit in de bedrijfsresultaten. Ervaring met diplomatiek laveren tussen botsende belangen van klanten, medewerkers en de bedrijfsvoering. In staat om te allen tijde kalm te blijven en je aan te passen aan de voortdurend veranderende retailomgeving. Je hebt aantoonbare leidinggevende kwaliteiten en ervaring met het werken in een verkoopomgeving met direct klantcontact. Ervaring in andere bedrijfstakken is welkom. Je wilt graag alles weten over de technologie en de producten van Apple. Je beheerst het Engels (in woord en geschrift) en de lokale taal uitstekend. Beheersing van meerdere talen is een pré. Je bent flexibel wat betreft je werktijden. Die zijn afhankelijk van de werkzaamheden binnen de Store.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200467919"}