{"title": "Advanced Package Design Engineer", "summary": "Imagine the surprise and delight of your own creation being launched in a product that millions of people all over the world will use! Apple has a consistent track record of bringing advanced technologies into the hands of the average individual, enhancing lives and connecting people, and if that is something you would like to be a part of, then we'd like to connect with you! We’re looking for a self-motivated, detail-oriented design engineer who is passionate about growing their career as well as the state-of-the-art in technology. This position will support Apple’s Advanced Packaging with responsibilities in package design and design flow development.", "description": "You will be responsible for Package design and design flow development for advanced packaging technologies in a cross-functional team. Other responsibilities include advanced packaging CA D flow set-up, CAD tool bring-up and related areas.", "key_qualifications": "Experience in physical design, Expert in custom physical design and design flow development, APR tools, multi-chip design validation, Broad and deep experience in a CAD-facing role to enable new tools, evaluate tools, flows and tech files, Familiar with conventional packaging design flows, advanced packaging concepts, SIPI/ EMIR/Thermal concepts, Capable of independently driving a complex design project, driving vendors, Excellent communication and people skills, Advanced package design experience is preferred", "preferred_qualifications": "", "education_experience": "BS and 3+years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200459048"}