{"title": "Claris - Backend Software Engineer", "summary": "At Claris, an Apple company, we’re on a mission to empower developers to be their best – solving critical technology problems efficiently to innovate in their workplace. Bring passion and dedication to your job and make a difference to businesses and schools everywhere. Claris is the creator of the world’s leading professional low-code developer platform, offering a suite of tools that empower problem solvers to drive digital transformation in businesses large and small. The company has more than 1 million active users globally across SMBs, non-profits, and the Fortune 500", "description": "We are looking for a professional, experienced engineer who has a passion for using Go to build powerful, efficient micro-services that change how Claris Pro operates. This is an opportunity to join a diverse team that focuses on creating high-quality services and solutions. It will require a deep understanding of Cloud concepts as well as building highly scalable micro-service based solutions. To be successful, you will need to focus your creative energy on collaboration, communication and producing high quality deliverables.", "key_qualifications": "Candidates should have good communication skills, a passion for software development and a working knowledge of: Go programming language (at least 4 years professional working experience), Strong analytical and problem solving skills, Experiences with NoSQL Databases (MongoDB), Micro-service architectures, RESTful APIs, Containerized software development (Docker, Kubernetes)", "preferred_qualifications": "", "education_experience": "Computer Science, Engineering or related Degree or equivalent software engineering experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200407347"}