{"title": "PHY Firmware Design & Development Engineer", "summary": "At Apple, new ideas have a way of becoming products, services and customer experiences very quickly. Every single day, people do amazing things at Apple. Imagine what you could do here! Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability and performance of the product? Will you help us design future generations of revolutionary Apple products? The PHY Firmware team is seeking a firmware engineer with demonstrable passion for building new technologies. The team designs and Develops the Physical Layer Firmware for Wireless Communication Systems. You will become part of a hands-on development team that fosters engineering perfection, creativity and innovation. Dynamic, encouraging people and innovative technologies are the norm here. If you are a resourceful engineer with the desire to research and develop solutions that do not yet exist, we want you to join our team.", "description": "Develop communication firmware for best-in-class implementation of various wireless standards basic research of existing solutions in literature Involvement in design of firmware architecture, from top-level down to block-level Define and write high-level design documents that will enable firmware coding for the micro-controller and fine-tune the firmware for spec compliance on silicon in an RF lab environment. The people who work here have reinvented and defined entire industries with our products and services The same passion for innovation also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us if you want to help deliver the next amazing Apple product.", "key_qualifications": "5+ years of experience in low-level real-time/embedded programming and firmware architecture – mandatory Knowledge in digital signal processing algorithms and/or RF systems – mandatory Experience in RF lab work and testing equipment (Spectrum, Analyser, Signal Generator, etc.) – mandatory Experience and proficiency in C programming language – highly preferred Knowledge in wireless protocols: BlueTooth or WLAN (IEEE 802.11) – highly preferred Experience and proficiency in ARM CPU processors architecture – preferred Experience with programming in assembly language on industry standard CPUs and DSP processors – preferred Experience and proficiency in Scripting languages (Python, Perl) – preferred", "preferred_qualifications": "", "education_experience": "B.Sc/M.Sc in Electrical/Computer Engineering or Computer Science, or related discipline.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200437876"}