{"title": "Display Metrology Engineer", "summary": "Apple's Display Metrology Engineer is a terrific position for someone passionate about technology! Be part of the Display Technology team that fosters a collaborative environment with creative talents that build best-in-class products and groundbreaking technologies. Our team provides opportunities for individuals to chip in across a wide spectrum of disciplines. Engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Our team's main goals are to constantly open up the boundaries to design and ship innovative products with outstanding technologies and user experience.", "description": "You will be responsible for designing and developing objective solutions for calibrating, characterizing, and testing display modules and components for Apple products. You will work on system design, development, validation, and production deployment during the New Product Introduction (NPI) stage, with support from SW/HW cross-functional teams. Develop industry-leading calibration and metrology methodology and solutions Develop macOS SW interfacing with various HW systems utilizing common communication interfaces such as SPI, 12C, TCP/IP, USB and instrument-specific SDs Develop automation software and test sequences that control optical instruments, electronics driving boards, fixture controllers, and display modules. Work with team to define calibration & measurement SW requirements Conduct SW/FW FA of measurement tools.", "key_qualifications": "Hands-on experience of probe testing using probe cards: Experience with cantilever and/or MEMS probe card in cleanroom, System integration of probe card, prober, electrical and/or optical instruments, Experience of probing system for high volume production, Knowledge of probe card ME/EE design & validation is a plus. Knowledge in one or more of the following areas: Display design, characterization, calibration or test, Common interfaces for optical instrument, e.g. CCD/CMOS camera, spectrophotometers, colorimeter etc. Color science and image processing, Experience with software engineering methodologies, processes, and tools. Application or firmware development in macOS or unix environments. Strong programming skills in Python, MATLAB, or C/C++/Objective-C/Swift. Experience developing metrology systems, or its SW/FW sub-systems. Experience with software control of HW instrumentation. Direct hands-on experience working with display products (OLED, LCD, and LED) having a strong passion and interest in this area. Strong problem solving skills; positive outlook and eagerness to step into uncharted technology spaces while being able to engineer solutions to meet project timelines. Ability to own areas of responsibility, being able to self-motivate and work independently. Excellent interpersonal skills; clear technical communication with teammates. The position requires some international travel (up to 15%, after pandemic is over)", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200480138"}