{"title": "PHY layer Performance System Engineer ,SW Tools and LAB automation infrastructure", "summary": "The PHY Performance Group is looking for a Performance Engineer, to be responsible for RF and PHY performance system analysis and debugs, as well as the development of automation, tools, and SW infrastructure in the aspect of architecture and code development for PHY layer lab automation environments. You are encouraged to be innovative, strive for excellence, and care about the small details. Our group is strive to provide a first-in-class support structure that improves our outstanding products and ultimately impacts millions of users every day. If you are passionate about wireless technologies, want to make an impact, and have the desire to work on groundbreaking technologies, then we are looking for you.", "description": "As part of our core group, you will be responsible for SW and automation development of a high-end automation infrastructure and tests modules. In addition, you will be responsible for Wireless performance analysis for the PHY layer and the automation development. You are expected to be innovative, strive for excellence with high motivation, know to drive action to completion, be able to perform organized reports in high quality, and care about the small details.", "key_qualifications": "3+ years of experience with SW design and architecture, automation development in multithreading environments - must; Programming and scripting experience using several of the following: C#, Java, Python - must; Experience with LAB automation environments/infrastructure - must; Accountability being able to drive action to completion - must; Proven work experience inside a team but yet have the ability to handle tasks independently - must; System view and understanding / familiar with RF parameters and measurements methods - advantage; Experience in RF system analysis and debug - advantage; Knowledge of RF lab equipment including spectrum analyzer, VSA, network, power sensors, vector signal generators, switch controllers, combiners - advantage; Knowledge of basic lab equipment including oscilloscopes, multimeters, power supplies - advantage; Excellent knowledge and experience in silicon analysis and debugging skills - advantage; Knowledge in WLAN/BT standard - advantage", "preferred_qualifications": "", "education_experience": "B.Sc / M.Sc in Electrical / Computer / Software Engineering.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200414261"}