{"title": "Analog IC Design Engineer", "summary": "In this role, you will actively work within the Analog/Mixed-Signal team to design and deliver hard IPs to Apple’s products. We have an opportunity for a forward-thinking analog/mixed-signal engineer with background in high-speed data converters, clocking circuitry and analog filters. As a member of our team, you will have the rare and exciting ability to work on upcoming products that will surprise and delight millions of Apple’s customers! At Apple, we work every single day to craft products that enrich people’s lives. We love working on challenges that no one has solved yet. Do you have strong fundamentals and enjoy solving technical challenges? Are you passionate about learning new skills and improving the value of your work? This role offers all of this while offering a strong culture where you drive your own career!", "description": "We have ownership of data converters and other analog mixed-signal circuits. You will be working with multi-functional teams to architect and design innovative analog/mixed-signal circuits. You will also drive mask design to implement layout view of designs. You will coordinate with IP consumers, help define production/bench-level test plans, and conduct design reviews of blocks with peers/management to show design meets spec targets and requirements.", "key_qualifications": "-  The ideal candidate should have deep understanding of analog/mixed-signal design\n-  Solid understanding and expertise in crafting analog/mixed-signal circuit blocks including ADCs, DACs, PLLs, DLLs, filters, bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits and oscillators\n-  In-depth knowledge of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniques\n-  Experience with high-speed digital circuits (e.g., serializer, de-serializer, counters, dividers, etc.)\n-  Design experience in sophisticated CMOS technologies, design with FinFet technology\n-  Hands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterization\n-  Experience in lab testing of mixed-signal circuits and experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designs\n-  Able to build VerilogA/AMS behavioral models, analyze and lead characterization data from lab and volume testing", "preferred_qualifications": "", "education_experience": "Bachelor's of Science in Electric Engineering with 3+ years of relevant experience preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451964"}