{"title": "Economist/Core Data Scientist", "summary": "At Apple, we believe in hard work, a fun environment, and the creativity and innovation that only comes about when hardworking people from a diverse group of backgrounds approach problems from varying perspectives The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Building this environment starts with YOU! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. If you bring passion and dedication to your job and there’s no telling what you could accomplish. This is a visible and important role at Apple and will have great impact on Sales Team. The individual in this role will be responsible for interpreting quantitative data and developing statistical models to forecast and monitor sales demand & supply for sales analytics team.", "description": "Work with various teams to understand business problems, provide data products and business solutions Build models to estimate the causal impact of new programs released across different scenarios Analysis data to find what drives business performance, including but not limited to multi-touch-attribution and media mix modeling efforts Participate in research to design and develop complex decision-making systems Develop internal visualization and modeling tools to facilitate data-driven decisions Present results and other analytical findings to business partners", "key_qualifications": "Strong background in statistics, econometrics, operations research, or quantitative marketing: causal inference, time series analysis, mathematical modeling, linear and non-linear regression, stochastic modeling, mathematical optimization and consumer decision making theory. Expert R/Python programmer also proficient in other languages important to the ETL data pipeline (e.g. SQL) Experience in design/development of complex decision-making systems is good to have Ability to share results with a non-technical audience and advancing multiple projects at once on a tight schedule Advocate and practitioner of version control and reproducible code", "preferred_qualifications": "", "education_experience": "PhD in Economics, Operations Research, Marketing Science, or related fields M.S. in related field with 5+ years experience applying econometric models to business", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200481332"}