{"title": "Assembly Integration Engineer", "summary": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? We are looking for a hardworking and passionate IC Packaging Engineer to join our team! In this highly visible role, you will develop advanced packaging technologies, define assembly baseline processes, decide package BOM, establish package design rules that are optimized for performance, reliability, yield and cost for a variety of projects including SoC!", "description": "Responsible to lead packaging technology development. Work with cross functional team and lead SoC Package development efforts. Package architecture / Package integration Innovation Work with foundry and OSAT to bring packaging solution from concept to HVM. Drive industry with advanced Package solutions, new material development, and specs. 5% International travel.", "key_qualifications": "Experience in Semiconductor Packaging field. Working knowledge in materials characterization and analysis Solid understanding of large FCBGA package, MCM package, 2.5D packaging and 3D packaging technology. General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc. Good communication skills that can enable you to work well with internal multi-functional teams and overseas suppliers. Ability to work independently and solve projects with minimum supervision. Good engineering problem solving skills with strong engineering physics and fundamentals. Can use package design softwares, APD, Virtuoso, etc. Working knowledge in memory packaging. Good program management skill", "preferred_qualifications": "", "education_experience": "-  BS and +10 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450045"}