{"title": "SerDes Micro Architect", "summary": "Apple Mixed Signal Design team is seeking a very creative software architect to help change the way we design our Analog Mixed-Signal IPs. These IPs will power our next-generation mobile silicon, including future versions of our iPhone, iPad, and Apple Watch devices. Analog Mixed-Signal (AMS) Team is seeking a self-motivated SERDES Micro Architect to drive the definition of our next generation IPs. The SERDES IPs will be used in Apple silicon offering breakthrough power and performance for iPhone, iPad, Mac, and Apple Watch.", "description": "You will define the Micro Architecture of analog mixed-signal IPs with emphasis on SERDES design. You will review firmware code, analog and digital circuits and will verify that the design meets performance requirements. You will work with silicon evaluation and design verification teams to define expected behavior. You would lead the debug effort in system bring up and factory test. You will work with signal integrity engineers to determine system requirements.", "key_qualifications": "Experience leading the definition of high-speed SERDES receiver, transmitter, and clocking blocks. Deep understanding of adaptation and optimization algorithms. Deep understanding of communications and information theory. Proficiency in equalizers, timing recovery and system identification. Proficiency in DSP concepts and applications. Familiarity with mixed-signal modeling in Python/MATLAB/C/C++. Experience in system design and performance tradeoff. Familiarity with simulation tools for analog, digital, and/ or mixed-signal circuits. Familiarity with Machine Learning concepts. Experience in firmware or embedded software development is a plus.", "preferred_qualifications": "", "education_experience": "BS degree in technical subject area with minimum 10 years of meaningful experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451380"}