{"title": "SoC RTL Design Engineer", "summary": "At Apple, phenomenal ideas have a way of becoming great products and customer experiences very quickly. The industry is accustomed to Apple taping out the SOC’s for our various products at a rigorous pace. In order to achieve this, Apple’s best-in-class chip is driven by top-notch design engineers who implement various blocks of the chip and deliver high-quality components to SoC. This is a high transparency and critically important role and requires close working relationships with many groups and an organized approach to coordinate all tasks in parallel to hit schedules consistently with a quality design. Our position requires in-depth knowledge of the chip micro-architecture and digital logic design.", "description": "-  Work with architecture team to define the design microarchitecture hierarchy and interfaces and develop microarchitecture spec. Refine the spec with reviews with other teams \n-  Develop RTL design of one or more blocks following established design guidelines based on microarchitecture spec. Own all aspects of RTL development design. \n-  Work and collaborate with other designers in the group to deliver results.\n-  Integrate common/shared IP blocks to design and optimize memories/hard macros required for the block \n-  Work with front-end synthesis/STA teams to ensure timing for the block is met \n-  Work with power/performance and functional verification team to ensure high quality of the block\n-  Work with multi-disciplinary groups to make sure designs are delivered on time and with the highest quality by incorporating proper checks at every stage of the design process", "key_qualifications": "-  A consistent track record of dedication designs in high volume production for low power applications\n-  Experience in driving microarchitecture and developing specification for logic designs\n-  Consistent record of RTL design on large sophisticated designs\n-  Solid working experience with synthesis, power, performance, and verification team to develop and deliver high-quality RTL design timely\n-  Strong interpersonal skills are a must, as the candidate will talk to a lot of diverse groups within the company\n-  Self-starter, highly motivated, highly organized, and schedule-driven is a must\n-  Familiarity with all front-end tools including lint, CDC, synthesis is a plus\n-  Knowledge of high-speed DRAM memory controller design or interconnect design is highly preferable.", "preferred_qualifications": "", "education_experience": "Minimum of BS + 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200484552"}