{"title": "Reliability Engineer Lead – Custom Silicon Management", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will craft and build the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! At Apple, we go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology...", "description": "•You will drive requirements and execution of products, process and package qualification and reliability stress tests conditions and configurations from design stage all the way to successful qualification completion. •Drive and review Design for Reliability and Design for Test to ensure stress-ability and testability. •Lead all aspects of and ensure adequate preparation for qualification including such as corner skew material, BIB/Socket, waveform, electrical bias, thermal effect, lifetime estimation. •Implement POR of process flows, workmanship standards and supervise product performance. •Perform FAI (First Article Inspection) to ensure critical goals are reviewed before engineering, pre-production and production release for Product manufacturing. •Drive investigation and resolution on qualification fallouts and product and process nonconformance of MRB, RMA events through means of FA, CAR, 8D, and reporting. •Support PCN or ECN activities. •...", "key_qualifications": "BS+10 Years of relevant industry experience, Semiconductor engineering experience in the Reliability and/or Quality/Product Engineering role from multinational companies, Outstanding communication skills required, Experience in JEDEC reliability and quality related standards, ISO, and the science behind them, The ideal background will have experience of silicon product level reliability qualification and lifetime behavior model, You will know reliability fail modes of silicon/packaging technologies and fail mechanisms with respect to reliability, Prior experience defining hardware setups and equipment for life, environmental, ESD, Latch-Up and other tests, Validated auditing of supplier sites, materials and processes, Confirmed experience driving suppliers in the areas of silicon Fab process / packaging / assembly, test, ongoing reliability monitoring, post-production qualification, Familiar with process flows, specifications...", "preferred_qualifications": "", "education_experience": "BS+10 Years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200487916"}