{"title": "Cellular Software Development Engineer", "summary": "Join the Wireless Technologies and Ecosystems organization and an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here! Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have invented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "Apple’s Cellular Software team is seeking dedicated, motivated and focused engineers to work across layers on groundbreaking cellular technologies. The position involves identifying and/or developing core cellular technologies that solves everyday problems for customers using iPhone, iPad, Watch and other wireless product lines. We are passionate about keeping our users connected 24/7 wherever they go. This team takes pride in not just coming up with tested software designs but also in re-discussing traditional models of the cellular ecosystem. We do whatever is needed to bring user experience to the next level. Our members enjoy the flexibility to work on all aspects of Cellular Protocol software - SIM, NAS, AS and iOS interfaces, to come up with the best possible solution for any given problem. Are you equally passionate about cellular technologies and have the dream to participate on the creation of groundbreaking technologies? Then this might be the job for you. As part of this team you will influence iPhone user experience worldwide.", "key_qualifications": "3 to 8 years working experience with cellular protocol stacks;\nStrong Software Engineering skills including design, programming (C, C++, script) and debugging (GDB, LLDB);\nExperience on Telephony / Modem Interface / Non Access Stratum / Cellular Control Plane Protocol stack;\nKnowledge in LTE / 5G NR technology is a strong plus;\nGood understanding of 3GPP/ETSI standards;\nHighly motivated and self-directed;\nExcellent problem solving skills;\nJoin hands with a highly connected team and can clearly communicate while participating multiple projects across many teams;\nFervent and inquisitive, and ready to resolve everyday problems in innovative ways;\nLaser-focused on the smallest details that can change the life to our customers.", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Electrical Engineering or Computer Science", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200468576"}