{"title": "Senior Generative AI Quality Engineer", "summary": "Are you passionate about delivering the best user experiences at the highest levels of quality? Have you applied Generative AI to tackle sophisticated problems and brought those solutions to production? If you said yes, then join us! We’re a team of senior software engineers who work at the intersection of AI and Quality Engineering, and our goal is to maintain a high bar of quality for every OS release. In this unique opportunity you will make an impact across a wide range of software engineering teams. You will drive the development and implementation of best practices for qualifying end-to-end features powered by machine learning and foundation models. You will also build novel software prototypes, tools, and applications to improving the quality of our operating systems using foundation models.", "description": "We believe that phenomenal user experiences with our products define our success. We are a highly cross-functional and fast-paced team at the center of quality for Apple’s operating systems. We are looking for candidates who share our passion for quality and our excitement about applying AI and machine learning to set a higher standard for test engineering and quality assurance. This role is perfect for you if you enjoy collaborating with others and exploring how groundbreaking technology can be used to solve challenging problems for the betterment of many teams!", "key_qualifications": "Strong programming skills using standard ML tools such as Python, PyTorch, Tensorflow along with Swift, Objective C, or C++. Hands-on experience using large foundation models (e.g. LLMs) and associated tool chains (e.g. langchain) and APIs to build applications, tools and workflows for production. Experience with methodical approaches to software testing for features powered by machine learning. Proficiency with iOS, macOS or other operating systems such as Unix/Linux. Strong interpersonal and communication skills are a requirement due to the high level of interaction with other engineers, managers, teams, and organizations within Apple. Excellent problem-solving and critical-thinking skills with the capacity to iterate on shared ideas with partner engineers and teams.", "preferred_qualifications": "", "education_experience": "B.S., M.S. or PhD in Electrical Engineering, Computer Science or a related field e.g, mathematics, physics or computer engineering.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200497163"}