{"title": "Wireless Silicon Validation Engineer", "summary": "Are you passionate about changing the world? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. Come join a team of expert software and hardware engineers with a diverse set of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next generation Wireless SoCs! As part of the Silicon Validation team, you will define and develop test coverage to evaluate functional blocks and debug silicon issues.", "description": "You will work jointly with designers and architects to understand various functional blocks and their use-cases. Write, debug, and integrate new tests for integrated Wireless chipsets, complex Digital Interfaces and Power Management Subsystems. We push functional blocks to their limits and debug issues surfaced during testing. Work with other groups and organizations to push these tests down into pre-silicon environments. We work closely with hardware design engineers to debug silicon issues exposed during testing. Support product development builds locally and remotely.", "key_qualifications": "Strong understanding of SoC/FPGA architecture and silicon micro-architecture\nExperience in writing basic embedded software routines and test scripts\nExperience with hardware/software interaction\nSolid Digital logic fundamentals including timing analysis, state-machine debug and/or RTL/test-bench development Experience with high-speed memory systems and communication interfaces\nGood understanding of MAC + Protocol specifications for digital interfaces\nExperience in crafting tests to target specific portions of silicon designs and digital interconnects\nHands on debug experience with usage of modern lab equipment (DSOs, Logic Analyzers, Protocol Analyzers)\nFamiliarity with interpreting and navigating schematics and layout\nStrong desire to deep-dive system level issues and drive problems to closure in a team-based environment with a proactive demeanor", "preferred_qualifications": "", "education_experience": "B.S. in EE or CS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200446448"}