{"title": "Digital-Mixed-Signal Verification Engineer (m/f/d)", "summary": "Imagine what you could do here. At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a transformational and unusually dedicated Digital-Mixed-Signal Verification Engineer. As a member of our dynamic group, you will have the rare and great opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers daily.", "description": "In this position you will be developing analog behavioral models in System Verilog, running model versus schematic correlation simulations to guarantee the matching to the schematic specifications, defining/verifying verification requirements, coding of test scenarios and assertions, doing sub-/system verification with existing UVM top-level test benches, interacting with analog and digital design engineers, firmware engineers, RF layout engineers. This role is available for a Digital-Mixed-Signal Verification engineer who will enable bug-free first silicon for the digital-/analog- and mixed-signal designs. The responsibilities include all phases of pre-silicon verification including developing and verifying analog behavioral models (e.g. LNA, PLL, ADC, DAC, Mixer) in System Verilog at different abstraction levels, matching the schematic specifications till the pre-silicon sub-/system verification with main respect to Analog/Mixed-Signal macros in close collaboration with multiple teams.", "key_qualifications": "Experience in analog design is a must; Experience with digital simulation tools like Cadence NCsim, Synopsis VCS, Mentor Modelsim, and/or Mixed Signal simulation tools (such as Cadence AMS-Designer, Synopsis VCSXA, Mentor Questa). Ability to read and understand schematics to define and implement functional behavioral models; Ability to think on different abstraction levels from very detailed components to system-level; 3+ years of experience in hardware description languages like System Verilog, VHDL, and Verilog is desired; Outstanding sense and drive for the quality of work you're doing; Verification mindset and approach; Reliable, ability to work independently as well as in a team environment; Good interpersonal and communication skills; C/C++ programming language for test case development is a plus; Proficient English skills are a requirement; System know-how in the cellular RF transceiver domain is an advantage", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master's degree in Electrical Engineering or Computer Engineering, Mechatronics, Electronics, or equivalent.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. If you’d like more information about your EEO rights as an applicant. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200480186"}