{"title": "Enterprise/Education Channel Sales Lead", "summary": "Posted: 4 Jun 2024Role Number: 200453661", "description": "-  We navigate complex organizations and quickly establish relationships and rapport.\n-  We understand partner challenges, and perspectives while building credibility.\n-  We lead pipeline development, prospecting, deal execution, implementation, and continued management.\n-  We manage compliance to key commercial obligations and identify gaps/opportunities to drive increased performance YoY.\n-  We identify strategic business opportunities and guide initiatives to grow the account and Channel Partner’s commitment to Apple products over time.\n-  We facilitate Apple interactions across all levels of the organization.\n-  We help develop and negotiate deals and agreements.", "key_qualifications": "Ability to anticipate future trends and implications accurately.Ability to articulate credible pictures and visions of possibilities that will create sustainable value.Ability to creates competitive and breakthrough strategies that show a clear connection between vision and action.Significant years experience in B2B channel management or a related function with experience calling on distributors and resellers at the Headquarters level.Demonstrated strengths in relationship management, teaming across functions, deal making & negotiations.Ability to own the hard calls, making tough decisions and standing behind them, including buy-in, negotiation, push-back, push-through—and sometimes pulling the plug on a project in which considerable time and energy has been invested.Track record of success and upward mobility within organizations.Ability to work in a fast-paced, entrepreneurial environment.Ability to succeed through ambiguity and get results.", "preferred_qualifications": "", "education_experience": "BA/BS Required; MBA Preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200453661"}