{"title": "RTL Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. In this role, you will have the opportunity to specify, design, and help in the verification and lab bring-up of advanced mixed-signal circuits (digital side).", "description": "In this role, you will be responsible for: Performing concept studies and provide direction in terms of performance, gate count and power for digital designs. Writing detailed design specification and test plans in collaboration with architecture, circuit designers and verification engineers. Providing high-quality RTL description, including assertions, for the design. Formal tools and static checkers will be used to guarantee RTL quality. Supporting design verification to ensure bug-free first silicon. Driving functional and code coverage as well as timing closure for designs. Supporting silicon bring-up, performance and power characterization.", "key_qualifications": "RTL design using Verilog or SystemVerilog, assertion writing; Design of state machines, data paths, arbitration and clock domain crossing logic; Logic synthesis, timing constraints; Exposure to Design For Test, understanding of scan concept and writing DFT friendly RTL; Unified Power Format for simulation, synthesis and electrical rule checking Equivalence checking; Prior experience in DDR PHY design and mixed-signal environment is a plus", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 3 years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451419"}