{"title": "Analog/Mixed-Signal ATE Test Engineer", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that moves Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! We are seeking a dynamic engineer to develop ATE test programs for debug, characterization, qualification and production of SoC devices specializing in HardIP tests.", "description": "- Collaborate with DFT and design teams to evaluate IP testability and debug silicon\n- Develop and document ATE test plan for new IPs and products\n- Design and debug test SW & HW for Production, Characterization & Reliability testing\n- Bring quality and efficient test solution for volume production\n- Coordinate test related activities between internal and external groups", "key_qualifications": "IP Understanding: Deep architectural understanding of High-Speed Digital and Analog/Mixed-Signal IP\nNPI Process: In-depth knowledge of the Semiconductor Manufacturing Process\nExtensive experience in New Product Introduction from product concept to volume production\nATE/Testing skills: Expertise in ATE Semiconductor Test Methodology - DFT experience is a plus\nComprehensive, hands-on experience in constructing ATE test programs for High-Speed Digital and Analog/Mixed-Signal IP: Competence in using test measurement equipment (i.e. oscilloscopes, logic analyzers, etc.)\nProgramming skills: Proficiency in programming skills for developing and debugging ATE test programs\nExpertise in scripting/coding to support development of tools and utilities (i.e. PERL, Python, C, C#, etc.)\nHW design: Experience in ATE High-Speed board design and thorough understanding of signal integrity analysis\nTravel is required", "preferred_qualifications": "", "education_experience": "BS and minimum of 10+ years of relevant industry experience is required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200482120"}