{"title": "CPU Silicon Debug Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. You will be responsible for pre-silicon verification, silicon bring-up, and debug of a CPU. The role includes system lab regression testing, lab administration, automation of tasks within the post silicon environment, and carrying out pre-silicon verification of critical debug hooks.", "description": "• Work with architects and verification engineers to bring to bear debug features for CPU and prepare tests for debug of functionality issues on silicon • Own post silicon regression environment and triage initial failures • Own lab hardware environment including updating boards, creating kernel caches etc. • Author and maintain lab automation tools • Perform pre-silicon testing of CPU debug features", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience The ideal candidate should have experience with hardware (logic as well as board) and low-level software skills Strong understanding of processor architecture and micro-architecture Good understanding of firmware and device drivers Experience with board level protocols and programming/debugging devices at the system level Proven collaboration and communication skills Good C and assembly programming skills", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451439"}