{"title": "CPU DFT Verification Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. We are looking for a strong candidate to join our processor verification team focusing on DFT verification. In this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly.", "description": "As a DFT Verification Engineer, you will have the following responsibilities: -  Work closely with architecture, RTL designers, and DFT designers on verifying the functionality correctness of the DFT logic. Including cross functionality between DFT and functional logic. -  Develop and execute test plans and schedules for DFT logic. -  Develop testbenches and tests according to test plan. This includes both in RTL and gates simulation/emulation environment. -  Debug simulation failures and work with design team to suggest potential solutions. -  Develop coverage monitors and analyze coverage to ensure all test cases in the plans are covered. -  Develop Verilog checkers or assertions to verify the design. -  Work with related SOC teams to ensure DFT feature works correctly outside CPU IP level. This includes both running tests at SOC level and review of other teams verification work. -  Work with silicon bringup team on developing tests that to help silicon bring up effort.", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience, The ideal candidate should have DFT design, DFT verification, or processor verification experiences, In-depth knowledge of digital logic design, debug feature, and DFT architecture and microarchitecture, Knowledge of DFT and structural debug concepts and methodologies: JTAG, IEEE1500, MBIST and scan, Knowledge of Verilog and experience with simulators and waveform debugging tools, Experience in developing test plans, test benches and test vectors, Good understanding of CPU architecture is a plus, Experience with lab debug of CPUs/ASIC using built-in DFT and debug features is a plus, Experience with advanced verification techniques such as formal and assertions is a plus, Should be an extraordinary teammate with excellent communication skill with the ability to articulate complex design issues during verification effort, Be able to create and follow detail work schedule and work independently on the verification efforts for a block/area of the design.", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200485332"}