{"title": "AIML - Senior Software Engineer, On-Device Machine Learning", "summary": "At Apple, the AIML - On-Device Machine Learning group is responsible for accelerating the creation of amazing on-device ML experiences. We are looking for a tenured software engineer to help define and implement features that accelerate and compress large state of the art models in our on-device inference stack.", "description": "As a member of this team, the successful candidate will: - Build features for our on-device inference stack to support the most relevant accuracy preserving, general purpose techniques that empower model developers to compress and accelerate SoTA models in apps. Convert models from a high-level ML framework to a target device for optimal functional accuracy and performance. Diagnose performance bottlenecks and work with HW Arch teams to co-design solutions that further improve latency, power, and memory footprint of neural network workloads. Analyze impact of model optimization on model quality by partnering with modeling and adaptation teams across diverse product use cases. Focus on optimizing our software stack for efficient execution on Apple GPUs, ANEs and CPUs.", "key_qualifications": "5+ years proven programming skills using standard ML tools such as C/C++, CUDA/Metal, PyTorch, Tensorflow. Hands-on experience working on LLVM, compiler technologies, optimization techniques like quantization and sparsity-induction is a huge plus. Solid understanding of state-of-the-art DNN optimization techniques and how they translate to hardware acceleration architectures.", "preferred_qualifications": "", "education_experience": "Bachelor’s, Master's, or PhD in Computer Science, Machine Learning or a related field", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. Apple offers comprehensive medical and dental coverage, retirement benefits, discounted products, free services, education reimbursement, and more. Apple is an equal opportunity employer committed to inclusion and diversity.", "pay_benefits": "At Apple, base pay range for this role is between $175,800 and $312,200. Apple employees have opportunities to become Apple shareholders, avail comprehensive benefit packages including medical, dental coverage, retirement benefits, discounted products, free services, education reimbursement, discretionary bonuses or commission payments, and relocation assistance.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200484845"}