{"title": "Senior Manager - Florence", "summary": "The challenges and opportunities of a continuously evolving business make leadership at the Apple Store a rewarding career. It’s your job as a Senior Manager to lead the staff and operations of one or more store areas and seek solutions and results that create a high-performing work environment. By reading situations quickly and acting courageously, you are able to build success for the business and promote the Apple brand through unparalleled customer service.", "description": "As a Senior Manager, you guide other leaders to inspire top performance from their teams. You monitor multiple lines of business within the store to achieve operational objectives and collaborate with corporate business partners to report results. You’re knowledgeable about the industry and keep up to date about competitors and trends. You lead the sales and customer support teams by example, finding solutions to create and maintain a high level of customer focus. To foster growth among your staff, you coach and encourage with clear communications. By developing strong relationships across teams and with customers, you create an environment that enhances loyalty for Apple products and services.", "key_qualifications": "Ability to collaborate with the store leadership team to develop strategic plans across multiple business groups, improving process and surpassing standards to drive the business in the store\nProven ability to inspire, coach, train, and develop store team members to consistently provide exceptional customer service and drive for results\nExperience adapting to challenges, providing support, and guiding communications in a constantly changing retail environment", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.\nCross-industry experience is welcome — a retail background is not necessary.\nYou have a passion for learning about Apple technology and products.\nYou’re fluent in English (both written and spoken) and the local language. Multilingual ability is a plus.\nYou’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200407083"}