{"title": "Graphics (GPU) Performance Modeling Engineer", "summary": "Do you love crafting elegant solutions to highly sophisticated challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In this role, you will be passionate about writing code for performance modeling for GPUs and the performance model infrastructure. This includes working with architects and designers to understand the units being modeled.", "description": "As a Senior Graphics (GPU) Performance Modeling Engineer, you will: Develop performance and functional models for micro-architecture validation as well performance trade-off studies. Perform detailed performance analysis on the models for target workloads. Roll up and present results and recommendations while working closely and collaboratively with the architects and micro-architects. Provide feedback on the performance modeling process with an eye towards improving overall model quality and runtime. Improve the performance modeling infrastructure and tooling.", "key_qualifications": "Deep understanding and experience in sophisticated computer architecture and data parallel architectures, including CPU super-scalar OOO micro-architecture and/or GPU SIMT/SMT architecture. Expert experience with performance and/or functional modeling, including cycle accurate and queueing models, as well as cycle-based, event-driven, execution-driven, and trace-driven modeling methodologies. Very strong C++ coding skills. Strong data analysis skills and tools as pertains to performance validation and correlation. Experience with scripting languages, python preferred. We prefer candidates who exhibit excellent communications skills, demonstrate a sense of motivation and show a high level of organization. We like people who are fast learners and are eager to tackle technical challenges using innovation. Experience with HDLs, Verilog or VHDL a plus.", "preferred_qualifications": "", "education_experience": "BS + minimum of 10 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495895"}