{"title": "SoC Embedded Software Engineer", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? Joining Apple as a SoC Embedded Software Engineer, you will craft and implement embedded software for System on a Chip (SoC) bring up and test.", "description": "• Design and implementation of firmware for SoC bring up, validation, and test. • Enhancing and maintaining the development and debug environments, tools and methodologies. • Support of functional test environment for device characterization, failure analysis, and mass production. • Generating post-silicon directed diagnostic and stress test cases and debugging failure cases using multiple HW and low level SW platforms. • Leveraging and porting design verification and silicon validation tests to enable improved test coverage of IP in silicon test. • Developing software to confirm that the silicon behaves as architected under the various supported modes. • Developing targeted functional tests to screen failures identified during the product lifecycle.", "key_qualifications": "3+ years of embedded software experience, including debugging and characterization. Exposure to SoC bring up. Expert embedded C programmer Experience using laboratory equipment (e.g., logic analyzer, digital oscilloscope). Experience reading and working from device and board schematics.", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200456935"}