{"title": "Sales - Area Sales Manager, Malaysia", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nWhy Apple?\n\nAt Apple, we believe our products begin with our people. By hiring a diverse team we drive creative thought. By giving that team everything they need we drive innovation. By hiring incredible engineers we drive precision. And through our collaborative process we build memorable experiences for our customers!\n\nApple products have the potential to change the way people live, learn and work.\n\nA unique opportunity exists for an outstanding candidate to join us as an Area Sales Manager (ASM).\n\nThe Area Sales Manager (ASM) actively promotes the sales of Apple solutions across multiple locations in Mono stores, Apple section of Consumer Electronic (CE) and Carrier store locations. Through their strong sales, service and product knowledge, the ASM actively represents the culture of excellence and collaboration of the wider ASM community. The ASM excels in working with virtual teams in all their store locations to develop them as Apple Advocates and deliver all the key metrics for success at their store.\n\nAn engaging and collaborative work style, exceptional communication both verbal and written, highly self-motivated with a strong drive for results, as well as, extraordinary interpersonal and negotiation skills will be critical to succeed in this role.", "description": "The ASM will have responsibilities in 3 areas, namely Business Management, Merchandising and Brand representation and Training/Coaching. \n\nBUSINESS MANAGEMENT\n- Manage a geographical sales territory. Build strong working relationships & teamwork with various team members within partner’s channel across multiple locations and levels, including Store staff, Area Managers, Regional Managers, and Dealer Principals.\n- Be actively involved in all store level activities to ensure the highest possible revenue targets, service and attach rates are being fulfilled. Aggressively beat these goals, ensuring individual and store results exceed other locations. \n- Ensure store staff are well briefed and trained on new Apple products. Maintain strong communication flow with all POS and ensure all demand generation activities are driven with excellence. \n- Arrange and conduct Quarterly Reviews with Store/Area/Regional management to discuss store performance and get agreement on business plans to drive growth in future quarters. \n- Drive overall revenue growth in assigned sales territory by gathering meaningful market insights and offer actionable suggestions that will translate into new sales opportunities. \n\nMERCHANDISER AND BRAND AMBASSADOR\n- Ensure that Apple product merchandising is always up to standard and updated as required to meet brand, product and segment specific information and promotions.\n- Ensuring the store is merchandised and Apple products are displayed in accordance to the Apple merchandising guideline specific to the Apple branded fixture located in store. \n- Always represent the Apple brand to the highest level. \n\nTRAINING/COACHING\n- Schedule regular Apple product training sessions for virtual teams at all covered POS.\n- Maintain an excellent sales, product and service knowledge at all times in order to deliver the best customer solution; use this knowledge to cross-train virtual team members.\n- Aim to be a specialist and leader in an area of specialisation and become a peer leader for the region.\n- Assist with in-store training presentations to educate customers on the latest in innovation and total solutions; deliver in-store seminars on Apple specific products and solutions.\n- Mentor, train and develop staff members within the assigned location to advocate the features and benefits of Apple’s products and services. \n- Develop skill-sets and behaviours which will allow them to bring these to life in a sales interaction with customers daily. \n\nThe ASM will be expected to demonstrate the following Apple values.\n- Actively practice teamwork, working within the Sales organisation and throughout other parts of the company to achieve results.\n- Take initiative and challenge the status quo.\n- Deliver more than the customer expects.\n- Be diligent and reliable – follow-up quickly and consistently\n- Demonstrate a positive and approachable demeanour.\n- Ability to deal with ambiguity.\n- Drive for results.", "key_qualifications": "Possess 5+ years’ experience in retail sales.\n\nDemonstrated creative problem solving with an agile mind resulting in successful execution of plans that get results.\n\nKeen analytical ability to convert data into business intelligence while staying passionate about the overall objective.\n\nExperience in proactively and directly approaching tentative customers and enthusing them about innovative products and lifestyle solutions.\n\nFocus on customer experience and a drive for excellence - strong attention to detail in all you do.\n\nProven track record in the delivery of aggressive growth targets against closely measured goals.\n\nAbility to complete day-to-day activities autonomously, prioritizing to drive what matters.\n\nThe highest level of integrity, honesty, and accountability in all that you do, every single day.\n\nMust be able to travel daily to support partners within assigned territory.", "preferred_qualifications": "", "education_experience": "We anticipate you will have a Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200494308"}