{"title": "eSIM Software Engineering Manager", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Hard-working people and innovative technologies are the norm here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team redefining wireless technology? Join us to help deliver the next groundbreaking Apple product. The eSIM team is looking for highly motivated and technical lead to work on our next generation products. The duties of this position will direct a team to design and develop exciting features into products, working closely with multi-functional teams.", "description": "The Wireless Technology and Ecosystems group is looking for an extraordinary, hands-on Engineering Manager to join our eSIM engineering team. As part of this team, you will lead a team to architect, design, and develop new features for Apple products. You will work with multi-functional teams driving end-to-end deliveries. Your contributions will make a clear difference towards future iOS products.\n\nWould you like the stimulation and challenges of building a world-class, extraordinary product? Then this is the opportunity for you at Apple! We are looking for a self-starting, daring individual who is not afraid to question assumptions or charge head-first into gray areas. Excellent written and interpersonal skills are a must to collaborate in our environments. You should have in-depth experience developing embedded system, baseband, SIM, eSIM, and secure element knowledge a plus. We partner with a variety of multi-functional team members from a diverse array of other exciting groups across the company as well as external partners.\n\nBe ready to make something extraordinary when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have invented and defined entire industries with our products.", "key_qualifications": "Proven ability, with minimum of two years in a lead or management role. In-depth understanding of baseband architecture. Strong design and analysis skills. Experience developing software in C/C++ in a large code base. Development experience of cellular features, SIM, eSIM, or secure element. Strong sense of responsibility, willing to take ownership and set direction. Excellent communication and social skills. Thrive in a collaborative environment and can clearly communicate with multi-functional teams, driving end goals. Hard-working and inquisitive, and seek to tackle everyday problems in innovative ways", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master’s degree in Computer Engineering, Computer Science or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200491871"}