{"title": "Program Manager - Support Insights", "summary": "We’re a diverse collective of thinkers and doers, continuously reimagining our products and practices to help people do what they love in new ways. That innovation is inspired by a shared commitment to great work — and to each other. Because learning from the people here means we’re learning from the best. Retail Operations creates the tools and programs that empower our teams to provide, a one of a kind, only at Apple experience. We do this by obsessing over the employee and customer experience, and driving a global strategy that sets the bar for Apple and our channel partners. The Retail Operations team guides, motivates, and inspires Retail team members to do their lives’ best work, delivering unparalleled experiences to all who buy and receive products from Apple. We collaborate with partners across Apple to develop Retail Programs, enabling customers to receive their product and services with speed, clarity, and convenience. We are looking for a Support Insights PM to join a passionate team that works tirelessly to elevate the experience at the Genius Bar for our teams, our customers, and Apple. This person will be responsible for working collaboratively and directly with Apple Retail stores to drive execution of repair strategies, limit operational expense and maximise service revenue. This PM will act as a leader responsible for driving Retail Genius Bar performance in a dedicated group of stores and metrics.", "description": "Keys to success include exceptional analytical, collaborative, problem solving, and presentation skills, as well as a natural desire to influence others drive results and deliver hands-on execution. • Proactive partnership with store teams and other internal teams to create targeted strategies relating to reducing operational expense, maximising service revenue, tracking improvement and cost savings over time, and reporting results weekly to leadership. • Continually balance targeted financial objectives with team and customer satisfaction. • Build and maintain key partnerships including Market Leaders, Store Leaders, and store teams. • Turn feedback captured into actions that influence service strategies and get results. • Analyse current service processes and procedures to continually seek new efficiencies. • Work collaboratively with AppleCare and Retail Leadership to drive adoption and compliance with service strategies. • Work with Reporting teams to ensure data is available, accurate and fit for the purpose of identifying trends in key operational metrics that yield actions to improve the business. • Deliver feedback to Field (Field Operations Leaders, Market Leaders, Store Leaders, Managers, Lead Genius') on performance trends and outliers. • Partner with the Field to plan next steps and actions to improve key focus areas. • Engage Training teams to influence training materials to improve strategies • Provide comprehensive updates to Retail/AppleCare Leadership on trends, actions and outcomes. • Conduct store visits to gather insights and drive actions; position requires up to 30% travel", "key_qualifications": "5+ years of customer-facing technical-support experience and 3+ years of retail or technical team leadership experience. Genius or Lead Genius experience preferred • Expert user of Apple hardware and all Apple operating systems and Proficient in Excel, Numbers, Pages and Keynote • Excellent verbal and written communication skills, coupled with a proactive approach to problem solving • Ability to develop strong relationships quickly. A trusted partner that others enjoy working with. • A self-starter who possesses exceptional time management skills • Strong data analysis skills with the ability to transition analysis into actions • Innovative individual who is always looking for ways to push the business forward • Proven track record of providing a high level of support to internal and external customers • Ability to balance competing priorities and shift focus to support changing needs of the business", "preferred_qualifications": "", "education_experience": "BA/BS preferred or equivalent experience Fluency in speaking and writing English required. Japanese or Mandarin languages are a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200498099"}