{"title": "Software Engineer - Tools & Frameworks", "summary": "We are a small team at Apple in the Tools & Framework organization building innovative automated test systems. We take up a broad range of challenges on a daily basis like crafting distributed computing infrastructure services & frameworks, reliability test infrastructure and tests. These highly available systems protect software that we ship to our users.", "description": "You will contribute to the technical design and implementation of a system critical to the everyday work of software development. You will collaborate with your team and work cross-functionally to tackle problems and design beautiful solutions. You will drive projects independently, and leverage organizational skills to thrive in a fast paced development team. You will look for the best solutions for customers and drive those ideas forward in every aspect of the product. You will interact with the engineers that are customers of your tool to debug issues and understand their use cases. You will be involved in all facets of the product from feature planning, system design, implementation to documentation. Your work will have a profound impact on Apple’s software by crafting a robust and reliable system that enables software engineers to contribute high quality work.", "key_qualifications": "6+ years industry experience, Proficient in a strongly typed or functional programming language like Python, Java, Kotlin or Scala, Strong leadership, communication, and project management skills, Deep understanding of software design principles and architecture (Django web framework, nice to have), Experience with cloud-based infrastructure, databases, and APIs, Ability to identify and tackle problems quickly and optimally", "preferred_qualifications": "", "education_experience": "B.S. / M.S in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $113,400 and $215,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200473655"}