{"title": "Analog Mixed Signal IP Post Silicon Validation", "summary": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s. At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!", "description": "You will be part of a small team responsible for:\n\n- Bench test, debug, and characterization of embedded on-chip circuitry (PLLs, DLLs, Clocks, Data Converters, DDR Memory, and various I/O Interfaces)\n- Development of benchtop electrical tests exercising on-chip circuitry through a combination of FPGA, JTAG, SPI, and analog interfaces\n- Drafting & Execution of scripts to automate tests, extract results, and generate reports using database and analytical tools\n- Generating reports for characterization and/or debugging to provide design feedback\n- In-system PI/SI measurements for correlation with simulation models\n- Collaborating with cross functional teams including Design, System HW, and SW\n- Supporting ATE and Product Engineering", "key_qualifications": "Experience working with PLL, PCIe, USB3/4, Display Port, SerDes specifications\nKnowledge of SerDes design and architecture, including CDR and equalization\nKnowledge of Tx/Rx equalization techniques and adaptation\nExperience working with lab equipment such as BERT, real-time scopes, sampling scopes, VNA, and/or protocol analyzers\nExperience with lab automation software such as Python, and Matlab\nKnowledge of DFT to aid in system validation.\nExperience with SerDes Debug.\nKnowledge of Board design and debugging", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree required plus 3 years of industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200499265"}