{"title": "Product Design Engineer - Mac (Mechanical)", "summary": "At Apple, we believe our products begin with our people! By hiring a team with varied strengths, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? We are looking for a Product Design Engineer to join the Mac team. As a Macintosh Product Design Engineer, you will be responsible for designing the next generation of Apple computers, both portable and desktop. You will work in a dynamic and fast-paced engineering environment. Opportunity to work in partnership with industrial designers, product marketing, module design, and electrical and hardware engineering teams. We have a firm dedication to fairness and diversity, recognizing that each employee contributes a wealth of perspectives to our culture. We seek to tap into this extraordinary resource and incorporate it into how we do business. Come join us and be empowered to generate the best and most impactful work of your life!", "description": "In this highly visible role, you will utilize your mechanical design engineering skills to bring products to the market. Your responsibilities include product component and module integration; enclosure design; prototype creation and demonstration; manufacturing process and fixture design; product analysis and testing; as well as concept generation, discussion, and down-selecting. Experience in designing mechanical components for high volume manufacturing is preferred, specifically; injection molded, sheet metal, die-cast, die-cut, stamped, and machined parts.", "key_qualifications": "High aptitude for design intelligence: creative problem solving, diligent in seeking the best solution, excellent spatial reasoning skills, attention to detail. Strong fundamentals of engineering: strength of materials, material science, statics, dynamics, heat transfer. Broad knowledge of materials and processes: basic metal forming/machining, sheet metal design; basic polymer injection/compression molding and 3D printing, general design rules for metals and polymers, and basics of material finishing. Flexible design skills: tolerance analysis, design for assembly/manufacturability, cross-functional electro-mechanical integration, design considerations for high volume manufacturing, simple fixture design, developing initial product layouts, understanding of Statistical Process Controls (SPC), functional understanding of various metrology methods, planar mechanism design, and mechanical prototyping. Working level design validation abilities: identify critical requirements and test methods to evaluate designs, strong failure analysis (FA) skills, Failure Modes and Effects Analysis (FMEA), large data set and computer-aided data analysis, Design of Experiments (DOE), Finite Element Analysis (FEA). Functional at Computer Aided Design (CAD): 3D CAD experience required - NX preferred, 2D drafting with GD&T preferred, data exchange with printed circuit boards (PCB) and flexible printed circuits (FPC), eCAD, electrical mechanical control outline (MCO) generation and ownership. Experience with component and system assembly build support in Asia (China). Excellent communication skills: both written and verbal communication, clear communication of design ideas, data presentation, distill and summarize technical problems, lead and contribute to brainstorm", "preferred_qualifications": "", "education_experience": "Bachelor Degree or above in mechanical engineering or equivalent", "additional_requirements": "- 50% travelling is expected. Might need to travel to China for trainings during the first year.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200473117"}