{"title": "SW Developer in Test For Operating Systems Group", "summary": "As a Core-Darwin Software Quality Integrity Engineer working on Continuous Integration, you will be deeply involved with our development engineers and your peers in QA to design, build, implement, and maintain manual and automated test suites. You will also be responsible for reporting on testing progress and the overall health of your assigned areas throughout the development cycle. You will build problem reports and then track their resolution through completion. You will partner with automation SW engineers for the first-level pre-submission triaging and analysis of issues. You will also help create tailored tools to facilitate testing for yourself and others. A successful candidate must be hardworking and have strong multitasking skills.", "description": "Implement pre-submission, post-submission, and deep dive testing. Drive issues seen during testing and work with multi-functional teams and the development team to resolve issues. Develop scripts to run offline and on-device evaluations. Design and develop automation frameworks and tools to reduce manual testing efforts. Generate test reports for an executive update as well as for multi-functional teams. Analyze large-scale data and generate KPI metrics. Define test strategies and write test cases.", "key_qualifications": "Developing test suites for both at-desk testing and our Continuous Integration infrastructure, Design and lead a pre-submission validation process, Triaging failures and following up with the responsible team(s) for fixes, Experience with continuous integration frameworks (such as Jenkins) and a git-based development flow, Experience system & kernel-level test development, Programming skills, Leading a fleet of lab test machines and associated CI automation, Hands-on approach and willingness to solve new challenges, Excellent communication and interpersonal skills", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or equivalent knowledge and experience", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200477730"}