{"title": "Security Reviewer, Secure Design", "summary": "Embedded within Apple’s Security Engineering & Architecture organization, the Secure Design team’s mission is to ensure that the software we ship to our customers is secure. We believe that when it comes to building the world's most secure operating systems, collaboration is key. We're looking for a talented and inspired individual to join our group of security engineers to attack Apple's products before they ship, with the goal of better safeguarding our users...", "description": "You will be a technical specialist responsible for securing new products that Apple ships to its customers, with a focus on software security. Work cooperatively with other parts of Apple on a broad range of technologies and initiatives to enhance security. Design new and innovative ways of increasing security and privacy while preserving ease-of-use and increasing the quality of the user experience. Work with engineers to analyze systems, threat model new features, identify security vulnerabilities in implementation, and recommend security controls to ensure customer protection. Evangelize and drive the adoption of these technologies across the organization. Lead ground breaking...", "key_qualifications": "Passionate about keeping Apple’s customers safe, Proficient in security architecture design and review, Familiarity with creating threat models for complex software products, Experience with code reviews and software security testing, Motivated by pursuing difficult and novel problems...", "preferred_qualifications": "", "education_experience": "Bachelors or Masters/PhD in Computer Science or Engineering with an emphasis in Computer Security or a related field, or equivalent experience.", "additional_requirements": "Preferred Experience: Background in secure coding and code auditing, Experience working with engineering teams to build secure software, Understands security engineering, software delivery, and SDLC, Proficiency in OS internals and modern mitigation techniques, Programming background, in C, C++, Objective-C, and/or Swift, An understanding of past, current, and emerging security exploit trends, Apple is an Equal Opportunity Employer...", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200481745"}