{"title": "PHY Systems Engineer", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team redefining hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements.", "description": "-  Design and simulate state of art physical layer wireless communication algorithms.\n-  Implement system models and perform detailed performance investigations to allow performance sign-off and enable RTL development.\n-  Collaborate with digital designers and firmware developers to realize algorithms with power and area efficient implementation.", "key_qualifications": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.\nDeep-knowledge of communication system theory and signal processing will be important for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.\nExperience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.\nExperience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.\nExperience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc.\nKnowledge of cellular communication standards: 5GNR, 4G LTE.\nStrong analytical skills (linear algebra, random processes, detection and estimation, etc.)", "preferred_qualifications": "", "education_experience": "BS and 10 + years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200452242"}