{"title": "CPU Silicon Timing Correlation Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort interfacing with many disciplines, with a critical impact on getting functional products to millions of customers quickly. You will be a member of a silicon timing characterization team. In this highly cross disciplinary role you will execute tasks that contribute to debugging physical issues in silicon and correlating silicon timing behavior with pre-silicon models.", "description": "-  Create and refine methodologies for isolating and debugging timing failures in system and on tester\n\n-  Develop, modify and deploy tests on silicon as part of characterization plan\n\n-  Analyze silicon parametric data and correlate with empirical observations\n\n-  Maintain and improve infrastructure for gathering silicon parametric data at scale\n\n-  Work with partner teams e.g. DFT, physical implementation, logic design to debug issues and improve methodology\n\n-  Enhance existing silicon debug features and conceive of new ones.", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience\nGood all round hardware and data analysis skills\nGood understanding of VLSI design practice and static timing analysis\nData analysis skills and experience using Python/JMP\nUnderstanding of SoC/CPU architecture is desirable\nGrasp of structural test (ATPG, MBIST) methods is highly desirable\nProven ability to lead a broad team towards successful closure on timing debug issues\nTrack record of innovation in the area of silicon timing correlation\nLab experience (system, board or tester platform) required\nExcellent teamwork and communication. Ability to work with multiple teams in delivering a solution.", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450057"}