{"title": "Cellular Virtual Platform developer", "summary": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for an expert virtual prototype engineer who can help us in deploying virtual prototype solutions for next generation cellular and connectivity products. Candidate must have an excellent record of efficiently developing IP models for complex SOCs.", "description": "As a member of the simulation team you will be involved in the Virtual Prototype development for SoC for the purpose of cellular software development. You will closely work with system engineering, SOC and SW teams. Job also includes integration of cycle accurate CPU subsystems for profiling activities. You will be involved in the IP modeling, developing test bench, Subsystem integration and developing low level driver for VP platform verification. You also closely involve in the SW bring up on the simulation platform and provide support to the SW team. Candidate should possess strong interpersonal skills and ability to work in dynamic work environment.", "key_qualifications": "At least 3 to 8 years of experience in Virtual Prototypes, i’e IP modeling using SystemC or other languages, Platform integration and verification. BS or M.S. in Electronics Engineering or equivalent degree with minimum experience of 3 years in virtual platform development. Strong programming skills in C/C++. Proficiency with Python. Good understanding of CPU /subsystems, SOC architecture and knowledge of hardware-software interface. Strong debugging, analytical and problem-solving skills. Strong collaboration skills with the ability to collaborate with multiple functional teams. Added advantage. Understanding of 3GPP standards and wireless communication.", "preferred_qualifications": "", "education_experience": "BS or M.S. in Electronics Engineering or equivalent degree with minimum experience of 3 years in virtual platform development.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200464326"}