{"title": "Processor Power Management Verification Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. In this highly visible role, you will be at the center of a chip design effort collaborating with many teams, with a critical impact on getting functional products to millions of customers quickly. We are looking for a strong candidate to join our processor verification team focusing on Power Management and Clock Control verification.", "description": "As a Processor Power Management Verification Engineer, you will have the responsibilities as follows:\n-  Work closely with architecture and RTL designers on verifying the functionality correctness of the Power Management and Clock Control logic\n-  Develop and execute test plans and schedules for the power management and clock control logic.\n-  Develop tests in Assembly, Scripts, System Verilog, or vectors according to test plans to drive testing in simulation and emulation environments\n-  Root cause failures and propose potential solution to the design team.\n-  Work with silicon bringup team on developing tests that work in the emulation and FPGA environments. Aid silicon debug in related part of the design.\n-  Develop coverage monitors and analyze coverage to ensure all the test cases in the test plans are covered\n-  Develop checkers or Verilog/System Verilog-base transactor to verify the design\n-  Write assertions and apply formal verification to the design", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience.\nExtensive experience in processor verification\nIn-depth knowledge of digital logic, micro-processor and power management architecture and microarchitecture\nExpertise in developing testplans, testbenches, Verilog/System-Verilog based transactors and checkers and writing/debugging assembly based tests\nExperience in assertions, silicon bringup, UPF and low power simulation is a desired.\nExperience with advanced verification techniques such as formal verification is a plus.\nShould be an extraordinary teammate with excellent communication skill with the ability to articulate complex design issues during verification effort.\nBe able to create and follow detail work schedule and work independently on the verification efforts for a block/area of the design.", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200484473"}