{"title": "RTL Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking RTL Design Engineer. As a member of our multifaceted group you will have the rare and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Specify, design, and give in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side).", "description": "In this job you will be responsible for specifying and/or micro-architecting digital blocks in sophisticated mixed-signal circuits. You will be also responsible for RTL coding of blocks specified by you or others. You will participate in the design verification and bring-up of such blocks by writing significant assertions, debugging code, and otherwise interacting with the design verification team. You get to participate in the lab bring-up of those circuits by potentially writing test scripts, analyzing lab data, proposing experiments, etc.", "key_qualifications": "Deep knowledge of mixed signal concepts, Deep knowledge of RTL design fundamentals, Deep knowledge of Verilog and System-Verilog, Deep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers), Solid understanding of synthesis, static timing, DFT is a huge plus, Deep knowledge of System-Verilog assertions, checkers, and other design verification techniques, Confirmed experience in scripting languages. Perl and Python, Good understanding of Algorithm developments, Strong communication and presentation skills, SERDES knowledge is a plus", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451407"}