{"title": "Graphics Design Verification Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC).", "description": "- Develop verification plans in coordination with design leads and architects\n- Create and maintain verification test bench components and environments\n- Develop comprehensive constrained random test suites\n- Run simulations and debug design and environment issues\n- Create functional coverage points, analyze coverage, and enhance test environment to target coverage holes\n- Create automated verification flows for block verification\n- Apply knowledge of hardware description languages (VHDL/Verilog), and logic simulators to verify complex designs\n- Influence other block and core level engineers to innovate seamless verification flows", "key_qualifications": "The ideal candidate will have minimum 10 years of relevant experience including:\n- Experience developing test plans and testbenches for advanced hardware designs\n- Experience driving verification effort from specification to tapeout\n- Experience with SystemVerilog or expertise in object-oriented languages such as C++\n- Expertise in common verification methodologies such as UVM or OVM\n- Experience with HDL simulators and waveform viewers\n- Experience with Python, Ruby or Perl; developing tools for workflow automation\n- Experience working under strict schedule deadlines with the ability to manage multiple priorities\n- Excellent communication skills and ability to collaborate", "preferred_qualifications": "", "education_experience": "BS + minimum of 10 years of experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449453"}