{"title": "Firmware Engineer - Imaging & Sensing Technology Group", "summary": "We are looking for an extraordinary FW engineer to drive state-of-the-art technologies for Apple products to join one of our sites (Herzliya, Haifa, or Jerusalem). As part of the team you would work on core hardware components, including the Apple Image signal processing pipeline, where you will have the chance to define the way that Apple develops, tests and manufactures all of its products. Our close-knit team fosters an environment of product innovation, rapid product iteration and collaboration at both team and multi-functional levels with a liberating amount of autonomy. In this role you will be working with SW, Algorithm, System and HW teams to develop solutions in the depth sensing field, design and implement real time embedded SW for depth sensors and cameras, including HW bringup and System integration, design and implement SW solutions to calibration and factory needs - SW design and architecture for prototypes.", "description": "Apple designs consumer electronics that have touched millions and changed Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. Do you love working on challenges that no one has solved yet? Our group developes depth sensing systems such as the revolutionary True Depth camera that powers Face ID. This multi-disciplinary group of engineers is responsible for architecture, design, and development of these highly complex sensing systems for all Apple products.", "key_qualifications": "At least 6 years of experience in Embedded development in large-scale projects, Experience with complex HW and System integration, Broad system and architectural understanding, Hard-working, independent, fast learner and problem-solving mindset, Advantages: Experience delivering customer-facing features or projects from concept through delivery", "preferred_qualifications": "", "education_experience": "B.Sc. in Computer Science or Electrical Engineering.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200440557"}