{"title": "SoC Physical Design Engineer, STA/Timing", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product.", "description": "•  Work with design teams to understand and debug constraints, facilitate logic changes to improve timing. •  Work with Physical Design team highlighting issues and best practices. •  Help create timing ECO’s for project tapeout. •  Create and maintain scripts and methodologies for analysis and runs. •  Create documentation and help with guidelines/specs. •  Deep analysis of timing paths to identify key issues. •  Implement timing infrastructure.", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience. Familiar with all aspects of timing of large high-performance SoC designs in sub-micron technologies. Expert in STA and methodologies for timing closure, and have a deep understanding of noise, crosstalk, and OCV effects among others. Familiar with circuit modeling including SPICE models and worst-case corner selection. Strong programming skills with Perl and TCL. Experience with large design STA and Timing Closure. Expert in ECO techniques and implementation. Good communicator who can accurately describe issues, propose solutions, and drive them through completion.", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200474446"}