{"title": "Camera Experience Application Engineer", "summary": "iPhone is the most popular camera in the world. The seamless integration of software and hardware has led to features like Cinematic Mode which deliver experiences that are magical! The Camera Experience team focuses on user-experience by demonstrating computer vision and image processing through machine learning. We work hard on products that ship to millions of people and are looking for people who want to do the same. Are you looking to contribute to a product that is redefining digital photography? We are growing, and want to speak to gifted engineers who are passionate about, building applications and crafting the future of the world's most popular camera.", "description": "The Camera Experience team is looking for a skilled and hardworking iOS software engineer to develop innovative camera apps and features. If you flourish with how to tackle big problems, focus getting every little detail right, have a deep real passion for photography and then this job is for you.", "key_qualifications": "You love building and implementing outstanding user interfaces and customer experience\nYou possess a deep understanding of object oriented design, memory management, and performance optimization\nYou have hands-on experience shipping high quality iOS applications\nYou excel at solving and debugging hard problems\nYou are an effective communicator and love working closely with others\nYou thrive working in a dynamic environment and learning new technologies", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200463905"}