{"title": "Mac Display System Architect", "summary": "Mac System Architecture team seeks an outstanding Display systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals.", "description": "Provide architectural guidance and leadership to cross-functional engineering teams to establish new product definitions and requirements. Provide system architecture guidance. Negotiate top-level product goals among a broad group of architects and system engineers, technical leads, HW & SW engineering managers, and external vendors. Determine product system integration feasibility, via collaboration with mechanical, physical, thermal, and electrical engineering stakeholders. Author system architecture specifications, block diagrams, and conduct review with the product teams. Collaborate with performance architects to define, model and drive improvements in performance, power efficiency and cost. Analyze, guide and support thermal management solutions and trade-offs. Anticipate future SoC requirements and negotiate with internal SoC teams to align with system product goals. Be innovative and curious. Explore and champion new product-level features and workflows. Review, challenge and influence people and processes. Lead system architecture and guide early design team activities. Define, develop and utilize tools, scripts, automation and methods of system analysis. Mentor junior engineers to best practices and data-driven processes. The role may require occasional domestic and international travel.", "key_qualifications": "Has core competence and subject matter expertise in personal computing system and product design. Possesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensors. Able to create, review and approve engineering requirement specification documents. Understands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environments. Comprehends the roles of HW/FW/SW layers and how they interact in system design. Has strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teams. Familiarity with display technologies in general is important, alongside the ability to discuss them with experts — enables ability to participate in roadmap discussions. Various panel technologies (LCD, OLED) and their relative pros and cons, backlight technologies (edge-lit global backlights, local dimming). Experience with collaboratively creating & reviewing display power budgets for battery life, thermal & power delivery applications. Considering various use cases (display contents, refresh rates, display brightness, etc). Support creation of thermal power dissipation maps for thermal team simulation. Knowledge of display timings, pixel rates, bandwidth calculations, etc… Active pixels, H & V blanking, pixel clocks, line times, etc. DisplayPort timings & technologies (link rates, lane counts, DSC, AdaptiveSync) and ability to estimate DP requirements for certain display specs. Ability to participate in silicon requirements definition and review for critical display system components: TCONs, CDICs, pixel pipelines, DP interfaces, etc… Having system integration experience with display related topics a huge benefit: Signal integrity considerations (channel analysis with SI experts, DisplayPort link speeds vs voltage swing, CDI interface considerations). RF Coex / desense considerations. Ability to support PCB & flex design explorations (connector pin count definition, early component placement studies, basic cable/flex interconnect studies).", "preferred_qualifications": "", "education_experience": "BS/MS in Electrical Engineering or equivalent with 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200475386"}