{"title": "Graphics Performance and Modeling Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Hardware Technologies organization, you’ll help design our next-generation, high-performance, power-efficient graphics processor unit (GPU) and system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.", "description": "As a Graphics Performance and Modeling Engineer, you will:\n-  Create bit-accurate model for validation of GPU functionalities\n-  Develop performance model for micro-architecture trade-offs\n-  Use performance model to analyze GPU performance, present results and recommendations\n-  Drive the planning, implementation and validation of complex modeling tasks\n-  Provide feedbacks to GPU architecture and micro-architecture design in the aspect of both functionality and performance\n-  Improve the performance modeling infrastructure", "key_qualifications": "We prefer to you have the following knowledge and skills.\n- Strong C++ coding skills\n- Knowledge of computer architecture\n- Experience in functionality modeling and/or performance modeling (event driven or cycle driven)\n- Understanding of GPU micro-architecture is a big plus\n- Understanding of Computer Graphics principles and modern Graphics APIs (e.g. DirectX, OpenGL, Vulkan, Metal) is a plus\n- Experience in GPU Software development is a plus\n- We prefer that you exhibit excellent communication skills, demonstrate a sense of motivation and show a high level of organization\n- We like people who are fast learners and are eager to solve technical challenges\n- We expect you to show leadership skills to be successful to own and drive complex tasks in a cross-functional environment", "preferred_qualifications": "", "education_experience": "BS + minimum of 10 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449057"}