{"title": "Graphics Hardware Verification Engineer", "summary": "Are you naturally curious about the gritty details of how everything works? Do you have an interest in finding flaws in algorithms and designs? Have you wondered about what it takes to verify sophisticated systems consisting of tens of billions of transistors? Do you love working with both hardware and software? If so, then we’d love to have you join our world-class team of GPU verification engineers at Apple. You’ll learn and work with innovative tools and methodologies to verify our high-performance and low-power graphics processors. You'll be responsible for block and sub-system level pre-silicon RTL verification. You will also support the top and post-silicon validation teams in ensuring the successful integration of our IPs into the full system. Together, you and your team will contribute to providing unparalleled products to hundreds of millions of loving customers worldwide.", "description": "As a Graphics Core Hardware Verification Engineer, you will be tasked with the following:  - Use hardware description languages (VHDL/Verilog), hardware verification languages (SystemVerilog), and logic simulators to verify sophisticated GPU RTL designs - Collaborate with architecture, design and modeling teams to converge on design specification - Develop and drive verification plans and schedules - Architect test benches using sophisticated OOP, UVM and vertical reuse techniques - Generate constrained random and directed tests to implement verification plan - Run simulations and debug issues across hardware and software - Deploy Formal Verification techniques to complement simulation flows - Build functional coverage, analyze coverage, and improve test environment to target coverage holes - Build automated verification flows such as ML-assisted coverage closure for graphics core verification", "key_qualifications": "Strong background in computer architecture and memory systems.\nCourse work or projects in digital design and verification.\nStrong fundamentals in object-oriented-programming.\nScripting experience using Python, Perl, Ruby, or Shell.\nFamiliarity with DV concepts such as constrained-random, coverage, stimulus, and checkers.\nAble to share ideas and collaborate under aggressive schedules.", "preferred_qualifications": "", "education_experience": "Minimum requirement of BS degree.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448181"}