{"title": "Wireless RF Compliance Validation Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Compliance Engineering team is looking for engineers to do wireless regulatory characterization and demonstrate regulatory compliance for different Apple products.", "description": "-  Validating emission test cases for different regulatory domains in certification test setups.\n-  Translating WW emission requirements into test cases. Coordinating with regulatory compliance teams to ensure product validation covers all certification tests.\n-  Define and implement validation plan for regulatory facing SW features\n-  Experience debugging marginal/failure tests and engaging with multi-functional teams like RFHW/Antenna/ Product Design/EE/etc. and drive design changes to address issues\n-  Maintain test setups via periodic checks, calibration, etc.\n-  Help Regulatory Compliance teams in planning and delivering final certification testing at 3rd party test labs.", "key_qualifications": "You have experience and in-depth understanding of System Transceiver RF Parametric and RF component level characteristics and behaviors.\nYou have working experience with lab equipment including network analyzers, signal generators, signal analyzers and call boxes (i.e., CMW/8960/UXM).\nDetailed understanding of at least one Wireless technology including 5G FR1, FR2, GSM, UMTS, CDMA, LTE, 802.11a/b/g/n/ac/ax and Bluetooth is a plus.\nUnderstanding of Antenna characteristics impact to radiated testing is preferred. Familiarity with radiated test setups, radiated chamber calibration and use are also a plus.\nProficiency in MATLAB simulations, or STK, CST, HFSS simulation is a bonus.\nKnowledge on worldwide Regulatory standards in relation to carry a product to certification is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor's Degree with 3 or more years of relevant work experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200452553"}