{"title": "SOC Thermal Engineer", "summary": "Do you love working on challenges that no one has yet solved? Do you like changing the game? Envision what you could do here. At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We are looking for a self-motivated and ambitious individual who will work closely with multi-functional teams to optimize mobile device’s thermal performance and participate in advanced IC packaging research and development.", "description": "This position is responsible for: Architecting thermal solutions to address chip energy efficiency and performance scaling Providing thermal modeling solutions to mobile devices at silicon die and semiconductor package levels, Optimizing advanced IC design scheme/floor-planning to ensure good thermal performance Developing detailed and reduced-order thermal models Analyzing simulation and measurement results to enhance product thermal management", "key_qualifications": "Extensive experience in thermal analysis and modeling of System on Chip (SoC), IC packages and mobile devices. Deep fundamental understandings on thermal conduction, convection and radiation. Experience in modeling transient thermal response and reduced-order modeling. Knowledge of semiconductor, package, PCB or mobile device design and thermal testing. Experience working with IC physical design parameters affecting electrical and thermal performance of packaging technologies. Knowledge of SoC design methodology, low-power techniques and thermal analysis methods. Knowledge of advanced packaging assembly processes along with electrical and thermal characteristics of packages. Ability to drive and lead cross-functional teams to execute on “design for thermal”. Tool Familiarity: Ansys Ice Pak, Sentinel-TI, Fluent, Cadence Allegro, Redhawk etc. BS and 10+ years of relevant industry experience", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448787"}