{"title": "Design Verification Manager", "summary": "Do your life’s best work here - with the whole world watching. At Apple, new ideas and complex challenges have a way of becoming phenomenal products, services, and customer experiences very quickly. The Design Verification Engineering Manager will be responsible for the pre-silicon RTL verification of blocks in high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers. Together, you and your team will enable our customers to do all the things they love with their devices! A strong computer architecture background, preferably in graphics, and a strong foundation in verification methodology will be used to close testing coverage with high confidence.", "description": "As a Graphics Design Verification Manager at Apple, you will provide strong leadership to expert engineers to ensure the exceptional quality of graphics IP designs. You will be required to collaborate effectively with multi-functional teams to tackle new challenges, through the use of robust written and verbal abilities. You will use SystemVerilog, UVM, C++ and scripting languages with industry-leading simulation tools and methodologies to verify complex GPU designs. You will use your experience to negotiate program objectives with Architecture, Design and Software teams, and lead your team through planning, execution and closure. Bringing your management skills to the team, you will support individual development and goal definition, whilst aligning team vision for outstanding results.", "key_qualifications": "Experience managing an engineering team\nAbility to influence organisational objectives and align teams\nPrior DV ownership of complex IP at Unit, Sub-system, or Top-level\nExpert knowledge of verification languages and methodologies\nStrong knowledge of computer architecture, general purpose microprocessor or memory sub-system micro-architecture in lieu of graphics experience\nExcellent planning and communication skills, with strong ability to collaborate across sites and disciplines", "preferred_qualifications": "", "education_experience": "BS/MS/PhD in Computer Engineering, Electronic Engineering or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200480182"}