{"title": "Firmware Engineer", "summary": "As a firmware engineer in the Wireless Connectivity Silicon team, we will be responsible for the design, development, and bringup of innovative wireless silicon for application in Apple’s products!", "description": "PHY firmware architecture and design, including calibrations, realtime processing flows, collaborate with RF hardware, microcode, and MAC layer. Develop highly efficient designs delivering outstanding performance, minimizing power and memory footprints while meeting hard-realtime latency requirements. Debug realtime systems with limited visibility, working hands-on with development boards and lab equipment. Collaborate with Radio, MAC, and Systems engineering teams to architect, define and implement innovative algorithms, calibrations, and protocols. Support pre-silicon validation efforts, including simulation, emulation, and FPGA prototyping. Develop SoC test and calibration capabilities for chip, module, and product factories. Support post-silicon bringup, validation, performance characterization, system integration, and debug.", "key_qualifications": "We are looking for an extensive technical background in one or more of the following:\n- Strong embedded SW fundamentals, including knowledge of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memory.\n- Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.\n- Experience with configuration and release management, continuous integration, and regression testing.\n- Strong understanding of design strategies for maintainability, scalability, and code reuse.\n- Excellent communication skills – both written and oral.", "preferred_qualifications": "", "education_experience": "BSEE\nMinimum of 10 years of industry experience", "additional_requirements": "Preferred Qualifications:\n- Deep understanding of wireless systems, PHY layer operations, digital signal processing, Tx/Rx performance metrics.\n- Experience in Wireless SoC firmware development\n- Experience with WiFi, Bluetooth, or similar wireless technologies.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200446350"}