{"title": "CPU Cache Verification Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly.", "description": "As a CPU Cache Verification Engineer owning the verification of a certain level of cache, you will have the responsibilities as follows: • Work closely with architecture and RTL designers on verifying the functionality correctness of the cache design • Develop test plans and unit test environments. Develop tests in assembly, C, or vectors according to test plans • Develop coverage monitors and analyze coverage to ensure all the test cases in the plans are covered • Develop checkers or C-base transactor to verify the design. Write assertions and apply formal verification to the design", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience. The ideal candidate should have industry experience with CPU verification. In-depth knowledge of digital logic design, processor and cache architecture and microarchitecture. Knowledge of the multiprocessor coherency and memory ordering. Expertise in developing test plans, test benches, C-based transactors, and writing/debugging assembly based tests. Experience with advanced verification techniques such as formal and assertions. Experience in silicon bringup a plus. Should be a great teammate with excellent interpersonal skills and be able to work independently on the verification efforts for a block/area of the design", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451438"}