{"title": "DRAM Packaging Engineer", "summary": "Envision what you could do here. At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight, and inspire millions of Apple’s customers every single day. Summary: Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for perfection to work towards an extraordinary result? We are looking for a hardworking and passionate DRAM Packaging Engineer to join our team. SEG Packaging is a key part of the HW Technologies team, this team invents, designs, develops and integrates electronic packaging solutions for the Apple’s internal and customized external components of hardware for its consumer electronic products. As a DRAM packaging engineer, you will lead the memory package development by managing the external memory vendors and steering their packaging design compatibility to Apple system components. You will partner with the internal SEG teams, defining the memory package architecture, die pad layout, package form factor, interconnect and package density, and will support the system and product teams and overall program through the development and NPI cycle.", "description": "Define memory package architectures with advanced package processes, to support memory bandwidth and density needs, in conjunction with downstream assembly constraints Define the memory package POR (plan of record): Form factor, technology, process, layout, bill of materials (BOM), design rules, thermo-mechanical, signal integrity, power integrity Publish internal package specs for customized memory Establish trusting and collaborative relationship and communication channels, as a direct interface with vendors for DRAM memory package development and qualification Review, drive and approve the DRAM memory vendors DOEs/characterization plans, technology and product qualification and data for package development About 10% international travel required", "key_qualifications": "5+ years’ experience in memory package architecture and assembly process development for stacked-die packages Strong knowledge of advanced packaging technology, design rules, SIPI, to architect high-density packages. Strong knowledge of packaging materials, substrate technology, and their mechanical and thermal behaviors Solid working experience in package test and reliability, system-level downstream process interaction and packaging inspection metrology Excellent engineering problem solving skills, with strong engineering physics and data driven analysis Strong written and verbal communication skills for working with internal multi-functional teams and OSATs", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450094"}