{"title": "Analog Design Engineer Lead", "summary": "Are you a leader? Do you want to use your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively to deliver on a predictable and dynamic schedule? We have an extraordinary opportunity for senior level silicon design engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies! The Apple Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, Apple Watch and AppleTV! We are looking for a remarkable Analog Design Lead to work together with multi-functional teams and external vendors to define, develop and productize the next generation of custom silicon solutions.", "description": "As a part of the team who delivers high-quality, on-time silicon, you will have responsibilities spanning all aspects of silicon design: \n\n•Working with Platform Architecture and Systems teams to establish silicon requirements. \n•Delivering first revision functional silicon and production worthy silicon per system requirements on schedule.\n•Working with silicon vendors to ensure innovative design practices, methodologies/processes are in place to produce quality results \n•Responsible for next-generation architectures and circuit designs and development of new process technologies.\n•Ensuring designs are properly verified, validated, and tested for long-term reliability. \n•Leading schedules and supporting multi-functional engineering efforts.", "key_qualifications": "BS+10 Years of Relevant Industry Experience,\nExperience leading analog and mixed-signal silicon for complex system designs\nSolid understanding of analog design fundamentals, design tools and methodologies. Demonstrated industry-leading design expertise required.\nExperience taking projects from the concept phase to Mass Production including: chip architecture, micro-architecture, writing electrical specifications, process technology selection, die size estimation, running schedules, IC design, analog layout, parasitic extraction, verification, DFT, DRCs, LVS, LVL, mask and wafer fabrication monitoring, silicon characterization, hands-on lab evaluation, release to production, yield improvement, and failure analysis support.\nSystem applications include PMIC, Audio Codecs, Audio Amplifiers, Wireless, Connectivity, Security and Video.\nIn depth expert design experience of analog building blocks: multi-phase buck and boost converters, LDOs, battery chargers, temperature sensors, voltage monitors, bias, bandgap, amplifiers, audio Class AB and Class D, data converters DACs and ADCs.\nDesign knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.\nDesign knowledge of IC process technologies, reliability design rules, ESD and latch-up testing.\nKnowledge about industrial standards and practices in appropriate technologies.\nWork experience with high volume manufacturing strongly preferred.\nDesign management experience preferred.", "preferred_qualifications": "", "education_experience": "BS+10 Years of Relevant Industry Experience", "additional_requirements": "Some Travel Required.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451088"}