{"title": "CPU Clock Implementation Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! As a CPU Clock Implementation Engineer, you will be driving the planning, design, implementation, and analysis of clock.", "description": "As a Clock Implementation Engineer, you will participate in the following: • Work on clock planning, building simulation models, and physical implementation • Work on clock analysis • Work on power grid methodologies and implementation • Engage on physical design of blocks • Scripting to automate tasks and improve efficiency", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience, Knowledge of industrial standards and practices in physical design, analysis, and physical verification on large processor or SOC designs, Experience in developing and implementing powergrid and clock specifications, Solid knowledge of low power design, physical construction, Spice, EM/IR-Drop/Noise, SIGEM analysis, formal verification, physical verification, and DFM, Strong communication skills, Proven understanding of CMOS circuit design, Layout design background is a plus, Working knowledge of extraction and STA methodology and tools, Working knowledge of computer architecture, Solid understanding of scripting languages such as Perl/Tcl, Ability to work well in a team, problem solver, and self-motivated", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449681"}