{"title": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS.", "description": "•\tDevelop boot and driver code for Apple SOC, including AP clusters, IO Co-Processor system, fabric, power management, memory and other I/O devices\n•\tDesign, implement, and enhance Common Firmware Environment (CFE) and other platform software for Apple silicon validation organization\n•\tDevelop system software to exercise power saving feature (suspend and resume)\n•\tContribute to SDRAM initialization and calibration development\n•\tImplement firmware driver for PMIC and battery charging\n•\tParticipate in the chip bring-up on simulator, emulation, FPGA and silicon\n•\tDevelop applications covering system level use cases and functional features\n•\tParticipate in SOC architecture, design specification and board schematics review", "key_qualifications": "Proficient in C/C++, assembly a plus\nBackground in embedded software development, bare metal, RTOS and/or Linux\nSolid understanding about ARM specification, computer architecture, operating system\nExperience in boot code, CPU & SOC initialization, device drivers\nFamiliar with IO protocols: I2C, SPMI, UART, GPIO.\nExperience in lpDDR4/5, DRAM initialization and calibration a big plus.\nGood troubleshooting skills in silicon bring-up and embedded software debugging\nExperience with script language such as Python, Perl, or Tcl", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200452777"}