{"title": "Graphics Architect", "summary": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture visionary who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system. Join this team and you will collaborate with engineers across Apple to design how all of our technologies work in unison. You will drive development of our renowned system-on-a-chip architecture and develop algorithms for platform power, performance, and thermal management. You will develop forward-looking prototype systems as well as build and deploy software development tools that will be distributed to the Apple engineering community. Join this team, and you’ll help build the seamless technology experiences we’re known for worldwide. The Graphics Architect will be responsible for inventing and investigating new concepts, and working with the design teams to realise these in future products. You will devise new models and research new techniques for solving problems with hardware. You will work to find new ways to deliver solutions to rendering and computational problems on our platform.", "description": "The architect will innovate and come up with new ideas to implement new features, improve performance or decrease area or power. You will Investigate, measure and model these new concepts and create and evolve high-level specifications for designers and micro-architects. You will provide technical leadership to other team members throughout the project.", "key_qualifications": "A strong background in GPU, CPU, DSP or ISP architecture\nDeep understanding of micro architectural specification and implementation\nAbility to invent and implement novel concepts\nStrong programming skills\nAbility to clearly communicate complex issues, self-motivated and well-organised", "preferred_qualifications": "", "education_experience": "BS/MS/BEng/MEng/PhD in related field", "additional_requirements": "Some international travel will be required.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200400370"}