{"title": "CPU Design Timing Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!", "description": "As the CPU Design Timing Engineer, you will be responsible for the timing closure of the project. RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO - Working with the CAD team to develop the timing flow that will be used on the project including scripting to improve analysis flows and engineer efficiency. - Work extensively with CPU micro-architects and Implementation engineers to drive timing closure for the CPU.", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience; Proficiency in static timing tools and methodology including familiarity with handling multiple clock and power domains, cross talk, noise, OCV, etc; Prior experience performing timing analysis in high speed digital designs such as CPUs or other similar designs is a plus; Familiarity with physical design tools and methodology including logic synthesis, PnR, parasitic extraction, logic equivalence; Knowledge about deep sub-micron technologies and scaling trends; Familiarity with CPU microarchitecture including common fundamental timing paths", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451524"}