{"title": "Product Design Engineer - iPhone", "summary": "Apple is a place where extraordinary people gather to do their best work. Passion works here, our community is made up of every kind of individual: artists and designers, engineers and scientists, problem solvers and doers. Together we build things and experiences people once couldn’t have imagined — and now can’t imagine living without. So if you’re excited by the idea of making a real impact, a career with Apple might be your dream job. Just be ready to dream big!", "description": "We are looking for someone who is passionate about engineering and thrives on innovation to help build the next generation of the world’s most innovative mobile devices. This role is for someone with strong mechanical design skills, an ability to lead projects in a multi-functional setting, and excellent communication skills with both vendors within Asia and internal teams at Apple. The role will require the ability to deliver outstanding design solutions while balancing multiple priorities on demanding schedules.   You will be responsible for building prototypes for design validation and driving failure analysis. As designs mature, you will also primarily work on-site at contract manufacturers within India to implement and integrate iPhones to enable product at scale.", "key_qualifications": "- 3+ years demonstrated ability in mechanical design (preferably consumer electronics products)\n- Experience working with contract manufacturers, highly desirable\n- Handheld/portable device experience, a huge plus\n- Passion for making great products and solving tough design problems\n- Demonstrated ability in plastic and metal part design including material selection\n- Experience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing, with focus on high volume manufacturing\n- Experience with technical graphical communication of concepts, ideas, and solutions\n- Experience with component modules (OLED/LCD, batteries, sensing, acoustic, camera modules, etc.)\n- Integration of wireless antenna (Cellular, GPS, WiFi, BT) into mechanical enclosures, a huge plus\n- Integration of electrical subsystems (OLED/LCD, sensing, microphone, speaker, receiver, camera)\n- Design of highly cosmetic enclosures with liquid and dust ingress protection, a huge plus\n- Experience with 3D CAD modeling systems and workflow, Siemens NX proficiency preferred\n- Solid understanding of FEA (stress analysis)\n- Ability to travel internationally (20%+)\n", "preferred_qualifications": "", "education_experience": "Bachelors or Masters/PhD degree with a specialisation in Mechanical/Aerospace/Mechatronics Engineering and 3+ years of related proven experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200462446"}