{"title": "Wireless MAC Standards Manager", "summary": "As the Wireless MAC Standards Manager, you will be responsible for managing a team of wireless standards architects that is focused on driving innovations for the next generation MAC protocols and algorithms, achieving high performance and reliability in all environments, and enabling evolving and emerging wireless communications systems and applications. Your team will develop ideas to shape the future of wireless communication systems, and drive and influence the standards process by presenting new, innovative, and robust MAC layer algorithms and protocols. Also, your team will create new and innovative proprietary cross-layer algorithms for new and emerging applications. In addition, your team will work closely with internal groups to align on standards strategy, keep them apprised of the development and direction of the standards, define product features and requirements, and develop technical ideas and contributions that are low complexity and architecture friendly. As a member of the silicon design group, you will be responsible for developing state-of-the-art wireless SoC products that are enjoyed by millions of Apple customers.", "description": "Proven track record of leadership and management experience Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB or similar technologies Strong familiarity with MAC protocols and algorithms of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies In-depth knowledge on wireless communication systems, architectures, protocols, and algorithms In-depth knowledge of wireless MAC protocols and algorithms, such as channel access, QoS, power save, low latency, coexistence, security, privacy, etc. Must have strong analytical and problem-solving skills Experience with ns3, OpNet, C/C++, or Python for modeling and simulations Ability to present complex technical concepts in a clear and organized manner Self-motivated and passionate to solve problems in innovative ways Experience with MAC modem architecture, algorithms, hardware design, and software design is a plus Ability to map technical ideas and standards contributions to a hardware or software architecture is a plus Familiarity with wireless PHY standards and systems, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies is a plus", "key_qualifications": "Lead team to develop new and innovative MAC protocols and algorithms, influence standards, and generate consensus around company strategic interests in SDOs Analyze standards contributions to understand performance benefits, implementation complexity, and design and architecture tradeoffs Work closely with internal teams to align on standards strategy and to communicate standards development and direction Derive features and requirements from MAC layer standards for internal teams Lead team to develop innovative proprietary MAC layer protocols and cross-layer algorithms for new and emerging applications Collaborate closely with internal teams to evaluate and simulate expected system level performance Work closely with cross-functional teams to innovate and achieve best-in class product performance", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495163"}