{"title": "RFIC Design Engineer", "summary": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team.", "description": "As a RF IC design engineer, you will be a key member of a small RFIC team, researching, designing and bringing the next-generation of wireless technologies into high-volume production in advanced CMOS technology nodes. Responsibilities include: - Design of analog and/or RFIC blocks. - Overseeing the layout and verifying the design to ensure a successful tape-out. - Testing the design and debugging issues that may arise from early development stages through productization. - Working with the technology team to understand the capabilities and limits of the technology node to achieve the optimum performance.", "key_qualifications": "BS and 3+ years of relevant industry experience. Strong knowledge of RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, ADC/DAC, TIA or other baseband analog blocks in deep sub-micron CMOS technology. Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments. Knowledge of CMOS device physics, RF device modeling, device noise parameters, inductor modeling, and circuit layout for optimum RF performance. Familiarity with various RF transceiver architectures and their trade-offs. Exposure with Cadence Virtuoso, Spectre RF, EMX, and similar tools. Experience in Si characterization, and debug.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200464554"}