{"title": "Logistics Services Specialist, 12 Months Contract", "summary": "The Pacific Logistics team is the heartbeat of Operations at Apple. Come experience the best of both world! Work with the best Logistics partners in the industry, both internally and externally! Our Logistics partners move, store and plan deliveries to all our customers within Asia Pacific, touching online consumers, Retail Store and Channel partners, including Telco, Reseller and Distributors. The Logistics team interfaces actively with various teams in Apple, including the Routes-to-Market fulfilment, AppleCare as well as the Retail Contact Centre teams, while working closely with our partners to ensure that the network is being run as efficiently as possible, in order to get deliveries to our customers in a timely manner. This position is for a Logistics Specialist role within our Logistics Services team. You will play an active role in ensuring customer happiness levels are consistently maintained, by handling and supervising undelivered shipments, following up with both internal and external partners. You will work within an evolving environment. You should be detail oriented, using data efficiently to “tell the story” and be able to take significant action with these insights. You will be a member of a team that will inspire change at different levels within Apple", "description": "You should possess a combination of operational and analytical skill sets. Operationally, the job requires optimisation of the customer fulfilment experience through supervising key performance indicators as well as communicating and collaborating with our internal/external partners to resolve, handle and prevent shipping exceptions every day. Key internal partners include the Logistics Inbound, Outbound and Distribution Centre teams, Retail Contact Centre, Reseller Operations Shared Services and the Retail Fulfilment Operations team while third-party forwarders and warehouse providers form the bulk of our external partners. Additionally, you will need to identify process improvement opportunities and look into recommendations and alternatives at both a tactical and strategic level. An analytical approach is required as there is a performance reporting element to the job. This necessitates analysing and understanding key behavior of our partners to identify root causes and subsequently work with partners to apply relevant corrective actions. Perspective of the analytics will also need to be consistent through interactions with key partners in Logistics and the wider Operations team. There will be opportunities to work with the Business Process Re-engineering team to come up with tools, dashboards and reports to continuously improve processes and operational, analytics/ reporting efficiency. Support peak event execution activities as/when required is needed.", "key_qualifications": "-  Minimum 2 years of operational/ customer service experience in either the Logistics industry or within customer organizations handling Logistics partners\n-  Good written and verbal communication as well as presentation skills\n-  You should preferably have experience with analytics and BI tools and also be good in Excel.\n-  Proven understanding of SAP will be advantageous\n-  Shown analytical skills and ability to look at operational data and reports daily, understand the broader context of issues and take effective steps to root cause and resolve scenarios or inspire change with the partners\n-  Experience working with and delivering to cross-functional partners\n-  Great Teammate, adaptable, flexible and forward-thinking to thrive in a dynamic, fast-paced environment that undergoes constant change.\n-  Ability to work towards timelines is important", "preferred_qualifications": "", "education_experience": "DIPLOMA OR DEGREE IN RELATED FIELD IS A PLUS", "additional_requirements": "A distinct passion for operations with good analytical skills; you should have the ability to evaluate, analyze and present data\nSUPERB COMMUNICATION AND PRESENTATION SKILLS\nEffective time management, ability to multi-task and work in a fast-paced, information-sensitive environment\nAs this job is in direct relation to operational volumes, flexibility on working hours is occasionally required\nOrganized and able to react to the challenges of a fast environment\nCreative, with a practical approach to problem solving and process improvement\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200432409"}