{"title": "Manager", "summary": "Job Summary\nKeeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers.", "description": "Description\nAs a Manager, you're responsible for inspiring your team to create ownership opportunities for customers on the sales floor. Elsewhere, you guide the talent that provides technical support and training, while working in partnership with the business team. And behind the scenes, you oversee operations such as inventory and visual merchandising. You actively build your teams - hiring, training, and developing team members in all these disciplines and more. Supporting Apple simplicity is a complex job, and you make it look easy.", "key_qualifications": "Key Qualifications\nProven ability to drive amazing customer experiences — and results — through team development.\nExperience with diplomatically managing multiple commitments to customers, staff, and operations.\nAbility to adapt to challenges while remaining calm in a constantly changing retail environment.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Additional Requirements\n•You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting. •Cross-industry experience is welcome.\n•You have a passion for learning about Apple technology and products.\n•You read, write, and speak English Fluently.\n•You are flexible with your schedule. Your work hours will be based on business needs.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495958"}