{"title": "RTL Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. In this role, you will gain the opportunity to specify, design, and contribute in the verification and lab bring-up of advanced mixed-signal circuits (digital side).", "description": "In this job you will gain the opportunity to specify micro-architecting digital blocks in advanced mixed-signal circuits. You will be also responsible for RTL coding of blocks specified by you or others. You will participate in the design verification and bring-up of such blocks by writing meaningful assertions, debugging code, and otherwise interacting with the design verification team. You will participate in the lab bring-up of those circuits by potentially writing test scripts, analyzing lab data, proposing experiments, etc.", "key_qualifications": "Deep understanding of mixed signal concepts, along with RTL design fundamentals\nDeep knowledge of Verilog and System-Verilog\nExperience with front-end tools (Verilog simulators, linters, clock-domain crossing checkers)\nWorking knowledge of synthesis, static timing, DFT is a huge plus\nSome working experience with System-Verilog assertions, checkers, and other design verification techniques\nKnowledge of SerDes, algorithm developments, scripting languages such as Perl and Python are plusses\nStrong communication, collaboration and presentation skills", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 3 years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451409"}