{"title": "CPU Top Level Verification Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nAs a CPU Top-Level Verification Engineer, you will be responsible for developing test infrastructure and triaging CPU failures in our validation environment.", "description": "As a CPU Top-Level Verification Engineer, you will be responsible for the verification methodology, tools, and flow used in validating the next generation of processor designs. You will have the responsibilities as follows: \n\n• Drive and develop the tools and flows for advanced verification methodology.\n• Developing, verifying, and maintaining efficient testbench environments and stimulus at the full CPU level.\n• Develop and automate simulation, emulation, and FPGA model build flows.\n• Ultimately work closely with the design and verification teams to validate the functional correctness of the design.", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience.\nYou should have experience in verification methodology.\nVerification tool and verification development experience.\nStrong assembly and CPU architecture knowledge.\nStrong in C, C++, Verilog, and scripting languages.\nYou should be a collaborative teammate with excellent interpersonal skills and be able to work independently.", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451443"}