{"title": "AppleCare Enterprise Business Development Manager", "summary": "The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. The AppleCare Enterprise Business Development Manager is responsible for developing driving the partnerships with Enterprise resellers and carriers and driving direct sales approach through the Japan Major Account Teams on the hardware side. You will work with a cross-functional team (Hardware Enterprise and Channel sales teams) in developing strategies and cases, structuring and completing relationships with account executives and resellers and drive central initiatives to grow our AppleCare for Enterprise business in Japan. As part of the AppleCare Enterprise sales team, you will be responsible for aligning projects, and programs across multiple divisions to ensure detailed execution sales strategies and programs. The role will report to the AppleCare Enterprise Sales Leader.", "description": "- The AppleCare Enterprise Business Development Manager will be responsible to develop the strategic account business within Japan. The key tasks involve:\n- Sales Targets: Owns Regional Sales Results (AppleCare for Enterprise + ACOSS Sales). Develops and performs tactical activities with Japanese major account team-members to achieve regional/country targets.\n- Strategic Approach (Territory Account Plans): Develops and completes strategic territory and account Plans through support of the Hardware Enterprise Sales teams and defines go to market approach. Regular reporting about the key achievements in Business Reviews, as well as developing and sharing lighthouses.\n- Sales Programs and Channel Management: will implement sales incentives and programs crafted to drive the implementation of the AppleCare powered enterprise reseller service stacks, which should include AppleCare for Enterprise and Partner Support Agreement offerings.\n- Direct Sales Approach (Strategic Accounts): driving internal sales readiness through trainings and workshops with the strategic account sales teams. Driving the pipeline management with the AppleCare and Hardware Enterprise sales teams through the usage of the CRM tool.\n- Internal Relationships/Collaboration: maintains important contacts with various internal partners in an effort to achieve results. They include besides the AppleCare teams (WW Enterprise teams, Enterprise Customer success team, Finance) especially the Japan Major Account sales teams and the Apple Financial Services team in the region.\n\nKEY PERFORMANCE INDICATORS:\n-  Being responsible for the key Japan enterprise sales leadership relationships \n-  Achievement of quarterly and annual sales targets\n-  Quality and accuracy of sales forecasting and pipeline management on an ongoing basis\n-  Quality of Business reviews", "key_qualifications": "5-10+ years of commercial deal development and sales execution experience in enterprise hardware or services sales business. Successful leader with multi-channel management experience, including channel development skills at the scale Apple needs.\nBusiness Understanding: Deep understanding of the enterprise sales business in Japan in order to build a successful sales strategy for that region.\nSales Track Record: Successful sales track record in the Enterprise hardware and/or services business.\nNegotiation Skills: Strong negotiation and presentation skills with experience navigating sophisticated sales situations.\nC’level proof: High comfort in taking care of C’level within Apple and at our biggest customers.\nAnalytical Skills: Self-starter with an analytical orientation, strategic vision, and strong executional track record. A strong command of business and financial modeling is important to success in this role.\nCommunication Skills: Excellent presentation, written, verbal and interpersonal communication skills, with strong networking ability.\nRelationship Builder: Confirmed effective relationship builder within a matrix environment at regional, local and WW levels.\nYou will demonstrate a passion, energy and focus on developing and growing multi-million dollar business programs.\nStrong Attention to Detail.\nProficient in English (both written and spoken)", "preferred_qualifications": "", "education_experience": "ENTERPRISE CHANNEL DEVELOPMENT EXPERIENCE\nBA / MBA preferred", "additional_requirements": "ENTERPRISE CHANNEL DEVELOPMENT EXPERIENCE\n- Shown a 5-10 years of commercial deal development and sales execution experience.\n- Experience and understanding of enterprise hardware and services market is ideal.\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity.\nWe also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200490524"}