{"title": "Advanced Package Development Engineer", "summary": "Imagine the pride of having your hardwork being in the hands of a billion people all over the world? That’s the pleasure we find here being able to work at Apple. A company that has consistently brought ground-breaking technologies to the average consumer and has enabled just about anybody to carry a high performance computer in their pocket. If you are motivated by crafting advanced technologies that improve lives everywhere and have unwavering focus on excellence in your craft, then we are looking for you! Bring your technology skills and self-motivation to your job here and be prepared for an adventure! This position will support Apple’s Advanced Packaging Program with responsibilities for package integration and technology development.", "description": "Developing advanced packaging technologies in a cross-functional team. You will be responsible for Package integration and technology development.", "key_qualifications": "Silicon fab interconnect process integration experience in BEoL process, RDL, fine pitch μ-bumps, hybrid bonds, TSVs, etc. Deep knowledge of electrical, mechanical and thermal properties of fab materials Strong expertise in Si Fab equipment and Fab Logistics Management Experience on advanced packaging for groundbreaking CMOS nodes Expertise on Si structure yield and reliability mechanisms and analyses Good familiarity with electrical, mechanical and/or thermal characterization, failure analysis Tool experience: One or more of TCAD, JMP, Virtuoso, KLayout, Ansys EDT Capable of independent R&D Work in a cross-functional team, driving vendors Excellent communication skills Experience in Si fab integration role and advanced packaging", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200468978"}