{"title": "Cellular Protocol Development Engineer", "summary": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for an individual who can excel in a fast-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "The Cellular and Connectivity Team is looking for someone with a combination of strong embedded programming skills and a creative, user-focused mindset. You will be an outstanding teammate who can collaborate with engineers in several technical areas that have developed cellular connectivity solutions for the iPhone, Watch and iPad. You should be able to thrive in a fast-paced environment with rapidly changing priorities. RESPONSIBILITIES: -  Drive the design and development of the various components of LTE and 5G NR protocol stack -  Write software based on 3GPP specifications and develop features using the unparalleled access to iOS and various other platform components to provide the ultimate connectivity experience -  Collaborate with cross functional teams to capture requirements, understand dependencies, define architecture, and implement solutions to well-defined projects -  Work with design and client-side teams to ensure a phenomenal user experience", "key_qualifications": "Hands on experience in embedded system software development. Strong Software Engineering skills including design, programming (using C, C++), scripting and debugging Demonstrated ability to write thoughtful, maintainable code Excellent problem solving, critical thinking, and communication skills Experience in cellular protocols or wireless software development is a plus Experience in Access Stratum is a strong plus", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Electrical Engineering, Computer Science or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200458293"}