{"title": "Graphics Modeling Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices.", "description": "Develop/maintain bit-accurate function C/C++ model for hardware verification Develop/maintain cycle-approximate perf C/C++ model for performance analysis - Analyze model results and propose architectural and micro-architectural changes Design and implement GPU level verification API and tools Create automated flows for graphics core verification and infrastructure for performance exploration and verification Support GPU hardware and software teams during model and design bring-up", "key_qualifications": "Proven expertise and knowledge of graphics rendering algorithms and architectures Experience with GPU APIs, OpenGL, OpenCL, DirectX, Metal Excellent C/C++ programming skills GPU modeling experience, no matter function or performance, is a strong plus Experience with graphics device drivers is ideal Experience with scripting, DPI, Verilog/VHDL, Specman/System Verilog, design verification methodology and tools a plus Team leadership experience a plus Excellent interpersonal skills and ability to collaborate under bold schedules", "preferred_qualifications": "", "education_experience": "BS + minimum of 3 years of experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448639"}