{"title": "Embedded Platform Engineer", "summary": "Are you a big-picture thinker who loves setting ambitious goals?. Do you have a passion for understanding how each line of code affects all the others?. The Embedded Platform organization of the Core Operating Systems group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Embedded Platform Team within Apple's CoreOS organization is looking for a talented embedded software engineer to help with pre-silicon simulation, early silicon support and development of the boot-loader, device drivers and platform software for future generations of iOS devices. Working on a core technology, you have the opportunity to make a major impact in the way that Apple develops and ships iOS products. Our environment fosters product innovation, rapid product iteration, and a liberating amount of autonomy. Weʼre looking for detail-oriented engineers with exceptional problem-solving skills and a passion for quality who want to define and build future iOS systems.", "description": "You will play a central role in building the support for iOS system development ranging from the pre-silicon and early silicon phases, including involvement in specification review for new SoC’s, work with system simulation technologies, boot firmware, low-level device drivers, and new system bring up. You will work closely with internal and external teams to enable firmware development long before first hardware availability and will continue to work on system software until the product ships. The ideal candidate should be comfortable working on a large spectrum of issues ranging from hardware/silicon issues to overall system operation, performance and power management.", "key_qualifications": "A genuine passion for embedded development: Highly proficient in C/C++. Understanding of ARM assembly is a plus. Extensive knowledge of hardware platforms & processor architectures, previous exposure to hardware and processor. simulation, solid experience in hands-on development and troubleshooting of boot-loaders, and device drivers. Previous experience with JTAG and other debuggers. We’re looking for someone who is creative, critical thinking and has proven troubleshooting skills. You should be highly professional, with the ability to deliver proven work on tight schedules, have excellent collaborative skills and the ability to work closely with Silicon design and HW design engineers.", "preferred_qualifications": "", "education_experience": "Master’s (preferred) or Bachelor’s degree or equivalent experience in Computer Engineering or Computer Science or a related field.", "additional_requirements": "Experience with ARM and other CPU architectures. Knowledge of high speed interfaces (e.g., PCIe, memory). Knowledge of SoC power management, and the ability to understand board schematics.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449109"}