{"title": "RF Hardware Engineer - Multi-Radio Coexistence", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Our RF Systems Engineering team is looking for a passionate, self-motivated individual to work on overall system performance of multi-radio coexistence for various wireless technologies (e.g., Cellular, Wi-Fi, BT, GPS, NFC, etc.)", "description": "You will be responsible for assessing platform-level multi-radio coexistence performance, including: - Performing HW failure analysis at the RF/wireless system level to understand low margin or failing behaviors making use of hands-on experimental modifications to hardware - Proposing design and process changes for multi-radio coexistence issues considering design constraints and align with cross-functional partners on trade-offs and implementation path - Reviewing designs and sign-off on releases of PCB layouts, flex layouts, system level groundings, shielding, etc. - Execution of validation & characterization test plans to meet multi-radio coexistence performance targets - Tracking validation status, analyze results and communicate insight from data - Evaluating multi-functional change requests; and update characterization plans as needed, highlight any issues - Working with RF Test Engineers to bring-up device-under-test, setups and test procedures for multi-radio coexistence validation - Performing simple experiments using hardware mock-ups, system prototypes and experimental setups - Collaborating with cross-functional partners for circuit-level, system-level simulations to understand risk areas and root cause issues", "key_qualifications": "Experience on at least one radio of Cellular, GPS, Bluetooth, Wi-Fi, Thread, NFC, and UWB; Knowledge of wireless architectures including front-end, antenna sharing, link budget line-up, etc.; Proven understanding of RF hardware and standard methodologies for system-level grounding, shielding, isolation, and electromagnetic interference mitigation; Knowledge of RF component characteristics and experience using lab equipment including spectrum analyzer, network analyzer, signal generator and oscilloscopes; Experience performing hands-on disassembly and system level debug on module, reference board or system level; Experience debugging and performing optimizations at the conducted or radiated radio systems level; Excellent communication written and verbal skills; Ability to travel domestically and internationally up to 20%", "preferred_qualifications": "", "education_experience": "BS with 10+ years relevant experience required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448144"}