{"title": "Mixed Signal IP Post-Silicon Validation Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a dedicated Mixed Signal IP Post-Silicon Validation Engineer! In this highly visible role, you will perform lab validation and characterization of coordinated circuits; and you will collaborate with many fields to launch the world's premiere mobile chips. As a member of our multifaceted group, we have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day!", "description": "You will be member of post silicon validation team responsible for:\n\n-  Collaborating with chip design team to develop test and characterization plan for various integrated circuit IPs, such as ADC, DAC, PLLs, clocks, memory interfaces, and I/Os\n\n-  Setup, debug, and maintain lab test setup\n\n-  Develop automated testing script in Python for silicon bring up and characterization\n\n-  Execution of automated test to characterize IPs, collect and analyze characterization data and generate report\n\n-  Work with chip designers, system HW and SW team to debug any issue during validation/characterization", "key_qualifications": "Experience in first silicon bring-up, debug, validation, characterization and report\nExperience with data converter, PLL, filters, SerDes, DDR\nExperience developing automated testing script and instrument controls, Python preferred.\nFamiliar with measurement equipment including signal generator, spectrum analyzer, scope\nEmphasis on quality of work: should self-check scripts, test patterns, and reports", "preferred_qualifications": "", "education_experience": "Bachelors Degree\n3 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451353"}