{"title": "CPU Performance Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product.", "description": "• Collaborate with software and system teams to identify and profile critical workloads for CPU performance and power\n• Develop representative benchmarks for CPU critical workloads\n• Capture key workloads for simulation on CPU performance model\n• Identify hardware and software performance bottlenecks\n• Work closely with the Architecture, Micro-Architecture, and RTL teams in identification of solutions\n• Run and analyze workloads on simulators and prototype devices as well as work on developing and automating performance analysis infrastructure", "key_qualifications": "- Minimum BS and 10+ years of relevant industry experience\n- You should have experience in CPU performance architecture, micro-architecture design, or performance analysis\n- Strong CPU architecture knowledge, micro-architecture knowledge, and an understanding of competing architectures\n- Experience working in a performance modeling environment\n- Proficient in C and C++\n- Proficient in scripting languages such as Perl, Python, and Ruby\n- Ability to problem solve and prove your own ideas\n- Knowledge and experience with common performance benchmarks and workloads\n- Knowledge of OS internals and compiler technology a plus", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200454945"}