{"title": "Cellular ASIC Design Integration Engineer", "summary": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As a member of our dynamic Cellular group, you'll be at the heart of chip design! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. This is a high visibility and mission critical role, which provides excellent exposure to multiple VLSI design technologies and flows. It also requires close working relationships with many functional teams.", "description": "On our team you will have following responsibilities:\n\n-  Contribute to definition, architecture, design and development of cellular sub system.\n-  Perform all aspects of front end design flow including integration, connectivity, releases, design checks, verification reviews, mbist, dft, synthesis, timing constraints.\n-  Perform power analysis and analysis different design tradeoffs and drive power improvements.\n-  Develop design methodologies for scalable designs.\n-  Pre/Post silicon debug support.", "key_qualifications": "BS and 3+ years of relevant industry experience.\nThis position requires thorough knowledge of the ASIC design flow, FE, Low power design and design verification, scripting.\nKnowledge of ASIC/SoC design flow.\nKnowledge of FE tools (CDC, RDC, LINT, Formal, LP Checks, LEC, PTPX).\nStrong knowledge of RTL design and HDL languages (Verilog, System Verilog, etc.)\nStrong analytical skills to be able to make design tradeoffs for best performance, low area, and low power.\nExperience in driving power improvements based on power analysis tools/flows.\nUPF flow for defining power intent of chips with multiple power domains.\nExperience with version control tools and handoff of design releases.\nStrong scripting skills to automate tasks and build scalable design flows.\nSelf starter, highly motivated, highly organized, and schedule driven is a must.\nUnderstanding of  synthesis and STA constraints.\nFamiliarity with DFT, MBIST, Synthesis, STA and backend related methodology and tools is a plus.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451057"}