{"title": "Senior Linux System Engineer - ACS", "summary": "Build and solve Linux production systems at scale. Multi-datacenter deployment and supporting a large-scale Linux environment with heterogeneous hardware. Build automation tools and scripts using Bash, Python, Go, etc. Design and support orchestration pipeline using Ansible and Puppet. Familiarity with Hadoop and its ecosystem Hive, Pig, Spark, HDFS, HBase, Oozie, Zookeeper, etc will be useful in this role. Fix and address issues with UNIX and TCP/IP network stack components. Design and support Linux systems (RedHat/OEL/CentOS etc) including automated OS installation, Linux certification, compile and validate various kernels, package management, OS lifecycle management, diagnostic, and performance troubleshooting/profiling.", "description": "- This is Senior Linux system Engineer position with dedicated focus on E2E system validation\n- Build, Automate and support critical infrastructure supporting applications used across multiple teams\n- Run different automation pipelines in the large ecosystem, including provision, orchestration, and monitoring on Linux baremetal and Linux Virtual Machines\n- Collaborate across teams to run workloads and analyze/debug data\n- Evolve and modify the Analytics Platform based on requirements\n- Write code, tests, documentation, participate in code reviews", "key_qualifications": "Extensive Linux experience, especially with RHEL and compatible systems like CentOS, etc.\nExcellent experience with programming languages like C, C++, or Go\nStrong knowledge of GitOps and Kubernetes\nExperience with alerting, monitoring and deployments\nExperience with Python development\nExpertise in Linux systems and networking concepts\nExcellent communication and collaboration skills", "preferred_qualifications": "", "education_experience": "BS, MS, or PhD degree in Computer Science or equivalent experience", "additional_requirements": "Additional Requirements as plus:\n* Cassandra, Kerberos, SDN, Docker, Kubernetes, Serverless Computing, etc\n* Prior experience as an SRE, Software engineer\n* Experience in system automation technology, such as Puppet or Ansible\n* Experience in Docker, Kubernetes and Cloud technologies will be a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200440680"}