{"title": "RAN1/RAN4 Standards Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem.", "description": "-  You will participate to 3GPP standards meetings and steer/support systems engineering team to build innovative modems. -  You will develop and run C/C++ simulations to help model the design and performance of PHY and MAC algorithms for a 5G multimode modem - You will be part of a team defining and doing research of next generation standards like 6G.", "key_qualifications": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.). A background in 3GPP standardization in RAN1 or RAN4 is a significant plus. Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.). Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.", "preferred_qualifications": "", "education_experience": "BS and 10 + years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200465228"}