{"title": "Analog IP Design Lead", "summary": "This role is for a analog IP lead who will enable us to produce fully functional first silicon IP designs. \nThe responsibilities include all phases of silicon development from definition to high quality production.\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an exceptionally talented IP design lead. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.", "description": "Defining and specifying requirements and circuit architecture for analog IP design, lab bring-up, characterization and debug, write specifications, test plans and characterization reports, supporting Apple system teams with product integration, work with chip design teams, system HW and SW design teams, ATE PE\n\nYou will be responsible for the following:\n1. Work with architecture team to define the IP microarchitecture spec. Refine the spec with reviews with other teams\n2. Develop the circuit design of the IP following established design guidelines based on microarchitecture spec. Own all aspects of circuit design development.\n3. Work and collaborate with other designers in the group to deliver results.\n4. Work with FE & BE teams to ensure quality analog integration\n5. Work with power/performance and functional verification team to define and validate operation sequences\n6. Work with multi-disciplinary teams to make sure designs are delivered on time and with highest quality by incorporating proper checks at every stage of the design process\n7. Work with post silicon validation groups to ensure the IP meets the power/performance targets", "key_qualifications": "10+ years experience in analog IC design.\nDeep understanding of transistor device characteristics.\nDeep understanding of power, performance and area trade-off in mixed-signal designs.\nA proven track record of high-performance designs in high volume production for low power applications.\nKnowledge of analog IC design flow and tools.\nStrong communication skills are a must, as the candidate will interface with a lot of different groups within the company.\nExcellent social skills and high degree of self interpersonal skills suited for working in a remote setting with team members across multiple time zones.\nHands-on design expertise in one or more of the following areas: High Speed, Low Power I/O Circuit Design: familiarity with PHY principles and concepts including forwarded clock topologies, training and calibration schemes etc.); High Speed Clock Path: low jitter distribution, DCD correction, phase shift (through delay lines or phase interpolation); Analog Front End: low noise and high-resolution signal conditioning prior to ADC and Op-Amp, switched-cap and continuous time filters, reference/bias generation, LDO etc.; Data Conversion: ADC and DAC subsystem. Different styles of data converters (ΔΣ, SAR, pipelined, SAR and flash) and associated calibration techniques.\nStrong initiative and ownership of responsibilities, productive\nAbility to work well in a team and be productive under tight schedules\nExperience with advanced FinFET CMOS processes - an advantage", "preferred_qualifications": "", "education_experience": "BS.c in Electrical Engineering\nMS.c\\ PhD - advantage", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200469600"}