{"title": "AIML - ML Researcher", "summary": "Play a part in building the next revolution of machine learning technology. We're looking for passionate researchers to work on ambitious long-term research projects that will impact the future of Apple, and our products. In this role, you'll focus on innovative foundational research in large language models and other foundational models. As a member of the team, you will be inspired by a diversity of challenging problems, collaborate with world-class machine learning engineers and researchers to impact Apple products, and publish some of your results in high-quality scientific venues.", "description": "We're after a strong research background in machine learning, LLMs and other foundational models. You'll regularly publish in the main relevant conference and journal venues, and make sure that your research results are of high quality and reproducible. You will propose your own research plan to advance our understanding of machine learning and implement it through experimentation, in collaboration with your colleagues. You will provide technical mentorship and guidance, and prepare technical reports for publication and conference talks. You will have the opportunity to collaborate with broader teams across Apple.", "key_qualifications": "Demonstrated expertise in machine learning research.\nPublication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, AAAI, CVPR, ICCV, ECCV, ACL, EMNLP, etc).\nHands-on experience working with deep learning toolkits such as Tensorflow or PyTorch.\nStrong mathematical skills in linear algebra and statistics.\nAbility to formulate a research problem, design, experiment, implement and communicate solutions.\nAbility to work in a diverse collaborative environment.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200488383"}