{"title": "Digital Design Lead", "summary": "Are you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively and deliver on a predictable and dynamic schedule? We have an extraordinary opportunity for a silicon design engineer to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies! The Apple Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, Apple Watch, and AppleTV. We are looking for a remarkable Digital Design Lead to work with multi-functional teams and external vendors to define, develop and productize the next generation of custom silicon solutions.", "description": "You will be responsible for assisting in architecture, implementation, verification, emulation and validation of custom silicon, including: Working with Platform Architecture and Systems teams to establish silicon requirements. Making appropriate design Trade offs balancing risk, area, power, performance and schedule. Help improve engineering requirement specification documents for custom silicon. Work with external vendors in developing micro-architecture, verification and emulation of custom silicon. Drive vendor’s methodology to meet World Class silicon design standards.", "key_qualifications": "BS+10 Years of relevant industry experience\nWe are seeking applicants with 10+ years of digital design experience on complex multi-million gate architectures; mixed signal experience is highly desired.\nHaving achieved multiple tape-outs reaching production with first pass silicon.\n3+ years with managing digital design teams preferred.\nAbility to drive and improve digital design methodology to achieve high quality first silicon.\nHands on experience with FPGA emulation, silicon bring-up, characterization and debug.\nAble to work with multi-functional teams within Apple and external vendors across geographical boundaries to resolve architectural and implementation challenges with an eye towards schedule.\nStrong verbal and written communication skills.", "preferred_qualifications": "", "education_experience": "BS+10 Years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200495334"}