{"title": "NAND Packaging Engineer", "summary": "Envision what you could do here. At Apple, we believe new ideas and insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight, and inspire millions of Apple’s customers every single day. SEG Packaging is a key part of the HW Technology team...", "description": "Define the memory package POR (plan of record): Package architecture, technology, process, form factor, layout, bill of materials (BOM), design rules, thermo-mechanical, signal integrity, power integrity Publish internal package specs for customized memory Establish trusting and collaborative relationships and communication channels, as a direct interface with vendors for memory package development and qualification Review, drive, and approve memory vendor DOEs, characterization plans, technology and product qualification Drive industry with advanced package design rules, processes, materials, and leading-edge specifications About 10% international travel required", "key_qualifications": "We are looking for someone with 2+ years’ experience in package design and assembly process development for stacked-die memory packages Strong knowledge of wirebond and flip-chip assembly process applied to thin-die stacking Strong knowledge of packaging materials, substrate technology, and their mechanical and thermal behaviors Working knowledge of assembly design rules, SIPI, and layout tradeoffs to enable high performance DDR or differential signaling Solid working experience in package test and reliability, system-level downstream process interaction, and packaging inspection metrology Excellent engineering problem-solving skills, with strong engineering physics and data-driven analysis Strong written and verbal communication skills for working with internal multi-functional teams and OSATs", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450101"}