{"title": "Sr. Test BaseStation Designer", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "This role requires critical expertise in multiple layers in cellular protocols, experience with UE and/or NW protocols development for various 3GPP technologies is essential. The candidate must demonstrate solid understanding of relevant protocol procedures and network interactions. The duties of this position will include design, develop, and maintain cellular protocol device side host test and network simulation environment. As a Test Base Station Architect, you will be responsible for design, implementation, integration approach and verification of a wireless test base station We need you to be responsible for the architecture, design and development of test base station with a focus on integration of different protocol layer implementations. You are a resourceful specialist in cellular network simulation systems and capabilities, including a working understanding of the wireless system platform and the use cases. You will participate in HW bring-up, performance characterization and optimization. You will create technical design documents and source material for user documentation.", "key_qualifications": "Experience in building complex wireless systems and simulations\nIn depth knowledge in 4G LTE /5G NR Cellular Network Architecture\nMust have excellent software developing and debugging skills including design, programming (C, C++, script) and debugging\nHave depth of knowledge in 3GPP 4G/5G protocols (L1/L2/L3)\nExperience with 4G/5G physical layer standards and software defined radios (SDR)\nExcellent knowledge on one or multiple cellular technologies: 4G LTE, 5G NR SA/NSA.\nSystem integration and validation experience of 4G LTE/5G-NR RAN (RRC, SDAP, PDCP, RLC, MAC & PHY) functions for both control plane and user plane based on 3GPP standards\nUnderstanding of ORAN split functions architecture and front-haul standards.\nKnowledge of 5G gNB DU/gNB CU, and F1 interface is a plus\nWorking knowledge of Implementing Test Base Station and RAN/CN network emulators (Keysight, R&S, Anritsu, Anite etc)\nStrong experience in cellular protocol stack host test or simulation environment development is key\nHighly motivated and self-directed, fast learner, a good team player\nExcellent verbal and written communication skills", "preferred_qualifications": "", "education_experience": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree", "additional_requirements": "Standard Software development & tool environments is a plus\nUnderstanding of NAS layer protocol and UE emulation is helpful", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200474197"}