{"title": "AI/ML Wireless Systems Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking AI/ML based wireless solutions. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will work on defining system level concepts, proposing, and researching innovative ideas & algorithms, performing sophisticated system simulations, defining and working on rapid prototyping platforms to help prove your ideas for current and next generation (5G/6G) cellular systems with strong AI/ML foundation.", "description": "Participate in cutting edge research in machine intelligence and machine learning applications Contribute to AI/ML framework design Take a top-down approach towards system design starting from a use case of relevance to Apple products, defining a problem statement and arriving at groundbreaking innovative solutions Setup large-scale tests and deploy promising ideas quickly and broadly From creating experiments and prototyping implementations to designing new architectures, developing solutions for real world, large scale problems", "key_qualifications": "-  Direct experience on solving interdisciplinary problems via machine learning (ML) -  Publications in top machine learning conferences/journals such as JMLR, ICLR, NeurIPS, ICML, ACL, CVPR. -  Knowledge in Algorithms, Optimization, Probability, Statistics and Information Theory Working experience in one or more of the following research directions in Neural Networks: Deep Reinforcement Learning, Federated Learning, Transformer, Transfer Learning, Online Learning, Generative Neural Network, Graph Neural Network, CNN, RNN etc -  Shown track-record of innovation in AI/ML Programming experience in Python, MATLAB. -  Demonstrate clarity of thought and strong analytical and problem-solving skills. -  Ability to work well both independently and within a team. -  Excellent communication and presentation skills. -  Familiarity with efficient implementation of AI/ML in hardware. -  Good coding style and code management abilities.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451632"}