{"title": "Mac Systems Architect - Display", "summary": "Mac System Architecture team has an outstanding opportunity for a Display systems or technology architect to influence and drive new product designs. This role is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. You will utilize your skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal, and cost goals.", "description": "In this highly visible role, you will provide architectural guidance and leadership to cross-functional engineering teams to establish new product definitions and requirements. Providing system architecture guidance by negotiating top-level product goals among a broad group of architects and system engineers, technical leads, HW & SW engineering managers, and external vendors. Determine product system integration feasibility, via collaboration with mechanical, physical, thermal, and electrical engineering stakeholders. Author system architecture specifications, block diagrams, and conduct review with the product teams. Collaborate with performance architects to define, model and drive improvements in performance, power efficiency and cost. Analyze, guide and support thermal management solutions and trade-offs. Anticipate future SoC requirements and negotiate with internal SoC teams to align with system product goals. Be innovative and curious. Explore and champion new product-level features, workflows, etc.", "key_qualifications": "Typically requires a minimum of 10+ years of relevant systems architecture experience, with specialization in Display Technologies. Has core competence and subject matter expertise in personal computing system and product design. Possesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras, and sensors.", "preferred_qualifications": "", "education_experience": "MS or BS in Electrical Engineering or similar discipline", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200481352"}