{"title": "SAP RAR Functional Analyst", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you deeply accountable for your work? A passion for product ownership and track record will prove critical to success on our team. Be ready to make something great when here. Multifaceted, encouraging people and innovative, industry-defining technologies are the norm at Apple. Join Apple to help deliver the next amazing Apple product. Apple’s Information Systems & Technology (IS&T) organization manages key business and technical infrastructure at Apple-- how online orders are placed, the customer experience with technology in our retail stores, how much network capacity we need around the world and much more. The SAP Global Systems team within IS&T runs the financial transactional platform that powers ecommerce for Apple Media Products. As the SAP functional manager you will have the chance to work with diverse business teams, group of leads and engineers, while being exposed to insights that help drive our business across Apple Services Engineering, Hardware, Retail and Finance teams. We are looking for an individual with extensive experience in managing mid to large sized SAP projects. Experience in system design and configuration of SAP BRIM, SAP SD or SAP RAR modules required. This is a tremendous opportunity for someone who has the skill to own and drive initiatives and a passion to work in a highly integrated global solution platform! . Join us in crafting solutions that do not yet exist!", "description": "Apple's SAP organization has an immediate opening for a senior S/4 RAR functional manager who has the right mix of SAP functional and project management skills to successfully deliver global & complex projects in Apple's fast-paced environment. As the functional manager, you will need to have experience in leading large size complex implementation & migration projects. Key aspects of this role and responsibilities will include solution design, project timelines, budgets, prioritisation, scope and definition", "key_qualifications": "5+ years of SAP RAR with SAP SD or FICA implementation experience required\nMultiple S/4 RAR full life cycle implementations experience required\nBRIM / SD Based business process and BRIM / SD - RAR integration experience required\nIntegration experience with tax applications, and other SAP modules like FICO, FICA, etc. preferred\nExperience in migration from SD Revenue Recognition to S/4 RAR preferred\nExperience in BRF+ preferred\nExperience in managing & architecting complex business models preferred\nConsistent record of successfully delivering finance projects on time, working with various internal and external teams\nExperience in leading a global and diverse team\nAbility to drive the project forward with a sense of urgency\nDomain expertise and consistent track record in designing and deploying solutions in SAP SD & RAR\nStrong written communication skills including business and functional requirements, management level presentations and proposals presentation\nLead SAP projects, prioritize work and coordinate multiple projects in parallel", "preferred_qualifications": "", "education_experience": "CA/ICWA/MBA Finance", "additional_requirements": "FICO / FICA / BRIM / SD - S/4 RAR migration/Integration experience is highly desired", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200497517"}