{"title": "Graphics (GPU) Performance Modeling Engineer", "summary": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role, you will be passionate about writing code for performance modeling for GPUs and the performance model infrastructure. This includes working with architects and designers to understand the units being modeled.", "description": "As a Graphics (GPU) Performance Modeling Engineer, you will: Develop performance model for micro architecture trade-offs. We would the integration of the performance model into the functional model. Run analysis on the model. Roll up and present results and recommendations. Improve the performance modeling infrastructure. Provide feedback on the performance modeling process", "key_qualifications": "We would prefer that you have the following skills: \n- Strong C++ coding skills\n- Experience with performance modeling both cycle accurate and queueing models\n- Understanding of CPU micro architecture with GPU knowledge a plus\n- Experience with VHDL or Verilog\n- Experience with scripting languages\n- We prefer candidates who exhibit excellent communications skills, demonstrate a sense of motivation and show a high level of organization\n- We like people who are fast learners and are eager to tackle technical challenges using innovation", "preferred_qualifications": "", "education_experience": "BS + minimum of 3 years of experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449027"}