{"title": "Graphics Modeling Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We are seeking a Graphics Modeling Engineer will deliver high-quality GPU function and/or performance models to meet the needs of GPU hardware development. This includes writing models for functional development and verification of a GPU design, performance exploration, performance validation, and power estimation. You will collaborate closely with the architecture team, hardware design team, design and verification teams.", "description": "Develop/maintain bit-accurate function C/C++ model for hardware verification Develop/maintain cycle-approximate perf C/C++ model for performance analysis - Analyze model results and propose architectural and micro-architectural changes Design and implement GPU level verification API and tools Create automated flows for graphics core verification and infrastructure for performance exploration and verification Support GPU hardware and software teams during model and design bring-up", "key_qualifications": "Knowledge of graphics rendering algorithms and/or computer architectures Knowledge of one or more GPU APIs like OpenGL/DirectX, OpenCL/CUDA, Metal Solid C/C++ programming skills Cache and memory hierarchy understanding is a strong plus Excellent interpersonal skills and ability to collaborate under bold schedules", "preferred_qualifications": "", "education_experience": "Minimum requirement of BS degree", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449024"}