{"title": "MY-Business Expert", "summary": "Do you love to collaborate and help businesses thrive?   At the Apple Store, you connect business professionals and entrepreneurs with the tools they need in order to put Apple solutions to work in their businesses. As a Business Expert you help them learn about Apple products and explore various possibilities. You’re part of a team that’s passionate about helping businesses succeed. With your understanding of business needs and enthusiasm for Apple, you find great satisfaction in offering powerful, innovative solutions to each customer. You work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "As a Business Expert you introduce Apple solutions, technology and services to business customers. You spend time on the sales floor, meeting first-time and current business customers and learning their needs. You generate new leads and build relationships, connecting over the phone or through in-store workshops and events. You discover customer needs through briefings, and work with the Business Team to prepare and present proposals. For customers with more complex needs, you work with the entire Business Team to craft the ideal solutions. Finally, you inform and offer customers the complete suite of sales support options. By engaging customers to think about the possibilities of Apple technology in their businesses, you help build success — not only for your team, but for our customers as well.\n\nDiscover even more benefits of doing what you love. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nNote: Apple benefits programmes vary by country and are subject to eligibility requirements.", "key_qualifications": "", "preferred_qualifications": "Knowledge of how businesses use technology and what Apple solutions can offer them.\nComfort using the phone to interact with customers and to position business solutions.\nAbility to facilitate business experiences through in-store briefings, workshops and events.\nContribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn.\nDemonstrate Apple’s values of inclusion and diversity in daily activities.\nYou have at least one year of business sales experience\nYou’re comfortable developing qualified leads by phone.\nYou have strong people and presentation skills, and excellent verbal communication skills.\nYou’re fluent in the local language.\nYou’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200450011"}