{"title": "Senior Wireless MAC Standards Architect", "summary": "As a Senior Wireless MAC Standards Architect, you will be responsible for driving and designing the next generation of media access control layer protocols for wireless technologies.", "description": "Participate, contribute novel MAC protocols and algorithms, influence, and generate consensus around company strategic interests in wireless standards organizations. Simulate MAC system level performance using simulation tools, such as ns3, OpNet, C/C++, or Python, to validate MAC system performance of internal and external technical contributions. Analyze standards contributions to understand performance benefits, implementation complexity, and architecture and design tradeoffs.", "key_qualifications": "Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB or similar technologies. Strong familiarity with MAC protocols and algorithms of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies. In-depth knowledge of wireless MAC protocols and algorithms, such as channel access, QoS, power save, low latency, coexistence, security, privacy, etc. Must have strong analytical and problem-solving skills. Experience with ns3, OpNet, C/C++, or Python for modeling and simulations. Experience with MAC modem architecture, algorithms, hardware design, and software design is a plus. Experience with PHY/MAC cross-layer algorithm design is a plus. Ability to present complex technical concepts in a clear and organized manner. Have a strong and proven leadership ability is a plus. Self-motivated and passionate to solve problems in innovative ways.", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200448743"}