{"title": "Senior Software Engineer in Test, Distributed Systems - ACS", "summary": "The Apple Cloud Engineering team is looking for an outstanding software engineer to integrate and test software to lead and orchestrate workloads across highly performant and energy efficient systems that will power the next generation of data centers. In this highly collaborative role, you will be at the center of multiple efforts to utilize hardware acceleration for machine learning and high performance computing workloads. You will partner with teams across Apple to adapt, tailor, and scale software on a novel compute platform and will help to build the foundation of our future cloud architecture. We are looking for someone with proven mastery building and leading scalable, resilient systems. You should have a strong mix of education and practical experience with a real passion for diving head first into challenging problems.", "description": "You will work multi-functionally with architecture, platform design, SOC architects, and software teams to automate and validate outstanding hardware, software and services. You will be responsible for building and maintaining system infrastructure that powers the next generation of data centers. You will ensure high quality and agility with unit tests, integration tests and performance tests. You will be responsible for crafting, implementing, and completing test plans and test suites based on specification documents.", "key_qualifications": "5+ years of experience as a Software Development Engineer in Test or Software Quality Engineer. Scripting and programming skills in C/C++, Golang, Python, Shell. Excellent Automation skills and CI/CD pipeline experience is a plus. Good understanding of microservice topologies and deployment patterns in the cloud and/or edge. Experience with cloud orchestration engines such as Kubernetes, Nomad, Apache Mesos, or similar. Ability to triage problems, prioritize accordingly, and propose a resolution. Experience with Swift, Objective-C and Apple development tools is a definite plus! Passion for software architecture, APIs and high performance extensible software. Creative, collaborative, and product-focused. Excellent communication skills.", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Computer Science, Computer Engineering, or equivalent experience.", "additional_requirements": "YOU ARE THE RIGHT MATCH IF: - You possess strong skills in software development and testing. - You are passionate about developing new features, automation, maintaining existing code, fixing bugs. - You have strong problem-solving skills. - You are skilled at the art of communicating and enjoy it", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200442381"}