{"title": "SoC Physical Design Engineer, PnR", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!", "description": "• Work with the logic design team to understand partition architecture and drive physical aspects early in the design cycle. • Complete netlist to GDS2 implementation for partition(s) meeting schedule and design goals. • Timing, physical and electrical verification, and driving the signoff closure for the partitions. • Resolve and improve design and flow issues related to physical design, identify potential solutions, and drive execution.", "key_qualifications": "Minimum BS and 10+ years of relevant industry experience. Knowledgeable in partition level P&R implementation including floorplanning, clock and power distribution, timing closure, and physical and electrical verification. Strong knowledge of physical design construction and analysis flows and methodology. Shown ability to adhere to stringent schedule and die size requirements. Strong communication skills. Experienced with industry standard tools understanding their capabilities and underlying algorithms. Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ. Proficient in scripting languages (i.e. Perl, Python, TCL). Demonstrate knowledge of basic SoC architecture and HDL languages to collaborate with logic design teams to drive optimizations in power, performance, and area. Experience in IP-level planning (block tiling, feedthrough planning, pin assignment). Solid understanding of Extraction and STA methodology and tools.", "preferred_qualifications": "", "education_experience": "Minimum BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200455621"}