{"title": "Analog Mixed-Signal Behavioral Modeling Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Modeling Engineer. If you are early in your journey towards a chip design career and wish to challenge yourself in a technical and multi-disciplinary effort, we have an exciting position for you in the extraordinary Apple mixed-signal silicon design team. This position will encourage building of a validated foundation in logic circuits and gentle entry into understanding analog circuits. You will gain transparency into a variety of flows fundamental to modern silicon engineering: insight into full custom schematics for analog as well as high-speed digital circuits, translating functionality of such circuits into an efficient software behavioral representation, simulation of such code and ensuring formal equivalence between custom designs and their abstract representation. You will gain experience and knowledge into software methods and analysis that is increasingly significant for a variety of fields.", "description": "In this job you will be responsible for translating custom mixed-signal circuit schematics into efficient SystemVerilog behavioral models for higher level simulations. You will have to closely interact with circuit design teams to understand fine details of custom circuits, and with DV teams to craft hooks for effective verification. You will have to run various simulations and equivalence checks to ensure that the model matches closely with the custom circuits. You will have to handle the quality of such models for production worthiness across projects. You will have to write scripts and simple tools for automating repetitive tasks or performing calculations.", "key_qualifications": "Excellent knowledge of digital logic gates, clocking and state elements. Excellent knowledge of Verilog/SystemVerilog with ability to write behavioral code. Solid understanding of logic simulations. Some understanding of SPICE circuit simulations, understanding of synthesis and timing of digital logic. Basic knowledge of reading device level schematics for circuits such as logic gates. Familiarity of writing scripts in PERL/Python and basic algorithms is a strong plus. Familiarity with blocks such as PLLs/DLLs/SERDES is a strong plus. Knowledge of digital signal processing and numerical concepts is a plus. Knowledge of probability and statistical concepts is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree with minimum 3 years of proven experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200475588"}