{"title": "Sensing PHY Algorithms and FW Developer for Wireless SoC", "summary": "Are you a big-picture, problem solver who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability and performance of the product? Apple is interested in people who want to help meet that commitment. In your role as a PHY Algorithms and FW Developer as part of Apple Connectivity Group, you will be part of a world-class group that pioneers wireless solutions for Apple products. You will become part of a hands-on development team that fosters engineering perfection, creativity and innovation. Dynamic, encouraging people and innovative technologies are the norm here! If you are a resourceful engineer with the desire to research and develop solutions that do not yet exist, we want you to join our team.", "description": "We are looking for a candidate who can innovate and integrate signal processing technologies, for solving novel and diverse sets of problems in various wireless communication technologies to join our PHY FW team. You should have a strong background and experience in communication systems & FW PHY development and hands-on experience in development of different Ranging features, such as: Time-of-Flight, Angle-of-Arrival, etc. You’ll be working on ground breaking technology, researching and developing new solutions. Conduct basic research of existing solutions in literature; Perform mathematical analyses of the given problem and its proposed solutions; Implement simulations, conduct field experiments and create real-time prototypes. Involvement in block level spec definition; Write detailed design documents that will enable implementation of algorithms in PHY FW; Optimize and fine-tune the system for spec compliance on silicon in an RF lab environment.", "key_qualifications": "3+ years of experience in low-level real-time/embedded programming, 3+ years of practical experience in PHY & RF Algo development of Ranging features and/or wireless modem design, Proven theoretical foundation in classical signal processing, Experience and proficiency in C programming language, Experience and proficiency with using MATLAB for algorithm development, modeling, and simulation, Knowledge in wireless protocols: Bluetooth or WLAN (IEEE 802.11) — highly preferred, Experience in RF lab work and testing equipment (Spectrum Analyzer, Signal Generator etc.) — preferred, Hands on experience in Python — preferred", "preferred_qualifications": "", "education_experience": "B.Sc / M.Sc. / Ph.D. degree in Electrical Engineering, Computer Engineering, or related discipline.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200437878"}