{"title": "Signal Integrity Engineer", "summary": "In this position, you will work with the team that develops SOCs used within Apple's mobile devices. You will be specifically responsible for high-speed serial interface signal integrity and power integrity for Apple SOCs covering the span from package to board. Prior design and modeling experience with USB, PCIe, or comparable interfaces is a must-have.", "description": "Work on the electrical and physical design of high-speed serial interface systems Work on the electrical extraction and validation of package and PCB Work with circuit design team and vendor to optimize circuit and system design SI and PI modeling, simulation, and characterization high-speed serial interface Develop and execute test plans to validate signal and power integrity Work with product engineering and system engineering to debug and improve product yield", "key_qualifications": "- You should be familiar with signal and power integrity issues of high-speed serial interfaces\n- Experience working with the actual product package/board design and analysis, SI/PI methodology development, and lab correlation/validation of the simulation results\n- Excellent academic background and experience beyond graduate school studies\n- Familiarity with lab equipment, such as: VNA, TDR, real-time scope, spectrum analyzer, etc\n- Possess strong fundamentals in 3D/2D EM simulation tools and transmission line theory\n- Good communication skills", "preferred_qualifications": "", "education_experience": "-  BS and +10 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200462024"}