{"title": "Channel Fulfillment Analyst, Japan Market (12 Months Contract)", "summary": "The mission of Pacific Reseller Operations is to be the voice of Reseller Channel within Operations to ensure our products are in the right places at the right time, supporting Sales and our Partners to achieve Apple’s financial goals. We are passionate about running our supply chain as efficiently as possible, in order to maximise sell through while working towards a streamlined order fulfilment experience for our partners. Within the Reseller Operations team, the Order Fulfilment Process Analyst is responsible for using data to drive execution excellence in support of Apple’s weekly channel replenishment cycle.", "description": "-  Champion the country order fulfilment process for one or more routes to market and/or lines of business.\n-  Supervise trending of execution of critical metrics on weekly, monthly & quarterly and influence partners to drive accountability and improvements to target\n-  Apply analysis to identify key friction points in the order fulfilment process and influence corrective action to address issues at the source.\n-  Lead cross-functional initiatives that continuously improve the cost, quality, and speed of channel order fulfilment.\n-  Build and implement order execution plans for Peak Event and New Product Introduction (NPI) order execution.\n-  Coach and train Order Fulfilment Specialists on the standard methodologies to drive efficiency.\n-  Responsible for the internal process flow and SOP documentation\n-  Independently process orders/RMA and handle order exceptions (block management, NPI conversions, cancellation, credit/debit notes) according to SOP within set SLAs and SOX requirements", "key_qualifications": "3 years of meaningful experience in Operations role, preferable in Order Fulfilment (Retail or Online) and/or Logistics Services role.\nJapanese Language proficiency is mandatory as this role will support the Japan market directly.\nSelf driven, but a collaborator with the ability to build and strengthen relationships.\nExpertise in order fulfilment systems and processes.\nKnowledge/experience of working on SAP is an added advantage.\nDemonstrate extraordinary attention to details and ability to shine under compressed timelines\nVery comfortable analysing large data sets and visualising the “so what” to lead change and achieve results.\nAdaptable, flexible, positive and open minded to work in a dynamic, fast paced environment that undergoes constant change.\nCreative problem solver with familiarity with Process Improvement (e.g. DMAIC) and Project Management methodologies and frameworks is an added advantage.\nExperience in customs and/or regulations within Asian countries.\nStrong communications skills both written and verbal.\nExpertise on efficiency and reporting tools such as Excel is required.\nExperience with working on Business Objects, and Tableau is an added advantage.\nTakes initiative and challenge the status quo", "preferred_qualifications": "", "education_experience": "-  Bachelor’s Degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200472295"}