{"title": "GPU Cache Hierarchy Design Verification Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices.", "description": "As a GPU Cache Hierarchy Design Verification Engineer, you will be responsible for: Testing of major features and collaborating with other block and core level engineers to ensure flawless verification flow, Developing verification plans in coordination with design leads and architects, Architecting, building and maintaining verification test bench components and environments to validate architectural correctness of the design, Generating directed and constrained random tests, Running simulations and debugging design and environment issues, Crafting functional coverage points, analyze coverage, and enhance test environment to target coverage holes, Creating automated verification flows for block verification, Applying knowledge of hardware description languages (VHDL/Verilog), hardware verification languages/frameworks (SystemVerilog/UVM/OVM), and logic simulators to verify complex designs", "key_qualifications": "Strong knowledge of computer and cache architecture, Experience developing a unit or subsystem testing environment is a plus, Experience with memory/cache sub-system micro-architecture, which could include multiple levels of cache, coherent interconnects, MMUs or related blocks is a plus, Expertise in creating software solutions utilizing object-oriented programming concepts, Experience with verification and hardware description languages such as SystemVerilog, Verilog, and VHDL is a plus, Experience with a verification methodology such as UVM/OVM is a plus, Experience with HDL simulators and waveform viewers is a plus, Experience defining coverage space, writing coverage models, and analyzing results is a plus, Demonstrated success working under strict schedule deadlines with the ability to manage multiple priorities, Excellent interpersonal skills and ability to collaborate, GPU experience, especially in the cache/memory hierarchy area, is a plus", "preferred_qualifications": "", "education_experience": "Minimum requirement of BS degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449002"}