{"title": "Sr. EMI/PI Engineer – iPhone Engineering", "summary": "The iPhone Hardware Engineering team is seeking a hardworking electrical engineer for the position of Hardware Engineer - System Technologies. The ideal candidate will work with iPhone Hardware multi-functional teams to perform in-depth debug, modeling and simulation of sophisticated electric and magnetic effects in mobile systems design. Collaboration is key to success in this position. Come join the team!", "description": "-  Characterization and debug of results-oriented system level co-existence/RFI Desense issues\n-  Work with multi-functional teams to define design requirements for improved EM performance\n-  3D-EM and circuit modeling and simulations in the frequency and time domains.\n-  Ability to design and analyze power delivery networks including modeling of dc-dc converters, and their potential for EMI\n-  Simulation and analysis of system high-speed circuits for signal integrity and their potential for EMI\n-  Perform design feasibility study, design testing and verification, and system bring up.\n-  Provide design guideline and support to system architecture design, board layout, product bring up, debug, validation, and factory builds.\n-  Develop and improve design methodologies to achieve minimal EMI", "key_qualifications": "You possess experience in EE fundamentals and problems solving skills\nYou have strong academic background in EM theory and coupling mechanisms.\nYou will have experience in power and signal integrity\nAbility to relate electrical performance to physical layout\nDeep experience in 3D EM simulations for debugging and mitigating complex EM coexistence issues\nHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)\nHands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)", "preferred_qualifications": "", "education_experience": "-  MSEE/Ph.D", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200458272"}