{"title": "CPU Design Timing Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!", "description": "As the CPU Design Timing Engineer, you will be responsible for the timing closure of the project. Responsibilities include but are not limited to:\n\n• Working with the CAD team to develop the timing flow that will be used on the project including scripting to improve analysis flows and engineer efficiency\n• Working extensively with CPU micro-architects and implementation engineers to drive timing closure for the CPU", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience\nThe ideal candidate will have implementation experience on high-performance CPU designs including at least one project that includes ownership of timing analysis\nWorking knowledge of CPU microarchitecture including common critical loops for timing and understanding of low-power microarchitecture and implementation techniques for CPUs\nDeep knowledge of static timing tools and flows including how to handle multiple clock and power domains and other complex scenarios\nPhysical design knowledge of device physics and in particular aspects which impact timing (cross talk, noise, OCV etc.)\nPrior experience owning the timing flow on a major CPU or similar project\nGood understanding of physical design tools and methodology including but not limited to physically aware synthesis and place & route tools and flows, extraction, STA, and other analysis flows, and physical design verification (LEC, DVS, etc.)", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449766"}