{"title": "RF SoC Automation Tool Developer", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position! Individuals will work with PHY, MAC, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup.", "description": "-  Tool and software development for automating test equipment, on board circuitry, and device settings; server/client communication a plus\n-  Writing scripts that plot, parse, and analyze large data sets of data.\n-  Generating RF design/verification/test reports by working with RF, systems and integration teams.", "key_qualifications": "Strong software/scripting skills with background in Wireless RF systems fundamentals.\nSolid experience of building software tools and scripting to perform RF parametric testing such as EVM, RX sensitivity, ACPR, blocker testing, etc.\nUnix/Linux scripting knowledge with objected oriented programming experience such as Python is a requirement.\nStrong working knowledge of test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.\nProficiency with basic metrics for determining quality of digital communication signals measured.", "preferred_qualifications": "", "education_experience": "BS + 10 years of relevant experience. MS preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200451992"}