{"title": "Senior Machine Learning Software Engineer", "summary": "JOB SUMMARY\nDo you have a passion for building the best photo app experience in the world? iPhone is the most popular camera in the world! Seamless integration of software and hardware has delivered magnificent experiences like Photos Memories and Portrait Mode. The Camera & Photos team develops privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide. We are looking for an experienced Machine Learning Engineer to join our team to be part of this mission.", "description": "In this role, you will be working on ideating and developing privacy preserving AI algorithms and data processing pipelines for magical Camera and Photos experiences. Candidates should have a proven track record that demonstrates innovation, strong collaboration, excellent interpersonal skills, and a passion for designing and developing high-quality software.", "key_qualifications": "-  Exceptional problem-solving and interpersonal skills\n-  5+ years experience in building machine learning and deep learning based software solutions in a production setting\n-  Solid hands on experience with large language models and transformer based models\n-  Solid experience in one or more of the following areas - Search and Retrieval, Recommendations and Ranking\n-  Robust applied software methodology, process, and quality skills\n-  Proven ability to excel in a fast-paced development team", "preferred_qualifications": "", "education_experience": "M.S or Ph.D. degree in Computer Science, Electrical Engineering, or equivalent experience", "additional_requirements": "-  Experience writing Swift/Objective-C applications for iOS or macOS\n-  Experience optimizing ML and Deep Learning algorithms for embedded systems", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200493299"}