{"title": "Employee & Labour Relations Business Partner", "summary": "At Apple, we believe in hard work, a fun environment, and the kind of creativity and innovation that only comes about when talented people from diverse backgrounds approach problems from varying perspectives.\n\nThe people here at Apple don’t just build products — they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Employee & Labour Relations Business Partner (ERBP) provides consulting and direction regarding employee and labour relations matters to managers and employees throughout the organisation. The ERBP helps ensure legal compliance, and adherence to consistent application of Apple policies and practices across all lines of business.", "description": "-  Applying Apple values to support leaders and People team colleagues to resolve people challenges, including performance management, policy interpretation, business conduct issues, and terminations.\n\n-  Conducting independent and timely investigations into alleged workplace misconduct and policy breaches, including interviewing employees, creating concise investigation reports,making recommendations to leadership and tracking cases in the Apple management system.\n\n-  Coordinating Apple India’s Internal Complaints Committee, and supporting POSH compliance.\n\n-  Developing training and local policies ,when applicable, and communicating and implementing company-wide programs, policies, and procedures.\n\n-  Coordinating and leading responses to government audits, information requests and inspections.\n\n-  Identifying and supporting development of strategy to mitigate labour relations risks including monitoring the external environment.\n\n-  Using metrics with key stakeholders to highlight trends and developing strategies to cultivate positive employee relations in the business and to mitigate risk.\n\n-  Maintaining accurate case entry practices in ER case management systems.\n\n-  Supporting development and the execution of any ELR projects/programs including ER capability development as needed.", "key_qualifications": "7+ years of hands-on experience related to employee and labour relations.\nStrong knowledge of and experience with India’s labour relations system.\nExperience coordinating Internal Complaints Committees.\nDemonstrable ability to handle multiple priorities, partners and work streams.\nDemonstrable ability to work independently with Apple values aligned decision quality and independent judgement.\nStrong communication skills including effective listening, writing and presentation.\nStrong work ethic with a high degree of flexibility.\nAbility to operate in a high pace environment, requiring ability to quickly summarise issues at stake and practical recommendations to address them, especially with Global/Country Senior leadership.\nSelf starter with innovation, integrity and attention to details.\nVery strong partnership skills. Can connect with, and is open to connecting with, people at all levels of the organisation. Can cut through hierarchy, brings a very egalitarian and democratic perspective to the work. Treats everyone respectfully.\nApproaches work with a partnership and problem solving mindset\nExperience in a global firm, ideally with headquarters in the US.", "preferred_qualifications": "", "education_experience": "-  University qualification in law, business, or some other related discipline.", "additional_requirements": "- We are also open to hiring at Bangalore, Hyderabad or Mumbai for this role - though preference is for Gurgaon.\n- There will be some travel required to various Apple offices in India as per business requirement.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200490753"}