{"title": "Wireless PHY Standards Architect", "summary": "As a Senior Wireless PHY Standards Architect, you will be responsible for driving and designing the next generation of physical layer for wireless technologies. You will get to influence the standards process by participating in the meetings, making technical contributions, and driving company strategic interests. In addition, you will be responsible for creating new PHY layer IPs and developing innovative proprietary cross-layer algorithms for new and emerging applications. You will also actively work with internal teams to keep them apprised of the development and direction of the standards; help them define features, requirements, and architectures, generate new ideas and features, and achieve best-in class and robust product performance in all environments. In addition, you will collaborate with cross-functional teams to innovate, drive wireless architectures, incubate ideas for new generations of wireless communication systems, and participate in the development of emerging applications and devices. As a member of the silicon design group, you will be responsible for developing state-of-the-art wireless SoC products that are enjoyed by millions of Apple customers", "description": "Participate, contribute novel PHY technical concepts and ideas, influence, and generate consensus around company strategic interests in wireless standards organizations. Simulate PHY system level performance using simulation tools, such as MATLAB or C/C++, to validate PHY system performance of internal and external technical contributions. Analyze standards contributions to understand performance benefits, implementation complexity, and architecture and design tradeoffs. Work closely with internal teams to communicate standards development and direction, and develop alignment on standards strategy with company priorities. Define high-level PHY layer specifications requirements for internal teams. Develop, propose, and simulate innovative proprietary PHY algorithms and cross-layer systems for new and emerging applications. Design innovative PHY/MAC cross-layer algorithms to achieve robust performance in all environments. Work with cross-functional teams to innovate and achieve best-in class product performance", "key_qualifications": "Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB, or similar technologies. Strong familiarity with PHY algorithms and architectures of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies. In-depth knowledge on wireless communication systems, architectures, protocols and algorithms. In-depth knowledge of wireless communication techniques, such as SU/MU-MIMO, OFDM, OFDMA, beamforming, FEC, etc. Deep understanding of communication theory and signal processing. Must have strong analytical and problem-solving skills. Experience with MATLAB or C/C++ for modeling and simulations. Experience with PHY modem architecture, algorithms, and hardware design is a plus. Experience with PHY/MAC cross-layer algorithm design is a plus. Ability to present complex technical concepts in a clear and organized manner. Have a strong and proven leadership ability is a plus. Ability to work closely with and drive cross-functional teams. Self-motivated and passionate to solve problems in innovative ways", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 3 years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200482455"}