{"title": "RF Software Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product?\n\nAs a RF Software Engineer on the Cellular FW team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing innovative cellular SoCs! This position requires someone comfortable with all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements.", "description": "-  Design and Implement RF device drivers and RF software to control RF transceivers and RF front end components with detailed timing requirements.\n\n-  Design, develop and optimize the cellular modem processing algorithms pertaining to Baseband and RF components in a cellular system.\n\n-  Work with Baseband &amp; RF systems and hardware designers to define hardware architecture and software computing requirements.\n\n-  Work with multi-functional teams to lead dependencies while driving the key Radio features.", "key_qualifications": "Minimum BS with 3 + years of relevant industry experience\nKnowledge of mobile communications in 4G/5G 3GPP protocols and radio architecture and Interfaces.\nKnowledge of RF transceiver and RF front end components control for 4G/5G radio.\nUnderstanding of RF calibrations for compensating RF impairments.\nUnderstanding of design principles to meet tight real time deadlines a plus.\nDeep understanding of software engineering principles, and core computer science fundamentals.\nExcellent in embedded C/C++ programming, and working experience with compilers, build and source code control tools.\nExperience with using RF Test equipment for RF validation and debugging.\nProficiency with debugging in embedded software systems.\nFamiliarity with JTAG.", "preferred_qualifications": "", "education_experience": "Minimum BS with 3 + years of relevant industry experience", "additional_requirements": "-  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n-  We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200449703"}