{"title": "Signal Integrity - RF Integrity Validation Engineer", "summary": "Our RFI (RF Integrity) team develops novel methodologies to tackle coupling, spur, and coexistence issues in highly coordinated RF systems through simulation and lab debug. The engineering regime covers Silicon, package, module, PCB, and form-factor device. The working methods are constantly evolving and blurring boundaries of existing domains. As an RF Integrity Validation Engineer, you will address the isolation, shielding, coexistence, and space-saving challenges at chip, package, module, and system level through lab experiments. The team is small and the coverage is huge due to its multidiscipline nature. You will explore multiple aspects of RF technology and expand the boundary of innovation. If you like self-challenge and can thrive in an innovative and fast-pacing work environment, you might be the engineer we are looking for.", "description": "Collaborate with RFIC, Package, and product teams to debug chip or board level crosstalk/EMI/desense issues in RF system. Define/implement validation plans for RF transmitters/receivers. Use EM/RF knowledge, hands-on prototyping, and measurement to understand sophisticated sub-system interactions, implications to product level design, and manufacturing trade-offs. Develop test automation programs on different FW/SW platforms. Explore the testability of multi-radio coexistence/emission/desense in form-factor.", "key_qualifications": "-  Bachelors of Science degree and 3+ years of confirmed experience.\n-  Excellent problem-solving and skills in a dynamic and complex environment when the boundary is not clearly defined.\n-  Passion for learning new technology and willingness to do things differently to address problems.\n-  Broad experience with RF lab debug and characterization. Experience in bringing up a sophisticated radio system and measuring all performance metrics of key sub-systems.\n-  Experience with measurement automation tools and scripting languages such as Python or Matlab, etc.\n-  Experience with lab equipment such as spectrum analyzers, vector network analyzers, signal generators, phase noise analyzers, oscilloscopes, etc.\n-  Good analytical and interpersonal skills in multi-functional groups.\n-  Experience of RF PCB board design, debug, and development is a plus.", "preferred_qualifications": "", "education_experience": "-  BS and 3+ years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200464585"}