{"title": "Computer Vision Algorithm Engineer", "summary": "We are a team in Apple developing the state-of-the-art 3D computer vision algorithm for 3D reconstruction and 3D content generation. We are looking for talents with deep understanding in 3D computer vision algorithm and rich hands-on experience in building software system. Come and join us! In the team, you will work with multi-functional research and product teams in hardware and software to not only push the frontier of computer vision forward, but also build the best software system that can bring our technology to life and into customers hands.", "description": "As a part of the team, you will be involved in the developing and integrating computer vision algorithms blocks and systems on iOS and macOS. These blocks and systems serve as a foundation for the future Apple product. The candidates should have deep understanding on the whole stack of 3D computer vision and graphics algorithms, knowing the limitation and can-do of the state-of-the-art algorithms in order to make accurate design choice and have a proficient communication with other algorithm teams. The candidate should also have excellent software developing skills in not only implementing the algorithm, but also in code optimization on heterogeneous platforms, so you can write performant algorithms on mobile and desktop or transferring workload to accurate hardware and chips. Since we are doing something that is not solved by others, we usually need to develop tools that have not yet existed in the world, it requires the candidate to have experience and capability in designing and building extensible and practical computer vision system or algorithm frameworks from ground up.", "key_qualifications": "", "preferred_qualifications": "Self-motivated in learning new technologies and curious in new directions; Always seeking excellence in software engineering and architecture; Experience in developing 3D computer vision system on mobile platforms will be a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557283"}