{"title": "Account Executive, Brazil", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. We are, in many ways, the face of Apple to our largest customers! We are looking for an Account Executive to develop Bank partnerships in Brazil. You have the ability to consult and influence relevant levels of the partners' organization, gauge growth potential and new opportunities, reach ambitious goals and implement long term development plans based on a mutual commitment to grow Apple’s business, across iPhone and all other Apple product and services. You will be accountable to scale the Bank channel and successfully implement objectives through strong business partnerships. An engaging and collaborative work style, exceptional communication both verbal and written, highly self-motivated with a strong drive for results, as well as, extraordinary interpersonal and negotiation skills will be essential to succeed in this role. The ideal candidate must be a validated sales professional, be an excellent presenter, have strong analytical skills, and collaborate with all key relevant decision and execution levels in their account.", "description": "You will work to improve Bank and distribution (tier 2) channels performance across Apple products and services, by growing positive relationships at all levels within their organizations and understanding their focus areas, objectives, and priorities. Responsible for developing and executing account plan and business reviews for each assigned Partner to achieve aligned goals and supervise progress of all partner engagements with the account. - Conduct regular business reviews to identify gaps, opportunities, and assess progress.  - Gather, analyze and report business results and trends to Apple leadership team providing insightful recommendations. Work with key partners, internal and external, to drive demand-generation activities, identify new opportunities, coordinate fulfillment logistics, and improve the digital end customer experience. - Represent needs of the key Partner within Apple, identifying challenges and opportunities. Responsible to track issues or concerns and ensure they are addressed and/ or raised to appropriate levels. - Ensure that the Partners sales teams are trained properly on Apple solutions and are able to deliver a high level of customer experience. - Manage the sell-in process according to the potential demand properly in line with the partner view.", "key_qualifications": "8+ proven years of experience working in channel account management building sustainable, collaborative and trustful relationships. Ability to develop influential relationships with partner at different executives levels. Ability to define and communicate the Apple proposition in a persuasive, charismatic, engaging and confident manner. Proven creative problem-solving with an agile mind resulting in successful execution of plans that get results. The highest level of integrity, honesty, and accountability in all that you do, every single day. Ability to complete day-to-day activities autonomously, prioritizing to drive what matters. Keen analytical ability to convert data into business intelligence while staying focused on the overall objective. Strong attention to detail in all you do. High Proficiency in English, both written and verbal.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree. Masters degree a plus", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551912"}