{"title": "Strategic Sourcing Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it.", "description": "Successful SSMs thrive in a rapidly changing environment and constantly drive excellence across their own responsibilities as well as that of team members and partners. They frequently leverage strategic internal relationships to effectively collaborate with design, development and other Apple teams. You are able to make smart decisions with the information available, think and stay focused under pressure, and communicate concisely and effectively with senior management as well as peers. SSMs scale new and existing manufacturing partners as well as executing creative and strategic commercial deals to achieve goals around cost, supply, and quality.", "key_qualifications": " ", "preferred_qualifications": "Strong analytical/negotiation skills. Ability to toggle between strategic and detail orientated thinking. Tenacious problem solving & issue resolution skills. Excellent presentation and interpersonal skills. Flexibility to adapt to dynamic and rapidly changing environments. Excellent communicator, capable of working in multinational environments, driven and motivated by accomplishing extraordinary objectives. Hands-on experience in any of the following: product development, design, manufacturing practices/techniques, vendor management, or supply chain development. Must be a self-starter who is comfortable working independently. Must have experience working well with and ability to influence cross functional teams. Possess strong business acumen and experience managing strategic supply chains, cost models, and complex procurements. Procurement experience specifically with construction materials is a plus. Work with a team to manage proposals and change orders for projects. Track project on site date requirements and work with vendors to fabricate, deliver, and install on schedule. Support and troubleshoot store integration/installation issues worldwide. Develop new methodologies and processes to improve team productivity in key project management tasks. STRATEGY: Improve existing supplier strategy and support expansion of the supply base. Develop and implement overall supply chain strategy and be expected to manage executive level relationships with supply base. Travel as necessary to facilitate new supplier onboarding and ensure quality specifications are met for worldwide supply base. Partner with SCD and Development for cost and schedule efficiency opportunities. SUPPLIER MANAGEMENT: Run the resources and drive the distribution of RFP’s, contract negotiations and procurement for the commodity worldwide. Exercise individual judgment to lead pricing negotiations through supply base with support from cross-functional team members. Drive value-engineering initiatives for this commodity. Continuous research and education of key components and suppliers to review market trends applicable to improving the store environment. Negotiate contracts with minimal support and management review for key terms and conditions.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553647"}