{"title": "SAP SD Project Manager", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you deeply accountable for your work? A passion for product ownership and track record will prove critical to success on our team. Be ready to make something great when here. Multifaceted, encouraging people and innovative, industry-defining technologies are the norm at Apple. Join Apple to help deliver the next amazing Apple product. Apple’s Information Systems & Technology (IS&T) organization manages key business and technical infrastructure at Apple-- how online orders are placed, the customer experience with technology in our retail stores, how much network capacity we need around the world and much more. A successful candidate will have the chance to work with diverse business teams, group of leads and engineers, while being exposed to insights that help drive our business across Apple Services Engineering, Hardware, Retail and Finance teams. Extensive experience in leading mid to large sized SAP projects and having experience in system design and configuration of SAP BRIM, SAP SD or SAP RAR modules is required. This is a tremendous opportunity for someone who has the skill to own initiatives and a passion to work in a highly integrated global solution platform! Join us in crafting solutions that do not yet exist!", "description": "We are looking for someone who has in-depth knowledge of the latest SAP landscape, SAP Sales and Distribution module and its integration with other modules. Candidate must have hands-on experience on project implementations and be familiar with SAP S4 HANA and related new generation technologies. As a part SAP design governance team, the candidate will be working closely with our business and functional teams to review systems solutions and craft program roadmaps. PRIMARY RESPONSIBILITIES WILL INCLUDE: -  Seamless integration of SAP SD to front end (B2B e-Commerce, Apple Online Store (AOS), Point of Sale (POS), Apple Care) and other back-end solutions (SAP Retail, Data Warehouse). -  Performing functional and technical analysis of the requirements and review design/technical solution. -  Coordinate with project PM or Track leads to ensure that design is aligned with Apple design governance. This role is an opportunity to do more than you ever thought possible, while making an impact on globally recognized products and brand.", "key_qualifications": "10+ years of SAP functional experience in OTC business process, SAP SD configuration, development, and E2E Integration with MM and SM modules\nThree full life-cycle implementations of SAP OTC related projects for a global, multi-national corporation\nMinimum 4-5 years of configuration experience in SAP SD module in the areas of Sales, pricing, ATP, and credit management.\nGood communication, effective leadership, excellent knowledge of SAP SD modules to work on complex, global and multi-functional projects.\nKnowledge and experience of SAP S/4 HANA architecture including core functionalities and migration.\nAbility to work efficiently in ambiguity across business and IT teams.\nUnderstanding of ABAP/4 development code reading and debugging and SAP applications data dictionary and table design\nExposure to SAP technologies such as Business Rules framework, Enterprise Portal, iOS, UI5, Fiori, Webdynpro", "preferred_qualifications": "", "education_experience": "Bachelor's or Master's degree or equivalent experience.\n", "additional_requirements": "SD service management functional/project lead role (service notifications, service contracts, quotes, order generation and processing, pricing, contract management) will be an advantage.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539586"}