{"title": "Executive Studio Support Engineer, Enterprise Systems", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming phenomenal products, services, and customer experiences. Imagine what you could do in your career when merging passion and dedication. This is how dreams come true. Are you passionate about crafting elite support experiences? Do you thrive in environments that require multi-functional thinking, collaboration, and innovation? Do you have experience troubleshooting technical issues via omni-channel support options and communicating solutions to customers? If so, this may be the job for you. The AppleTV+ IS&T team is responsible for the technology strategy, delivery, and sustainment of the IT systems used to enable AppleTV+ Studio and Production operations. The team ensures technology and business strategies remain tightly aligned through multi-functional partnership, knowledge of industry trends, and familiarity with the Apple corporate systems landscape. Members work closely with leadership, business collaborators, engineers, vendors, information security, and others to deliver a technology ecosystem that meets the demands of a high-growth organization.", "description": "As the Executive Studio Support Engineer you will be responsible for the Tier 1, 2, and 3 support of our AppleTV+ studio (corporate) clients. This includes the troubleshooting of our hardware and software assets, account setup and support, and ticket management. This role is the frontline of Production Technology Operations Studio Support and, as such, is encouraged to bring Apple’s outstanding and amazing level of service to our studio clients. A strong drive for outstanding customer service coupled with attention to detail is critical to success.", "key_qualifications": " ", "preferred_qualifications": "Use Help Desk ticket management software to coordinate support tickets, Respond to customers via written, voice, and video communications, Troubleshoot Macs, iOS devices, monitors, printers, and other technology assets deployed to the studio members, Provide support for MacOS, iOS, and internally deployed software, Provide basic system account management, Diagnose and troubleshoot issues related to basic network connectivity, Provide remote support to production clients via written, voice, or video sessions, Provide a best-in-class and unique white glove Apple experience to Apple TV+ clients, Maintain close relationships and collaborate with Apple TV+ productions, partner teams, and IS&T departments, Develop and maintain a solid understanding of trends and standard processes within Apple", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553721"}