{"title": "Senior PR Manager, AI/ML", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish! Apple's worldwide communications team informs the world about the Company, our innovative products and services, and the values that drive our company. The team includes professionals with backgrounds in public relations strategy, journalism, buzz marketing and event production. We’re looking for trailblazing, collaborative professionals from a variety of creative fields. If that’s you, then your next home may be here. Come and do the best and most exciting work of your career at Apple!", "description": "We are currently seeking a Senior PR Manager to join our corporate communications team. This person will be responsible for proactive and reactive communications for Apple’s Artificial Intelligence and Machine Learning (AI/ML) work, which includes Siri, new Apple Intelligence features across all Apple products and services, and other projects. Responsibilities include driving strategy, planning and execution of major product PR programs and initiatives, monitoring and analyzing developments in the news, and identifying and managing issues in a dynamic environment and continuous news cycle. Candidates should have strong media relations skills, the ability to craft product messaging and compelling media stories, create communications programs, manage launch events and drive consumer momentum across key products and features. In this role, the Senior PR Manager will collaborate and coordinate with Product Marketing and Engineering teams to develop PR programs, messaging and media stories. Candidates should have experience in the AI/ML space and the ability to understand complex technology and translate it into compelling stories for both tech and consumer media.", "key_qualifications": "", "preferred_qualifications": "A positive team-player attitude and passionate about consumer technology. Natural self-starter who demonstrates creative and critical thinking abilities, can focus and execute, with an eye for details. Effective collaborator who will work cross functionally across teams and geographies while demonstrating integrity at all times. Able to handle multiple projects and thrive in a very dynamic environment. Excellent writing and editing skills, verbal communications skills, and detailed project management skills. Strong interpersonal skills, experience in building consensus and driving collaboration by building positive relationships and using data. Ability to quickly analyze media coverage and sentiment, see around corners and apply insights to the team’s work. Bachelor's degree is preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $179,000 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560137"}