{"title": "SoC Correlation Product Engineer", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). Joining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology.", "description": "-  Perform measurements that directly impact SoC power & performance for various next generation products.\n-  Work on groundbreaking technologies & new designs and collaborate with multiple multi-functional teams including design, validation, test, manufacturing, system test & software to identify issues and implement corrective actions.\n-  Work closely with ATE and software teams to identify & develop case tests, benchmarks to be used in production testing, and characterization.\n-  Characterize multiple test setups, correlate to ATE and optimize production screening guardband for each system individually.\n-  Define characterization plans, perform statistical data analysis and drive correlation & data reviews across multiple cross-functional teams and sign off on all silicon characterization activities.\n-  Multi-task and manage multiple programs at different stages.\n-  Central point of contact for multiple teams with direct impact on product.", "key_qualifications": "Experience with system level characterization using functional / virus like worst case use cases & correlating to ATE.\nUnderstanding of PDN impact on Vmin, ATE test content, system level test programs/ functional content and test hardware.\nExperience working with and driving cross functional teams.\nStatistical data analysis tools to perform high volume characterization & production data analysis.\n5+ years meaningful experience.\nExperience in scripting (Python, JMP, PERL etc.) is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor's degree and a minimum of 3 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549511"}