{"title": "Sales - Account Manager (SAGE)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish! The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple’s Sales organisation generates the revenue needed to fuel our ongoing development of products and services. This in turn enriches the lives of hundreds of millions of people around the world. Our sales team is, in many ways, the face of Apple to our customers. Apple expects innovation in every part of the company, and the Sales team meets that challenge by identifying and crafting new commercial models for Apple products and services. The areas of work span, but are not limited to new business development, partner and channel management, team leadership, and collaboration. As the SAGE Account Manager, you will join our fast growing Distribution Sales team based in Singapore and managing values added distributor to grow in market demand. The position plays a meaningful role in Apple’s sales performance and growth in SAGE. You will collaborate closely with internal and external partners to build account/country/regional plans and programs that scale the business across a broad product & services portfolio. Are you ready to do your life's best work here at Apple?", "description": "-  Grow in market-demand for the Apple ecosystem, and expand Apple's business and mindshare within channel partner sales teams. -  Create and implement account/country/regional plans to achieve/overachieve quarterly business objectives, as well as key initiatives across different routes to markets in the territory (distributors, carriers, retail, open channel). -  Identify demand generation/promotional opportunities to optimise sales performance, negotiate commercial arrangements, and drive execution against agreed plan. -  Build and maintain channel structures that provide a great customer experience coupled with sustainable profitability for partners. -  Ensure efficient channel performance through ongoing analysis of sales data to understand performance, identify growth opportunities, and maintain an effective sales partnership. -  Work with distributor and retailers to develop and deliver services that compliment the sales plan and help add to the customer experience. -  Coordinate below the line marketing activities with the carrier ensuring compliance and appropriate use of Apple creative assets provided by Apple Marketing teams. -  Drive channel programs to ensure excellent customer experience and partner mindshare. -  Ensure compliance with the Apple retailer/distributor/carriers iPhone agreements. -  Develop and maintain broad relationships with key partners, developing a strong understanding and alignment with their respective focus areas, value drivers and strategic priorities. -  Work collaboratively with key partners to ensure competitive positioning of Apple Products in all market offers. -  You will always represent the Apple brand to the highest level.", "key_qualifications": "Experience in setting up, growing, and leading open channel/value added distributors in emerging/mature markets, driving conversion and in-market demand. Experience in leading carrier/vendor strategic planning and carrier/channel partner commercial engagement at a whole of country/regional level. Deep knowledge and understanding of the telecommunications, IT & mobile device markets and ecosystems. In-depth understanding of distribution business models, history, economics and underlying value drivers, with proven commercial savvy & analytical capabilities. In your experience, you’ve balanced delivering on short-term goals, while crafting sustainable value for customers and partners, and demand for the future. Extensive experience building and maintaining relationships with large and complex organisations. Clear ability to influence others and navigate diverse and demanding partner groups including C-suite. Confident and articulate communicator. Able to present insights, proposals and drive conclusions in an engaging manner. Capable of working autonomously yet able to build, develop, and harness strong internal and external networks. Ability and drive to encourage cross-functional teams to programmatic delivery excellence. Experienced in delivering successful outcomes through internal and external collaboration.", "preferred_qualifications": "", "education_experience": "We anticipate you will have a MBA/Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537083"}