{"title": "Sr. iOS Engineer - Apple TV", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Home Platforms Software Team creates solutions for the home, from building incredible movie watching experiences to building the ecosystem to allow Apple devices to work better together. Join the team to see what else is possible!", "description": "The tvOS team is responsible for the underlying system that powers the Apple TV experience. If you’re passionate about writing code and working with a world-class engineering team, come and work with us. As a self-directed iOS Engineer who is prepared to tackle complex problems and drive full-product solutions, the position requires a focus on high quality and performant code (both UI and infrastructure) to allow applications to shine.", "key_qualifications": "5+ years experience in commercial grade software development, Ability to write clear and high-performance code in Objective-C, Ability to analyze large features and implement practical solutions, Passion for quality and close attention to details, Strong communication and interpersonal skills, Ability to deliver proven work on tight schedules, Aptitude to independently learn new technologies", "preferred_qualifications": "BS CS/CE/EE or equivalent experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, reimbursement for certain educational expenses, discretionary bonuses, and relocation. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556369"}