{"title": "Machine Learning Project Manager - SIML, ISE ", "summary": "Would you like to contribute to generative AI and transform how people interact with AI technologies? Do you believe Machine Learning and AI can change the world? We truly believe it can! We are the Data Team of the System Intelligence and Machine Learning (SIML) group within the software engineering organization at Apple. We are responsible for building high-quality ML datasets at scale, used to train ML models that power AI-centric features for many Apple products (iPhone, iPad, Mac, Apple Watch, and even AirPods). Such features go from the smart wallpaper on your iPhone Lock Screen to the models that highlight the faces of your loved ones in your Photos app to input experiences (e.g., autocorrect, next-word prediction, handwriting recognition). We are looking for a talented individual to drive Data Programs supporting ML features, in close collaboration with our R&D partners, and to run the corresponding data projects end-to-end (collection & annotation). We invite you to join us at this exciting time!", "description": "Our SIML Data team focuses on data acquisition, data synthesis, data science, annotation, and data QA. Each year, we power dozens of features and work closely with ML teams across the Software Organization. Apple's commitment to deliver incredible experiences to a global and diverse set of users in full respect of their privacy leads our team to explore innovative ways of collecting and annotating data. This role is responsible for overseeing the end-to-end process for our R&D partners machine learning data needs; from conceptualization to completion, and ensuring that the data delivered to R&D meets Apple's rigorous quality standards. THIS INCLUDES: Collaborate with R&D partners to understand and define their data requirements from inception to delivery, Design and implement ML Data Ops strategies optimized for each feature (collection and annotation), including the identification and sourcing or creation of necessary tooling, equipment or crowd, Drive enhancements of data operations (increase scalability, diversity and quality, reduce cost and lead time), through innovative workflows that combine human and machine computation (leveraging capabilities of ML and foundation models), Work closely with privacy, legal, procurement, and product security teams to identify and clear options considered for data operations, Thoroughly scope projects, estimating timelines, cost, and identifying potential challenges in advance, Coordinate data program across internal data functions (data engineering, data science, QA) and other partners, Establish clear guidelines, and training material, Collaborate with vendors to ensure tasks are calibrated appropriately; track and report on quantity and quality metrics Grow fast and positively impact multiple critical features on your first day at Apple!", "key_qualifications": "You exhibit excellent program/project management, communication, interpersonal, analytical, and organizational skills, A talent for creating ML datasets focusing on end-to-end user experience by foreseeing issues, handling edge cases, and removing bias while ensuring inclusion and fairness, Proficient in problem-solving and critical thinking, with a focus on innovation and continuous improvement, Scripting skills (Python) to automate tasks, compute metrics and explore use of workflows combining ML and human inputs, Self-starter, able to handle ambiguity, identify risks, troubleshoot, and find the right people and tools to get the job done, Capacity to multitask and manage multiple projects in parallel while meeting deadlines, and maintaining clear and effective communication with stakeholders", "preferred_qualifications": "", "education_experience": "Bachelors degree in Computer Science, Mathematics, Physics, or a related field; or equivalent practical experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $56.65 and $85.52/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547900"}