{"title": "CPU Implementation Feasibility Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products! Apple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation.", "description": "As an Apple soft-IP CPU Implementation Feasibility Engineer, you will be working for RTL feasibility, PD feasibility including tech/CAD work and PD methodology work. You will be responsible to provide technical guidance to FE/BE design of other. IPs Responsibilities also include but are not limited to: •Making area/frequency/performance/power trade-offs and •Driving RTL-to-GDS flow through synthesis/place-and-route with ambitious goals for power, performance, and area •Working with multi-functional engineering team to implement and validate physical design on the aspects of timing, area, power, testability, and reliability •Performing different floorplanning experiments to understand the microarchitectural feasibility for achieving high targets for performance, power and area •Performing different feasibility experiments for RTL innovations and improvements that drive the next generation high performance chips •Working on PD methodology customized for CPU architecture •Driving discussion with FE/BE designers in other IPs", "key_qualifications": " ", "preferred_qualifications": "The ideal candidate will have implementation experience on high-performance CPU designs. Experience with Logical Equivalence checking (LEC) tools", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557373"}