{"title": "Assisted Sales Senior Manager - Retail Customer Care", "summary": "Japan Assisted Sales Senior Manager is responsible for the leadership, development & commercial success of the Retail Customer Care (RCC) teams within the Japan region. Partnering with key Retail partners and extended Apple partners, you will lead our teams and design strategies to deliver outstanding customer experience! Our Sales Specialists interact directly with our customers in a pre-sales environment, understanding their needs to build thoughtful solutions. Apple customers connect with RCC through various inbound channels; including Phone, Chat and then after the product has been delivered via our outstanding Online Personal Setup sessions. As a member of the RCC Regional Leadership team, you will demonstrate strong cross-functional leadership skills, demonstrating your track record of outstanding communication, planning, execution and analysis to drive new and existing programs, while improving excellence in both the customer and employee experience.", "description": "-  Lead and develop the teams responsible for commercial performance of all Apple products, focusing on program design, implementation and performance -  Plan, implement & measure Sales strategies to drive targeted demand into RCC, building a pipeline of opportunities across Consumer, SMB and Education customer segments -  Engage with key Retail partners from Digital, Finance, Demand Generation, Operations and Retail field teams to deliver a seamless, cross channel Apple experience -  Cultivate a positive and motivating work environment by promoting teamwork and excellence in execution while encouraging deep connections with the community -  Actively drive employee development, demonstrating tools such as Exchange Journal, Talent Map and competencies, partnering with both HR and RCC leadership -  Develop and maintain a culture of continuous feedback with your organisation -  Manage the RCC Sales budget; such as expenses, staffing, travel & SPIFF's -  Manage your time to effectively participate business meetings, including evenings and weekends as necessary, particularly during NPI", "key_qualifications": "5+ years senior leadership experience in a large (100+seat) or multi-site contact centre environment or equivalent leadership environment. Demonstrated strategic leadership, equally as strong analytically as creatively. Ability to balance strategic leadership approach with near-term, long-term, detailed day-to-day operational imperatives. Demonstrated ability to work on complex issues where analysis of situations and data requires an in-depth knowledge of the business and its performance. Experience working with human resources in areas pertinent to employee management such as performance, welfare and development. Ability to partner across organisation to bring the groups together. Experience presenting to the global senior leadership teams.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551888"}