{"title": "Full Stack Software Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Partner Solutions & Engineering team is looking for a highly qualified Software Engineer experienced with building large-scale distributed systems. This is an outstanding opportunity to join a focused team and work collaboratively with other groups to make a significant impact on our product.", "description": "This role demands the best and brightest; the ideal candidate will be self- motivated, accountable, technically strong and offers a diverse skillset that aligns with the key qualifications listed above. You love working in a dynamic fast paced environment, building and maintaining strong working relationships with a variety of partners, including business partners, application owners, project managers, technology and infrastructure teams to get the work done. You naturally take a deep interest in working closely with business partners to drive the product feature and technology roadmap beyond the first release.", "key_qualifications": "Strong experience of designing and developing large scale distributed cloud applications using advance Java. Proficient in front end technologies like Javascript, HTML, CSS, and any of the JS frameworks like React, Angular. Experience in crafting and implementing RESTful API and services. Experience with relational databases and NoSQL databases. Strong experience in Object Oriented programming and excellent debugging skills. Aptitude to independently learn new technologies. Excellent verbal and written communication skills is required", "preferred_qualifications": "Hands on experience in implementing end-to-end machine learning projects. Experience of working and delivering as a Scrum Team. Prior Scrum Master experience will be an advantage. Experience with container based workloads and their orchestration (Docker, Kubernetes) desired as well as surrounding DevOps/CI/CD tools and processes (Jenkins, Spinnaker and similar). Experience working on complex problems and distributed systems where scalability and performance are extremely important", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558619"}