{"title": "SE-Business Expert", "summary": "Du ger Apple Stores företagskunder tillgång till allt de behöver för att kunna driftsätta Apples lösningar i sina verksamheter. Som Business Expert hjälper du dem att lära sig om Apples produkter och att utforska olika möjligheter. Du ingår i ett team som brinner för att hjälpa företag till nya framgångar. Du har god insikt i företagens behov, brinner för Apple och stimuleras av att kunna erbjuda kunderna kraftfulla och innovativa lösningar. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa.", "description": "Som Business Expert presenterar du Apples lösningar, teknik och tjänster för företagskunder. Du tillbringar tid i butiken med nya och befintliga företagskunder och lär känna deras behov. Du skapar nya öppningar, bygger relationer och tar kontakt via telefon eller genom workshops och evenemang i butikerna. Du upptäcker vilka behov kunderna har genom presentationer och samarbetar med företagsteamet för att förbereda och presentera offerter. Du tar tillsammans med företagsteamet fram skräddarsydda lösningar för kunder med komplexa behov. Dessutom informerar du om och erbjuder kunderna vår kompletta uppsättning sälj- och supportlösningar. Du bidrar till såväl Apples som kundernas framgångar genom att väcka kundernas intresse för allt som Apples teknik har att erbjuda deras verksamhet.", "key_qualifications": "", "preferred_qualifications": "God kännedom om vad olika företag använder sig av för slags teknik och vilka lösningar Apple kan erbjuda dem. Bekväm med att samtala med kunder på telefon och informera om olika företagslösningar. Förmåga att hålla i olika företagsaktiviteter, som presentationer, workshops och evenemang i butikerna. Bidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra. Förverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet. Du har erfarenhet av försäljning till företagskunder. Du känner dig bekväm med att ta kontakt per telefon. Du har stor social kompetens, är skicklig på att genomföra presentationer och uttrycker dig ledigt såväl i tal som i skrift. Du talar det lokala språket flytande. Du kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535033"}