{"title": "AIML - Language Expansion Engineer, Siri and Information Intelligence", "summary": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? Play a part in the next revolution in human-computer interaction on all of Apple’s Platforms: iPhone, iPad, HomePod, Mac, Watches, TV, Vision Pro across dozens of languages. Contribute to a product that is redefining mobile computing, and work with the people who created the intelligent assistant that helps millions of people get things done—just by asking. Join the Siri Response team at Apple. The Siri Response team is looking for exceptional engineers passionate about machine learning, and unlocking the full potential of ML techniques to improve Siri’s voice, responses, and user interactions.", "description": "Take part in bringing the best possible Siri to as many users and use cases as possible. As a Language Expansion Engineer, you’ll have the opportunity to have end-to-end ownership for the development of Siri for multiple locales, from voice, to language, to character— you will be a central point of contact, synthesizing and guiding the contributions of all relevant teams and contributors. You'll develop workflows and frameworks for building, fine-tuning, optimizing ML models for text processing, acoustic, and natural language generation models. You'll utilize a suite of tools to efficiently analyze errors and systemic issues impacting Siri in all locales. Lastly, you'll implement your ideas directly in our TTS engine in production. Hundreds of millions of users will experience your contributions through more natural and expressive Siri on Apple products.", "key_qualifications": "3-5 years experience working in text-to-speech, speech recognition or related fields. Experience in voice building, testing, tuning pronunciation, recording scripts, normalization, and/or other text processing models. Ability to craft, conduct, analyze, and interpret experiments and investigations into model performance and quality. Experience in data science is a plus. Capable of driving projects of varying sizes and scopes, and ability to dig deep. Strong communication skills and the ability to naturally explain difficult technical topics to everyone from data scientists to engineers to business partners. Ability to implement experiments using scripting languages (Python, bash) and tools written in C/C++. Solid understanding or experience working with standard ML algorithms and toolkits. Ability to lead a team and collaborate for a cross-functional product.", "preferred_qualifications": "", "education_experience": "Master's degree or higher in Computer Science, Computational Linguistics, or a related field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,731 and $204,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537026"}