{"title": "AppleCare BPR Manager, AppleCare Supply Chain & Logistics Portfolio", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just craft products—they build the kind of wonder that has revolutionized entire industries.", "description": "As a BPR Manager you will: Perform all leadership activities for staff, including recruitment, performance evaluations, professional development, and career goal setting, with a deep dedication to inclusion, diversity, and equality...", "key_qualifications": "4 years leading and developing teams. 6 years leading medium to large-size, global cross-functional projects. Experience leading technical project managers and program managers. Steady leader who maintains awareness of big-picture objectives while helping teams navigate the details. Track record demonstrating thought leadership, innovation, and efficiency in influencing others. Hands-on approach with the ability to dive deep into project details as needed. Proven track record of managing to deadlines and meeting budget constraints. Effective in managing escalations and resolving conflicts. Able to facilitate executive-level cross-functional meetings and negotiate successful outcomes. Bachelor’s degree or equivalent work experience. A graduate degree is a plus.", "preferred_qualifications": "Experience with systems implementations (e.g., SAP, CRM, O9, and reporting & analytics). Proficient knowledge of the software development life cycle (SDLC). Strong communication, analytical, and time management skills. Passion for motivating and encouraging teams to do their best work. Excellent organizational and documentation skills.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $184,300 and $277,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556261"}