{"title": "Senior Real Estate Manager", "summary": "Imagine what you could do here! The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. Join Apple, and help us leave the world better than we found it! We’re a diverse collective of thinkers and doers, continuously reimagining our products and practices to help people do what they love in new ways. That innovation is inspired by a shared commitment to great work and to each other. Learning from our people here means we're learning from the best! The Real Estate, Design, and Merchandising (RDM) team create and care for Apple Stores that look, feel, and function as beautifully as our products. We do this by obsessing over the employee and customer experience, and driving a Global Real Estate strategy that sets the bar. We are looking for a Senior Real Estate Manager who is experienced in all areas of retail leasing, portfolio and property management. The Real Estate Manager role is essential in delivering the Five-Year Plan as well as deliverables needed to maintain and manage the existing portfolio of stores in the fleet. Join Apple and help us leave the world better than we found it! Ability to work cross-functionally with internal and external partners to drive and deliver real estate plan. The position is based in Hong Kong, reporting to the Geo RE Lead, and will require extensive travel. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work.", "description": "Responsibilities include strategic site selection, portfolio management including negotiating multi-million dollar retail leases, renewals, property valuations, P&L optimizations, property assessments, Landlord lease obligation issue resolution, and supporting retail store team needs with mall/property management. Skilled in planning, tracking, evaluating and reporting on work and deliverables. * Skilled in the leadership and management to develop, negotiate and implement complex real estate transactions, negotiate new and existing lease agreements, as well as secure internal approvals by working cross-functionally to solve and bring closure to complex issues within capital plan. * Proven experience to source opportunities, analyze locations and market information, build business models with financial sensitivities, provide feasibility options and business justifications, and can recommend the best options for optimal market performance and brand impact. * Drive project life cycle through lease execution and landlord delivery. Responsible to align and collaborate cross functionally with a diverse group of partners and present projects to leadership. * Work with and represent Apple for external city/ heritage/ authority/ official partners to ensure compliance and approval by all governing bodies, works councils and relevant parties. * Proactively manage real estate portfolio by tracking and reporting on upcoming lease events, critical project milestone dates and other initiatives that require real estate involvement to deliver. * Resolve landlord lease issues with cross-functional partners and ensures compliance by Landlord. * Completes Store Audits to evaluate location environment and ensures lease compliance. * Foster and maintain excellent relationships with landlords, developers, and other retailers. * Responsible for in depth market trips for senior leadership, as required. * Manage external broker network as required. * Contributes to an inclusive environment through respecting each others’ differences and having the curiosity to learn The role requires the ability to work cross-functionally with internal and external partners to drive and deliver real estate plan. The position is based in Hong Kong, and will require extensive travel.", "key_qualifications": "", "preferred_qualifications": "15+ years of experience in retail real estate or development work, Comfort negotiating with C-Suite representatives of Landlords and other partners, Energetic and flexible; motivated and able to work in fast and dynamic organization, Can work independently and as part of a team, Extensive expertise in negotiations, lease contracts, financial modeling, project management, lease optimization, issue resolution, planning, reporting, Experience handling internal approval processes, alignment among internal teams and managing external partners, Strong financial, analytical, and leasing experience, Elevated written and verbal communication as well as presentation skills, Ability in additional languages (Chinese, Japanese, etc.) is desirable, Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559405"}