{"title": "Technical Programs Manager - Apple Operations", "summary": "Apple is a place where extraordinary people gather to do their best work. At Apple, we craft products and experiences people once couldn't have envisioned, and now can't imagine living without. If you’re excited by the idea of making a real impact, a career with Apple might be your ideal job. Just be prepared to dream big! We believe that collaboration is one of our key strengths, and every day we will connect you with your peers and colleagues, at one of the most diverse companies in the world. As an individual, you'll be a key player within the Apple Operations team who are looking for an experienced leader whose role will be to lead a talented team of project managers and data analysts, delivering automated solutions and business insights. These solutions play a valuable role in the Apple supply chain end to end from capex and component Procurement through to manufacturing. This is a hugely important and evolving area at Apple where there is significant investment and enhancement taking place. The role has high visibility with senior Procurement, Operations and Finance stakeholders. Primary role will be to manage the asset tracking team and program as well as supporting the component (BuySell) and strategic procurement pillars of Apple Operations.", "description": "-  Lead a team comprising of project managers and data analysts to deliver outstanding results at a fast pace. - Perform all leadership activities including recruitment, performance review evaluations, professional development, and career goals. - Work with key partners Regionally and Globally to ensure successful operations to a high standard with a strong focus on quality and data integrity - Maintain a level of constant and effective communication with managers, leaders, and subject matter experts in a variety of business, functional and technology areas. - Maintain alignment between the technology and business strategy by proactive partnering with all levels. - Act as a liaison between business and technology groups to ensure system issues are resolved in an effective manner - Allocate resources appropriately while balancing business needs and priorities. - Coordinate the assignment of tasks to team members, ensuring documentation is available and facilitate clear communication of task status - Strategic and innovative attitude and proactive in identifying continuous improvement initiatives with stakeholders. ", "key_qualifications": "", "preferred_qualifications": "Bachelors degree in Business, Finance or Computer Science and /or Master level an advantage.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556255"}