{"title": "Senior Privacy Engineer - App Store, Media Apps & Services", "summary": "Apple delivers great features and great privacy. Privacy Engineering works with teams all across the company to make sure that Apple’s products and services protect user privacy as well as create industry-leading privacy-preserving features. We design architecture that reduces the exposure of user data at all levels of the technology stack by applying privacy enhancing technologies, cutting edge techniques from academia, and innovating on new solutions. We work with engineers across Apple to develop privacy features like App Tracking Transparency, Nutrition Labels, Privacy Relay as well as functionality to make it easier for App developers to build privacy into their apps.", "description": "We are looking for an experienced engineer who will focus on App Store and Media Services & Apps (e.g. Music, Podcasts) to join the Privacy-Preserving Services Architecture and Analytics team within Privacy Engineering. In this role you will: - Review features to identify privacy exposures, provide guidance to engineers and leaders on the right privacy technology to use, and partner with teams to design mitigations - Audit new products to identify bugs in development, and review customer data collected by engineering teams to drive decisions for privacy impact - Communicate privacy risks and potential mitigations to senior leadership to drive decisions - Guide the development of data collection systems that enable understanding of feature usage, conversion, subscription retention while preserving privacy - Identify emerging privacy threats - Partner with technical experts in ASE to develop our roadmap for privacy architecture patterns for services and their analytics systems At Apple, we’ve always believed that your data belongs to you and no one but you. That’s why we’re dedicated to helping you safeguard your privacy and keep data under your control. We’ve pioneered technologies that safeguard user privacy and introduced dozens of features that help keep your data safe, ranging from strong encryption in services like iMessage and Private Relay, to requiring user permission for apps to access your data or track you, to on-device processing and machine learning that powers features like Apple Intelligence. Successful candidates will need to have superb communication skills, a passion for protecting privacy and educating others about privacy. Creative problem solving, analytical, and deductive reasoning skills are critical for this position. You will be working on multiple unrelated features each week, so the ability to learn quickly, context switch, and an excitement for new things is a must.", "key_qualifications": "", "preferred_qualifications": "Passion for customer privacy, Strong collaboration, communication, interpersonal, and organizational skills, Ability to learn and research new technologies rapidly, assess privacy exposures, and recommend mitigations, Ability to analyze systems’ architectures for privacy impact, Ability to solve complex problems independently, Experience providing privacy guidance to services and analytics systems, Programming experience", "education_experience": "BSCS or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200522129"}