{"title": "Software Engineering Manager – Backend and Infrastructure", "summary": "The documentation engineering team is responsible for creating developer tools and framework-level support for the documentation workflows in Xcode, Swift Playgrounds, and the developer website. We're looking for a software engineering manager to manage the backend and infrastructure team – the team is responsible for the services, infrastructure, API's and data stores that power documentation both internally and externally at Apple. The ideal candidate wants to tackle big problems, has a vision for the product, and cares about getting the little details right. As a manager on this team, you will be responsible for leading the design, development and delivery of backend systems and infrastructure that 3rd party developers and Apple engineers will use every day. This is an excellent opportunity to work with us to build an extraordinary development team and deliver high quality products. We are looking for an individual with a strong desire to learn. Nobody is expected to have experience with all the skills below, we value candidates from all experiences and backgrounds. Please don’t hesitate to apply if you don’t meet all of the below criteria.", "description": "This will be your opportunity to be part of a highly motivated team who build-first class developer tools and apply them in innovative ways. Our team is diverse, dynamic and passionate about the products we build. Your responsibilities include: - Participate in product development discussions and map functional requirements to a technical design and a project schedule - Track delivery schedule and related dependencies - Write detailed architecture and design proposals - Communicate with external teams on various aspects such as technical design, project schedule, and project status - Participate in design and code reviews produced by engineers - Drive quality improvement initiatives and processes - Grow team by hiring great and diverse engineers - Provide growth opportunities by mentoring / coaching engineers in the team", "key_qualifications": "Experience shipping high quality user facing products and features, Experience with: API Development, Databases (relational and non-relational), Infrastructure and System Design, Experience fostering a collaborative and inclusive environment, Ability to understand problems and designs at a very low level, with the expectation to contribute to and challenge decisions related to architecture, development, and operational processes, Ability to communicate with cross-functional teams about various engineering topics such as system architecture, detailed design, APIs, project schedules, testing strategies, etc.", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science, Computer Engineering, Informatics (or equivalent experience)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503226"}