{"title": "Apple TV+ Positioning Lead", "summary": "At Apple, we are singularly focused on bringing phenomenal products, services, and experiences to our customers around the world. We are also storytellers at heart, committed to improving the lives of those we engage, entertain, and hopefully, inspire. As part of our global video team, you will be responsible for the way we position and communicate our Apple Originals to our global audiences across all of their touch points across all platforms and Apple’s ecosystem. The work we do for Apple TV+ is dynamic, fast-paced, and deeply creative.", "description": "The scope of this role is broad and its impact on our Apple TV+ service highly visible. In working cross-functionally with our product, design, marketing, development, programming, business management, and editorial teams across the company, you will strategically guide the positioning and communication of our Apple Originals to optimize for both audience engagement and authentic presentation of the work of the best storytellers in the world. Every show and movie we shepherd alongside these artists is informed by their deep passion and unique perspective. Your core responsibility will be to make sure that we are drawing as large an audience as possible for each in the way we position it while focusing on defining and refining what makes the Apple TV+ service the very best in the market. This effort will require deep collaboration across many inspired, expert Apple teams and execution around multitude avenues- from the Apple TV app platform to email, social, and more - to communicate our service and its offering to our customers. A dogged attention to detail, style, and the art we serve will be absolutely essential, every day.", "key_qualifications": "Empty", "preferred_qualifications": "Have successfully led a major cross-functional initiative in a large, complex organization, juggling the perspectives and inputs of a wide variety of key stakeholders and collaborators. Ability to work independently, leading through influence toward alignment in a highly matrixed organization. Ability to think strategically on critical business needs, and to simultaneously act tactically, and tactfully, to complete them. Demonstrable commitment to fighting for excellence in customer experience through inter organizational complexity and ambiguity. Proven track record of cultivating innovation collaboratively, both day-to-day and broadly across product development cycles. Ability to lead by example and be able to get into details of day-to-day show and movie positioning while minding service-level positioning efforts to drive audience engagement.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $211,700 and $318,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558917"}