{"title": "Fire Life Safety Technician", "summary": "At Apple, we take pride in creating an outstanding work environment that fosters productivity and employee satisfaction. Our corporate campus serves as the heart of our organization, where innovation and collaboration flourish. As we continue to grow and expand, we recognize the importance of maintaining a seamless and efficient facility to ensure our employees can thrive in their roles.", "description": "As a Maintenance Technician in our corporate campus, your primary focus will be on customer service and maintaining an exceptional workplace experience for our employees. Your technical expertise will play a vital role in preserving the overall functionality and aesthetics of our facilities. You'll have the opportunity to work closely with various departments and employees to address their needs promptly and effectively, leaving a positive impact on their daily work lives.", "key_qualifications": "Preferred (but not limited to) 5+ years of hands-on experience working in a fast-paced multi-facility corporate environment, with a focus on providing the best in class service. Shown ability to plan and prioritize tasks in a focused work environment and maintain high levels of efficiency without direct supervision. Proven track record to coordinate vendors and provide mentorship to peers. Conduct routine inspections and preventative maintenance to ensure the safety and functionality of Fire Life Saftey systems and Backflows. Collaborate with team members to prioritize and complete maintenance tasks in a timely manner, minimizing disruptions to daily operations. Provide exceptional customer service by actively listening to employees' concerns and ensuring their satisfaction with the resolution provided. Identify opportunities to enhance the campus environment and propose improvements to management for consideration. Maintain accurate records of maintenance activities, including work orders, repairs, and inventory management. Uphold safety standards and protocols, promoting a secure and hazard-free workplace for all. Effective interpersonal skills in order to provide direction to contractors and vendors performing services for the company. Valid Driver’s license with good driving record. Ability to adapt and learn quickly, work autonomously, approach tasks with a sense of urgency, and address any issues that arise day or night. Strong attention to detail. A willingness to provide on-call support in case of emergencies or other off-hours issues. Strong verbal and written communication skills.", "preferred_qualifications": "", "education_experience": "Technical training, College degree, or equivalent work experience preferred.", "additional_requirements": "Reporting and completing repair requests made through the CMMS systems. General carpentry work. Respond to emergencies including nights and weekends when on call to correct unsafe or hazardous conditions. Basic knowledge and understanding Fire system inspections and repairs. Understanding/reading building prints. Backflow Inspections and Repair", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552301"}