{"title": "IS&T Early Career Software Engineer Opportunities", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your career and there's no telling what you could accomplish. The Information Systems & Technology organization produces key business and technical infrastructure at Apple handling orders from the online store, building applications that improve the retail store experience, providing network bandwidth for our services around the world, processing every transaction in iTunes, and closing the books. We do it all! If you are a born problem solver who enjoys collaborating on the next big thing, we may just have your dream job. From Apple ID to the Apple website to our data centers around the globe, IS&T manages the massive systems and services that so many rely on. They also build the custom tools that empower our employees to tackle problems on their own. And that means these engineers are free to do what engineers do best - explore all of technology’s possibilities!", "description": "Within IS&T, there are a variety of software engineering positions available across many different teams, ranging from special projects for new business initiatives to operations in a rapidly growing and dynamic setting. Early Career provides employees with the opportunity to build community amongst themselves by attending educational and social events. Examples of positions would include: Software Engineer (Backend), DevOps Engineer, Machine Learning Engineer, and Splunk Developer. Teams that are hiring include: Enterprise Technology Services, Retail Engineering, and Global Business Intelligence.", "key_qualifications": "Knowledge in at least one scripting language.\nExperience in Computer Science Fundamentals.\nBachelors degree in Computer Science or equivalent.", "preferred_qualifications": "Proficient programming knowledge in at least one of the following areas: Server side development (Java), Web development (JavaScript, HTML, CSS3) or iOS development (Objective-C, Swift).\nKnowledge of foundational services in AWS or GCP.\nRelated software engineering internship or job experience.\nExcellent quantitative and interpersonal skills.\nLeadership experience.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557886"}