{"title": "Apple Park Construction Project Manager", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and forward-thinking group that manages Apple’s workplaces and workplace service. We develop and run Apple’s global real estate portfolio, lead all related capital construction projects, providing outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world! Do you love thinking analytically? Join us, and you’ll have a significant role in continuing Apple’s legacy of efficiency and success. The Apple Park project manager will be responsible to design and construction research and development facilities for our business units in the local region.", "description": "You will have close coordination with project stakeholders from various teams including business units, real estate, legal, design, EH&S, energy, construction, network, maintenance, and operations to bring our projects to fruition. You will manage and support the architects, engineers, other specialty consultant and vendors, and general contractors from initial programming to construction completion.", "key_qualifications": "12-15 years experience in corporate office construction as a project manager in North America. Deep knowledge of the construction industry, design process, and construction practices. Excellent planning, analytical, organization and problem solving skills. Ability to gracefully adjust to meet changing circumstances such as reassignment of project priority, implementation of design enhancements/upgrades, and customer needs. Skilled in reading design and construction drawings for all disciplines. Experience with the fast track design build construction model. Ability to manage multiple projects including equipment upgrades and modifications within occupied buildings. Experience using cost tracking and scheduling software and ability to learn new project management software quickly.", "preferred_qualifications": "Ability to work well with others and create strong field and corporate relationships. Dedication to deliver consistent customer service internally and externally. Strong individual contributor. Self-starter who possesses exceptional time management skills and has great attention to details. Management of LEED certified projects. Fluent and effective verbal and written communication skills. The ability to fully utilize Apple products to do your job as efficiently as possible.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556468"}