{"title": "AirPods QA Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. The Audio Media Technologies Group (AMT) provides the audio, video, and graphics foundation across all of Apple's innovative products, including AirPods, iPhone, iPad, Apple TV, Apple Watch, and macOS. We are seeking a creative, and organized test engineer to perform manual testing on the next generation AirPods for our platforms and work with automated solutions to support and enhance our quality initiatives. Audio drivers, firmware and audio subsystems will all be areas of testing you will be responsible for. As a member of this team, you will have an unique opportunity to work with some of Apple's most advanced technologies to help build empowering solutions for everyone.", "description": "In this position, you will contribute to the development and testing of the next generation AirPods hardware & software, and Listening Experience technologies. You will work with peer groups to understand the needs, challenges and existing tools and be involved in defining and updating team test tools, processes and procedures. The best candidate is a self-starter with excellent communications skills and attention to detail, who can work well both on a team, and on your own. The fast-paced nature of the job requires someone who can work well under pressure and quickly adapt new technology into effective audio testing. We are seeking someone who is intensely curious yet focused on delivering results in a timely manner with an eye and ear for quality is a required. Also, there is needed coverage of structured automated testing that will require your execution, monitoring & reporting of results.", "key_qualifications": "5+ years of experience in general test engineering required\nExpertise in audio testing, software testing, isolating issues, devising test plans, aiming to specification\nA foundational understanding of electronics and audio technologies\nAbility to triage problems, prioritize accordingly, and propose a resolution\nStrong ear for sound anomalies and the validation of sound quality\nFamiliarity with real-time audio handling (sample rates, buffering, PCM, drivers, etc.)", "preferred_qualifications": "B.S. or higher in Computer Science, Computer Engineering, Audio Engineering, Electrical Engineering, Music Technology, or equivalent experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,278 and $195,200 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554427"}