{"title": "Senior Software QA Engineer  Apple Services Engineering.", "summary": "Do you like the idea of working on services that are used by millions of passionate people around the world? Do you enjoy working on challenges that are not yet solved? Do you want to change the world? Imagine what you could do here at Apple! Apple puts users and user experience first, and is a place where new futuristic ideas and innovations have a way of becoming extraordinary products, services and the present very quickly. Apple Service Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, Apple Books and more...", "description": "Apple Service is looking for a self-motivated and dynamic individual with strong technical and communication skills can contribute in a team environment and support its fast paced growth. Join our exciting team that is dedicated to providing the highest quality video products to our customers. This role works closely with the engineering team during all aspects of the development process. And you are responsible for being systematic at managing priorities and communicating progress as well as risk. In addition, this position requires you to be ‘very detailed oriented’, can juggle manual as well as automation testing, and can multi-task in a fast-paced testing environment.", "key_qualifications": "5+ years testing experience and minimum 2 years experience in testing Android and/or Video applications\nStrong Analytical and problem-solving skills, with the ability to debug complex issues and communicate findings effectively\nExcellent attention to details with the passion to deliver high-quality work on tight schedule\nStrong verbal and written communication skills, Ability to clearly document and report issues, and work collaboratively in a team environment.\nSolid understanding of Android platform fundamentals, including video codecs, playback frameworks, and multimedia APIs\nProven experience in manual and automated testing of Android applications, preferably using Python...", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science and Engineering or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role... Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551625"}