{"title": "Facilities Operations Manager, Data Center", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "The Data Center Operations Manager will work closely with senior leadership throughout the portfolio on the advancement and effective deployment of standard procedures and best practices all while driving a culture of continual improvement and moral throughout the facilities team. Responsibilities You will effectively manage the local facilities workforce. Forge collaborative relationships. Provide mentorship and training that is inspirational to the Data Center Facilities team...", "key_qualifications": "5+ years of data center management and leadership experience. Experience managing hyper scale Data Centers with facilities infrastructure of size and complexity commensurate with Apple’s Data Centers at a strategic level. Data Center and Systems Management experience with standard methodologies in the area of data center operations such as safety and compliance, infrastructure monitoring, Change Management processes, Business Continuity planning and execution, Disaster Recovery, and Conflict Management. Management of OpEx/CapEx budgets with experience in procurement and contract negotiations", "preferred_qualifications": "7+ years of related experience with an irrefutable record of dynamically growing responsibilities. Ability to work well under stress and handle difficult situations. Ability to make timely and effective decisions that are based on sound judgment, business rationale, mitigating cost and risk. Excellent communication skills, both verbal and written, to effectively communicate with team members and other departments. Excellent project management and project planning skills. Strong collaboration, organization skills, and professional demeanor", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554742"}