{"title": "Business Development Lead - Accessories & Audio", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. Join Apple, and help us leave the world better than we found it. We are seeking an experienced sales professional to lead efforts to grow the Apple-branded Accessories and Audio categories in South Europe with new and existing reseller partners.", "description": "You will own the revenue and growth target for Apple Accessories, AirPods & Beats for reseller channels in South Europe. You will advocate the vision of 'Why Apple-branded accessories' to carrier and retailer accounts, build the channel short and medium-term sales strategy, handle a pipeline of multiple partners, negotiate assortments, develop demand generation strategies, negotiate commercial terms, oversee WW-lead rebate programs, draft legal agreements, ensure timely supply, build relationships within Apple, and pursue opportunities to streamline processes and grow the business.", "key_qualifications": "In-depth experience in customer-facing sales, business development, or related roles. Experience in retail/telco sales preferred. Exceptional ability to deliver strategic sales messages. Ability to manage customer relationships, strong presentation skills, executive-level presence, outstanding organization skills, ability to prioritize, ability to architect new processes, excellent analytical skills, proficiency with Excel, ability to synthesize data, strong communication skills, ability to work with multi-cultural teams, ability to create relationships with global teams, fluency in English essential, French fluency recommended.", "preferred_qualifications": "", "education_experience": "BS or BA; MBA or other advanced degree a plus. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547289"}