{"title": "Senior Engineer, Information Security Incident Response", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We’re a diverse collection of thinkers and doers, continually reimagining our products, systems, and practices to help people do what they love in new ways. This is a deeply collaborative place, where everything we create is the result of people in different roles and teams working together to make each other’s ideas stronger. That same passion for innovation that goes into our products also applies to our practices, strengthening our commitment to leave the world better than we found it!", "description": "Apple is seeking a security professional to join its Information Security Response Organization, as part of the Threat Analysis and Incident Response function. A successful candidate will possess a proven technical background, relevant Information Security experience with a strong focus in the Incident Response lifecycle. You will work with a global team of security professionals on a follow-the-sun model with a primary focus on the identification, containment, and mitigation of security incidents. This role is an integral part of the security controls Apple uses to protect its customers, brand, and data. This person will have the opportunity to work on technology and processes with global reach. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity.", "key_qualifications": "More than 7 years of experience in Information Security with a focus on Incident Response, Security Engineering, and/or Intrusion Detection. Proficient understanding of incident response automation strategies, with demonstrated ability to implement them. Proficient understanding of threat modeling, operational threat intelligence, and common attack vectors. Knowledge of web application vulnerabilities with the ability to triage/verify OWASP Top 10 issues. In-depth technical knowledge of macOS or Linux Operating Systems. Exceptional analytical and investigative skills with hands-on experience, with demonstrated ability to analyze endpoint, network, and application logs. Proficient in one or more programming/scripting languages. Excellent verbal and written communication skills.", "preferred_qualifications": "Experience with disk and memory forensic tools. Experience writing and tuning IDS signatures. Experience triaging malware", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552877"}