{"title": "Senior System Engineering Program Manager (EPM) - Apple Vision Pro", "summary": "Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. We are looking for an experienced, highly technical EPM to join the team driving definition and development of a new product category.", "description": "As a System EPM, you will work closely with mechanical, electrical, algorithm, and software teams in TDG and across the company to define and develop highly optimized hardware products. You will be responsible for: Driving the development of system requirements based on experience targets and technology constraints. Identifying the most critical questions and organizing teams to find efficient ways to get answers. Understanding the link between technical decisions for the system and customer experience and communicating impacts clearly and concisely.", "key_qualifications": "Empty", "preferred_qualifications": "Experience with camera systems, display and optics technologies, and/or wearable consumer electronics. Experience as primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectives. Experience driving a highly diverse set of cross-functional team members and perspectives and yielding the best possible product solution.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $195,500 and $293,800. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. You’ll also receive benefits including comprehensive medical and dental coverage, retirement benefits, discounted products and free services, reimbursement for certain educational expenses, discretionary bonuses or commission payments, relocation, and more. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554094"}