{"title": "Software Engineer", "summary": "In Sensing and Connectivity, we use on-device sensors and wireless technologies to understand motion and orientation, help pinpoint location, understand the environment, and combine on-device data with machine learning to create compelling experiences for our customers. As a Software Engineer on the Location & Motion team, you will be responsible for implementing apps, widgets, or frameworks for customer-facing features on Apple platforms like iOS. You’ll collaborate closely with passionate and creative colleagues to meet ambitious goals in an environment that requires constant curiosity and growth.", "description": "The Location & Motion team is actively looking for a highly-motivated Software Engineer to design and build features that leverage on-device sensing and intelligence. We have an exciting roadmap and our team is growing. As a Software Engineer on our team, you will design and implement new features and fix bugs in applications and frameworks and champion innovative solutions to improve the product and team. You’ll also collaborate with outstanding engineering and cross-functional partners who will help you succeed and grow as we deliver incredible user experiences together. You will be responsible for bringing your ideas to life through all stages of development, from initial research, to prototyping, to testing and development in Swift / SwiftUI. You will need solid software engineering fundamentals — including data structures & algorithms, object-oriented design, and concurrency — to be successful in this role, but a specific degree or concentration is not required.", "key_qualifications": "Experience developing for Apple’s platforms, Ability to work collaboratively and explain complex ideas clearly, Great analytical, programming, and debugging skills", "preferred_qualifications": "Experience writing or maintaining frameworks, libraries, or packages, Mathematical modeling, Data science, AI/ML", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.  Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554677"}