{"title": "Software Engineer (Tools), Engagement Engineering", "summary": "As a Software Engineer (Tools), you will have the unique and rewarding opportunity to shape the future of software testing at Apple. You will build tools used by thousands of developers around the world to build, test, and ship software for Apple's iOS, watchOS, tvOS, and macOS  platforms.", "description": "The Engagement Engineering team is seeking a skilled engineer to contribute to the future of our internal software testing services and frameworks. You will join a small but ambitious group of engineers responsible for building new technologies that will power high-scaled software testing, iterating closely with Apple's internal software engineering teams to take Apple's own software to the next level. In this role you will work directly with end users and product teams alike, helping refine tools experiences based on user needs.", "key_qualifications": "6+ years industry experience, Proficient in modern scripting or compiled languages (Python, Swift, C/C++, etc.), Experience designing and using web service APIs, Understanding of software testing methodologies, Ability to refine user requirements and prototype new solutions from scratch, Familiar with Continuous Integration and software build processes, Experience communicating with customers, collaborating with technical/design teams and leading high-impact feature development", "preferred_qualifications": "", "education_experience": "Bachelorʼs Degree in Computer Science or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200504392"}