{"title": "Worldwide Secondary Market Data Scientist", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Worldwide Secondary Market Data Scientist is a critical multi-dimensional role involves data management, deep experience in statistical modeling, and decision support from a product oriented perspective. This role will work across our worldwide data analytics on secondary market product price values.", "description": "Unique position in worldwide sales finance on secondary market analytics team; managing market data and metrics using advanced level of SQL, Python, and R; Drive decisions on secondary market pricing across all lines of hardware business utilizing the data insights; Manage asset-level pricing data in the secondary market to construct pricing portfolio metrics and develop predictive pricing models; Develop visualizations and analytics on short turnaround for constituent teams and senior executives; Champion streamlining and efficiency improvements to data management activities; Prepare and distribute regular executive review packages; Develop highly polished and functional Tableau dashboards to support reporting, data discovery and statistical analysis to drive actionable insight and enhanced analytic capability.", "key_qualifications": "", "preferred_qualifications": "Identifies actionable insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to RV, Sales Finance, Business Development and Procurement. Develop automated processes to cleanse, integrate and evaluate large datasets from multiple databases. Expert knowledge in SQL, Python, R and Tableau; familiarity with Dataiku a plus; Proven technical database knowledge (Teradata, Snowflake, data modeling) and experience optimizing SQL queries on large data. Exceptional capabilities in data modeling, managing complex datasets, producing quality analytics, and driving insights from big data; High energy self-starter, multi-tasker with experience working independently as a project lead; Strong oral and written communication skills with ability to manage cross-functional projects and interact across all levels of the organization; Strong attention to detail and able to work effectively under time pressure.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558558"}