{"title": "Sales Financial Analyst", "summary": "Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate sophisticated challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future! We are seeking a passionate and collaborative individual for a key role in financial support of the Carrier business. Partnering with Sales, Operations, Marketing, and other Finance teams, you will oversee the performance of Apple’s products and services, advising partners with financial guidance on how to optimally and sustainably drive revenue and margin growth.", "description": "You will be an integral partner to the Sales team to build and run critical business initiatives. You will collaborate extensively with other Apple functional, geo, and WW teams to ensure that Japan is driving to overall corporate strategy and goals. In this role you will: ・Deeply understand industry trends, partner dynamics, and demand generation program performance by running analytics to uncover market insights ・Actively participate in the unit forecast process, ensuring key sales actions are being identified and executed to maximize opportunities and minimize risks ・Ensure investments meet rigorous financial metrics; review financial controls and manage governance, including quarter-end spend, accruals and compensation plans ・Liaise with the WW Sales Finance teams, sharing geo-specific market insight, advocating for geo-led proposals, and contributing to Sales Finance processes and tools  ・Assemble financial analysis and actively contribute to building quarterly and annual business reviews with Sales leadership  ・3+ years of experience in finance related field", "key_qualifications": "High level of analytical skills with attention to details, and validated ability to influence with numbers Ability to problem solve ambiguous situations using complex, non-linear, and occasionally incomplete data; experience building business models and forecasts High level of inherent curiosity, investing in personal knowledge to stay ahead of the curve in the industry Exceptional verbal, written, and presentation skills; an expert storyteller in translating complex quantitative analysis into a compelling narrative that adapts to the audience at hand Commercial finance experience supporting business partners Strong proficiency with Excel, Keynote, Business Objects, Essbase, Tableau, and Slack Proficiency in spoken and written English, and business-level Japanese desirable Knowledge of Python, SQL/Tableau and data science a plus", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Business, Finance, or other quantitative field. MBA or other relevant advanced degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535240"}