{"title": "Integration Platform Software Engineer,   Online Retail Engineering", "summary": "The Publishing Systems Engineering team at Apple is seeking a passionate, diligent Software Engineer to support our CMS and catalog management tools in our non-production environments.", "description": "Manage an offshore & onshore contractor team who is responsible for supporting the Online Store's publishing applications & services in their non-production environments\nTrack, package, and deploy all bug fixes in accordance with complex release plans\nWork proactively to achieve a bug-free environment across a multi-project & platform portfolio\nCoordinate with off-shore and onshore resources to ensure tasks are completed efficiently and to organizational standards\nProduce detailed documentation of feature support and development work completed\nGather and report metrics to development teams who own the tools", "key_qualifications": "", "preferred_qualifications": "5+ years experience with global e-commerce shopping experience development and execution\nStrong Java, J2EE, Struts or other MVC framework design and programming skills\nStrong working knowledge of JavaServer Pages, Spring, Hibernate\nExpert knowledge of HTML, XML, CSS, Javascript, and JS Libraries\nDemonstrated experience working with minimal supervision on large, cross-functional projects\nStrong decision making and prioritization skills; have experience executing complex production schedules with dependencies and competing priorities\nComfortable upholding organizational values and best practices, while balancing competing time-to-market pressures\n5+ years experience working on Java based application maintenance.\nAble to anticipate, troubleshoot, and resolve problems on the fly using Hubble, Splunk, etc\nExperience with a repository such as SVN or git\nExperience with a bug tracking system\nStrong technical background, and an ability to collaborate effectively with engineers\nHigh degree of ownership and accountability", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558419"}