{"title": "Interaction Algorithms Engineer", "summary": "Join the engineering team that fuses multimodal user input to enable seamless interactions on Vision Pro. Human Interface Devices (HID) is looking for an Interaction Algorithms Engineer for next generation human-computer interfaces. HID operates at the intersection of hardware, software, and design...", "description": "In this role, you will prototype and define interactions end-to-end, in collaboration with HW, SW, and design partners. We also design user studies and leverage prototypes to define success criteria. You will develop processes for measuring key performance indicators, as well as analyze data to identify and drive algorithm improvements...", "key_qualifications": "3+ years SW development experience (or equivalent internship / research experience), Proficiency in C++ and Python, Experience developing interactions or input technologies, Able to communicate clearly and collaborate with cross-functional teams, Excellent problem solving and root cause analysis skills...", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "The following are not required, but are a plus and may help you be more successful in this position: Experience developing software for Augmented Reality (AR) / Virtual Reality (VR) (ex. ARKit), Experience with Objective-C and/or Swift", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543906"}