{"title": "Developer Publications Engineering Project Manager", "summary": "Building products that enrich people’s lives is in Apple’s DNA. Are you passionate about shipping software, coding tools, and inspiring developers? Here’s the opportunity to join an amazing team and empower people to build software for Apple platforms. Developer Publications works with Software Engineering teams developing new technologies to create content that teach developers how to build awesome software for Apple’s platforms. We are looking for a world-class project manager capable of managing multiple initiatives of varying scale, complexity, and focus. You’ll collaborate with an inspiring staff of engineers, authors, designers, and editors. As an experienced engineering project manager, you’ll help drive the delivery of world-class teaching materials, such as snippets, sample code, tutorials, API Reference, and Swift Playgrounds. You’ll bring the ability to lead projects of all sizes, levels of complexity, secrecy, and play a critical role in their success. You’re a great communicator, who is very detail-oriented, proactive, focused, highly motivated, and thinks outside the box. You help teams identify and resolve issues in a constructive and scalable way. You do your best work leading dynamic and innovative projects in a fast-paced environment.", "description": "- Collaborate across all phases (design, implementation, testing) of an engineering project and ability to partner multi-functionally\n- Build project plans and schedules, track and prioritize tasks across multiple product releases and efforts, simultaneously \n- Identify and resolve conflicts, inter-dependencies, and project issues quickly and effectively \n- Facilitate requirement gathering and review sessions, program meetings and events\n- Evaluate technical risks and drive resolution on technical / engineering issues\n- Take part in evolving how projects are defined, managed, and delivered", "key_qualifications": "3 - 5 years of experience in program or product management for software development, or equivalent technical management role\nSoftware release experience managing complex, cross-functional projects; deal well with rapid development cycles and remain flexible and calm in the face of ambiguity\nExperience developing and releasing a software product\nExperience leading strategic programs combined with the ability to implement at tactical project-level\nTrack and prioritize tasks across multiple product releases and efforts simultaneously\nAbility to understand priorities, clarify direction, and present clear project status\nAbility to filter and distill relevant information for the right audience\nExhibit a curious approach about new insights and process improvements\nExcellent attention to detail\nExcellent spoken and written communication\nUse tracking and management tools and web databases; when required create web tools for managing and tracking purposes\nBuild and maintain strong relationships in support of cross-functional work with multiple organizations across Apple", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in Computer Science or equivalent experience", "additional_requirements": "Experience with Object-oriented programming or scripting languages is preferred\nExperience with Source Management Systems (Git) is preferred", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547930"}