{"title": "Web UI/UX Engineer", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have envisioned — and now can’t imagine living without! If you’re thrilled by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job!", "description": "-  Experience successfully completing/delivering multiple projects applying an Agile methodology\n\n-  High ownership, self-sufficient, hands-on leader to drive quality in usability and experience\n\n-  Ability to write complex code, analyze changes and suggest improvements\n\n-  Ability to reason logically and creatively, identifying problems, drawing valid conclusions from the data available, and develop effective solutions while applying creative thinking in the design and development of web applications\n\n-  Turn design concepts into fully working Web applications\n\n-  Rapid prototyping of design concepts\n\n-  Quickly identify and fix JavaScript and CSS defects\n\n-  Collaborate on optimal user experience choices based on business requirements\n\n-  Develop scalable JavaScript code\n\n-  Integrate front end code with backend Web services\n\n-  Optimize existing JavaScript code\n\n-  !Create re-usable code snippets and standards for use by other developers", "key_qualifications": "Minimum 3 years of experience in advanced JavaScript with at least one major JS framework such as Angular, Ember, etc.\nStrong HTML and HTML5 experience and fluent in CSS (specifically CSS3)\nCross-browser development with experience in Web services\nProficiency with JSON, JSONP and AJAX", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or relevant fields.", "additional_requirements": "-  JavaScript unit testing framework experience (Jasmine, Mocha, etc)\n-  Image design and manipulation (Photoshop, etc)\n-  Web usability expertise\n-  Mobile front end development\n-  JSP development experience", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534678"}