{"title": "Living Room Growth Lead, AppleTV+", "summary": "The people who work at Apple have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. And more recently have launched truly innovative services with Apple News+, Apple Arcade and Apple TV+. We are deeply passionate about apps, music, movies, TV shows, and books. It’s a force that drives and inspires every one of us every single day. The passion for innovation that goes into our products applies to our practices as well, strengthening our dedication to leave the world better than we found it.", "description": "You will lead the business team that is responsible for increasing viewership of TV+ on living room devices, which includes connected devices, smart TVs and MVPDs. That will include:\n\n-  Set subscriber KPIs, including growth and viewership targets, for TV+ living room business and partners on a weekly, monthly, quarterly and annual basis.\n\n-  Create and manage specific partner plans with varied collaborators (Business Development, Partner Marketing, Product, Programming) and drive cross-functional delivery on those plans\n\n-  Analyze and articulate performance of partnerships, including sign-ups, viewership, and churn. Lead weekly-cross functional meetings to review metrics and course-correct in real time.\n\n-  Ensure rolling partner roadmap is in place with partner management and partner marketing teams. Work closely with these teams and their partners as needed as internal expert.\n\n-  Lead living room business team and set internal processes to support the growth of the business.", "key_qualifications": "", "preferred_qualifications": "MBA or equivalent degree preferred\nDeep understanding of Apple products and services.\nProduct-savvy individual who can partner with Apple product teams to scope features based on both a data and customer centric approach.\nNatural presenter who can quickly distill information to summaries that provide clarity and align key partners.\nAn appreciation and passion for storytelling in TV and movies. A heavy TV+ consumer. A passion and understanding of consumer consumption habits.\nHave a keen analytical mind to dig into the data to analyze our customer behaviors that can result in actionable strategies to engage TV+ customers across any living room device and increase their viewership.\nThe right mix of collaboration, influence, flexibility, and relationship building skills to be effective in a large cross-functional organization.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $176,700 and $318,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556824"}