{"title": "Module Process Engineer", "summary": "Apple is looking for a Sr. Module Process Engineer to join Panel Process and Optics (PPO) Engineering team! We are responsible for developing new innovative manufacturing process technologies to solve complex design challenges that have a direct impact to future products, quality and delivery of Apple Displays & Touch technology. The individual in this role will serve as a focal point in the process development of advanced key process modules from the concept/architecture stage through product engineering validation builds! We work at a fast pace and require everyone to be highly motivated. A successful candidate needs to be a flexible thinker and be able to problem solve outside of their respective technical area.", "description": "Process technology feasibility studies through theoretical simulation and/or practical engineering methods\n\nLeads design and development of technically complex manufacturing processes including material selection, parameter optimization, equipment, metrology and system design to enable new product designs & functional requirements.\n\nDevelop Process for Manufacturability\n\nProvide early and ongoing manufacturing leadership to ensure new process is scalable\n\nLead PFMEA generation for new process technology Failure Analysis\n\nLead root cause analysis and metrology development for issues related to new process technology\n\nCross-functional interaction with Product Design, Display Engineering, Display Operations and international vendors\n\nKeep abreast of relevant industrial process & material manufacturing technical trends", "key_qualifications": "Self-starter with proven ability to lead a project from lab scale development to high volume production without major last minute surprises\nHands-on experience in the development of module processes & its integration in back-end processes of Flat Panel Display & Touch industry or other related industries\nDemonstrated ability to perform DOE, data analysis, SPC control\nProven failure mode analysis, root cause investigation, and problem solving for product yield and quality issue.\nExcellent written & verbal communication skills and proven leadership ability\nExcellent data handling, documentation, critical milestone creation, and organization skill", "preferred_qualifications": "", "education_experience": "BS in engineering with a minimum 3 years experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546451"}