{"title": "Cloud Security Specialist", "summary": "The Global Business Intelligence team provides data services, analytics, reporting, and data science solutions to Apple’s business groups, including Retail, iTunes, Marketing, AppleCare, Operations, Finance, and Sales. We are looking for a Cloud Security Specialist to drive industry practices and standards for public cloud adoption and who has a passion for data protection, network security and compliance.", "description": "As a Cloud Security Specialist, you will be driving security standards for third party cloud platforms and develop solutions to detect, track and remediate non-compliant activities or resources. Multi-functional collaboration with other application and framework engineers to promote security by design and migrate applications to cloud infrastructure with accurate access controls, end-to-end encryption etc. Attention to detail and a passion to deliver a highly scalable and quality products are important.", "key_qualifications": "4+ years of experience on cloud platforms with expertise in security architectures for cloud (AWS or GCP) and hybrid platforms; Proficient in all aspects of cloud security including identity and access management, interpersonal policies, network controls and cryptography; Strong technical skills with programming languages such as python, micro-service development using Java etc, along with knowledge of DevOps and DevOps tools; Hands-on skills for security pen testing, vulnerability management & supporting critical production incidents; Experience with virtual machines, containers & Kubernetes platforms (EKS, GKE, ACK etc); Knowledge on privacy and compliance requirements like SOX, GDPR, PII is a plus; Good communication and personal skills: ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownership", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree or equivalent experience", "additional_requirements": "Cloud Security Certification like AWS Certified Security – Specialty", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534734"}