{"title": "Senior Web Applications Engineer", "summary": "There are more than two billion active Apple devices worldwide and we are striving for a billion more. Come join a small team of highly-focused engineers who are working to make that possible. As a member of our team, you will have the opportunity to work on internal applications and services that play a critical role in how Apple develops and delivers high-quality operating systems.", "description": "As an engineer on our team, you will iterate quickly to create, maintain, and improve apps that empower the day-to-day work of tens of thousands of Apple employees. You’ll spend most of your time writing code, reviewing contributions from others, and collaboratively designing technical solutions. We obsess over the user experience. We strongly value creative problem-solving and continuous improvement. When we find a great technical or process solution, we adopt and adapt it across our projects. Being disciplined about our day-to-day work gives us the freedom to respond flexibly and creatively to new challenges. Our work requires significant interaction with our users, cross-functional partners, and leaders across Apple so the ideal candidate will excel at communication and collaboration in additional to technical skills.", "key_qualifications": "Experience with at least some of these technologies: React, Typescript, Kubernetes, Postgres, Ruby on Rails, Swift on Server. Skilled at software architecture and API design. Strong understanding of UX and UI design principles. Experience writing tests and testable code. Can investigate and debug difficult problems. Creative thinker and strong problem solver. Passion for quality and attention to detail. Excellent communication and collaboration skills. We believe that the best candidates can learn our specific problems and tools quickly, but they must bring a strong motivation for learning, self- and team improvement, and delivering their best in a complex, time-sensitive environment.", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or related fields, or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549233"}