{"title": "Head of Digital Onsite Marketing, Apple Store Online", "summary": "The people here at Apple don’t just create products — we build the kind of wonder that has revolutionized entire industries. It’s the diversity of our people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. The Apple Store Online Digital Experience & Merchandising team is seeking a dynamic and experienced Senior Digital Onsite Marketing leader to join our hard-working team. In this role, you will be responsible for eCommerce marketing across all Apple Store shopping pages for new product introductions, commercial programs and seasonal moments, across all lines of business, optimizing the customer experience and driving revenue through strategic onsite marketing initiatives. The right candidate will be an experienced leader in best in class digital practices, with a strong commercial sense, and demonstrated success overseeing a sophisticated, global business. You will have experience with creating digital visual and commercial marketing and merchandising plans, including customer journey, navigation, product recommendations, personalization, content briefing, merchandising story telling, and continuous analysis of shopper-led, data driven insights, with a meticulous test and learn approach.", "description": "Oversee development and execution of onsite marketing strategies to drive product discovery, generate value proposition awareness, increase average order value, and improve conversion rates. Partner with Product Marketing, Marcom, to create compelling content and messaging across various channels including Store home page, Shop pages, landing pages, Product Detail Pages, Attach, Accessories Category pages, Apple Store App to support the customer in their shopping decisions and drive purchase confidence. Collaborate with cross-functional teams, including Product Marketing, Marcom, Commercial Marketing, Retail Engagement & Marketing, to ensure seamless alignment of onsite strategies, messaging and branding with overall business objectives. Collaborate with Regional Digital Experience & Merchandising teams to co-ordinate new product introduction and seasonal accessories stories and inform attach and recommendation strategies. Responsible for the business performance of AppleCare across our online platforms WW. Partner with AppleCare teams to understand strategic priorities and develop merchandising plans and roadmaps for driving attach performance. Responsible for the business performance of Apple brand and Third Party Accessories business. Partner closely with Retail Product Merchandising team on comprehensive Retail accessories strategy. Partner with the Product Management team to define and prioritize new marketing/merchandising functionality across platforms, and enhanced merchandising tools and capabilities. Collaborate with the Future of Digital team on merchandising insights, trends and desired customer experiences in the development of platform and omni-channel strategies. Optimize user experience and journey through effective site navigation, search, and personalized recommendations. Understand segment, regional, seasonal nuances and build strategies to best optimize merchandising placements and platforms as appropriate Monitor key performance metrics such as traffic, engagement, conversion rates, and revenue to see opportunities for improvement. Identify and prioritize key onsite marketing/merchandising improvement opportunities by using sales and engagement data, customer feedback, and through partnership with the Conversion, A/B testing & Analytics teams. Generate actionable insights and recommendations to optimize the customer journey and improve return on investment. Stay informed about industry trends, standard methodologies, and emerging technologies in eCommerce, merchandising, and digital marketing globally. Leverage industry insights to innovate and stay ahead of the competition.", "key_qualifications": "10-15 yrs+ years digital onsite marketing /merchandising Or equivalent experience. 10+ years minimum experience of leading large senior teams, including 5+ years as a manager of managers. Demonstrated people leader who builds capabilities of individuals and teams through effective employee development, involvement, communication, and guidance. Role models inclusive leadership behaviors and builds, develops and retains diverse teams. Deep knowledge of the retail industry and digital commerce and omnichannel trends Validated experience establishing vision and goals and developing strategic and tactical plans. Proven experience translating business priorities into impactful marketing and merchandising stories Experienced in balancing multiple priorities, partners and work streams across geographies and business groups Outstanding analytical and numerical proficiency; proficient in site analytics tools and comfortable working with data sets and making decisions based on data. Highly skilled at building effective presentations and storytelling including at the executive level. Outstanding ability to problem solve, develop creative solutions, and demonstrate resourcefulness. Excellent project management skills, including work prioritization and planning.", "preferred_qualifications": "", "education_experience": "BA/BS or equivalent experience, MBA a plus", "additional_requirements": "Regular meetings with peers in Asia and Europe during overlapping business hours. Flexibility for occasional evening or weekend work during critical time periods.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $211,800 and $317,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545855"}