{"title": "Software Engineering Manager - Apps and Frameworks Security", "summary": "The SPEAR team in Apple’s Security Engineering & Architecture organization is hiring a collaborative software engineering manager with a drive to improve the security of end user devices.", "description": "As a software engineering manager in SPEAR, you will:\n\nLead and manage a team of collaborative software engineers improving the security of critical low-level operating system software.\n\nGrow the team by hiring and developing top engineering talent at all experience levels.\n\nManage ambitious software security projects through their entire lifecycle, including concept, design, implementation, testing, and handoff phases.\n\nFoster a collaborative team culture, leading by example to approach every challenge as an opportunity to deepen mutual understanding and respect through creative problem solving.\n\nDrive continuous improvement within the team, analyzing every project for improvement opportunities and following through to ensure they are implemented.\n\nPartner with other security engineering leaders to develop your team’s roadmap and respond to emerging threats.", "key_qualifications": "", "preferred_qualifications": "Experience leading a software team developing operating system services, SDKs, or native applications\nHands-on experience with software development in a compiled object-oriented language such as Swift, Objective-C, or C++\nUnderstanding of software security principles\nUnderstanding of system-level concepts including multi-threaded design, synchronization, and interprocess communication\nExperience building a strong and diverse team, promoting healthy team culture, driving process improvements, and supporting career growth of team members\nExperience hiring engineers and leading a team through significant growth\nProven track record of owning and leading successful delivery of software projects\nEnthusiastic, empathetic, and collaborative approach to multi-functional projects", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553877"}