{"title": "Embedded Software Engineering manager - Cellular Modem Software", "summary": "Posted: 8 Apr 2024 Weekly Hours: 40 Role Number:200546509", "description": "Genuine passion for innovation and product development with experience from inception through delivery to customers. The Embedded SW Manager will be responsible for all things' firmware related. Architect, design, develop, and maintain hardware and software systems for Apple products.", "key_qualifications": "At least 10 years of validated experience in wireless SoC firmware engineering Experience in engineering management, including prior leadership of wireless firmware team(s) with a strong high-volume production track record Extensive technical background in embedded SW fundamentals, including a deep understanding of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memory Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management Experience with configuration and release management, continuous integration, and regression testing Knowledge of design strategies for maintainability, scalability, and code reuse Understanding of wireless systems, MAC and PHY layer operations, digital signal processing, Tx/Rx performance metrics, regulatory constraints, and coexistence issues Experience with WiFi, Bluetooth, or similar wireless technologies HW/SW architecture and design partitioning, CPU selection, memory estimation, and requirements analysis Leading large and complex projects, including feature planning, prioritization, status tracking, and issue triage and reporting Excellent interpersonal skills, including experience leading teams Excellent communication skills – both written and oral Experience with executive communication is a plus", "preferred_qualifications": "", "education_experience": "M.S. in EE, CE, CS, OR equivalent industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $272,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546509"}