{"title": "Sr. Software Engineer, Tools and Framework - Ad Platforms", "summary": "We are seeking a highly skilled and motivated Tools and Developer Framework Engineer to join our team. The ideal candidate will be responsible for designing, developing, implementing, and maintaining the tools and frameworks essential for our software development lifecycle. This role will play a critical part in enhancing the efficiency, productivity, and quality of our development processes.", "description": "Design and develop tools for functional integration tests, including developing mocks and managing test data libraries. Testing, validating, and optimizing tool and framework designs for various types of testing including functional, integration, and Failure Mode Effect Analysis (FMEA). Provide technical guidance and support to developers. Stay updated on emerging technologies like AI/ML and applying on building test intelligence to make the tests smarter. Analyze and solve complex problems to devise effective solutions with strong critical thinking and troubleshooting skills. Collaborate with teams to ensure smooth integration and functioning of test automation tools. Stay abreast of advancements in software development methodologies, version control systems, and continuous integration/continuous deployment practices.", "key_qualifications": "Demonstrated proficiency in Java, Groovy, Python, or Swift. Atleast 3+ years experience in designing and maintaining test automation tools and frameworks by upgrading across various version of JDK, AWS library versions in addition to security vulnerability fixes in the code. Good knowledge working with and contribution to open source libraries like Apache common, Kafka, Cassandra and TestNG. Experience in evaluating and improving existing tools and frameworks. Good understanding of database connectivity and data access, connecting to data sources and SQL, understanding of REST API. Working knowledge on distributed computing systems Hadoop, HDFS and Hive. Capability to provide technical guidance and support to developers. Ability to analyze and solve complex problems with strong critical thinking and troubleshooting skills. Experience in testing, validating, and optimizing tool and framework designs for various types of testing functional, integration and Failure Mode Effect Analysis (FMEA). Strong understanding of software development methodologies, Git, and CI/CD. Familiarity with containerization, cloud platforms such as AWS or GCP, and data pipeline technologies such as Kafka and Spark.", "preferred_qualifications": "", "education_experience": "Bachelor's or Master's degree in CS or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548726"}