{"title": "Strategic Deals & Partnerships Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. As a Strategic Deals Manager, you will develop and lead business engagements across Apple's Engineering and Product organizations with external partners to establish next-generation technologies and services. You will be responsible for cross-functional coordination, creative problem solving, effective deal structures, and leading engagement, strategy and negotiations with Apple's partners. In this role, you will leverage and develop a keen understanding of complex commercial agreements, intellectual property, and operations.", "description": "• Develop, negotiate, and execute strategic deals for technology development, licensing and other partnership engagements with third parties  • Build and manage relationships with third-party exec• Develop, negotiate, and execute strategic deals for technology development, licensing and other partnership engagements with third parties  • Build and manage relationships with third-party executive management teams as a representative of Apple  • Drive cross-functional coordination across Apple organizations including Engineering, Legal, Finance and others, both during deal negotiations and following deal closure  • Lead data-driven research and industry analysis of emerging technologies to identify opportunities and inform commercial strategy development with internal teams  • Deeply engage across emerging and established technologies spanning hardware, software, services, AIML, generative AI and LLMs, gaming and beyond  • Clearly and concisely create proposals and present to senior executives", "key_qualifications": "", "preferred_qualifications": "MBA, JD preferred with Engineering/Sciences experience  Experience in and passion for emerging innovation in both software & hardware technology (generative AI, spatial computing, gaming, etc.)  7+ years of relevant work experience (partnerships, business development, strategy, emerging technologies)  Ability to navigate ambiguity by applying structure and principles  Experience negotiating and managing partnerships with a variety of global partners (start-ups, public companies, etc.)  Knowledge and comfort with commercial contracts, licensing, intellectual property, financial modeling, commercial diligence, technical diligence, etc.  Ability to creatively solve complex issues  Excellent communication skills with an ability to articulate complex concepts in a concise manner to cross-functional teams, third parties, and Apple executives  Team player that is adept at working cross-functionally with a variety of partners (Engineering, Legal, Marketing, Finance, etc.)  Led or participated in research and commercial strategy development with internal teams  Strong analytical skills  Technical acumen to understand market innovation  Willingness to travel internationally (10-20% of time)", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556087"}