{"title": "Compensation Analyst", "summary": "At Apple, our number one resource is our people. When it comes to attention to detail, leading projects, deadlines, communications, and ideas in different time zones, you’ve got it under control. This position will partner with Compensation Business Partners as well as team members from Finance, Recruiting, Systems teams and other People team functions to deliver effective and innovative compensation programs in alignment with Apple’s Global Compensation Philosophy.", "description": "The Compensation team is looking for an innovative compensation professional to support a develop the global compensation philosophy and strategy at Apple. The successful candidate will partner with the Compensation team to design, assess, and implement Apple's compensation programs worldwide.\n\nThe successful candidate will play a key role in the design, assessment, and implementation of Apple's global compensation programs. The key responsibilities include: \n- Maintaining and administering key compensation databases and tools\n- Gather and analyze compensation data to perform analysis and support business needs\n- Participating in compensation surveys and providing analysis of competitive positioning\n- Contributing to the development of base salary, bonus, and equity programs\n- Contributing to the development of compensation policies and practices\n- Performing staff support activities to develop, implement, and administer job architecture and compensation policies and programs\n- Assisting with the annual compensation planning process\n- Build and maintain relationships with key internal and external partners and vendors", "key_qualifications": "N/A", "preferred_qualifications": "Highly collaborative style and strong team orientation\nEnergetic, self-starter with the ability to successfully manager multiple priorities in a complex, matrix and fast-paced environment\nAbility to get involved in the details while maintaining broader view\nAttention to detail and commitment to excellence", "education_experience": "Bachelor’s degree in relevant field (MBA a plus)", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550252"}