{"title": "Lease Accounting Manager", "summary": "This is an exciting opportunity to work in a fast-paced environment and help shape the Company’s future. Get ready for your perfect job, one that encourages you to think analytically and work collaboratively with Apple business partners across the world.", "description": "The Lease Accounting Manager will be responsible for accurate reporting of leases associated with the real estate portfolio, 1600+, around the world for P&L and balance sheet. In this role, the manager will have a close partnership with Corporate and Retail Real Estate, and Global Business Solution (GBS) teams to ensure accurate lease accounting worldwide in accordance with ASC 842.", "key_qualifications": "", "preferred_qualifications": "SOX compliance experience is preferred\nDetailed knowledge of New Lease Accounting (ASC 842)\nIn-depth understanding and application of the new lease accounting criteria\nDrive resolution on open lease accounting problems across the business\nBe a self-starter with the ability to meet deadlines in a fast-paced environment\nBuild effective business partnerships and be an excellent team player\nStrong performance in a fast-paced, innovative environment\nExcellent analytical and Excel modeling skills\nEffective written, verbal and presentation skills; with ability to present to all levels within the organization.\nSystem implementation and project and process improvement experience is an advantage\nExperience with enterprise software systems and databases a plus (e.g., SAP and Tririga).\nStrong understanding of US GAAP\nCPA Preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $178,900 and $269,400, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558880"}