{"title": "Channel Account Executive - Chile", "summary": "The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. This role will grow Apple’s reseller business by partnering with our reseller’s sales force. We develop strategies that enable businesses to transform the way people work. To realize this goal, we build relationships, develop partner capabilities and ensure execution across the businesses. We collaborate closely with internal and external partners to build plans and programs that scale the business and adoption of the Apple ecosystem.", "description": "Develop, plan and implement account plans that align Apple and the partner’s growth strategies to increase adoption of the Apple ecosystem in Chile & Perú. Through crafting cross-functional, targeted and strategic development plans, ensure that services, product knowledge, product offers and long-term plans are implemented to the highest standard. Regularly assess and communicate the strength and effectiveness of the partnership. Identify new business opportunities and support them through closure. Ensure that any client issues and/or concerns are raised and addressed. Share status progress and facilitate sales activity across the distributors, key partners and Apple. - Manage the relationship, build up and execution of sales plans, drive our strategic partners towards results. - Envision and create the capabilities to shape the future of our business looking to scale through partners and gain velocity. - Align our local and global strategies, support their progress and follow through to ensure all needs are met. - Direct accountability on strategy construction, forecasting and execution by working together with your partners. - Manage your business to the core where details matter while creating demand generation activities, identifying new opportunities, accurately forecasting, and coordinating fulfillment logistic", "key_qualifications": "10-12 years of proven experience working with channel and/or enterprise sales organizations. Demonstrated passion, energy and focus on developing and growing a $100M+ business. Proven consultative selling experience developing channel growth strategies for business customers. Ability to balance delivering on short-term goals while creating sustainable value for customers and partners as well as demand for the future. Proven track record of delivering high impact results. Ability to empower others to learn, to be curious and ultimately, share your passion for the Apple story. When challenged with sophisticated questions, share your deep knowledge of how our hardware, software and services integrate. Confident and articulate with a clear ability to influence others; ability to learn quickly, navigate adversity, and meet the need of partners. Ability to facilitate cross-functional decision-making and swiftly move ideas to execution. In-depth knowledge of distribution channel & retail channel. Proven expertise growing channel sales across all commercial segments; from small business to enterprise and government. Successful working independently and as part of regional, global and cross-functional teams. Keep abreast of market trends, partners' platform capabilities and strategic plans for new partnership opportunities. Consistently display the highest level of ethics, values, and integrity. Availability to Travel approximately 10 - 15% of the time. English proficiency required", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience. Master’s degree is desired", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551287"}