{"title": "Head of Global Accounts (EMEA/APAC)", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers—helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes promote and monetize their work while also helping people around the world discover apps and media through the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content from the world’s best journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with passionate fans. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone!", "description": "We’re a global organization looking for a Head of EMEA/ APAC who is a consultative, collaborative leader to lead this customer-facing team and drive long-term business and revenue growth. As a core leader in our global sales organization, your proven record of outstanding customer service, collaboration, and coaching hardworking team members will ensure success for our customers and businesses in these regions.  Working across time zones on a select group of Global Accounts that distributed marketing & media teams and significant financial investment requires an unparalleled, partnership-orientated, consultative approach. This person will: * Lead and coach (with the potential to eventually hire based on marketplace expansion needs) members of the Global Accounts team based in these to regions to do the best work of their lives. * Engage and interact with senior leaders within Ad Platforms to report on the progress of go-to-market initiatives & account/team-level progress * Join Client Partners & Product Specialists in meeting with key customers and agencies to foster senior relationships, drive revenue growth & gather market feedback * Collaborate with other departments such as Customer Success, Data Insights, Learning & Development, Sales Operations, & Marketing to ensure alignment on priorities and outcomes. - Excel globally with teammates in sharing takeaways from the region, categories & with go-to-market initiatives.", "key_qualifications": "* Extensive media sales experience across platforms and types, including online, mobile, search, video, and display. * Strategic-minded, hands-on leader with extensive management experience in running a growing and evolving sales organization in a cross-functional environment. * Influential and will quickly develop relationships and trust with their peers and directs, so that they can provide direction, oversight, and professional development opportunities. * Successful track record selling to senior executives", "preferred_qualifications": "Knowledgeable about using data to help tell a compelling story Experienced selling performance and brand marketing products Passionate about the customer experience and can dig deep, from the big idea down to the details, knowing how to position the team for what's around the corner Appreciates Apple culture and values, and is energized by the challenges of delivering trustworthy solutions within an evolving industry A strong amount of direct people management experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559246"}