{"title": "CAD Engineering Program Manager", "summary": "Apple's Hardware Technology Engineering Program Management Team is looking for an inventive, high-energy Engineering Program Manager (EPM) to support the Silicon Engineering CAD organization. In this role, you will utilize your technical skills in front-end and back-end silicon CAD design flows. Use communication and program management skills to drive schedules and resolve issues across multiple projects, technology nodes, and sites.", "description": "Work directly with Hardware Technology teams and work closely with CAD, design, and technology teams to craft a project plan, identify / resolve blockers, and align CAD team work across multiple parallel projects. Own and drive high-level achievements by focusing the CAD team on meeting near-term landmarks and unblock technical issues by pulling together the relevant multi-functional technical specialists. Run and track project schedules by driving high-level achievement execution in a dynamic core technology team. Responsible for daily and long-term project management tasks. Participate in early planning of new projects as well as resourcing and scheduling. Assist with development of and ownership for supervising new project schedules and resource metrics. Drive weekly schedule and communication meetings with upper management. Ensure effective project schedule and dependency communication with the design team. Rolling up your sleeves and doing what it takes to things done.", "key_qualifications": "Experience in any of the following: Front-end (Logic design, Synthesis, DV or DFT) and Back-end (PNR, STA, LVS, DRC, Extraction) CAD Tools/Flows. Participate in technical discussions, ask probing questions, and work with the team to pull together prioritization, schedules, and solutions to issues. Work on an EPM team responsible for driving technical issue resolution to enable timely silicon to meet ambitious product schedules. Excellent leadership skills, passion, and ability to encourage team members. A background optimally handling conflicting priorities and driving results. Experience with delivering multiple silicon tapeouts. Strong desire to own project development and drive team to success. Enjoy sharing in the success of delivering a successful product.", "preferred_qualifications": "", "education_experience": "MSc or BSc in Computer Science or Computer Engineering", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546939"}