{"title": "Compiler Engineer", "summary": "The Clang Compiler team at Apple is looking for an engineer to work on Clang-based tools. Clang is a core part of Apple's developer tools, used internally to build Apple's software stack and externally by developers universally. We are looking for a compiler engineer to join our efforts. Our team works to deliver reliable tools for all developers working on our platforms. Together, our work will be the reason millions of customers feel that they can trust our devices every single day. We believe that every engineer brings unique skills and perspective. Far more than any specific experience or skill, we are looking for engineers who want to build great software, learn and develop their skills, and ultimately enable others to develop amazing applications.", "description": "In this position, you will work with teams across the whole company to implement and integrate compiler-driven tools that improve developer productivity. Most of your work will be done in open source, on llvm.org and swift.org, where you'll collaborate with the open source community on contributions including, but not limited to, core language features, hardware support, and ensuring the reliability and security of all the software that Apple provides. Internally, you will work extensively with other teams, Operating System Tools, Debugging Technologies, and Build System teams. You'll have an opportunity to be creative, designing new tools and workflows that are adopted across our developer ecosystem. If you believe you have additional skills not listed here that would make you a good candidate for this position, please feel free to include a cover letter describing those skills and their applicability to the position. If this sounds of interest to you, we'd love to hear from you!", "key_qualifications": "Strong C and C++ programming expertise. Knowledge of common data structures like linked lists, sets, maps, and graphs. An eagerness to explain your ideas and engage with engineers of a wide range of expertise and domain knowledge across open-source communities and within the company. Experience with one of these qualifications: working and contributing to compilers and related low-level tools, operating systems, or low-level libraries.", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550238"}