{"title": "PLL Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented PLL Circuit Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Silicon Engineering is seeking qualified PLL designers to work on the next generation PLLs for Apple’s world-leading systems-on-chip (SOCs). We are a growing analog/mixed-signal team involved in design and productization on leading-edge CMOS process technology nodes!", "description": "Understand system level requirements to build overall PLL specifications. Build behavioral models of PLL to drive architectural decisions and derive block-level requirements for analog and digital blocks. Work closely with mask design team to implement layout view of designs. Complete top-level spice and mixed-mode simulations to validate top-level integration. Run pre-tapeout verification flows to confirm design meets performance, power, reliability and timing requirements. Define production/bench-level test plans for post-silicon characterization. Work with lab engineers in taking lab measurements to validate IP. Review ATE and lab test results to resolve yield issues and drive bug fixes. Work with system teams in system bring-up and debug. Hold design reviews of blocks with peers/management to show design meets spec targets and requirements.", "key_qualifications": "The ideal candidate should have confirmed taking chips to production with experience in the following areas: Dual charge-pump PLL designs, Fractional-N PLLs, spread-spectrum PLLs, Digital PLL techniques, etc\nHigh speed digital circuit design and analysis\nHigh frequency signal integrity experience\nExperience with LC and RO VCO design. Good knowledge of band gaps, bias, op-amps, LDOs, feedback and compensation techniques as well as digitally assisted analog circuit techniques\nLab and ATE test plans, measurement for characterization, and volume production.", "preferred_qualifications": "", "education_experience": "BSEE with minimum 10 years of experience Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529628"}