{"title": "iPhone Touch Sensing Design Engineer", "summary": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity.", "description": "You will play a key role in designing, developing, integrating, and launching next-generation touch sensing technologies. Your responsibilities will include: Engaging in collaboration with suppliers and cross-functional partners, including Mechanical Engineering, Firmware and Algorithm Engineering, Display Engineering, Process Engineering and suppliers. Sensor design, characterization, and validation. ASIC application design, system-level bring up, and integration. Contribute to sensor technology scoping and proof-of-concept investigations. Failure mode analysis, root cause diagnosis, and system-level problem solving. Business travel may be required to support product development.", "key_qualifications": "Fundamental knowledge of sensor physics, analog analysis, circuit design, linear algebra and statistics. Experience with sensor and systems integration preferred. Hands-on experience in system-level design, architecture, characterization and validation. Attention to detail with proven collaboration and leadership skills. Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams. Proficiency in MATLAB, SPICE, or similar simulation and modeling tools. Excellent written and verbal communication skills and solid teamwork. Experience with high-volume mass production is a plus.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549586"}