{"title": "System Integration Engineer", "summary": "Join the Wireless Technologies and Ecosystems (WTE) team and drive innovation that matters! We build and seamlessly integrated technologies that enrich people’s lives and deliver the best user-experience. We're a hardworking and critical team that helps drive design, develop and integrate cellular chipsets in Apple products. You will join a hands-on system integration team that nurtures creativity and generates novel solutions to deliver engineering precision!", "description": "The Baseband system integration team is looking for an excellent engineer to join our organisation and help us drive quality and performance improvements in our cellular baseband products. You will be crafting efficient, robust, scalable development/testing infrastructure and tools. This is a highly technical hands-on role which requires in-depth technical understanding of software, hardware and test environments in a resource-constrained environment.\n\nYou should be a person who is motivated, who can research, develop and pursue issues, and work with teams of developers and test engineers across the organization. You’ll be involved in all phases of the cellular integration process, and have a direct impact on the experience of millions of customers. You will have a real passion for Performance, automation and Software, along with hands on automation experience.\n\nIt is encouraged that you can track and clearly communicate work you're doing related to release readiness, identify any gaps, and consistently assess new and innovative ways to improve the delivery of our products, as well as promote performance and architecture standard methodologies throughout the engineering team.", "key_qualifications": "Experience with leading small team of engineers as a tech lead or manager\nStrong domain expert with cellular baseband development and testing experience\nExperience in setting up and managing test systems for testing end to end cellular functionality like 2G/3G/4G/ 5G\nExperience in Debug of 4G/5G live network as well as Simulator failures\nExperience with driving defects analysis and root cause with project teams\nProven experience with how cellular network works and interacts with network, knowledge of Phy, protocol n/w layers, bands, etc.\nStrong scripting experience (Python preferred, Perl) and debugging\nExperience with Git, Gerrit and Jenkins job configurations and understanding of software development flow with continuous integration flow knowledge\nExperience in setting up Mac based hosts, knowledge of installing automation tools for crafting test setup.\nExpertise in cellular system test automation execution and Experience in isolating issues, both software/hardware.\nFamiliar with operating test equipment (CMW500, Anritsu, Keysight)\nTeamwork, diligent, good communication skills.", "preferred_qualifications": "", "education_experience": "Bachelor or Master degree in Computer Engineering or equivalent meaningful experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200515698"}