{"title": "Data Scientist", "summary": "Apple is a place where extraordinary people gather to do their best work. If you’re excited by the idea of making a real impact, a career with Apple might be your dream job… Just be prepared to dream big! An expert in advanced analytics, you are passionate about turning data into impactful insights, and driving creative data science solutions. You are skilled at creating analytical models and interactive visualizations. You are a motivated self-starter, comfortable navigating through ambiguity to evaluate complex data, analyze data from multiple angles, build analytical workflows, to deliver findings that directly impact the business. If this describes you, then you should consider joining us.", "description": "- You have outstanding communication skills, proven data science and advanced analytics capabilities, strong business acumen, and an innate drive to deliver results\n- You are a self-starter, comfortable with ambiguity, and enjoy working in a fast-paced dynamic environment - Innovative and strategic approach to reporting and business analytics\n - Develop custom models, algorithms, and interactive visualizations to deliver Supply Chain insights - Wrangle and analyze data to identify patterns, trends, and feature engineering \n- Evaluate business needs through in-depth conversations with business users to understand the domain and apply data science for insights \n- Present key findings to leadership to evaluate business impact, in non-technical terms", "key_qualifications": "5+ Years of experience in modeling and solving large-size decision optimization problems using constraint programming, mixed integer programming, etc., and data science, machine learning, anomaly detection techniques\nMeticulous attention to detail, data integrity, and data wrangling\nPassionate about understanding and solving problems, drawing insights and hidden patterns from data, visualization and data storytelling\nSkilled in Python\nAbility to get things done, experience in delivering end-to-end projects\nKnowledge of relational database technologies such as Snowflake, MySQL, and lightweight user interfaces like Streamlit, Tableau, ThoughtSpot, virtualization using Docker, Kubernetes\nAbility to articulate complex AI concepts in business terms, know how to tell a story to highlight key insights, and present analysis effectively to key partners\nHigh intellectual curiosity to learn and understand business needs\nExcellent social skills to collaborate with cross-functional partners to share knowledge, communicate findings, and integrate feedback\nProven ability to operate comfortably and effectively in a fast-paced, highly-matrixed, rapidly changing environment\nDemonstrated collaboration as well as leadership and influencing skills", "preferred_qualifications": "", "education_experience": "Bachelor’s degree required in Data Science, Machine Learning, Computer Science, Mathematics or Statistics. MSc in Data Science or Operations Research", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550159"}