{"title": "SDET Engineering Manager", "summary": "At Apple, we rely on our employees diverse set of backgrounds and perspectives to champion innovation through extraordinary ideas to surprise and delight our customers. These ideas can come from anywhere. Will that next phenomenal idea come from you? The global ETS eBusiness team is responsible for delivering system connectivity both internally and externally using industry standard solutions and in-house developed systems and platforms. The ETS eBusiness QA team provides test automation support to ensure a high-quality release for our internal business teams and customers across the platform. As a QA Manager, your leadership will play a crucial role in creating, automating and implementing comprehensive test plans and cases that surpass traditional expectations. In your role as a leader within a growing organization, you will manage and lead skilled engineers who will ensure that our features are shipped to the customers with the utmost quality and privacy. If you are a highly motivated manager with aspirations to build powerful automation, cultivate learning, and lead automation efforts at Apple, we want to talk to you!", "description": "As a QA Manager, you will be responsible for qualification of features developed by ETS eBusiness team. Additionally, you will collaborate with various teams to ensure comprehensive test case coverage for features that have significant impact. -  Hire, grow, and lead a team of test automation and quality engineers -  Oversee development of comprehensive feature test plans. -  Partner with engineering managers to ensure features are crafted for testability. -  Update feature teams and management on quality status, calling out and driving issues to resolution. -  Identify and drive investments in tests, tooling, and automation required to scale the team’s efforts to handle a growing project portfolio.", "key_qualifications": "", "preferred_qualifications": "Education: Bachelor’s Degree or equivalent experience or higher, 3-5 years of prior leadership and management experience in QA", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553785"}