{"title": "Payments Software Engineer, Retail Engineering", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Working on innovative retail payment solutions is an opportunity to work on the first-in-market solutions. Gain experience with global payment solutions in the retail industry. Increase your expertise in the payment industry with hands-on experience on devices, protocols, and processes, and learn from a team of knowledgeable payment experts with collective experiences.", "description": "As a Payments Software Engineer on our team, you will help build a next-generation payment platform for Apple Retail. You will also be responsible for developing and integrating the payment application with payment terminals and gateways and certifying the solution with the acquiring banks. You will be working with business partners, store personnel, banking partners, and cross-functional teams within Apple to develop software, controls, and processes for payment processing. In this role, you will get the opportunity to gain experience with global payment solutions in the retail industry. You will increase your expertise in the payment industry with hands-on experience with devices, protocols, and processes and learn from a team of knowledgeable payment experts.", "key_qualifications": "At least 3 years of industry experience with Java / Swift / Python, Chip & PIN technologies (especially EMV L2, Contactless kernels), Knowledge of Bank messaging specifications (ISO-8583), Knowledge of online PIN protocols (ANSI x9.24 / DUKPT / Master Session), PCI compliance and Card security, Software security Standards, Oracle, MySQL, Cassandra, HTTP(S), TCP/IP protocols, Bluetooth, REST, SOAP architecture, Github / Maven / Gradle build tool and D2P processes", "preferred_qualifications": "Strong communication skills and experience in communication with payment vendors across the globe, Knowledge of performance improvements, multithreading, and event-driven processing methods is necessary, Ability to learn and apply new technologies quickly and deliver results on time with high quality, eCommerce / Banking / Retail industry experience, Demonstrating knowledge of Mobile App developments, Interacting with the Peripherals over Bluetooth, Cryptography, Device Drivers, and MFi certification., Bachelors or Masters in Computer Science", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557018"}