{"title": "AIML - Sr Quality Program Manager, Data Operations", "summary": "Imagine, what you could do here? At Apple extraordinary ideas have a way of becoming great products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "As a Senior Eng Program Manager, you will orchestrate initiatives to ensure the highest level of data quality for our AIML training. You will collaborate closely with Engineers, Data Scientists, and Machine Learning Engineers to develop, implement, and maintain tools and processes that evaluate and improve the quality of our data. Your insights and strategies will directly influence the accuracy and reliability of our AIML models. You will be responsible for the following: Design, develop, and supervise the implementation of processes and tools to assess the quality of data used in AIML model training. Build metrics and KPIs to evaluate data accuracy, consistency, and relevance. Work with Engineering teams to develop automated logic checks that will identify inconsistencies and potential issues in the training data. Lead the integration of quality processes into existing data pipelines. Collaborate with Data Scientists to scrutinize annotation data and develop strategies for continuous data quality improvement. Provide feedback and ensure alignment of data quality with annotation guidelines. Engage with Machine Learning Engineers to determine how data quality variations influence AIML model performance. Recommend adjustments to data collection, preprocessing, and utilization based on model performance analysis. Stay on top of the latest trends and advancements in data quality management. Recommend and implement improvements to our quality processes, tools, and methodologies based on industry best practices. This is a highly reciprocal position that requires working with Engineering, Quality, Training and Production Ops to deliver world-class solutions. And most of all, you are able to manage and lead change effectively while maintaining Apple culture and standards. Interpersonal skills and technical product knowledge and expertise are essential for this role. Applicants should thrive in dynamic, fast paced situations and welcome critical-thinking opportunities.", "key_qualifications": "N/A", "preferred_qualifications": "Master's degree or higher in Computer Science, Data Science, Engineering, or related field. Proficiency in scripting or programming languages commonly used in data analysis (e.g., Python, R).", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $238,300 and $388,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552094"}