{"title": "Software Engineer, Ad Platforms ", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content from the world’s best journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with passionate fans. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone!", "description": "The Ad Exchange team at Apple provides a highly available, low latency platform central to serving high quality privacy preserving Ads on Apple devices. The Ad Exchange team is also responsible for multiple business critical services and tools and support both Search and Display ads. YOU WILL: -  Lead cross-functional engineering teams, collaborate with multiple technical and business teams across Apple, to deliver high-quality, timely solutions for Ad Exchange orchestration -  Design and implement performant services created with the right principles to support rapid growth with minimal operational overheads -  Work with Advertising domain experts to engineer systems that can handle a variety of Ads use cases", "key_qualifications": "At least 3-5 years of experience in software engineering\nStrong understanding of Microservice Design\nExpertise in building backend distributed systems\nExperience with creating solutions using public cloud technologies and APIs\nAbility to work with and lead cross functional teams\nProficiency in Java is required", "preferred_qualifications": "", "education_experience": "Bachelors degree in Computer Science or equivalent is required. Master's degree preferred.", "additional_requirements": "Programmatic Ads experience a plus.\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.\nApple benefits programs vary by country and are subject to eligibility requirements.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549209"}