{"title": "AMR Vendor Strategy Direction & Planning Manager", "summary": "At Apple, we believe that hard work, a fun environment, creativity, and innovation fuel the ultimate customer experience. We believe each customer interaction is an opportunity to delight, engage and inspire – and that by focusing on the smallest of details, we can make big impact with our customers. Building this environment starts with you! The AppleCare Global Vendor Strategy (GVS) team is seeking a Direction & Planning Manager to lead our Americas (AMR) Region in the strategic planning of our outsourced Supplier network. This manager will lead a team of Vendor Alliance Managers and Implementation Project Managers supporting regional initiatives while aligning with global best practices.", "description": "The Direction & Planning Manager will work with their team to assess capabilities, explore offerings, understand local complexities and needs, and will work closely with our Corporate Procurement team in conducting RFPs, exploratory sourcing, etc. This person will also engage closely in addressing strategic partnership issues or concerns with key internal business partners, including AppleCare Executive Leaders, the Partner Operations Team, and the Regional Leads. Other engagement points include the GVS Governance; Supplier Responsibility; Risk & Compliance; and Security teams.  Our team ensures our Advisor headcount requirements are met in the short, medium, and long term for all support channels across all languages supported. This leader is responsible for developing strong relationships with our both existing and prospective Suppliers. This team acts as an escalation channel for our internal business teams that engage with Suppliers directly, as well as with our Supplier executives on engagement issues that can arise in this space.", "key_qualifications": "5+ years people management experience with a history of creating and fostering an inclusive work environment, Able to travel approximately 1-2 times per quarter, sometimes more, 8+ years vendor management experience or contact center vendor experience", "preferred_qualifications": "Demonstrated ability building and maintaining client/partner relationships, Outsourcing experience with both operational and strategic responsibilities, Analytical skills and strong attention to detail, Passionate about for the customer and advisor experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559997"}