{"title": "Contact Center Coach, Retail Customer Care", "summary": "As Steve Jobs said in 1997 when introducing the Apple Store Online: “We make amazing products. We should have an amazing purchasing experience.” Twenty-five years on, the Apple Store Online is one of the world’s biggest and most successful e-commerce sites. Our global mission is to bring a seamless, high-quality, digital retail experience to all of our customers. In Retail Customer Care, our team is able to bring this experience to life. The Learning and Quality team is looking for a determined individual who believes that the customer experience is at the heart of what we do and works tirelessly to help our teams achieve just that.", "description": "In this role, you will work with the quality and learning and development teams (in region and worldwide) as well as collaborate with the Retail Customer Care leadership. Through contact review analysis, you will work to identify business trends, gaps and provide expert level coaching to help our teams and leaders to reach business goals and enhance the customer experience. You will work in partnership with the leadership team to support ongoing group, specialist and leader coaching conversations and, if needed, create supplemental materials to help guide these sessions. A Coach must communicate effectively during a coaching sessions and use language that will have the greatest positive impact on the teams. They will need to be able to ask questions that reveal the information needed for the strongest benefit to both the coaching relationship and the teams. In addition, a coach must have the ability to focus on what our partners and teams are saying and not saying and to understand the meaning of what is said, including context to support their thoughts and ideas.", "key_qualifications": "N/A", "preferred_qualifications": "All candidates who meet the key qualifications are encouraged to apply.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "N/A", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553127"}