{"title": "Sr. UI Engineer (Web), Pricing and Partner Monetization", "summary": "The Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 37 languages to more than 175 countries. These engineers build secure, end-to-end solutions.", "description": "Our dynamic Pricing and Partner Monetization team is looking for a UI Engineer that will be responsible for implementing and maintaining online tools that are both internal and public facing. As a member of our team, you will build web pages from design comps to pixel perfect pages. You will work across multiple teams including design, operations, QA, editorial, marketing, business and software engineering to build tools that meet Apple’s standard for visual perfection.", "key_qualifications": "", "preferred_qualifications": "Understanding of design/UX principles and ability to participate in design discussions. Experience working within an organizational code base in multiple environments across numerous ongoing release cycles. Experience integrating front-end web/UI interface with back end application server technologies. Strong communication, organization, and leadership skills required", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560155"}