{"title": "Senior Wireless System Application Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have unique and rewarding opportunity to build our future products that will delight and encourage millions of Apple’s customers every single day! New generations of emerging applications demand performances in specific definitions. Wireless communication technologies are evolving, and the mission is to develop solutions to enable the next generations of applications to introduce innovations into our life, providing superior user experiences. Our goals are to come up with architecture, protocols, integrated systems and algorithms to achieve robust performances, meeting the demands for the next generations of applications over the practical wireless medium conditions, where we expect more congestions from larger number of devices and co-existing wireless technologies. In this technical role, you will be at the center of a silicon design group, responsible for wireless system design for state-of-the-art wireless SoC products. You will be focusing on leading the developments and collaborate closely with different teams to come-up with specification and design details, implementation, conduct pre-silicon validations, post-silicon bring-up, performance and reliability analysis and optimizations, to assure the solutions achieves the requirements and produce satisfying user level experiences. The focus of the work to enable the next generation applications may be on developing advanced architectures, PHY/MAC cross-layer and cross-functional protocol and algorithm designs and radio/PHY integrations, enhancing latency, improved medium efficiency, interference and CoEx management in congested environments, extended ranges, reductions of power consumptions, and more.", "description": "Core responsibilities include, but are not limited to, the following: •Design and simulate state-of-the-art wireless communication system for next generations of applications. •Implement system models and investigate innovative architecture, protocols, algorithms in PHY/MAC cross-layer to mitigate the impact congested radio environment and achieve robust performance. •Collaborate with product teams and come up with novel architecture, protocols, integrated systems, algorithms to meet the requirements from the emerging applications in a congested radio environment. •Perform simulations to prove the effectiveness of the designed architecture, protocols, algorithms, and validate them on emulation systems. •Work with firmware designers to realize the software part of these methods with high efficiency software implementation. •Work with digital designers to realize the hardware part of these methods with power and area efficient digital implementations. •Bring up, test and characterize the designed algorithms, optimize the performance to achieve the targeted performances with production qualities on real silicon in lab.", "key_qualifications": "Extensive experience in developing wireless communications systems on algorithm designs, architecting, integrating systems and protocols. In-depth knowledge on wireless communication system (OFDM/MIMO, etc.), including hands-on experience on lab testing and characterization. Deep understanding of communication theory and signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization and coding theory) Experience with multi-radio coexistence management Experience with system optimization in congested radio environment through cross-layer designs Knowledge on modem and microprocessor architecture. Experience with FW design is a plus. Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation. Knowledge in existing protocols: 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE Experience with emulation systems and virtual platforms - a plus. Experience on bring-up real silicon in lab, as well as using with lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) - a plus.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant experience required. MSEE/PhD preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534401"}