{"title": "Graphics Software Engineer", "summary": "Do you love problem solving and creating elegant solutions to highly complex technical challenges? As part of our Silicon Engineering team, you’ll help develop and manufacture our next-generation, high-performance, power-efficient graphics processors! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this team means you’ll be responsible for crafting and building workloads that ensure Apple devices are best-in-class. Join us to help deliver the next groundbreaking product containing an Apple GPU! In this highly impactful role, you will be responsible for tooling and workloads used by teams involved in all stages of the GPU development lifecycle, from early feature specification through silicon bring-up and beyond. You will work with other teams at engineering sites around the globe towards the shared goal of ensuring that Apple GPUs meet the highest quality and efficiency standards. This job involves designing, developing, and maintaining workloads for GPU architectural validation and design verification.", "description": "Join the team to play a central role in developing upcoming Apple GPUs. You will have the opportunity to influence and directly impact the tools and techniques used to ensure the GPU is functional, performant, and within the expected power envelope. In this role, you will work with many other teams involved in GPU development, including but not limited to Architecture, Modeling, Performance, Power, Design Verification, Silicon Validation, and Manufacturing. Core responsibilities of this highly collaborative role are: - Developing critical workloads for graphics core verification. - Leading architectural validation of key features in the design. - Working with the GPU hardware teams from design bring-up through post-silicon, to identify and debug architectural, logic, and silicon issues. - Working with the GPU software teams during production driver bring-up to rapidly identify and resolve software issues.", "key_qualifications": "We are looking for candidates with relevant coursework in Computer Graphics or Machine Learning and Computer Architecture. Demonstrated knowledge of the software graphics pipeline and its application to computer graphics and / or ML. Demonstrated knowledge of GPU programming via OpenGL, Vulkan, Metal, DirectX, CUDA, or other APIs. Demonstrated knowledge of C++ programming. Architectural validation and design verification knowledge is a plus. Knowledge of continuous integration systems, automated build systems, and regression systems is a plus. Strong communication skills are a pre-requisite as you will collaborate with multiple groups.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of a B.S. degree and 3+ years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551726"}