{"title": "US-Manager", "summary": "Do you have a passion for teaching and building relationships with others? Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. As a Manager, you work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "As a Manager, you're responsible for inspiring your team to create ownership opportunities for customers on the sales floor. Elsewhere, you guide the talent that provides technical support and training, while working in partnership with the business team. And behind the scenes, you oversee operations such as inventory and visual merchandising. You actively build your teams  - hiring, training, and developing team members in all these disciplines and more. Supporting Apple simplicity is a complex job, and you make it look easy.", "key_qualifications": "", "preferred_qualifications": "Proven ability to drive amazing customer experiences — and results — through team development. Experience with diplomatically managing multiple commitments to customers, staff, and operations. Ability to adapt to challenges while remaining calm in a constantly changing retail environment. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. Role model inclusive leadership behaviors and build, develop and retain diverse teams. Take action to ensure a safe, respectful, and inclusive environment for all team members. You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting. Cross-industry experience is welcome. You have a passion for learning about Apple technology and products. Multilingual ability is a plus. You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $40.40 and $60.60/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560258"}