{"title": "AI/ML — Senior Data Engineer, ML Innovation", "summary": "We are looking for an experienced software engineer to build Machine Learning & Experimentation platforms to empower Apple engineers in delivering great user experiences. We are addressing key challenges to accelerate the adoption of ML across all the OSes and Apple products/services operating at the scale of 1+ billion devices. Our work is complex, challenging and highly visible. Collaborate with ML and OS engineers to build data applications that provide reliable and timely insights for Apple's most exciting applications & services. Does this interest your creative and development chops? If so, come join our team!", "description": "You will be responsible for designing and building data applications to enable on-device and device/server side combined ML workflows. For example, build data service to analyze telemetry from billions of devices in a timely fashion and deliver data-driven insights to inform product launches. In this role, you will collaborate with cross-functional partners, customers across Apple to build platform roadmap for next 2-3 years.", "key_qualifications": "Experience in building large scale data processing and distributed systems using technologies like like Spark/Kafka\nHands-on experience with managing and monitoring data collection and analytics pipelines at the application level\nExperience with SQL / NoSQL databases\nExperience with Object oriented programming languages like Java / Scala / Python\nExperience with Kubernetes or similar technologies\nWorking knowledge of Trino\nExperience with Log processing and mining frameworks like Splunk, Prometheus, etc\nExperience with deploying and managing CI pipeline with Jenkins or similar tools\nExperience with Machine Learning platforms is a plus", "preferred_qualifications": "", "education_experience": "BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547995"}