{"title": "AIML - Machine Learning Engineer", "summary": "Do you to be part of the Siri team that puts large language models into billions of devices? We are an applied ML team of around 30 engineers looking for a ML engineer to help develop the next generation Siri experiences. We work closely with various Apple teams in Cambridge UK and Cupertino CA.", "description": "As a member of the team you will be responsible for bringing innovative ideas to the next generations of Siri. Our work involves language modelling, simulation, sequential decision making, evaluation, deployment, and so on, spanning the entire product life cycle from project inception to shipping models on billions of devices. The ideal candidate would have expertise with large language models and agentic reasoning.\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "empty string", "preferred_qualifications": "Proven industry experience in building product features based on ML\nIndustry experience in implementing and training large language models\nExperience in reinforcement learning and/or decision making in the context of agentic reasoning\nExcellent problem solving, critical thinking, and interpersonal skills\nExperience using deep learning toolkits PyTorch or JAX\nDetailed knowledge of programming languages Python or Swift", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558986"}