{"title": "Technology and Metrology Engineering Program Manager - Sensors", "summary": "Apple is where you go to do your life’s best work. Apple crafts consumer electronics that have touched millions and changed the way people harmonize with electronic devices around the world. Behind every Apple product is a deep bench of very hardworking multi-functional teams, where the attention to detail defines success versus failure.", "description": "The Technology Program Office in Hardware Test Engineering (HWTE) champions technology calibration and test strategy while balancing between quality/customer experience with operational requirements. In this highly multi-functional role, we are looking for leaders to engage in early stages of technology development supporting incubation, prototyping, design validation, simulation & metrology development activities, as well as identifying mass production intent solutions. This would require proactively driving alignment and convergence plan with multi-functional teams, identifying risks & mitigating them — all while communicating frequently to senior leadership across Apple.", "key_qualifications": " ", "preferred_qualifications": "Understanding of hardware/software architecture and interoperability of sophisticated systems\nKnowledge of statistical data analysis, design, process and test FMEA\nExperience with simulation tools/platforms\nHigh volume consumer electronics calibration, testing and manufacturing experience\nTechnical leadership and/or project management experience with excellent oral and written communication skills\nAbility to bring focus and clarity to sophisticated situations while supervising the bigger picture and the needs of a rapid development cycle.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558939"}