{"title": "Supply Demand Management", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Apple is looking for a dynamic, highly motivated, Asia Operations Supply Demand Planner. Our China team will be the voice of Apple’s worldwide customers to the production and operations teams in China. As the liaison Apple’s headquarters and Apple’s Asia Operations team and OEM partners, this person will develop, communicate, and complete end-to- end product demand and supply plans across all channels of distribution in over 80 countries for a current or future product line. Product line assignments will be made at the time of hire in any of Apple’s multi-billion dollar businesses, including Mac, iPod, iPad, iPhone, Wearable and Accessories.", "key_qualifications": "", "preferred_qualifications": "Prior experience in Sales & Operation with supply and demand planning is strongly preferred. In this role, you will combine a working understanding of outstanding supply chain practices, strong problem-solving capabilities, and business savvy. You are encouraged to exert thoughtful influence in a matrixed organization - should be a strong teammate and communicator. You should be confident to speak publicly to senior management. Strong understanding in heuristic and non-linear optimization methods. Have experiences in predictive and optimization modelling, Gurobi Solver is preferred. Ability to troubleshoot and root cause results from thousands of intersection data. Have experience in crafting and using applications such as Tableau is preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559754"}