{"title": "Sr. Software Engineer - Data Platform (ASE)", "summary": "The Data Platform team in Apple Services Engineering builds and runs data services, tools, and pipelines to support Apple Music, the App Store, Apple TV+, and more. We are looking for enthusiastic engineers to join us in building the next generation of our data platform. We work closely with engineering teams across Apple. We focus on building systems to deliver data requirements at high scale and reliability, whilst meeting Apple’s belief that privacy and security are paramount. You will be encouraged and supported to do your best work and to have fun doing so.", "description": "We provide platforms, services, tools, and datasets for use by engineering teams within Apple. We cover batch, realtime, and near-realtime requirements, handling petabytes of data and ultimately supporting hundreds of millions of customers. In this role you will build infrastructure to drive Apple’s highly visible global-scale systems. You will work with attention to usability, performance, scalability and high availability of your systems. You will support other engineering teams as they adopt these systems for their own products.  We are looking for a strong, enthusiastic developer to join as a member of this group. You will have a tremendous amount of individual responsibility and influence over the direction of critical services for years to come.", "key_qualifications": "No information available", "preferred_qualifications": "In-depth knowledge of Cassandra. Experience with other storage systems.\nUnderstanding of data storage technologies, for example: serialization, schemas, file and table formats for large-scale data processing. Understanding of formats such as Apache Iceberg and Parquet is a benefit.\nAn ability to communicate with users and drive adoption, to troubleshoot and diagnose issues, and to work effectively with teams adopting our tools.\nAbility to write and deploy well-tested production code. A drive for modern software engineering practices.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554713"}