{"title": "Software Beta Program EPM", "summary": "Do you love solving challenging problems in a fast-paced, dynamic environment where you’ll work with many different teams across Apple? Work as part of the Beta Program team for our software releases! The Software Beta Program allows customers to provide feedback to Apple on software projects before and after they are released. We are the first responders for outside issues during the development and launch cycle of Apple’s software products. Our engineers use customer feedback to advise and craft engineering response throughout the development cycle. On this team, you will interact with external customers, engineering teams, project management staff, and other quality organizations to collect and process customer feedback, identify key trends, and champion high-impact issues to drive the best possible releases.", "description": "This is a diverse role that includes: Directly contacting external customers, internal program management, and engineering teams Monitoring pre and post-release public feedback to identify and call out new issues in the field Reporting on progress of seeding programs, assessment of incoming feedback, and other project status Supporting ongoing development of our seeding program tools Investigating issues reported by our outside users through test reproduction, debugging, and diagnostics analysis Reviewing bugs and work with engineering teams to isolate and appropriately prioritize response", "key_qualifications": "Real passion for user-focused design & high quality technology Excellent social, verbal and written communication skills Comfortable and adaptable in a dynamic and informal environment, and able to respond to changing priorities quickly and expertly Self-motivated and dedicated with proven creative and critical thinking capabilities Experience in QA, project management, or customer technical support for software products Ability to debug hard problems and investigate root cause analysis Detailed knowledge of Apple’s software products", "preferred_qualifications": "", "education_experience": "BS/MS, preferably Computer Science or related experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548665"}