{"title": "Ergonomics Product Design Engineering Lead - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us.", "description": "As a lead Product Design Engineer on this team, you will be owning a mechanical architecture that successfully achieves comfort and fit across the population. Through this, you will be conducting analysis, design work, prototyping, and user studies in order to create and set specifications to guide the design. In this role you will engage in frequent multi-disciplinary collaboration with teams like Industrial Design, Project Management, Human Engineering, Human Factors, Marketing, Retail, SW, Materials, EE, Display, Softgoods, and more. You will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day! In this role, you will be leading a cross functional team of product design engineers and product data analysts spanning the entire spectrum of product design development: concept & spec development, prototyping and testing, CAD and FEA analysis, detailed design, DOE development, and user testing. This work is undertaken in our offices, our labs and workshops, and in partnership with our vendors.", "key_qualifications": "Empty", "preferred_qualifications": "Master of Science in Mechanical Engineering or adjacent field, Experience in ergonomics, biomechanics, or human factors a plus, Experience with high-volume mass production, Consumer electronics knowledge in a majority of these disciplines: industrial design, optics and lenses, cameras, sensors, displays, PCBs and flexes, silicon, antennas, batteries, thermals, Familiarity with tolerance analysis, experience releasing 2D drawings, Experience designing for weight reduction and structural optimization, Working knowledge of FEA principles", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560345"}