{"title": "Full stack Developer", "summary": "Imagine what you could do here. At Apple, we believe new insights have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionised entire industries.", "description": "-  Lead the architecture, design, and development of robust full-stack solutions. Collaborate with product managers, designers, and other partners to understand project requirements. Mentor and provide technical guidance to junior developers. Participate in code reviews to maintain code quality and ensure best practices are followed. Continuously research and evaluate new technologies to drive innovation. Troubleshoot, debug, and optimize application performance. Stay ahead of industry trends and emerging technologies.", "key_qualifications": "We are looking for someone with the following qualifications: - Demonstrated experience as a Full Stack Developer, with a focus on both front-end and back-end technologies. Strong proficiency in front-end frameworks such as React, Angular, or Vue.js. Experience with at least one back-end technologies such as Java, Scala, Go, Python etc. Solid understanding of database systems (SQL, NoSQL). Extensive use of APIs and strong understanding of HTTP(S) and REST architecture. Knowledge of cloud services and deployment (AWS, Azure, Google Cloud). Familiarity with DevOps practices and CI/CD pipelines. Experience with micro-services architecture. Familiarity with containerization and orchestration (Docker, Kubernetes). Strong problem-solving and analytical skills. Excellent communication and leadership skills. NICE TO HAVE: Experience with data stream processing, data platforms at scale and distributed systems i.e. Spark, Kafka, Hadoop. Contributions to open-source projects.", "preferred_qualifications": "", "education_experience": "B.Tech. Degree in computer science or equivalent field with of 3 - 6 years hands-on programming experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524442"}