{"title": "Wireless Systems PHY Integration and Validation Engineer", "summary": "As a Wireless Systems PHY Integration and Validation Engineer, you will be a core member of our highly innovative Wireless System-on-Chip (SoC) design team that defines modem architectures, develops PHY algorithms, and invents embedded DSP algorithms for chips enabling exciting new wireless applications. Your focus will be on Radio-PHY-MAC interfaces, which involve protocols and algorithms, infrastructure and workflows for the successful integration of our wireless products. In addition, you will be responsible for specialized PHY system calibrations and validation flows which involve lab equipment, specialized test scripts and characterization. Application areas include sensing and specialized wireless audio. Products enabled/enhanced by our team’s SoC’s include specialized audio headsets such as AirPods and iPhones.", "description": "-  Work closely with other PHY systems, analog and digital designers, and MAC FW & SW Engineers to ensure that functional and performance interface details between the Radio-PHY-MAC are accounted for. \n-  Test, verify and be the direct point of contact for interface aspects.\n-  Architect, design and implement specialized PHY system validation setups and flows, devise test plans and post-process mass amounts of data to capture performances and identify and root cause system inefficiencies.", "key_qualifications": "Expertise/familiarity with Wireless Communications, wireless chip development, and lab flows for integration and validation.\nSolid grasp of complex wireless systems with a strong capability to comprehend dependencies between system components and protocol layers and their interactions.\nExperience in lab FPGA/silicon bring-up, PHY/RF/MAC testing and debugging and the usage of lab equipment.\nExtensive hands-on SW programming skills for the simulation of sophisticated systems from RF/PHY layer signals, MAC protocol/networking simulations and lab automation test scripts.\nProficiency with MATLAB/C/C++/Python required.\nExperience with handling and processing large amounts of field and lab data, including user-friendly visualization of complex test setup results, measurement accuracies, system latencies, etc.\nFamiliarity with common analog/RF impairments encountered in wireless systems.\nExperience with and/or knowledge of industry standards such as Bluetooth, Ultra-Wideband, GPS, and/or other wireless protocols.", "preferred_qualifications": "", "education_experience": "BS with 3+ years with a focus on Dig. Comm’s & Signal Proc required. MSEE/PhD preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550101"}