{"title": "Engineering Program Manager, Financing & Retail Systems - Retail Engineering", "summary": "Imagine what you could do here. At Apple, excellent ideas have a way of becoming great products, services, and customer experiences. Bring passion and dedication to your job and there’s no telling what you could accomplish. The people at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries!", "description": "We are looking for an Engineering Project Manager to lead the charge in developing innovative software solutions that bolster our Retail Store teams. You'll orchestrate the planning, coordination, and execution of technology integrations and releases, directly influencing the exceptional customer experiences our Retail Store teams are known for. This person will be responsible for facilitating the development of new workflows and ongoing improvements of production applications. You will lead all aspects of multiple concurrent projects and features including scope, requirements, timelines, resource allocation tracking, stakeholder management, communications, and risk assessments.", "key_qualifications": " ", "preferred_qualifications": "Experience interacting with or using task management and software workflow systems such as JIRA, Excellent organization skills, acute attention to detail, ability to balance multiple tasks in a constantly evolving environment, Effective facilitation skills, fostering productive meetings and leading the team to generate solutions and make decisions in a timely manner throughout a project: requirements gathering, design reviews, cross-functional stakeholder meetings, reporting status and schedules, An extraordinary communicator at all levels of the organization with a knack for encouraging positive relationships with the ability to tailor communication style to multiple audiences, Naturally accountable, responsible, and self-motivated, Willingness to adapt in a highly demanding, team-oriented, and fast-paced environment with rapidly changing direction and new challenges, Bachelors and/or Master’s degree in relevant field, MBA a plus, Certifications relations to Agile Project Management", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556976"}