{"title": "Partner Marcom Manager (Vietnam) - Based in SG", "summary": "The role of the Marketing Communications (Marcom) group at Apple is to ensure the flawless development and execution of world-class communications in support of Apple’s business goals. As we grow our business in South East Asia, we are recruiting a Partner Marcom Manager with in-depth local marketing communications experience due to the growing importance of partners across our various markets. This person will work as an integrated part of the Channel / Partner Marcom team to support the growing scope and importance of Apple’s presence in Vietnam. The role is based in Singapore. Every day millions of consumers around the world interact with Apple and its products in the Indirect channel through mobile, digital and in-store experiences. The successful candidate will drive strategies to provide customers a thoughtful, engaging and seamless experience.", "description": "The Partner Marcom Manager,Vietnam plays a vital role in shaping how Apple shows up within our partner environments especially with managing flawless launches of Apple products within carrier advertising, digital and in-store communications. This role requires a strong understanding of the customer journey and how they can be best orchestrated to maximise the impact of Apple product presentation and deliver the most compelling Apple product stories. The Partner Marcom Manager, will need to develop strong relationships at the partner level as they will in partnership be developing impactful marketing campaigns, including brief development, creative feedback, timeline management and internal reviews/ approvals. This role will also partner internally and represent your partners with key stakeholders, including partner marketing, channel, advertising and sales.", "key_qualifications": "Fluency in spoken and written English and Vietnamese. 7-10 years experience in account management, preferably at a creatively-driven design firm, ad agency, or in-house marketing communications or creative services department. Experience working within telecommunications a plus. Experience with channel marketing or marketing in branded environments a plus. Extensive experience in brand communications across various mediums Successful track record building productive relationships with creative people. Developing, producing, and executing marketing campaigns with international brands. Passion and eagerness to develop and execute best-in-class marketing campaigns with external partners. Excellent presentation and communications skills. Problem solving and analytical capabilities. Regional experience preferred especially knowledge of Vietnam. Strong team player who can work collaboratively within a wider team. Business Travels will be required", "preferred_qualifications": "", "education_experience": "We anticipate you will have a Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550321"}