{"title": "Software Engineering Manager (DNS), Infrastructure Services", "summary": "Apple is looking for a Software Engineering manager to develop the next generation of Apple DNS infrastructure. You will be responsible for critical systems, such as Apple DNS, that every single Apple team and billions of customer devices depend on! The work for the team (and engineering manager) involves contributing infrastructure code (Go, shell, C...) to handle services and clusters of servers on six continents in various network environments, address production issues and design for the future. You will partner with OS and services teams to deeply integrate our devices with our services. Your team’s work will help improve the performance of Apple Services such as Apple Music, Apple TV, App Store, and many more!", "description": "You will be responsible for collaboratively setting direction for how Apple operates DNS infrastructure, collaborating with teams across Apple. You’ll also be responsible for handling relationships with various open source communities we collaborate with. Day to day, you will be working with your developers to set priorities, review code and architecture, and lead production deployments. Your team will be responsible for second tier operational support. You will be required to review performance data and investigate any performance regressions that arise.\n\nWe are looking for an engineering manager with a validated experience of deeply understanding a technical system, being responsible for the evolution of its architecture and contributing infrastructure code for it in the service of other teams and systems. The candidate should be able to dig into the failures of said systems and work in a collaborative way toward urgent remediation as well as longer term architectural and procedural changes.\n\nPrior experience with DNS is a requirement. We expect the ideal candidate to over time grow to that level and contribute their unique perspective on the various systems and sub-systems the Apple DNS team is responsible for. The engineering manager filling the position will regularly dive into RFCs and interact with other teams in writing the RFCs.", "key_qualifications": "3+ years experience in software engineering management\n10+ years experience in a software engineering role\nExperience mentoring a team at varied skill levels in deep technical details\nExperience participating in and building a highly productive blameless team culture\nExperience with designing, implementing, and supporting highly scalable infrastructure services\nExcellent written and communication skills is a requirement\nExperience with large server deployments\nExperience building highly resilient OS image / install processes\nExperience with Unix, specifically FreeBSD\nKnowledge of IPv6, UDP, HTTP, BGP etc a plus\nExperience with revision control systems, continuous integration, unit testing, code reviews and configuration management systems will make the job more fun", "preferred_qualifications": "", "education_experience": "Bachelor's/Master's degree or equivalent relevant work experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550459"}