{"title": "Production Designer", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. This role requires blending design and production expertise to bring bold ideas to life with meticulous detail. The Production Designer will bridge the gap between Creative Design teams and Production Studio teams, ensuring the original design vision is maintained through every stage of implementation. Responsibilities include maintaining design consistency, overseeing project transitions from creative concepts to mechanical production, and ensuring excellence and consistency in every project. Whether working on retail, channel, packaging, corporate identity, or events, this role transforms creative concepts into stunning realities!", "description": "Primary day-to-day responsibilities include but are not limited to: supporting creative teams, assisting design teams with project implementation, and ensuring design and production quality. Ideally, you will collaborate effectively across teams, utilizing your expertise and experience to enhance project outcomes. Anticipate and solve issues addressing potential design and production problems related to image cropping, scaling, resolution, color, and finishing. Drive results and solve problems efficiently, continuously seeking new ways to improve processes among multiple collaborators with varying priorities. Strategize and adapt designs through planning and execute on core creative elements across various print and digital deliverables, adapting designs to different aspect ratios and scales. Developing, maintaining, and ensuring consistency and clarity on design documents, crafting and leading design roadmaps and pre-production layouts. Building production guidelines by developing documents, outlining design direction and production specifications for internal and external partners. Demonstrating resourcefulness and adaptability in meeting project needs will be important. Seeking to enhance workflow, tools, and processes, therefore improving efficiency and quality in design and production tasks.", "key_qualifications": "7+ years of production design experience in an agency or in-house corporate graphic design environment; Expertise in Mechanical Production, Adobe InDesign, and Illustrator; Highly proficient in Photoshop, Bridge, and Acrobat; Implementation of creative design direction across various mediums - versatility to work off sketches, rough digital layouts, and verbal communication", "preferred_qualifications": "BA or BS degree in Design or related field of study, or equivalent experience; Strategic thinking capability, with the ability to evaluate the implications of decisions at both the functional and strategic levels; Proactive and creative solution-oriented thinking and execution; Strong collaboration skills - specifically building relationships and working toward shared objectives; Effective partnership skills, maintaining professionalism under tight deadlines and in ambiguous situations; Highly adept at working with diverse teams: creative, project management, print production, mechanical studio, editing, and content; Ability to cut through ambiguity in high pressure environments; These preferred qualifications highlight a blend of functional expertise and desired knowledge, skills and abilities on how you can contribute effectively within a collaborative work environment!", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $216,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555308"}