{"title": "Software Engineer,  Enterprise Systems", "summary": "Imagine what you can do here at Apple! Apple is a place where extraordinary people gather to do their lives’ best work. We believe hard work, creativity, and innovations fuel the ultimate customer experience. Each customer engagement is an opportunity to delight, engage, and inspire – and by focusing on the smallest of details, we can make big impacts on our customers. We are looking for a person with a solid background in building applications, services using Java/J2EE & Spring frameworks.", "description": "As a successful teammate, help build innovative software applications. As a software engineer, be a member of the team that implements new applications, improve existing application features, while adding performance and software quality metrics to our codebase. Design and develop enterprise level, highly available web application platforms applying Java, Spring frameworks, JPA & Hibernate, REST/SOAP web services. Develop prototypes and POCs to demonstrate new ideas or illustrate the use of new technologies and how to apply it into our systems. Work with project managers, architect, technical leads, and vendors on defining the scope, achievement, deliverables, and resources needed for the project. Able to build a positive relationship with multi-functional internal organizations Thrive in a multi-functional team on high-profile, critical projects. This position requires a self-motivated individual with strong technical understanding, problem-solving, and communication. Effective presentation, oral, and written business communication skills with various audiences and levels. Able to empower with passion, mentor, and lead geographically distributed teams Maintain focus and prioritize a challenging workload while achieving extraordinary quality.", "key_qualifications": "10+ years of proven experience in architecting, and developing event-based, distributed, highly available systems. 10+ years of proven experience and knowledge in developing and handling enterprise-level technology at a global scale. Strong knowledge on securing applications, deep understanding of OWASP top 10 risks and solutions. Experienced with Micro-services, CI/CD, Container orchestration. Hands-on with one or more cloud platforms and managed services. Expertise in Java, Springboot, Kubernetes and Docker. Experience working with Client facing web apps. Solid knowledge of web application development using client side frameworks/libraries like AngularJS/VueJS, jQuery, Bootstrap. Hands on experience in developing SPA (Single Page Applications). Experience with relational and no-SQL databases, distributed cache and clear understanding of standard methodologies & problem areas while handling large distributed datasets. Experience in building e-commerce applications.", "preferred_qualifications": "Exceptional software engineering background with an outstanding body of work demonstrating experience in software development, solution architecture, and product management. Understand Micro-service Architecture, SAP Cloud Foundry features & capabilities. Thorough understanding of Software Development Lifecycle, tools and standard methodologies. Solid understanding of source control software (SVN or Git), experience with build and deployment tools, e.g., Maven, Gradle Experience with automated testing methodologies and frameworks. Sharp solving skills and real world systems deployment experience. Consistent track record with rapid development cycles and demanding schedules. We seek a self starter, forward-thinking person with strong leadership capabilities. Excellent interpersonal skills and attention to detail for documenting and reviewing designs.", "education_experience": "Bachelor’s degree in Computer Science or equivalent work experience is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550647"}