{"title": "Data Center Construction Project Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. In RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and forward-thinking group that manages Apple’s workplaces and workplace services. We develop and run Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world. As the Data Center Construction Project Manager you will handle all aspects of development for some of the most innovative and energy efficient data centers in the world!", "description": "As the Data Center Construction Project Manager, you will handle all aspects of development for some of the most innovative and energy efficient data centers in the world. This position will support our US based data center campuses, our Denmark campuses, and our future Chinese data center campuses. The role requires close coordination with project partners from various teams including real estate, legal, design, EH&S, energy, construction, network and operations to bring our projects to fruition. The successful Project Manager will have:\n-  Ability to lead multiple projects including equipment upgrades and modifications within live data center production environments in parallel with new construction efforts.\n-  Excellent planning, analytical, organization and problem solving skills.\n-  Proficient and effective verbal and written communication skills.\n-  Ability to establish and maintain close working relationships with management, colleagues, team members, internal and external partners.", "key_qualifications": "8+ years demonstrated ability as a data center (or similar) construction project manager\n- Lead and support the architects, engineers, and other specialty consultants from initial programming to construction completion.\n- Professionally represent Apple’s interest at all meetings with Consultants, General Contractors, and Suppliers.\n- Meet with internal strategic engineering groups, operations and business units to determine detailed project requirements.\n- Drive both internal and external partners to meet deadlines as the need arises per the project delivery schedule.\n- Build and maintain the project budget including securing internal approvals for capital funding.\n- Engage and lead General Contractors to include competitive bidding and negotiation.\n- Review and comment on contracts and terms and conditions as it pertains to costing and deliverables for a project or scope.\n- Review all proposals and change order requests from the Consultants, General Contractor, Suppliers, and Subcontractors. Prepare and present comparative cost analysis.\n- Management and oversight of commissioning agents with experience in reviewing sequence of operations and test scripts.\n- Strong background in data center/commercial/industrial construction to include mechanical, electrical, process piping, plumbing building systems, tenant improvement, site work and ground up construction.\n- Skilled in reading design and construction drawings for all fields.\n- Experience with utility infrastructure, including construction and coordination of local utilities to site.", "preferred_qualifications": "", "education_experience": "Construction Management or Engineering Degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550573"}