{"title": "Product Marketing Manager, Thailand", "summary": "The individual will own and drive the product centric marketing strategy for iPhone and software related services within Thailand. Continuous improvement of product launches, comprehensive business and market analytics, instinctive insights and the discipline to focus are valued attributes. The Product Marketing Manager will have a deep understanding of the product, portfolio and marketing strategy, twinned with the ability to execute for results. The Product Marketing Manager must have the ability to work collaboratively with other critical functions such as Marcom, PR, Finance and Sales, to articulate and shape the opportunity ahead for their product line of business and communicate region-unique requirements for current and future products in a coherent way to multiple stakeholders across the globe as well as the US. To be truly successful in this role, you will need to have an undeniably strong passion for Apple products, desire to win, curiosity to be better, ability to navigate in a world of ambiguity, finesse and craft in product storytelling, creative and innovative problem solving, the motivation to inspire others and to build strong and lasting relationships throughout the organisation.", "description": "Execute iPhone and iOS launches and in-market activations with excellence every time Articulate the iPhone opportunity in market and provide product insight and leadership from introduction through end-of-life to the Marketing and Sales organisations Contribute to the annual Thai Marketing plan, synthesising product, consumer research and business trends to outline key priorities for iPhone and the broader business in Thailand Liaise with worldwide teams like Product Marketing and Engineering on local iPhone business needs and feature requirements, influencing the product roadmap and making clear recommendations to improve the overall customer experience. Be the guardian of product messaging and positioning across every customer touch point, advancing the cause of excellence Become a visible member of the international Product Marketing team Possess expert knowledge of competitive and third party products, software platforms, mobile gaming and emerging Thai consumer trends", "key_qualifications": "Superior storytelling capabilities, presentation and negotiation skills, with oral and written fluency in Thai and English. 7+ years experience in product marketing, mobile communications and/or roles that require technical fluency and the instinctive ability to be the voice of the consumer Excellent analytical and strategic skills, with deep knowledge of industry trends A self starter with the ability to continually prioritise and multi-task in a dynamic, creative, matrixed and fast paced environment Prior work with international teams in a multi-national company is a plus Flexibility to travel (up to 25% of the time)", "preferred_qualifications": "", "education_experience": "Bachelor’s degree required. MS/MA/MBA preferred but not conditional.", "additional_requirements": "Accountability Courage of conviction Self honesty Truth Analytical and Street smart Perseverance Passion Hard working", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542910"}