{"title": "Sales Team Manager - Retail Customer Care", "summary": "The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Retail Customer Care (RCC)  Sales Team Manager provides hands-on strategic leadership and direction to the Apple Store Online Sales team. Supporting Consumer, Education and Small Business segments, your team will provide pre-sales support to inbound customers. You will be responsible for leading all facets of customer contact strategy. Sales Team Manager leads and develops the team to ensure extraordinary customer service and to lead overall Contact Center plan to achieve maximum revenue, cost efficiency and quality results.", "description": "Sales Team Manager will be leading the development of all customer facing processes, which include: Telesales, Transaction Monitoring, Call Mentorship, Customer Happiness Survey, and Business Tools, Customer Communications and Handling Customer Claims. Sales Team Manager is also responsible for engaging in WW projects. The key duties of the role include recruitment, quality and training, telephony technology and metrics/reporting. You will be the subject matter expert in business process and systems with innovative and persistent approach to lead, research, recommend, drive and implement standard methodologies and continual improvement of customer frontline processes within Contact Center function.", "key_qualifications": "", "preferred_qualifications": "Conduct quality assessments and actively lead agent performance in order to maintain the highest standard of quality and CSAT. Establish, implement and maintain an ‘Evened Scorecard’ to supply to exclusive performance in customer service, revenue, operation cost and quality offerings. Lead agent performance in key areas such as customer happiness (CSAT), Revenue, Productivity, Efficiency and Utilization by reviewing scorecard in monthly 1:1 with agents and identifying target areas for improvement. Drive high productivity, service quality and staff motivation by implementing rewards and recognition / Incentive programs. Project-manage key WW projects implementation as Sales and Customer Service Track Lead. Devise and implement processes and system’s solutions in partnership with IS&T, Sales, OM, rest of the cross functional teams. Build up a deep understanding of system functionality and processes. This includes documenting processes and training colleagues on the new or existing processes and systems. Handle overall Japan Contact Center Sales Operations. Compile the weekly Contact Center Metrics and identify system/process/business issues and highlight it during weekly management review meeting. Analyze operational processes, customer concern procedures and perform training needs assessments for seeing opportunities for service delivery improvements and benefit to the customers/clients. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554979"}