{"title": "Machine Learning / AI Internships", "summary": "Within Apple’s Artificial Intelligence and Machine Learning organization (AIML), you can take part in the ongoing revolution that machine learning plays in daily life. Apple’s fully-integrated hardware and software provide unique opportunities to deliver amazing experiences, all while prioritizing user privacy.", "description": "In an AIML internship, you will collaborate with researchers, engineers, and program/project managers to tackle innovative challenges. You will also receive technical mentorship and guidance that allows you to learn new things every day, gain practical skills, build real world experience, develop a greater understanding of our industry, and form valuable connections.", "key_qualifications": "empty string", "preferred_qualifications": "It’s helpful if you meet one or more of the following qualifications, but it isn’t a requirement. Proficiency with an object-oriented programming language, such as Python, Swift, Objective C or Java. Experience with ML libraries, such as TensorFlow, PyTorch, CoreFlow, and Sklearn. Practical knowledge related to building and adapting algorithms for machine learning, speech, multimodal sensing, and related areas. Familiarity with crafting, prototyping, and evaluating interactive systems. Excellent mathematical skills in linear algebra and statistics. Ability to collaborate with others. Problem solving skills. Applied ML Engineering internships: Experience with integrating research prototypes into production applications. Proficiency conducting ethnographic or other situated studies of human interaction with or through interactive technologies. Experience crafting, conducting, analyzing, and interpreting experiments and investigations. Demonstrated expertise with proven publication or track record in at least one of the areas: statistics, econometrics, operations research, quantitative marketing, causal inference, time series analysis, stochastic modeling, optimization and decision making theory. Research-Focused internships: Currently pursuing a doctoral degree. Research experience in Machine Learning and a demonstrable record of publishing academic research in peer-reviewed venues.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554363"}