{"title": "Product Design Engineer – Retail and Events Product Design", "summary": "Apple is seeking a product design engineer to join the Retail and Events Product Design (REPD) team. We are a diverse group of engineers who design and develop integrated hardware solutions for retail spaces and special Apple events like new product announcements, developer conferences, and store openings. These solutions are engineered to elevate and showcase Apple products in magical and transformative ways! We are looking for someone who naturally approaches problem solving with creativity and curiosity! Within our team, your responsibilities will span technology development and concept generation to detailed design, analysis, and testing through mass production of complex assemblies. We value engineers with a desire to acquire new skills and further their professional development. You will have the opportunity to learn and apply knowledge in many engineering fields, including material selection, machine design, manufacturing processes, stress and failure analyses, PCB integration, and cosmetic finishing. We work best with excellent communicators who are able to collaborate with multi-functional teams within Apple, like the Industrial Design Group, as well as external suppliers. Delivering the best customer experience is our shared goal!", "description": "-  Developing initial product architectures and new technology concept investigations -  Designing 3D models of mechanisms and drafting 2D documentation of all parts and assemblies -  Building physical models to evaluate functionality, manufacturability, and robustness -  Collaborating with operations teams and external vendors to develop manufacturing and assembly processes -  Analyzing data generated from lab experiments and vendor builds to inform engineering decisions -  Traveling both domestically and internationally to piece part and assembly vendors to realize the physical design and finding root cause for failures", "key_qualifications": "", "preferred_qualifications": "3+ years demonstrated ability in mechanical design (preferably consumer electronics products). Experience working with contract manufacturers. Demonstrated ability in plastic and metal part design including material selection. Experience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing. Experience with component modules (connectors, batteries, electronics packaging, PCBAs).", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555475"}