{"title": "Functional Integration Engineer", "summary": "At Apple, we rely on the diverse set of backgrounds and perspectives of our employees to champion innovation through extraordinary ideas to surprise and delight our customers. These ideas can come from anywhere. Will that next phenomenal idea come from you? The global ETS eBusiness team is responsible for delivering system connectivity both internally and externally using industry standard solutions and in-house developed systems and platforms. We are seeking a software engineer to implement innovative and scalable solutions. This is an excellent opportunity for a self motivated, enthusiastic, result oriented person to provide solutions using various integration technology stacks. If you want to be a part of this amazing team, this position is for you. Dynamic, hard-working people and inspiring, innovative technologies are the norms here.", "description": "In this role, you have an opportunity to work with Apple business teams and help solve complex business problems through innovative solutions. You will get a chance to understand various aspects of our supply chain process by partnering with various business teams. You will be designing and developing business critical, time sensitive and high performant solutions for key business processes. You will also be implementing AI powered solutions for partner data inductions.", "key_qualifications": "", "preferred_qualifications": "Knowledge in middleware technologies like Software AG Web-Methods, Mulesoft\nHands on experience in working with industry standards like EDI X12, XML, JSON and API’s.\nDeep understanding of different partner types in the Supply chain and / or finance domain and their business processes\nFamiliarity and implementation knowledge of cloud technologies\nInsight & creativity to see around corners and to design systems in order to mitigate future risk\nAI / ML implementation experience is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553871"}