{"title": "NFC Hardware Design Engineer", "summary": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before. We have built the best RF hardware design team on the planet. We’re looking for a talented individual to join our team. We support WiFi, Bluetooth, NFC, GPS, and emerging technologies. As a NFC Hardware Design Engineer, you will contribute to the architecture, design, and implementation of next generation NFC solutions in established as well as new product categories. You will be responsible for all aspects of Hardware Design for a given product, including specifications, conducted performance, and manufacturability.", "description": "Daily tasks include: -  Communicate proactively with internal cross-functional teams (e.g. System EE/Integration, Product Design, Antenna Design etc.) -  Communicate with outside vendors to help define components and drive technical issues to closure -  Schematic Capture -  PCB Fit/Placement; drive PCB layout -  Bring-up/Bench testing designs and dev. hardware -  Radio Tuning and Matching -  Factory prototype build support and training (~15% travel) -  Failure Analysis", "key_qualifications": "BS, MS (or significant equivalent experience), and a minimum of 7 years of relevant experience; Radio Design experience, preferably high-volume consumer electronics; Solid understanding of NFC systems including: NFC theory of operation (especially active load modulation), NFC circuit design, NFC antenna design considerations, EMVCo specs, etc.; Solid understanding of RF fundamentals including: Noise Figure, Sensitivity/Desense, Error Vector Magnitude, IIP3, Harmonics, Smith Charts & Tuning Networks, Transmission lines, etc.; Hands-on bench level experience with VNAs, spectrum analyzers, and other general lab equipment; Modeling tools like SPICE to model transformer networks; Moderate soldering skills; Excellent communication skills, both written and oral", "preferred_qualifications": "", "education_experience": "B.S. and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551651"}