{"title": "WiFi Performance Software Engineer", "summary": "Join our Sensing and Connectivity Engineering team and drive innovation that matters! We create and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. Our team works on Apple eco-system of devices that delivers best quality of wireless connectivity", "description": "Responsible for performance benchmarking, characterization of new connectivity features and improving WiFi system performance on Apple platforms. Measure & analyze both Wi-Fi and Bluetooth system performance for various coexistence driven scenarios. Ability to build lab setups that simulate different system conditions. Ability to work on scripts and tools that aid in analysis.", "key_qualifications": "Understanding of TCP/IP suite of protocols. Deep knowledge of 802.11 MAC/PHY protocol with relevant industry experience. Tools experience - iPerf, Ixia, Wireshark. Debug and analysis of issues by examining different layers of the protocol stack. Understand impact of interference on WiFi and BT performance", "preferred_qualifications": "Python scripting experience is a plus", "education_experience": "Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required. Masters or Ph.D degree is preferred", "additional_requirements": "Thrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams. Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways. Improve system performance to provide good end user experience.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548010"}