{"title": "AI/ML - NLP Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Asia Pacific IS&T team builds systems for the most dynamic and versatile business teams at Apple. We work on many high-impact projects that serve various Apple lines of business. We use the latest technologies and are constantly opening up the boundaries. Will you join us in crafting solutions that do not yet exist? We are hiring an AI/ML - NLP engineer to: • Conceive and design end-to-end machine learning solutions to support Apple's business units • Develop and implement solutions to fit business problems, which may include applying algorithms from standard models or custom model development • Implement entire ML pipeline from data pre-processing and feature engineering through model building to model evaluation • Design model evaluation techniques and present results of analysis to business units", "description": "Be ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. Come be part of Asia Pacific IS&T team if you want to help deliver the next amazing Apple product. This role demands the best and brightest; the ideal candidate will be self- motivated, accountable, technically strong and will be challenged to find creative solutions to technical problems. Besides having the key qualifications listed above, the successful candidate is expected to: • Develop and communicate descriptive, diagnostic, predictive and prescriptive insights/algorithms. • Be comfortable with leveraging large data sets to tackle complex NLP and machine learning problems. • Apply knowledge of experimental methodologies, statistics, optimisation, probability theory and machine learning using code for tool building, statistical analysis and modelling using both general purpose software languages and statistical languages. • Use machine language and statistical modelling techniques such as decision trees, logistic regression, Bayesian analysis and others to develop and evaluate algorithms to improve product/system performance, quality, data management and accuracy. • Work with large scale computing frameworks, data analysis systems and modelling environments. • Actively collaborate with business partners and engineering teams to improve model accuracy through market-specific insights and understanding language nuances.", "key_qualifications": "Understanding of NLP techniques for text representation, semantic extraction techniques, data structures and modelling • Deep understanding of text representation techniques (such as n-grams, bag of words, sentiment analysis etc), statistics and classification algorithms • Knowledge of Python, Java and R • 2 - 5 years experience with machine learning frameworks (such as Keras or PyTorch) and libraries (such as scikit-learn) • 2 - 5 years experience with large-scale data collection and real-world large scale datasets • Fluency in Chinese to support Greater China market", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in Engineering / Computer Science / Information Systems or equivalent with minimum 2 years of relevant work experience", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200508826"}