{"title": "Senior Software Framework Engineer - System Intelligent and Machine Learning, ISE", "summary": "Are you interested in making an extensive and impactful contribution to Machine Learning at Apple? Our Scene Understanding (SUN) team is hiring a technical lead in ML software engineering. SUN is comprised of engineers who own a variety of production ML workflows that surprise and delight millions of our customers! Our team contributes to a variety of shipping workflows you may already regularly use, including: Photos Search, Curation, Memories, Intelligent Autocrop, Visual Captioning for Accessibility, Federated Learning on visual content, Real-time Classification & Saliency in Camera, Semantic Segmentation in Camera, and several on-device backbones across the system. Further, several of our projects are surfaced to third party developers through Vision & CoreML. Shipping APIs include image tagging, image similarity, saliency estimation and prints for transfer learning. Here are a selection of relevant WWDC presentations: https://developer.apple.com/videos/play/wwdc2019/222/ https://developer.apple.com/videos/play/wwdc2019/225/", "description": "The Scene Understanding team is looking for a senior software/ML engineer with a proven track record in shipping customer experiences. You will be interacting very closely with a variety of ML researchers, software engineers, hardware & design teams cross functionally. Among the most important requirement would be a deep understanding of software fundamentals, and the ability to translate ML algorithms into production quality code. Solutions developed will leverage multi-modal inputs (visual, range, nlp, audio) with a strong emphasis on visual processing. The primary responsibilities associated with this position range from algorithm design and implementation, ability to integrate research into production frameworks, and collaborating closely with product teams before and after feature launch.", "key_qualifications": "5+ years of industry experience with demonstrated leadership in framework development\nProficient in coding in C++ and/or Objective C\nProven experience with hands-on software engineering fundamentals\nExperience with multiple modalities (image, text, audio, etc)\nProven prototyping skills\nUnderstanding of the unique challenges associated to the transition of a prototype into a final product\nFamiliar with the challenges of developing algorithms that run efficiently on resource constrained platforms\nComfortable presenting research to large audiences with the ability to work hands-on in multi-functional teams", "preferred_qualifications": "", "education_experience": "B.S. or M.S in Computer Science or a related field (mathematics, physics or computer engineering); or equivalent experience.", "additional_requirements": "Experience with OS X and iOS development tools and familiarity with GPU programming is desired\nFamiliarity with Machine Learning algorithms is desired", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525273"}