{"title": "AIML - Senior Research Scientist - MIND Perception & Interaction", "summary": "The Machine Intelligence Neural Design (MIND) team is actively looking for a highly motivated team member to influence, contribute, and build Apple’s future perception and interactive experiences. Do you possess strong leadership traits, demonstrate deep expertise of sensing, signal processing, interaction techniques, and a desire to work with software and hardware systems for Apple devices? A background in human-computer interaction and applied machine learning is preferred. Our team builds technology that will drive effortless user experiences, and therefore our team is creative and innovative. Tenacity and the passion to learn are skills we value on our team. If this sounds like you, we'd love to talk! Join us in a hands-on applied ML team that fosters creativity and generates novel solutions that can impact millions of users. We partner with a variety of cross and multi-functional team members from a diverse array of groups across the company. Are you deeply accountable for your work? Determined? Your passion for ownership and track record of project development will prove critical to your success on the team", "description": "As part of the MIND team at Apple AIML, you will lead efforts in building prototypes and user-facing systems with state-of-the-art machine learning technologies. You will supply to software development, implementation and integration of sensor systems, working collaboratively with world-class product development teams at Apple. From hardware prototyping, signal processing, data modeling, and multimodal sensor fusion, you will contribute to interactive experiences that will surprise and delight. Strong candidates demonstrate a knack for creative problem solving, have strong experience with signal processing, software standard methodologies, and demonstrate a strong intuition for exploring multiple hypotheses via the scientific process.", "key_qualifications": "A successful candidate joining our team will have deep expertise in at least one of the following areas: Experience with machine learning research and engineering, including real-world model deployments. Experience with signal processing and multimodal ML, including large language models (LLMs). Experience with hardware, sensors, and real-time data pipelines. Leadership traits and excellent communication skills", "preferred_qualifications": "", "education_experience": "M.S. or Ph.D. in Computer Science, Electrical Engineering, Robotics, or related fields. Additional background in HCI is a plus!", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551792"}