{"title": "Full Stack Engineer", "summary": "Come join Hardware Engineering’s Tools and Data Analytics Team working on innovative internal web applications! We are looking for an imaginative, resourceful and hardworking full-stack web application engineer with an ability to build simple solutions to complex problems. Help us continue to make internal products that blend ease of use, powerful feature sets, and an outstanding attention to detail.", "description": "You will join a collaborative team of dedicated engineers. The ideal candidate will have a can-do attitude, passion for technology, and extensive web application development experience. From brainstorming through implementation, you as a Full Stack Engineer will work with members of the Tools Team, as well as our division’s engineering, program management and executive sponsors. You must have a passion for developing high-quality software that is maintainable, scalable, and performant while delivering exceptional user experiences that are simple and intuitive to use. Must also possess excellent debugging skills and the ability to think on the fly when problems arise. You should be comfortable wearing many hats. You will work in a fast-paced environment with changing priorities and tight deadlines. Open communication and healthy debate are paramount to your success within the team.", "key_qualifications": "8+ years experience building websites using HTML, CSS, JavaScript and TypeScript; 6+ years experience building web applications with frameworks and/or libraries such as EmberJS, React, Vue, Angular, or similar; 8+ years experience with server-side web application frameworks such as Ruby on Rails or similar. Experience writing and maintaining automated tests for web applications; Experience in defining continuous integration build processes for backend web development; Experience in writing performant SQL through both raw queries and ORMs; Knowledge of common design patterns in web development (MVC, MVVM, etc); Proven ability to follow development standard methodologies for high-quality software (CI, Vagrant, etc); Proficiency in Portuguese and English;", "preferred_qualifications": "BA or BS in Computer Science or equivalent degree desirable but candidates from all education backgrounds are encouraged to apply; Experience developing RESTful APIs; Experience with microservices based architectures; Experience with message/job queues (Rabbit, Zero, Resque); Exposure to iOS and OS X development with Swift or Objective-C a plus; Working knowledge of source control software such as Git (preferred) or SVN; Exposure to Agile project management methodologies; Ability to multitask and manage tasks with varying priorities; Ability to work independently with minimal supervision; Ability to brainstorm and communicate technology ideas and issues with peers and management; Ability to evaluate and articulate technical trade-offs of every decision; Excellent verbal and written communication skills; Willingness to learn new technologies and implement in a short time; Comfortable working in a multi-discipline, geographically dispersed team;", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554617"}