{"title": "SAP Opportunities, Information Systems and Technology", "summary": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers.\nAt Apple, great ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\nWe are establishing a centralized team to support our Landscape Modernization using SAP Business Technology Platform, AWS and other cloud solutions.\nHere are the type of SAP professionals with the following skills that we are looking for:", "description": "If you are a passionate and dedicated SAP professional please apply to this posting, we will match you based off your background to the right team(s)!", "key_qualifications": "SAP Senior MM/LE Functional Analyst/Project Manager - knowledge of business processes in developing global service repair logistics, reverse logistic, warehouse operation and procure-to-pay applying SAP MM, LE, EWM, ME\nSAP RAR Project Manager - SD, RAR\nSAP SM Engineering Project Manager - SAP SM, SDFI, Business process and Integration. HANA Architecture (warranties, Business Agreements), Table design Frameworks\nSAP GTS Engineering Project Manager - Complete full life-cycle implementations of SAP GTS (Global Trade Services) projects\nSAP Logistics Engineering Project Manager - Logistics, S/4HANA\nSAP Engineering Project Manager - FICO, FICA, BRIM\nSAP Basis Administrator - HANA database; experience with SAP systems upgrades, patches, and installations\nSr SAP Performance Engineer - Performance engineering experience; knowledge in Software Engineering; testing, fixing & providing tuning recommendations for SAP applications; performance testing tools such as LoadRunner Enterprise, Apache JMeter\nSAP BTP Engineer - BTP Services\nSr SAP Security Engineer - SAP ECC, BW, Portal, BPC as well as S/4 HANA and SAP Cloud Services; handling security toolchains, and architecture design reviews; secure code reviews and software security testing tools & methods\nSAP Application Engineer - (S/4HANA)\nSAP Application Engineer - Finance\nSAP Application Engineer - SD, OTC, RAR", "preferred_qualifications": "", "education_experience": "Bachelor's/Master’s degree or experience in an equivalent related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200508560"}