{"title": "Software Engineer - Java, Spring Boot and Microservices", "summary": "Apple's IS&T team is looking for highly motivated and dedicated engineers to build the next generation of software services that powers several critically important applications.", "description": "-  Develop and maintain highly reliable, scalable, and maintainable enterprise applications that can match Apple volumes\n-  Understand requirements, engage with team members, multi-functional teams and project managers to define solutions, and estimate the scope of work required\n-  Collaborate with, mentor, and influence members within your team and across other teams at Apple\n-  Deliver solutions that can keep up with a rapidly evolving product in a timely fashion\n-  Review technical designs and perform code review", "key_qualifications": "Must Have: More than 4 years of experience in designing and developing scalable enterprise grade solutions. More experienced profiles are considered for senior developer roles.\nExtensive hands-on experience with Java, Spring Boot and Microservices.\nHands-on with architecture, design, development and deployment of enterprise systems\nExperience in rolling out distributed, large-scale, low latency web applications with REST, Data Caching Services, DB schema design and data access technologies\nExperience with leading and mentoring Engineers\nAbility to successfully multi-task and support multiple, concurrent projects", "preferred_qualifications": "", "education_experience": "Bachelor's or Master’s degree in computer science or information technology.", "additional_requirements": "- Results oriented and demonstrates high degree of ownership and accountability.\n- Experience handling distributed vendor resources\n- Creative problem solver and excellent collaborator, who thrives in a fast-paced, innovative environment.\n- Communicate quickly and effectively; vertically and horizontally through the organization.\n- Influence others to get things done.\n- Must possess excellent problem-solving & analytical skills.\n- Handle ambiguity and solve problems despite uncertainties.\n- Ability to lead large projects focusing on innovation, team work and results.\n- Consistent track record of achieving outstanding results in professional career", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549620"}