{"title": "Cellular Performance Engineer", "summary": "Join the Wireless Technologies and Eco-Systems (WTE) organization and drive innovation that matters! As part of the Wireless team you will be working on building solutions for Wireless technologies. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. You should join the Apple Wireless Performance Team if you want to help deliver the next amazing Apple product.", "description": "You will be responsible for proposing and driving RF/L1 architectural improvements to RF/modem solutions for future Apple product lines with emphasis on improving the overall user experience in terms of performance and power (battery life). We expect you to be hands relying upon diagnostics, analytics, crowd sourced information, lab/field experimentations as well as code/architecture review to exploit the opportunities for improvement and work cross functionally with platform architecture, standardization, firmware/protocol development, system test, QA and carrier engineering teams to drive the improvement proposals from concept to commercialization. You will also develop advanced system evaluation and debugging capabilities on an as needed basis.", "key_qualifications": "", "preferred_qualifications": "Deep knowledge of NR knowledge and technical background, Experience in advanced features like mmWave/massive MIMO/dual connectivity, Deep knowledge of LTE PHY/MAC as well end to end system knowledge (higher layers), Deep understanding and hands-on experience with end to end System, Consistent track record of project work from concept to commercialization, Excellent troubleshooting, analytical and problem solving skills, SW development and system design experience is a phenomenal plus.", "education_experience": "Master/PhD degree in Electrical Engineering, Wireless Communications or equivalent majors.", "additional_requirements": "Outstanding teammate with good interpersonal skills obsessively passionate and inquisitive, seek to take on everyday problems in innovative ways, Laser-focused on the smallest details that are significant to our customers.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540374"}