{"title": "Software Data Engineer - Analytical Engineering - Apple Media Products", "summary": "Apple's App Store is the world's largest and most innovative app marketplace, home to over 1.5 million apps and serving more than half a billion customers every week across all the Apple devices. Since the App Store launched in 2008, it has changed how we all live; it has enabled countless new companies, spawned new industries, and built millions of jobs. But we believe we are just getting started. We're seeking a software data engineer to join the App Store Data Engineering team.", "description": "As a member of the App Store Data Engineering team, you will have significant responsibility and influence in shaping its strategic direction. This is a software engineering position. We write robust code, not just ad-hoc scripts. Our software process dozens of terabytes of data on daily basis. Our volumes are on a petabytes scale. Our jobs and applications must be efficient, scalable, and stable. Although we write software, data is our main product and first-class citizen. We care about accurate and qualitative data as much as we care about fine, clean, and manageable code.", "key_qualifications": "", "preferred_qualifications": "5+ years of hands-on experience building distributed data processing applications using Apache Spark or Apache Flink. 5+ years of programming experience in Scala (preferred) or Java. Experience with Big data: Hadoop, HDFS, Spark, SQL, Kafka. Proven skills in designing scalable, highly available distributed systems using technologies like Kafka, Iceberg, Kubernetes, Airflow and Cassandra. Good understanding of software engineering principles and fundamentals including algorithms and data structures. Self-directed, self-motivated and ability to create architecture and design documents. Ability to capture multi-functional requirements and translate them into practical engineering tasks. Excellent communication skills and proven ability to work in a multi-functional environment. Understanding of functional programming ideas and principles.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557617"}