{"title": "Physical Design Methodology CAD Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. As part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world-class CPU, GPU, Analog/Mixed Signal, and SOC designs by developing flows, tools, and methodologies for future Apple products! You will explore and enable new technology nodes, std cells, and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML. We are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products!", "description": "-  Participating and engaging with cross-functional teams to tackle key physical design challenges.\n-  Developing innovative solutions in physical design and optimization space.\n-  Developing and supporting implementation flows for multiple projects and design teams.\n-  Developing and maintaining custom CAD tools for implementation and signoff.\n-  Creating flows to enable successful deployment of new technology nodes.\n-  Developing tools and methodologies for best-in-class PPA and productivity including ML based solutions.\n-  Collaborating with other teams such as physical design verification, RC extraction, IR, and static timing analysis (STA).\n-  Working directly with EDA tool vendors to resolve tool issues and identify areas for tool improvements.", "key_qualifications": "", "preferred_qualifications": "Hands on knowledge of industry standard PNR tools.\n-  Hands-on experience with high performance and low power implementation flows.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554612"}