{"title": "Senior Software Engineer - Machine Learning Infrastructure - Apple Maps", "summary": "The Apple Maps Data Infrastructure team needs exceptional engineers to help build capabilities across a spectrum of technologies in a hybrid-cloud environment. Role involves tackling challenging problems, delivering innovative solutions, and contributing to groundbreaking solutions.", "description": "We are looking for an exceptionally curious and motivated candidate who is excited by the opportunity to rapidly build the reputation of subject matter of expert in data and ML infra field across the org. This role offers substantial scope for capability-building across multiple domains and technologies, learning deeply from our expert teams of developers, data engineers, and data scientists. If accelerating your learning excites you and you aspire to become a leading authority in multiple technology spheres, this is the opportunity for you.", "key_qualifications": "10 years of hands-on experience in the realm of large-scale data processing and/or machine learning infrastructure, showcasing a robust understanding of the complexities associated with such environments. Familiarity with technologies like Spark, Flink, Kafka, Iceberg, Ray. Strong programming skills in Java or other JVM languages. Strong sense of ownership and commitment to excellence. Customer-focused approach with excellent listening skills. Proficiency in scoping and prioritizing tasks.", "preferred_qualifications": "Former experience in public cloud systems, particularly in AWS or GCP environments, is a great plus. Knowledge of Kubernetes is a significant plus. Proactive engagement with open-source community. Experience with GPU/training/LLM/Inferencing is a nice-to-have.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay for this role is between $175,800 and $312,200, with additional benefits including stock programs, comprehensive medical and dental coverage, retirement benefits, discounts, educational reimbursement, discretionary bonuses, and relocation assistance.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556371"}