{"title": "Hardware Development Engineer - Data Center Hardware", "summary": "The Data Center hardware engineering team is looking for a product-focused engineer to work on multiple projects from design conception to mass production. We work with many cross-functional teams, including mechanical, power, software, firmware, silicon design, hardware validation, and reliability engineering, to quickly build products to meet our customer’s evolving needs. We build modular systems with multiple heterogeneous boards and define the interfaces that connects them together.", "description": "Responsibilities include design, debug, and validation of a variety of circuit boards for custom enterprise servers. The candidate should be able to take complete ownership of subsystems, boards, interfaces, and cross-functional relationships. You will have to seek and find the necessary information and support from your coworkers, as well as cross-functional teams, to accomplish your goals. You will need to collaborate with manufacturing teams to provide support for hardware test engineering and DFM.", "key_qualifications": "High-speed board design experience with 10+ layer PCBs, including PCB material selection. Schematic entry and management of design constraints for high-speed PCB layout using Cadence tools or similar. Experience with PCI Express (PCIe), 100-GbE, USB3/USB4 or similar high-speed serial protocol: electrical design, protocol fundamentals, compliance testing, and debug using protocol analyzer. Design, validation, and debug experience with common low-speed interfaces, such as: I2C, SPI, JTAG, UART, and USB1/2. Knowledge of clocking technology: crystals, oscillators, and simple PLLs. Knowledge of discrete passive components (resistors, capacitors, inductors) and their characteristics and specifications. Ability to debug jitter problems and their sources through measurement and analysis. Working knowledge of power supply design fundamentals. Experience using test & measurement equipment, such as: high-speed oscilloscopes, protocol analyzers, and VNAs. Excellent skills to debug problems from the system-level down to the transistor level. 10+ years of relevant work experience. Excellent written and verbal communication skills. Ability to create diagrams and make concise presentations to clearly present information to cross-functional teams.", "preferred_qualifications": "Experience designing systems with concurrently designed custom silicon and working with silicon engineering teams to negotiate features and requirements. Proven leadership of complex system development from concept to mass production.", "education_experience": "BS in electrical or computer engineering required, MS preferred - Minimum 10 years relevant industry work experience.", "additional_requirements": "Ability to take 1-2 international trips per year, 1-3 domestic trips per year", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538548"}