{"title": "Haptics Hardware Electrical Engineer", "summary": "The Haptic Engineering team develops innovative Haptic solutions and technologies that are central to Apple’s products, including the iPhone and Apple Watch. New challenges arise every single day that require the sharp analytical skills of versatile and hard-working individuals.", "description": "Your role will encompass a diverse array of responsibilities. You will be responsible to design the haptics subsystem, including its architecture, components selections/requirements and schematics of boards and flexible assemblies. Also, you will work on the validation and characterization of the module including its performances and signal/power integrity.", "key_qualifications": "Strong EE, circuit, signal processing and electromagnetism background. Good understanding of sensors and associated signal chain. Fundamental knowledge and experience in physics, mechanical engineering. Knowledge of statistics fundamentals. Proficiency in MATLAB, SPICE, Simulink, or similar simulation and modeling tools. Familiarity with modeling electro-mechanical systems. Team oriented with excellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528217"}