{"title": "Systems Engineer - Linux DevOps,  Apple Services Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We at the Fleet Ops Engineering team are looking for a Systems Engineer - Linux DevOps to design, build and support our large scale Linux systems infrastructure. You will play a critical role in the day-to-day operations of services relied upon across Apple. You will partner with engineering teams to ensure they're successful.", "description": "In this role, we look forward to your passion in supporting our rapid growth and expansion. As a key part of the Fleet Ops Engineering team at ASE together we will make a broad impact across our product and customer experiences. We look forward to your expertise in the DevOps space, but don't want to be limited to that space. You will work with a highly skilled engineering team in the design, implementation, and support of operating system technologies and storage fabric supporting large scale Linux systems Infrastructure!\n- Solve complex problems using both open-source and in-house tooling to support security and business initiatives\n- Build, Automate and support critical large-scale infrastructure systems.\n- Help with our team’s initiative for promoting automation and self-service tools for service democratization and enforcing responsibilities with respective app teams.\n- Hands-on experience with managing a variety of storage platforms deployed in a low latency and highly available Infiniband fabric.\n- Good understanding and ability to manage software and appliance-based load-balancers\n- Oversee and collaborate with developers, DBAs, network engineers, and EPMs on a regular basis.", "key_qualifications": " ", "preferred_qualifications": "Experience with large installment systems.\n- Experience with revision control systems like GitHub, CI/CD unit testing, and configuration management systems.\n- Understanding OS, Systems security / encryption\n- Excellent verbal and written communications skills", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555974"}