{"title": "Software Engineer - ServiceNow Engineering", "summary": "Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard but the job comes with more than a few perks. If fulfillment, inspiration, adventure and advancement are your kind of perks, we'd love to hear from you. Like to be around people who love technology? Like to be around technology that loves people? Apple offers a work environment unlike any other.  There's the typical job. Punch in, push paper, punch out, repeat. Then there's a career at Apple. Where you're encouraged to defy routine. To explore the far reaches of the possible. To travel uncharted paths. And to be a part of something far bigger than yourself. Because around here, changing the world just comes with the job description.\n\nApple Information Systems and Technology is looking for a highly motivated ServiceNow Developer to build a world-class support experience for employees. The developer is responsible for design, development, and support of the on-prem ServiceNow application.", "description": "In this role, you will work directly with the process owners, project Implementation/development teams, ServiceNow product team, production support team, and multiple Infrastructure teams. You will provide in-house expertise in the matters of technical implementation, end-to-end system landscape, and application integration. You will be responsible for managing projects from inception to closure. This includes, but not limited to, planning, design, requirements gathering/clarification, managing a team of developers, risk/mitigation, status reporting, communication, process and technical improvements. You will also be responsible for building a strong team of ServiceNow implementors for multiple ServiceNow modules.\n\nResponsibilities include:\n- Understand business requirements for ServiceNow\n- Provide design and technical solutions for ServiceNow implementation\n- Provide expertise on technical questions related to ServiceNow implementation\n- Provide end-to-end product architecture to ensure a scalable, high-performance landscape\n- Architect integrations with ServiceNow using LDAP, Single Sign-on, Mid-server, Web-services, Email, and several in-house applications and technologies\n- Participate in sizing the application for future growth and scalability\n- Perform technical configurations, application maintenance, and housekeeping activities\n- Design security of the application and own data security function\n- Configure alerts and baseline SLAs\n- Troubleshoot technical issues related to ServiceNow application configuration and other technical issues\n- Work closely with the product team and support team of ServiceNow across various time zones\n- Identify opportunities to improve the platform\n- Understand the large scale thinking and apply the same for designing solutions", "key_qualifications": "", "preferred_qualifications": "ServiceNow Application Developer certification is a plus\n- Excellent verbal and written communication skills\n- Excellent analytical and problem-solving capabilities\n- Good Collaboration skills and teamwork ethic\n- Attention to details and commitment to quality\n- Strong work ethic, self-motivated, and well-organized\n- Ability to perform under pressure and tight deadlines", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558183"}