{"title": "Software Engineer - Backend Systems (Golang)", "summary": "At Apple, we strive every single day to craft products that enrich people’s lives. Our successes are the result of skilled domain experts working in an environment which encourages creativity, collaboration, and re-thinking of old problems in new ways! As a member of the Satellite Connectivity Group, you will work on the satellite network that enables connectivity to iPhone when off the grid without cellular or Wi-Fi coverage. Every day, Apple customers use Emergency SOS via satellite to access emergency assistance when they are in need of help and have no other means to communicate. You will have the unique and rewarding opportunity to shape this and other critical services, to the benefit and safety of millions of Apple device users. Our team is looking for a Software Engineer with cloud services experience to drive design and implementation of a critical and unique customer-facing Apple service. This is a rare opportunity to own a new set of services/microservices from the beginning within a team with a no-ops culture.", "description": "Our team is looking for a technically savvy computer science professional who is able to work autonomously in a small, foundational team in an ambiguous rapidly changing environment. You should have the strong interpersonal and communication skills to collaborate effectively with other cross-functional teams and the other (mostly non-software) members of this team! We rely on your technical expertise and experience to help and shape our software and define the work.", "key_qualifications": "", "preferred_qualifications": "You have deep understanding of core CS — including algorithms & data structures, operating systems, distributed systems, networking, and concurrent programming. You have experience and insight into designing, implementing, and supporting highly scalable cloud services from the ground up. You are a versatile programmer in Go, Java, Python. You are comfortable in working in a dynamic, fast-growing team environment. You can thrive in small team environment with minimal documentation and process. You have phenomenal aptitude to deal with ambiguity, and enthusiasm to help tackle difficult issues. You will be collaborating across many participating teams, so good interpersonal skills, will help you success in this role. DevOps experience is nice to have. Masters Degree in CS or CE is preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555083"}