{"title": "QA Software Engineer", "summary": "ALL APPLICATIONS MUST BE SUBMITTED IN ENGLISH\n\nOur Instrument Engineering group is a small team of extraordinary engineers who design and produce precision RF and Analog Test Equipment for use in calibrating and testing cellular, 5G, WiFi, BT, mmWave, UWB and NFC radios in millions of iPhones, iPads, Macs and Watches. All members of the team bring their own unique expertise to collectively take internal Apple products from concept to mass production. Each internal product is designed to Apple's exacting standards resulting in breathtaking test equipment that maintains the quality, accuracy and function of commercially available offerings.", "description": "This position will be the first team member in our Instrument Engineering QA team. We are looking for candidates who have previous QA management experience, especially those who have facilitated collaboration with cross-functional teams, including software developers, HW engineers, product managers, and UI developers.\n\nThe role has a high degree of autonomy and candidates will be encouraged to explore and apply their learnings to lead all aspects of the development of comprehensive testing strategies and ensure collaboration with partners to define testing requirements and priorities. Other responsibilities include;\n\nContribute to the development and enhancement of SW Framework for test and regression\n\nOversee the execution of test plans, verifying thorough and accurate testing. Manage escalations and corrective actions as needed. Ensure clear reporting of test progress and metrics to partners and management.\n\nCommunicate effectively with team members to address testing-related issues and opportunities.\n\nIdentify and mitigate testing risks including technical risks, resource constraints, and schedule impacts. Proactively address issues to minimize disruptions to project timelines and deliverables.\n\nDrive continuous improvement initiatives to enhance testing processes, methodologies, and tools. Find opportunities for automation and efficiency gains to streamline the testing workflow.", "key_qualifications": "Experience in software testing and test automation frameworks.\nProficient in development of new test automation using Python\nStrong knowledge of Unix shell scripting\nBe a vocal proponent for quality internally and externally.\nDemonstrate success in leading multiple priorities, delegating, and establishing plans and management processes to deliver results in a fast-paced environment.\nDemonstrate strategic leadership and ability to achieve results through people and across an organization, forming relationships, collaborating with and influencing multi-functional teams(HW, Embedded SW, FPGA, System SW, GUI).\nAble to deep dive into technical areas when needed but also up level communications to broader audience.\nPossess best-in-class communication and presentation skills (written and verbal) to all levels of an organization.\nAbility to occasionally travel internationally.", "preferred_qualifications": "Understanding of basics in RF\nProduct development experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556457"}