{"title": "AIML - Sr. Security Engineer, Technical Operations", "summary": "Play a meaningful role in securing the most sophisticated and scalable consumer-facing virtual assistant and AI systems in existence! Be an advocate for security methodologies across the latest groundbreaking technology for algorithmic search, machine learning, natural language processing and artificial intelligence.", "description": "As a security engineer within Apple’s Artificial Intelligence and Machine Learning (AIML) organization, you will play a key part in ensuring that the software and services we create and run is unassailable. Working with the rest of the Apple ecosystem, you will be responsible for proactively identifying security shortcomings and vulnerabilities as well as playing a leading role in remediating any security related issues and findings. You will also be enhancing and establishing security standard methodologies, training staff, and guiding changes that result in scalable and protected services for millions of Apple’s customers.", "key_qualifications": "", "preferred_qualifications": "Passionate about keeping Apple’s customers safe and their information private. Ability to analyze industry and regulatory trends and work with relevant business stakeholders in order to define overall security policy direction for product designs. Enthusiasm to influence and collaborate with colleagues and decision makers to develop secure solutions and to accomplish security goals. Ability to effectively lead cross-functional initiatives and drive alignment among senior executive leadership. Initiative to provide architectural guidance to teams lacking resident security expertise. Motivated by pursuing difficult and novel problems in a highly complex environment. Strong written and oral communications skills across multiple levels, including senior leadership. Ability to critically analyze security properties of a system in order to build a comprehensive threat model. Familiarity with creating threat models for complex software products. Deep technical understanding of public cloud providers and the inherent threats arising from doing business on those platforms. Keeps up to date with new security research, technologies and methodologies.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558000"}