{"title": "Research, Apple TV+", "summary": "Apple is looking for an experienced research professional to join a team tasked with gaining consumer insight into original video content and marketing material. The role will work with internal & external researchers and analytics teams to generate consumer insights that drive better creative and business decisions. This is an opportunity for an extremely organized, effective, and team-oriented individual to join a team within one of the fastest growing divisions of Apple", "description": "You will process identifying consumer insight needs across current programming, scheduling, and marketing as part of a small but mighty team. You will help run entire projects from start to finish, including but not limited to developing clear, concise and beautiful deliverables. The role also requires synthesizing and enhancing information from many sources and coordinating the flow of communication with key team members and external partners in a fast paced and spirited work environment.", "key_qualifications": "10 or more years of demonstrated ability analyzing primary research, secondary research, and analytics either within an agency, film studio/distributor or streamer. Substantial experience and expertise with both qualitative and quantitative research inputs and outputs (survey design, recruitment, quantitative data analysis, data science, focus group analysis, reporting, dashboard development, etc.) Experience with using secondary data sources, publicly available reports, and syndicated databases to generate strategic insights. Experience in audience/customer measurement, social listening, or on-platform data analytics. Strong organizational and project management skills with thorough quality control. Excellent written and visual communication skills. Precise attention to detail; proactive, can-do attitude. Ability to both take direction and work independently to achieve goals. Comfortable working with tight turnarounds and dynamic, often-changing assignments. Passion for helping create great movies and television is essential. Experience specifically in the entertainment industry (streaming platform, film studio or distributor, entertainment research vendor) is required. Experience in the theatrical film space specifically is preferred.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience required.\nMaster’s degree preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $150,000 and $287,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products, and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549770"}