{"title": "Sr Engineering Program Manager, Machine Learning and Data - SIML", "summary": "Would you like to contribute to generative AI and transform how people interact with AI technologies? Do you believe Machine Learning and AI can change the world? We truly believe it can! We are the Data Team of the System Intelligence and Machine Learning (SIML) group within the software engineering organization at Apple.", "description": "Our Data Engineering (DE) team is the critical backbone of our operations, designing and building ML & Data pipelines to support day-to-day operations and automating data flows. The team constantly deals with orchestrating large datasets, some in the scale of petabytes, in addition to making sure we meet regulatory/governance needs and the high data privacy standards of Apple. As the Engineering Program Manager for the Data Engineering group, you will help bring planning and program management excellence for our largest efforts.", "key_qualifications": "Proven experience in driving the design and development of internal tools and infrastructure as a Technical Program Manager and/or as a Software Engineer. Familiarity with Machine learning, Experience working with Python, AWS, Airflow, Spark, Snowflake/Databricks, (No)SQL, Distributed Computing, Dashboards.", "preferred_qualifications": "7+ years of experience in driving the design and development of data infrastructure and machine learning pipelines as a Technical Program Manager and/or Software Engineer. Proven experience working directly or adjacent to ML data operations, Experience with state-of-the-art ML techniques.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557439"}