{"title": "Account Executive, Carrier Channel", "summary": "The Account Executive will develop the Peru Carrier Channel through strong engagement with the Carrier partners in their territory. You will improve Carrier partners performance across iPhone and the entire Apple ecosystem of products and services by growing positive relationships at all levels within their organizations and understanding their focus areas, objectives, and priorities.", "description": "- Responsible for developing and implementing a yearly account plan and quarterly business reviews for each assigned Carrier partner to achieve shared goals and track progress of all partner engagements within the account.\n- Conduct regular business reviews to identify gaps, opportunities and assess progress. Gather, analyze and report business results and trends to Apple leadership team providing insightful recommendations.\n- Work with key partners, internal and external, to drive demand-generation activities, identify new opportunities, coordinate fulfillment logistics, and improve the physical and digital customer experience.\n- Identify sales opportunities and drive mobile business transformation by clearly and effectively delivering iOS messaging to customers.\n- Represent the needs of Carrier key partners within Apple, identifying challenges and opportunities. Track issues or concerns and ensure they are properly addressed.\n- Ensure that the Partners sales teams are trained properly on Apple solutions and are able to deliver a premium customer experience.", "key_qualifications": "Empty", "preferred_qualifications": "- Focus on customer experience and a drive for excellence - strong attention to detail in all you do.\n- The highest level of integrity, honesty, and accountability in all that you do, every single day.\n- Ability to complete day-to-day activities autonomously, prioritizing to drive what matters.\n- Bachelor's degree or equivalent", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557473"}