{"title": "Partner Onboarding Manager - WW Business Process Re-Engineering", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\nThe Worldwide Business Process Re-engineering (BPR) team is looking for an experienced supply chain professional to lead partner enablement and onboarding efforts across all of Apple product lines. These projects contribute to the overall diversification of the Apple supply chain.\nWe are looking for deep process re-engineering experience and an individual who is self-directed, motivated, and comfortable working in an extremely fast-paced environment. Experience optimizing global supply chain and fulfilment processes with emerging technology and managing suppliers and partners in Asia in an outsourced supply chain model is preferred.\nFlexibility and adaptability are key attributes needed for success. We are looking for strong analytical, project management and leadership skills to handle a variety of activities and complexities spanning the organization and be willing to work at both a very detailed and strategic level.", "description": "The Partner Onboarding Manager is critical to the rollout of Apple’s next generation Partner Integration and Collaboration platform. Responsibilities include :\n- Manage a multi-year Partner Enablement roadmap and drive strategic alignment across the global team\n- Partners with key cross-functional partners to solicit customer and associate feedback to identify program improvement opportunities for implementation \n- Act as a liaison between the business teams and IS&T (Information Systems and Technology or Apple's IT organization) and/or Partner IT teams to ensure that the business requirements are complete and met by the proposed technology solutions \n- Manage change. Implement new ideas effectively within the Apple culture. \n- Gather and synthesize detailed, global business requirements and design specifications\n- Address issues, quickly assess and develop root cause analysis and problem solution for operations escalations", "key_qualifications": "", "preferred_qualifications": "15+ years of overall experience with deep understanding of supply chain processes in the electronics industry - design, manufacturing, planning, logistics, order management.\nConsistent record of leading strategic programs, combined with the ability to implement tactical project-level activities and tasks.\nExperience in managing or leading teams responsible for Supply chain enablement in a global environment.\nAbility to work with external partners, including co-manufacturing and distributors in implementing the data share requirements, IT systems and data pipelines to support the business.\nDeep understanding of Business enablement and setup in India (Customs, Export, transportation, Cross Dock Operations).\nProficient at leading multiple efforts simultaneously in a global capability including working with international teams.\nTechnical understanding of enterprise software and especially integration technologies such as EDI, API Web-services, FTP, web portals (Nice to Have).\nExcellent communication across project and management teams.\nAbility to lead teams with or without direct reports; natural leader and motivator, lead through influence.\nAdaptability and flexibility including ability to manage deadline pressure, ambiguity and change.", "education_experience": "Bachelors degree / MBA in Operations or related subject", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559541"}