{"title": "Advanced Manufacturing Engineer(AME), Audio | Home", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to environmental efforts. Imagine what you could do here!", "description": "-  Responsible for manufacturing research and development to solve assembly problems that have direct impact to final product cost, quality and delivery of Apple products;\n-  Exercises judgment within general defined practices and policies in selecting methods and techniques for obtaining solutions to complex problems;\n-  Sets standard practices and independently resolves impact to design approaches and parameters to the final product;\n-  Applies extensive expertise in all facets of product design;\n-  Provide direction, mentorship and resources to other engineering groups and project leaders as well as factory technicians;\n-  Lead engineer on a variety of projects and participates in project planning;\n-  Provide early and ongoing manufacturing involvement to ensure new products are manufacturable;\n-  Provides production support engineering to technically complicated assembly methods, procedures;\n-  Designs and develops technically complex processes to improve quality and efficiency;\n-  Review all equipment requirement plans along with an assessment of the robustness of the solution to meet the requirements of the operation as well as the implementation of any additional solutions to mitigate any risks;\n-  Ability to plan, develop and implement thoughtful solution such as machine learning technology for make our manufacturing process more cost friendly, predict the problem and early detect the issue in factory will be an added advantage;\n-  Automation experience on following ares are a strong plus: auto glue dispensing, pick and place, robotics, AOI(vision/laser), alignment or auto screwing. Knowledge of pneumatics, servo motors, PLC and PC-based control systems is a contribution.", "key_qualifications": "", "preferred_qualifications": "Excellent interpersonal and communication skill with capability to work independently and under pressure;\nKnowledgeable in crafting machine qualification requirements, designing of experiments and failure analysis;\nExpert of DFX/DFM and be able to read and interpret engineering drawings (GD&T);\nDedicated project management skills and the ability to work in a matrix organization;\nSelf starter with innovation, integrity and attention to details;\nExperience of working with international supply chain partners;\nUnderstand key factors that impact machine learning algorithms;\nDirect experience working on functional engineering teams such as Mechanical, Electrical, Test, DFX, Sophisticated Manufacturing Engineering, Process Engineering, Manufacturing Engineering or Industrial Engineering, etc. will be advantageous;\nExperienced using process driven and analytical approaches to problems solving (six sigma, 8D, FMEA, etc); good skills in statistical analysis tools like JMP will be a plus;\nExperience with laser welding/etching or glue dispense equipment is preferred;\nBe open and willing to travel internationally to our manufacturing sites.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553603"}