{"title": "System Experience- Notifications and Focus Engineer", "summary": "The iPhone revolutionized how people live, communicate, and connect. The iPad changed how people define a computer. Come help build the iconic user experiences and delightful interfaces that millions of customers use and love every day. The Notifications and Focus team is looking for a creative, customer-focused engineer to help push the iOS and iPadOS user experience forward. Come work with an energetic, hardworking team of engineers, multi-functional teams, and world-class designers to deliver the best mobile experience on the planet!", "description": "Are you passionate about technology, efficiency, and building software that is used by millions of people every day? Have you ever wondered what backs the notification system employed by iOS, watchOS, and macOS? How services like Focus interact with the rest of the system to allow for personalization and intentional use? How all of the beautiful, fluid animations in iOS are achieved? How to make services and technologies that fundamentally make iOS, well… iOS? As an engineer on the Notifications and Focus team, your responsibilities will range from defining, designing, and implementing new features and interfaces, to fixing bugs, iterating on features and focusing on performance. You should have a strong understanding of object-oriented software design, good debugging skills, and an eagerness to tackle tough problems and learn from amazing teammates.", "key_qualifications": "Open-minded with strong collaboration skills, Architectural experience, Familiar with the challenges of working in large codebases, Versed in modern software development methodologies, Analytical and proactive mindset, Excellent object-oriented programming and design skills, Exceptional problem solving, critical thinking, and communication skills, Excellent understanding of optimization and performance issues across OS software layers", "preferred_qualifications": "", "education_experience": "Bachelor of Computer Science or equivalent work experience", "additional_requirements": "Knowledge of Objective-C, Knowledge of Apple’s development APIs (Cocoa, Cocoa Touch, Core-Foundation, Core-Graphics, etc.), Experience developing with Cocoa or other application frameworks, Experience developing reusable public or private APIs", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526730"}