{"title": "PR Manager/Senior PR Manager, Products", "summary": "Apple's worldwide communications team informs the world about our innovative products and services, and the values that drive everything we do.", "description": "As the ideal candidate, you will be able to distill the differentiating qualities and user benefits of Apple’s chips and other hardware technologies to both technical and mainstream audiences via a broad mix of media. You will drive impactful coverage and feature stories.", "key_qualifications": "Empty", "preferred_qualifications": "Experience effectively communicating the intricacies of silicon chips, platform architecture, or similarly complex technologies. Strong media and influencer relationships and a proven track record developing and placing stories. Creative mindset that finds new ways to tell compelling, technically-rich stories in easily understood ways. Experience managing launches/events and momentum PR programs. Can work seamlessly across product marketing, engineering, and other internal stakeholders, going deep into technological details. Strong organizational skills, the ability to focus and simplify tasks while managing multiple projects and programs from start to finish. Excellent writing and editing skills, able to develop pitches and press materials. Ability to quickly analyze media coverage and sentiment, see around corners and apply insights to the team’s work. Effective collaborator who will work cross-functionally across teams and geographies while demonstrating integrity at all times.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556139"}