{"title": "Sales - Apple Solutions Consultant (Geelong)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple products have the potential to change the way people live, learn and work. A unique opportunity exists for an outstanding candidate to join us as an Apple Solutions Consultant (ASC). The Apple Solutions Consultant (ASC) actively promotes the sales of Apple solutions in the Apple section of Consumer Electronics Store (CES) locations. Possessing strong sales, service and product knowledge, the ASC actively represents the culture of excellence and collaboration of the wider ASC community, and works with the members of their in-store team to deliver all the key metrics for success at their store.", "description": "-  Be actively involved in all store level activities to ensure the highest possible revenue targets, service and attach rates are being fulfilled\n-  Maintain high levels of customer service, satisfaction and integrity\n-  Develop a strong working relationship with the in-store team, with a deep focus on collaboration and teamwork \n-  Implement and deliver Apple directed initiatives and leverage Apple strategies and programs\n-  Ensure that Apple product merchandising is always up to standard and updated as required to meet brand, product and segment specific information and promotions\n-  Develop unique selling opportunities and programs with store sales manager and Apple ASC Manager\n-  Ensuring the store is merchandised and Apple products are displayed in accordance to the Apple merchandising guideline specific to the Apple branded fixture located in store.\n-  Always represent the Apple brand to the highest level Training/Coaching\n-  Maintain an excellent sales, product and service knowledge at all times in order to deliver the best customer solution; use this knowledge to cross-train virtual team members\n-  Assist with in-store training presentations to educate customers on the latest in innovation and total solutions; deliver training on Apple specific products and solutions\n-  Coach, train and develop staff members within the assigned location to advocate the features and benefits of Apple’s products and services. Develop skill-sets and behaviors which will allow them to bring these to life in a sales interaction with customers daily.\n-  Arrange and conduct Quarterly Reviews with Store, Area or Regional management to discuss the performance of the store and the plans for growth in future quarters\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. \nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "", "preferred_qualifications": "Experience in proactively and directly approaching tentative customers and enthusing them about innovative products and lifestyle solutions. Focus on goals and continuous improvement. Customer service experience. Advanced interpersonal skills and excellent presentation skills. Strong technical competence. Mature approach, decision-making and follow through. Familiarity with the PC platform. Hardware and service sales background in a retail environment. Involvement in carrying out in-store merchandising plans. Presentation skills. Apple product and channel experience. Understanding of operations and logistics. Strong Sales experience, Written and Oral Communication Skills, Customer Service Skills, Technical Competence, Learning Ability, Teamwork, Initiative, Adaptability. Ability to work well in groups and without routine direct supervision. Take initiative and challenge the status quo. Deliver more than the customer expects. Be dependable and reliable – follow-up quickly and consistently. Demonstrate a positive and approachable demeanor", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556251"}