{"title": "Media-IP SoC Performance Architect", "summary": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system! Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison.\n\nWe are looking for an experienced Media-IP SoC Performance Architect to join our small dynamic team. We own the performance models of several of the complex multi-media IPs in Apple’s SoCs. These IPs are central to the customer experience in almost all of Apple’s products from Apple Watch, iPhone, iPad, MacBook, and next generation product lines. In this highly visible role, you will collaborate closely with cross-functional teams to develop, verify, and use performance models for data driven architectural exploration and validation.", "description": "As a Media-IP SoC Performance Architect, you will have responsibilities spanning all aspects of performance model development: planning model architecture, implementation, validation, performance studies, and RTL correlation.\n\n-  Develop custom tools and approaches for analyzing performance data from these complex architectures applying techniques from data science and machine learning (ML) to provide new insights into their behavior and propose innovative architectural changes to improve the system performance of these IPs.\n\n-  Collaborate with system architecture and IP design teams to plan, implement, and validate a high-level performance model in C++. The performance model is minimal feature set to meet the model accuracy requirements yet modular and flexible enough to be adapted for new projects and architectural exploration.\n\n-  Developing, analyzing, and presenting results of performance studies for different architectural and micro-architectural proposals from within the team as well as other architecture and design teams.\n\n-  Develop custom tools for analyzing simulation results of these complex architectures to provide new insights into their behavior and propose innovative architectural changes to improve the performance.\n\n-  Presenting performance study results to design teams and other architecture teams.\n\n-  Validating the performance model against the specification and correlating the model with RTL.", "key_qualifications": "", "preferred_qualifications": "Strong understanding of SoC, fabric, and memory system architectures\nGood understanding of QoS, arbitration, and queuing theory\nExperience with performance model development & analysis. Good understanding of data analytics, statistics, and applied ML (machine learning) for analyzing large data sets\nStrong software development and organizational skills especially with modular object-oriented SW architectures in C++. Expertise in C++ & latest STL libraries, knowledge of Python, Lua, and shell scripting languages\nStrong problem solving and analytical skills\nExcellent written and verbal communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555456"}