{"title": "EMEIA Retail Fulfilment Operation Program Manager - 18 month contract", "summary": "The Retail Fulfilment Operations (RFO) team strives to provide cutting-edge innovation and operational excellence for best-in-class customer experience. RFO turns Retail Fulfilment into a key value proposition for Apple’s direct customers, through Planning, Execution and Strategic Programs. We are seeking a dynamic, highly motivated candidate with strong Analytic & Project Mgt abilities. This role will have a combination of business insight , technical knowledge and Prj mgt skills, used to develop and deliver reporting and analysis enabling rapid decision-making, management of key projects to support same. You will focus on supporting the growth of Apple’s products, routes to market and critical operations initiatives. This role is highly visible, interacting with our partners in operations & retail and networking throughout Apple’s organisation. The ability to work seamlessly with these teams is essential for achieving the objectives of the position", "description": "Ability to manage strategic projects through the full project lifecycle including translating business needs in to requirements & testing strategy. Develop, maintain, and own robust reporting KPI’s that help to guide the business and measure success. Build and create reporting needs for both online/retail operations teams. Experience with applying techniques to provide solutions to real business problems. Expert in taking complex data and helping to make it easily understood for business and technical teams. Understanding and ability to deep dive operational data, identify trends & make recommendations to peers and leadership to drive impactful business decisions. Identify and evaluate operational risks and implement contingency plans to mitigate. Identify and develop improvements that directly improve the customer experience. Ability to drive strategic direction and influence key partners. Collaborate with our key business partners and understand the 'Voice of the Customer'", "key_qualifications": " ", "preferred_qualifications": "A team player with a “hands-on” and “can do” attitude that can influence through collaboration and leadership. Being able to work effectively with other teams and taking them along for the journey is critical. A curious and creative mindset and the ability to cut through ambiguity with a practical and solutions orientated approach to problem solving. Confidence to make critical decisions and deliver results under extremely tight timelines and flexibility to react to the challenges of a fast-paced environment. Skilled in taking complex data and helping to make it easily understood for business and technical teams. Passion for customer experience. Bachelor’s Degree. Significant experience in a data analytics or a supply chain analyst role.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557321"}