{"title": "Senior Salesforce Administrator", "summary": "Imagine what you could do here. The people here at Apple don’t just create products —they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s Sales organisation generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. At the end of the day, our education customers need to know that, with their significant investments in our technologies, everything’s going to work as promised. We are the ones who make believers out of them. As part of our EMEIA Sales Planning & Operations group, you are responsible for implementing tools and processes to enable one of the largest channel businesses in the world to drive sales and improve customer experience. The Salesforce Administrator will be responsible for the overall management, support, and innovation of the Salesforce platform across the EMEIA region. This role demands a deep expertise in Salesforce, ensuring optimal use of the platform to meet business objectives, and a proactive approach to problem-solving and system improvements.", "description": "- Develop functional expertise in key areas such as channel sales, end-user sales, merchandising, and both digital and physical retail processes. - Attend and contribute to workshops, providing solution approaches and best practices. - Lead discussions with various stakeholders to understand and address real business needs, asking probing questions to uncover root causes and optimal solutions. - Provide innovative solution options for consideration, driving continuous improvement in Salesforce utilization. - Collaborate with global teams and colleagues across different geographies to influence and contribute to the technical solution roadmaps. - Implement regional configuration enhancements, including non-code solutions such as reports, dashboards, and process flows. - Test and validate new releases of the Salesforce solution, ensuring smooth deployment and functionality. - Configure user setups and manage data access configurations to ensure compliance and security. - Work closely with the regional Data Operations team to maintain data integrity and optimize processes. - Maintain deep expertise in Salesforce, continuously updating skills and knowledge to leverage new features and functionalities", "key_qualifications": "Salesforce Administrator Certification and Salesforce Platform App Builder required. Minimum 3+ years experience managing large, complex Salesforce platforms and BAU processes. Knowledge and hands on experience of international channel management operations in consumer, retail or similar markets. Deep understanding of Salesforce platform functionality and best practices. Strong experience in implementation; ability to determine whether requirements are configuration, customization, and/or integrations with external systems. Hands-on experience with configuration of platform features including user management, profiles, permission sets, role hierarchy, org-wide defaults, sharing rules, territories, custom objects, new page layouts, custom fields, formula fields, validations, workflows rules, email templates, process builder, flows, lightning pages, managed packages, etc. Experience with the Salesforce AppExchange and a deep understanding of this ecosystem as well as native Salesforce capabilities. Prior experience in SDLC project management and analysis including scoping timeline management, documenting use cases, process flows/swim lane diagrams, requirements, user acceptance testing, change management, etc. Working knowledge of process documentation & project management software. Experience working with large-scale, complex datasets and using Salesforce data tools. Superior ability to design and implement reports and dashboards. Deep understanding of system security and controls", "preferred_qualifications": "Salesforce Platform Developer 1. Salesforce Sales Cloud Consultant. Marketing Cloud Consultant. Project Management Certifications (Scrum Master/PMI-ACP/Prince2). Experience in sales operations, partner management, and enablement preferred. Experience as a Business Analyst, Operations Manager, Project Manager, and/or Data Analyst. Experience with different reporting platforms like Tableau or Einstein Analytics. BS or equivalent degree in Business Management, Computer Science, Engineering, or related discipline", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557730"}