{"title": "Software Engineering Manager, Test - Intelligent System Experience", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "As a Software Engineering Manager, you will lead a multi-functional team which is responsible for many projects on Apple’s platforms that drive testing and features across Apple from System Experience, to Input Experience, to our Enterprise and Education technologies. You will work closely with your team, other software engineers, project managers and various quality teams at Apple. Your role will help Apple scale in test engineering by creating testable code bases, supporting frameworks, developing tests, triaging results, debugging problems, and improving testing internally to insure the next generations of Apple’s operating systems are delivered with the highest quality possible.", "key_qualifications": "No information available", "preferred_qualifications": "Experience developing for iOS, iPadOS, macOS, watchOS, tvOS and/or visionOS\nExperience in driving development and deployment of continuous integration systems.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $272,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559702"}