{"title": "Apple Developer Support Advisor - French", "summary": "Every single day, people do amazing things at Apple. Here's your opportunity to do significant work by providing extraordinary support to Developers that have supplied to make Apple an iconic technology company.\n\nJoin our extraordinary team - we provide full training to resolve complex issues while keeping a focus on the Developer. When we receive calls and questions from Developers, you won't just provide answers — you'll provide an outstanding experience. Become an Apple Developer Support Advisor and begin an exciting new career at Apple.", "description": "In this role, you will be providing administrative support for Developers (iOS, iPadOS, Safari and macOS) via phone and email. As our Developers’ first point of contact, you’ll be the friendly voice of Apple, providing award-winning customer service, troubleshooting and support. \n\nYou will help them enrolling into our Developer Programs, assisting if they need help in handling their Developer team (inviting other Developers to their team, updating account information and renewals). You will also help them find the appropriate Developer resources, like technical guides and information regarding the app management and the app review process. \n\nWe will rely on your expertise to deliver excellent customer service. How do we do this in the team? By taking the opportunity to portray our creative side and by showing our passion to meet our Developers needs — this is how we remind all Developers that behind our excellent products are amazing people!\n\n-  Ensure email responses are timely, accurate, complete, and well written\n\n-  Promote and demonstrate a spirit of collaboration when working with colleagues\n\n-  Collaborate with agents in Apple’s worldwide contact centres to ensure that you deal with complex agreement issues and share the best practises to the greater team\n\n-  Work cross functionally with other support and critical issue teams to ensure Developers needs are met\n\n-  Work to identify issues requiring partner concern and engage supervisors as appropriate\n\n-  Identify source of repeat issues through root cause analysis input\n\n-  Utilise all necessary team support tools and resources to effectively handle support requests\n\n-  Suggest content additions or edits to knowledge base tools for consistent support experience\n\n-  Regularly review all Developer Services related web content ensuring information is current, raising any discrepancies found.", "key_qualifications": "", "preferred_qualifications": "Outstanding troubleshooting & problem solving skills\nBe a clear, confident and enthusiastic communicator\nHave impeccable organisational and administrative skills\nExperience of working in a high paced, goal focused environment\nKnowledge of Apple products\nBe a standout colleague\nDetail orientated", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559399"}