{"title": "Design Integration Engineer", "summary": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply.", "description": "As a Design Integration Engineer, you will be involved with all phases of implementing high-performance, low-power wireless SoCs from RTL to delivery of our final GDSII.", "key_qualifications": "Knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation. Understanding of UPF and low-power design & implementation techniques. Hands-on experience in timing/SDC constraints generation, analysis, and management. Knowledge of timing corners, operating modes, process variations, and signal integrity-related issues. Exposure to industry-standard Timing, Logic Equivalence, Physical Design, and Synthesis tools. Knowledge of basic SoC Architecture and HDL languages like Verilog. Experience with script-based tool automation and familiarity with APIs and scripting languages such as Perl/Tcl is a plus.", "preferred_qualifications": "", "education_experience": "BS with 10+ years relevant experience required. MS preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $166,600 and $296,300. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542995"}