{"title": "Software Engineering Manager, Business Process Reengineering", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. Business Process Re-engineering team in India is seeking a leader who can shape and guide the development of our Apple-scale systems. As a leader in this organization, you will work directly with the engineering teams of these organizations and have direct impact on their feature roadmap and on the reliability of our storage solutions for our users. You will also participate in the evolution of the user experience on all of Apple’s platforms regarding document editing, cross-app and cross-user collaboration!", "description": "As Software Engineering Manager, we look forward to your managing a team of engineers but make decisions affecting many cross-functional partners. -  You will remain close to the code and are expected to contribute to code reviews and risk assessments. -  You’ll understand the wide technology landscape at Apple and actively drive initiatives to solve pressing problems through reuse -  You will represent your team and technology in cross-functional meetings, partner with many different teams within the Software, Services and AI/ML groups, and work with partners outside of Apple. -  You will participate in clarifying requirements and goals for cross-functional software projects. -  You will have the opportunity to plan a multi-year roadmap and lead the design, execution, and post-execution phases of software development. -  You will be responsible for the development of some of the brightest engineers in the industry!", "key_qualifications": "3+ years engineering management experience\n10+ years of hands-on software development experience building scalable enterprise solutions\nProven track record of owning, contributing and leading delivery of projects, providing subject matter expertise in a functional domain, and running engineering processes.\nExperience in building strong partnerships with product owners, cross-function partners and business stakeholders, and demonstrating an ability to influence, resolve conflicts, and drive results\nTechnical experience with software development and a strong grasp of computer science fundamentals\nPast experience mentoring junior team members, building/growing a strong and diverse team, promoting healthy team culture, driving process improvements, and supporting career growth of team members\nAbility to drive forward through various constraints and ambiguity on difficult problems to make sound decisions\nAppetite to work in a diverse and global team, facilitate collaboration, and cultivate help between engineers\nStrong communication skills and the ability to influence cross functionally.\nA passion for solving everyday problems in innovative ways", "preferred_qualifications": "", "education_experience": "BE / BTech or MS degree in computer science or information management from a premier school", "additional_requirements": "Attention to detail\nComfortable working in a loosely structured organization", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512342"}