{"title": "Supply Demand Planner, Infrastructure Services", "summary": "At Apple, we don't just create products; we create wonders that have transformed entire industries. Our diverse team and their innovative ideas drive the groundbreaking technology and industry-leading environmental initiatives that define us. Join us in making a positive impact on the world! Imagine the possibilities at Apple, where exceptional ideas swiftly become cutting-edge products, services, and customer experiences. With passion and commitment, the sky's the limit for what you can achieve.\n\nDo you wish to be challenged to think creatively?\n\nWe are seeking a highly motivated Supply Demand Planner who will be responsible for system/components planning, material tracking and materials financial management. This is a strategic supply chain operations role, interacting with Suppliers and internal teams. We're looking for a talented and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you!", "description": "In this position you will be generating weekly and quarterly supply plans that meet Apple’s operational and financial objectives. You'll work with cross-functional partners to build and implement high quality material plans and sense changes to demand and adjust accordingly. The Supply Demand Planner will partner with peers to develop a holistic supply chain model to project availability in support of demand requirements. You will also collaborate with Logistics and Technician teams to solve complex problems quickly, sometimes with incomplete information. You will dive deep into details and be expected to communicate clearly. The individual will influence process improvements and tool development in support of the team, as well as lead change management across users of new processes and systems. The Supply Demand Planner will identify improvement opportunities in the supply planning process, garner resources and drive projects to completion.", "key_qualifications": "3+ years of work experience in supply chain management with emphasis on functional roles in supply planning, inventory management and procurement. Ability to understand configuration management and structure / build multi-level product BOMs. Familiar with components and structure of a server platform. Meticulous attention to detail and interpersonal skills. Direct experience in development and implementation of Supply Chain Planning systems and processes. Sophisticated modeling and predictive and analytical skills, including proficiency in data analysis tools (e.g. Excel, Numbers, SQL, MiniTab) and data visualization (e.g. Tableau, Business Objects, etc.). Experience planning in an ERP/MRP system, preferably SAP and/or Oracle. Ability to adapt to changing priorities and thrive in a dynamic, growth-oriented environment. Solid understanding of reporting and finance structures and the data behind in order to provide reporting/summaries that facilitates to make decisions.", "preferred_qualifications": "", "education_experience": "Bachelor's Degree with minimum 3+ years of professional experience required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547381"}