{"title": "Display Module Engineer", "summary": "Do something different! Apple is seeking a hardworking and experienced Engineer to join our display module team. In this role, your primary responsibility will be focused on display hardware development and validation for the next generation Apple product. You will collaborate closely with multi-functional teams and suppliers to ensure the successful implementation of new display technologies and drive engineering excellence from initial concept to final mass production. This pivotal position demands proactive problem-solving across technical domains. A successful candidate needs to be highly independent and results driven, have strong presentation and communication skills, and can thrive in a fast pace and highly dynamic environment", "description": "-  Own overall optical and module master specifications from initial concept to mass production, and drive rigorous validation plan to meet performance\n\n-  Lead multi-functional teams, collaborate with key stack holders to iterate design, set clear goals and priorities throughout the product development phases, drive display module design convergence, and ensure successful display product ramp.\n\n-  Identify and assess critical metrics affecting display performance, analyze experimental and build data, address process limitation, and follow through between modeling and as-built performance\n\n-  Ability to Communicate effectively across the organization, influence other teams, manage risk, make decisions with limited amount of information, deliver against a fast-paced development schedule are key requirements.\n\n-  Travel to support build at component, module, and system factories during critical new product introduction phases", "key_qualifications": "", "preferred_qualifications": "Proficiency in statistical tools (e.g., JMP), programming languages (e.g., MATLAB, Python), and optical simulators (e.g., LightTools or Zemax)\n\nStrong presentation, communication, analytical, critical thinking, and problem solving skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553674"}