{"title": "Sr. Product Manager, Subscription Programs", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! Here on the Apple Store Online team, we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a Sr. Product Manager, Subscription Programs, to help us do extraordinary things! The Apple Store Online Product Management drives the roadmap and delivery of technical capabilities, with a vision for the future of online shopping. We are passionate about delivering an online customer shopping experience worthy of the Apple brand.", "description": "In this role, you will be responsible for enhancing the online store offerings through collaboration with key partners to define the product features for Subscriptions, in eCommerce space, and lead cross functional teams to ensure successful execution of these initiatives. -Deliver an ideal customer experience, and push to deliver the best solution aligned with business team, including Finance, tax, legal, point of sale, marketings, sales and services team. -Work with product, engineering and business partners to ensure that projects stay on track and teams stay productive from concept to design to development. -Set and manage timelines, meetings, and statuses across multiple teams, all while contributing to an inclusive environment through respecting each others' differences and having the curiosity to learn.", "key_qualifications": "EMPTY", "preferred_qualifications": "8+ years Product Management and Project/Program Management experience driving e-commerce or consumer digital experiences, Proven ability to analyze data and drive decision making based on historical and market trends. Demonstrated understanding of technical eco systems, with the ability to synthesize for a broad audience, Ability to communicate effectively, across all levels of the organization, to keep key partners engaged in making decisions and informed of progress. Ability to challenge and debate issues of importance and identify the best possible outcome for the customer, Ability to work with tight deadlines, responding to shifting priorities, schedules, and deliverables, Demonstrates Appleʼs values of inclusion and diversity in daily activities, B.A./B.S Degree", "education_experience": "EMPTY", "additional_requirements": "EMPTY", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559642"}