{"title": "Engineering Program Manager (Special Projects)", "summary": "The people here at Apple don't just create products - they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. We work in a startup atmosphere where individuals take ownership and have significant impact on the final product. We are a team within Apple’s Worldwide Sales organization, Data Solutions & Initiatives— experts in product design, engineering, and portfolio management. We are seeking a highly skilled individual experienced in technical program and project management. This role is critical in ensuring the successful execution of strategic initiatives and special projects that align with our organizational goals. Are you organized and reactive to the challenges of a fast-moving environment with ability to handle ambiguity and create structure? Do you have a strong technical / engineering background, with previous experience in business processes with the proven ability to evaluate, analyze, influence and collaborate across all levels of the organization? If the answers are yes, you would be a great fit for our team.", "description": "This role will oversee the planning, execution, and completion of key strategic initiatives across the organization. It requires a blend of strategic thinking, program management, and operational excellence. The ideal candidate will have a proven track record of managing complex technical projects, a strong understanding of program budgeting, and exceptional presentation skills.\n\nYour responsibilities will include:\n- Support leadership team initiatives and ensure effective cross-department communication.\n- Manage chief of staff duties, and handle confidential information with discretion.\n- Lead and manage technical projects from inception to completion. Develop detailed project plans, timelines, and deliverables, ensuring alignment with strategic objectives.\n- Coordinate cross-functional engineering teams, ensuring effective collaboration and resource allocation.\n- Monitor the project from initiation through delivery including planning and directing schedules. Report on these items to key internal and external partners.\n- Develop and manage program budgets, ensuring financial objectives are met.\n- Analyze financial data to support strategic decision-making and identify cost-saving opportunities.\n- Create and deliver presentations using data to communicate complex engineering concepts clearly, as well as project plans.\n- Understand high-level business, functional and technical solution requirements, and be able to facilitate communication and coordinate discussions that drive decisions at the appropriate stage of the process.\n- Analyze, design, program, debug, and modify software enhancements and/or new products used in local, networked, or internet-related computer programs.\n- Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications.\nSome international travel may be required.", "key_qualifications": "", "preferred_qualifications": "PMP (Project Management Professional) certification.\nHand-on experience with Scrum or other Agile methodologies.\nExcellent communication and presentation skills, written and verbal, to all levels of an organization, with the ability to filter and distill relevant information for the right audience.\nExperience in Finance, Accounting, Operations, Management Consulting, or other high-performance organizations.\nExperience managing chief of staff duties.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554688"}