{"title": "System EPM - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us. We are looking for an experienced, highly technical EPM to join the team driving definition and development of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), a strong product/customer focus, experience guiding complex programs through the development process, and the ability to distill tradeoffs down to key factors and drive critical product decisions we’d love to hear from you.", "description": "As a System EPM, you will work closely with mechanical, electrical, algorithm, and software teams in VPG and across the company to define and develop highly optimized hardware products. You will be responsible for: Driving the development of system requirements based on experience targets and technology constraints. Identifying the most critical questions and organizing teams to find efficient ways to get answers. Understanding the link between technical decisions for the system and customer experience and communicating impacts clearly and concisely.", "key_qualifications": "Understanding of consumer electronics system architecture, Demonstrated ability to work through system-level development tradeoffs, Developed skills for planning and executing development in advanced consumer electronics products - both prototype build events and overall product planning, Strong technical background in Electrical, Mechanical, or Software Engineering, 5+ yrs of relevant hardware engineering experience in consumer electronics, 3+ yrs of project management experience, Proactive and highly self-motivated; good critical thinking capabilities and strong attention to detail, Ability to operate well in an environment with rapid development cycles and constant change, Experience as primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectives, Willingness to travel internationally to support development builds", "preferred_qualifications": "", "education_experience": "Education BS/MS CE/EE/ME or equivalent work experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548499"}