{"title": "Software Engineer, Media Services - ASE", "summary": "Come join the Jet team, writing software that powers all of Apple’s services — App Store, Music, TV, Podcasts & Fitness+. The role is high impact and high visibility, working across our services to build the best experience for our customers. The Jet team builds a system for teams to deploy high quality, performant native apps that source display models from a dynamic, updatable JavaScript runtime. We also build development tools, analytics frameworks and performance tooling. Team members are on the forefront of inventing the fastest and most secure technologies for building applications. We work in a range of technologies from C, ObjC, C++, Swift, SwiftUI and JavaScript.", "description": "We are looking for a senior candidate to bring technical leadership to our team as well as to the whole services organization. You should have viewpoints about how to build the best applications and services and you should be comfortable advocating for the best experience while incorporating feedback from other developers. You should not be afraid to hit pause on a project that is going in the wrong direction and you should be able to get everyone in the same room to talk through a technical implementation in a structured way. You should be able to look at the codebase and the future roadmap and be able to discuss prioritization and direction with leadership.", "key_qualifications": "", "preferred_qualifications": "A track record of building products on Apple platforms, Experience with performance tooling, You have extensive experience using Javascript or JavaScriptCore, You bring in-depth debugging experience, Collaboration skills, you have the ability to work well cross functionally, Passion for quality and attention to detail, Ability to independently learn new technologies, We value strong programming fundamentals and extensive experience with both Swift and Objective-C, You have an understanding of how performance impacts the business", "education_experience": "Bachelors in Computer Science/Engineering or equivalent work experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558830"}