{"title": "Americas Supply Demand Planner", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Premier operational excellence is a cornerstone of Apple's ability to consistently surprise and delight our customers. We are looking for a dynamic, highly motivated Supply Demand Planner for our Americas Operations group. As a member of the Supply Demand Management (SDM) team, you will join a highly influential group within Apple, challenged to scale at the pace of the company’s overall growth. As a leader on this team you will play a critical role in ensuring operational and financial success for the organization. You will develop, communicate, and execute end-to- end product demand and supply plans across all channels of distribution in over 80 countries for a current or future product line. Product line assignments will be made at the time of hire in any of Apple’s multibillion-dollar businesses, including Mac, iPod, iPad, iPhone and Accessories.", "description": "•You will forecast demand, inventory, and multi-channel sell through. Generate weekly and quarterly supply plans that meet Apple’s financial objectives. Evaluate risks. Plan and implement contingency plans to mitigate. •You'll analyze product sales and find opportunities to drive partner groups to appropriate action. •You will partner closely with regional product planning teams to ensure supply plans meet sales requirements. Coordinate with Marketing and New Product Operations teams to set launch quantities of new product introductions and to ensure smooth product transitions. •You will collaborate with the global procurement teams to allocate constrained components, ensure raw material inventory targets are achieved, and minimize material obsolescence during product transition. •Present product updates and recommended actions to Operations executive management team on a weekly basis. •Identify improvement opportunities in the product planning process, marshal resources, and drive projects to completion. •Less than 10% required travel.", "key_qualifications": "You combine extraordinary analytical capabilities, business savvy and leadership skills. You bring thoughtful influence in a matrixed organization, be a strong collaborator and communicator. You have experience presenting to executive management.", "preferred_qualifications": "", "education_experience": "MBA, Masters Degree in a related field, or equivalent work experience, is desired.", "additional_requirements": "Prior experience in fields that demand complex quantitative analysis such as finance or consulting is desired. Prior experience in product planning, production control, inventory management, or production/manufacturing operations is a plus. Ability to think strategically and execute tactically, a persistent attention to detail, and a high level of proficiency in working with numbers.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200513576"}