{"title": "AIML - Sr Full-Stack Web App Developer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. The AIML Collaboration Tools team is looking for a hardworking Senior Engineer. You will enjoy using technology to automate solutions and optimize outcomes focusing on software quality in a fast-changing world of software delivery.", "description": "You’ll be working on a high-performing, high-trust team, building critical internal tools and web-based applications to support ML researchers and internal event coordinators. You’ll move from an idea to building tools that will help our users, simplify our workflows, and improve our process efficiency. Working with product management, you’ll gather requirements, set priorities, and build MVP products. We rapidly iterate on projects using user feedback to produce the highest impact possible, so you’ll continue improving existing products, as well as automating development and deployment processes along the way. In this role, you’ll have a high impact in making hundreds of engineers and researchers more efficient.", "key_qualifications": "At least 4 years of professional hands-on experience as a software engineering staff member\nSelf-motivated, proactive, and solution-oriented individual\nFront-end development experience with Typescript or Javascript (preferably Vue3)\nBack-end development experience with Ruby on Rails\nExperience with continuous integration and testing frameworks\nModern web services architectures, cloud platforms such as AWS, GCE, Azure, and Box\nContainerized services and deployments (Docker/Kubernetes)", "preferred_qualifications": "Experience with React, Next.js, and/or NodeJS\nAble to quickly learn new and existing technologies\nStrong attention to detail and excellent analytical capabilities\nExcellent oral and written English communication skills\nA desire to write internal tools and web applications", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558405"}