{"title": "Technical Product Manager, Enterprise Systems", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.", "description": "We are looking for a Technical Product Manager to develop a deep understanding of various products and build a clear vision of how the product will evolve in Apple's Ecosystem! You will be responsible for the end-to-end product life cycle from customer scenarios, product requirements, priorities, and customer reviews, all the way to product/feature evangelism. This will be possible by working closely with our data engineering leaders and architects across the company. Including technical program management, Business Unit leaders, and ecosystem of technology partners to align on joint technology and business integration roadmap.\n\nYou will develop robust, centralized, automated data-driven Product Analytics frameworks to help scan our landscape. Find opportunities and drive focused solutions for our complex problems. Lead and grow positive relationships with Cloud Data Platform vendors and internal business counterparts to drive adoption of these platforms at scale with speed. Partner with other Product Managers on cross-product and cross-company critical initiatives while staying laser-focused on de-risking from a Security, Privacy, and Compliance standpoint.\n\nThis role includes presenting to a wide audience ranging from the developer community to executives to demonstrate product capabilities. Help drive consensus and agreement on the vision and the product strategy. Manage a robust customer community for your product areas.", "key_qualifications": "3+ years of experience in a Technical Product Management role and delivering a product to market in a large-scale data handling role in a business focused in the data space.\nExperience crafting product roadmaps from conception to launch, driving the product vision, defining go-to-market strategy, leading design discussions keeping end-user experience as the north star.\nHighly analytical demeanor with an ability to make decisions using both quantitative and qualitative data to gauge exciting priorities across business units in multiple geographies. Quickly move between contexts, and demonstrate agility and focus while continuing to deliver.\nSignificant experience and proficiency with modern databases (Snowflake/AWS/SingleStore, etc.) along with experience in integrating with front-end technology stacks. Advanced SQL skills and familiarity with big data technologies and the data infrastructure ecosystem\nGood Understanding of the Modern data architecture of data pipelines, data warehousing, and data management systems and knowledge of data lifecycle design and methodologies\nShould be a collaborative teammate partnering with Engineering Teams, Dev Ops, and other stakeholders to deliver compelling products that meet those needs.\nProduct Management certification a plus.\nSnowflake Snow Pro Certification is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent work experience in Engineering, Computer Science, or Business Information Systems", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524975"}