{"title": "Mixed-Signal Behavioral Modeling Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and extraordinarily hardworking Analog Modeling Engineer. As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and support millions of Apple’s customers every single day. In this role, you will work within the analog mixed-signal design team to model complex custom circuits in order to verify system-level functionality and performance expertly. This is meaningful and rewarding cross-disciplinary position, with a high degree of collaboration and openness across multiple teams. This role will provide the opportunity to work on state of the art mixed-signal systems used in Apple’s world-leading SoCs.", "description": "In this role, you will be responsible for writing behavioral models for custom mixed-signal circuits in SystemVerilog HDL and occasionally C/C++. You will have to write scripts and simple tools for automating repetitive tasks. You will collaborate with circuit design teams to understand fine details of custom circuits, and with DV teams to craft hooks into the behavioral models for effective verification. You will have to run various simulations and equivalence checks to ensure that the model matches closely with the custom circuits.", "key_qualifications": "Deep knowledge of Verilog/SystemVerilog with ability to write synthesize-able and behavioral code. Deep knowledge of digital logic gates, clocking and state elements. Deep knowledge of HDL simulation. Deep ability to read device level schematics. Familiarity with software methods, algorithms and optimization. Deep understanding in writing scripts in PERL/Python. Deep understanding of passive circuit elements, nodal analysis and simple blocks like op-amps. Working knowledge with SPICE simulation and logic equivalence tools is very helpful. Working knowledge of MATLAB desirable. Deep knowledge of systems such as PLLs/DLLs and SERDES blocks is a strong plus. Some working knowledge of numerical probability and statistics is very helpful.", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200515258"}