{"title": "AIML - Sr Language Expansion Engineer, Siri and Information Intelligence", "summary": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? Play a part in the next revolution in human-computer interaction on all of Apple’s Platforms: iPhone, iPad, HomePod, Mac, Watch, tv, Vision Pro across dozens of languages. Contribute to a product that is redefining mobile computing, and work with the people who created the intelligent assistant that helps millions of people get things done—just by asking. Join the Siri Response team at Apple. The Siri Response team is looking for exceptional passionate about machine learning, and unlocking the full potential of ML techniques to improve Siri’s voice, responses and user interactions.", "description": "Take part in bringing the best possible Siri to as many users and use cases as possible. As a Sr. Language Expansion Engineer, you’ll have the opportunity to have end-to-end ownership for the development of Siri for multiple locales, from voice, to language, to character you will play a key guiding role. You'll work with engineering partners to develop processes, tools, and frameworks for building fine-tuning/optimizing ML models for TTS text processing and acoustic models of Siri. You'll also build tools for analyzing errors and systemic issues on Siri voices in all locales. Lastly, you'll implement your ideas directly in our TTS engine in production. Hundreds of millions of users will experience your contributions through more natural and expressive Siri on Apple products.", "key_qualifications": "4+ years experience working in text-to-speech, speech recognition, NLP or related fields\nExperience in data-to-model processing in multiple languages including data analysis and visualization\nCraft, conduct, analyze, and interpret experiments and investigations into ML model performance and quality.\nStrong foundation in building tools and frameworks using PyTorch/Tensorflow for AI/ML applications\nStrong expertise in programming: Python/other languages\nCapable of driving projects of varying sizes and scopes, and ability to dig deep\nStrong communication skills and the ability to naturally explain difficult technical topics to everyone from data scientists to engineers to business partners.", "preferred_qualifications": "", "education_experience": "Master's degree or higher in Computer Science, Computational Linguistics or a related field\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527958"}