{"title": "Software QE Engineering Manager", "summary": "The GPU, Graphics, and Displays (GGD) Test Engineering organization play a meaningful role in the success and delivery of nearly every major Apple product — we're involved with everything that has a display, including HomePod! The development teams we support have brought the world Metal, Reference Mode on iPad Pro, ProMotion on iPhone and iPad, 3rd Party game controller support, AAA gaming to iOS/MacOS, Apple Silicon on Mac, and Vision Pro support. We are the test arm of our development teams, working closely with them to develop test plans, execute them, and partnering with them through development cycles to evolve the testing until our products arrive in our customers hands. We are seeking a highly skilled and motivated test engineering manager to lead our GPU and Graphics Experience QA team.", "description": "The GPU, Graphics, and Displays team is seeking an expert, self-motivated test engineering manager with a real passion for making the macOS, iOS, watchOS, tvOS, and visionOS experience the best it can be. You will lead a team that will work with the latest Apple products, ensuring that the graphics experience is the best in the world. In this role, the test efforts will target graphics technologies across all platforms, partnering with engineering teams to ensure product quality. This role will primarily focus on leading a QA team that will development and execution of automation and functional tests to support graphics technology (Metal) across new hardware and shipping hardware. The successful candidate should have a strong aptitude for learning new technologies, excellent interpersonal skills, and the ability to drive sophisticated and challenging projects. Strong collaboration with engineering teams and an ability to thrive under pressure are key skills required to succeed in this role. This candidate should be experienced working cross-functionally, mentoring others, and leading projects.", "key_qualifications": "Excellent problem solving and deductive reasoning skills, Solid understanding of UNIX-based systems and command-line tools for debugging, analysis, and automation, Obsesses over customer experience, Deep knowledge of the QA process, experience with manual testing, automation, and other QA processes, Excellent written, verbal communication and presentation skills due to the high level of interaction with engineering teams, management, and other organizations, 3 years of management or leadership experience", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in EE, CS, or related field – or equivalent experience", "additional_requirements": "Experienced in Python and scripting, or other programming language. Swift is a plus, Experience leading and driving projects across diverse environments", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $173,100 and $301,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548189"}