{"title": "Test Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, you will help us leave the world better than we found it! We are seeking individuals who have strong factory hardware test experience and supplier management experience to join us to be part of the team in identifying, enabling, and improving world-class manufacturing suppliers for test processes and solutions.", "description": "Deep understanding of the full supply chain test processes. Identify and contribute to the improvement of the factory Test processes. Drive and support CMs in their effort to develop and deploy new Test methods, labor reduction, and automation, as well as any other promising initiatives. Manage test process, technical issues and other test activities for Ops builds, ramp, pack out, and shipping process. Supervise the testing process to ensure the consistency of product testing across CMs and sites. Bring up new CM, including reviewing CM org structure, training CM team, and driving new site’s test setup. Audit and assess CM with the support from the OpsTE central management team, drive CM results to meet Apple’s expectation. Performs assignments in several of the following manufacturing engineering functions: Design for Testability - Provide early and ongoing manufacturing involvement to ensure new products are being tested logically and efficiently incorporating FMEA, and product design targets using the Engineering Requirements Specification (ERS). Product Life Cycle Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering concerning technically sophisticated testing methods, procedures, and failure analysis. Test Process Engineering - Designs and develops technical test processes to improve quality and efficiency. Use statistical tools (such as GR&R, SPC, and Cp/Cpk) to ensure processes/fixtures are scalable and are continuing to perform accurately once qualified demonstrating integration with factory data systems and shop floor systems. Failure/Data Analysis - Plans, develops, and implements procedures for the testing and evaluation of soon-to-be-released products. Specifies test to be performed, compiles data, and recommends test or tester design changes. This will include the use of Design of Experiments (DOE) WORKING CONDITIONS: Work independently and comfortable with working in a dynamic and diverse environment when needed. Accepts business travels up to approximately 30-50%, at multiple sites for both domestic and international. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "", "preferred_qualifications": "Hands-on knowledge & technical capability in tester design & qualifications, troubleshooting, limit setting, and process buy-offs. Knowledgeable in crafting tester qualification requirements including calibration, correlation, capability, repeatability and reproducibility, design of experiments, and failure analysis. Project management and supplier management experience. Proficient in statistical analysis and skilled in using relevant tools for data analysis. Be able to learn new software and AI capabilities. Find opportunities to apply these new capabilities to improve the factory Test processes and tools.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557027"}