{"title": "Display Image Processing Algorithms Engineer - Platform Architecture", "summary": "Do you love working on state-of-the-art technologies? Are you forward-thinking and love solving technological and architectural challenges? At Apple, our Platform Architecture team features a collaborative and hands-on environment that cultivates engineering perfection, creativity, and innovation! In this highly visible role, you will work with display and SoC architects, SoC design and verification teams, display technology and software teams to support the development of SoC display architectures across various Apple products. Join this team and you’ll collaborate with engineers across Apple to develop algorithms and architectures that help build the seamless experiences we are known for worldwide! In this role, you will be developing state-of-the-art algorithms and architectures for displays on various Apple products.", "description": "As a Display Image Processing Algorithms Engineer being responsible for the design of algorithms and architectures for the display sub-system of Apple’s application processor chip (System on a Chip, or SOC), you will have responsibilities spanning various aspects of the design of related IP including: - Develop and evaluate best-in-class image, video and display processing algorithms in Matlab/PythonC/C++ - Perform subjective and objective quality evaluations - Work with chip architecture, silicon design/verification, display engineering and software teams to map algorithms into well-defined architectures that may be implemented in software and/or hardware - Evaluate tradeoffs for image quality, power, performance, area and compute - Generate architecture test vectors for hardware/software validation - Develop tools that may be useful for image and video quality assessment", "key_qualifications": "", "preferred_qualifications": "3+ years of relevant industry experience, MS/PhD in Electrical Engineering or Computer Science, Ability to be a good problem solver and show willingness to learn new concepts and develop skills in hardware architecture and modeling, Experience with application of digital signal, image/video processing to displays, Ability to abstract various image and video processing problems mathematically and develop new algorithms/architectures that are competitive with the state-of-the-art, Ability to take features and algorithms from concept to shipping products, Understanding of aspects of algorithms related to hardware architecture, Effective interpersonal skills and ability to work across groups, Strong written and verbal communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558097"}