{"title": "Product PR Manager, Japan", "summary": "Apple's worldwide communications team informs the world about our innovative products and services, and the values that drive everything we do. Currently seeking a Product PR Manager for Japan communications team.", "description": "-  Bring energy, ideas and an appetite to bring fresh storytelling ideas to fruition\n-  Help devise and implement locally-driven entertainment initiatives, as well as adapt and implement global communications initiatives that resonate with the local audience through strategic planning and execution\n-  Leadership of key Japan-relevant entertainment PR initiatives, management of agency relationships, and prioritizing the most relevant and significant news in a fast-paced environment and continuous news cycle\n-  Discover, develop and manage lasting relationships and partnerships with social media influencers (YouTube, Instagram, bloggers, etc) in the entertainment, consumer lifestyle and tech space to help drive impactful momentum activity and feature stories\n-  Work in partnership with Japan Corporate Communications Head to build strategies and deliver campaigns that increase awareness and understanding of products and their software\n-  Collaborate with other teams and functions to create and deliver the activity that increases awareness and understanding. These teams will include local services teams, PR, Product Marketing and Marketing Communications teams, worldwide PR teams and other country PR teams\n-  Find new relationships amongst the talent and communities that use our products and services to deliver the world’s most exciting work, and lead our efforts in finding new media and social platforms through which we can tell those stories", "key_qualifications": "", "preferred_qualifications": "- BS/BA or equivalent experience preferred\n- Self-motivated, possess a positive team-player attitude and passionate about consumer technology. Self-starter who is dedicated and demonstrates creative and critical thinking abilities\n- Ability to effectively build formal and informal relationship networks inside and outside the organization\n- Experience in delivering creative, impactful PR campaigns\n- Experience in developing and delivering effective communications that convey a clear understanding of the unique needs of different audiences\n- Able to work with ambiguity and on complex topics across multiple jurisdictions. Skilled in multi-tasking, delivering under tight timelines, adapting quickly to change", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554026"}