{"title": "Neural Engine HW Engineer, Platform Architecture", "summary": "At Apple, Platform Architecture is responsible for connecting our hardware and software into one unified system. Join this team, and you'll collaborate with engineers across Apple to design how all of our technologies work in unison. We are looking for a Neural Engine HW Engineer who will help us build future hardware platforms for intelligent mobile devices.", "description": "In this highly visible role, you’ll work with other architects building the next-generation Neural Engine — a custom HW engine behind iOS CoreML framework. You’ll work with SW/applications team on driving future requirements on machine learning/computer vision applications, prototype them in C++/Python, write architecture spec, and work with SW/HW design teams for SW/HW implementation. Experience with machine learning algorithms/applications is desired.", "key_qualifications": "", "preferred_qualifications": "Expertise in HW architecture, computer architecture, GPU architecture\nExperience in compilers — scheduling, register allocation — is a big plus\nDemonstrated programming skills in C++/C and Python\nKnowledge in image processing, camera pipeline, computational photography and natural language processing is a plus\nStrong communication skills and ability to work across various groups\nUnderstanding the system implications of aforementioned algorithms in terms of performance and power on a given HW architecture\nExperience with analyzing ML workloads on different HW architecture — profiling and identifying the performance bottleneck in the system, coming up with suggestions for performance improvement either at algorithm, SW or HW level\nM.S or Ph.D preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558539"}