{"title": "Sr. Firmware Engineering Program Manager, Home and Audio Devices", "summary": "Apple is seeking an extraordinary Engineering Program Manager to help define and develop software platforms for Home and Audio products of the future. In this dynamic position, you will develop, lead, and drive end-to-end execution of software and embedded firmware development programs throughout the product development lifecycle and delivery stages. We are looking for someone who is flexible and can respond quickly, energetically, and enthusiastically to changes. Strong communication and experience across and between a diversity of teams and team members is critical. The candidate will interact with all engineering design fields and along with QA teams, marketing, factory testing, and other resources inside and outside Apple to create exceptional headphones, earphones and home products. Apply today!", "description": "The Beats group is seeking a Senior Engineering Program Manager with a consistent track record of enabling large cross-functional teams to deliver complex features and products. The ideal candidate will possess an entrepreneurial approach to problem solving and have exceptional leadership skills built on a rock solid foundation of planning and risk management. Projects that you would help to move forward include internally developed and co-developed audio and home products.", "key_qualifications": "5-10 years of high-tech industry experience with embedded firmware technologies and environments\n5 years software or firmware program management experience in consumer product development\nTrack record of leading products through the entire product development life cycle\nHistory of handling business relationships with suppliers and partners\nExperience working with off shore vendors and development teams\nExcellent written and oral communication skills\nExcellent interpersonal skills, including the ability to work with diverse teams and interact, influence, collaborate, and negotiate effectively at all levels of management\nKnowledgeable of one or more technologies: audio, optical/image sensing technologies, motion control, ML model device integration, platform security, wireless, DSP, battery, connectivity, UI/UX", "preferred_qualifications": "", "education_experience": "Bachelor's Degree or equivalent experience in related field\n", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552697"}