{"title": "AIML - Language Engineer (Japanese), Siri Understanding", "summary": "Join the team in Tokyo that engineers Siri and other AI powered products for international markets. Our team is primarily responsible for making Siri the best worldwide digital assistant. Teaching Siri how to understand and speak languages is the main goal of our team, together with designing and implementing a highly locally customized experience for our users. We are a deeply diverse and passionate group dedicated to bringing the future of intelligent assistants to the world. We are looking for a highly motivated bilingual speaking (Japanese and English) engineer, with solid software engineering skills, strong machine learning skills and a high sensibility for foreign languages and cultures!", "description": "We are looking for proven ability to be creative, take ownership of a project, superior technical expertise, and an interest in solving problems that stump most engineers. Having worked on shipping products and being familiar with the rush to the finish line is highly desired. This is an opportunity to durably shape the future of human - computer interaction, and walk the state-of-the-art. Specific responsibilities will include: - Engineer natural language understanding and speech components specific to Japanese, utilizing data science and machine learning expertise. - Develop creative solutions to complex issues; automate wherever possible, integrate workflows across diverse systems. - Work multi-functionally with other teams at Apple across the gamut of components (ASR, NLU, TTS, infrastructure, platforms, data science). - Lead annotation efforts and define language specific representations, conventions and techniques. - Apply a data driven/metrics-based approach towards prioritising and shipping features.", "key_qualifications": "Native speaker fluency (or comparable) in Japanese and ability to work in an English-speaking environment. Solid software engineering fundamentals, including proficiency in at least one object-oriented programming language. Strong natural language processing or machine learning skills (e.g., deep learning, classification, regression, ranking, generation). Analytic mentality and obsession for data. Outstanding problem solving and critical thinking skills and getting-things-done attitude. Excellent verbal and written communication, team player mentality and collaborative in nature.", "preferred_qualifications": "", "education_experience": "B.S/MSc in Computer Science or related fields, or equivalent experience.", "additional_requirements": "Desired (but not required) experience/skills: - Consistent record in shipping user facing products and features in multiple languages and markets. - Demonstrated ability to write thoughtful, maintainable code under tight deadlines in a fast paced environment. - Practical work experience in NLP, ML, or related sub-fields. - Proven ability of using creative approaches for solving complex problems. - Quick prototyping, scripting and tool development (Python, Ruby, Shell, ...). - Interest in diversity and cultural differences and how they affect user experience.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552113"}