{"title": "Audio DSP Software Engineer", "summary": "Imagine what you could do at Apple! Everyday, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. The Audio Media Technology Group (AMT) is at the center of audio, video and graphics support in Apple’s innovative products, including the HomePod, Mac, iPhone, iPad, Apple Watch and Apple TV. AMT’s audio team provides the audio foundation for various high profile features like Spatial Audio, Siri, FaceTime and media capture and playback. As part of the audio DSP team, your focus would be on audio DSP algorithms for use in all Apple products. Key pillars of the culture at Apple include: innovation, communication, teamwork, inclusion, excellence, social and environmental responsibility.", "description": "As a member of the DSPLib algorithm team you will be making significant contributions to a C++ library that is invoked whenever a microphone a speaker is active on any Apple device. Your contribution will be development and deployment of library modules code refactoring, CPU optimization, increasing test coverage.", "key_qualifications": "5+ years professional coding experience as audio DSP software developer in a team\nModern C++, STL, realtime environments, CPU efficiency, exposure to OOP, Matlab / Python\nReadiness to adapt work-flows and coding styles\nAbility to independently find feasibly solutions to problems and implement them\nHigh level of self organization, stress resilience, proactive approach to work\nAbility to quickly pick up concepts from fields like mathematics, electrical engineering and physics. i.e. Filter design algorithms, physical models of loudspeakers, electrical circuits.\nTeam player, learner, excellent communicator", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Computer Science or other related field.", "additional_requirements": "Critical listening skills, trained ears\nBackground and passion for audio and music\nExposure to professional sound studio environment\nTrack record developing own audio algorithms / plug ins\nCustom UI design\nProfound experience with equalizers, compressors, limiters, etc.\nTrack record developing auto - mixing applications\nAudio ML", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548150"}