{"title": "DE-Manager (m/w/x)", "summary": "Den Geschäftserfolg eines Apple Store sicherzustellen, setzt vielseitige Führungsqualitäten voraus, die du als Manager souverän beherrschst. In der schnelllebigen und dynamischen Umgebung des Apple Store lernst du mit Gelassenheit aus jeder neuen Herausforderung. Du entwickelst und inspirierst engagierte Teams aus einzigartigen Mitarbeitern, die den Kunden positive Erfahrungen vermitteln, während sie lernen, einkaufen und Unterstützung bekommen. Insbesondere teilst du die Apple Vision mit Mitarbeitern und Kunden.", "description": "Als Manager motivierst du dein Team, Kunden im Verkaufsraum ein inspirierendes Kundenerlebnis zu vermitteln. Du leitest die talentierten Mitarbeiter, die technischen Support und Training leisten, und arbeitest eng mit dem Business Team zusammen. Hinter den Kulissen überwachst du Bereiche wie Waren- und Lagerbestand sowie Visual Merchandising. Du baust deine Teams aktiv auf, kümmerst dich um Einstellung, Training und Entwicklung von Teammitgliedern in allen Disziplinen und mehr. Die Apple Einfachheit zu unterstützen, ist eine komplexe Aufgabe, die du einfach aussehen lässt.", "key_qualifications": "", "preferred_qualifications": "Erfahrung im Lancieren hervorragender Kundenerfahrungen – und Ergebnisse – durch Teamentwicklung. Diplomatisches Geschick beim Priorisieren und Erfüllen zahlreicher Verpflichtungen gegenüber Kunden, Mitarbeitern und Vorgängen. Fähigkeit, in einer sich kontinuierlich verändernden. Einzelhandelsumgebung einen kühlen Kopf zu bewahren und gelassen auf alle Herausforderungen zu reagieren. Mit deiner Erfahrung in einer kundenorientierten Verkaufsumgebung hast du deine Führungskompetenzen unter Beweis gestellt. Branchenübergreifende Erfahrung ist wünschenswert. Du lernst leidenschaftlich gerne Neues über Apple Technologien und Produkte. Auf Englisch verständigst du dich sicher in Wort und Schrift und am Standort kommunizierst du fließend in der dortigen Landessprache. Du sprichst mehrere Sprachen? Noch besser. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524022"}