{"title": "Build and Release Engineer", "summary": "We're looking for a build and release engineer to join the Camera Firmware and Driver team! In this role, you will support development and QA teams by managing the source code management system, developing tools and processes for automating builds and regression testing, and coordinating and pushing new releases. We are looking for a passionate engineer who has proven experience with Continuous Integration systems, automation and testing. The ability to thrive in a fast-paced and collaborative environment is a must.", "description": "You will be working with Build and Release team to develop scripts and process to help automation manual process. You will help define process and help team be more efficient. -  Develop and maintain tools to help the Engineering/QA teams improve productivity -  Develop and improve on our CI build pipeline -  Collaborate with multi-functional teams to improve the integration and release process", "key_qualifications": "Strong debugging and problem solving skills. Clear and concise verbal and written communication skills. Proficient in scripting languages such as Python and Bash. 3 + years in overall scripting experience (python/bash/groovy). Passionate about software automation. Experience with make, Xcode and creating applications for iOS, macOS and other Apple platforms. Experience with SCM branching, merging, pull requests.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "-  Familiar with software development lifecycle including continuous integration-  Experience with a continuous integration platform such as Jenkins-  Experience with SCM tools, such as Git-  Exposure to the software development processes such as building, unit testing, code analysis, the release process, and code coverage-  Prior knowledge of embedded software development process and lifecycle is a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount ...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540168"}