{"title": "India PR Manager - iPad & Mac", "summary": "Apple's worldwide corporate communications team informs the world about our innovative products and services, and the values that drive everything we do. Currently seeking a PR Manager for our India corporate communications team to help drive strong product launches and fresh new ideas for iPad and Mac.", "description": "The world’s most creative, exciting and innovative work is created with Mac and our ecosystem. Help us show how the Mac is bringing new levels of innovation to film, television and music production; how it enables scientific discoveries or medical advancements and is the perfect companion for students and professionals. With iPad, you will share how its versatility is creating new ways of working in business, learning in the classroom, and enabling creativity in households and studios.", "key_qualifications": "", "preferred_qualifications": "Able to build relationships and partnerships with creative professionals using Mac and iPad in unique ways, and help them tell their story. Experience managing product launches/events, product reviews and momentum programmes. Excellent writing and editing skills, able to develop pitches and press materials. Understanding of the education and enterprise and SMB space and how Mac and iPad are essential tools propelling students and businesses forward. Strong organisational skills with the ability to focus and simplify while managing multiple projects and programmes from start to finish. Successfully delivered creative PR campaigns that have created meaningful impact. Self-motivated, possess a positive team-player attitude and passionate about consumer technology. Self-starter who is dedicated and demonstrates creative and critical thinking abilities. Excellent written and verbal communications skills. Able to work with ambiguity and on complex topics. Skilled in multi-tasking, delivering under tight timelines, adapting quickly to change. Ability to quickly analyze media coverage and sentiment, see around corners and apply insights to the team’s work. Effective collaborator who will work cross functionally across teams while demonstrating integrity at all times.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556238"}