{"title": "Software Development Engineer - Test", "summary": "We live in a mobile and device-driven world where Deep Learning technology enables a new class of applications. Are you passionate about enabling unique user experiences on Apple products; such as Apple Vision Pro, iPhone, iPad, Apple Watch and the Mac? Imagine the countless possibilities powered by Artificial Intelligence! In the Video Engineering team, we are dedicated to providing hardware acceleration using the new proprietary Apple Neural Engine SOC to enable real time, low power and high performance execution of Deep Learning workloads. Our success is the result of very dynamic people working in an environment which cultivates creativity, partnership and cross-functional collaboration. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives! Will you help us design the next generation of revolutionary Apple Products?", "description": "As a Software Test Engineer in this role, you will collaborate with world-class ANE software engineers to understand the features you will support. Your responsibilities will include developing comprehensive test plans, implementing test cases, and creating test automation frameworks and tools to facilitate test case deployment. Additionally, you will track and report test results and work closely with feature developers to debug any issues discovered.", "key_qualifications": "2+ years experience in test automation or related areas\nStrong practical knowledge of Python programming, and/or other programming language such as C++.\nStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processes\nExcellent written and verbal interpersonal skills, be able to describe and document clearly\nAbility to multi-task and lead tasks with varying priorities\nAbility to work multi-functionally with other teams and groups\nExperience in popular Database management software, e.g. SQL\nExperience with tools like Xcode and CMake are a bonus.\nMachine learning related experience is a bonus.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552235"}