{"title": "Apple Support Market Leader - Greater China (Shanghai)", "summary": "At Apple, we believe in hard work, a fun environment, and the kind of creativity and innovation that only comes about when hardworking people from diverse backgrounds approach problems from varying perspectives. Apple Support is seeking a proven leader who will lead large and complex contact center teams. You will be responsible for developing and inspiring the contact center support organization across several Apple and Partner locations and home-based teams in Greater China. Delivering multi-channel response and resolution for our customers.", "description": "KEY RESPONSIBILITIES INCLUDES; Influence teams and those outsides of direct authority to resolve issues and achieve goals. Ensure team and organizational delivery of quality support by dedicatedly setting strategic plans to ensure customer satisfaction and employee engagement. Distill complex datasets to provide insights that are not obvious or apparent. Understand, articulate and help others connect the dots between reporting of contact center cost drivers and spend analysis. Demonstrates the ability to make timely and tough decisions and be resilient under pressure. Optimize systems, processes, resources and organization structure for scalability, efficiency and effectiveness. Perform personnel management activities for staff including recruitment, training, performance evaluation and salary management, and professional development through job assignment and training. You will lead contact center operations through Business Managers and Partner Operations Managers and other direct reports to achieve and maintain required service levels, in addition to other key metrics in areas including customer satisfaction, issue resolution, productivity, staffing and resource utilization. Cultivate and embrace Apple culture, values and credo. Create an engaging environment that will be a great place to work. Hire great people; invest, train and develop them to provide the world’s best technical support and enrich customer experience. People and organization development. Think of new ways to organize and operate about developing your team so that they are prepared for increased scale and responsibility. Demonstrate self-confidence have the ability to take control of difficult, unpredictable situations, and hold your own with other strong-willed members of the management team.", "key_qualifications": "8+ years experience in contact center leadership position or equivalent experience. Have a consistent track record of operational results in a large in-bound contact center. Ability to work under general direction and design and execute business plans to achieve strategic objectives. Develop and maintain cross-functional partnerships with other business managers and department heads. Maintain a deep knowledge of contact center reporting with the ability to quickly provide a thorough analysis of data. Comprehend and communicate a broad awareness of case management and the levers to effectively lead to case duration targets. Acclimate quickly when facing change and new challenges. Evaluate successes and failures for innovation and improvement opportunities. Quickly grasp the essence and underlying structure of complex processes. Able to effectively motivate, inspire and lead large organizations through change. Steadfast and dedicated to exceeding the expectations and requirements of internal and external customers. Acquire firsthand customer information and use it for improvements in service and support delivery. Act and lead with customers in mind. Establishes and maintains effective relationships with customers and key internal partners while gaining their trust and respect. Makes good decisions based upon a mixture of financial analysis, wisdom, experience, judgment and input from team. Communicate concisely and clearly both orally and in written form with a variety of frontline employees, frontline and middle management and higher level senior leadership. Strong knowledge and experience of contact center operations and technologies, including the latest industry best-practices in the areas of ACD routing, analytics/reporting, workforce management and quality monitoring. Operational support experience in multi-lingual, multi-channel support operation and home-based call programs. Great Teammate that cultivated relationships and worked collaboratively. Experience working with HR on employee management, policies/procedures. Solid understanding of cost and financial accounting principles. Fluent in English and Mandarin is a plus. COPC process training preferred.", "preferred_qualifications": "", "education_experience": "Bachelor's degree, MBA is preferred", "additional_requirements": "We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530082"}