{"title": "HR Shared Services Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "This team owns the intake, resolution and escalation of operational work related to employee records and data. We provide centralized administration support for various programs, aligning business needs and regulatory requirements to manage employment data and documents. In this central role, you will manage and drive work across a team of operations specialists, using data-driven insights to shift resourcing strategies as needed and plan our support for large scale projects. Inspiring, supporting and leading a team is key to success in this role. \nRESPONSIBILITIES MAY INCLUDE:\n-  Lead team in resolving issues of varied scope related to employment policies, practices and records\n-  Maintain the highest regulatory and compliance standards in handling employee records\n-  Ensure team processes complex data updates on records\n-  Maintain file storage, including both digital and hard copy\n-  Responding to time-sensitive requests for employment information from key Apple partners\n-  Architect innovative and scalable solutions to drive productivity\n-  Provide career development and mentorship to team of direct reports\n-  Build and maintain a quality relationship with internal business partners\n-  Collaborate with internal business partners to identify and resolve potential gaps\n-  Monitor and constantly strive to improve the efficiency and effectiveness of processes", "key_qualifications": "", "preferred_qualifications": "Ability to collaborate and influence key business partners\nProven success in developing effective strategies in an operational role\nSuperior analytical skills and the ability to approach problems flexibly and creatively\nExpertise in effectively balancing workflow between team members, ensuring the needs of various business partners are being met Exceptional problem solving, time management, and organizational skills\nProven track record of driving process improvements and an insatiable desire to provide outstanding customer service\nExcellent written and verbal communication skills and highly capable of exercising tact, discretion and diplomacy\nThe ability to manage the demands of multiple and sometimes conflicting internal customers\nAbility to work independently, execute multiple tasks simultaneously, and cut through ambiguity\nUnrivaled attention to detail and consistent delivery of the highest quality of work\nSkilled at effectively managing and prioritizing escalations or business critical situations\nDegree education in relevant field desirable\nAt Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone. Therefore, we are committed to treating all applicants fairly and equally. We will work with applicants to make any reasonable accommodations.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556655"}