{"title": "Software Engineering Manager, Cloud File Providers", "summary": "Are you ready to impact hundreds of millions of people accessing their files in the cloud from macOS and iOS every day? The Cloud File Providers team is seeking a leader who can shape and guide the development of our cloud storage stack on customer devices. Our team owns the FileProvider framework, built upon the APFS filesystem and many other Apple core technologies, and supports services like iCloud Drive and Microsoft OneDrive. As a leader in this organization, you will work directly with the engineering teams of these organizations and have direct impact on their feature roadmap and on the reliability of our storage solutions for our users. You will also participate in the evolution of the user experience on all of Apple’s platforms regarding document editing, cross-app and cross-user collaboration!", "description": "You will manage a small team of engineers but make decisions affecting many cross-functional partners. You will remain close to the code and are expected to contribute to code reviews and risk assessments. You will represent your team and technology in cross-functional meetings, partner with many different teams within the Software, Services and AI/ML groups, and work with clients outside of Apple. You will participate in clarifying requirements and goals for cross-functional software projects. You will have the opportunity to plan a multi-year roadmap and lead the design, execution, and post-execution phases of software development. You will be responsible for the development of some of the brightest engineers in the industry!", "key_qualifications": "2+ years engineering management experience\nAbility to recruit, develop, and retain talented engineers\nComfort with managing multiple tasks in parallel, in tight schedules, with frequent interruptions\nAppetite to work in a diverse and global team, facilitate collaboration, and cultivate help between engineers\nUnderstanding of operating systems fundamentals\nExperience with API evolution and working with API clients\nClarity in decision making, preferring data to intuition", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or equivalent degree or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503216"}