{"title": "Simulation Software Engineering Manager", "summary": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "You will drive the Pre-Silicon platform for next-generation cellular SOCs. In this role, you will assess the HW changes on the simulation platform, drive discussions with the SW/FW team on finalizing requirements, be involved in a virtual platform design review with the team, driving execution with the team, negotiate a timeline with stakeholders, and present the status. A deep understanding of CPU subsystems, SOC architecture, and wireless systems is required. Experience in SystemC or equivalent tools and the ability to work with multiple collaborators are advantageous.", "key_qualifications": "As engineering manager of the Settings team, your responsibilities will include: growing and hiring direct reports; prioritizing work across the team; representing the team's work within broad efforts; and influencing collaborators and partners to deliver the needed impact. Analyzing the new SOC architecture and scope out impact on the simulation platform, discussing with various SW/FW collaborators to collect the requirements for pre-silicon platforms. Understanding co-simulation designs, reviewing integration strategies, how scheduling works between different simulators, and providing timely feedback to the team. You will track project status and deliverables, communicate status clearly to leadership and cross-functional partners, and balance high-quality product delivery under tight schedules. You will engage with SW/FW teams to collect pre-silicon requirements, prepare a schedule, and negotiate timelines with collaborators.", "preferred_qualifications": "", "education_experience": "Bachelor's or Masters degree in computer science or related field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550216"}