{"title": "CAD Gate-level 3DIC EM/IR Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple. The people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it! As a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to develop, define and refine the methodologies and flows for gate-level, as well as transistor-level designs. Major tasks will include functional static/dynamic IR analysis, scan mode IVD analysis, package and interposer model handling, 3DIC and multi-die analysis, power EM analysis, SigEM, power switch modeling, design abstract and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more. Are you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?", "description": "In this highly visible role, your primary responsibilities will include:\n\n- Development of custom EM/IR solutions that scale with accuracy and capacity challenges.\n- Streamline and automate EM/IR flow with ownership of the entire flow.\n- Support and collaborate with design groups (Physical design and integration, circuit design / Power / Package & System / Technology) on their EM/IR requirements for various post-layout flows.\n- Work with EDA vendors and foundries for tool qualification, debugging, and enhancement.", "key_qualifications": "", "preferred_qualifications": "Ability to coordinate and drive initiatives with little to no oversight.\nExcellent communication and presentation skills.\nHands-on knowledge of industry-leading EMIR tools e.g. Voltus, VoltusFi, RedHawk-SC, Totem.\nExperience in the development of large-scale software in multi-user, multi-site environments.\nHands-on experience in analyzing, optimizing, and debugging IR/IVD/Electromigration issues on high-performance, large-scale designs.\nExpertise in physical verification, simulations, timing and noise analysis.\nExperience in package designs and package models.\nKnowledge in hierarchical EMIR analysis.\nTransistor-level EMIR analysis methodologies.\nExperience in ESD analysis.\nMS or PhD in relevant field preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559520"}