{"title": "Software Engineer, Core Services - Apple Services Engineering", "summary": "The Core Services team at Apple Services Engineering is looking for a software engineer to help build scalable and creative features that delight hundreds of millions of customers around the world on App Store, Apple Arcade, Apple Music, Apple TV+, Apple Books, Podcasts, MusicKit, iTunes etc. across multiple platforms on iOS, macOS, tvOS, and watchOS.", "description": "You will be part of the server team that powers customer-facing features within the Apple client applications - Apple Music, Apple Podcasts, Apple TV, App Store, Apple Arcade, Fitness+, MusicKit etc. You will be working multi-functionally with various teams across Apple to deliver some really exciting features to our customers. Thinking about web service performance is a constant thing for us, and we are searching for someone like-minded. If you are used to thinking about performance in terms of median, 95th percentile and 99th percentile, then we are looking for you! You would be someone who is not afraid to question assumptions, is a phenomenal teammate under tight deadlines and seeks problems with sophisticated technical solutions. You will also have the opportunity to help develop and enhance the MusicKit - Apple Music APIs for our developer community and partners.", "key_qualifications": " ", "preferred_qualifications": "Experience with NoSQL or document oriented data stores (e.g. Apache Solr / Redis / Memcached / Cassandra / Voldemort / MongoDB etc.) is a plus.\nAbility to work in a fast-paced environment, and agility to build customer facing features that span multi-functional teams.\nExperience writing effective unit and integration tests.\nOutstanding debugging, critical thinking, and interpersonal skills.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558738"}