{"title": "US Sales Financial Analyst, Demand Forecasting & Analysis", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future. Join us, and you’ll have a meaningful role in continuing Apple’s legacy of efficiency and success.", "description": "Apple’s Demand Forecast and Analysis group is seeking a Financial Analyst to support the US Channel business. You should be highly motivated, team oriented, and a process driven individual who will become a dedicated business partner supporting our Controller, Sales Directors, Route-to-Market Finance, WW Sales Finance, Sales Operations, Supply Demand Management and Reseller Operations. You will be able to work both independently and also be a phenomenal teammate. You should have the ability to effectively and thoroughly analyze data, present the findings in a clear, concise manner and communicate the key take-aways in an executive style. - Financial modeling, reporting and market analysis, and written and verbal presentations to senior management and executives. - Forecasting weekly sell through, sell in and channel inventory by analyzing performance to date and assessing potential risks and opportunities - Proposing detailed revisions to current quarter forecast on weekly basis and explaining internal and external drivers and financial impact - Quantifying the uplifts associated with promotional offers and sizing the non-promotional baseline demand used for sales negotiations - Building quarterly unit forecast for future quarters and tracking and understanding business performance against it and reasons for performance variances - Understanding the US Channel business and strategy, and how variables such as historical performance, seasonality, promotions, sales initiatives and macro economic environment affect current business trends - Becoming the subject matter authority on understanding the consumer electronics industry staying up to speed with the various competitor launches/promotions and service plan offerings. - Standard reporting and ad-hoc analysis by building and managing scalable excel models (Tableau and Business Objects experienced preferred) - Supporting ongoing development of Apple’s business support systems", "key_qualifications": "", "preferred_qualifications": "Demonstrated success in balancing multiple activities/projects, priorities, and people in a dynamic, fast-growing, results-driven environment, Exhibit the highest standards of accuracy and strong organizational skills, Confirmed analytical and problem solving skills, Proven ability to build effective business partnerships in a cross-functional organization, Ability to see the big picture while simultaneously zooming into the details, Ability to work under tight deadlines and deal with ambiguity, Excel Specialist including Macro experience, Experience with Demantra, Business Objects, Tableau and Essbase", "education_experience": "3+ years of finance experience, or related forecast/planning experience, Bachelor’s degree in finance or accounting", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553202"}