{"title": "Engineering Operations Project Manager", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? People here at Apple don’t just create products - they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do!", "description": "You will lead multiple projects within the wider EMEA Product Operations team. Responsibilities will include alignment with project sponsors, forming and leading the project team, defining budgets and obtaining approval, regular communication of status and critical issues to a wide stakeholder group, escalation of impacting issues to functional owners and tracking and delivery of project goals within the agreed schedule. -  Lead efforts on strategic projects across Product Operations. -  Develop links with the business owners and the functional management team in Product Operations as well as partner teams in other Apple functions and key external vendors. -  Apply best-in-class project management methodologies on all projects. -  Implement an effective communication strategy to ensure that all project partners are kept fully informed on project progress. -  Ensure that projects are well scoped, utilise appropriate resources and apply well-costed solutions. -  Provide accurate updates for the standard project meeting cadence. -  Ensure that the team meets its key goals and critical issue procedures are clearly understood and in place. -  Provide leadership, direction & motivation to each project team.", "key_qualifications": "Meaningful experience in a project management role in a high volume global technology manufacturing operation. A consistent track record in hardware engineering or operations programme management. You bring experience in leading technically sophisticated projects that are dynamic and are critical to the business. Strong interpersonal and proven leadership skills, along with the ability to operate in a fast paced and flexible environment. Comfortable working within a highly matrixed organisation with many resources who do not report to you. Ability to collaborate with different teams including engineering, operations, business functions and external suppliers, using savvy influencing skills to drive decisions and meet specific deadlines. Analytical problem solver who is data driven, with a can-do attitude and flexibility to accommodate evolving business needs. Facilitate communication across a project and alert broader team of changes to scope, timeline and resources. Strong communication skills and be able to articulate complex business and technical situations to a variety of audiences. Ability to optimally prioritize, multi-task with strict deadlines on multiple projects in a fast paced environment.", "preferred_qualifications": "", "education_experience": "-  B.Eng / M.Eng in Engineering (Electrical, Mechanical or equivalent qualification\n-  A formal project management qualification would be an advantage", "additional_requirements": "We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200531497"}