{"title": "Cellular Systems Simulations Integration Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. In this role, you will be at the center of a silicon design group responsible for physical layer systems for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations.", "description": "The candidate will take part in the pioneering work of designing and developing innovative cross-layer simulation model infrastructure and tool sets, which will play an important role in cellular R&D across teams within Apple. The responsibilities will include but not limited to: Integrate PHY reference models in PHY only, reduced signaling and full stack pre-silicon simulation and verification environments used by systems engineering, HW, FW and SW development teams. Contribute to simulator configuration management and perform SW releases. Work on simulation framework related topics, such as regression infrastructure development, test coverage analysis, design of automation scripts as well as tool deployment and library integration. Design and implement 4G/5G PHY models for pre-silicon simulation and verification. Perform verification of the PHY models using 3rd Party test tools and test data provided by external network vendors. Contribute to link-level simulator modelling, meaningful metric testing and framework design. 4G/5G PHY/MAC layer abstraction/modeling, and interfacing with higher layers via external simulators. Design test cases for feature verification, drive feature bring-up and issue resolution. Collaborate across teams to define/ document project requirements, including model architecture, interfaces, and feature sets and solve integration issues with HW and FW teams.", "key_qualifications": "N/A", "preferred_qualifications": "Good understanding of simulator frameworks for link- and system-level simulations as well as FW development. Experience in chip bring-up including the use of lab equipment is a plus", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "N/A", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556599"}