{"title": "Lead Writer, German, Marketing Communications", "summary": "The Lead Writer, German will own the localization of marketing and communication materials and the origination of copy for local marketing initiatives in the relevant German-language markets. You’ll ensure that work is optimized for the local market and delivered to the highest possible standard, maintaining Apple’s values and brand tone.", "description": "-  Creatively translate US English copy into local-market language while preserving the intended message, voice, and tone. - Ensure that localized copy is enhanced for the intended market while maintaining the Apple tone of voice and intended message of the original creative, and adhering to inclusive writing standards. - Write English back-translations for all localized headlines. Creatively lead the origination of copy for local marketing initiatives in the relevant German-language markets, working in partnership with strategy, brand, and creative teams. - Creatively advise the output of our language agency to ensure their writers and editors are delivering work that maintains Apple writing standards. - Proofread and edit copy during final in-situ validation, ensuring accuracy, clarity, and messaging consistency. - Collaborate with team members, project managers, and producer teams to align on language validation, and continuously innovate to enhance our processes. - Keep up to date on industry trends, cultural evolution, and socio-political events in the market, as well as standard processes in copywriting, translation, and technical writing.", "key_qualifications": "empty string", "preferred_qualifications": "- An experienced leader — you take ownership for the quality of the work and provide clear creative direction, copy guidance, and feedback to others. - An innovative problem solver — you’ll work in partnership with multiple teams to continuously optimize our processes and workflow. - Knowledge of Apple products and communications, and a curiosity about technology in general. - An incredible collaborator — you’re comfortable working with a broad range of internal and agency teams to deliver the work. - Flexible and adaptable. - Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education, and give you special employee pricing on Apple products. - Apple benefits programs vary by country and are subject to eligibility requirements. - Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. - Note: Please attach a portfolio of work / link to your online portfolio if you have one.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552503"}