{"title": "Print Production Manager", "summary": "The role you’re looking at is part of the Marketing Communications (Marcom) group at Apple. Our team works to ensure that the company’s strategic products are conveyed in the most compelling way to a wide array of audiences in multiple markets and languages across Europe. We develop and create the world’s best marketing communications in support of our amazing products. We're not engineers here at Marcom, but we share the same goals - to make everything we touch beautiful and elegantly simple.\n\nThe role of a Print Production Manager in Marcom is to bring creative concepts to life in multiple print mediums.\nIn this role, you will be instrumental in producing 2D elements on behalf of Apple with a goal of maintaining the highest visual standards of one of the most beloved and empowering brands through all vehicles by which marketing and advertising appears and is maintained globally.\n\nAs part of our team you will be supported by inspirational peers and colleagues from around the world, as you contribute to our continued success. If you’re looking for a place to do the best work of your life, this is it. Join us. We can’t wait to see what you will do!", "description": "The Print Production Manager role provides print production expertise, strong purchasing and project management skills and the ability to maintain schedules and budgets for all pre-press and printed materials on various substrates. \nThe range of work includes, but is not limited to, pre-press, packaging, large corporate event graphics, collateral projects, retail window and in-store graphics, signage, gift cards, and premiums. \nWork with stakeholders both in Europe and worldwide to agree priorities, and shape the strategy and executional approach to the different work streams, using outside partners and other global resources. \nThe position works cross-functionally with other teams in the Marcom group and is responsible for facilitating effective routing and reviewing of projects through the department.\nFacilitation of Creative Team’s art direction, ensuring accurate interpretation and follow-through on multiple assets and versions.\nBenchmark rates for repeating projects and competitively bid unique projects. Work with procurement in accordance with corporate guidelines. Support producers, procurement, and finance to ensure that accurate quotes and budget approvals are received and that the correct quarterly purchase orders are raised.\nWork with channel teams to assess all print needs and partner with carriers and retailers whenever possible to share spec recommendations, provide colour guidance, and advise on best methods for quality control for projects that Apple does not directly purchase. \nLead suppliers during proofing, colour management, and printing phases, including on-site press passes, finishing, quality control, and kit spot-checking.  PPM will advise on best methods of kit packing and fulfilment; on-site fulfilment visits will be done on a regular basis, particularly during launch periods.\nDevelop, train, and scale in-country production agencies for Apple’s quality control expectations and print requirements.", "key_qualifications": "Must be a strong Print Production Manager who is flexible, proactive, highly organized, excellent at multi-tasking, very comfortable under pressure, and able to work effectively as a team member.\nExperience within a creative agency or production environment equivalent.\nExpert colour analysis skills and extensive experience working pre-press in RGB and CMYK with an eye towards quality and detail.\nFunctional ability to review files in Adobe InDesign, Illustrator and Photoshop files.\nIn-depth familiarity with large and small format litho and inkjet printing, dye-sublimation, and speciality finishing techniques.\nOn-press experience and expertise in all aspects of production is expected.\nComfortable with determining specs, estimating and/or competitively bidding all projects, maintaining budgets; communicating any obstacles that would require additional funding; conducting negotiations with suppliers as necessary.\nAbility to implement highly complex initiatives and to recommend the best course of action on all production-related considerations.\nCommunicates fully, effectively and diplomatically, and exhibits proactive, solution-oriented thinking and execution.\nWorks collaboratively in partnership with others, maintains professional demeanour under pressure and in situations of ambiguity.\nDemonstrates the ability to positively and proactively partner with teams inside and outside of Marcom, often with limited direction.\nDuring peak launch/refresh periods, evening and weekend work may be required. The candidate must also be willing to travel both domestically and internationally, often at short notice.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537096"}