{"title": "Process Development Engineer (R&D)", "summary": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. Excellent opportunity to join our Process Development team. The successful candidate will have opportunity to conduct feasibility studies, develop new process and material development for new module technologies under research and development.", "description": "-  Work on process equipments to conduct proof of concept evaluation and DOEs -  Establishment of baseline process and metrics -  Perform process characterisation -  Establish design guidelines for manufacturability -  Define procedures and metrologies -  Generate engineering report base on studies and evaluations -  Reporting of engineering studies to cross-functional team", "key_qualifications": "", "preferred_qualifications": "Minimum 5 years of experience in doing process R&D, Hands-on experience in various module assembly processes such as flip chip, flex attach, pick and place, dispensing, bonding, filling, laser soldering, component cleaning, curing, plating, singulation, wafer bonding., Good knowledge in design of experiment (DOE), engineering statistic, root cause analysis and problem solving, Familiarity on different metrology tools and quantitative measurement methodology, Clear and effective written and communication skills, Resourceful and innovative, Knowledge and work experience in one or more of the following processes & handling such processes equipment - 1) Flip Chip bonding (Thermosonic, Thermocompression and etc) OR 2) EVO die bonder, EVG and Suss process equipment OR 3) Flex Attach (Flexible Printed Circuit Board Bonding), Solder Jetting/Laser Wire Soldering OR 4) SMT (e.g. solder printing, component pick&place, AOI, SPI and reflow), Knowledge on adhesive or epoxy or other bonding material is an advantage, Experience in optical components, active alignment and high accuracy bonding process is preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558465"}