{"title": "SoC QoS/Fabric Performance Engineer, Platform Architecture", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! In this role, you will be a member of the Platform Architecture team, working with hardware and software engineering groups to shape the architecture of Apple's future System-on-Chips (SoC). We are seeking an energetic and highly motivated SoC performance engineer to drive development of our on-chip communication interconnect and memory Quality-of-Service features.", "description": "You will help create a full-chip C++ simulator for iPhone/iPad/Mac/Watch SoCs. You will model new, emerging workloads such as Augmented Reality (AR) and Machine Learning (ML). You will use these models to study a range of performance and power trade-offs in our SoCs. Your work will be highly visible and critical for driving architecture improvements in Apple’s future products. Your responsibilities will include: - Learning about the state of the art in SoC IP and chip-level architecture including network-on-chip - C++ modeling of graphics, camera, and ML dataflow, network-on-chip and integration with other SoC models - Running performance simulation of future applications - Careful analysis and presentation of simulation results - Tuning and validating future SoC HW/SW for the best user experience - Collaboration with cross-functional modeling, hardware, and software teams - Some international travel is required for this position", "key_qualifications": "Deep C++ programming knowledge, Coursework and understanding of computer architecture and the HW/SW stack, Practical experience with performance modeling and debugging, Practical experience with scripting for automation and data visualization, Practical experience with network-on-chip architecture and design is a big plus, Ability to study a problem in depth, design experiments, analyze data, and present results, Examples of substantial HW or SW projects brought to completion, Experience with Cellular/5G modem architecture is a plus, Strong communication and documentation skills", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550723"}