{"title": "UI / Full-Stack Engineer, AI Platform, Applied Machine Learning", "summary": "Come join the Applied Machine Learning team to do your best work on exciting and groundbreaking projects that will surprise and delight our users. Apple’s Applied Machine Learning team is looking for a talented and enthusiastic Senior UI/Full-Stack Software Engineer to join the team building AI and ML models serving and applications deployment platform.", "description": "In this role, you will apply all of your knowledge, experience, talent, and creativity to help us build the next generation of our platform enabling a new wave of AI and ML-powered applications across hundreds of teams and thousands of apps and models. You will work closely with software and ML engineers to make sure they can utilize the platform as efficiently as possible and get all the features they need, back-end services engineers to integrate, infrastructure and DevOps engineers for every customer, and many teams at Apple using the platform to instrument and incorporate ML and AI into the core of their products.Additionally, you will help shape the future and the roadmap of our platform, drive strong engineering excellence and culture, and see the effect of your work on Apple customers.", "key_qualifications": "Bachelors Degree, Strong CS fundamentals, including data structures, algorithms, system design, object-oriented and functional programming, etc. Ability to speak a common language with back-end, DevOps, SRE, and SDET engineers, Extensive experience designing and implementing large, highly interactive applications from scratch using one of the modern JS frameworks (Vue, React, or Angular) utilizing client-side routing and data store, Hands-on experience building facade/webapp and API data aggregation services using Java/Spring (preferred) or Node/Express, You work on multiple layers/level of the platform resulting in deep knowledge and experience with development lifecycle, CI/CD pipelines, different types of automation testing, logging, monitoring and alerting, and production debugging, Demonstrate backend experience which has allowed you to have a good sense of pixel-perfect design and UX and ability to build new UI that looks good using existing UX guide and UI components library, Strong collaboration skills, system thinking, and ability to clearly explain complex concepts", "preferred_qualifications": "BS OR MS in Computer Science, Math, Physics, Engineering, or a related field, Experience with web accessibility standards is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557152"}