{"title": "Touch ASIC Architect (Analog)", "summary": "Design, develop, and launch next-generation Touch Technologies in Apple products! The Touch Technology team develops ground breaking Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more! The key goal of our team is to enable the world’s best multi-touch user-experience. Our team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. An ASIC Analog Architect within our Touch Technologies team is responsible for analyzing the application and coming up with the best analog front end (AFE) architecture for touch and other sensing ASICs. These designs include multiple analog acquisition and digitization channels with complex filtering and DSP.", "description": "You will be architecting Touch sensing systems and the ASICs required to realize them. You will also be expected to take high level user requirements and create a realizable system that meets these goals. This will include high level modeling of proposed solutions, along with creating detailed specifications of the requirements. This is a highly cross-functional role and you will work collaboratively to identify critical aspects of how the design will interact with the overall product. Responsibilities include: -  Creating Touch sensor system architectures -  Developing high performance, low power signal processing and sensing architectures -  Authoring detailed specifications, analyses, and characterization plans for touch system ASICs based on these architectures -  Performing modeling of the system and ASIC using high level tools -  Optimizing designs across multiple disciplines, including Hardware/Firmware design partitioning, trade-off assessments, design checking and tolerance analysis -  Contributing technical assessments to strategic decision-making relating to technology and investments -  Performing defect root cause analysis and resolution -  Communicating program status, technical issues, risks, and mitigations plans, clearly and concisely -  Minimal business travel as needed to support product development", "key_qualifications": "Experience developing and launching high volume IC designs\nStrong electrical engineering background in analog circuit design; exposure to signal processing, mixed-signal design, filter design, and/or embedded system design is a plus\nExperience in system-level design, requirements documentation, and IC micro-architecture definition of complex mixed-signal ASICs\nExperience with IC bring-up and debug\nProficiency in MATLAB, Verilog, or similar simulation, design & modeling tools\nExcellent written and verbal communication skills\nDirect experience with touch technology and/or flat panel display technology is beneficial", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534545"}