{"title": "People Business Partner (AppleCare)", "summary": "Do you have a passion to help others succeed? Do you genuinely believe that talent is the greatest asset of any company? As a member of Apple’s People group, you’ll help discover and develop our most important resource: our people!", "description": "In this role, you will closely partner with business leaders to align on the People strategy...", "key_qualifications": "7-12 years of proven performance as a strategic HR Business Partner\nA rotation in an Organizational Development or Project center of excellence would be an added plus.\nEffectiveness, coaching, and culture\nFoundational understanding of HR analytics and experience with HR systems & tools is essential\nWorkday knowledge is a plus\nStrong communication and influencing skills\nHighly collaborative style\nResourceful, inventive, self-motivated and able to independently lead\nAbility to coach, mentor, and advise to help managers and employees grow and develop\nImpeccable judgment and ability to balance the needs of the company and employees alike\nStrong project management and Excel skills are desired", "preferred_qualifications": "", "education_experience": "BA/BS or equivalent is preferred", "additional_requirements": "Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity.\nWe also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $120,500 and $181,100, and your base pay will depend on your skills, qualifications, experience, and location....", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547074"}