{"title": "GPU Power Efficiency Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Join us to help deliver the next groundbreaking product containing an Apple designed GPU!", "description": "-  Responsible to generate and analyze GPU Efficiency Projections – Performance per watt, for each generation of GPU over the full cycle of the project, from concept to Silicon.\n-  Work on the methodology of generating these curves to improve accuracy and quality.\n-  Work with Technology, Power and Static timing teams to determine the Frequency-Voltage curves for the workloads.\n-  Work with Performance and Power teams to gather data for the Efficiency curves and analyze the impact.\n-  Work with the Silicon team to improve projections based on Silicon data.\n-  Work with System and Chip level Power team as a resource for GPU to handle requests.", "key_qualifications": "We are looking for candidates with 3+ years of experience in the semiconductor industry in areas of power, silicon technology or architecture. A successful candidate has:\n- Background in Architecture, Silicon Technology or Power.\n- Skills in Python, VBA or other coding skills.\n- Experience with Data Analysis and Excel.\n- Ability to work across teams.\n- Strong communication skills.\n- A growth mindset, self driven, detail oriented and organized.\n- Experience in Power Projections or Performance Analysis is a plus.\n- Experience with GPU workloads is a plus.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of BS + 3 years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505729"}