{"title": "AIML - Data Operations Site Lead (GC)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Can you build and inspire high-performing teams of unique individuals who deliver? Can you share the Apple vision of perfection with your employees and work towards results? The AIML Data Operations team is responsible for delivering high-quality, human-annotated, machine learning data at scale to product teams across Apple. This global data annotation and collection initiative enables Apple to build amazing new experiences and advance flagship experiences, such as Siri. We are passionate about what we do and creative about how we collaboratively solve problems for the organization!  This is a fast paced, dynamic environment, we are seeking a leader who can exhibit composure while learning from each new challenge.", "description": "The Site Lead for our AIML Data Operations team will lead and develop teams. You will manage policies and procedures and conduct quality audits of support. You will collaborate with cross functional partners in the development of tools and reports to analyze and run the business, including workflow optimizations, workforce management, and volume predictions. You’ll report on status, milestones and goals to stakeholders and leadership. You will mentor and inspire your teams to deliver innovative ideas, strong performance, and high quality results. You’ll determine staffing requirements, participate in interviewing, hiring and on-boarding of new team members. You will be responsible for overall team performance with a focus on developing managers and achieving quality results. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "key_qualifications": "8+ years leadership experience, managing and motivating large, high-performance teams; Experience managing geographically dispersed teams; Detail oriented with excellent analytical skills; Demonstrated track record of strategic decision-making and good judgment; Strong written and verbal communication skills and ability to present to senior leaders; Excellent interpersonal skills with the ability to motivate and inspire direct reports; Excellent problem solving, critical thinking, meticulous attention to detail and dedication to quality", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience, MBA preferred", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "N/A", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552661"}