{"title": "AIML - Sr Engineering Program Manager, Siri Metrics & Evaluation Methods", "summary": "Imagine what you could do here. Are you passionate about driving the delivery of ground-breaking intelligent experiences? The Apple AIML org is building such experiences and the technologies that powers them...and we are looking for people like you! We are looking for an outstanding, customer focused AIML Senior Program Manager to support the insights and opportunity analyses for Siri — including the metrics and evaluation methods that measure them. All with the guiding goal of delivering the highest quality user experience that Apple customers expect and love. You have strong program experience with the data and techniques to measure end-to-end user experiences. You have a track record of driving large, complex cross-functional projects which are dependent on innovative data collection and machine learning technologies. You are data-driven, strong analytically and comfortable navigating ambiguity. Apple offers a collaborative work environment that fosters creativity and innovation. Become part of the team and play a key role in delivering and driving improvements to the Siri experience impacting over 1 billion customers.", "description": "-  Drive the implementation and means to operationalize measurement and evaluation methods across the organization\n-  Lead the process for finding opportunities and prioritize initiatives to hill climb on quality\n-  Facilitate regular data insights and Siri metrics reviews with product teams and leadership\n-  Ensure cross-functional alignment and communicate project / product updates to leadership\n-  Collect inputs and requirements from key partners. Help define new approaches to metrics and methods\n-  Work with data science and data engineering teams to develop success metrics and evaluation solutions \n-  Work with annotation operation teams to optimize and lead human data collection and evaluation efforts\n-  Work with engineering, privacy, and legal teams to develop safe data collection", "key_qualifications": "5+ years in Program or Project Management leading cross-functional data and software engineering teams and delivering end user facing technology products which are powered by machine learning\nStrong analytical skills and a curiosity to discover opportunities for impact and a better user experience\nAbility to work across a large number of teams to enforce process and efficient outcomes in a data-driven environment\nSuccess in large organizations evangelizing and consensus-building using strong relationship and influence skills\nExperience in working with teams to develop quality frameworks and defining success metrics\nStrong communication and presentation skills, written and verbal. Ability to collaborate with senior team leaders", "preferred_qualifications": "", "education_experience": "BS/MS in EE/CS/CE or equivalent quantitative / engineering degrees.", "additional_requirements": "Preferred:\nBS/MS degree with a focus in machine learning, data mining or statistics\nPrior product management experience in delivering end user facing technology products\nExperience rolling out large scale tools and processes\nHighly skilled at cross-functional management without authority\nPast program management experience at a top technology company", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544125"}