{"title": "Product RF Design Engineer / Wireless Systems Engineer", "summary": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a Product RF Design team member, you will be at the forefront of wireless technology as we push the boundaries of achievable wireless performance for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products. We’re looking for dedicated and motivated engineers with sound fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration & wireless communications.", "description": "Product RF Design Engineers should have a broad-based knowledge of RF architecture, design, integration, and manufacturing. They have deep theoretical and practical knowledge in one or more areas of electromagnetic theory, RF and Wireless circuit design, communication theory, and product design trade-offs. They use electromagnetic and system simulation, hands-on prototyping, test, and measurement to understand complex system and sub-system interactions, implications for product-level design, and manufacturing trade-offs to enable mass production. Product RF Design Engineers apply their expertise in all aspects of product design, from concept, architecture definition, integration, and prototyping to final production. They work closely with wireless and software architects, industrial designers, and product designers to guide and sculpt the product design with an eye toward optimizing RF/Wireless functionality for the user. Traveling up to 15% of the time may be required to visit overseas manufacturing facilities to support builds from the prototype phase to mass production. RESPONSIBILITIES: Antenna design from architecture to mass production, Wireless integration is optimization both with RF as an aggressor and as a victim, Managing the prototype builds, testing, KPIs, FA, to ensure the product is ready for mass production, Work with cross-functional teams to design and deliver Apple products with outstanding wireless performance.", "key_qualifications": "", "preferred_qualifications": "Master’s or above degree in Electrical Engineering with Electro-magnetics or RF emphasis or work experience in the Wireless domain of 5 Years, Hands-on experience with RF lab instrumentation, Ability to debug Desense issues and characterize noise sources, Experience with the production environment and statistical analysis, Knowledge of EM or RF Hardware or antenna design, Knowledge of integration of wireless technologies such as cellular, GPS, WiFi, and NFC into products, Knowledge of RF schematic and PCB layout practices and guidelines", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558821"}