{"title": "Product Manager, iPadOS", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We believe that if you bring passion and dedication to your job, there's no telling what you could accomplish! We believe in the power of combining product management and product marketing together - that the best person to communicate why a product is meaningful to consumers and developers is the same person that helped drive its creation. As a Product Manager at Apple, you will serve as the customer voice during product development working with incredible teams, and also create the launch story and speak to media about why your products matter. We are looking for a highly motivated Product Manager to join the Worldwide Product Marketing team. The Product Manager will be responsible for leading the messaging, launch deliverables, and release strategy for iPadOS along with helping to define new features that will shape the future of iPad. Dynamic, creative people and inspiring, innovative technologies are the norm here. Are you passionate about creating compelling products and ready to join an amazing team? Then we want to hear from you!", "description": "You will have the ability to: - Drive the strategy, roadmap, and feature definition for iPadOS - Work in a global cross-functional team with engineering, developer relations, public relations, and marketing communications through the complete product development cycle - Define product positioning and key product messages - Position the product in relation to other products and the competition - Work with marketing communications and PR to develop product launch activities, press releases, and marketing materials - Travel the world as the ambassador for your product attending press briefings and customer visits - Possess expert knowledge of competitive and 3rd party products - Collect global customer, developer, and partner requirements for future product development - Closely follow emerging technology, consumer, and societal trends and make recommendations for how products will fit into those emerging trends - Evaluate new technologies and make recommendations to pursue in future products - Manage trade-offs involving features, schedule, cost, line positioning, and lifecycle management", "key_qualifications": "5+ years Product Management experience with at least one entire product development cycle from concept to introduction. Experience with consumer software products and technologies for software platforms is strongly preferred\nTechnical track record working closely with engineering/technical teams from an in-bound marketing perspective including during early research and development\nExperience and ability to synthesize technologies into product communication for broad audience including customers, media, analysts, and industry specialists\nBest-in-class oral and written communication skills, as well as demonstrated success as a product spokesperson on a national or global level\nExperience collaborating with cross-functional teams to define product strategy and roadmap, craft positioning, and define marketing activities\nPrevious experience with press and media\nRequires international and domestic travel", "preferred_qualifications": "", "education_experience": "BS/BA degree in marketing/business/engineering and MBA preferred, or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550297"}