{"title": "Display Silicon Architect", "summary": "In this highly visible role, you will be leading the effort to develop ICs for the next generation cutting edge displays for iPad, MacBook and iMac: defining display silicon architecture & requirements, working with external vendors as well as internal design teams for all phase of the silicon development, validating silicon functionality & performance in the module and system, and qualifying the ICs for mass production.", "description": "As a Display Silicon Architect owning the chip architecture and specification, you will have responsibilities spanning all aspects of display silicon design: Architecting and generating engineering specification for the display silicon, Providing performance trade off with system/module team to determine the optimized silicon architecture, Manage vendors from specification to design, tape out and mass production, Manage overall IC design schedules, and support cross-functional engineering efforts, Promote innovation and new technology to further enhance the Display performance and user experience", "key_qualifications": "Experience with whole IC design cycle from specification to tape out and design validation. Good tracking recording on delivered ICs, Analog circuit design including high-speed SERDES transmitter / receiver, operational amplifiers, ADC/DAC, LDO and reference generator, Excellent IC and board level debugging skill. Familiar with lab equipment: oscilloscopes, spectrum analyzer, logic analyzers, Demonstrated ability to meet aggressive and dynamic work objectives., Good written/verbal communication, organizational and leadership skills to coordinate multiple internal teams and vendors, Familiar with Cadence simulation tools for circuit simulation and/or MATLAB for high level simulation", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "- Experience in vendor technical management, - Knowledge in LCD/OLED displays, image quality, or graphics subsystem", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545368"}