{"title": "DE-Specialist (m/w/x) befristet bis 6 Monate", "summary": "Als Specialist trägst du dazu bei, Energie und Begeisterung rund um unsere Produkte zu erzeugen, indem du die richtigen Lösungen anbietest und dafür sorgst, dass die Produkte in die Hände unserer Kunden gelangen. Du hast verinnerlicht, dass der Apple Store sich das Ziel gesetzt hat, Kundenerfahrungen zu bieten, die mit nichts vergleichbar sind. Dazu sondierst du zunächst, welche Anforderungen und Wünsche die Kunden haben. Und mit der Unterstützung deiner Teamkollegen ordnest du diesen Anforderungen die passenden Produkte zu. Du siehst jeden Tag als Chance, weitere Besucher im Apple Store als loyale Apple Kunden zu gewinnen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können. Du kannst dich auf Voll- und Teilzeitstellen bewerben.", "description": "Als Specialist fällt es dir leicht, den Bedarf der Kunden zu ermitteln und ihnen interessante Lösungen anzubieten. Du bist nicht nur die erste Person, auf die die Kunden beim Betreten des Apple Store treffen, sondern du bist auch die Person, die sie führt – du informierst, verkaufst und richtest sogar ihre neuen Produkte ein. Du übernimmst aber auch andere Aufgaben im Apple Store, etwa Mitwirken am Visual Merchandising oder Unterstützen von Teammitgliedern. Du bist wissbegierig, immer bestens über Produkte und Initiativen informiert und bereit, Gelerntes in der Interaktion mit den Kunden anzuwenden. Dein Erfolg wird an deiner Produktivität und an der des Teams gemessen sowie am Gesamterfolg des Stores. Du bist stolz darauf, Apple zu repräsentieren, und es erfüllt dich mit Zufriedenheit, Kunden dabei zu helfen, lebenslange Beziehungen zu Apple aufzubauen.", "key_qualifications": "", "preferred_qualifications": "Du bist leidenschaftlicher Apple Fan und liebst es, diese Leidenschaft mit anderen zu teilen. Du bist bereit, den einzigartigen Servicestil von Apple zu erlernen und dir anzueignen. Du zeichnest dich durch ausgeprägte Sozialkompetenzen aus – du bist hilfsbereit, einfühlsam und kannst gut zuhören. Am Standort kommunizierst du fließend in der dortigen Landessprache (Deutschkenntnisse Minimum B2-Level). Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558970"}