{"title": "Data Center Hardware Engineering Program Manager (EPM)", "summary": "Come join a dedicated team of Data Center Engineering Program Managers! As a Hardware Engineering EPM, you will be responsible for the planning and execution of system builds and driving system board/flex design releases from first prototype through engineering design validation. Our team is looking for someone who can lead complex hardware builds down to the details, drive board design release schedules, and handle the resolution of technical build blockers by working with multiple internal and external teams.", "description": "In this role, you will be responsible for the planning and execution of prototype builds, including materials planning and factory readiness. You will need to establish daily build schedules and distribution plans to support the overall project plan for builds globally. You will also partner closely with multiple teams across Apple to understand key design changes requiring validation to accurately integrate engineering validation needs into the system build matrix. You will drive development timelines for new boards and flexes, lead the internal review process and release to vendors, and be the primary point of contact for our contract manufacturers and worldwide team members by providing clear direction on requests to the factory.", "key_qualifications": "", "preferred_qualifications": "Self-motivated and proactive with demonstrated critical thinking capabilities, Understands and deals well with rapid development cycles and constant change; remains flexible and calm in the face of uncertainty, Ability to support international travel for factory builds, planning and execution of prototype builds, including materials planning and factory readiness, Experience with daily build schedules and distribution plans to support overall project plan for in-region and local builds, Being a close partner with cross-functional teams to understand key design changes requiring validation to accurately integrate engineering validation needs in to the system build matrix, Experience driving development timelines for new boards and flexes and manage internal review process and release to vendors", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553588"}