{"title": "Applied Research Engineer - Multimodal LLMs", "summary": "Are you excited with the amazing potential of foundation models, LLMs and multimodal LLMs?\n\nWe are looking for someone who thrives on collaboration and wants to push the boundaries of what is possible today! The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life.", "description": "We are seeking a highly motivated and skilled Applied Research Engineer to join our team. The ideal candidate will have a strong background in developing and exploring multimodal large language models that integrate various types of data such as text, image, video, and audio. You will work on cutting-edge research projects to advance our AI and computer vision capabilities, contributing to both foundational research and practical applications\n\n• Conduct research and development on multimodal large language models, focusing on exploring and utilizing diverse data modalities\n• Design, implement, and evaluate algorithms and models to enhance the performance and capabilities of our AI systems\n• Collaborate with cross-functional teams, including researchers, data scientists, software engineers, to translate research into practical applications\n• Stay up-to-date with the latest advancements in AI, machine learning, and computer vision, and apply this knowledge to drive innovation within the company", "key_qualifications": " ", "preferred_qualifications": "Expertise in one or more of: computer vision, NLP, multimodal fusion, Generative AI.\nExperience with at least one deep learning framework such as JAX, PyTorch, or similar.\nPublication record in relevant venues.\nPhD in Computer Science, Electrical Engineering, or a related field with a focus on AI, machine learning, or computer vision.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557838"}