{"title": "Product Quality Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, you will help us leave the world better than we found it.", "description": "-  Focus on a few specific products made by Apple’s manufacturing partners in China. Lead each supplier's performance through objective measurements of IQC/IPQC/OQC and field returns. -  Lead quality issues to ensure robust solution and closure related to Incoming, SMT, Final Assembly, Test, Pack and OQC. -  Drive consistent execution of the OEM partner's quality plans in development, ramp, and sustaining phases; Perform audits at the manufacturing partners to ensure compliance. -  Continuously explore improvements of the quality management process, and drive to deliver outstanding product quality and reliability. -  Communicate a summary of performance and corrective actions to management. Highlight key issues and present options for solution to the cross-functional and executive team.", "key_qualifications": "", "preferred_qualifications": "Has strong & efficient data analysis ability, able to apply data mining, statistical analysis for data processing & predication. Experience on scripting, image process/machine learning is a plus. Demonstrate excellent written and verbal communication skills in both Mandarin and English.", "education_experience": "BS or equivalent experience in EE/Mechanical/Material Engineering, master degree or MBA is a plus. 7 to 10 years proven experience in Manufacturing technical roles.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551881"}