{"title": "SAP SM/SD Engineering Project Manager,Enterprise Systems", "summary": "Apple's SAP Global Systems organization within IS&T has an opening for Engineering Project Manager to participate in and drive initiatives supporting customer Service Management business areas. We are looking for a highly motivated, creative and hands-on project manager to join our team. Want to be challenged to think creatively? Ready to be part of a team that makes a difference? Apple’s IS&T manages key business and technical infrastructure at Apple -- how online orders are placed, customer experience with technology in our retail stores, reseller sales and services, network capacity needs around the world and much more. The SAP Global Systems team within IS&T runs the Operations and financial transactional platform that powers all of Apple functions such as Sales, Manufacturing, Distribution, Service and Financials. Ideally you are familiar with SAP's Customer Service solution and have gained hands-on experience during prior project implementations. As SAP techno-functional lead you will work closely with our business teams to understand their specific needs, recommend scalable solutions for meeting these needs and implement global solutions efficiently within pre-determined resources, budget and timeline.", "description": "At Apple, not only our products enrich our customers lives, we are also passionate about developing applications which enrich service experience for our customers. Dynamic, encouraging people and innovative, industry-defining technologies are a norm at Apple. Just as with our products, the same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. We are looking for someone with in-depth knowledge of SAP Customer Service modules with awareness of end to end service contract sales, warranty claims, service logistics and financial processes. As a project lead, you will : Work with business users to analyze and translate complex cross functional requirements into system design and technical specifications Develop functional and technical specification which includes SAP standard configuration as well as enhancement framework utilization such as user exits, iDocs, BAPIs and BADIs. Set up SAP Data Models, data dictionary and table design in respective functional areas Develop wireframes and layouts for user interfaces (UI) Implement interfaces across various IS&T and partner systems such as AOS engineering, GBI, iDMS, Rover, Customer systems, SSE and Device services - utilizing one or more of the various technologies frameworks like RFC, Webservices, PI, EAI, Geneva and SoA. Engineer system interface agreements (SIA) that govern integration rules between SAP and other systems Incorporate security and encryption engineering into system design for PII/PCI compliance and fraud control, using standards such as Stonehenge and SAP encryption. Perform SAP configurations and guide development teams to create a defect free code by providing business use cases and data constructs for unit level tests. Prepare technical project cutover plan highlighting cross-system object dependencies. Incorporate performance engineering concepts to optimize response time, throughput and scale with peak volume tests. Lead integration test across IS&T and partners systems to deliver a robust solution. Engineer proactive systems monitoring and alert solutions for seamless business operations. Build knowledge of emerging areas in AI/ML such as SAP S/4 HANA and SAP Data Intelligence. Assess new technologies to meet future strategic needs through proof of concept prototyping.", "key_qualifications": "Strong communication skills, effective leadership and excellent knowledge of SAP SM (Service Management/Customer Service) module to work on complex, global and cross-functional projects. 3-12 years of SAP configuration experience in the service management functional/project lead role (service notifications, service contracts, quotes, order generation and processing, pricing, contract management). Experience in core Hi-tech industry SM business processes areas such as warranty claims management, service repair models and service contract management. Experience in SAP SM-SD and SD-FI business process integration. Knowledge and experience of SAP S/4 HANA architecture including core functionalities and migration. Experience in leading cross functional global teams on complex projects. Ability to work effectively in ambiguity across business and IT teams. Knowledge of one or more of the following is required : ABAP/4 development code reading and debugging, SAP applications’ data dictionary and table design, SAP technologies such as Business Rules framework, Enterprise Portal, iOS, UI5, Fiori, Webdynpro, Experience with B2B systems integration with business partners outside of Apple such as 3rd party logistics partners, repair depots, authorized service providers and insurance partners. Strong verbal and written communication skills with ability to work on multiple projects simultaneously with minimal supervision.", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science, Management Information Systems or equivalent. Project Management degree or certification is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533668"}