{"title": "GPU Energy Modeling and Analysis Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions! Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices! We are looking for a versatile and creative engineer to support the power activity of Apple best-in-class GPU development.", "description": "Develop micro-architectural level energy models for early power estimation, what-if analysis, perf per watt tradeoff analysis, and power targets. Analyze and provide insight into power consumption throughout the GPU and where opportunities to reduce energy are. Analyze and drive power reduction techniques across entire stack, working with driver, compiler, app engineers, architects, micro-architects, and designers to understand and reduce power of high value workloads through SW improvements or architectural/micro-architectural improvements. Develop tools to aid in the measurement, visualization, analysis of GPU energy and opportunities to reduce power. Conduct directed studies to prototype solutions to improve the architecture/micro-architecture of next generation GPU's to reduce power.", "key_qualifications": "Strong computer architecture knowledge. Experience investigating and evaluating PPA tradeoffs. Knowledge of low power ASIC design. Proficient Python programmer or similar scripting languages. Experience with Tableau and/or Splunk is a plus but not required. Ability to work well in a team and be productive under aggressive schedules. Excellent communications skills, self-motivated and well organized.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of BS + 3 years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541527"}