{"title": "Technical Program Manager & Quality Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. In this highly visible role, you will have process (TPM) and quality engineering (MQE) responsibility for next generation Apple products. This will require you to lead selection, implementation & optimization of manufacturing processes and quality planning and deployment. We handle a network of supplier factories worldwide, with responsibility for our partners to deliver to bold schedules. Our focus is on elegant execution of extraordinary industrial designs, resulting in products that thrill our customers.", "description": "Process Development: Planning, proposing, and leading experiments to produce timely and accurate analyses used to drive design, development, and supply chain decisions. Assessing the suitability of a fabrication technology for a given part design. Planning validation exercises to demonstrate initial feasibility as well as manufacturing capability. Analyzing results of validation exercises and provide technical recommendations. Reviewing progress of development activities at supplier locations and serve as point of escalation for critical process related issues. New Product Introduction: Drive process development and capability assessment activities, reviewing part design documentation to ensure alignment with process capability. Assigns specific tasks and work with Apple suppliers to support process development and/or data gathering activities. Set clear goals for results and provide timely reviews of performance throughout program. Establish validation procedures to figure out acceptance of tooling into development builds as well as mass production. Supplier Execution: Review supplier tool design, process flow, equipment selection, DFM, and DOE proposals. Identify shortfalls and corrective actions to ensure design compliance. Work with supplier engineering teams to map out process development exercises, secure resources, and commit to schedules in line with program goals Assess supplier readiness to support build events and production ramp. Identify potential execution issues and provide recommendations to mitigate risk. You will utilize your Quality Engineering background in the following areas: Quality Planning Apply solid understanding of quality control and manufacturing concepts to develop specific Product Quality Plan (PQP) appropriate to program and commodity. Coordinate all Quality Engineering functions for a program, serving as project manager to lead efforts at supplier locations. Actively participate in the program planning and monitoring process assuming responsibility for key deliverables at all milestones. Provide technical direction and guidance to other Quality Engineers supporting the implementation of the PQP. Assess measurability and creatively address concerns directly with stakeholders. Identify and direct studies to implement improvements in measuring method where appropriate. Establish audit procedures appropriate to program and supplier to ensure adherence to Apple quality standards. Implement FAI and Cp/Cpk reviews of mechanical parts.", "key_qualifications": "7+ years experience supporting new product launches from a mechanical, process engineering, quality planning, quality engineering or product development perspective. Experience with soft materials (non-wovens, wovens, knits, leather) and inputs to those materials (yarns, raw materials) is strongly preferred. Experience with mechanical fabricated parts, or adhesives, glues, jigs, fixtures, tooling, injection molding, plastics experience may be acceptable. Experience developing process quality plans, supplier quality audits, and driving corrective actions and failure analysis efforts. Knowledge of mechanical quality and reliability concepts, supplier management, and general manufacturing operations. Requires International travel to supplier sites. International experience, particularly in Asia is a plus Must have proven hands-on mechanical ability. Demonstrate excellent written and verbal communication skills. Domestic and International travel required. Experience with highly cosmetic parts a plus.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552145"}