{"title": "Senior Backend Software Engineer, App Store", "summary": "Join our innovative software engineering team at Apple Services, where our team exemplifies Apple's long-held passion for combining art and technology. We are the people who power the App Store on a massive scale, meeting Apple's high expectations with high performance to deliver a vast variety of apps in over 37 languages to more than 175 countries and regions. When Apple introduced the App Store, it launched a cultural and economic phenomenon that changed the way people live, work, and play. We continue to innovate the platform, now home to over 1.8 million apps — each crafted using our own software development kit and related services. To deliver such a rich experience at this scale, our engineers build high-performance systems backed by robust testing. In a world where apps have become crucial in people’s daily lives, the App Store team has become crucial to Apple’s business.", "description": "The App Store Connect team is seeking a passionate and highly skilled Senior Backend Software Engineer to play a pivotal role in developing and improving tools and features for app developers driving the App Store platform, primarily passionate about In-App Purchases, Subscriptions, Pricing, and Offers. In this role, you’ll be responsible for building new features, services, data models, App Store Connect APIs, and user workflows on our App Store platform. You will collaborate with a team of dedicated engineers, designers, program managers, and product managers to deliver software solutions that push the boundaries of what is possible. We are hiring a self-starter who is daring and willing to question assumptions. Excellent written and oral communication skills are a requirement. You should have experience developing large-scale, server-side systems using object-oriented languages such as Java. We are looking for a teammate who wants to tackle problems under deadlines and deliver visionary solutions. We value your thoughts on how we can move faster, be more creative, and deliver tools and ideas to empower developers around the world. We expect you to challenge the status quo, care about the details, the end user, and how it all comes together. Does this sound like you? Join our team!", "key_qualifications": "Extensive experience with Java or equivalent object-oriented languages, Over 5 years of experience in designing, implementing, and supporting highly scalable backend applications, Deep understanding of distributed system and microservice architecture, Ability to design and establish coding patterns and standards across multiple code repositories, Proven track record of re-architecting expansive code bases while transitioning to new technologies and frameworks - Significant experience with SQL databases like Oracle", "preferred_qualifications": "Experience with NoSQL and big data technologies such as Cassandra, Solr, and Kafka, Ability to thrive in highly collaborative, multi-functional projects that are high profile and critical to the App Store!", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,500 and $215,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558551"}