{"title": "CV/ML Engineer - Body Shape (m/f/d)", "summary": "Are you eager to work at the intersection of Computer Vision and Deep Learning, on projects that turn technical innovation into Apple products which touch the lives of millions of people? Then join the VCV Body Technologies team at the Munich Vision Lab as CV/ML engineer [f/m/d]. Our team has brought to live the Persona technology that powers FaceTime on Apple Vision Pro. Help us develop ground breaking technology in real-time image-based mesh and shape recovery for more human body understanding use cases.\n\nWe are looking for candidates with outstanding technical expertise, ideally with a track record in algorithm development for image-based shape and mesh recovery, multi-view geometry, human motion capture, or a highly related discipline. Experience with neural rendering or AI image generation is a plus. You should be able to quickly prototype different algorithm solutions, but also to elevate them to production standard. \n\nJoin us for the rare opportunity to work on computer-vision-driven products that go beyond the state of the art and that delight and inspire millions of Apple’s customers every single day.", "description": "In this role as CV/ML engineer, you will be developing image-based shape estimation algorithms for the human body. \n\nThe scope of our team encompasses the entire project cycle, from the initial cross-functional definition to prototype development, quality evaluation, and product integration.\n\nAs ML algorithms team, we are responsible to source our training data by specifying requirements and ensuring their implementation in both real and synthetic data campaigns. Proficiency in data handling, including capturing, processing and managing large datasets, data cleaning, transformation, and augmentation, is essential to tailor the data to specific model and use case needs.\n\nIdentifying the ideal algorithm and model architecture for a particular use case and hardware configuration demands a comprehensive knowledge of available options. Therefore, it is a valuable asset to have experience with a range of deep learning techniques, such as traditional CNNs, transformers and, for instance, neural rendering or diffusion methods. Numerous data-driven decisions must be made, necessitating expertise in model evaluation using traditional or custom KPI metrics as well as computational efficiency on large GPU clusters (training) and on-device SOCs (deployment). \n\nBuilding image-based 3D reconstructions requires a strong understanding of 3D computer vision and image formation principles, as well as mathematics, including linear algebra and optimization. Experience with 3D data representations such as e.g. meshes, point clouds, depth textures, or voxels is advantageous for handling complex 3D data.\n\nExcellent Python programming skills and a deep understanding of best software engineering practices will allow you to make a meaningful impact on a large-scale project. GPU programming could further accelerate training.\n\nIn this role effective communication is essential for conveying requirements, challenges, and solutions to a diverse audience, both technical and non-technical, within cross-functional teams. Strong communication skills and a collaborative mindset are a must.", "key_qualifications": "Strong theoretical background + practical experience in Deep Learning with proficiency in PyTorch or Tensorflow\nComprehensive knowledge in 3D Computer Vision including image formation and multi-view geometry\nSolid foundational and applied math knowledge, particularly around Linear Algebra and Optimization\nGreat Python skills for writing efficient and maintainable solutions in larger code bases\nProficiently in English", "preferred_qualifications": "Strong communication and decision-making skills\nResilience to uncertain and complex environments\nExperience with parametric shape estimation, mesh recovery or highly related discipline is a plus\nExperience with neural rendering or AI image generation is a plus\nBS, MS or PhD in computer vision, machine learning, computer science or related fields", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559768"}