{"title": "Learning Project Manager, Retail Customer Care", "summary": "At Apple, we believe in hard work, a fun environment, and the kind of creativity and innovation that only comes about when talented people from diverse backgrounds approach problems from varying perspectives. We believe each customer interaction is an opportunity to delight, engage, and inspire – and that by focusing on the smallest of details, we can make big impacts with our customers. We have an open position for an enthusiastic, motivated project manager to join our team. You would be responsible for assisting the learning team managers in coordinating internal/external learning activities, maintain and drive for learning projects updates, conducting training and coaching review through data analysis and feedback.", "description": "Work with learning manager and training/coaching leads in resource allocation, planning, forecast Build an association of trust with contact centre management and to update training progress, understand business challenges and performance gaps of teams and individuals Participate in business projects for training and coaching preparation Collaborate with regional and worldwide learning team members in content development, content maintenance, and developmental projects Maintain learning management systems for registration, administration, delivery and evaluation of training Manage operational logistics including but not limited to training reports and facilities Work with learning manager and leads to develop project scope and objectives, projects plan, involving all relevant stakeholders and ensuring accurate timelines Measure learning project performance using appropriate systems, tools and techniques", "key_qualifications": "Experience in assessing learning needs and identifying performance gaps Experience defining curriculum strategies and training plans Familiar with adult learning principles and instructional design techniques, design framework Experience with learning management systems, content management and reporting tools Ability to work efficiently under deadline with numerous projects on hand Strict adherence to company policy on confidential materials", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Customer focused, detail oriented individual with ability to maintain a positive attitude in high-stress and fast-paced work environment Drive for quality results and demonstrates high degree of determination Excellent verbal, written and interpersonal communication skills Adaptive to changing technologies, process and environments Customer service or sales experience preferred PMP Certification a plus We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542488"}