{"title": "PCB Designer", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Are you up for the challenge? Our Engineering PCB Services Organization takes pride in supporting board designs for Electrical Engineering teams at Apple. We are seeking a dynamic, motivated individual with deep understanding of printed circuit board design (PCB), high speed design environments, and the ability to receive guidance from our design engineers to build complex boards. We believe in technology enablement by collaboration and building extraordinary products at Apple. Collaborating with Design teams in the design and development of complex, detailed layouts of rigid and flexible printed circuit boards using CAE and CAD applications and tools is a key aspect of this position. You would work with multiple Design teams to plan schedules, resolve costs, packaging, manufacturing, and electrical design issues. Come join us!", "description": "- Studying PCB design trends and processes, and then evaluate and implement those processes that apply to Apple’s core technologies. Conducting design feasibility studies to evaluate the PCB design goals for packaging, cost, manufacturing, and system performance. - Assisting PCB Designers in the resolution of critical design problems. Train PCB Designers in specialized areas of PCB design. Developing an Understanding of Apple’s design standards for Manufacturing and Test. - Understanding the requirements for a quality design and strives to achieve the requirements before releasing the product to manufacturing. Understands the driving PCB technology and process trends and their application to Apple’s designs. - Under mentorship of seasoned Designers, being able to perform complex and difficult CAD and CAE tasks requiring extensive skill and knowledge of equipment capabilities, applications techniques, and design limitations. - Maintaining technical coordination with Engineering, Products Design, Test, EMC Engineering and Manufacturing. Resolve PCB design issues with fabrication and manufacturing vendors. Passionately participates in the evolution and definition of Apple’s Design for Manufacturing (DFM) guidelines. - Participating in discussions regarding the PCB design specifications and standards with respect to product design, electrical design, manufacturing, and various regulatory agency requirements to figure out design trade-offs necessary to meet design goals and produce high quality PCBs at the lowest cost and within schedule.", "key_qualifications": "", "preferred_qualifications": "Experience with Allegro Software tool, Electrical Engineering fundamentals, Good understanding of defining constraints, Experience shipping out high volume boards is a plus, Experience working with multi-disciplinary teams like Electrical, Design verification, Materials, fabrication.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554752"}