{"title": "Central Team Demand Analyst", "summary": "Apple is a place where extraordinary people gather to do their best work. If you’re excited by the idea of making a real impact, a career with Apple might be your ideal job. Just be prepared to dream big! Collaboration is key at Apple, and every day we'll connect you with your peers and colleagues at one of the most diverse and inclusive companies in the world. World-class operational excellence is a cornerstone of Apple's success, and the Reseller Operations team play an essential role in ensuring operational and financial success for Apple. Reseller Operations are the voice of the Reseller Channel within Operations. We are looking for a dynamic, highly motivated Individual with strong analytic abilities and excellent communications to join the RO Central team as a Demand Planner. As an individual, you will have responsibility for helping to drive our continued success, and be a key player within the Reseller Operations team. In this deeply analytical role, we work closely with our internal teams to drive Reseller Channel partner sell thru, using expert data analytics and relationship management.", "description": "Work with Reseller Operations Customer Support Account Managers to maximise orders and drive partners to the optimal in-stocks. Develop early alert mechanisms through analytical insights in our data sets to monitor key metrics/ business performance and define assignable actions. Drive a management system to support forecast, order book insights and demand planning. Undertake meaningful qualitative feedback on performance and velocity. Challenge, influence and negotiate with operational partners across the organization. Manage the validation and publication of weekly shipment plans.", "key_qualifications": " ", "preferred_qualifications": "A relevant 3rd level degree e.g. Engineering, Maths, Economics, Supply Chain, Statistics or Data Science & Analytics would be an advantage. Relevant operations experience, preferably in a high tech or computer related industry. Proficient in Excel and or other data visualisation tools. Presentation skills and program / project management experience, a distinct advantage.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558336"}