{"title": "Software Engineer Platform Point Of Sale, Retail Engineering", "summary": "Apple Retail Store solutions have always led the Retail industry. As part of the Point of Sale (POS) Engineering team, you will responsible for delivering innovative solutions that improve employee and customer experience in store. You will work on highly visible projects impacting Apple's Retail business, touching millions of Apple customers!", "description": "Apple Retail is looking for a Software Engineer to work on core platform. You’ll work on projects that touch all aspects of Apple Retail Point-of-Sale system, and will leverage your strong software and communication skills to develop and integrate on multiple platforms and architectures. You will develop enterprise class software to enable Apple Store employees to provide best experience to customers.", "key_qualifications": "At least 3 years of professional software development experience. \nUnderstanding, and hands on Java experience - including but not limited to: Core Java, OOPS, Design Pattern, Networking (including non-blocking IO), XML (including XSD), JDBC, RMI, REST, Servlet, Tomcat. \nUnderstanding multi-threaded and event-driven programming. \nUnderstanding of Java memory management and garbage collection. \nUnderstanding of software security concepts and ability to apply secure code practice. \nRDBMS experience in Oracle, MySQL or similar and good skills in SQL and data modeling.", "preferred_qualifications": "Understanding of Software Development Lifecycle, tools and standard methodologies. \nUnderstanding of Micro Service application development and design. \nExperience in software development in Java/Linux/macOS environment \nExperience with binary serialization systems, e.g. Avro/Protobuf. \nExperience with RPC based, e.g. Apache Thrift / Google gRPC. \nExperience in Apache Lucene, SOLR, Elasticsearch and other NoSQL data stores.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558123"}