{"title": "CPU Performance Engineer - Platform Architecture", "summary": "Do you have an uncommon desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do isn’t easy but you don’t take the easy path. We are seeking a highly motivated, innovative, and confident individuals to join the CPU Architecture and Performance Team; we are a group that is driving advanced exploration for next generation iPhone, iPad, and Mac CPU architectures.", "description": "As a CPU Performance Engineer with a focus on the memory subsystem, you will be part of a team that is defining and optimizing CPU and cache micro-architecture. With others, you will seek out areas for improvement while collecting data and measurements that either confirm the idea or rule it out. You will collaborate with experienced CPU and SoC designers in micro-architecture and RTL to assess the feasibility of ideas through modeling, refine ideas and model correlation, and seed new ideas. The role requires the analysis of specific single-threaded and multi-threaded workloads across existing and new product categories to identify bottlenecks and opportunities for improvement. We collaborate as a larger CPU architecture and performance team to maintain and improve the simulation environment and look for ways to boost the productivity of the entire team.", "key_qualifications": "You should have strong knowledge of CPU and SoC architecture and micro-architecture\nBe comfortable in an environment of uncertainty and able to work through ambiguities\nYou will need strong communication, influence, and negotiation skills\nYou will be working closely with others in a simulation environment to enable data driven decisions.\nFamiliarity with performance and/or power simulation environments\nStrong coding skills including object-oriented programming with C and C++\nStrong understanding of common data structures and algorithms\nKnowledgeable in software design patterns\nProficiency in scripting languages such as Perl or Python\nFamiliarity with SIMD and vector architectures a plus\nKnowledge of OS internals and compiler technology a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience. MS or PhD in Electrical or Computer Engineering or Computer Science preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519188"}