{"title": "Applied Machine Learning Engineer", "summary": "Imagine what you could do as an applied machine learning scientist here. At Apple, novel machine learning ideas have a way of becoming extraordinary products, services, and customer experiences quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Here is your opportunity to be part of an incredible research and engineering team building the next-generation of advanced algorithms for sensing technologies in iPhone, Apple Watch, iPad and more. We are looking for inquisitive, creative applied machine learning scientists with expertise in deep learning algorithms for image or time-series data. Working knowledge of signal processing, probabilistic modeling, statistics and embedded programming will broaden your role and effectiveness in this position.", "description": "We're looking for sensible and creative engineers and scientists with a strong background in deep learning. Your passion for leading state-of-the-art technologies will be essential to your project and a key component to our team of world-class engineers and designers who are driven to create the next big thing using deep learning. Join us to enhance the lives of hundreds of millions of people around the world! You will contribute to advanced algorithms that transform raw image or time-series data into interpretable information that feed into elegant applications that delight, connect, and encourage Apple users all around the world. The emphasis will be to work on edge of creativity technologies, but highly impactful deep learning problems that will help improve our users' experience, which has always been at the core of Apple's agenda. More specifically, you will: Design and implement machine learning algorithms that process image or time-series data measured by various sensors in different Apple products Deploy Apple's massive computing platform with thousands of GPU's and CPU's ready just for you to establish scalable, efficient, automated processes for large-scale data analyses, model development and model validation. Communicate advances ideas to a focused team - Develop innovative tools and metrics that change the way we look at problems. Join a thriving Machine Learning community at Apple (https://machinelearning.apple.com (https://machinelearning.apple.com/) (https://machinelearning.apple.com/ (https://machinelearning.apple.com/))) Work cross-functionally with sensor architects and software engineers to build the next generation of sensing technologies.", "key_qualifications": "Strong background in Deep Learning and classical Machine Learning, including but not limited to CNN/RNN architectures, GAN, active learning, k-shot learning and model complexity reduction techniques. Track record of coming up with new ML ideas, as shown by publications, patents or open-source projects. Experience with one or more Deep Learning packages including but not limited to TensorFlow and PyTorch. Proficiency in Python programming", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience.", "additional_requirements": "Experience with signal processing. Familiarity with C++ or Objective-C programming. Experience developing software for Augmented Reality (AR) / Virtual Reality (VR) (ex. ARKit)", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550889"}