{"title": "Sales - Program Deployment Manager (Singapore)", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple is looking for an outstanding, passionate, collaborative and self-driven individual to successfully manage multiple concurrent program deployment in consumer channel. This role is the intersection between Apple’s core strategy and how that is expressed in partner doors through partnership with cross functional team to deliver impactful programs that drive sales and customer experience; whilst ensuring that Apple merchandising standards are understood, deployed and delivered to schedule by all channel partners and vendors.", "description": "The role is highly collaborative, requiring deep levels of cooperation and influential working relationships. The incumbent will partner with WW, regional and country teams, and external partner stakeholders to ensure the channel programs under their management are deployed effectively and in line with the requirements of the channel partner and the sales strategy. Developing and managing multiple concurrent merchandising and retail programs throughout their lifecycle; including retailer negotiations, design, budget management, supplier liaison and execution; are primary functions of this role. Further, and equally important, is the ability to proactively handle changes in project scope, identifying potential risks, and creatively solves problems and executes flawlessly the program deliverables. High level planning, tracking and management reporting associated with store roll-outs and forward deployments of stores are also important aspects of the role. The successful candidate will have a strong background in retail sales and merchandising, understands the key tenets of branding, pays outstanding attention to detail and have a passion for Apple’s ecosystem. They should also have extensive existing knowledge of the South Asian consumer market and the key players within, and the willingness to work hours that suit the needs of the business.", "key_qualifications": "Strong business acumen, commercial competences and experience in working with distributors, retailers and resellers. You keep current on retail technology trends, merchandising trends and in-store opportunities Outstanding and validated capacity to successfully balance multiple concurrent projects according to scope, budget and timeline Tried and tested ability to handle lead and co-ordinate site managers, sub-contractors, vendors and all associated resources involved in project delivery. Demonstrated excellence in project management with understanding of financial planning, budget management, branding and scalability. Perform well in fast paced situations, and are comfortable in a fast-paced, sometimes ambiguous environment. Extensive practical experience in project management of store fit-outs and fixture installations in retail with a keen eye and passion in customer experience. Excellent written, verbal communication and presentation skills. Proficient in Keynote, Pages/Word, and Excel.", "preferred_qualifications": "", "education_experience": "5-8 years of experience in retail marketing experience; or similar experience in trade marketing or merchandising leading across diverse teams. You have a Bachelor’s degree or equivalent education.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549465"}