{"title": "System Power Tools Engineer", "summary": "Are you passionate about understanding how things work under the hood and breaking them down into their subsequent pieces. Does the idea of building a GUI to visualize large amounts of data for analysis sound like a fun side-project? The Core OS software team is looking for a dedicated senior SW engineer for the System Power team. Apple uses its own internally developed tool sets and software tools for power debugging on all platforms. Your contributions in this role will give you the opportunity to have a major impact on delivering world-class power efficiency on Apple’s iOS, watchOS, macOS, tvOS and visionOS based products.", "description": "In this role, you will be responsible for identifying, developing and maintaining the tools used to analyze and visualize power behavior on all Apple platforms. You will also be responsible for architecting and implementing scalable software, both new and existing, that will be used across the Core OS Power Team and across the company. As a System Power Tools Engineer, you may also be asked to work with engineering teams to analyze large telemetry datasets in order to help identify areas for power optimizations. This role will require you to work multi-functionally with architecture, hardware, and software teams to identify needs and areas where toolsets can be created/expanded to simplify the engineering efforts of the team. Strong independent problem solving skills, software development fundamentals, and effective communication are critical for success in this role.", "key_qualifications": "", "preferred_qualifications": "Experience in developing scripts to distill and visualize data\nExperience developing debug tools\nExperience with HW & SW debugging\nExperience interfacing with peripheral devices (USB, TCP/IP, UART, …)\nOutstanding written and verbal communication", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552777"}