{"title": "CDN Software Engineer, Infrastructure Services", "summary": "People at Apple build products & services that craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it. Apple's Edge Services team has end-to-end responsibility for foundational services that every Apple team and billions of customer devices depend on. Our services have to be highly available, scale for global reach, and 'just work.' If you love designing, engineering and running systems that will help billions of customers, then this is the place for you! We are looking for a passionate and talented Software Engineer who will focus on our CDN's control plane and automation systems. Success in this role requires individuals to possess a blend of technical expertise, willingness to grow, and experience in large-scale operations.", "description": "The Edge Services team is looking for a software engineer to join a small team focused on improving the control plane software that makes our CDN go. In addition, your software will help us reimagine what we know about reliability and complex distributed systems. You will channel your creative energies to solve some of the industry’s most exciting challenges! To succeed in this role, you must be a strong developer who thrives in a fast-paced environment, working across teams and organizations. You love building system software, solving what is sometimes thought to be impossible problems, and you have a deep passion for the customer experience. You will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically, and adapt quickly to new technical areas.", "key_qualifications": "Strong software development skills in both interpreted (Python, etc), compiled languages (Golang, etc), version control systems (Git), and CI systems (Jenkins, etc)\n- Knowledge of HTTP, content routing, and caching systems\n- Knowledge of common Internet protocols (DNS, NTP, BGP, etc)\n- Knowledge of operating systems deployment methods (kickstart, etc)\n- Large-system, or distributed systems, troubleshooting skills is a plus\n- Superb communication skills, with experience working across remote teams\n- Proven ability to think criticality and quickly learn new technologies\n- An exceptional team player, with a deep passion for improving the customer experience", "preferred_qualifications": "", "education_experience": "BS degree in Computer Science, or a minimum of 5 years relevant industry and work experience preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $128,300 and $237,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548470"}