{"title": "Machine Learning Engineer", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Are you an enthusiastic Machine Learning Engineer eager to apply your expertise in a fast-paced, innovative tech environment? Join our Global Sourcing & Supply Management (GSSM) Solutions team as a key player in revolutionizing our supply chain.", "description": "As a Machine Learning Engineer on our core AIML team, you will be at the forefront of designing and developing cutting-edge AIML models and GenAI applications. You will be working closely with business stakeholders, data engineers, and IT groups closely and take an active role in effectively communicating the recommendations to senior management. Your work will empower strategic and tactical decision-making processes within our supply chain, driving us towards greater efficiency and success. If you thrive in a collaborative environment, are passionate about leveraging AIML to solve complex business problems, and are excited about the opportunity to make a significant impact in a dynamic tech industry, we want to hear from you! Key Responsibilities:  - Engage deeply with business teams to identify opportunities and translate the needs into innovative and practical AIML solutions  - Design, build, and deploy state of the art AIML models to solve complex business problems  - Understand key performance levers and metrics to highlight AIML solution operational issues and drive improvement  - Foster close collaboration with engineers and infrastructure partners to implement robust and scalable solutions  - Communicate the results and insights effectively to partners and senior leaders, providing clear and actionable recommendations  - Stay updated with the latest trends, technologies, and best practices in AIML, GenAI and data engineering. Regularly research and present new ideas to improve the team's technical capabilities", "key_qualifications": "N/A", "preferred_qualifications": "Expert in AIML modeling, Python, AIML Infrastructure, model deployment and MLOps\nExperience working in Supply Chain, Operations, or a related field\nEnd to end GenAI application experience\nKnowledge in RAG, Prompt Engineering, LoRA and other GenAI techniques\nAbility to operate independently and lead without authority\nSuperb communication and interpersonal skills", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560395"}