{"title": "Enclosure Global Supply Manager", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We provide equal opportunities.\n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Our Enclosure Global Supply Management team is responsible for manufacturing development, execution and production of Apple's differentiated and unique mechanical enclosure parts. Part of Apple's core business is the creation and development of our extraordinary mechanical / industrial designs and as such, the management of the supply chains is required to be equally unique, innovative and specialized. Due to the importance of this discipline in the definition of Apple's brand, this business group must be able to innovate not only our products, but also the very business processes by which we accomplish our objectives. The complicated balance between the need to achieve ground breaking mechanical developments and business execution creates challenges that drive processes that require a bridge from engineering risk to manufacturing capability to business needs. Individuals in this group support the following: - Supply chain management: identification, development, negotiation and management of existing and developing Apple mechanical suppliers. - Cost: develop, negotiate and execute of a part and assembly cost strategy. It's good to have an understanding of mechanical manufacturing techniques is important to better evaluate supplier capabilities and opportunities for Apple. - Cross-functional support: work with Apple's industrial design, product development and operations teams. - Build Support: lead on-site management of mechanical enclosure manufacturing partners to lead the development builds, risk mitigation and ramp. - On time delivery: lead schedule, capacity and supply planning to meet Apple’s production demand. Risk Mitigation: evaluation of technical and business risks using data based analysis and developing sound risk mitigation alternatives. - Program Management: the ability to lead all of the above tasks and personnel resources.", "key_qualifications": "Program Management: the ability to manage all of the above tasks and personnel resources.\nTypically requires 5+ years of experience in Supply Chain Management.\nKnowledge of any of the following preferred: Mechanical subassemblies, enclosures, casings, plastics, grinding, stamping, CNC, mills, lathes, etc.\nSolid communication skills, ability to work in multinational environments, driven and motivated by accomplishing world-class objectives.\nUnderstanding of costing concepts, cost reduction, modeling, etc. is preferred.\nAbility to travel frequently across regions.", "preferred_qualifications": "", "education_experience": "BSME, or BSIE or equivalent. MBA is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519980"}