{"title": "Quality Program Manager, Retail Customer Care", "summary": "As Steve Jobs said in 1997 when introducing the Apple Store Online: “We make amazing products. We should have an amazing purchasing experience.” Twenty-five years on, the Apple Store Online is one of the world’s biggest and most successful e-commerce sites. Our global mission is to bring a flawless, high-quality, digital retail experience to all of our customers. In Retail Customer Care, our team can bring this experience to life. The Learning and Quality team is looking for a driven individual who believes that the customer experience is at the heart of what we do and works tirelessly to help our teams achieve just that.", "description": "In this role, you will work with the quality and learning team (in the region and worldwide) as well as collaborate with the Retail Customer Care leadership. Through targeted contact review, you will be responsible for helping identify business trends and insights, demonstrating that to craft a framework that guides the business to understand what matters to the Retail Customer Service leadership and customers in your region. A Quality Program Manager will participate in weekly business reviews, provide insights from both their own and other coaching contact reviews and are responsible for quality analysis and reporting. You will need to be regularly lead and participate in calibration activities, be an expert in quality standards and align the teams with these standards. You will also need a deep knowledge of the business, performance management and vendor management practices. It is important that you are able to articulate and analyze customer expectations and happiness, service trends and professional ethics and operational policies and procedures are followed. A Quality Program Manager is responsible in supporting and guiding their respective sites and business partners to achieve goals in customer happiness and quality performance and includes building behavior based coaching plans based on qualitative and quantitative insights. This work will be achieved through influencing management, adopting best practices and effective root cause analysis on the reasons for customer dissatstifaction or lack of adherence to customer and business critical processes and practices. This is all done through the lens of As one of multiple quality program managers for the region, you will also partner with your peers to set the direction and provide consistency across the network.", "key_qualifications": "Ability to work with and influence cross-functional business partners to build and achieve strategic quality objectives and goals, Adapt to changing environments, technology, and processes, Commit to results with a high degree of determination, Champion trust and build strong business partnerships, Superb written and interpersonal skills, Ability to work efficiently under deadlines with numerous projects on hand, Strict adherence to company policy on confidential materials, Cantonese listening and speaking skillset are highly preferred", "preferred_qualifications": "", "education_experience": "All candidates who meet the key qualifications are encouraged to apply.", "additional_requirements": "We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540204"}