{"title": "Employment Counsel", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it! Do you love taking on big challenges without precedent? Do you possess a deep knowledge of the legal field and a passion for innovation? As a part of our Legal group, you’ll help uphold Apple’s high ethical and corporate standards, as well as defend our intellectual property. You’ll help provide legal support for all our products and businesses across the globe. We are looking for an attorney to join Apple’s Labor & Employment Law team. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your deep legal expertise to rare and often unexplored aspects of the law. Together with your team, you’ll provide the critical support needed worldwide for all Apple products and businesses.", "description": "The Employment Counsel will provide advice and counsel to management and Human Resource professionals on a broad range of legal issues including, but not limited to, employee and labor relations; immigration; discipline and terminations; and internal investigations. Additional responsibilities include facilitating legal training and managing outside counsel on employment litigation matters and administrative charges.", "key_qualifications": "10+ years relevant legal experience Experience managing and completing complex projects Excellent knowledge of federal and state labor and employment laws and regulations (including ADA, ADEA, FMLA, FLSA, NLRA etc.) Excellent knowledge of immigration laws and relevant agencies Excellent written and oral communication skills Strong client relation skills Experience working directly with management Sense of humor and commitment to professionalism", "preferred_qualifications": "", "education_experience": "JD or equivalent and admission into at least one US state bar", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $221,600 and $333,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200507266"}