{"title": "Wireless Firmware Engineer", "summary": "At Apple, new way of thinking and insights can turn in to extraordinary products very quickly. The success we are striving will be result of highly skilled team working in an environment that nurtures creativity, partnership and novelty in solving tough problems. As a firmware engineer in the Wireless Connectivity Silicon Team, you will be responsible for the design, development, and bringup of innovative wireless silicon for various Apple’s products. Bringing your passion and dedication will lead to innovative silicon solutions for Apple products. Join us! We are looking for a forward-thinking, dedicated, highly competent, experienced firmware engineers to design, develop and bringup fresh silicon for Apple's products - the iPhone, Mac and more!. New challenges arise every day that require sharp problem-solving skills of individuals. Are you ready to take on this challenge?", "description": "We are seeking talented, creative and disciplined engineers to join the best-in-class team that plays a significant part in the development of new silicon for Apple eco-systems by engaging in a dynamic, highly collaborative environment with the focus on the following goals:  - Deep understanding of components/modules within wireless communication systems and the corresponding calibration and impairment reduction techniques  - Develop methods/algorithms to alleviate hardware induced impairments by calibration, cancellation and other applicable techniques  - PHY firmware architecture and design, including calibrations, real-time processing flows, collaboration with RF hardware, microcode, and MAC layer.  - Develop highly efficient designs delivering outstanding performance, optimizing power and memory footprints while meeting hard-realtime latency requirements.  - Debug real-time systems with limited visibility, working hands-on with development boards and lab equipment. - Collaborate with Radio, MAC, and Systems engineering teams to architect, define and implement innovative algorithms, calibrations, and protocols.  - Support pre-silicon validation efforts, including simulation, emulation, and FPGA prototyping.  - Develop SoC test and calibration capabilities for chip, module, and product factories.  - Support post-silicon bringup, validation, performance characterization, system integration and debugging.  - Repeatedly measure and optimize results using various test harnesses  - Automate calibration and verification processes", "key_qualifications": "We are looking for an extensive technical background in one or more of the following: Hands-on experience and working knowledge of wireless systems and protocols such as LTE/NR/WiFi/Bluetooth. Excellent problem-solving skills to address technical issues during design, development, and maintenance phases. Strong embedded SW fundamentals, including knowledge of design and development-flows, real-time constraints, concurrency, multi-processor systems, caching and virtual memory. Deep understanding of data structures, object-oriented design, and system architecture in an embedded environment. Strong software engineering skills including design, development (using C, C++), scripting (Python), and debugging. Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management. Experience with configuration (GIT, Perforce) and release management, continuous integration, unit and regression testing. Strong understanding of design strategies for maintainability, scalability, and code reuse. Excellent communication skills – both written and oral. Highly organized, motivated and passionate about driving results", "preferred_qualifications": "", "education_experience": "BS plus 3 years of industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518065"}