{"title": "Systems Engineer", "summary": "The hardware engineering team is looking for a highly adaptable systems engineer to support multiple development programs. We work with many cross-functional teams in the development, support and sustaining of servers deployed at scale in our data centers. Come join us!", "description": "You will be working cross-functionally with Data Center Engineering, Site Services and SRE teams throughout the hardware development process, but mainly focusing in the initial deployment, POC and/or piloting of new hardware for use at scale in the data center. This requires a motivated, self starter during the introduction of hardware to ensure the success of downstream teams in adopting, troubleshooting, root cause analysis, and integration of new hardware platforms into their respective environments. Your background and expertise in system architecture will help ensure the success and the support of new technologies as they exit the development process between PVT and through ramp/mass production.", "key_qualifications": "Strong understanding of CPU architecture, microarchitecture, and system design as well as subsystem and components; In depth understanding of I/O subsystem architectures, high speed link technologies (e.g. PCIe), NVMe and HDD storage technologies, micro-controllers; Validated understanding of provisioning and boot process and other services such as UEFI, DHCP, DNS, Netboot, etc; A working understanding of OS, Kernels and related modules / drivers with the ability to compile drivers a plus; Firmware upgrade/downgrade processes of BIOS, BMC, various system boards and component level; Basic understanding of network infrastructure (basic troubleshooting of layer 1, 2 and 3); Scripting knowledge and basic coding knowledge using Python, Shell scripting and/or C; Experience working in data centers with understanding of hardware at scale in data center setting; Ability to lift up to 50lb (required for system installation)", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550441"}