{"title": "Sr. Data Engineer, iCloud", "summary": "Would you like to drive the future of Apple’s products, applications, and platform while having the unique opportunity to impact some of the most far-reaching software applications in the world? iCloud Data organization enables Apple to ship better products for iCloud users to access all their content across apps (Photos, Mail, Messages, FaceTime, Calendar etc) from all of their devices all the time by providing consistent, scalable, timely, accurate, complete and fully integrated data infrastructure and capabilities to accurately surface relevant information If this excites you and you are energized by solving hard, high-leverage problems at scale, we'd love to hear from you! We’re looking for exceptional data engineers who have a strong background in distributed data processing, have great and demonstrable data intuition, and share our passion for continuously improving the ways we use data to make the Apple’s products, applications, and platform better.", "description": "What you will do: * Engineer efficient, adaptable and scalable data pipelines to process structured and unstructured data Own and evolve extremely rich datasets on iCloud products and platform interactions to power a wide variety of use cases Build forward-looking data solutions that interface well with existing systems and use judgement to bring cutting edge technologies in the industry to suit iCloud needs. Understand how key technical decisions will drive business outcomes and deliver/aid data frameworks and platforms that improve delivery with high-quality to those outcomes by partnering with cross functional teams. Join a stunning team of data experts with diverse skill set, and deliver excellent solutions that better enable our decision-making process", "key_qualifications": "8+ years of experience working with Spark and other distributed data technologies (e.g. Hadoop, Presto, Flink, Druid) for building efficient & large scale data pipelines. Highly proficient in at least one of Java, Python or Scala Deep expertise in Data Principles, Data Architecture & Data Modeling Understand the Data Lifecycle and concepts such as lineage, governance, privacy, retention, anonymity, etc Strong SQL skills Experience working in a complex, matrixed organization involving cross-functional, and/or cross-business projects Strong communication and collaboration skills & ability to lead high-level discussions on technology strategy and approach Conceptually familiar with AWS cloud resources (S3, EC2, RDS etc) Who are you: You are tenacious, relentless and determined You are curious: always learning new technologies, rapidly synthesizing new information, and understanding “the why” before “the what.” You excel at taking vague requirements and crystallizing them into scalable data solutions You are excited about demonstrating excellence, and learning new technologies and frameworks", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science, Engineering or or equivalent work experience in data engineering.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548095"}