{"title": "Finance BPR Test Process Lead", "summary": "We are looking for a Finance Test Process Lead who embodies our culture and core values. As a member of Finance BPR team, you’ll help drive strategic projects across the organization. You will be joining a team of project management professionals who lead initiatives with our business partners and information technology team.This position is based on site at our office in Bangalore, India", "description": "Define and Drive the QA vision for end to end functional testing for key platforms and applications Communication and co-ordination with globally distributed teams Work closely with internal organisations, project teams and stakeholders to develop project schedules, execute test plans and cases, and deliver high quality products Enhance testing processes, environments, tools and frameworks Act as a strong advocate for quality in the product development process for software engineering Champion Apple’s dedication to providing extraordinary user experience and drives the team to work towards this shared goal. Uphold Apple’s ethical and moral standards while working with internal and external partners. - Form the team on the foundation of excellence, professional growth, inclusivity and respect.", "key_qualifications": "", "preferred_qualifications": "Experience in SAP Testing with good understanding of Finance Processes. Experience in product quality and uncovering hard to find scenarios and bugs Experience in QA for highly scalable, distributed and high performance platforms Excellent knowledge of QA automation methodologies, processes, and tools Experience in testing/test management of S/4 Hana Implementations Experience in presenting executive level briefs for business reviews, forecast delivery schedules and risk mitigations Extremely detail oriented, committed to the highest quality of work you're doing Ability to communicate effectively with peers, senior leadership and globally dispersed partners Deep Inquisitive mind and ability to bring in change Familiar with one of the technologies like Worksoft, Tosca, Java, Python, SQL, Scala, Databases, NoSQL, Web Services (Rest &amp; soap)", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557917"}