{"title": "Systems Design Engineer", "summary": "Imagine what you could do here at Apple. Innovation runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "The Field Service Diagnostics Engineering group is part of AppleCare organization. We help build and supports all hardware diagnostics used by support technicians for Apple products in Apple retail and other service channels. We strive hard to deliver the best possible customer and technician experience by providing high-quality, easy to use tools to support all Apple products. The ideal candidate will be part of a team that is developing and maintaining our existing diagnostics systems and tools, diagnostic scripts and configuration data. They will have to work with multi-functional engineering teams across Apple to collect requirements, define, develop, and help test the next generation of diagnostic and troubleshooting tools for AppleCare. An ideal candidate will have a strong understanding of programming scalable systems and systems integration. They will be part of a team of very hardworking engineers who help AppleCare diagnostics tools and technologies to provide concrete service recommendation to service technicians and help resolve customer issues.", "key_qualifications": "", "preferred_qualifications": "Experience in application unit testing and deployment, Experience in developing web backend services using languages such as Go (golang), Javascript (node.js), or similar, Experience in frontend development is preferred (react programming language), Strong written and verbal communication skills, Exceptional collaboration skills; team player", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554974"}