{"title": "WWPM Education - Educator Programs Manager", "summary": "For over 40 years, teams at Apple have had the privilege of working alongside educators around the world, and we know that with powerful technology and effective support, educators can unlock the unique genius in every learner. Apple's Worldwide Education Product Marketing team is growing, and we’re looking for someone who believes in the positive impact Apple products and resources can have on teaching and learning. As a manager on the education team, you’ll lead the team responsible for designing and delivering Apple’s strategy for scaled educator support and professional learning. You’ll oversee the development of new learning platforms, instructional resources, and other meaningful experiences for educators. You’ll determine how best to communicate Apple Education’s unique value proposition to teachers across all mediums. You’ll collaborate with and influence cross-functional teams. And you’ll carefully track and analyze results to drive excellence. The ideal candidate will combine creative and critical thinking with insight-driven prioritization and a bias to action. You’ll be passionate about developing impactful learning experiences that are simple, elegant, and made better with Apple technology. A deep knowledge of the K-12 education market is preferred.", "description": "In this role, you will: Set the strategic direction for and drive tactical execution of scaled professional learning programs for educators, supporting Apple's efforts around the globe. Build and grow Apple Education’s online learning resources and platforms. Create visual and engaging content to support Apple’s strategic vision. Drive go-to-market activities including campaign design, execution, and reporting across multiple channels. Collaborate with senior leaders in Marketing, Sales, Marcom, PR, and Retail to drive program priorities, narratives, and deliverables. Track performance of initiatives and overall customer momentum across strategic focus areas. Lead a team of passionate, creative, and self-directed individuals.", "key_qualifications": "10+ years of experience leading product management, program management, learning and development, or product marketing teams, ideally in the education or technology industries. History of building training and professional learning programs, and instructional content with high impact. Experience managing creative agencies. Strong ties to the EdTech community, and an understanding of the drivers of success in EdTech implementations. Experience building and running complex projects and influencing cross-functional partners. Excellent organizational, analytical, communication, and interpersonal skills. Strong attention to detail and extremely high standards of quality. Ability to prioritize and lead multiple projects to meet aggressive deadlines. Open-minded, patient listener, and active participant. Creative and authentic storyteller with exceptional writing, editing, and design skills. Excellent people management skills, able to inspire and motivate an experienced team. Fluency in Apple technology.", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree / MBA preferred, or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $185,800 and $279,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541176"}