{"title": "Regional Quality Manager, Retail Customer Care", "summary": "As Steve Jobs said in 1997 when introducing the Apple Store Online: “We make amazing products. We should have an amazing purchasing experience.” Twenty-five years on, the Apple Store Online is one of the world’s biggest and most successful e-commerce sites. Our global mission is to bring a flawless, high-quality, digital retail experience to all of our customers. In Retail Customer Care, our team is able to bring this experience to life! The Learning and Quality team is looking for a driven individual who believes that the customer experience is at the heart of what we do and works tirelessly to help our teams achieve just that.", "description": "Regional Quality Manager (RQM) leads teams of Quality Program Managers (QPMs) who are responsible for supporting and guiding their respective sites and business partners to achieve business goals. RQM demonstrates a fundamental understanding of contact center operations, anticipate broader business needs, collaborate influentially with cross-functional teams, and develop strategic goals and tactical plans. RQM align resources to maintain a balance of customer, people, and business focus; have a passion to develop future leaders; and drive accountability to ensure success. In this role, you will work with the business teams (in region and worldwide) as well as collaborate with the Retail Customer Care leadership. You will be leading a team to be responsible for helping identify business trends and insights, building Quality strategy to support business need and partnering with cross functional teams to improve customer experience. A Regional Quality Manager will participate in business reviews, provide quality insights and are responsible for driving quality and performance improvements. You will need to be responsible in supporting and guiding QPMs to achieve business goals in customer experience and quality performance and includes building behavior based plans based on qualitative and quantitative insights. This work will be achieved through evacuating QPM engagement by attending site visits, applicable business meetings, and reviewing QPM communication outputs for our internal and external customers.", "key_qualifications": "Ability to work with and influence cross functional business partners to build and achieve strategic quality objectives and goals, Solid understanding of quality principles and approaches including but not limited to customer journey mapping, process Improvement methodologies and data analysis, Proven track record to analyze data, accurately determine root cause and implement actions that solve problems and improve performance, Adapt to changing environments, technology and processes, Drive for results with a high degree of determination, At ease with relationship building and engaging a wide variety of internal and external senior level stakeholders, Superb written and communication skills, Strict adherence to company policy on confidential materials, Experience in the management of outsourced suppliers and internal teams delivering customer-facing support, Experience working as part of a virtual team that is geographically dispersed", "preferred_qualifications": "", "education_experience": "Bachelors degree or equivalent experience", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541300"}