{"title": "WW Sales BPR Change Management Lead", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you a driver of change? Are you passionate about helping people adapt to process and system changes? Our World Wide Sales Business Process Re-engineering (BPR) group focuses on implementing strategies, programs, tools, and processes that enable the business to drive sales, improve customer experience, and innovate the way we lead and support one of the largest channel operations in the world.", "description": "In this role, you will: Collaborate with business owners, process SME’s, and other stakeholders to review the current state against proposed future state processes and systems. Lead and document change impacts by conducting impact analyses and other change management assessments. Partner with regional SME’s to review global change impacts and assess regional differences. Collaborate with regional Change teams to develop recommendations for addressing change impacts. Support global and regional process harmonization activities, as necessary. Review and update change management plans. Develop training materials that will used in instructor-led sessions or as part of self-paced offerings. Develop communication materials to ensure adoption of new ways of working and technology solutions for both internal and external stakeholders. Support and engage with senior leaders. Project manage your work stream (e.g. weekly status reports, risks and dependency management, work stream planning)", "key_qualifications": "8+ years of experience in project/program/change management and/or training content development and delivery on similar programs. Expertise in change management principles, methodologies, and tools, including process improvement and technical documentation. Experience working on enterprise-scale, multi-country digital transformation projects. Experience working on multi-release projects following the Agile methodology. Bachelor’s degree or equivalent experience", "preferred_qualifications": "Background in CRM implementations such as Salesforce is highly preferred. Change management certification (such as PROSCI) or other designation is a plus. Knowledge of B2B business processes such as account planning and management, lead, opportunity, and lifecycle management, partner collaboration, forecasting, campaign management is a plus. Passion for problem solving and overcoming business challenges in partnership with others. Excellent collaboration and relationship building skills. Outstanding communication and presentation skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners. Experience collaborating on global projects with a geographically dispersed team in a highly-matrixed, fast-paced environment. Solid track record of leading strategic programs combined with the ability to execute tactical, project-level activities, and tasks. Past experience developing communications and training materials. Resilience, tenacity, and attention to detail", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551089"}