{"title": "AIML - ML Researcher (LLM / Generative Foundation Models), MLR", "summary": "Play a part in building the next revolution of machine learning technology. We're looking for passionate researchers to work on ambitious curiosity-driven long-term research projects that will impact the future of Apple and our products. In this role, you'll have the opportunity to work on innovative foundational research in machine learning focusing on LLMs and generative foundation models. As a member of the team, you will be inspired by a diversity of challenging problems, collaborate with world-class machine learning engineers and researchers to impact the future of Apple products, and publish some of your results in high-quality scientific venues.", "description": "You have a strong research background in machine learning or related fields, and regularly publish your results in the main relevant conference and journal venues, and make sure that your research results are of high quality and reproducible. You will propose your research plan to advance our understanding of machine learning and execute it through implementation and experimentation, in collaboration with your colleagues. You will provide technical mentorship and guidance, and prepare technical reports for publication and conference talks. You will have the opportunity to collaborate with broader teams across Apple", "key_qualifications": "Demonstrated expertise in machine learning research. Publication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, AAAI, CVPR, ICCV, ECCV, ACL, EMNLP, etc). Hands-on experience working with deep learning toolkits such as Tensorflow or PyTorch. Strong mathematical skills in linear algebra and statistics. Ability to formulate a research problem, design, experiment, implement, and communicate solutions. Ability to work in a diverse collaborative environment.", "preferred_qualifications": "", "education_experience": "PhD, or equivalent practical experience, in Computer Science, or related technical field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200521140"}