{"title": "Enterprise Senior Technical Support Engineer, Network Specialist", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are seeking a highly skilled and experienced Senior Technical Support Engineer who will be responsible for handling sales escalations and critical support cases raised by enterprise and institutional customers. In this role, our team provides timely and effective resolution to our most important customers' support issues. The ideal candidate should possess an excellent conceptual understanding and working knowledge of networking technologies and protocols.", "description": "In addition to deep technical knowledge, a new team member should have good interpersonal skills with the ability to build strong relationships with our internal groups. Key responsibilities include: Work high impact and critical cases raised by enterprise and institutional customers. Work with multi-functional teams such as Apple Sales, AppleCare Engineering, Product Engineering, Product Marketing, and service groups within Apple to champion and resolve customer issues. Provide customer support through a variety of channels to understand issues and provide technical solutions to the customer. Partner with Professional Services and Customer Success teams to deliver Support Assurance to new and existing customers. Screen bugs. Handle consults from the Customer Support Engineering team. Set up complex reproductions in a lab environment. Provide mentoring, guidance, and consultation to other support teams and colleagues. Investigating, diagnosing, and resolving support cases. Up-to-date and thorough knowledge of: Commercial networking software and/or hardware products. Link-layer technologies (e.g. Ethernet, Wi-Fi, Cellular, etc.). IP protocol suite and routing (including IPv6). Wi-Fi router concepts. Networking stack implementations (e.g. BSD, Linux/Android, etc.). System level and network troubleshooting skills.", "key_qualifications": "12+ years in a senior technical escalation support role. Experience serving as the technical point of contact for critical issues from corporate, education, and government customers. Experience responding to critical customer-facing and internal executive-level issues. Good interpersonal, written and oral communication skills in stressful or ambiguous situations with an ability to communicate effectively with both technical and non-technical partners. Possess an understanding of fundamental network areas such as TCP/IP, TLS, certificate trusts and the process by which devices perform Wi-Fi association. Deep technical understanding and industry-recognized certifications in one or more of the following areas: Networking, Wi-Fi and End-point protection. Deep technical understanding in the following networking areas: Wi-Fi (802.1x), VPN (IKEv2, SSL, etc.), network extensions, or proxies. Ability to effectively participate and lead conference calls with a large mixed audience. Ability to navigate complex issues that involve several network technologies and how they may relate to one another. Familiarity with large Apple device deployments and device management. Experience with Microsoft services used by our customers using native applications running on Apple hardware is a plus. Proven track record of collaboration, facilitation, problem solving, leadership, and partnership management. Act independently to determine methods and procedures on new duties or objectives. Work on significant and unique issues where analysis of situations or data requires an evaluation of intangibles. Exercise independent judgment in methods, techniques, and evaluation criteria for obtaining results. Create formal networks involving coordination among groups. IP routing tables, networking infrastructure, firewalls, security software, preferred.", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent experience in a technical field such as computer science, engineering, or information technology.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200514150"}