{"title": "Regional Supplier Manager, Returns Logistics", "summary": "The Returns Logistics team is a highly motivated, fast-paced, dynamic organization that is responsible for Apple’s reverse logistics service operation in the Americas region. The team manages a number of 3PL (third party logistics) partners in multiple countries in the AMR region and delivers industry-leading service to our customers. Flexibility and adaptability are key attributes required for success. The Regional Supplier Manager will oversee returns processing and screening. In this role, you will collaborate with product engineering to coordinate introduction of new products and procedures. You'll estimate logistics process cost and impacts to existing process. You will review time standards, HC requirements and recommendations for tooling, equipment and process requirements for new or existing product/process lines. You'll maintain records and reporting for logistics and screening operations and monitor quality and performance attainment by OEM or 3PL partners. You will coordinate with the service center team to understand issues/impacts and recommend the best course of action. The individual must be focused on speed to process and credit, speed to disposition product, quality and accuracy.", "description": "• Oversight of supplier relationship and performance in support of Americas Logistics • Identify areas for process improvement and innovation; Investigate problems, find root causes, and develop solutions. • Responsible for Quality Controls/ Audits (incoming inspections, in-process checks, & outgoing audits). • Prioritize and multi-task effectively to provide strategic and tactical support for projects, including capital planning. • Monitor key performance indicators, drive performance, and expense management. • Evaluate existing capabilities and establish new systems and processes for tracking, measurement, reporting, and analysis of Logistics Ops. • Performs capacity planning and analysis for new and existing processes. • Collaborate with stakeholders and external vendors as a representative of logistics for equipment, tooling, and packaging sourcing.  • Manages small projects and coordinates cross-functional teams to resolve complex issues and implement change.", "key_qualifications": "15+ years of experience in world-class logistics operations with emphasis on vendor, 3PL, or service provider management. Experience in high volume logistics with an emphasis on customer focus and operational excellence required; reverse logistics environment a plus. Proven ability to lead continuous improvement projects and strong track record of customer service. Should be systems literate in one or more Warehouse Management Systems, as well as possess strong analytical and problem-solving skills. Ability to work in dynamic, cross-functional teams in a matrixed environment while demonstrating strong work ethic and a high degree of flexibility", "preferred_qualifications": "", "education_experience": "Bachelor of Science in Supply Chain, Business, Engineering, or related field required. MBA or Advanced Degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552312"}