{"title": "Computer Vision Architect", "summary": "The Video Computer Vision org within Video Engineering is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life.", "description": "The Architecture team within our organization is responsible for bringing multiple computer vision algorithm and AI/ML teams together to help drive some of the most exciting programs across multiple Apple products. We do this by enabling co-design of computer vision algorithms and systems through deep understanding of the complexities and tradeoffs. To be successful in this role, you not only have to be an excellent engineer, but also a great collaborator, comfortable communicating with a wide range of experts and leaders across many different domains. Are you ready to be apart of the next big thing at Apple?", "key_qualifications": "Experience and breadth of knowledge in multiple areas of computer vision spanning both classical methods and ML as well as deep expertise in at least one critical area. Some of these areas include: SLAM, calibration, scene understanding, gaze tracking, human representation, and activity recognition. Knowledge of perception sensing technologies including color and monochrome cameras, depth sensors and IMUs. Ability to translate ambiguous and high level product goals to feature level architectures. Ability to derive defensible end-to-end requirements at the system level and decompose them down to module/component specific requirements. Ability and desire to work in a highly multi-functional environment in the intersection between computer vision algorithms, embedded compute, mechanical engineering, electrical engineering, optical science, human factors, and vision science. BS and a minimum of 10 years relevant industry experience", "preferred_qualifications": "Ideal candidate also has knowledge and practical experience with modern SOTA techniques including vision transformers, foundation models and vision-language models. Strong leadership skills to drive large cross-functional efforts, resolve conflicts and present results to the highest levels of Apple leadership.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554699"}