{"title": "ACD Copywriter, Marketing Communications", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. In the role of Associate Creative Director (ACD) you work alongside an ACD Art Director and a team of dedicated writers to create work across all mediums for products, services and campaigns. You are passionate about Apple products and the brand and your work will influence customers worldwide.", "description": "Collaborates with ACD/Art Directors/other team members to concept ideas and co-direct teams to produce quality work. Guides up and coming writers seeking to craft meaningful and inspiring work. Writes, reviews, and empowers campaigns for the Apple brand and products. Presents work to senior creative staff, product marketing managers, and Apple executives. Works across subject areas to integrate strategies and messaging for online, retail, channel, events, advertising and new mediums of communication. Works with project managers and creative directors to ensure that schedules are accurate and realistic, and that deadlines are met. Support the CD of writing with creative oversight and direction around new product launches, ensuring work in multiple European languages maintains Apple writing standards. Review and give feedback of work in back-translation (no knowledge of other languages is required).", "key_qualifications": "", "preferred_qualifications": "Your work is grounded in original ideas, implemented with outstanding craft and meticulous attention to detail. You have produced work in multifaceted mediums of advertising, social media, conceptual campaigns, product launches, branding, photography, film and video. You are passionate about excellent writing that is thoughtful, meaningful, provocative at times, clear and inspiring. You are used to working proactively in a creative and dynamic environment. You have an eye for phenomenal writing and the ability to create a powerful story through the work.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559596"}