{"title": "3D SW Engineer - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work....", "description": "You will work with other SW and HW engineers in a fast-paced forward-looking role, shaping new product features; ultimately enhancing the visual product experience for our customers. You will have the unique opportunity to learn about different components across Apple’s product stack. Being part of our passionate team, you will work with technologies like RealityKit and ARKit, and collaborate cross-functionally to tackle highly interesting and ambitious problems in the AR/VR space.", "key_qualifications": " ", "preferred_qualifications": "Background or experience in Optics or Vision Science; Solid understanding of software engineering techniques, methodologies and practices; Attention to detail, passion and the ability to master new applications and technologies quickly; Interest and/or experience in SwiftUI and UI development; Swift, Xcode, Objective-C; Performance optimization", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556286"}