{"title": "Accessibility Engineer in Test", "summary": "The worldwide Retail & Online Stores (R&OS) team is looking for a hardworking and talented Accessibility Quality Engineer to test products and applications on macOS, iOS, and Web. You will be responsible for testing and ensuring the quality of major frameworks for an e-Commerce system that is up 24/7, as well as being an authority in accessibility covering VoiceOver, Smart Invert, Dynamic Type, full keyboard access, color/contrast, and more. The successful candidate will enjoy working in a fast-paced environment and will use the newest technology to automate solutions and deliver outcomes across all of Apple’s innovative products, including Mac, iPad, iPhone, iPod, Vision Pro, Apple TV, Apple Watch, and AirPods/Beats line of products. Apple strives to make the newest technologies accessible for blind, low-vision, hearing-impaired, and motor-impaired users. We are looking for someone with established QA experience both in manual testing and automation with a focus on accessibility testing!", "description": "Build test plan, develop manual/automated multi-functional tests, report bugs, and assess overall product quality of Online Store frameworks across Apple’s existing and new products from the standpoint of accessibility; Work with Agile team ensuring high quality delivery for each sprint and confirming to user story acceptance criteria; Provide leadership in testing, solving, and implementing accessibility features; Work closely with engineers, project managers, and x-functional teams throughout software lifecycle in delivering accessibility features across projects; Communicate detailed QA status to the team and report any issue in a timely manner. Ability to analyze crash logs, backtraces, and assist engineers by applying debugging techniques; Be able to describe accessibility issues and recommendations for resolving them to non domain engineers.", "key_qualifications": "", "preferred_qualifications": "Experience in Quality Engineering, with focus in e-commerce/web applications; Excellent knowledge and understanding of macOS and iOS VoiceOver and other accessibility features; Familiarity with accessibility features on mobile devices; Excellent communication skills, flexibility, cohesion, and clear thinking; Experience managing and integrating test automation into various points in a deployment pipeline.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557167"}