{"title": "Operations Program Manager - Product Operations", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "NPI Operations Program Managers are pivotal to the dynamic development and launch of Apple’s products. A successful NPI is a leader and facilitator; is dynamic, driven, organized and detail oriented; excels in program/ project management; communicates with ease at all levels; thrives in an ambiguous environment and is adept at facilitating actions and resolving conflicts.\n\n-  Leading Original Equipment Manufacturer (OEM) operations team in planning and executing development builds and new product ramps.\n-  Drive ramp readiness with engineering, operations and OEM teams.\n-  Plan capacity and lead factory equipment budget.\n-  Handle component readiness to ensure part availability, quality and cost.\n-  Communicate requirements and schedules to facilitate technical readiness with supply chain teams.\n-  Influence product manufacturability, testability, and supply chain responsiveness in pursuit of low cost and flexibility while stewarding quality\n-  Leading all communications, upward and downward through the organization; raising key issues and options for resolution with executive teams.", "key_qualifications": "", "preferred_qualifications": "An Engineering Degree along with an MBA from a premier institute\nApple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555010"}