{"title": "Software Development Engineer", "summary": "At Apple, novel machine learning ideas have a way of quickly becoming excellent products, services, and customer experience. Bring passion and dedication to your job and there's no telling what you could accomplish. Here is your opportunity to be part of an incredible research and engineering team building the next-generation of sophisticated algorithms for sensing technologies in iPhone, Apple Watch, iPad and more. Our team works across Apple to create innovative, high-impact features and new interaction experiences on Apple devices. We are looking for an expert software engineer who is passionate about developing innovative product features that push the boundaries of sensing, machine learning, and human-computer interaction. We are looking for candidates with expertise in embedded systems programming, edge and on-device implementations of algorithms, Frameworks, and experience in time-series data.", "description": "We are looking for smart, creative Software Engineers and Developers with expertise in embedded programming, edge and on-device implementations of algorithms, Frameworks, and image or time-series data. Solid understanding of Machine learning and signal processing tools will broaden your role and efficiency in this position. The team you will join is responsible for crafting product features for Apple's existing and future devices. IN THIS ROLE, YOU WILL: Work closely with machine learning and software engineering experts within the team. Partner with a variety of product teams across Apple. You will work cross-functionally with machine learning scientists, sensor architects and software engineers to build the next generation of sensing technologies. Implement signal and machine learning algorithms on-device that process image or time-series data measured by various sensors in different Apple products Prototype and define interactions end-to-end, in collaboration with HW, SW, and design partners Design user studies SW and leverage prototypes to define success criteria", "key_qualifications": "Experience building libraries, frameworks, testing/automation, and command-line tools. Experience building iOS and watchOS apps with basic UI/UX design. Strong grasp of Apple's development APIs (UIKit, Cocoa, etc.). Strong understanding of object-oriented design, data structures, algorithm design, complexity analysis, performance analysis, problem solving and diagnosis. Deep understanding of multi-threaded programming and synchronization. Past experience in crafting high-performance implementations of deep learning algorithms. Proficiency in Python programming. Able to communicate clearly and collaborate with cross-functional teams. Excellent problem solving and root cause analysis skills. 3+ years of software engineering experience.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience.", "additional_requirements": "Proven ability to quickly learn and modify large, existing codebases. Experience crafting high performance software and algorithms for resource constrained embedded systems. Experience with on-device machine learning, deep learning, and using sensor data to power novel use cases and applications. Experience in human computer interaction (HCI) space. Experience with signal processing, such as applying filtering to noisy signals.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552026"}