{"title": "iOS Developer, Retail Engineering", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Collaborate with cross-functional teams to understand project requirements and objectives. Design, develop, and maintain iOS applications. Implement user interfaces and features that enhance the user experience. Identify potential problems and resolve application bottlenecks. Fix application bugs before the final release. Create user documentation as needed. Participate in on-call rotation with rest of team.", "key_qualifications": "Experience with iOS/MacOS Frameworks - i.e Swift, SwiftUI, Objective-C etc. Experience with REST web services, microservices architecture and developing highly available and scalable applications/services. Solid understanding of Test Driven Development. Good understanding of networking and related protocols and the fundamentals (HTTP, DNS, TLS). Able to start on projects when requirements are not fully complete. Understanding of mobile performance optimization.", "preferred_qualifications": "Experience with any JavaScript Frameworks (Angular, React/Redux, Vue). Understanding of an additional programming language (Golang, Python). Deep understanding of multi-thread system software design & development. Experience with Containerization, Docker, and Kubernetes", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557025"}