{"title": "Cellular Systems Analysis Engineer", "summary": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product.", "description": "Apple’s Cellular Software team is seeking talented, highly motivated and disciplined engineers to work across layers on groundbreaking cellular technologies. The position involves identifying and/or developing core cellular technologies that solve everyday problems for customers using iPhone, iPad, Watch and other wireless product lines. We are passionate about keeping our users connected 24/7 wherever they go. This team takes pride in not just coming up with proven software designs but also in disrupting traditional models of the cellular ecosystem. We do whatever it takes to bring user experience to the next level. Our members enjoy the flexibility to work on all aspects of Cellular Protocol software - SIM, NAS, AS and iOS interfaces, to come up with the best possible solution for any given problem. Are you equally passionate about cellular technologies and have the dream to work on groundbreaking cellular technologies? Then we are looking for you. As part of this team you will impact iPhone user experience worldwide.", "key_qualifications": "At least 3-8 years hands on experience with in cellular system analysis / system debugging role.\nExperience in LTE / 5G NR PHY layer / RF is a strong plus. Good understanding of 3GPP/ETSI standards on L1/L2/L3 is desirable.\nGood understanding of SOC system architecture and System-On-Chip (SOC) Pre-Silicon & Post-silicon SW bring-up, SW validation.\nExperience Debugging with JTAG or lldb and analyzing coredumps.\nStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debugging.\nGood understanding of any RAT protocol layers is a plus.\nExcellent debugging skills\nThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.\nObsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.\nLaser-focused on the smallest details that are meaningful to our customers.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538645"}