{"title": "Graphics Software Content Engineer", "summary": "Do you love problem solving and creating elegant solutions to highly complex technical challenges? As part of our Silicon Engineering team, you'll help develop and manufacture our next-generation, high-performance, power-efficient graphics processors! You'll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this team means you'll be responsible for designing and building workloads that ensure Apple devices are best-in-class. Join us to help deliver the next groundbreaking product containing an Apple GPU!\nIn this highly impactful role, you will be responsible for graphics workloads used by teams involved in all stages of the GPU development lifecycle, from early feature specification through silicon bring-up and beyond. You will work with other teams at engineering sites around the globe towards the shared goal of ensuring that Apple GPUs meet the highest quality and efficiency standards. This job involves designing, developing, and maintaining workloads for GPU architectural validation and design verification.", "description": "Join the team to play a central role in developing upcoming Apple GPUs. You will have the opportunity to help develop the tools and techniques used to ensure the GPU is functional, performant, and within the expected power envelope. In this role, you will work alongside many other teams involved in GPU development, including but not limited to Architecture, Modeling, Performance, Power, Design Verification, Silicon Validation, Software, and Manufacturing. Core responsibilities of this highly collaborative role are:\n- Developing critical workloads for GPU validation (architecture, functionality, performance, power).\n- Working with the GPU hardware teams from design bring-up through post-silicon, to identify and debug architectural, logic, and silicon issues.\n- Working with the GPU software teams during production driver bring-up to rapidly identify and resolve software issues.\n- Create bit-accurate C/C++ models for hardware verification.", "key_qualifications": "", "preferred_qualifications": "Expertise and knowledge of graphics rendering algorithms\nDemonstrated knowledge of the software graphics pipeline and its application to computer graphics and / or ML.\nArchitectural validation and design verification knowledge\nKnowledge of hardware architecture and/or graphics hardware\nAbility to work well in a team and be productive under aggressive schedules\nExcellent communications skills, self-motivated and well organized", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You'll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555508"}