{"title": "Sustaining Operations Program Manager - Mac", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Sustaining Operations Program Managers are responsible for ramp readiness, product launch and continuing operations through the ‘end of production’ of a program(s). You will influence product manufacturability, testability, and supply chain responsiveness in pursuit of low cost and maximum flexibility while stewarding the superior product quality expected of Apple products. A successful OPM excels in program/ project management; communicates with ease at all levels; is adept at facilitating actions and resolving conflicts; leads through relationships and influence; and displays grace under pressure. - Lead Original Equipment Manufacturer (OEM) operations team in planning and executing new product ramps - You will drive ramp readiness with engineering, operations and OEM teams. Plan capacity and manage multi-million dollar factory equipment budget - Collaborate with Planning, and Materials teams to drive supply according to demand - Manage operations-related communications, upward and downward through the organization; advancing key issues and present options for resolution to the cross-functional executive teams - You will lead initiatives and projects that improve the Quality, Cost and Delivery of the product", "key_qualifications": "", "preferred_qualifications": "Experience leading Original Equipment Manufacturer (OEM) operations team in planning and executing new product ramps, Broad operational background, Strong program management and interpersonal skills, Knowledge of business processes and product cost drivers. Experience leading operations or related experience, Good people management skills / can drive consensus, Detail oriented/ analytical, Strong cross-functional teamwork and interpersonal skills, Able to define processes and requirements under sometimes ambiguous conditions, Uses data to drive decision-making, Prioritize and communicate/ negotiate changes to project timeline, International travel required - 25%, MBA is considered a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558787"}