{"title": "Tools and Automation, Quality Assurance, Apple Services Engineering", "summary": "The Apple Services Engineering (ASE) team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a substantial scale, meeting Apple’s high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and multi- functional, offering greater exposure to the array of opportunities here.", "description": "The Apple Services Engineering (ASE) Analytics Engineering QA team is responsible for ensuring the Quality and integrity of the data collected and reported on customer experience data. We are seeking a Software Development Engineer who is interested in ASE products, wants to make a difference to them and to Apple as a whole, improving the data quality, and learn ASE ground breaking tools and technologies. This role involves developing automated testing tools to test and validate Subscriptions data pipeline systems. You will gain a thorough understanding of Subscriptions data pipeline systems developed by engineering teams for ASE products, carry out data profiling and understand schema, data interrelationships, and data flows, generate data by invoking APIs or using testing devices, and automate the validation of generated data from back-end systems.", "key_qualifications": "Skills with SQL, Hadoop, Scala, Spark, Python, Java and related frameworks. Experience with source control technologies like Git and CI/CD tools. Document test plans, writing test case automation and working closely with other teams (engineering, project management, etc.), bug reporting and isolation. Be dynamic and prepared to test/regress a high volume of changes on a day-to-day basis. Ability to automate testing efforts. Interest in ASE products, improving ASE data, and learning ASE tools and technologies. Comfortable and adaptable in a fast-paced environment. Strong analytical, problem solving and creative thinking skills. Strong commitment to technical quality assurance as a key part of the software development cycle. Willingness to work multi-functionally with other teams.", "preferred_qualifications": "1+ yrs of Big Data technologies (e.g. Kafka, HDFS, Spark). 1+ yrs experience with Big Data query tools (e.g., Cassandra, HDFS, SparkSQL). 1+ yrs experience in Data Quality, Data Profiling, and Data Integration tools. 1+ yrs experience in building/designing/testing Data Pipelines. 1+ yrs experience in Java/Scala. Excellent software engineering skills needed. Good knowledge of data structures, streaming, and coding skills are a must. 1+ yrs of experience working with automation tools/frameworks (e.g., Spring, Selenium, JUnit/TestNG, RestAssured, Gradle, etc.). 1+ yrs experience using JDBC libraries to query databases like Oracle/HMS tables. 1+ yrs experience publishing/consuming messages to/from Kafka. 1+ yrs of experience in automating REST API testing. Good knowledge of response codes, headers/request/response structures, and payloads. If you have tested/automated REST APIs calls with Java, that will be great! 1+ years of experience configuring and maintaining CI/CD pipelines to automate the test process. 1+ years of practical knowledge working in Cloud Environments.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $195,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557121"}