{"title": "Enterprise, Major Accounts", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. We invite you to join Apple, and help us leave the world better than we found it! Apple’s Enterprise Organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people across the globe. Our sales team, is in many ways, the face of Apple to our largest customers. We are here to grow Apple’s enterprise business. We’ve engaged with customers and partnered with professionals in enterprise, around the world, to change the way people work. In our team, we inspire customers, collaborate with the global partner and regional sales, regional partners, channel marketing and systems engineering teams, both inside and outside Apple, to build and execute sales plans, covering industries and other end-customer focus areas. Areas of work include new Business Development, Partner Management, and Enterprise Sales Programs.", "description": "-  We provide leadership in building engagement strategies and plans for Apple’s Major Accounts in our territories. We ensure these account plans are developed and maintained, crossing multiple customers and industries in conjunction with our strategic partners and resellers. -  We operationalize account plans with field AE’s and technical teams by mobilizing resources focused on growth and delivery. We own the delivery of sales results for the Region, including forecasting accuracy, pipeline and opportunity management. -  We orchestrate effective customer engagements, alongside strategic partners, resellers, and mobility partners. We follow through to ensure all commitments are met and problems resolved. -  We work closely with our strategic partner’s leadership to build and execute business development plans that capture the hearts and minds of the partner’s sales force. We enable their success by providing programs, training, and tools to grow their Apple Practice. We ensure these plans are embedded into our Apple Major Accounts, Industry teams’ and channel partner’s plans. -  We implement Apple’s Enterprise Worldwide go-to-market plans for our assigned territory. We coordinate the funding and prioritization of partnership activities in market and lead regional demand generation plans. We consolidate and share feedback in order to assess and communicate the strength and efficiency of the partnership. -  Through the partnership, we identify new business transformation opportunities and support these deals through to closure. We facilitate sales activity, share status and progress to the partner, customer and Apple sales teams — mobilizing resources for growth and delivery.", "key_qualifications": "", "preferred_qualifications": "Fluency in  English, 8-12 years of experience in Enterprise sales organizations.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558139"}