{"title": "Managing Producer, Interactive", "summary": "The role you’re looking at is part of the Marketing Communications (Marcom) group at Apple. Our team works to ensure that the company’s strategic products are conveyed in the most compelling way to a wide array of audiences in multiple markets and languages across Europe. We develop and create the world’s best marketing communications in support of our amazing products. We're not engineers here at Marcom, but we share the same goal - to make everything we touch beautiful and elegantly simple. The Interactive team is recruiting a Managing Producer who will oversee Apple owned customer-facing digital platforms across 42 European and African markets. This person will lead a group of Interactive Producers and external agency teams to develop and deliver digital marketing communications primarily across apple.com and product related EU consumer emails. Marketing initiatives span from high-profile product launches, EU originated creative campaigns, digital platform initiatives for local and global markets, as well as day to day content updates and localisation maintenance. At present, Apple’s digital marketing technical platform is transitioning to Adobe Experience Manager. Therefore, extensive and hands on experience managing and developing for large scale, high volume, multi language corporate digital platforms using enterprise level content management systems is critical. Additionally, you have a proven track record of evolving CMS based digital platforms to support continuous digital technical and creative innovation, as well as outstanding digital customer experiences. As a key member of a cross-functional team, you will work closely with the Head of Digital, Brand, Creative and Data Sciences, among other functional teams, to identify and execute local EU digital strategies leveraging performance and business insights. Attention to detail and executional creative excellence is key to meet exacting Apple marketing standards. As part of our team you will be supported by inspirational peers and colleagues from around the world, as you contribute to our continued success. If you’re looking for a place to do the best work of your life, this is it. Join us. We can’t wait to see what you will do!", "description": "Support the Interactive team through enterprise CMS platform change management: Determine local organisational and workflow needs; identifying structural, talent and external agency impacts. Drive successful execution of platform rollout to not only enable production scalability and efficiencies, but also set up capabilities to develop local marketing initiatives and cross leverage marketing content across internal and external digital platforms. Partner with Head of Digital to develop and execute on digital evolution roadmaps. Drive digital optimisation opportunities based upon cross channel data and insights to meet local business opportunities across owned and partner digital channels. Support EU originated and creatively developed marketing campaigns and communication platforms from strategy to execution. Oversee a team of Interactive Producers running localisation of 42 apple.com (http://apple.com) websites and customer facing product marketing emails. Team talent development, performance management, resource allocation and training.", "key_qualifications": "Extensive experience with enterprise level content management platforms and associated organisational structure, processes and change management.  Adobe Experience Manager expertise a plus. Experience in digital marketing and direct management of enterprise level, multi language/locale corporate owned digital channels.Proven track record of strong creative and technical development team partnerships to drive innovative creative ideas and executions, ensuring a best in class digital customer experience. Deep experience with digital data analytics reporting and can expertly use data driven insights to improve and optimise digital communications. Experience with high volume, multi language localisation of digital marketing assets under tight timelines.  Able to evolve and optimise production workflows. Demonstrated track record of leadership at a project delivery level; strong team playing abilities with ability to communicate high-level concepts and overall business direction. Outstanding attention to detail and creative excellence. Previous direct report employee management experience. Strong inclusive leadership skills and the ability to develop talent and lead a culture of collaboration.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548239"}