{"title": "Sr Network Engineer, Infrastructure Services", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Come join the Network Team that supports Apple’s Global Backbone! We're a team of seasoned professionals that provide network design and deployment services for Apple’s backbone support all of it’s business units.. We are growing and building the fastest and most reliable backbone network that’s needed for Apple’s scale and unique needs. The Senior Network Design and Implementation Engineer will be working in a dynamic and fast-paced work environment while developing, implementing, and supporting a complex backbone that spans the Globe. The position requires deep knowledge of backbone network operations and engineering.", "description": "Apple is looking for a Senior Network Design and Implementation Engineer to join their Global Network Services (GNS) team. The ideal candidate to fill the Senior Network Engineering position will work in a dynamic team environment and be responsible for designing and implementing infrastructure in the Backbone and Internet Edge that includes BGP, MPLS, ISIS, and OSPF in supporting both our internal and external customers. This engineer will be developing, implementing, and supporting complex networking solutions to address a variety of business challenges. The position is responsible designing, testing, and implementing solutions, as well as validating hardware functional conformance and software bug identification. The ideal candidate will collaborate with vendor on bug fixes and new features along with collaboration with peers in Engineering and Architecture for implementing and evaluating new technologies and hardware vendors for Apple's network design requirements. They will need to excel in a fast-paced and dynamic environment with the ability to multi-task and provide not only operational support but work closely with peers in Engineering and Architecture for implementing new technologies. This person must be a collaborative team player that will work across cross-functional groups and have the ability and willingness to mentor others and have a sound business approach for supporting our global footprint. This person will need to obsess over the customer experience and drive operational excellence in their everyday work. Besides a strong technical role, this position also requires strong people skills and an individual who enjoys the dynamic nature of Apple’s environment.", "key_qualifications": "6 to 8 years experience with Service Provider network design and support\nExperience in operating a large scale network utilizing BGP, RSVP, MPLS, ISIS and/or OSPF\nSolid understanding of TCP/IP (both IPv4/IPv6)\nExperience and knowledge of Internet Routing Policies and Internet Peering\nExperience with Network Flow Analysis tools a plus\nExtensive knowledge of at least one vendor CLI of JUNOS, SROS, EOS or IOS/XRS are required\nAbility to script using Ansible, Python, or equivalent", "preferred_qualifications": "", "education_experience": "College degree (BA or BS) or relevant experience\nTechnical degree preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549611"}