{"title": "Camera Firmware Engineer - ISP", "summary": "Apple is world-class for its dedication to innovation and excellence. As part of our video engineering group, you will be at the forefront of developing sophisticated imaging and video processing technologies for our camera embedded systems. We are looking for individuals who share our passion for pushing the boundaries of what's possible.", "description": "We are seeking a highly skilled and experienced embedded software engineer to join our dynamic team. In this role, you will be instrumental in developing powerful camera technology, including advanced image signal processing (ISP) and machine learning algorithms, for Apple products. You will also diagnose and optimize the performance of our embedded systems and improve our camera processing pipeline architecture.\n\nJob responsibilities:\n\n1. Develop pioneering camera technology for Apple products, focusing on advanced ISP and machine learning techniques.\n2. Implement and optimize machine learning algorithms for image and video enhancement and analysis.\n3. Design and develop robust ISP pipelines for high-performance camera systems.\n4. Diagnose and troubleshoot performance issues in embedded systems.\n5. Optimize system performance to improve efficiency and reliability.\n6. Collaborate with multi-functional teams to deliver high-quality software solutions.", "key_qualifications": "Proficiency in C/C++, Strong expertise in multi-threading programming within an RTOS environment, Profound knowledge and experience with ARM-based SoCs, Extensive experience in image and video signal processing, including ISP and machine learning algorithms, Consistent track record of system performance optimization, Excellent problem-solving skills and attention to detail, Experience with Apple development tools and environments is a plus, Prior work in camera systems or related fields is a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529513"}