{"title": "Functional Integration Engineer (Middleware)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish.", "description": "Apple eBusiness Services team is seeking an outstanding B2B Integration Software Engineer to implement innovative and scalable integration solutions. This is an excellent opportunity for a self-motivated, enthusiastic, result-oriented person to provide solutions using various integration technology stacks. If you want to be a part of this amazing team, this position is for you. Dynamic, hard-working people and inspiring, innovative technologies are the norms here.", "key_qualifications": "empty string", "preferred_qualifications": "Hands on experience in working with industry standards like EDI X12, XML, JSON and API’s. Experience in handling sensitive customer data like PII, SSN and other sensitive PCI and SOX data. Deep understanding of different partner types in the Supply chain domain and their business processes. Proven ability to manage projects with on-time delivery. Demonstrated capability to look beyond the curve and add value to business teams. Familiarity and implementation knowledge of cloud technologies. Insight & creativity to see around corners and to design systems in order to mitigate future risk. AI / ML implementation experience is a plus. Strong collaboration, communication, interpersonal, and organizational skills. Influence others to get things done. Self-motivate, learn quickly and deliver results with minimal supervision. Handle ambiguity and solve problems despite uncertainties. Ability to lead large projects focusing on innovation, teamwork, and results.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558161"}