{"title": "Cloud Platform Engineer, Ai & Data Platforms", "summary": "Imagine what you could do here. At Apple, we believe new insights have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Developer experience platform team is looking for an extraordinary Cloud engineer to join our team. You will help design, implement Kubernetes based application platform to streamline building and deploying enterprise applications on Cloud.", "description": "This is a highly technical, hands-on role that requires a wide and deep experience in managing infrastructure and applications across data centers and cloud services. You will design and implement new capabilities and tools for Kubernetes as part of a horizontal developer experience platform team. This position requires practical knowledge of Kubernetes, building tools to generate Infrastructure as Code, CICD and Observability tools integration. Building and managing relationships with diverse sets of customers who use the platform will be equally critical to ensure collective success. You will be joining a team of highly-skilled, enthusiastic, and passionate engineers working on this leading edge and constantly evolving space.", "key_qualifications": "8+ years of Cloud Native Engineering Experience, Strong Kubernetes knowledge and experience writing operators, Proficient with various programming languages such as Go or Java and API patterns using REST/gRPC, Experience with developer tooling and containerization, Writing Infrastructure as code, and GitOps model for deployment across multiple cloud providers, Experience building cloud native applications, API gateways and Service Mesh architecture patterns (example: Istio ), Developing, configuring or operating end to end CICD tools", "preferred_qualifications": "Building Enterprise grade java applications and deploying on cloud, BS in Computer Science or relevant proven experience is preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553994"}