{"title": "Global Supply Manager - Mechanical Enclosures", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Manage the overall operational aspects of running iPhone Enclosures manufacturing operations, on-ground at Apple CM partner factories in India. Drive the operational performance at CMs required to meet Apple needs. Help develop production schedules, and plan demand/supply. Work with Apple CMs and Apple cross-functional teams to drive adherence to ramp and production schedules, identify risks, help develop mitigation plans. Manage and support commercial engagement with CMs, including capital costs and part pricing. Identify and help CMs implement operational improvements...", "key_qualifications": "", "preferred_qualifications": "Excellent communicators, capable of working with global teams. Ability to influence across multiple functional teams. Top-notch analytical/negotiation skills. Ability to toggle between strategic and detail orientated thinking. Tenacious problem solving & issue resolution skills. Driven and motivated by accomplishing extraordinary objectives. Flexibility to adapt to dynamic and rapidly changing environments. Experience working with OEMs and Contract Manufacturers in the Consumer Electronics Industry is a plus. Apple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556621"}