{"title": "Engineering Manager", "summary": "Apple is looking for an experienced Software Engineering Manager to help develop Apple’s Private Cloud Compute. Apple Private Cloud Compute sets a new frontier for AI privacy in the cloud. Come and join us in this journey.", "description": "You will work and contribute towards the engineering of Apple Private Cloud Compute Platform. You have a proven background on network protocols, security, understands client-server architectures and distributed systems. You will build the server stacks for private configuration, authentication, authorization and request processing. You will design system architectures, specify custom network protocols, and implement high performance code. You will develop scalability strategies for applications that support hundreds of millions of users. You will work with world-class teams in Cupertino, Seattle, and London who have a real passion for engineering and delivering features that maintain strong privacy guarantees to end users. Because we are a small team with high visibility, the opportunities for you to make an impact are boundless. If you are a person that can seize these opportunities and run with them, you will enjoy working here. You should be deeply motivated, driven, and should feel a personal stake in the services we are responsible for. You have the ability to juggle multiple priorities and handle uncertainty. You should have excellent communication skills and the ability to build positive relationships with the people you work with. You should be prepared to deliver high quality results, and your success will be measured by the quality, size and timeliness of your work you're doing. We're looking for a dedicated and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you!", "key_qualifications": "Experience with designing, implementing and operating large scale distributed systems and networking protocols Experience with designs that are secure and private first Resourceful excellent analytical and problem solving skills Collaborative: the ability to thrive in a multi-functional organization through communication and delivery Curious the desire and aptitude to independently learn Self-directed: the ability to drive a project from a simple idea to production User-focused: the user experience and the privacy of data come first Strong software engineering skills and can act as an arbitrator for tough technical debates You care about helping others grow in their careers at Apple Experience with hiring and leading engineers 3+ years professional experience in an engineering leadership position", "preferred_qualifications": "Languages: Java, Swift Technology: Cassandra, FoundationDB, Redis Knowledge: Networking Protocols, Security, Privacy, Cryptography (TLS, cryptographic chain of trust, data encryption at rest, Key Transparency, end to end encryption)", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560274"}