{"title": "AIML - Sr Engineering Program Manager, On-Device ML", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "We’re looking for a strong Engineering Program Manager with a proven record of building and maintaining complex software platforms, tools, and processes that deliver new end-to-end experiences on-device. You will partner with teams across Apple and deliver some of the most ambitious capabilities for executing machine-learned features on Apple hardware.\n\nIf you are the type of person that feels a personal stake in everything that you work on, have a strong sense of ownership, thrive in fast-paced environments with lots of ambiguity, enjoy working with complex technologies, know how to foster strong relationships, build trust, and work for the success for the entire team, then you will be a strong match for our team.\n\nWe look forward to meeting you!", "key_qualifications": "5+ years in a role leading cross-functional teams in product/project/program development, Proven track record of delivering large-scale engineering products or platforms involving machine learning, data processing, and data analytics tools at Internet scale, including experience with ML training (e.g. train/test, evaluation, measurement), data processing pipelines, large-scale and high-throughput backend services, and/or user-facing applications that use those services and deliver measurable business or product value.", "preferred_qualifications": "Prior PM or engineering experience in Machine Learning training or inference technologies, Experience using objectives and key results to drive product outcomes, Experience building technical communities across organizational boundaries.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558479"}