{"title": "AIML - Linguistic Annotation Project Lead, Siri Information and Intelligence", "summary": "Play a part in the ongoing revolution in human-computer interaction! Give to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, spoken language, big data, natural language processing, and artificial intelligence. And work with the people who built the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team at Apple.", "description": "Siri’s Natural Language Understanding is powered by high quality, detailed linguistic annotations. The NL Annotation Project Lead is instrumental in coordinating annotation projects with human annotators and stakeholder data scientists & machine learning engineers.\n\nRESPONSIBILITIES INCLUDE:\n- Reviewing and advising the development of annotation project strategies, interfaces, and guidelines\n- Relaying and interpreting project guidelines and instructions for annotators\n- Serving as an interface for feedback and questions from annotators back to data scientists\n- Prioritizing and scheduling projects to align with organizational goals and timelines\n- Coordinating with vendors to establish long-term partnerships and ensure proper & accurate invoicing\n- Monitoring and managing individual annotator performance metrics (accuracy, throughput), providing feedback and guidance for improvement.", "key_qualifications": "Strong understanding of English language linguistics, syntax, and grammar; and applications to Natural Language Processing\nExperience developing, implementing, and communicating a complex ontology or taxonomy system\nProficient computer (MacOS) skills; experience with general office software\nExcellent communication and documentation skills; ability to interact with all levels of engineers, in-house annotators, and remote/crowd workers\nExcellent project management skills; able to collaborate with stakeholders to prioritize competing projects and set, and maintain, a schedule for milestone and project completions\nExtensive prior experience in linguistic annotation; tasks may have included named entity recognition, part of speech tagging, constituency parsing, dependency parsing, or application-specific natural language parsing", "preferred_qualifications": "Bachelor’s or Master’s in Linguistics or similar field, 2+ years experience as linguistic annotator.\nExperience as linguistic annotation project/team coordinator preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $117,832 and $205,500 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553885"}