{"title": "Cellular Modem Software Architect", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join the Wireless Technologies and Ecosystems (WTE) team and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We are looking for a highly disciplined and self-motivated engineer who can succeed in a high-paced environment. The people who work here have reinvented and defined entire industries with our products and services. You will be part of a highly energetic team that has delivered amazing wireless products to improve users’ seamless experience in across all Apple’s products.", "description": "As a Cellular Software Architect, you will drive and coordinate the software architecture and design for 5G and future cellular systems with tight timeline, latency, and energy constraints. In that role you will drive the software validation strategy and architecture for pre-silicon validation platforms. You will collaborate cross-functionally with research and development teams in proposing, planning, and implementing prototypes for compelling cellular features! A deep understanding of wireless systems, network architectures, and user applications and services is required. Experience with building prototypes, and cooperating with internal and external partners is helpful.", "key_qualifications": "Familiarity with 3GPP specifications, 3GPP contribution processes to be able to evaluate changes and make recommendations for SW to make our wireless product user experience even better. Demonstrated experience in several of the following areas related to wireless systems: setting and refining software requirements to build solutions for prototype design, sub-component design, and validation; understanding product and application layer architectures in conjunction with deep hands-on knowledge of cellular software. Deep technical expertise in at least one or more of the following areas: 5G NR modem software architecture & design; 3GPP standards; cellular and wireless product design and prototyping; performance optimization in cellular devices; partitioning systems between SW, HW & FW; Prior hands on experience with building sophisticated cellular software solutions and ability to influence right partitioning between HW, SW, FW will be essential for this role. Excellent communication and leadership skills, ability to work with cross-functional teams including: standards, systems engineering, hardware, software, and firmware. Experience in leading multi-disciplinary engineering teams by technical expertise.", "preferred_qualifications": "", "education_experience": "Bachelor or Master degree in Electrical Engineering, Computer Engineering, or equivalent degree", "additional_requirements": "#SWopportunities #WTE #SWICopportunities #SWSDopportunities #SWSDICopportunities", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $239,700 and $360,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543220"}