{"title": "Cloud Solutions Engineer", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join Apple, and help us leave the world better than we found it. The ISDS Cloud Enablement team works in a multifaceted approach to discover, design, transform, and optimise Cloud adoption of various Datastore Technologies. As a Cloud Solutions Engineer, you will be important in crafting, implementing, and optimising cloud-based infrastructure and continuous integration/continuous deployment (CI/CD) pipelines on the AWS, GCP and other Cloud platforms. You should have extensive experience in developing automation solutions in an Agile environment with an awareness of DevOps methodologies. You should also possess the ability and approach to drive rapid prototyping and piloting of Cloud solutions. This position demands the most promising software engineers! If you are passionate about designing and implementing innovative automation solutions on Cloud based datastores, we encourage you to apply.", "description": "Are you looking to build innovative automation tools and software that enables us to deploy, maintain, monitor and scale fast-paced, sophisticated distributed Cloud environments and services? Would you like to work in a dynamic environment where your technical abilities will be challenged on a day to day basis? Do you want to build tangible business impact and make a difference in the lives of millions of people who use Apple's products and services? If so, Apple's IS Data Services Cloud Enablement Team is looking for a highly motivated, meticulous, energetic individual with excellent written and verbal communication skills who are not afraid to think creatively and question assumptions. In this role, you will be part of a cohesive team with many exciting responsibilities related to Cloud Automation, including: - Developing and performing a comprehensive cloud strategy that aligns with the organisation's goals and objectives - Designing scalable and cost-effective cloud architectures, considering high availability, security, and performance - Continuously optimising Cloud resources to improve cost-efficiency while maintaining performance and reliability - Serving as a significant contributor to the development of engineering and design standards and assist in the ongoing support of infrastructure and Cloud - Managing sophisticated interactions between business processes and technologies and translating specifications into production systems - As a solution architect, using your FinOps knowledge, real-world experience, and capabilities to craft, sell, and deliver tailored solutions to optimise cloud spend, build governance guardrails, and adopt a culture of shared responsibility - Providing technical mentorship and support to teams for efficiently utilising GCP & AWS DevOps tools and services", "key_qualifications": "8+ years of hands on experience in dealing with Relational and NoSQL databases, on premises and on Cloud platforms, Evaluate, design, implement and manage Cloud infrastructure along with addressing the organisation's internal and external availability and security requirements, in collaboration with datastore leads, Build self-service playbooks for a platform that can be consumed across globally distributed teams at Apple, Develop standard methodologies for using data services in the Cloud, including SQL, NoSQL, Data Lakes and Blob Storage, Strong understanding of CI/CD principles and experience with tools like Jenkins, GitLab CI/CD or CircleCI, Proficiency in infrastructure-as-code tools such as Terraform, Ansible or Deployment Manager and use them to automate infrastructure provisioning and configuration management, Experience with Cost Optimisation tools like Cost Explorer, CloudHealth, Cloudability, CloudCheckr, Flexera One or Spot Cloud Analyzer, Solid understanding of virtual machines, containers and Kubernetes platform, Experience in working with multi-functional teams (DevOps, Operations, Product Managers) in an Agile environment, Strong knowledge of Linux, Systems/Application Design & Architecture, Experience in handling architectural and design considerations such as performance, scalability, reusability and flexibility issues", "preferred_qualifications": "Experience in migrating databases to and within Cloud platforms is a must have", "education_experience": "B.Tech Computer Science or equivalent Educational background in Computer Science, Software Engineering, Algorithms, Operating Systems, Networking, etc.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550457"}