{"title": "AIML - Language Engineer (Brazilian Portuguese)", "summary": "The AIML Siri and Information Intelligence team creates groundbreaking user experiences in over 40 languages and dialects using machine learning, natural language processing and modern software development. As part of this group, you will work with one of the most exciting environments, privacy preserving ML and software technologies. You will have an opportunity to imagine and build products and features that delight our customers every day, worldwide.", "description": "We are responsible for the end to end user experiences of Global Siri. As a Language Engineer for Siri in Brazilian Portuguese your focus will span across all components of our products, through data-driven analysis you will identify target areas and build up the technical understanding to create meaningful contributions. You will partner with core component teams to design and structure innovations for global markets that process millions of requests a day. You will implement them iterating on a solution both independently as well as in a collaborative environment . You will share your expertise and mentor others, while continuously learning from colleagues. Excellent communication skills will be required to convey ideas clearly and coordinate work across multiple teams.", "key_qualifications": "", "preferred_qualifications": "Native speaker fluency in Brazilian Portuguese and awareness of Brazilian culture, Proficiency in more than one programming language, such as Java, python, Swift, Objective-C, C++ or Go (experience on Apple platforms preferred), Strong skills in object-oriented software design and programming, Knowledge of Text Processing and NLP techniques, Familiarity with Machine Learning methods for classification, regression, or ranking problems", "education_experience": "M.S. in Computer Science or related field, or equivalent experience with 3+ years of relevant industry experience, Ability to analyze data and make data-driven decisions to improve user experience for Brazilian market", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555734"}