{"title": "Engineering Project Manager - WWBPR Insight", "summary": "The BPR Insight team is looking for a dedicated Engineering Project Manager to oversee a diverse portfolio of manufacturing software products. In this role, you will contribute to Apple’s manufacturing strategy by leading and executing complex and innovative software projects.", "description": "Collaborate with engineers, dev ops, production support, UX designers, and data scientists to deliver strategic products & features by defining technical solutions, determining technical feasibility, defining high-level LOEs, and proposing project release plans. Engage with stakeholders, business users, and product managers to understand the business case to define release requirements, translate business requirements into technical requirements, and define project scope... (Truncated)", "key_qualifications": "Proven experience as an Engineering Project / Program Manager or Engineering Manager, with an emphasis on high-quality software. Strong understanding of Agile methodologies and project management tools. Understanding of cloud computing concepts, data-focused ecosystems, technical platforms, and the engineering cycle. Able to evaluate and refine engineering project proposals. Bachelor's degree in computer software, software engineering, management information, or other computer-related field or equivalent experience.", "preferred_qualifications": "Strong analytical and problem-solving abilities. Comfortable analyzing data for insights and presenting findings to varying audiences. Ability to build trust and collaborate effectively with diverse teams. Exceptional communication and interpersonal skills. Demonstrated accountability and a track record of delivering successful projects. Experience in enterprise architecture and solution design. Relevant project management certifications. Familiarity with manufacturing and supply chain concepts (e.g. yield, process design, quality analysis). Able to evaluate and refine engineering project proposals. Master’s degree in computer software, software engineering, management information, or other computer-related field is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553482"}