{"title": "Finance Operations Analyst, Purchase to Pay", "summary": "Do your life’s best work here now. With the whole world watching. Join the Apple Finance organization and make a positive impact on a company that is known for its impressive lineup of products and services. At Apple, we share in a commitment to excellence, all with one unified vision – creating innovative products that delight customers. Finance is about “fueling innovation”. We do this by hiring quality individuals with integrity, accountability, partnership, excellence and analytical thinking. Apple’s Global Business Solutions (GBS) team partners across functions, including Retail, Sales, Operations, R&D and Services. In addition to driving operational excellence in core finance processes, GBS provides cross-functional insights to enhance compliance, operational efficiency and business performance. As a support organization, our mission is to find opportunities and influence outcomes for our business partners on a daily basis, while anticipating and managing risk. If you have a passion for learning and growth, solid operations experience, with the right balance of problem solving and critical thinking, this evolving, dynamic team could be for you. We are now seeking a Finance Operations Analyst to join the global Purchase-to-Pay (P2P) team, based in Bangalore. This role will support the Americas (AMR) business across the US, Canada and ALAC countries. You will be part of an integrated global team with teammates based in Austin, Cork, Shanghai and Singapore.", "description": "You will be responsible for operating and improving efficient, effective, compliant processes to support Apple’s business. Over time you may have the opportunity to work on analytics and process improvement initiatives in addition to daily operations. Your focus will be on operating and improving the vendor payables experience across AMR, while working with EMEIA, GC and APAC teams to standardize global processes. This is a dynamic role with plenty of room for growth and evolving job responsibilities, including the following: -  Thoroughly review and resolve invoice posting exceptions in SAP, ensuring they are routed to the appropriate authorized requester team for resolution. -  Understand and adhere to specific billing requirements and posting controls for each country to optimize invoice receipt processes. -  Take ownership of assigned work lists, prioritizing and resolving items promptly based on aging and priority (discounts) while knowing when to escalate issues as needed. -  Maintain high standards of accuracy and compliance with internal policies and procedures. -  Communicate effectively with internal stakeholders to facilitate timely issue resolution. -  Drive operational excellence by meeting or exceeding SLA metrics -  Proactively identify opportunities to simplify end-to-end processes and drive efficiency, while maintaining strong compliance and controls -  Collaborate with global and regional peers to ensure that processes, tools and business solutions are globally consistent whenever possible", "key_qualifications": "", "preferred_qualifications": "-  Understanding of (or willingness to learn) core finance processes with the courage to challenge the status-quo and help teams solve problems, influence stakeholders and drive results in line with Apple culture\n-  Extraordinary attention to detail, accuracy, quality and integrity in all work with sound judgment and decision-making skills\n-  Curiosity to “go beyond the numbers” and convert datasets into business insights that influence meaningful actions and results on a regional and global scale, including process improvements and business solutions\n-  Strong communicator who can build cross-functional partnerships, maintain a high degree of flexibility and drive collaboration to influence outcomes\n-  Exceptional time management and interpersonal skills with the ability to work independently to achieve demanding deadlines\n-  Mature, responsible professional who can focus on key issues, simplify and cut through complexity to facilitate debate on key issues with the team\n-  Growth mindset, fast learner, passionate about talent development and helping others", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559398"}