{"title": "Senior Software Engineer - Security", "summary": "The Apple Services Engineering Security team builds and provides secure systems and infrastructure that fuel Apple’s services. As part of the ASE Security team, you will help manage the security needs of Apple’s services around the world.", "description": "This a highly collaborative role where you will be working with infrastructure and platform teams to build and integrate security frameworks, tools, and controls. You will be accountable to produce quality software that meet service level objectives. Your everyday activities will include designing code, testing, estimate, fix, and deploy security services and features. You will also participate in code and security reviews to help your peers to meet high standards for infrastructure at Apple. You will do research, prototyping and present ideas and designs to your team, management, and internal customers.", "key_qualifications": "", "preferred_qualifications": "Ability to work in a collaborative, team environment, listen, provide empathy, and raise the best in your peers. Bachelors degree in Computer Science or equivalent work experience in a related field.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555922"}