{"title": "Cellular Platform Software Engineer- CoreBSP Enablement Team", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norms here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team transforming wireless technology? Join us to help deliver the next groundbreaking Apple product! Wireless Technologies and Ecosystems (WTE) team is looking for a highly motivated and strong technical lead to work on our next-generation products. The duties of this position will manage a team to design, develop, debug baseband platform software, and work with HW & SW multi-functional teams to deliver the features into next-generation products. CoreBSP Enablement team mainly responsible for CoreBSP SW enablement and handling of CoreBSP system-level issues that can bridge the gap between HW & SW Teams. This group deals with common HW & SW platform infra enablement for Pre-silicon and Post-Silicon SW enablement across all platforms and unblocking SW teams.", "description": "As part of the CoreBSP enablement team, the candidate will be responsible for CoreBSP components bringup (Hardware Dependent SW components that include Boot, CoreDrivers, Memory & OS components). You will work with multi-functional teams throughout the product development cycle from collecting CoreBSP SW requirements, testing, debug, and enabling/testing Platform SW flows both in Pre-Si and Post-Si environment. In addition, you will collaborate with HW & SW teams across Apple to define and collect the Platform SW requirements and solutions for cellular products. The ideal candidate should exhibit problem-solving skills with appropriate attention to detail, strong interpersonal, written and verbal communication skills and the ability to work in a dynamic and team-oriented environment.", "key_qualifications": " ", "preferred_qualifications": "Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent. Embedded software development of low-level hardware drivers in Assembly/C/C++ Debug experience using Emulators both on Pre-Si & Post-Si platforms Defining, Reviewing, and generating SW System Level Test content Experience in using Logic Analyzers, Oscilloscopes, and Protocol analyzers", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555358"}