{"title": "AIML - Engineering Manager, Device Infra Cloud Engineering", "summary": "If you're passionate about building technology that will make a difference, we may have the job for you. The position requires an outstanding Engineering Manager with a solid track record of driving highly cross-functional projects dependent on innovative infrastructure and operations. This role is critical in driving quality improvement for products impacting over 1 billion customers and is crucial to crafting the highest-quality user experience that Apple customers expect and love.", "description": "This role enables you to build your knowledge of the entire fleet of Apple devices, including iPhones, Macs, AppleTVs, and Apple Watches, with a particular emphasis on Siri. You will have the opportunity to make a big impact on both internal Apple engineers and the billions of users who use our products. You will prepare devices and systems for testing (setup, software installation, testing, debugging, repairing systems). Manage inventory of test equipment and track the location of items. You will have a strong teamwork ethic as we engage with many teams, including everything from network to engineering. You will resolve issues in our current tool for automated device management and implement new features. You will help to run, maintain, and organize lab workspaces and interact with prototypes and components, including supporting test setups, debug sessions, etc., and you will be constantly moving lab support systems forward by iterating the current processes to make them more efficient. You will use ARD, SSH, Telnet, and other CLI to deploy, maintain, and debug remote machines and devices. This role may require lifting, moving, and carrying equipment up to 20 pounds.", "key_qualifications": "", "preferred_qualifications": "Experience with device deployment and management of macOS & iOS\nExperience triaging issues and fixing both Apple software and hardware\nPreferred 5+ years of experience in administering macOS & iOS\nA positive and respectful attitude\nA passion for providing reliable services at scale\nSuperb collaboration skills with excellent written and verbal communication\nThe ability to understand troubleshooting methodology for large-scale systems and intricate systems\nDeep understanding of web services, how they operate, and what needs monitoring and alerts", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556910"}