{"title": "AIML - Software Engineer, Machine Learning Platform (MLPT)", "summary": "Want to build the platform that enables the next generation of intelligent experiences on Apple products & services? As a software engineer on the Machine Learning Platform team, you will be responsible for designing and building critical services that support Apple Intelligence, machine learning and computer vision efforts across the company. Specifically in this role you will be working on platforms responsible for orchestrating and managing distributed machine learning workloads on Apple Hardware. This is a highly collaborative role and you will be working with key partners across the company. Within our team, we have a diverse software and infrastructure stack with many opportunities to learn and grow your skills with current technologies.", "description": "As a software engineer on the MLPT Compute Platform team you have the following responsibilities: Own the architecture, design, development, and operations of systems designed for running machine learning workloads across all of Apple’s platforms and devices. These may include, but not limited to data management systems, engineering workflow systems, distributed compute systems and user-facing UIs and APIs. Partner with various teams and machine learning engineers across different Apple organizations to define high impact product features and deliver them with quality. In this role you will be working on core infrastructure that teams across the company leverage to deliver ML powered products and features. Lead a group of engineers to deliver high quality products/services. Be able to stay on top of state-of-the-art technologies and apply them in the job. During the process, support junior engineers by providing advice, coaching and educational opportunities.", "key_qualifications": "", "preferred_qualifications": "Experience using system monitoring tools and automated testing frameworks, Experience delivering distributed systems and services in a production setting, Experience with Kubernetes and cloud infrastructure, Experience with Machine Learning and ML lifecycle / deployment, Master or PhD in Computer Science or equivalent industry work experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558567"}