{"title": "AIML - Sr Engineering Program Manager, Siri Perception", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about powering many ground-breaking intelligent experiences to be made? The Siri Assistant team is building groundbreaking technology... and we are looking for people like you!", "description": "This role is for a problem solver who is excited by defining and driving an impeccable user experience. You will coordinate and drive early engagements on product architecture, feature definition and program execution. This includes collaborating with all partner organizations relevant for a project. You will:", "key_qualifications": "N/A", "preferred_qualifications": "Experience working with voice assistant technology\nExperience shipping ML powered end user products", "education_experience": "Bachelors or Master’s degree in Computer Science or related field", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552822"}