{"title": "Hardware Validation Engineer - Mac", "summary": "Do you want to help build the next Mac System? Our team is looking for individuals with real passion for shipping outstanding products. The hardware validation team is part of the system hardware development organization responsible for bringing new and exciting Mac hardware products to the users. Through innovation and dedication, team members work collaboratively and strive to deliver the best product that Apple is known for. We are looking to hire a System Hardware Validation Engineer. Primary job focus is in testing, identifying, and resolving system-level hardware design issues. You will be working with the latest hardware and software. Testing activities will also involve working closely with multi-functional system hardware, silicon, and software design teams. The candidate will be responsible for validation testing of system hardware designs that strive to deliver the best in-class hardware experience for customers. This position is for someone who is hard-working in hands-on test execution and getting involved in new hardware/software testing and debugging.", "description": "-  Working with test framework and tools to create a controlled validation environment to support large scale validation\n-  Generating test cases and implement test on hardware configurations based on coverage analysis\n-  Setting up and maintaining physical test environment and used in validation testing.\n-  Debugging multi-functionally with software, hardware and silicon design teams.\n-  Tracking, analyzing and reporting of critical test data.\n-  Creating software checks to compare observed behavior against expected behavior that is derived from system specifications.\n-  Designing and defining new validation strategy and detailed test plans.\n", "key_qualifications": "Generating and performing focused and pseudo random test cases of various configurations based on coverage analysis\n- Maintaining physical test environment and test hardware setup used in validation testing.\n- Debugging failures multi-functional with Software/Firmware, System Hardware and Silicon teams.\n- Tracking, analyzing and reporting of critical test data.\n- Crafting software checks to compare observed behavior against expected behavior that is derived from system specifications.\n- Developing and optimizing test framework and tools to create a controlled validation environment to support large scale validation.\n- Designing and defining new validation strategy as well as detailed test plans.\n- Previous experience in post-silicon validations\n- Test automation experience and large scale testing\n- Familiar with system power management and testing\n- Familiar with computer architecture and IO protocols (USB, I2C, PCIe)", "preferred_qualifications": "", "education_experience": "-  The candidate must possess a Bachelor's degree or Master's degree in Electrical Engineering, Computer Engineering or Computer Science \n-  Has to have at least 2 years of experience with system hardware or embedded hardware testing", "additional_requirements": "", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543297"}