{"title": "Sales - Country  Business Development Manager (Malaysia)", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "- Analysis and identification of macro risks and opportunities for Malaysia channel’s performance in the short and medium term. - Formulation of plans to improve business performance in conjunction with Account Managers. - Development of management tools to support capability and efficiency improvements with the Sales Team. These tools include reports, analysis, insights, processes and templates. - Working closely with Central Business Management Team and Sales Team to develop and implement business development programs (e.g., finance, lease, trade-in, solution bundles) suitable for channel partners in the country. - Establish and manage close working relationship, jointly with Account Managers, with the channel partners at all levels, and ensure effective performance management, implement relevant consumer programs etc, and maximise sales of Apple products to end-users. - Always represent the Apple brand to the highest level APPLE VALUES - Ability to work well in groups and without routine direct supervision. - Take initiative and challenge the status quo. - Deliver more than the customer expects. - Be dependable and reliable – follow-up quickly and consistently. - Demonstrate a positive and approachable demeanour.", "key_qualifications": "Strong problem solving, analytical skills to identify critical issues, evaluate options and provide recommendations Strong business planning capabilities. Ability to work within, and design processes that lead to the development of innovative and commercially driven sales plans Awareness of local channel structure, emerging trends, and competitor’s activities in the market. Ability to create and capitalize on opportunities. Proven track record in galvanizing, developing and motivating cross functional performing teams that may include diverse members Outstanding verbal and written communication skills and experience presenting to senior level executives Relevant work experience in strategy consulting, financial institutions, or business development is preferred Enthusiasm, personal drive and a sense of humour.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547222"}