{"title": "Speech & Audio ML Algorithm Engineer", "summary": "Imagine what you could do at Apple! Everyday, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. The Audio and Media Technologies (AMT) team is at the center of audio, video and graphics support in Apple’s innovative products, including AirPods, HomePod, Mac, iPhone, iPad, Apple Watch, and Apple TV. AMT’s Audio team provides the audio foundation for various high profile features like Spatial Audio, Siri, FaceTime and media capture and playback. As part of the Audio Algorithms team you will help us create the future of audio and speech capture technologies for our products.", "description": "The Audio Algorithms team is seeking a highly skilled and creative engineer interested in advancing speech and audio technologies at Apple. As a member of the team, you will work together with other researchers to codevelop machine learning and signal processing technologies for speech and hearing health, including noise reduction, source separation, beamforming, dereverberation, hearing loss compensation, and sound classification. You will help us research, implement, and optimize these features as we push the state of the art in audio products such as the AirPods. You’ll collaborate with multiple teams across product development to integrate your ideas into products and build future technologies that will impact millions of Apple customers.", "key_qualifications": "Research experience in speech or audio algorithm development (patents, papers, etc.)\nExperience with machine learning for speech or audio applications\nExperience with multi-microphone processing for speech or audio applications\nExperience developing real-time audio processing software\nFluency in C++, MATLAB, and Python", "preferred_qualifications": "", "education_experience": "MS/PhD in Computer Science or Electrical Engineering", "additional_requirements": "Familiarity with common software engineering practices and version control\nWorking knowledge of deep learning toolkits (TensorFlow, PyTorch, etc.)", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200521834"}