{"title": "Software Engineer - Frontend, Business Process Reengineering", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. Business Process Re-engineering team in India is looking for an experienced frontend engineer. In this role you will be working with a team of software engineers building groundbreaking, fast, interactive web applications that incorporate the best user experience patterns and technologies available. You will work closely with our business leaders and other partners to implement new solutions. The candidate must be able to work independently, understand the needs and build the solutions for sophisticated architecture and comfortable working under pressure at times.", "description": "Join Apple’s Business Process Re-engineering team as a Front-End Software Engineer where you will help build innovative software applications. You will have development and implementation experience in large scale high-demand applications. Your responsibilities will include all aspects of software development, from design and analysis to development, implementation and maintenance. You are a dedicated and hardworking individual. As a front-end software engineer, you will be a contributing member of a team that implements new application features, improves existing features, while adding performance and software quality metrics to our codebase. You will work closely with business partners, other engineering teams, quality assurance, management, as well as human interface and user experience designers.", "key_qualifications": "8-15 years of professional web application development experience, Solid understanding of JavaScript, AJAX, ReactJS, JQuery, JS MVC frameworks, Experience with data-driven web development, including significant knowledge of HTML5, DHTML, CSS3, JSON/XML and AG Grid, Experience with Typescript, CSS (Sass), build tools like web pack and test frameworks like Jest, Significant experience developing and implementing UI/Front-end for high volume web applications, Experience in cross-browser development and trouble-shooting, Experience in developing secure web applications and knowledge of application vulnerabilities such as Cross-site Scripting (XSS), Cross-site Request Forgery (CSRF) etc., Extensive use of APIs and a strong understanding of HTTP(S) and REST architecture, Knowledge of design patterns, enterprise architecture and software engineering principles, Basic understanding of containerization and container orchestration with Docker and Kubernetes, Understand security concepts and build reliable and safe distributed applications, Experience with leading and mentoring Engineers, Ability to successfully multi-task and support multiple, concurrent projects, Good communication and personal skills: ability to interact and work well with members in other functional groups and a strong sense of project ownership, Familiarity with full-stack development, Familiarity with Angular, Familiarity with GraphQL", "preferred_qualifications": "", "education_experience": "BE / BTech or MS degree in computer science or information management from a premier school", "additional_requirements": "Excellent analytical and quantitative skills, Experience in working in a large enterprise, with a global environment, across multiple timezones and geographies, Excellent communication and collaboration skills and ability to multi-task, To be successful you are self-motivated; driven to achieve and exceed expectations, Attention to detail, Comfortable working in a loosely structured organization", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512345"}