{"title": "Sr. Hardware Development Engineer", "summary": "Apple is looking for a highly motivated senior hardware development engineer to join Display Technologies Organization to work on technology development of new display and optical module architectures for future Apple products.", "description": "-  Define technical work scope, drive technical directions, and make systematic development plans to establish fundamental engineering learnings and meet product interception schedule.\n-  Initiate new module technologies to enable challenging design architectures in display and optics.\n-  Hands-on design, build, test, and refine hardware prototypes and systems in MTC’s labs to enable critical technology proof-of-concept and convergence.\n-  Hands-on drive process development in MTC's labs, including resource and DOE planning, empirical validation trials, data analysis and visualization, parameter optimization, and realistic risk assessment.\n-  Collaboratively work with cross-functional teams to plan and align the development strategy, and demonstrate technical results / issues to executives.", "key_qualifications": "Empty String", "preferred_qualifications": "MS or Ph.D. in Mechanical Engineering, Optical Engineering, Electrical Engineering, Physics, Material Science, or relevant engineering field with minimum 5 years of experience is preferred.\nProficient in mechanical design (i.e. NX, Solidworks), GD&T, and precision manufacturing techniques.\nHands-on experience in Opto-mechanical system, Metrology, Optical science and leveraging optical simulation tools (i.e. Zemax).\nHands-on experience in designing and developing control systems and software interface (i.e. Labview, Python, etc), Mechatronics and robotics, Sensing technology and integrations.\nStrong knowledge in data processing, statistical tools and data visualization using Matlab, Python, JMP, or similar tools.", "education_experience": "Empty String", "additional_requirements": "Empty String", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555296"}