{"title": "Computer Vision ML Engineer", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you want to impact the future of Manufacturing here at Apple through cutting edge ML techniques? This position involves a wide variety of skills, innovation, and is a rare opportunity to be working on ground breaking, new applications of machine-learning, research and implementation. Ultimately, your work would have a huge impact on billions of users across the globe. You can help inspire change, by using your skills to influence globally recognized products' supply chain.", "description": "Join our team as a key contributor, leading the development of machine learning (ML) solutions for diverse vision-based tasks and projects. Collaborate with engineering and operations teams to deliver cutting-edge ML technologies, ensuring top-tier product quality and reliability in a fast-paced environment. As part of our dynamic team of ML engineers and data scientists, you'll be hands-on in conceiving, coding, and deploying scalable ML models using industry-leading tools. Key skills include data wrangling, feature engineering, model development, and testing metrics. This role offers the flexibility to work independently and collaboratively, playing a pivotal role in achieving predefined objectives. If you're passionate about enhancing the quality, speed, and efficiency of ML algorithms, and want to contribute to creating refined products, we invite you to be part of our innovative journey. Join us in shaping the future of ML solutions and making a tangible impact on product quality and innovation.", "key_qualifications": "A deep understanding of computer vision, machine learning and deep learning concepts. Proven research and practical experience in developing algorithms for image processing, content-based video/image analysis, object detection, segmentation and tracking. Masters in Computer Science, Machine Learning, or higher level degree is preferred with of 3+ years of related industry experience in Machine Learning, Computer Science, Data Science or related fields. Knowledge of machine learning and computer vision libraries such as PyTorch, TensorFlow, Keras, scikit-learn, OpenCV, PIL, AutoML, is essential. Proven ability to implement, improve, debug, and maintain machine learning models. iOS CoreImage/CoreML and native App development experience is a big plus. AWS ML framework experience is preferred. Familiar with version control systems such as Git. Strong optimization and debugging skills. Self-motivated, responsible, excellent written and verbal interpersonal skills. Experience with handling and visualizing very large data sets and creating performance reports.", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Computer Science, Machine Learning, or higher level degree PhD preferred", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525286"}