{"title": "SWE tvOS - Engineering Program Manager", "summary": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we strive to achieve will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. Do you have a passion for creating ground-breaking, impactful features that surprise and delight millions of users? Do you enjoy solving challenging problems in a fast-paced, dynamic environment where you’ll work with many different teams across Apple? If so, we are looking for a Software Engineering Project Manager to join our team and help us innovate and take the most advanced operating systems to the next level!", "description": "In this role you will partner with software engineers and managers from our Software Engineering team to define, schedule, and track the team's work and also do the same for many multi-functional initiatives.  You will be the central hub bringing together different teams from Software, Hardware and Design, among other teams, all in the name of delivering on groundbreaking technology across all our operating systems.", "key_qualifications": "3-5+ years experience as a technical software Project or Program Manager\nStrong understanding of and experience in managing complex, multi-functional software projects\nStrong technical understanding of operating systems and how the various layers in the software stack fit together\nExcellent spoken and written communication with the ability to tailor communication style to multiple audiences\nProven track record in defining processes and executing on them\nSelf-motivated and enthusiastic with demonstrated creative and critical thinking capabilities\nHas a deeply curious mindset about new ideas\nExcellent attention to detail and highly organized\nAbility to build relationships and influence others", "preferred_qualifications": "", "education_experience": "BS in Computer Science or related field, preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548843"}