{"title": "Secure Systems Architect, Platform Architecture", "summary": "As part of Platform Architecture, the Secure Technologies group is responsible for the foundations that support Apple’s mission of privacy and security. We are looking for people who are passionate about this space, mindful of customer experience and operations at scale, and sport a can-do attitude along with engineering abilities to help move things forward from design through prototyping to implementation.", "description": "This role spans three vectors of work: Designing and prototyping new security technologies, participating in cross-functional forums to advise and anticipate upcoming needs and requirements, and modernizing the surrounding ecosystem where necessary. The mixture will vary over time and depend on your interests, strengths, and organization needs. We are responsible for core technologies like secure boot, attestation, and similar silicon foundations that support many of Apple’s security and privacy features. Our focus is on seamless, simple, and scalable security that is easy to reason about, audit, and prove. With these principles in mind, your role will be to apply and grow your skills in support of Apple’s mission to deliver the best customer experience combined with the highest standards for security and privacy. You will solve challenges that enable and improve security guarantees and have a direct impact on customers, engineers, manufacturing, legal, and finance. Due to the cross-functional nature and breadth of this role, and the artistic freedom given to the team, this role represents a great growth opportunity for individuals passionate about privacy and security.", "key_qualifications": "Comfortable shifting between big-picture and focused discussions, generalizing overall themes from individual use cases and vice versa. Understanding of security principles and concepts including root of trust, chain of trust, key management, trust establishment, key exchange, and related topics. Working knowledge of cryptography, including asymmetric and symmetric algorithms, signing, encryption, authentication, and post-quantum considerations. Attention to detail, critical thinking, willingness to accept and challenge ideas. Ability to balance security, simplicity, and scalability to come up with robust and sustainable solutions. Excellent written and verbal communication skills, and a passion for introducing clarity to conversations. Software engineering experience in at least two of the following: C, Python, or Go.", "preferred_qualifications": "", "education_experience": "Bachelor's and a minimum of 20 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536799"}