{"title": "SoC Storage System Engineer", "summary": "The System engineering team within Apple's Storage organization is looking for a dedicated System Engineer who will play key part in development and integration of SoC based solutions into Apple products based on deep understanding of silicon development cycle and storage systems. Successful candidates will work closely with diverse and highly proficient multi-functional groups on development and support of FW/HW based solutions.", "description": "Are you a big-picture problem solver who loves setting ambitious goals? Imagine what do you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. In this highly visible position you will be working on outstanding Apple SoC. - Develop and maintain comprehensive, multi-functional product specifications - System definitions and support across full product development cycle from pre-silicon to integration to Apple products and production - Close interaction with architecture, silicon, HW/FW and System validation teams on significant development and deployment of new features - Technical focal point and direct responsibility for number of technical areas", "key_qualifications": "5+ years of System Engineering experience in SoC based products Experience with silicon development, validation and integration including hands-on work Experience with writing system specifications and working with external vendors Experience with one of more of the following areas is an advantage: SerDes, DDR, Analog-Mixed Signal, Power Management Strong, dedicated and multidisciplinary engineer capable of quick learning and becoming highly visible and a focal point in variety of areas and projects", "preferred_qualifications": "", "education_experience": "B.sc in Electrical Engineering/ Computer engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530773"}