{"title": "Automation and Controls SME, Data Center", "summary": "At Apple, we embrace diversity, continuously strive for perfection, and thrive in an environment of innovation and collaboration. We are actively seeking a Data Center Automation and Controls Subject Matter Expert who will excel among a team of thinkers and doers, committed to working in a critical Data Center environment that values continuous improvement and embraces change. Apple’s Data Center Operations team thrives with individuals like you that take pride of ownership for the services provided in our critical environments. We excel at actively managing and maintaining systems that expand our customer support capabilities, and assist the world with their daily lives. As part of a group of like-minded people, you will address complex topics pertaining to applications, devices, processes and systems that craft how we maintain and operate our facilities in the most balanced and innovated approach possible!", "description": "The Data Center Automation and Controls SME will be responsible for maintaining and managing solutions for building management, SCADA, PLC's, and EPMS Systems while translating enterprise IT and InfoSec requirements. Being responsible for the implementation of building technologies solutions and enabling the DCO Facilities teams with respect to these technologies and the day to day operations of the critical facilities. These technologies support site functionality including: building automation, power monitoring, sustainability, environmental systems, and life safety systems. Other responsibilities include: Analyze metrics and articulate data trends both visually and verbally. Assist with design and implementation of projects such as assessing current processes/procedures to make recommendations for efficiency and code and configure individual controls within the BMS and EPMS environment. Provide a safe, professional, and operationally sound manipulation of electrical systems that support systems in high-availability, high-risk, or high-reliability environments. Regularly inspect and supervise critical equipment and responds too irregular or malfunctioning conditions. Respond quickly to emergency situations that impact the critical facility operations and coordinate with other critical facilities professionals to perform corrective repairs.", "key_qualifications": "5+ years of experience in Siemens, JCI, Schneider controls or equivalent, critical infrastructure systems including buildings and advanced EPMS and/or BMS systems. Understanding of hyper scale electrical and mechanical systems. Knowledge of NFPA70e and OSHA Regulations that pertain to data centers. Ability to perform practical applications of, preventative and corrective maintenance for mechanical, electrical, plumbing and other infrastructure systems in high-risk environments to ensure operational efficiency. Demonstrates the ability to read and interpret fire system, electrical system, and mechanical system drawings. Ability to collaborate with multiple teams to define and certify solutions to meet business needs while ensuring they meet the required standards. Ensure site integrity and system stability through corporate standards, processes and subject areas, accountable to maintain a 24x7 data center support model.", "preferred_qualifications": "", "education_experience": "High School diploma or GED equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501626"}