{"title": "Lab Validation Engineer (m/f/d)", "summary": "Why Apple?  \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.", "description": "You will need to have extensive experience in lab equipment, test automation, SI expertise in Serial links (such as PCIe) as well as parallel bus standards (such as LPDDR interface), power integrity at package level and as well as board level, and lab debug. \nResponsibilities include:  \n- Work with signal integrity engineer and IP designer to perform SI and PI lab measurement, analog IP characterization and high-speed IO characterization \n- Setup the lab test and automate the data acquisition, data processing, and reporting. \n- Work with chip designer and board design in various lab measurement and debug activities", "key_qualifications": "", "preferred_qualifications": "BS/MS in Electrical Engineering or industrial experience equivalent.\nApple is an equal-opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform crucial job functions, and receive other benefits and privileges of employment. Please contact us to request an accommodation.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556180"}