{"title": "Emulation Engineer - Tech Lead", "summary": "Imagine what you could do here at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Are you passionate about changing the world? We are looking for you to join our emulation team focusing on the creation, deployment, and support of advanced emulation environments. In this highly visible role, you will be at the centre of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly.", "description": "As an emulation tech lead, you will have the responsibilities as follows: Work closely with emulation, architecture and verification teams to create and enhance emulation environments. Work with the leading emulation vendors to debug issues and deploy new capabilities. Develop new emulation workloads and platforms to enhance user productivity . Develop high performance emulation models and transactors in system Verilog and C/C++ . Support multiple emulation environments using the latest emulation techniques Root cause failing SoC/Processor tests and emulator environment issues.", "key_qualifications": "Emulation experience with Palladium, Veloce, or Zebu - including compilation, debug, performance and throughput tuning, and implementation of advanced features / or experience with FPGA systems such as HAPS, Protium, Primo or EP1. Good self learning capabilities. Experience with C++ and system Verilog verification systems and environments. Experience working in Linux environment and writing 'make' based build systems. Experience with creating and supporting job submission and tracking tools preferred.", "preferred_qualifications": "", "education_experience": "BSC in Electrical Engineering/Computer engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550886"}