{"title": "Internal Communications Content Manager", "summary": "Apple is where people do the best work of their careers. Apple’s Internal Communications team informs and engages employees worldwide on everything from our innovative products and services, the values that drive our company, to our industry-leading benefits and support programs. We are looking for an outstanding Content Manager for our global weekly employee newsletter. This is a role for a creative thinker, experienced communicator, and collaborative problem solver who is passionate about telling impactful stories that connect our team members worldwide to our innovative products and services, core values and special culture.", "description": "In this role, you’ll lead the strategy, planning and delivery for a flagship internal channel: our global weekly newsletter. You are experienced in developing and executing an editorial strategy and have an advanced understanding of what makes content engaging and successful across audiences. You’ll elevate our internal storytelling and showcase stories that matter.", "key_qualifications": "At least 10+ years successfully leading the strategy and delivery of news related content.\nPortfolio showing proficiency in delivering strong creative ideas across digital, social or static and print media.\nBachelor’s degree in editorial writing, marketing, or related field preferred.", "preferred_qualifications": "Experience in media, public relations, publishing, corporate communications and/or online publisher.\nExperience in journalism, media or public relations with great storytelling skills, a nose for news, and the ability to work collaboratively and collegially with a team of seasoned content producers, creatives and senior stakeholders.\nExcellent organizational skills and attention to detail.\nKeep projects on schedule while working collaboratively across a wide range of teams and stakeholders.\nExcellent communication skills, including the ability to communicate clearly and concisely across multiple audiences and partners.\nConsistently pursue high standards with initiative, energy and drive.\nTrack, report on key performance metrics, using data to drive recommendations and decisions on creative storytelling that resonates with internal audiences.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556017"}