{"title": "DE-Senior Manager (m/w/x)", "summary": "Im Apple Store ist eine Rolle im Leadership Team eine bereichernde Aufgabe, denn unser Business entwickelt sich ständig weiter und bietet dir immer neue Herausforderungen und Chancen. \u2028Als Senior Manager leitest du die Mitarbeiter und Abläufe in einem oder mehreren Bereichen im Store. Dein Ziel ist es, Lösungen und Ergebnisse zu finden, die ein leistungsstarkes Arbeitsumfeld schaffen. \u2028Du kannst Situationen schnell erfassen und handelst entschlossen – auf diese Weise führst du den Store zum Erfolg. Zudem unterstützt du die Marke Apple durch erstklassigen Kundenservice.", "description": "Als Senior Manager zeigst du anderen Leadern, wie sie ihre Teams zu Spitzenleistungen inspirieren. \u2028Du beobachtest die verschiedenen Geschäftsbereiche im Store und sorgst dafür, dass die operativen \u2028Ziele erreicht werden. Du arbeitest mit den Partnern im Unternehmen zusammen und informierst sie über die erzielten Ergebnisse. Du kennst dich in der Branche aus und informierst dich über Mitbewerber und Trends. Du leitest die Sales und Support Teams und gehst mit gutem Beispiel voran, wenn es darum geht, Lösungen zu finden, bei denen der Kunde an erster Stelle steht. Du förderst die Weiterentwicklung deiner Mitarbeiter, indem du ihnen klare Hilfestellungen bietest, durch die du sie coachst und unterstützt. Indem du gute Beziehungen zwischen den Teams und zu Kunden entwickelst, schaffst du ein Umfeld, \u2028das die Treue der Kunden gegenüber den Produkten und Services von Apple fördert.", "key_qualifications": "", "preferred_qualifications": "Fähigkeit, in Zusammenarbeit mit dem Store Leadership Team strategische Pläne für verschiedene Unternehmensgruppen zu entwickeln, Prozesse zu verbessern und bestehende Standards zu übertreffen, um den Erfolg des Stores zu fördern. Nachgewiesene Erfahrung in der Motivation, beim Coaching und Training sowie bei der Weiterentwicklung von Teammitgliedern in einem Store, um außergewöhnlichen Kundenservice und Geschäftserfolge zu ermöglichen. Erfahrung im Umgang mit Herausforderungen, in der Unterstützung von Mitarbeitern und der Koordination der Kommunikation in einem sich ständig verändernden Einzelhandelsumfeld. Mit einer Erfahrung von mindestens fünf Jahren in einer kundenorientierten Verkaufsumgebung \u2028hast du deine Führungskompetenzen unter Beweis gestellt. Branchenübergreifende Erfahrung ist wünschenswert – Erfahrungen im Einzelhandel sind nicht erforderlich. Du lernst leidenschaftlich gerne Neues über Apple Technologien und Produkte. Auf Englisch verständigst du dich sicher in Wort und Schrift. An deinem Standort kannst du fließend in der dortigen Landessprache kommunizieren. Du sprichst mehrere Sprachen? Noch besser. Flexible Arbeitszeiten stellen kein Problem für dich dar. Deine Arbeitsstunden sind vom jeweiligen Unternehmensbedarf abhängig.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560223"}