{"title": "Apple Evangelist, Korea", "summary": "Apps are changing the world and enriching people’s lives and the developers who build them are constantly crafting extraordinary experiences to delight customers.  Apple’s Worldwide Developer Relations team works every day to provide the services, resources, and mentorship that enable the world’s most dynamic developer community to stretch the limits of their imaginations and bring the next big app idea to Apple’s platforms to customers across the globe. We are seeking a Technologies Evangelist for the Worldwide Developer Relations team. As a member of Apple’s Evangelism team, you will help 3rd-party developers adopt the core system frameworks and APIs underlying the platform experience on Apple devices.  This role offers a unique opportunity to directly impact the user interface, architecture, and quality of apps and games enjoyed by millions of people every day.", "description": "You will bring a passion for Apple technologies, proven aptitude for developing Apple platforms as well as strong communication and people skills to this role. You will be presenting in public, collaborating cross-functionally within Apple, and working side by side with developers every day.  Responsibilities include: - Managing and developing relationships within the local developer community - Working one-on-one with 3rd party software development teams and decision-makers to ensure the products they are building are best-of-class or next-generation apps, through UI/UX reviews and technology consultations - Driving adoption of Apple technologies and other core technologies by identifying specific opportunities for each 3rd party - Supporting developer technology adoption requirements, through effectively working with cross-functional teams at Apple - Presenting core Apple technologies to a developer audience in an effective and clear manner", "key_qualifications": "empty string", "preferred_qualifications": "Expertise with Xcode, Swift, and Swift UI. Excellent knowledge of modern app development, client-server interactions, and optimization. Outstanding written and verbal communication skills. Proven public speaking and presentation skills. Dedicated individual who understands Apple's high standards. Highly professional, with proven experience in delivering solid work on tight schedules. Motivated, proactive, outgoing, and comfortable working in a loosely structured, collaborative organization. Expertise with Graphics, Media and AI/ML", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558163"}