{"title": "Software Engineering Manager", "summary": "The IS&T Product Engineering Systems group is seeking a Software Engineering Manager who has a proven track record in developing and managing high quality enterprise software solutions. Our group is responsible for Enterprise Product Lifecycle Management (PLM) transformation initiative to deliver next generation Product Information Management(PIM) Platform to drive Apple’s Product Innovation across hardware, software and services lines of business.", "description": "Join the IS&T Product Engineering Systems group, as a Software Engineering Manager, where you will help build innovative enterprise software applications. Drive an exciting Next Generation PLM transformation at Apple and help implement a scalable, futuristic platform to support Apple’s product growth for years to come. You will lead an elite engineering team to design and implement our new enterprise PIM solution.", "key_qualifications": "12+ years of Software Engineering experience, including 6+ years of experience managing engineering teams\n5+ years of demonstrable experience building and maintaining large scale, distributed systems.\nExperience developing enterprise applications using Java/J2EE, including Web Services (e.g., RESTful, SOAP), Spring Framework and SpringBoot, and ORM (e.g. Hibernate).\nExperience in building, developing, and managing highly effective engineering teams\nExperience leading system design, integration, and deployment in a complex, integrated environment\nExperience with micro-services architectures and container-based deployment (e.g. Docker, Kubernetes)\nExperience with web development skills, including JavaScript, NodeJS, React, and Bootstrap.\nExperience with Relational Database Management Systems (RDBMS) and SQL, as well as multi-modal NoSQL databases, including DocumentDB and GraphDB\nExcellent communication, leadership, and presentation skills", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master’s degree in Computer Science or equivalent experience", "additional_requirements": "Knowledge of enterprise solutions such as ERP, MES, ALM, and MDM is desired", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524029"}