{"title": "Apple Channel Store Advisor (part-time), Boulogne-Billancourt (6 months fixed term contract)", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The role is internally known as an Apple Staff in Channel, and you are the link between our future customers and our products. You’ll be responsible for crafting an extraordinary experience, and you’ll help build a network of committed Apple customers! You’ll showcase your ambitious spirit as you lead the sales, merchandising, and operations of an Apple Shop within a consumer electronics store.", "description": "The ASC has the following responsibilities to fulfill as they relate to four key areas:\n1. Customer:\nWe are responsible for ensuring each customer has a world-class Apple customer experience\nPromoting Apple products and solutions by passionately sharing the benefits and values of Apple products through product demonstrations.\nConducting 1:1 and 1:many (where applicable) product demonstrations using worldwide developed demonstration scripts for guidance and mentorship.\nBuilding a community of dedicated Apple customers who will come back to consult the ASC on future Apple purchases.\n2. In-store Merchandising\nThe ASC operates as the business manager in a point of sale. As such, it is the ASC’s responsibility\n to develop the virtual team to maintain the quality and appearance of the in-store merchandising in order to give the customer the best possible Apple experience.\nResponsibilities include:\nEnsuring all merchandising elements (including demo content, as well as all 2D and 3D elements) are up to date and follow Apple worldwide standards with a high attention to detail \nWe guide and educate the shop team members to work together to establish and maintaining tidiness according to worldwide guidelines.\nFlagging to the manager any maintenance issues with any Apple merchandising execution in the store.\nMaintaining the brand image through dynamic attention to visual standards.\n3. Staff Management\nA successful ASC proves him or herself of significant value to a Reseller’s management team and gains support without authority.\nYou will have a strong eye for business and understanding of the business partners business and goals.\nResponsibilities include:\nLiving as a promoter of the Apple brand to Reseller’s staff / management, and keeping them engaged current on Apple’s latest and the greatest products.\nUnderstand what the Reseller’s business goals are and link Apple’s goals to theirs.\nIdentifying and maintaining a “virtual team” of key staff members who the ASC will train and transform into Apple Professional / Experts. The training of the “virtual team” is essential, as they will depend on this group to support Apple’s business in every way.\n4. Apple Corporate/Manager\nThe ASC is able to provide key insights on the Apple business and identify business opportunities.", "key_qualifications": "Validated experience in a retail environment or recent graduate with extraordinary customer service skills. Adaptive and solutions-based approach to business management. You truly love connecting with customers and helping them understand technology on a human level. You have the ability to discover customers’ needs and values. Engaging and confident presentation style. Excellent written and verbal communication skills. Ability to work autonomously and self driven. Results driven without compromising quality. Good with numbers and ability to analyse data. You thrive in a dynamic environment. High level of ethics, values, integrity, and trust. Solid work ethic with a flexible and adaptable approach to work. Passionate about details.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience preferred.", "additional_requirements": "This job description gives guidance to the main tasks and responsibilities of the role. It is not exhaustive and is subject to change. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545760"}