{"title": "Component Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability, and performance of the product? Dynamic, Inspiring people and Innovative technologies are the norm here. The Components Engineering Team at Apple is responsible for identifying, documenting, and releasing efficient components from a variety of commodities for some of our products. The team is a multi-functional extension of System Integration Electrical Engineering team focusing on ensuring that the right specific components are selected for every electrical component in the Product's Design. We are seeking a Component Engineer to join our team to drive the component selection process and perform your work in a consultative manner as the Domain Expert. Come Join Us!", "description": "The Individual at this role will have the opportunity to work on the intricate and complex issues impacting delivery for best-in-class Apple devices. Specific duties include but are not limited to: - Supporting project teams as the resident component expert, suggesting alternate components and resolving component related issues. - Engaging with suppliers on new component development and roadmaps and qualification. - Reviewing and evaluating component PCNs (Part Change Notifications). - Coordinating and tracking all component root cause failure analyses and implementing corrective actions. - Managing component lifecycles.", "key_qualifications": "Minimum of 5 years of industry experience is required, with at least 3 years of experience in Component Engineering or a similar role. Capability to work cross-functionally with groups such as EE (Electrical Engineering), DFM (Design for Manufacturing), GSM (Global Supply Chain Managers), Component Quality, and suppliers to resolve component-related issues. Knowledge in component application, manufacturing, and qualification. Understanding of engineering documentation (e.g., schematics, data sheets) and standard document control practices (Engineering Change Requests, Engineering Change Orders, deviations, etc.). Excellent interpersonal skills, both written and oral.", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Electrical Engineering is required. ", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551484"}