{"title": "Launch@Apple Mentorship and Externship Opportunities", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. Launch@Apple, a program within Apple’s Finance organization, has multiple opportunities for students who are passionate about pursuing careers in Corporate Finance. As a mentee, you’ll grow professionally and personally under the guidance of an Apple mentor. As an extern, you will learn, grow, and contribute to Apple’s business while working on exciting projects alongside top Finance professionals.", "description": "Opportunities within the Launch@Apple program include: Launch Mentorship Launch Mentees have the opportunity to work one-on-one with an Apple mentor to grow personally as well as professionally. While your 30-minute weekly sessions with your mentor are the main component of the program, you will also be participating in regular virtual events that will grow your technical and soft skills, build your professional network, and learn about corporate finance. Launch Externship Launch Externs have the opportunity to support areas of Apple’s businesses, including AppleCare, Financial Services, Internet Software & Services, Marketing, Operations, R&D, Retail, Sales, Financial Planning & Analysis, and more. During the summer, you could: - Analyze financial performance by highlighting trends and anomalies - Streamline reporting through the use of databases such as Tableau or with Excel macros - Partner with cross-functional groups and business partners to analyze the business - Provide insights and recommendations for operational improvements and innovations - Assist with close procedures - Research innovative solutions for business problems To express interest in the Launch@Apple opportunities, please provide a copy of your resume, cover letter, and unofficial transcript.", "key_qualifications": "Pursuing a Bachelors degree in Business Administration, Finance, Accounting, Economics, or a related field, graduating December 2026 or Spring 2027.", "preferred_qualifications": "First-generation college student, Ability to think analytically, Strong at multi-tasking, Thrive in a fast-paced environment, Be a self-starter, Excellent verbal and written communications skills", "education_experience": "", "additional_requirements": "Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548066"}