{"title": "Wireless System Simulation Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. You will become part of a hands-on development team that furthers engineering perfection, creativity and innovation. We want you to join our wireless modeling team if you are a resourceful engineer with the desire to research and develop solutions that will construct Apple products.", "description": "You will lead development of wireless simulation model to achieve fast SW development including model’s design, development, integration and unit-testing. You will lead research and investigation of major architecture oriented problems and solutions including planning, building unique virtualization infrastructure in MacOS environment, data analysis and presentation of the research results to wide forum. Define system level functionality of the wireless sub-system - HW definitions, HW-FW partition. You will work closely with HW design, architecture, FW and Driver teams to define the functional and performance goals of the system. Work independently and lead deliverables to align with the project goals and also support multi-functional engineering efforts.", "key_qualifications": "4+ years of proven experience in C or C++ in HW modeling, FW embedded or linux/MacOS Driver development, HW-FW integrations, ARM architecture knowledge, Python experience is an advantage, VLSI understanding, Verilog or verification experience is an advantage, Deep understanding of Wifi or BT - an advantage, Experience in developing virtual machine is an advantage, Ability to lead data investigations and analysis projects with ambiguous requirements, Should be a team player with excellent communication skills and the desire to take on diverse challenges, Curious and have excellent analytical and problem solving skills, Excellent written, verbal, and data communication skills", "preferred_qualifications": "", "education_experience": "- B.Sc / M.Sc in Electrical / Computer Engineering/ Computer Science.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545527"}