{"title": "Business, Marketing, and G&A Internships", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Within Apple, these teams support various lines of business with a mixture of non-technical and technical roles. The people that support Apple's business functions have a unique mix of backgrounds, experiences, and skills and our teams are full of dynamic and incredibly thoughtful and hardworking people passionate about technology, digital media, arts and entertainment. As an intern, you will learn, grow, and contribute to Apple’s business while working on exciting projects alongside top professionals. Internship opportunities are available within the following areas: Business, Design, Environment, Policy, & Social Initiatives, Finance, Legal, Marketing, Public Relations, Real Estate & Development, Sales", "key_qualifications": "Students currently pursuing an undergraduate or graduate degree across all departments (marketing, design, engineering, business and finance, music & film, legal, communications, economics, etc.) At the end of the internship, you must return to school to continue your education or the internship must be the last requirement for you to graduate.", "preferred_qualifications": "It’s helpful if you meet one or more of the following qualifications, but it isn’t a requirement. Pro-active; striving to go above and beyond what is required for the role. Ability to prioritize well and tackle challenges enthusiastically. Innovative; continuously seeking to enhance and redefine the approach needed to grow business while delivering perfectly on all priority projects. Amazing attention to detail. Results-oriented, persistent, and meticulous. Adept at handling a varying workload and high volume of information. Sharp written and verbal communication and organizational skills required. Resourceful, highly organized with the ability to meet deadlines, and completion of tasks and projects assigned. Ability to work in a fast-paced and team-oriented environment. Prior related internship(s), group or personal project exposure, TA and/or work experience.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554357"}