{"title": "Cellular RF Systems Architect – Transceiver Requirements Engineering", "summary": "Imagine what you could do here! At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We invite you to join our dynamic group, for the outstanding and great opportunity to contribute to upcoming products that will delight and encourage millions of Apple’s customers every day. Apple's RF Systems Engineering team is looking for a hardworking, independent expert with a consistent record in the area of RF transceiver development. Our elite team crafts the mobile market with forward-thinking concepts while being fully accountable for execution and commitments on timeline and quality. Come and deliver next generation transceiver architecture for Apple’s wireless products that enable an outstanding customer experience!", "description": "In this role, you will be part of the outstanding cellular RFSE Team. You will work closely with transmitter and receiver architecture teams, RF design teams, pre- and post-silicon verification teams to drive innovation and next generation product architecture. Your daily work includes the following tasks: - Analysis of 3GPP, regulatory, and RF product requirements for 5G Advanced and 6G - Analysis of complex system use cases and translation into architecture and sub-system requirements - System impact analysis of functional and performance requirements on RX and TX sub-systems - Collaboration with RX and TX system architects on micro-architecture options to cover new system requirements - Collaboration with baseband system engineering on complex modem use cases, system requirements, and system partitioning - Taking end-to-end responsibility on RF features, capabilities, and requirements, e.g. via systematic requirements engineering methodology, feasibility studies, system simulation, and design reviews - Hands-on simulation and methodology development for due diligence of architecture options - Authoring of system architecture specifications as guidance to system engineering, design, and validation teams", "key_qualifications": "More than 5 years of proven experience in RF systems engineering, or more than 10 years of experience in communications circuit design (RF, analog, mixed-signal and/or digital); Strong background in math and physics, especially electromagnetics; Background on analog/digital signal processing and simulation of data paths; Strong background in cellular communication technology and cellular radio standards (3GPP, regulatory etc.) on physical layer; Strong discipline and systematics to work through complex specifications like 3GPP to identify impact and derive requirements for RF sub-system; Basic knowledge of micro-architecture of RF building blocks such as PLLs, ADCs, DACs, mixers; Healthy combination of innovation mindset and understanding of practical constraints of product development; Solid programming skills; Excellent communication skills, both written & verbal especially in a multi-functional environment", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200513173"}