{"title": "US-Store Leader", "summary": "Would you love to work in a complex and ever-changing work environment? As more and more people discover Apple, they visit our stores seeking ways to incorporate our products into their lives. It’s your job, as a Store Leader, to build and manage the various teams that engage customers in this dynamic environment. In this role, you lead the people that help customers achieve ownership, learn new skills, get technical support, and find business solutions. Adaptable and flexible by nature, you’re composed and collected as you balance the diverse needs of your teams in the midst of constant change. As a Store Leader, you work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "As a Store Leader, you inspire teams to deliver measurable results for the store's various business sectors. You lead a sales force that discovers customers' needs and delivers solutions to build Apple loyalty. Your technical support team helps maintain customers' trust in Apple and its products. Your business team brings the Apple experience to business customers. And the training staff you coach teaches customers how to get the most out of their Apple products. You build these lines of business by selecting and developing a knowledgeable talent pool. In addition to team building, you create excitement around products, launches, programs, and initiatives. You're responsible for upholding our high standards regarding communication and confidentiality. And by driving your staff to create customer experiences that enhance Apple loyalty, you deliver measurable results and help enrich customers' lives.", "key_qualifications": "", "preferred_qualifications": "Proven ability to drive positive customer experiences that build loyalty and deliver measurable results. Ability to manage separate business groups within a complex environment. Strong communication skills to clearly impart the Apple vision to the teams you oversee. Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. Role model inclusive leadership behaviors and build, develop and retain diverse teams. Take action to ensure a safe, respectful, and inclusive environment for all team members. You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting. Cross-industry experience is welcome — a retail background is not necessary. You have a passion for learning about Apple technology and products. Multilingual ability is a plus. You'll need to be flexible with your schedule. Your work hours will be based on business needs.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556975"}