{"title": "iPhone & Core Technologies Quality Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Join the dynamic Product Operations team. In this highly visible role, you will lead the Operations technical team during the next generation product’s development and high volume production. As the technical lead for a product line, you will partner closely with multiple multi-functional teams during all phases of development to enable the product success!", "description": "To be a successful team member within Product Operations you will lead cross-functional Operations technical teams (DFx, DFm, Test, SQE, PQE and others) during product development and high volume production. As the senior technical advisor for the product line, you will partner closely with the Engineering throughout the lifecycle of development to enable operational success through to mass production. Some responsibilities include: Product Quality Program Management, Product Quality Plan (PQP) development, quality improvement opportunities identification, technical Failure Analysis, process FMEAs, and more.", "key_qualifications": "", "preferred_qualifications": "MS/PhD in Mechanical, Electrical, Optical, Materials, or Industrial Engineering or equivalent. Experience in Product Quality Program Management, statistical and data analytics skills, technology and scaling partners development, quality systems knowledge, and more.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $122,300 and $184,600. Apple employees have the opportunity to become Apple shareholders, receive benefits like medical and dental coverage, retirement benefits, discounted products and free services, educational expenses reimbursement, and more.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557787"}