{"title": "AIML - Director of Engineering", "summary": "Do you want to play a part in building groundbreaking technology for large-scale systems, natural language, big data, and artificial intelligence? Join the AIML team at Apple, and help us improve the user experience of Siri, and other AIML products, helping millions of people get things done across the globe!", "description": "In this senior leadership role, you will define our model evaluation strategy, and determine and develop appropriate methodologies, to enable hill climbing. Our goal is to deliver offline evaluation insights that drive model development and improvements with wins for our end-user experience, all while upholding the privacy standards that Apple is known for. With the advent of Apple Intelligence, we are facing novel challenges in developing representative datasets and simulations for delivering a highly personalized user experience. Utilizing personal context presents specific challenges to delivering accurate responses to every user, demanding innovative evaluation solutions. These models power the next generation of Siri and Apple products, and you will be part of this exciting journey. As the senior team leader, you will cultivate collaboration with your peers and partners across AIML and Apple. Your leadership will be instrumental in fostering a culture of continuous improvement and taking state-of-the-art evaluation solutions to Apple partners while learning from them.", "key_qualifications": " ", "preferred_qualifications": "Passion for product and customer experience\nShown aptitude for leading a breadth of product areas simultaneously\nExtensive experience delivering large-scale product or platform outcomes, leveraging cross-functional partnerships\nProven record of gaining technical expertise on the job; demonstrates the ability to learn new technologies independently.\nExcellent understanding of an ML-based product lifecycle.\nDemonstrated depth of knowledge and application of statistics-based evaluation methodologies or user success metrics.\nExperience with systems engineering; in-depth understanding of interdependencies of ML and SW components.\nProven innovation record\nExperience leading a team of senior engineers\nAbility to develop a long-term vision and execute strategies at scale while maintaining a grasp of technical details for better decision-making\nExperience delivering or supporting products across multiple organizations, establishing cross-functional partnerships\nExperience with SVP-level presentations and reporting", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $293,300 and $468,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555295"}