{"title": "Supply Chain Account Manager - 11 month contract", "summary": "This is a place where extraordinary people gather to do their best work. At Apple, we craft products and experiences people once couldn't have imagined, and now can't imagine living without. If you’re excited by the idea of making a real impact, a career with Apple might be your dream job. We believe that collaboration is one of our key strengths, and every day we will connect you with your peers and colleagues, at one of the most diverse and inclusive companies in the world. As an individual, you'll add to to our continued success, and be a key player within the function. This team leads and owns the operational relationship with Apple Resellers across EMEIA. In this role, you will develop phenomenal relationships externally as well as internally, and be disciplined with strong analytical and influencing skills. You'll have exceptional communication and account management skills. If you love managing and influencing complex business relationships and want to be an active member of one of the best supply chains in the world, then this could be your ideal job. We'd love to hear from you!", "description": "You'll build and maintain working relationships with key customers, and use statistical & collaborative forecasting techniques to accurately forecast consumer demand Prepare partner demand data, and conduct detailed analysis to minimise forecast error Own and drive long-term forecasting of products, being responsible for the accuracy of those forecasts and talking and framing any differences. Acquire business knowledge and incorporate this information into your forecasts Reporting and presentation of executive reviews Forecasting a constrained supply environment to ensure supply is secured Plan and execute New Product Introductions and Forecasts, together with seasonal strategies Work on your own initiative, to capture and disseminate information needed to make decisions and drive the business Ensure adherence of key customers' Contractual requirements Understand the Partner’s supply chain model & market dynamics", "key_qualifications": "", "preferred_qualifications": "Bachelor’s degree - 3rd level degree in IT, Business Analytics, Business Information Systems, Maths, however, if you have relevant experience or similar field you are encouraged to apply Proven experience as an account executive or in a Supply Demand Analyst role Experience in leading cross functional projects Some demand planning specific experience and a background in forecasting", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556852"}