{"title": "Experienced SoC Physical Design STA / Timing Engineer (M, F, D)", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Multifaceted, people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next phenomenal Apple product. Do you enjoy working on challenges that no one has solved yet? As a member of our dynamic group, you will get the outstanding and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team transforming hardware technology? We are searching for a hardworking engineer to join our exciting team of problem solvers. Join us! You will be taking part in the Physical Design team as a backend focal point for timing analysis and convergence, working in sophisticated technologies and interacting closely both with RTL designers, Physical Designers and other top level integration teams.", "description": "Responsibilities include especially, but are not limited to: Work with Physical Design team, highlighting issues & best practices. Help build timing ECO’s for project tapeout. Build/maintain scripts and methodologies for analysis and runs. You will be responsible for constraints and timing checkups development, including their delivery for synthesis, PnR and signoff STA. Working in parallel on blocks and chip level STA modes.", "key_qualifications": "", "preferred_qualifications": "Familiarity with synthesis, logic equivalence, DFT and backend related methodology and tools. Understand and implement improving existing methodologies and flows. Experience in reducing the number of timing signoff corners by merging different timing modes is highly desired. Strong background in Constraint analysis and debug, using industry standard tools as well as backend STA closure. Deep understanding and experience in timing closure of various test modes such as scan shift, scan capture, atspeed and Bist testing. Familiar with ECO techniques and implementation. Experience in ASIC timing constraints generation and timing closure. Expertise in STA tools (Primetime) and flow. Familiarity with hierarchical design approach, top-down design, timing and physical convergence. Good communication and interaction with Front End teams and Physical Design teams. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559259"}