{"title": "Senior Quality Manager, App Store", "summary": "The Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. We are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And we do it on a massive scale, meeting Apple’s high expectations with dedication, to deliver a huge variety of entertainment in over 35 languages to more than 150 countries! Our engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.", "description": "Lead the activities of a software quality assurance function for the App Store consumer and development experience team of 60+ full time employees. Provide guidance in the areas of both services and client testing and code evaluation. Develop process and methods to continue to scale the testing process, while partnering with other quality organizations to deliver the best outcomes to our customers and developers. Evaluate and communicate data to product sponsors and partners to drive decisions. Select and develop talent including leadership, to ensure efficient operations and functions.", "key_qualifications": "Establish a team environment that continuously strives towards best practices, measurable outcomes, and operational excellence. Extensive experience planning and leading software release cycles for both server and client components. Ability to plan and direct both service and client automation and partner with other teams to achieve strategic automation goals. Demonstrated success hiring, developing and building an inclusive team-based culture. Strong knowledge of retail industry trends, technologies, and best practices. Strong background in designing and architecting automation solutions that enable a shared accountability in quality. Strong leadership, influence, and thought leadership skills and the ability to build and partner with other technology dev and test teams across Apple. Demonstrated ability to achieve results through people and across an organization, forming relationships, collaborating with and influencing multi-functional teams. Able to deep dive into technical areas when needed but also up level communications to broader audience. Experience developing and testing front and back-end customer-facing components, including a focus on dev tools and an Application management portal (App Store Connect). 5-10 years of experience managing multiple quality teams. Ability to lead the team to test complex and new technologies.", "preferred_qualifications": "", "education_experience": "BS, MS, or PhD in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience 15+ years of experience in relevant fields of engineering development, quality assurance or project management", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $238,300 and $358,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535850"}