{"title": "Java Software Engineer- Apple Services Engineering", "summary": "Apple Services Engineering (ASE) first delighted users with downloadable music in April 2003 with the opening of the iTunes Store. Since then, ASE has delivered countless innovations around the digital delivery of audio and video, and in 2008 revolutionized smartphone app distribution with the launch of the App Store. The Apple Services Engineering media platforms organization is looking for a Software Engineer to join the Asset Management team. We are responsible for storing and delivering the many petabytes of files used by the content import, review, processing, and distribution systems. Our systems store, track, and deliver every app, song, movie, and video – both streamed and downloaded. Come help build and own the services and systems that underlay the growth of the App Store, Apple TV+, & Apple Music.", "description": "You will be working with a small, focused team to design, build, maintain, deploy, support, and enhance new and existing micro-services responsible for the management and protection of content assets within the Apple Services Engineering organization. This includes the development, maintenance, and support various Java client libraries (using HTTP, REST, JSON, and/or GRPC). We collaborate closely with other teams across Apple to integrate our systems with theirs, and we also perform direct integration with various legacy codebases. Most of our systems have direct customer impact, so curiosity and attention to detail are essential to success. The team is currently transitioning many of our systems from legacy bare-metal installs onto cloud-based infrastructure based on Kubernetes. This requires understanding of Kubernetes concepts and functional expertise with Kubernetes and related tooling. Does this sound like you? Join us!", "key_qualifications": "", "preferred_qualifications": "Experience with React and/or Svelte, Experience with Apache Traffic Server, Experience with Cassandra, Protocol-level understanding of HTTP, Understanding of TCP/IP, networking, and maximizing transfer efficiency of very large files, Experience with Spark, Knowledge of cryptographic APIs and proper use of cryptographic primitives, Experience & knowledge of Open Telemetry and distributed tracing", "education_experience": "BS/BA in Computer Science/Engineering or equivalent is preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519830"}