{"title": "Ad Platforms - LATAM, Growth Accounts - Client Strategist", "summary": "At Apple, we believe in the power of technology to enrich people’s lives. Everything we build is designed—first and foremost—with helping people in mind. We believe advertising is no different, and that its value should come from how it benefits customers, not what it extracts from them. Our Ad Platforms team applies that belief by delivering ads that add new value, helping people discover content, supporting creators, and protecting and respecting everyone’s privacy.", "description": "With this role we have a unique opportunity to help launch the LATAM region. Our Growth Accounts segment is exciting and requires best-in-class partnership to achieve their business aspirations. You should have a real passion for helping small and medium businesses succeed, have very strong communication and interpersonal skills, be highly analytical, resourceful, client-focused, and team-oriented, and can work independently to meet revenue and business objectives. You have a proven track record of meeting or exceeding sales targets in the ads space with performance-type advertisers and agencies.", "key_qualifications": "", "preferred_qualifications": "Fluent in Spanish. Consistent track record of overachievement and meeting or exceeding sales targets in the digital ads space. Exceptional communication and presentation skills, capable of delivering impactful messages both in person, over video, and over the phone. A highly developed desire to make a difference, driven by self-motivation and a commitment to excel. Capability of maintaining a robust business pipeline through email, phone, and in-person outreach and moving deals through planned, pitched, agreed, and implemented phases. Strong analytical skills, with the ability to use internal and external data sets to facilitate business growth for your clients. Demonstrated professionalism and a positive demeanor, with a desire to develop business acumen and client-centricity. Proficiency in active listening and asking insightful questions for continuous learning.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,528 and $169,728, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557154"}