{"title": "EMEIA M&A Integration Accountant (12 month contract)", "summary": "Apple is a place where extraordinary people come together to do their best work. Together we build products and experiences people once couldn’t have envisioned — and now can’t imagine living without. If you’re excited by the idea of making a real impact, a career with Apple might be your ideal job… Just be prepared to dream big!", "description": "Help improve processes and drive standardisation for the teams within the Record to Report (R2R) Team. Document key data and reporting processes for the GL team in R2R. Implement key process improvements within the R2R team. Work directly with business partners to analyse requirements, underlying process and propose & implement automated solutions that will work effectively and efficiently. Ensure appropriate systems, processes, tools and business relationships exist to enable effective legal entity controllership and compliance. Responsible for the post acquisition integration of M&A entities – including US GAAP accounting, Local GAAP statutory accounting and Tax Compliance. Manage the relationship with key partners and reporting teams to propose solutions, and facilitate prioritisation of work. Influence requirements for improvements to reporting tools with an eye for eliminating manual data extraction and processing. Maintain data integrity of SAP to ensure US GAAP rules and local legal statutory and accounting reporting requirements are met. Responsible for ensuring processes are Sarbanes-Oxley (SOX)-compliant. Support GBS initiatives and ad-hoc GL relevant projects as requested. Develop with the role to expand responsibilities within the GBS organisation.", "key_qualifications": "", "preferred_qualifications": "Knowledge of SAP, Excel and Keynote. Experience in Business Intelligent Tools: Business Objects, advanced Excel (VBA, Macro), Tableau & SQL an advantage. Identify issues and drive to resolution on a timely basis. Ability to form effective relationships and show influencing skills. Excellent collaboration, problem solving, project management & communication skills required.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548202"}