{"title": "Software Development Manager In Test", "summary": "Join the team responsible for ensuring the best user experience around the Performance of Apple products, known to surprise and delight our customers. OS Performance team encourages ingenuity and innovation in all areas while maintaining an energetic and dynamic work culture. We are looking for a motivated individual who could lead the quality effort for our test team. A successful candidate will drive overall automation infrastructure development and maintenance, related tools, web services, and integrations. Additionally, work with cross functional, local, and remote teams to align test planning, automated test execution, and reporting for various areas of responsibility. The candidate must be highly technical individual possessing excellent organization, communication, collaboration, and problem solving skills, as well as result oriented with a drive to make a difference!", "description": "You will be responsible for coming up with test strategies for automated performance testing across multiple platforms. Maintain existing automated test infrastructure, as well as build new integrations and tools. You will be working closely with several cross functional teams to understand automated performance testing requirements to scope, develop, execute, and scale these in very large complex cross platform h/w deployments. We are looking for a passionate individual, with creativity and initiative to help us proactively uncover issues, and propose ideas for improvement - to join, lead, and grow an amazing team.", "key_qualifications": "2+ years experience in a team lead/manager role\n3+ years of professional experience with Python or equivalent scripting language\n5+ years of hands on QE, test automation frameworks, CI/CD tools, cloud and container management technologies\nStrong verbal and written communication skills\nExperience with recruiting, hiring and build high-performing engineering teams\nExperience with performance testing is preferred", "preferred_qualifications": "", "education_experience": "B.S. in Engineering, Computer Science or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $164,200 and $247,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551820"}