{"title": "Software Engineer - Full Stack, Employee Experience & Productivity", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers. We are Corporate Systems team within IS&T seeking a Full Stack Senior Engineer to build enterprise scale applications and platforms.", "description": "Develop and maintain highly reliable, scalable, and maintainable enterprise applications & common platforms that can match Apple volumes. Evangelize core services, platforms, and tools for wider adoption within the company. Collaborate with multiple multi-functional teams and work on solutions which has larger impact on Apple business. Deliver solutions that can keep up with a rapidly evolving product in a timely fashion. Is curious, obsess over the customer experience, and has a bias for action.", "key_qualifications": "3+ years of experience developing, testing, and maintaining large-data, enterprise scale software systems. 3+ years of software development experience with Java and Python. Experience designing, building, and maintaining RESTful APIs and web services. Education: Bachelors or Master in Computer Science.", "preferred_qualifications": "Applied Machine Learning — using machine learning to improve product features or user experience. Generative AI — using GenAI technologies to improve product features or user experience. Prior experience working with large-data ETL pipelines and analysis tools such as Snowflake, Trino, SingleStore. Experience with cloud platforms like AWS or GCP. Able to design, develop and maintain high-quality web applications. Applicable knowledge of web libraries and frameworks like AngularJS, React, Express. Tech leadership, ability to work independently, demonstrate initiative, and mentor & grow more junior talent.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556693"}