{"title": "Cellular Protocol Development Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Come join the Cellular and Connectivity team at Apple. Contribute to a product that is redefining mobile communications. Build groundbreaking technology for 5G. Transform the way people keep up with the world and work with the people who help keep users connected 24/7!", "description": "The Cellular and Connectivity Team is looking for someone with a combination of strong embedded programming skills and a creative, user-focused mindset. You will be an outstanding teammate who can collaborate with engineers in several technical areas that have developed cellular connectivity solutions for the iPhone, Watch, and iPad. You should be able to thrive in a fast-paced environment with rapidly changing priorities. Responsibilities: - Drive the design and development of the various components of LTE and 5G NR protocol stack - Write software based on 3GPP specifications and develop features using the unparalleled access to iOS and various other platform components to provide the ultimate connectivity experience - Collaborate with cross-functional teams to capture requirements, understand dependencies, define architecture, and implement solutions to well-defined projects - Work with design and client-side teams to ensure a phenomenal user experience.", "key_qualifications": "N/A", "preferred_qualifications": "C Programming, Experience in Wireless software development especially in Cellular Protocols And RRC is a strong plus.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560674"}