{"title": "Apple Product Verifications Fraud Investigator (Japanese & English)", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have imagined — and now can’t imagine living without. Are you excited by the idea of making a real impact? If so, a career with Apple might be your dream job! Just be prepared to dream big! As an Apple Product Verification Fraud Investigator, you will be working in a fast-paced environment and are responsible for answering questions and providing timely, reliable and accurate assistance to Apple’s internal and external customers. This position is located onsite at the Apple campus in Singapore - Ang Mo Kio.", "description": "We provide administrative support to Consumer, Business and Education Customers, research, investigate and provide high-quality resolutions to Customer queries, assist in reporting technical issues and keeping partners informed. We are able to handle pressure and multi-task whenever necessary, while prioritizing tasks. We consider deadlines and targets as challenges. Proper planning, organizing and controlling will help us to reach our goals. We provide feedback to the Business on primary escalation drivers and emerging issues that drive Customer Dissatisfaction. We analyze and investigate complex cases to help Apple prevent fraud.", "key_qualifications": "Outstanding communication skills, including excellent written, verbal and reading Japanese and English. Extraordinary attention to detail in case management, follow-up and follow-through. Target oriented and can deliver results on time. Strong organizational and multitasking skills. Creative problem-solving and analytical skills. Comfortable working in a queue-based environment. Strong interpersonal skills with key strengths in professional collaboration. Resourcefulness and effective research skills. Able to see opportunities for process improvement and develop solutions that target root causes. Be flexible - willing to take on new roles, assignments and responsibilities as needed. Resilience to work in a dynamic environment to achieve time commitments. Ability to work between the hours of 7:00am to 9:00pm within a 7-day work week, including holidays, with additional flexibility during high volume times of the year", "preferred_qualifications": "Basic SAP knowledge preferred. Motivated to develop the role and add to the success of our organization. Current or previous experience with Apple Product Verification preferred. Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553616"}