{"title": "AIML - Machine Learning Engineer/Scientist, Siri Information Intelligence", "summary": "The AIML Information Intelligence team is creating groundbreaking technology for artificial intelligence, machine learning and natural language processing! The features we create are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Our universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. We also develop state-of-the-art generative AI technologies based on Large Language Model to power innovative features in both Apple’s devices and services on the cloud. As part of this group, you will be doing large scale machine learning and deep learning to improve Query Understanding and Ranking of search and developing fundamental building blocks needed for Artificial Intelligence. This involves developing sophisticated machine learning models, using word embeddings and deep learning to understand the quality of matches, online learning to react quickly to change, natural language processing to understand queries, taking advantage of petabytes of data and signals from millions of users and combining information from multiple sources to provide the user with results that best satisfies their intent and information seeking needs. You will also work with researchers and data scientists to develop, fine-tune, and evaluate domain specific Large Language Models for various tasks and applications in Apple’s AI powered products, also conduct applied research to transfer the cutting edge research in generative AI to production ready technologies.", "description": "As a member of our fast-paced group, you’ll have the unique and rewarding opportunity to shape upcoming products from Apple. We are looking for people with excellent applied machine learning, NLP experience and solid engineering skills in creating outstanding search and NLP services. This role will have the following responsibilities: Analyzing search ranking and relevance requirements, issues and opportunities, Developing, fine-tuning, and evaluating domain specific Large Language Models for various tasks and applications in Apple’s AI powered products, Conducting applied research to transfer the cutting edge research in generative AI to production ready technologies, Understanding product requirements, translate them into modeling tasks and engineering tasks, Building machine learned models for search relevance, ranking and query understanding problems, Integrating search functions into Apple products, such as Siri, Spotlight, Safari, Messages, Lookup, etc., Building end-to-end production system including query understanding and ranking to power search, Utilizing Spark, Hadoop MapReduce, Hive, Impala to perform distributed data processing", "key_qualifications": "Experience in machine learning, deep learning, information retrieval, natural language processing or data mining, Experience of prompt engineering, fine-tuning, evaluating, and developing data collection/annotation/management tooling for LLMs., Proficiency in one of following languages: Python, Go, Java, C++, Excellent knowledge and good practical skills in major machine learning algorithms, Excellent data analytical skills, Good interpersonal skills and team player", "preferred_qualifications": "", "education_experience": "MS or PhD in Computer Science, Artificial Intelligence, Machine Learning, Information Retrieval, Data Science or related field", "additional_requirements": "Nice to have: Experience with Large Scale Data-Mining and/or Machine learning are a plus, Experience Web Crawling is a plus, Experience with ML and LLM model inference optimization is a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503445"}