{"title": "Algorithm Software Engineer - Location Technologies", "summary": "The technologies within Apple’s CoreLocation are fundamental in enabling location-aware experiences to users across all platforms. Our customers rely on fast and accurate location for many of their most important daily needs. As a Software-Algo Engineer pursuing special projects within the Location Team, you will be part of an exciting team investigating new technologies which transform the lives of our customers. You will work with different RF solutions, such as WiFi / Bluetooth / RADAR systems, to provide outstanding user experience for Apple users. If you are a motivated engineer, passionate about SW development and about implementing elaborated systems and algorithms, we may be the team for you.", "description": "Here at Apple, we build devices and services that enrich our customers’ lives. In the location technologies group, we help people connect: with each other and with our planet. We reach more than a billion people. We help them find their way, and we help them find each other. Every single day, our customers use location services, so what we do and how we do it makes a difference. Join our team, and we’ll help you do the best work of your life. Join a team which designs, implements, and powers brand-new technologies and services on the world's fastest-growing mobile development platform. We are looking for a highly-motivated and creative Engineer with a strong background in both SW and algorithm/system-development to help develop new technologies for special projects on the location services team. Our special projects target innovative new signals and technologies to enhance location-aware user experiences. Architect and implement production software systems for new technologies, fusing them with existing capabilities, and bringing new experiences to our users. Collaborate with developers on other iOS teams to architect the full iOS solution. Design and implement full-stack technologies integrating wireless technologies to solve real-world problems. Participate in brainstorming and evaluating new technologies as iOS continues to evolve.", "key_qualifications": "Experience with systems that incorporate multiple hardware modules (sensors, processors, etc) and various system states, Strong software generalist and experience with object oriented languages, Excellent collaboration and communication skills, Know how to debug complex systems, A passion for building client facing experiences, Experience with data analysis and results dashboards, DSP/Machine learning experience - a Plus", "preferred_qualifications": "", "education_experience": "BSc / MSc in CS/EE", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530776"}