{"title": "Senior Software Engineer, Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy.", "description": "Advertiser Services is a diverse, global, agile engineering team that moves smart and fast by consuming and optimizing readily-available technology, collaborating to improve and scale capabilities across businesses and use cases, and sharing our own innovative solutions so everyone can benefit. We are not constrained by organization structure and offer flexibility to work on a variety of backend systems, and we have fun doing it!\n\nYou will:\n\n* Build the foundational pieces of the next generation of Apple’s Ad Platforms\n* Work on a platform with challenging scale requirements.\n* Design and implement performant data pipelines.\n* Implement low latency, highly-available, high volume systems in a cloud environment.\n* Engineer secure and scalable distributed data processing systems for campaign management.", "key_qualifications": "8+ years of professional software development experience.\nClear and effective communicator, and enjoy collaborative problem solving.\nExperienced working on a shared codebase that supports web-scale, critical applications and appreciate the attention to detail that it requires.\nDemonstrated ability to implement and extend highly performant, resilient, reliable, and maintainable data pipelines and online services.\nCare deeply about software development practices and code quality; you are an eager advocate for standard methodologies.\nExperience with Spark, Hadoop, HIVE, Kafka, Cassandra or other distributed systems.\nDeep expertise in Python, Java, Scala, SQL, and/or other relevant languages and frameworks\nExpertise in NoSQL datastores ( e.g Cassandra or DynamoDB )\nExperience working in cloud environments and are familiar with object stores, and other common cloud-native data storage and processing frameworks.\nAbility to take requirements from design through to implementation both independently and with larger teams.\nUnderstand modern data engineering approaches, stay on top of developments, and are aware of what leading players are doing.\nExperience working in CI/CD environments.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548284"}