{"title": "Associate Creative Director, Experience Strategy", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.\n\nAs Experience Strategists we help define and design class leading products and services across Apple commerce and marketing platforms. We gather insights and create the strategy which informs the products and services that the team develops by working cross functionally with a wide range of internal partners. We work throughout the product development process to deliver compelling, easy to use products, and we are a point of contact for instilling a user-centered approach to product and service design.", "description": "The Associate Creative Director (ACD) of Experience Strategy leads efforts across multiple digital touch-points on Apple commerce platforms such as the Apple Store App, in-store experiences, and commerce related web platforms. They lead, guide, and run project activities to ensure a user-centered and design thinking approach is carried through. The ACD is an expert on the customer and translates insights into focused artifacts that lead to meaningful product and web design. Artifacts include insight articulation, customer journeys, opportunity mapping, and other frameworks. \n\nThis leader presents work to internal teams and executives, clearly articulating design opportunities and accompanying design rationale. They collaborate and build relationships with cross-functional teams such as business, product, engineering, production, and product marketing. They also lead the team by managing direct reports and helping run a discipline by improving methodologies, defining artifacts and looking for ways to improve the work and the process.", "key_qualifications": "", "preferred_qualifications": "At least 7 years of experience in design strategy, information architecture and/or experience design.\nComfortable with ambiguous problems and proactively looks for ways to develop a clear direction. Works closely with other subject area leads to create clarity for the team to align and deliver.\nLed large projects that solved difficult customer problems through new and provocative design work.\nExperienced at planning and leading workshops to gain, synthesize, and clarify information from creative and business partners.\nUses a range of user-centered tools such journey maps, mindsets, insight mining, and opportunity development to advance work.\nAbility to plan, design, articulate findings and implement research that seeks to understand user needs, pain points, and potential opportunities to enhance their experience; communicated through compelling written and verbal presentations.\nPassion for an iterative design process, inspired by group critique, and gets excited about sharing their POV to design teams and beyond.\nAchieves results by communicating a vision, setting priorities and developing and implementing plans that arrive at the desired outcome for the team and organization.\nSeeks to understand different perspectives and cultures and contributes to a work climate where differences are valued and supported.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $179,000 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555799"}