{"title": "PHY Systems Engineer", "summary": "We are looking for an experienced PHY Systems Engineer with a deep understanding of wireless technology. In this role, you’ll be a key member of the systems engineering team working on feature design and development, validation, and characterization of wireless modem systems.", "description": "- Design and simulate innovative physical layer wireless communication algorithms. - Implement system models and perform detailed performance investigations to support with performance sign-off and enable HW/FW implementation. - Collaborate with digital designers and firmware developers to realize algorithms with power and area efficient implementation. - Document systems design, and interface sequence flows. - Work on silicon bring up to help validate systems algorithms and design. - Translate learnings from field/lab to algorithm design and improvements.", "key_qualifications": "In-depth knowledge of wireless communication system with experience in PHY layer modeling, performance simulations, and fixed-point design fundamentals. Experience in wireless design of 3GPP compliant modems (such as 5G-NR, 4G LTE, 3G/2G) highly desired. Experience with millimeter wave technologies is a plus. Deep understanding of communication theory & signal processing related algorithms design (e.g. digital filtering, RF impairment mitigation, gain/frequency control loops, equalization, coding theory) will be crucial in this role. Strong analytical (linear algebra, random processes, detection and estimation, sampled data systems etc.), as well as, documentation skills. Hands-on experience with design validation, unit and lab testing and characterization is a plus. Experience with bringing up real silicon in lab and familiarity with lab equipments such signal generators, spectrum analyzers, will be an additional plus. Full-stack system level understanding and ability to contribute to multi-disciplinary processes of RF/PHY/L1/L2 a plus.", "preferred_qualifications": "", "education_experience": "BS with 3+years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542288"}