{"title": "Senior Facilities Manager", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen and we do this in service to all Apple employees and customers. Our team is a diverse and forward-thinking group that manages Apple’s workplaces and workplace service. We develop and run Apple’s global real estate portfolio, lead all related capital construction projects, providing outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world! Do you love thinking analytically? Join us, and you’ll have a significant role in continuing Apple’s legacy of efficiency and success.", "description": "We are seeking a high-energy candidate with validated experience in facilities management and a demonstrated focus in operating buildings as outstanding workplaces, delivering high quality results at the best value. The Senior Facilities Manager will be responsible for supervising a team of seasoned professionals and multiple organizations to provide top management and support of all Apple headquarters corporate and research and development (R&D) facilities.", "key_qualifications": " ", "preferred_qualifications": "Deep expertise in the planning, scheduling, budgeting, resourcing, and executing of all technical services required to maintain and improve a large real estate portfolio. This includes mechanical, electrical, plumbing, controls, fire-alarm, landscaping, flooring, lighting, reception, furniture, and warehousing; Excellent leadership, communication, and supervisory skills, including experience working with all levels of an organization and ability to handle customer service issues involving employees in a professional and positive manner; Proven experience in managing and optimizing both operational and capital expenditure budgets, ensuring financial efficiency and alignment with organizational goals; Demonstrated 24/7 accountability and management of facilities, ensuring continuous operational excellence, timely response to emergencies, and proactive maintenance strategies; Exceptional keynote and public speaking skills, with a proven ability to engage, inform, and inspire large audiences both internally and externally; Experienced in crisis management and emergency response planning, ensuring readiness and effective action in unforeseen situations; Demonstrated ability to create, critique, and oversee preventative and scheduled maintenance programs; Demonstrated success in employee development and mentoring including fostering collaboration, continuous performance feedback and motivating the team to develop and apply tools for more efficient operations and improved customer service;", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $211,800 and $317,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553535"}