{"title": "Electrical Engineer - Camera Hardware", "summary": "Do you love taking on big challenges that require exceptionally creative solutions? Do you deeply understand how an incredible camera experience should work? As part of our Camera Technologies group, you’ll help design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems, from sensor to lens. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras.\n\nThe Camera Hardware Engineering group is responsible for the design, development, and innovation of camera hardware for all related Apple products. Our target is to deliver superior camera hardware to enable best-in-class camera user experience.\n\nWe are looking for an enthusiastic, high energy individual who can help us with tomorrow’s challenges.", "description": "-  Investigate forward-looking technology, feature and silicon for camera hardware.\n\n-  Schematic creation, including image sensor, low-noise power supply, image stabilization circuit, and high-speed interfaces, etc.\n\n-  Supervise and review layout design for substrate, flex and PCB.\n\n-  Interact with product team to ensure good implementation for system integration.\n\n-  Close collaboration with peer teams for camera performance optimization.", "key_qualifications": "Knowledge and experience in electronic design, including component selection, schematic creation, and hands on with mainstream tool-chains.\nBroad experience with both analog and digital circuits, e.g. small signal conditioning, low noise power supply, Gbps high-speed and embedded control interfaces.\nKnowledge of layout strategies for material selection, stack-up planning, EMI minimization, signal integrity and noise suppression.\nComfort and ability to use all types of electronic test equipments.\nCapable of managing different projects in parallel.\nGreat interpersonal skills and comfortable to work in a team environment.", "preferred_qualifications": "", "education_experience": "Bachelor's degree.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552142"}