{"title": "Product Manager - Recommendation Systems", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content from the world’s best journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with passionate fans. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone. We're looking for a world-class Product Manager to orchestrate the strategy for our privacy-preserving ads recommendation systems. As the Product Manager, you'll be responsible for ensuring that our platform connects users of Apple products with relevant and impactful advertisements, and conversely, for ensuring our platform helps advertisers grow their businesses efficiently and sustainably by connecting their brands with valuable customers.", "description": "-  Act as product owner for the ML models underlying our privacy-preserving recommendation systems\n-  Define success criteria and product requirements for our models by cultivating a deep understanding of the relationship between our models and business / customer outcomes\n-  Formulate clear and measurable hypotheses for how to improve success metrics, work with engineering and data science teams to test hypotheses, and make decisions based on experiment results\n-  Synthesize insights from data analysis, customer calls, and sales feedback into clear and concise opportunity areas and develop short-term and long-term roadmaps around these opportunity areas\n-  Collaborate with engineering, data science, and research teams to develop, launch, evaluate, and improve recommendation system models\n-  Collaborate with privacy, engineering, and business teams to develop novel privacy-preserving strategies for collecting information for use in our model\n-  Produce high-quality 1-pagers, product requirements, and presentations, to convey opportunity areas, experiment results, recommendations, and product strategy to cross-functional teams and leadership on a regular basis", "key_qualifications": "2+ years of Product Management experience, Proven experience defining measurable and interpretable success metrics, and rallying cross-functional teams to achieve them, Customer-centric mindset, who can define and prioritize use cases and customer objectives, Consistent track record of collaborating with engineering and data science teams to develop, launch, and improve ML models, Proficiency in SQL, and prior experience analyzing sophisticated, large-scale data sets to form hypotheses, evaluate experiment results, rationalize product opportunities, and measure success, Outstanding written and verbal communication skills, with the ability to clearly and concisely convey results and opportunity areas to cross-functional teams and leadership, Proactive, curious, and excels in a fast-paced environment with a high degree of ownership and accountability, A plus if you have experience working on recommendation systems, or another consumer product that uses ML, and especially in digital advertising. But not a requirement!", "preferred_qualifications": "", "education_experience": "BS or MS in Computer Science, Statistics, Math, Operations Research, Economics or related areas. Otherwise requires equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200522867"}