{"title": "Firmware Build and Release Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of a best-in-class modem team, you’ll craft sophisticated innovative embedded firmware that delivers more performance in our products than ever before! You’ll work across teams to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world.", "description": "Here, you'll accomplish firmware work for various projects, and support firmware deliverables for bring-up activities and factory camps across pre-silicon to post-silicon. Fix and resolve sophisticated software integration and build issues from Pre-int to post-processing. Coordinate multi-functionally and align on the dependencies, requirements, and release readiness, ensuring delivery completion, consistency, and high code quality, to meet achievements and branch-out readiness criteria. Configure and implement tooling for CI automation, triage and debug of Pre-int issues. Identify useful new technologies that can improve efficiency and reliability and incorporate them into build release workflows, development tools, and processes.", "key_qualifications": "Experience with Git, Gerrit, GitLab, CI/CD, make, cmake, xtensa compiler; Deep understanding of continuous integration and delivery workflow, as well as branching strategies; Experience with Jenkins pipelines and Groovy/Shell/Python scripting; Experience with Python code development and/or Tableau is a plus; Excellent communication and collaboration skills cross-team and projects; Excellent problem-solving and build debugging skills, continuous improvement, and optimization ability on the delivery toolchain; BS and 3+ years of relevant industry experience is required. A bachelor’s degree in electrical engineering or computer science is and/or MSEE is preferred.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience is required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200520139"}