{"title": "Engineering Project Manager - Perception Systems", "summary": "Apple’s Audio Media Technologies provides the media, graphics, and audio software foundation across all of Apple's innovative products, from iPhone, iPad, and Apple Watch, to Apple TV, iTunes, HomePod, Beats, and Mac. The Connected Media team (AirPlay/CarPlay) is looking for an Engineering Program Manager to lead software projects in this technology area. You will need strong system software fundamentals, excellent communication skills, and a desire to work with an amazing team to develop ground-breaking products. This role includes working with our engineering teams to define, schedule, track and communicate status of all work taking place within those teams. Facilitating communication between groups is critical. If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!", "description": "You will work with our engineering and design teams to define new features and drive and track progress. You need to be able to clearly communicate requirements and status at both the engineering and executive level. And enjoy challenging and innovative projects in a fast-paced environment. This job requires extraordinary communication skills to work cross-functionally with other organizations within Apple. Understanding of software development and a strong interest in user experience is a requirement.", "key_qualifications": "5+ years experience leading complex, multi-functional software projects, Self-motivated with demonstrated creative and critical thinking capabilities, Able to pick up new technology quickly, Ability to filter and distill relevant information for the right audience, Exceptional verbal and written communication skills and ability to influence up, down and cross functionally, Ideal for a self-starter who is highly organized and has shown success in establishing relationships", "preferred_qualifications": "", "education_experience": "BS/MS EE/CS/CE or equivalent", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548300"}