{"title": "UI Engineer, ASE Web Commerce", "summary": "The Apple Services Engineering UI team seeks a motivated engineer adept in modern web application technologies and associated tooling, frameworks, and libraries. Attention to detail and a commitment to delivering high-quality, stable outcomes are paramount. Successful candidates will exhibit self-starting abilities to tackle significant challenges by breaking them down into manageable tasks. Collaboration skills, systems thinking, and a focus on scalability and continuity are essential. Thriving on innovation and tackling complex problems, you'll find satisfaction in pushing boundaries and devising inventive solutions. If you're ready to join an elite engineering team, this position awaits your expertise.", "description": "Develop and maintain web applications using HTML/CSS, JavaScript/TypeScript, and modern frameworks. Implement and optimize component libraries, particularly with Stencil.js. Utilize Node.js, NPM, Webpack, Babel, and other toolchains to streamline development processes. Ensure code quality and reliability through testing frameworks such as Jest, Cypress, and QUnit. Apply best practices in accessibility, performance optimization, and production monitoring. Collaborate with designers, product managers, and other engineers to deliver high-quality features. Stay up-to-date with the latest web development trends and technologies. Communicate effectively within the team and with stakeholders", "key_qualifications": " ", "preferred_qualifications": "3 years of prior work experience in front end development", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559304"}