{"title": "BI Tools Platform Engineer", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day-to-day basis? If so, Apple's Global Business Intelligence (GBI) team is seeking an experienced Tableau Platform Engineer to build high quality, scalable and resilient distributed systems that power apple's analytics platform. Apple's Enterprise Data warehouse landscape caters to a wide variety of real-time, near real-time and batch analytical solutions. These solutions are integral part of business functions like Sales, Operations, Finance, AppleCare, Marketing and Internet Services, enabling business drivers to make critical decisions. We demonstrate a diverse technology stacks for data analytics and visualization. Developing and maintaining these BI tools are core part of our daily job.", "description": "As a BI Tools Platform Engineer, you will be responsible for managing multiple non-Prod environments on Hybrid cloud Platforms. The candidate will need to manage BI application deployments, automate the patching / upgrades and ensure the reliability and resiliency of the platform. Collaborate with product vendors to investigate, resolve the product-related issues. And also administer Tableau platform, perform platform engineering, release management, reliability engineering, infrastructure planning, health checks and alerting.", "key_qualifications": "4+ years of Experience with Tableau, experience administering Tableau server\nExperience with programming in Python and Java\nExperience with public cloud platforms like AWS or GCP. Experience in installing and configuring BI tools with HA setup on various platforms including hybrid cloud\nKnowledge of other Business intelligence (BI) platforms like ThoughtSpot and Business Objects is a plus\nIn-depth understanding of authentication and authorization aspects of Tableau in addition to setting up federated SSO (SAML) for user access is a plus\nExperience in capacity planning, utilization reviews and performance monitoring/tuning is a plus\nExposure on various database management systems, preferably SingleStore and Snowflakes along with advanced SQL skills\nHands-on network configuration involving load balancers, firewalls, ACLs and TCP/IP core components (http, dns, routing, etc) is a plus\nDemonstrate a strong understanding of the intersection between analytics and engineering with a proactive approach to reusable solutions to improve efficiency and time to insight\nStrong analytical and interpersonal skills. Should be dedicated, highly motivated and ability to learn quick", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree or Equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534730"}