{"title": "Payments Software Engineer, Retail Engineering", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "As a Payments Software Engineer on our team, you will help build a next-generation payment platform for Apple Retail. You will also be responsible for developing and integrating the payment application with payment terminals and gateways and certifying the solution with the acquiring banks. You will be working with business partners, store personnel, banking partners, and cross-functional teams within Apple to develop software, controls, and processes for payment processing. In this role, you will get the opportunity to gain experience with global payment solutions in the retail industry. You will increase your expertise in the payment industry with hands-on experience with devices, protocols, and processes and learn from a team of knowledgeable payment experts.", "key_qualifications": "At least 3 years of industry experience with Java / Swift / Python\nChip & PIN technologies (especially EMV L2, Contactless kernels)\nKnowledge of Bank messaging specifications (ISO-8583)\nKnowledge of online PIN protocols (ANSI x9.24 / DUKPT / Master Session)\nPCI compliance and Card security, Software security Standards\nOracle, MySQL, Cassandra\nHTTP(S), TCP/IP protocols, Bluetooth, REST, SOAP architecture\nGithub / Maven / Gradle build tool and D2P processes", "preferred_qualifications": "Strong communication skills and experience in communication with payment vendors across the globe.\nKnowledge of performance improvements, multithreading, and event-driven processing methods is necessary.\nAbility to learn and apply new technologies quickly and deliver results on time with high quality\neCommerce / Banking / Retail industry experience\nDemonstrating knowledge of Mobile App developments, Interacting with the Peripherals over Bluetooth, Cryptography, Device Drivers, and MFi certification.\nBachelors or Masters in Computer Science", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559068"}