{"title": "CPU Power Architect - Platform Architecture", "summary": "At Apple, we believe new ideas have a way of becoming exceptional products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Apple’s CPU Platform Architecture group provides the high-level definition for high-performance, low power microprocessors that power iPhone, iPad, and Mac Apple Silicon. We are looking for a highly motivated and experienced CPU power architect to contribute to world-class power management solutions.", "description": "As a CPU Power Architect, you will work independently on developing new capabilities for power estimation using advanced learning algorithms. You will drive characterization of data in both pre-silicon and post silicon environments, perform analysis and develop models for predictions, perform validation of the data and bring the models to production. Additionally, you will work with design and post silicon teams to improve the silicon based inline power estimation hardware and help improve overall accuracy. You will also work with hardware and software teams across Apple to identify opportunities to improve CPU power management with a goal of improved power efficiency and responsiveness. The responsibilities can include ownership of high-level specifications, identifying and executing power and thermal experiments, developing and maintaining both simulation and analytical models for power management systems. Initiatives can include dynamic voltage/frequency scaling (DVFS/DVFM), voltage margin recovery strategies, advanced thermal management, power state definition, di/dt mitigation strategies, and other strategies for improved power integrity.", "key_qualifications": "", "preferred_qualifications": "MS or PhD in Electrical or Computer Engineering or Computer Science, 15+ years of relevant industry experience, Comfortable in an environment of uncertainty and able to work through ambiguities to set direction, Communication, influence and negotiations skills, Ability to code in C and C++, Knowledge of scripting languages such as Perl, Python, Knowledge of common power benchmarks and workloads", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558923"}