{"title": "Technical Program Manager, Beats Operations", "summary": "At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish! The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here! We have an opportunity for a Technical Program Manager. In this highly visible role, you will lead a team of engineers (DFx, DFm, test, SQE, PQE, etc) and others in support of new product development as well as sustaining operations and ensuring the contract manufacturer readiness for extremely high volume production. You will bring your knack and thirst to drive all technical operational issues related to SMT and system integration processes to ensure effective closure of all issues to enable operational success of the entire new product introduction (NPI) cycle and into the mass production phase.", "description": "As a Technical Program Manager, you are the technical lead for manufacturing operations at multiple vendors and sites. Other responsibilities include: - Driving contract manufacturer preparation for pre-production builds. - Production process development, documentation, optimization and validation. - Development and implementation of new technologies to enhance production quality, capacity and efficiency. - Sets standard practices and independently determines impact to design approaches and parameters to the final product. - Provides direction, guidance and resources to other engineering groups and project leaders as well as factory technicians. - Act as lead engineer on a variety of projects and participates in the project planning of major sub-projects. - Performs assignments in several of the below manufacturing engineering functions: - Design for Manufacturability - Provide early and ongoing manufacturing involvement to ensure manufacturability of new products. - Product Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering with respect to technically complex testing methods, procedures and failure analysis. - Process Engineering - Designs and develops technically complex processes to improve quality and efficiency. - Failure/Data Analysis - Plans, develops and implements technically complex procedures for the testing and evaluation of soon to be released products. Specifies test to be performed, compiles data and makes recommendations for product design changes and final assembly standards. This will include the use of Design of Experiments (DOE) and statistical analysis using Six Sigma principles. - Provide regular VP level communication of technical health of program.", "key_qualifications": "Demonstrated ability in engineering and manufacturing for 5 years and above, ideally 7 to 10 years of experience in Design and Manufacturing Relevant experience in introducing products into manufacturing, or high volume production a large plus. Excellent project management skills, experience working in a matrix organization. Direct experience leading any of the following functional engineering teams a plus (ME, EE, TE, DFX, Etc). Proven bottom line project management experience. (Planning, Cost, & Delivery). Experience working with International OEM partners. Ability to travel up to 40%. Communicate effectively in a worldwide environment. NPI and Manufacturing Operations experience desired. The candidate must have a proven working knowledge of DFM & DFX Demonstrated track record of cost reduction, project management and engineering design required. Required to understand and tolerance stack ups for assemblies and part level. Solid understanding of pneumatics, servo motors, PLC and PC-based control systems a plus. JMP, Minitab & Six Sigma experience a plus.", "preferred_qualifications": "", "education_experience": "BS/MS degree in Mechanical or Electrical Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540547"}