{"title": "Senior SoC Firmware Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly.\n\nResponsible for crafting and implementing embedded software for System on a Chip (SoC) bring up and test. You will work closely with the Software Engineering team ensuring the quality of their firmware for manufacturability.", "description": "As a Senior SoC Firmware Engineer, the individual will be a core member of a Wireless SoC firmware team, with emphasis on hardware and system bring-up, drivers, network stack and support of other teams interacting within a Wireless SoC group.\n-  Work closely with product SW team to provide system-level API and firmware functionality to meet product requirements\n-  Work closely with product test and protocol stack teams to resolve any issues arising as part of the product and interoperability testing\n-  Implement new product features as part of the development of wireless protocol stacks, device drivers, and diagnostics\n-  Provide support to the SoC design team and assist internal SW/HW integration and initial chip and product bring-up efforts", "key_qualifications": "Strong background in embedded software development using C and assembly languages, familiarity with ARM CPUs and RTOS.\nExperience in performing low-level drivers and HW bring-up and validation on FPGA and SoC Silicon hardware platform, using test tools, and interacting with HW and SoC design teams.\nExperience writing scripts in languages such as Python, Perl, or Tcl.\nExperience implementing diagnostics, manufacturing tests, and protocol compliance test software.\nExperience with power optimization implementation and related debugging in firmware is a plus.\nExperience with industry standards for wireless communications such as Bluetooth, WLAN, or Zigbee, is also desirable.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience. MSEE and PhD is preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200521451"}