{"title": "Senior Infrastructure Software Engineer", "summary": "We are building and supporting new and existing critical infrastructural systems and frameworks which provide and support services like structured and unstructured storage, caching, queueing, searching, and much more at hyperscale. These form the platform upon which many iCloud and other backend systems at Apple are built. The team is responsible for the next generation platform that will power Apple’s infrastructural services. These services operate at extremely large scale and store exabytes of data. The platform will support a variety of services based on open-source software, such as Kubernetes, Cassandra, Zookeeper, Kafka, Redis, etc, alongside internally developed services. We are looking for a strong, enthusiastic developer to join as a member of this group. This person will have a tremendous amount of individual responsibility and influence over the direction the core platform of many critical Apple internet services takes for years to come. You are someone with ideas and real passion for software delivered as a service to improve reuse, efficiency, and simplicity. This engineer’s work will impact hundreds of millions of users and be essential to the success of some of the most visible current and future Apple features.", "description": "Successful candidates in this role will leverage their skills and experience to deliver services and features aimed at solving challenges pertaining to large-scale infrastructure management, including delivery of code, processes and end-to-end solutions. The role involves creating new service solutions & evolving existing designs together with customer and partner teams, developing & operating highly concurrent GoLang services with goal of ensuring high-availability and performance in production environments, as well as ensuring successful adoption of the newly developed features across platform and service teams. - Experience with large scale server provisioning and maintenance(Open Stack Ironic, Metal3, MAAS, xCat, Netbox, Tinkerbell)   - Experience with development within Kubernetes ecosystem, including operator frame work, controllers and CRDs - Experience with UIframeworks such as React, Angular or JQuery   - Some exposure to hardware bootstrap and associated security (PXE, BIOS, TPM, secure boot, trusted computing)   - Some exposure to structured or unstructured storage and caching.   - Some exposure to automating operations processes via services and tools.   - Some exposure to configuration management and fleet orchestration via Puppet, Chef, Ansible, or others.   - Some exposure to cloud services (AWSS3/EC2/CloudFront/Steps...or equivalent).", "key_qualifications": "5+ years of a successful track record and proven experience as a backend internet services software developer. Deep understanding of multithreading concepts and design of highly concurrent applications. Understanding of distributed system concepts including: the CAP Theorem, micro-services, and the TwelveFactorApp. Knowledge of SDLC, including continuous integration, testing methodologies, TDD and agile development methodologies. Proficiency in one or more high-level programming languages like Golang (preferred), Java, Python, Ruby or equivalent. Understanding of base internet infrastructure services including DNS, DHCP, LDAP, server virtualization, server monitoring", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science, Computer Engineering or related field or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548561"}