{"title": "Test & Instrumentation Engineering Program Manager", "summary": "In this critical, highly visible role, you will manage projects involving the design, integration and launch of innovative hardware technologies for world-renowned Apple products including iPad, iPhone, and MacBook. You will play a key part in providing Apple customers with the best user-experience in the industry by driving the development and deployment of next-generation display, touch, optical and other sensing technologies! The Hardware Technology team features a collaborative environment with creative, sensible people and groundbreaking technologies. Engineering excellence is expected and encouraged. Come, join us in crafting solutions the world doesn’t know of yet!", "description": "Lead multi-functional teams including Electrical, Mechanical, Test and Software Engineering to deliver innovative instrumentation and test solutions. Define the plan/schedule and manage instrumentation and test through execution. Deliver presentations and drive the decision-making process. Ensure tight inter-team coordination and communication. Manage test development budgets and builds. Manage multiple test suppliers and vendors in preparation for execution of engineering development builds. Effectively and consistently communicate overall program status to multi-functional partners and leaderships. Resolve conflicts and identify inter-dependencies and issues quickly and efficiently. Improve the system: look for patterns, offer standard methodologies and implement changes.", "key_qualifications": "", "preferred_qualifications": "Tester development background\nKnowledge of Display, Touch, and/or Sensor technologies\nFamiliar with product development cycle (proof-of-concept to mass production)\nClear communication\nProven track record in teamwork, cross-functional collaboration, multi-tasking", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559323"}