{"title": "UX Designer, Enterprise Techology Services, Early Career", "summary": "Do you have a passion for crafting elegant solutions to even the most complex software challenges? As a member of the Apps and Frameworks group, you’ll contribute to one of the most essential parts of how customers experience Apple products and services. You’ll help build, design, or implement every Apple app, from built-in ones, such as Calendar and Maps, productivity apps like Keynote and Pages, and media apps like Final Cut Pro and Logic Pro. You and your team will also build crucial frameworks, like UIKit and Metal, for third-party developers. For each app, we focus on the person who will use it. Join us and help make Apple products and services feel so intuitive and simple that customers will feel they were built just for them.\n\nDo you love working on challenges that no one has solved yet? Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join our team, we work in a startup-like environment and you will be part of every stage of development working multi-functionally with user interface designers, business, frontline teams, development engineers, architects, and operations from the concept phase to deployment. The team is focused on rapid application development, research, and innovation, creating new products and solutions.\n\nApple’s global ETS eBusiness team seeks an outstanding UX Designer to create simple and impactful user interfaces. This is an excellent opportunity for an ambitious, hardworking, result-oriented person to provide integration solutions using various technology stacks and platforms. Enjoy the benefits of working in a fast-growing business where you are encouraged to \"Think Different\" and where your efforts play a key role in the success of Apple's business.", "description": "You will be a key player in designing human interfaces for many critical enterprise solutions for our users and B2B Partners. From brainstorming through implementation, you will be part of a ground-up innovation team who are passionate about human interface design and building data-intensive enterprise-scale applications. You will work closely with the other designers on the team, software engineers, product management, and other partners to understand requirements and distill user mindsets. Use your creative techniques to generate innovative concepts, and wireframes to visualize ideas. Join our team, and experience how Apple operates, empowering our employees to do what they do best: craft magical experiences for our customers.", "key_qualifications": "", "preferred_qualifications": "You are a motivated and driven designer who collaborates well with a team to find simple solutions to complex problems. Clear communicator - you are concise and articulate in speech and writing and practice active listening.", "education_experience": "Education: BA or BFA degree in Graphic Design or a related field preferred. Strong grasp of fundamental user-centered visual and interactive design principles. Understanding of the UX design process and strategy. Familiarity with design systems, accessibility, branding, localization etc. Knowledge of design and prototyping tools, such as Sketch, Figma etc.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553247"}