{"title": "Performance Control Architect - Platform Architecture", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people who work here have reinvented entire industries with all Apple Hardware products.", "description": "As a Performance Control Architect, your job responsibilities will include:\n-  Design and conduct experiments to characterize execution efficiency and the effects of physical constraints such as temperature or current limits\n-  Use excellent empirical methodology to illuminate power–performance tradeoffs\n-  Collaborate with and influence a broad cross-functional audience spanning processor architecture, silicon engineering, system integration, OS development and application software performance evaluation\n-  Identify opportunities to improve the measurement and control capabilities of Apple SoCs\n-  Invent new performance control concepts and carry them through prototyping, production implementation and tuning", "key_qualifications": "Research experience investigating execution efficiency in computing systems, particularly on real silicon.\nComprehensive statistics and quantitative analysis skills.\nUnderstanding of the techniques used to manage power delivery and thermal limits in modern systems\nHands-on experience with hardware instrumentation, including power measurement and performance counters\nKnowledge of computer architecture, including the relationships between CPUs, GPUs, other compute clusters and memory hierarchy\nUserland software (e.g., application, simulation, test harness, data analysis) development experience in environments such as C, C++, Objective-C, Swift, Python, Perl or MATLAB is essential\nKernel software development experience in C or C++ is desirable", "preferred_qualifications": "", "education_experience": "B.S. and a minimum of 20 years of relevant industry experience. M.S. or Ph.D. in Electrical and Computer Engineering or Computer Science preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528414"}