{"title": "SWE - Security Research Engineer - Browser, SEAR (Remote Considered)", "summary": "Help Apple secure the world’s most advanced consumer devices, which people trust to store their personal and professional data. Remote working considered.", "description": "You are joining an exceptional team focusing on securing browser technologies across Apple platforms. You will be working alongside a wide variety of teams and vendors and your influence will be felt throughout Apple's extraordinary products, including: the iPhone, Apple Vision Pro, Mac and Apple TV. In addition, you will be responsible for identifying threats in advance and directly involved in Apple's response to critical issues as they arise. The job is as diverse as it is essential, from reverse engineering an exploit, providing insightful analysis and creating innovative tools, consulting with other teams on both hardware and software, to reviewing code and proposing designs for new security mitigations which will ship on billions of devices. This position requires someone with strong technical strengths and a passionate desire to secure systems. Your responsibilities will include helping to make Apple's products the industry's most secure, evaluating security-critical code, developing intelligent automated tools for vulnerability finding, building exploits for discovered vulnerabilities to challenge existing mitigation techniques, providing security focused consultations on key technology areas to partner teams and driving the design and development of new mitigations. This position may require some travel to other Apple sites, vendors, and security conferences.", "key_qualifications": "", "preferred_qualifications": "Experience of software exploitation\nKnowledge of macOS and iOS security architectures.\nKnowledge of memory safe languages.\nProficiency with assembly languages, particularly ARM64, is a big plus.\nKnowledge of high performance graphics stacks.\nKnowledge of modern media stacks.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555203"}