{"title": "Sales - Consumer Account Manager (Indonesia)", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. Imagine what you could do here. Apple’s Sales Organization generates the revenue needed to fuel ongoing development of products and services. A unique opportunity exists for an individual to contribute to account management for Apple partners in Indonesia.", "description": "In this role, you will be expected to:\n-  Be the subject matter expert of Indonesian consumers\n-  Analyze and identify issues and opportunities to develop locally relevant solutions\n-  Deliver weekly, quarterly and yearly business plans\n-  Execute local business development projects, including deployment of channel store programs\n-  Develop close working relationships with relevant extended Apple team and collaborate with them to deliver for Apple’s customers and partners\n-  Develop close working relationships with the senior representatives of assigned partners and inspire them to collaborate\n-  Ensure that assigned partners comply with Apple’s guidelines and policies\n-  Hold regular performance and planning reviews with assigned partners\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "", "preferred_qualifications": "Successful experience in managing complex business partnerships environment and building tailor made solutions\nDemonstrated superior communication, relationship building, influencing, in both English and Bahasa Indonesia\nDemonstrated ability to work through ambiguity with integrity", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553769"}