{"title": "Camera Calibration and Instrumentation Engineer", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.", "description": "Design, specification, development and deployment of camera metrology systems for Apple products. These equipment calibrate and verify performance for use during Apple new product introduction (NPI). Responsibilities include: - Work with equipment vendors to design the perfect equipment from scratch for calibrating and verifying the performance of Apple products - Specify and acquire instruments, components and tools for use in a NPI environment - Run simulations or experiments to make data driven decisions and present results to senior management - Design, develop, debug, and optimize algorithms to meet with accuracy and precision requirement for camera calibration and performance verification - Design, develop, optimize, review and debug software in C/C++/Objective-C used in interacting with Apple OS - Cooperate with cross-functional & multidisciplinary teams to specify and deploy calibration and performance verification stations with integrated hardware system, software and algorithm throughout the NPI cycle - Generate reports that analyze large amounts of NPI camera performance data* Balance decisions between engineering asks and manufacturing efficiency while ensuring product quality", "key_qualifications": "Deep knowledge in two or more of the following: camera calibration, lidar or other depth sensor, computer vision, image processing, AI/ML, optical instrumentation. Experience in at least one of Matlab/Python/Lua languages. Proficient coding skills in either one of the following: C, C++, Objective-C. Imaging/measurement/test system development experience. Excellent written and verbal interpersonal skills, with native fluency in Mandarin-Chinese and proficiency in English. Large quantity data processing & analysis capability. Strong problem-solving capability. Estimated travel: up to 20% international travel. Ability to work well in a collaborative, highly multi-functional and fast-paced environment.", "preferred_qualifications": "", "education_experience": "- MS or PhD in CE/EE/Imaging/Physics/Optics/Applied Math", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526953"}