{"title": "SoC DRAM Memory Subsystem Validation Engineering Program Manager", "summary": "Come and join the team that crafted the M3/M4! Apple makes the greatest SoCs in the world; to do that takes thousands of employees, multiple years and very significant R&D spending. To make the best use of those employees, time, and money requires excellent methodologies and structures. As we continue to expand and mature, the processes used to develop these SOCs must be improved. Join us to do your life’s best work in this rare opportunity to help define the next big thing that will surprise and delight the world!\n\nAs a SoC DRAM Memory Subsystem Validation and Debug Program Manager, you will drive the memory subsystem readiness for our custom SoCs. Our high-bandwidth multi-client memory subsystems are blazing new territory with every generation. Your charter will include managing bring-up, validation, and the complicated debug of our groundbreaking memory subsystem. You will also help craft the DRAM industry’s mobile roadmap and drive innovative DRAM technologies to accompany SoC’s across Apple’s product lines. In this multifaceted role, you will be the critical interface between Apple’s DRAM architecture, Memory Controller Design and DV, DDR PHY, DRAM product engineering and software teams to ensure these advanced memory technologies are delivered from architecture to mass production to Apple’s industry leading quality standards.", "description": "• Work on an impactful EPM team responsible for driving technical issue resolution to enable timely silicon to meet daring product schedules.\n• Make detailed program level plans for memory feature roll-out and align multi-functional teams on the support and validation plans.\n• Interface and drive memory related silicon issues across multi-functional teams: Design, Verification, Silicon Validation, Productization, System Hardware and Software.\n• Drive debug activities in post silicon environments, root-cause problems, and steer the team to the best corrective action to move forward.\n• Focused issue reporting, bug tracking, organizing and reporting of program risks and status at an executive level.\n• Plan and lead adoption of DRAM technologies, custom package development and qualification process with multi-functional teams.\n• Work closely with the DRAM Global Supply Management (GSM), DRAM & Package Engineering and SoC Program Management organizations to set priorities.\n• Attend and drive technical sessions with DRAM vendors on new DRAM technology development to track and follow-up issues/action items and drive vendors to meet spec and schedule requirements.\n• Work with DRAM GSM and silicon material management teams to plan and track distribution of new DRAM material across all systems in development.\n• Enable tight collaboration between Design for Test (DFT), Product/Test/QA engineering, SiVal and Systems teams during NPI to finalize SoC performance targets and screen requirements.\n• Drive internal program process to guarantee high quality silicon execution.", "key_qualifications": "", "preferred_qualifications": "Knowledge of high-performance memory subsystem, including SoC memory architecture, sophisticated DDR controller, PHY design and high-speed IO interface, DRAM device, and associated calibration/training mechanisms.\nExperience shipping high volume DRAMs / SoCs.\nExperience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking, and real-time crisis management\nExcellent debugging skills. Proven track record to drive resolution of critical problems, while under pressure.\nAbility to understand complex technical discussions and extract action plans.\nPassionate to own/drive project development using well-defined metrics.\nThrives in dynamic schedule driven development environment.Ability to succinctly summarize complex details for executive reporting\nExtraordinary leadership skills and ability to encourage team members with a commitment to see the bigger picture\nPhenomenal leadership and social skills with a reciprocal approach\nPrevious experience working with major DRAM memory vendors and validation of DRAM device is also a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557830"}