{"title": "Cellular RF Systems Architect – Transceiver and RF Front End Co-Design", "summary": "Imagine what you could do here! At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We invite you to join our dynamic group, for the outstanding and great opportunity to contribute to upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nApple's RF Systems Engineering team is looking for a passionate, independent expert with a proven track record in the area of RF transceiver development. Our extraordinary team crafts the mobile market with forward-thinking concepts while being fully accountable for execution and commitments on timeline and quality.\n\nCome and deliver next generation transceiver architecture for Apple’s wireless products that enable a unique customer experience!", "description": "In this role, you will be part of the outstanding cellular RFSE Team. You will work closely with transmitter and receiver architecture teams, RF design teams, pre- and post-silicon verification teams to drive innovation and next generation product architecture.\nYour daily work includes the following tasks:\n-  Analysis of complex system use cases such as SRS antenna switching, UL switching, multi-SIM etc. regarding their impact on RF Front End architecture.\n-  Development of control and mapping algorithms for optimum interworking between transceiver and RF Front End.\n-  Line-up analysis and optimization of signal path partitioning between RF transceiver and RF Front End.\n-  Exploration of new RF Front End technologies (LNA, PA, filters, etc.) and their interworking aspects with the RF transceiver.\n-  RF Front End innovation for upcoming 6G use cases.\n-  Authoring of system architecture specifications as input to system engineering, design, and validation teams.\n-  Collaborating with Front End, RX, and TX teams on micro-architecture.\n-  Taking end-to-end RF architecture responsibility, e.g. via simulation and design reviews.", "key_qualifications": "More than 5 years of proven experience in RF systems engineering, or more than 10 years of experience in communications circuit design (RF, analog, mixed-signal and/or digital). Strong background in math and physics, especially electromagnetics. Design and simulation of analog/digital signal processing paths. Communication technology and basic knowledge of cellular radio standards on physical layer. Transmitter and receiver architectures. RF filter design and technology (LC, SAW, BAW). Power amplifier design, characterization and system usage. Understanding of key components of RF Front Ends (LNA, PA, filters, switches etc.) and their integration in Front End modules. Healthy combination of innovation attitude and understanding of practical constraints of product development. Solid programming skills. Excellent communication skills, both written & verbal especially in a multi-functional environment.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200510756"}