{"title": "Embedded Engineer - ISP Algorithms", "summary": "Apple's ISP algorithm team is looking for an extraordinary embedded software engineer to drive pioneering technologies for Apple products. As part of the team you would work on core camera autofocus technologies, where you will have the chance to define the way that Apple develops, tests and manufactures all of its products. Our close-knit team cultivates an environment of product innovation, rapid product iteration and collaboration at both team and multi-functional levels with a liberating amount of autonomy.", "description": "In this role you will implement, design and maintain the software driving the autofocus inside our camera firmware stack including: \n\n1. Design and implement the multi-camera autofocus processing pipeline architecture (multi-threaded image processing algorithms, control loops, and finite state machines).\n\n2. Work closely with the autofocus algorithms team to adapt the architecture for new use cases and integrate their algorithms.\n\n3. Work with other teams up the camera stack to define and implement interfaces to support new autofocus features.\n\n4. Optimize and improve system performance in term of power, usage, latency, jitter and etc.\n\n5. Work on regression, unit testing, and debugging frameworks to improve the reliability of our system and help with diagnosing issues encountered in the field.\n\nThis is a highly multi-functional product development role and you will work closely with various teams, like Camera Firmware and Software teams, and the Machine Learning algorithm team. The environment is multifaceted, fast-paced and requires a self-starter demeanor.", "key_qualifications": "A real passion for embedded software development\nProficiency in C/C++ software architecture, development and optimization\nProficiency in development of multi-threaded real-time software\nFamiliarity with camera pipeline, video processing, Neon optimization, and Python is a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518227"}