{"title": "iPhone Display Module Engineering Program Manager", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! The Display Module is is the window for our customers to dive into the magic and joy of iPhone and the Display Hardware team delivers enabling technology year after year for enhancing that experience. The Display Module EPM team is seeking a Hardware Engineering Program Manager (EPM) to be the control tower and hub for development and integration of Display top module for our iPhone. In this highly cross-functional role, the candidate has the opportunity to craft the beautiful, cutting edge, and next generation of display technology. Thru this, the candidate is responsible for navigating ambiguity, rapidly changing scenarios, and complex program ramps with the final goal to deliver the best Display into the hands of millions of people!", "description": "Define and drive execution of build plans for multiple module vendors and component suppliers. Drive module development with Engineering & cross-functional Apple teams while advocating for the best display performance. Responsible for driving display modules on the aggressive Apple development schedule. Proactively engage & communicate status of issues to the development team and Apple executives. Focus the efforts of the hardware design, optical, mechanical, electrical, and operations teams, bringing their expertise together to design, manufacture, and integrate display modules. Ability to travel internationally to support builds if required.", "key_qualifications": "Relevant industry experience designing & developing consumer electronics hardware or Engineering Project Management experience in a technical field related to Display (silicon, material and process development, optics, mechanical/product design). Experience with in-depth technical engineering problem solving, to effectively establish project plans, execute challenge NPI build, and drive technical opens to convergence. Proven ability to effectively manage a high volume global supply chain, including challenging vendors to go above and beyond industry norms. Ability to bring focus on complex situations while messaging the bigger picture to leaders and partners during rapid development cycles.. Skilled at handling accountability without control; knowing how to identify and drive priorities from among the multiple issues competing for your attention. Excellent communication, collaboration, and conflict resolution skills. Familiarity with a consumer product life cycle.", "preferred_qualifications": "", "education_experience": "BS + 3 years of relevant experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552367"}