{"title": "Apps and Frameworks Software Engineer - Security", "summary": "The SPEAR team in Apple’s Security Engineering & Architecture organization is hiring a collaborative apps and frameworks software engineer with a drive to improve the security of end user devices.", "description": "Each project will involve solving unique challenges while handling the following core responsibilities: Efficiently gain familiarity with the design and implementation of existing codebases. Contribute to design of application, framework, or daemon security hardening projects such as memory safety technology adoption, mitigation deployment, sandboxing/isolation, refactoring, and other approaches as necessary. Update existing software codebases or create new codebases as necessary to achieve project goals. Implement projects using the most appropriate language, potentially including Swift, Objective-C, or C++. Adopt or update isolated unit testing to thoroughly exercise changes; collaborate with QA engineers on functional testing. Document changes and new architectural elements, creating training materials required for partner team to maintain changes going forward. Communicate collaboratively and effectively during all project phases.", "key_qualifications": "", "preferred_qualifications": "Education: BS in Computer Science or equivalent experience/skills Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558794"}