{"title": "Software Engineer, Information Systems", "summary": "Apple is a place where extraordinary people gather to do their best work! Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job!", "description": "As a Software Engineer you will be responsible for building and enhancing the next generation of Apple’s IS&T Platforms and Applications. You will be part of an Agile team and partake in every aspect of the product, from planning to design to implementation and documentation. You will work with project managers and technical teams in a multi-functional environment to implement quality products that meet the business goals. The ideal candidate will be self-motivated, pro-active and solution oriented. Attention to detail and dedication to providing a high-quality, stable delivery are essential.", "key_qualifications": "3+ years of experience in designing and developing scalable enterprise level back end solutions\nProven skills and Hands-on programming experience in Java, Spring, multi-threading, REST, Data Caching Services, DB schema design and data access technologies\nHands-on with design, development, and deployment of enterprise systems", "preferred_qualifications": "Excellent analytical and quantitative skills\nExperience in working in a large enterprise, with a global environment, across multiple timezones and geographies\nExcellent communication and collaboration skills and ability to multi-task\nTo be successful you are self-motivated; driven to achieve and go above and beyond\nExperience in working with No-SQL Databases: Cassandra, MongoDB, etc.\nExperience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clients\nUnderstand security concepts and build reliable and safe distributed applications\nSolid knowledge of applications performance improvement techniques and caching solutions\nBS or MS degree in Computer Science, Information Management, or equivalent", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558938"}