{"title": "Software Automation QA Engineer - Security", "summary": "The SPEAR team in Apple’s Security Engineering & Architecture organization is hiring a collaborative software quality assurance engineer with a drive to ensure the quality of ambitious software security features. SPEAR is a dedicated team of engineers who work on security hardening across all of Apple’s operating systems.", "description": "As a Quality Assurance Automation Engineer in the SPEAR team, you will be responsible for qualifying a variety of SPEAR-developed features. This will include: Coordinating with feature teams to adopt existing automation suites, Develop comprehensive feature test plans to ensure the feature achieves its goals without regressing functionality, performance, power, stability, Implement new tests when needed to achieve adequate coverage, Automate end-to-end and unit-level testing, Manage automated testing and triage test failures, and Report on testing status and follow up to ensure regressions are addressed.", "key_qualifications": " ", "preferred_qualifications": "Education: Bachelors degree in Computer Science, Computer Engineering or equivalent experience.", "education_experience": "", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533861"}