{"title": "Privacy Engineering Program Manager - Apple Maps, Find My, and Business Connect", "summary": "Privacy is a fundamental human right. This is why our team is passionate about shipping products with these important core values in mind! The Maps Program Team is seeking an experienced Program Manager to help oversee all privacy aspects for Maps, Find My, and Business Connect. The ideal candidate will not only believe in Apple’s core values surrounding Privacy, but will help drive and foster innovation which incorporates Apple’s ideals and other global best-practices which ensure customer data and privacy are at the forefront of our solutions.", "description": "Our team is responsible for developing processes, managing and communicating project definitions and engineering achievements, and maintaining project status updates and schedules for new and ongoing projects related to privacy. EPMs are catalysts for the teams they support, ensuring clarity by creating plans, driving execution, setting goals and expectations, and identifying and removing potential roadblocks. As a member of our team, you will have the opportunity to influence and build relationships with members in all functional areas and levels of our organization— engineering, legal, privacy, marketing, design, and leadership. You will ensure that all products, services, and projects are designed for Apple’s privacy promise; ensuring privacy sensitive work is identified, tracked, accounted for, and delivered on time. In this role, you will preserve Apple’s unique privacy commitments to our customers while ensuring that our teams continue to deliver impactful customer experiences which surprise and delight!", "key_qualifications": "8+ years experience developing project plans and managing complex, cross-functional projects in a technical consumer-oriented environment. Passionate about customer privacy. Solid track record of: Identifying risks, developing mitigation strategies, and facilitating conflict resolutions. Learning, researching, and remaining vigilant to evolving policies and technologies in the privacy space to rapidly assess exposures and risks in addition to suggesting mitigations to these new risks. Analyzing system architectures for privacy impact and identifying gaps and/or risks. Navigating, finding clarity, and leading teams through ambiguity. Tracking and managing numerous, unrelated parallel activities at once in real-time. Mobilizing, encouraging, influencing, advocating, and curating teams through influence. Creating, driving, and documenting repeatable processes and resources. Solving sophisticated problems independently. Collaborating, communicating, and presenting technical solutions to a broad audience.", "preferred_qualifications": "Real-world experience implementing privacy/trust/security measures which have shipped in a consumer product and/or service. Understanding of “privacy” from Apple’s corporate perspective including our stance and commitment to protecting our users’ personal data and privacy. Working experience with policies such as GDPR, CCPA, CPRA etc. Education: BA/BS or equivalent experience. Advanced degree in related field preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559636"}