{"title": "Salesforce Developer/Analyst", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple’s Partner Solution & Technology group is looking for a hardworking software development professional to champion innovation and leverage deep and cutting-edge Salesforce expertise. You will be pioneering solutions that will transform and catapult our Sales organization into the 21st century. You will work with amazing colleagues who have real passion for our products and our customers; and, through this program, you will be delivering software that enables our Sales teams to bring our world-class products, directly and indirectly, to our customers.", "description": "Be ready to make something great when you come here. You will work in a highly collaborative team environment with multiple stakeholders on analyzing business requirements/user stories and create solutions with Salesforce Apex, Visualforce, and Lightening platform. You will work alongside Salesforce administrators and within program governance model to configure and customize Salesforce maintaining balance between business agility and cost of ownership of the solution. You will ensure high code quality and maintain the security, integrity and performance requirements for the application. You will adhere and enable continuous improvement of development processes using industry standard CI/CD like Github and Jenkins. You will work through configuration or customization bugs, troubleshooting, and fixing them for planned releases, upgrades and production. Of course, strong engineering fundamentals and burning desire to learn and excel are expected, but you have more: • You take responsibility; you feel a personal stake in the product you ship and for the end-user of it; you communicate responsibilities and scope clearly. • Integrity is everything to you. You handle risk and manage trade-offs openly and transparently. • You are a strong team player; you enjoy working collaboratively; you help everyone to win, not just yourself. • You thrive in uncertainty and strive to bring order to it; you have deep wisdom and judgement; you keep your eye on the ball. • Building positive relationships comes naturally; you are aware of politics, can meet them and diffuse them, but do not get mired in them.", "key_qualifications": "", "preferred_qualifications": "Proven experience in Java/Java EE and technologies such as web services, xml, json, http, ssl. Proficient in front end technologies like Javascript, HTML, CSS, and any of the JS frameworks like React, Angular", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558616"}