{"title": "WW Channel Service Program Manager", "summary": "Imagine what you could do here at Apple. Innovation runs through everything we do, from amazing technology to industy-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. As a part of the Channel Service Program’s team, this individual is responsible for aligning people, projects, and programs across multiple divisions to ensure detailed execution of strategic imperatives for AppleCare’s worldwide channel service business.", "description": "This individual leads programs that enable efficient customer experiences and process efficiency in AppleCare’s Authorized service channels (Apple Authorized Service Providers and Wireless Carriers). This position plays a pivotal role in the design, implementation, and management of strategic program aimed at providing the best possible customer experience. This position involves close collaboration with channel partners, including resellers, as well as internal cross-functional teams, to ensure alignment with company objectives and to cultivate collaborative relationships.", "key_qualifications": "Bachelor’s Degree or equivalent required. 5-7+ years Project/Program Management experience or equivalent in Strategy, Operations, Consulting. Strong analytical skills with a proven ability to analyze complex datasets. Highly effective written and verbal communication skills; ability to distill complex information to be easily digestible for a broad range of audiences, and highly effective at building trust and communicating innovative ideas to gain consensus and build partnerships. Comfortable delivering persuasive presentations across all levels of leadership. Excellent organization and time management skills with the ability to manage multiple strategies, programs, and projects concurrently. Demonstrates Apple’s values of inclusion and diversity in daily activities.", "preferred_qualifications": "MBA preferred. Background working in a Channel, Retail, and/or Field Support environment is a plus. Expert organization skills and attention to detail; Ability to prioritize, manage, and advance multiple projects and deliver results in a fast-paced and ambiguous environment. Strong collaboration and relationship-building skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners. Passion for the customer experience, self-motivation, and the ability to operate with a great sense of urgency, with autonomy and extremely tight timelines.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557266"}