{"title": "Manager of Data Center Project Management", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen and we do this in service to all Apple employees and customers. Our team is a diverse and forward-thinking group that manages Apple’s workplaces and workplace services. We develop and run Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world!", "description": "We are seeking an experienced, collaborative, and highly motivated senior manager to join our team and be responsible for the management of Global Data Center Project Management.", "key_qualifications": "Empty", "preferred_qualifications": "Experience managing a full-scale project management team tasked with delivering exceptional results in a fiscally responsible manner, Strong background in data center/commercial/industrial construction to include mechanical, electrical, process piping, plumbing building systems, tenant improvement, site work and ground up construction. Deep expertise in the planning, scheduling, budgeting, resourcing, and executing of all technical services required to deliver large scale construction projects. Experience managing bespoke design elements that require attention to detail and industry leading techniques. Ability to manage design and engineering consultants. Expertise in the management of mechanical, electrical, plumbing, building controls, fire-alarm, and architectural finish scopes. Extensive knowledge of and experience with the upkeep and function of buildings, building systems, machinery, and landscape to ensure new projects are designed to the highest architectural standards without sacrificing maintainability. Capability to diagnose, handle and resolve construction issues quickly and efficiently, including experience prioritizing and assigning materials and resources; Ability to develop cost estimates, schedules, and analyze Total Cost of Ownership (TCO). Ability to collaborate with multiple internal stakeholders to ensure all parties needs are being met. This includes the follow teams but is not limited to: Engineering, Operations, EH&S, Energy, Commissioning. Expertise in managing the commissioning process and understanding the nuances of commissioning activities as it relates to Data Centers. Excellent leadership, communication, and supervisory skills, including experience working with all levels of an organization and ability to handle customer service issues involving employees in a professional and positive manner; Demonstrated success in employee development and mentoring including fostering collaboration, continuous performance feedback and motivating the team to develop and utilize tools for more efficient project management and improved customer service; Ability to manage multiple projects including equipment upgrades and modifications within live data center production environments in parallel with new construction efforts.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $211,800 and $317,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556107"}