{"title": "Automation Engineer", "summary": "Would you like to contribute to an excellent user experience that people expect from Apple devices inside the Apple ecosystem? We are the Beats Engineering team, and we are looking for a highly motivated engineer, who understands how each component, in a fully integrated embedded operating system combines hardware, software, and apps together! You will help develop/maintain frameworks and sophisticated automation environments which will be responsible for the development of test flows and automation infrastructure. You will drive investigation of use cases, system-level operation and develop software to validate functionality, and performance of the systems. Come join our team!", "description": "You will be a part of a team that works on crafting and developing automated tools and tests focused on deploying and maintaining frameworks in a continuous integration environment. You will craft test plans, debug and isolate issues/bugs caught in test automation and report results across multiple teams.", "key_qualifications": "Excellent analytical and problem-solving skills.\nStrong communication and collaboration skills.", "preferred_qualifications": "Knowledge of wireless standards (Bluetooth Classic/LE, WiFi, Thread) preferred", "education_experience": "BS or MS in CS/CE/EE or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557502"}