{"title": "Engineering Project Manager - Software Delivery", "summary": "Are you looking for a great opportunity to work in a program management team passionate about delivering world-class services within Apple? Apple’s Software Delivery organization is an indispensable pillar of Apple's ecosystem. This exceptional success stems from a team of adept individuals thriving in an environment that cultivates creativity, collaboration, and problem-solving. Software Engineering group is renowned for its work in user experience, integration, functionality and lifestyle. It's a critical component of Apple's ecosystem and one that continues to break new ground every day! This kind of success has been the result of very skilled people working in an environment which fosters creativity, cooperation and the solving of old problems in new ways. If that sounds like the kind of place that you find intriguing, then this may be the place for you!", "description": "Within the Software Engineering group, the Software Delivery Services and Infrastructure team is charged with the creation and care of the technology which underlies Software Engineering's build infrastructure. We are looking for project managers who can thrive in a fast-paced workplace where both individual drive and team collaboration are the keys to success. The ideal candidate can act as a full partner with a large and diverse group of internal and external teams in order to ensure the continued evolution and availability of critical services. A firm grasp of the fundamentals of project management is important, but there is more of importance than just the typical skill set. The team focuses on infrastructure efforts and acts not only in the best interest of the services under their care, but are expected to always keep in mind what is best for the group, the organization and the company. As an empowered member of Software Delivery, you will facilitate resolution of conflicts between equally passionate groups in light of these perspectives and pursue the solution until its end. Systems of this scope are complex, so you will not only be expected to be able to readily understand complicated and subtle interdependencies, but also to evaluate new requests and new information in light of how it affects or is affected by those systems. Being able to think on your feet is critical, as is the ability to productively debate the validity of a given approach to any aspect of a project under your control. Strong interpersonal and communication skills are must-haves for any candidate. Being a self-starter with a strong sense of responsibility and ownership is also important as the team is looking for the kind of person who can dive right into a problem and get it taken care of without having to be asked to do so. As a member of the Software Delivery team, you will be helping to care for a system that serves the passions and needs of many tens of millions of customers in an increasingly service-dependent world, so we're looking for somebody who can be equally passionate.", "key_qualifications": "Outstanding written and verbal communication skills, Fluent in software development processes, Experience with infrastructure-focused projects (i.e. networks, services, APIs, etc.), Proven ability to work effectively with multiple stakeholders across a variety of business units, Self-motivated and proactive with demonstrated creative and critical thinking capabilities, Experience managing multiple complex projects simultaneously", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "- Strong background in the services infrastructure space, - Background in infrastructure security, - Demonstrated ability to organize and manage rapid co-ordinated response efforts, - Great attention to detail", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537462"}