{"title": "Wireless System Engineer - Ranging and Sensing", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!", "description": "As a Wireless Systems Engineering, you will be responsible for the design of next generation and proprietary ranging and sensing technologies at the PHY layer. This role requires collaborating closely with multiple cross-functional teams, including the radio and analog teams, PHY/MAC systems teams, firmware teams, and product teams to derive the requirements, create and implement the ranging and sensing designs, validate pre-silicon, bring up post-silicon, and optimize performance and reliability. Ultimately, you will need to deliver a solution that achieves the target requirements and satisfy user-level expectations. Core Responsibilities: •Design and simulate next-generation and proprietary ranging and sensing protocols at the PHY layer •Work with cross-functional teams to understand and develop design designs to meet those requirements. •Work with designers to ensure implementations that are both robust, flexible, and area/power efficient. •Work with firmware designers to ensure that implementations are robust, flexible and efficient. •Bring up, test, and characterize the ranging and sensing designs to ensure flexibility, performance is optimized, and that the designs are robustness enough for production.", "key_qualifications": "Knowledge of ranging and sensing protocols, such as IEEE 802.11az, IEEE 802.11bf, IEEE 802.11bk, IEEE 802.15.4z, IEEE 802.15.4ab. Experience developing ranging and sensing algorithms. Experience developing algorithms that lead to hardware and firmware friendly designs. Experience testing ranging and sensing designs in real-world environments. Experience with multi-resolution algorithms that are used to estimate the first path of arrival for ranging. Experience with Matlab or C/C++ for algorithm development, modeling, and simulation. Strong analytical skills to develop best-in-class designs in terms of performance, power, and area. Strong understanding of communication theory and signal processing.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant experience required. MSEE/PhD preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534161"}