{"title": "Technical Translator - Vietnamese", "summary": "Are you looking for a great opportunity to work on a dynamic team passionate about delivering extraordinary localized software on some of the world’s most creative consumer electronic products? Do you love the challenge of solving complex problems that can have a direct impact on the success of the company? Join the team responsible for the localization of Apple software and Siri. We are looking for experienced technical translators to localize software and related content into Vietnamese. Our localization team is looking for highly motivated individuals with the right mix of technical, creative, organizational and communication skills to provide technical translations and adaptations for our software. Fluency and translation experience in Vietnamese are crucial. The environment is fast paced, requiring the ability to handle workload with daring delivery schedules. In addition to project work, other responsibilities include contributing to improving the tools to make software localization workflows more efficient; helping to investigate the root causes of international issues that are found in localized software; evangelizing standard processes for localization friendly content; defining and driving improvements in our localized content. Strong communication and collaboration skills, attention to detail, and proven ability to manage priorities are crucial! This position is highly suited to technical translators with localization experience. You will be working in an exciting, supportive team, interact with other localization teams at Apple, as well as engineering and QA teams, and gain valuable insights into the development process at Apple!", "description": "- Translation of Apple products into Vietnamese.\n- Utilizing internal tools to identify changes with localization impact.  \n- Bug monitoring, reporting and resolution.  \n- Working with cross-functional groups to ensure the process runs smoothly and on schedule. \n- Ensuring terminology consistency across all Apple products and services for the Vietnamese market. \n- Assisting with quick-turnaround translations. \n- Identifying tools and process enhancements. \n- Using unreleased software to check localization. \n- Maintaining style guides and language glossaries.", "key_qualifications": "- Native or accredited fluency in Vietnamese to support the Vietnamese-speaking market.\n- Fluent in English to do the translation from English to Vietnamese and vice versa.\n- Experience with CAT tools.\n- Experience in translation of UI for high-end software products.\n- Excellent writing skills.\n- Excellent partnership and interpersonal communication skills.\n- Large vocabulary, literacy, and cross-cultural knowledge.\n- Current and direct exposure to Vietnamese culture over a sustained period of time.\n- Knowledgeable in, and critical to, multilingual and multicultural issues.", "preferred_qualifications": "", "education_experience": "Degree in Applied Linguistics, Translation, Culture & Literature and equivalent", "additional_requirements": "- Experience in managing language specific style guides and glossaries.\n- Experience with localization and internationalization.\n- Excellent UX writing skills and experience.\n- Experience localizing Apple product content.\n- Excellent knowledge of structural aspects of the language (syntax, semantics, phonology, phonetics).\n- Experience in natural language processing and computational linguistics.\n- Experience with a programming language.\n- Localization project management experience.\n- QA experience.\n- Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n- We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501394"}