{"title": "GPU Power Efficiency Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Join us to help deliver the next groundbreaking product containing an Apple designed GPU! In this highly impactful role, you will be responsible for Efficiency or Performance per watt projections for the GPU from early feature specification stages to Silicon. As a member of the Silicon Technologies GPU team, you will work across functions including Architecture, Power, Performance, Silicon Validation, Thermals and Technology. The job involves analyzing and influencing key factors effecting Performance and Power of the GPU and improving on methodologies to align the model to Silicon.", "description": "Join the team to play a pivotal role in Performance and Power projections of the GPU. As Apple expands on its GPU feature set, we rely on making accurate Efficiency curves for Performance per watt. You will have the opportunity to influence GPU Architecture choices and the feature set for the product. You will work with many teams including Architecture, Power, Performance, Silicon Validation, Thermals and Technology. In the highly collaborative GPU team, your main responsibilities are: - Responsible to generate and analyze GPU Efficiency Projections – Performance per watt, for each generation of GPU over the full cycle of the project, from concept to Silicon. - Work on the methodology of generating these curves to improve accuracy and quality. - Work with Technology, Power and Static timing teams to determine the Frequency-Voltage curves for the workloads. - Work with Performance and Power teams to gather data for the Efficiency curves and analyze the impact. - Work with the Silicon team to improve projections based on Silicon data. - Work with the System and Chip level Power team as a resource for GPU to handle requests.", "key_qualifications": "We are looking for candidates with relevant course work related to VLSI Design, Computer Architecture and Power. Knowledge of logic design principles including power and timing implications. Knowledge of computer architecture, logic and circuit design. Understanding of low power design and implementation techniques. Familiarity with Python or similar contemporary scripting languages. Strong communication skills are a pre-requisite as you will collaborate with multi-functional groups.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of BS + 0 years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541234"}