{"title": "CPU Implementation Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation.", "description": "As a CPU Implementation Engineer, you will own or participate in the following:\n\n• Work extensively with Micro-architects to define memory subsystem, perform feasibility, make area, frequency, performance, power trade-offs and design and balance the pipeline stages.\n• Drive RTL-to-GDS flow through synthesis and place-and-route targeting ambitious targets for power, performance, and area.\n• Design delivery. Work with multi-functional engineering team to implement and validate physical design on the aspects of timing, area, reliability, testability, and power.", "key_qualifications": "Minimum BS\nFamiliarity with high performance microprocessor architecture\nKnowledge of logic design principles along with timing and power implications\nUnderstanding of low power microarchitecture and implementation techniques\nYou have design experience in deep sub-micron technologies and basic device physics\nExperience using synthesis & place-route tools\nExperience with scripting in Perl or TCL", "preferred_qualifications": "", "education_experience": "Minimum BS", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509352"}