{"title": "Product Design Engineer - Input Devices (Mechanical)", "summary": "Imaging what you could do here. At Apple, creative ideas have a way of becoming wonderful products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple Inc. is looking for mechanical engineers to design new input device products, subsystems, and modules to support the Mac and iOS product lines. You will primarily work on ground up designs in partnership with electrical engineering and firmware cross functional teams. Their responsibilities will span from technology development and concept generation to detailed design, analysis and testing through mass production ramp. There is an emphasis on optimizing and enhancing the ergonomic interaction between the user and the product.", "description": "Developing initial product layouts and new technology concepts Detailed design of mechanisms and sensors Support technology investigations and development Partner with industrial design team on concepts and detailed design Building prototypes to validate function, manufacturability, and robustness Perform FEA or coordinate FEA activities to evaluate and optimize design concepts Analyze data generated from builds and lab experiments Participate in design reviews to generate and receive constructive feedback Perform tolerance analyses to predict performance of mechanisms, sensors, and cosmetic specifications Detailed design and 2D documentation of all parts and assemblies Work with operations teams to evaluate and develop supply chains capable of manufacturing new subsystems and products Interacting with vendors to develop manufacturing processes and tooling concepts Define testing requirements and equipment and analyze the data produced Support build activities including finding root cause for failures and solutions for issues that impede build progress", "key_qualifications": "3+ years of experience in mechanical design is preferred Experience working in a team environment and be self motivated to identify and close design issues proficiency with high volume manufacturing processes is desired Strong consideration will be given to those with a proven track record in precision mechanism and sensordesign Familiarity with electrical engineering fundamentals and interconnect technologies is preferred Industry experiences from medical, consumer electronics, automotive, aerospace and other fields with relevant technology and development models", "preferred_qualifications": "", "education_experience": "BS and above in Mechanical engineering or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501639"}