{"title": "Software Engineer (Site Reliability), Retail Engineering", "summary": "Carrier Services offer seamless integration of Apple Retail Stores and Apple Online store with major US Carriers for iPhone activations. We are looking for a talented Site Reliability Engineer to join our growing team. As an SRE, you will be responsible for ensuring the reliability, scalability, and performance of our systems and services. You will work closely with our engineering and operations teams to design, build, and maintain robust infrastructure and automation solutions. If you are an SRE engineer who can thrive in a dynamic environment and can make a meaningful impact through your technical expertise and dedication to excellence, come join our team as a Site Reliability Engineer (SRE).", "description": "This role demands extensive hands-on experience of working as an SRE engineer for large scale, customer-facing Cloud applications. Candidate should have a good understanding of SRE principles, including monitoring, alerting, error budgets, fault analysis, and other common reliability engineering concepts. Candidate should have excellent troubleshooting and problem-solving skills. Candidate will be expected to represent the SRE organization in design reviews and operational readiness exercises for new and existing services. They will also be required to collaborate with technical and non-technical teams and analyze stats to come up with a clear picture of the current state of our system.", "key_qualifications": "", "preferred_qualifications": "BS in Computer Science or equivalent work experience is preferred. Strong problem-solving skills, software development, and debugging skills. Proven track record of taking ownership and successfully delivering results. Should be comfortable working in a fast-paced and dynamic environment. 5 years experience in leading small teams (3-4 members), design and develop scalable SRE Solutions while working with other teams. Fluency in Japanese language is a plus!", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556992"}