{"title": "SWE - Software Engineer, CoreOS Kernel", "summary": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Darwin Kernel Technologies team within Apple's CoreOS organization is responsible for delivery of a high-quality and performant kernel into just about every one of Apple’s products. Our software runs on your wrist as part of watchOS; in your pocket with iOS; on your desk in macOS; in your living room with tvOS; on the devices owned by your friends and family; and hundreds of millions of devices beyond those.", "description": "Work with a highly skilled engineering team in the design, implementation and support of numerous kernel technologies. The role includes interacting with cross-functional teams across Apple to bring state-of-the art kernel and security enhancements to Apple’s products. Engineers also use various debugging tools and techniques to identify system issues and improve quality.\n\nNICE TO HAVE SKILLS: \n-  iOS or macOS exposure\n-  Familiarity with software security principles\n-  Proficiency with ARM assembly language", "key_qualifications": "5+ years of professional experience working on low level systems or devices\nSolid understanding of Operating System implementation fundamentals\nProficient with C\nBasic computer architecture", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or equivalent knowledge and experience", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200523081"}