{"title": "Production Designer, Marketing Communications, CEMEA", "summary": "Marcom is the creatively-led distributed team that leads all aspects of Apple’s consumer facing marketing. We ensure the flawless development and implementation of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the globe interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences! This role requires blending design and production expertise to bring bold ideas to life with meticulous detail. The Production Designer will bridge the gap between Creative Design teams and Production Studio teams, ensuring the original design vision is maintained through every stage of implementation. Responsibilities include maintaining design consistency, overseeing project transitions from creative concepts to mechanical production, and ensuring excellence and consistency in every project. Whether working on localisation or origination projects for retail, channel, or Apple owned platforms, this role transforms creative concepts into spectacular realities!", "description": "Based in Dubai, this role will coordinate the implementation of all localised production of Apple marketing across CEMEA, ensuring the original Worldwide design intent is consistently maintained. Role is not limited to localisation. Production oversight of all origination work in the CEMEA region. Maintaining Apple standards across all creative touchpoints. Primary day-to-day responsibilities include but are not limited to: supporting creative teams, assisting design teams with project implementation, and ensuring design and production quality. Extensive knowledge of preparing artwork ready files for print production. Able to anticipate and tackle issues addressing potential design and production problems related to image cropping, scaling, resolution, colour, re-touching, reproduction, and finishing. Strategise and adapt designs through planning, and execute on core creative elements across various print and digital deliverables, adapting designs to different aspect ratios and scales. Developing, maintaining, and ensuring consistency and clarity on design documents, crafting and leading design roadmaps and pre-production layouts. Building production guidelines by developing documents, outlining design direction and production specifications for internal and external partners. Specifically for how to change the reading direction on all layouts to read right to left. Seeking to improve workflow, tools, and processes, therefore improving efficiency and quality in design and production tasks. Oversee the Design Quality Assurance (DQA) reviews of all apple.com interactive pages, Apple DMs and all digital and print Channel deliverables. Provide design support for internal comms and Executive keynote presentations.", "key_qualifications": "", "preferred_qualifications": "BA degree in Design or related field of study, or equivalent experience. Passionate about the creative process, with an exceptional design eye and attention to detail. Strategic thinking capability, with the ability to evaluate the implications of decisions at both the functional and strategic levels. Proactive and creative solution-oriented thinking and execution. Ability to lead, manage and mentor freelance members of the team, delivering clear and actionable feedback. Strong collaboration skills - internally and externally with production vendors. Effective partnership skills, maintaining professionalism under tight deadlines and in ambiguous situations. Highly adept at working with diverse teams; creative, project management, print production, mechanical studio, editing, and content. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559946"}