{"title": "Retail Security & External Affairs Manager", "summary": "As the first and single point of contact you will be responsible for external engagements with Public Security Bureau (\"PSB”) and Fire Safety Bureau (\"FSB”) and in-store security as well as establish and develop relationships with PSB and FSB.", "description": "EXTERNAL AFFAIRS  - Interacts with the local and district-level PSB and FSB which, have jurisdiction over the store. Engage the key personnel of each establishment periodically to build and develop relationships. - Identify and communicate with other PSB units, or government agencies, both within and outside the locality, if they are considered critical and/or beneficial to the store’s business operations.  - Develop and regularly update a directory of contacts from PSB and FSB.  - Monitor changes in public (government) policies, laws and regulations, local/ national/international events, organizational and key personnel changes (especially in local PSB and FSB) that may impact store’s and Apple’s relationships with PSB / FSB. Formulate response plans and engage partners to implement these plans.  - Receive and review all requests from PSB and FSB with a sense of urgency.  - Ensure all actions performed in response to such requests are fully aligned with Chinese laws and regulations, and company’s policies.  - Support police / criminal investigations by providing information, CCTV footage, products and any other materials to PSB officers in a timely manner as well as any other relevant company policies that apply.  - Maintains documentation all reports and requests for audit purposes via escalators and emails.  - Bring up any incidents of interests and sensitive issues concerning PSB / FSB, store safety and security, to LP, market/store leaderships and relevant store support functions such as Marketing and Public Relations (“PR”) , and collaborate with relevant internal partners to formulate engagement strategies.  - Provide LP Manager with periodic updates on PSB / FSB requests handled and activities conducted to enhance relationships with PSB and FSB.  SAFE & SECURITY  - Conduct periodic training for store employees on dealing with PSB / FSB, conflicts resolution, personal safety awareness, etc. Leverage on existing platforms such as downloads, resets, etc. - Ensure that in-store security systems are in good working conditions. Escalate any system failures and coordinate with vendors to rectify the problems.  - Oversee the in-store security guards to ensure the overall effectiveness and efficiency of their deployment. Ensure that the deployment mitigates the prevailing risk exposure of the store. Consult LP Manager to review and revise guard deployment where necessary.  - Evaluate ad hoc requests for additional guards by the store and advise LP Manager on the validity of such requests. Review the monthly invoices to ensure their accuracies.  - Work closely with the security guard vendor to ensure that their performances meet requirements and expectation. Escalate problems with guards, especially if the problems concern honesty and integrity, to LP Manager with recommendations on possible solutions.  - Support LP Manager in security planning and implementation for major events such as new store opening and new product launches. These include queue management, manpower, logistics (such as stanchions and metal barricades) and submission of plans for approval with the relevant authorities, especially the PSB. Work closely with internal stakeholders such as Marketing, Merchandising and PR for such events.  - Support LP Manager during external and internal investigations, including research, interviews and coordination, documentation (such as writing reports).  - Assist the LP Manager to identify process loopholes and control gaps, and to implement measures to close those gaps, through investigations and store checks.  - Assist Preservation Manager and in-store Operations Leads to meet fire safety requirements. - Support Government Affairs and store leadership to maintain the relationship with other local government / quasi-government agencies, such as consumer associations.", "key_qualifications": "", "preferred_qualifications": "Excellent verbal and written communication skills. Ability to work under pressure. Passion for Apple products and Retail. Understanding of general retail store functions, while experience in Apple Retail functions such as Product Zone, Genius Bar and Backstage is a plus. Experience in dealing with government officials a plus. Essential competencies include, but are not limited to the following: Problem Solving, Dealing with Ambiguity, Ethics and Values, Interpersonal savvy, Conflict Management, Managerial courage, Organizational agility, Perseverance and Priority Setting. Mandarin with fluency in the local dialect a plus", "education_experience": "University Degree, Minimum 5 years of work experience, Speaks and writes English and Mandarin", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555387"}