{"title": "Privacy & Law Enforcement Compliance - Legal Specialist", "summary": "Imagine what you could do here at Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Privacy & Law Enforcement Compliance Specialist performs a variety of tasks to support the Privacy & Law Enforcement Compliance function within Apple. As a Specialist on this team your primary responsibility will be to process and respond to requests for assistance on emergencies. You will also be responsible for processing and responding to requests, subpoenas, court orders and search warrants received from law enforcement agencies seeking access to customer information.", "description": "The Specialist performs legal and specialist tasks within the Privacy & Law Enforcement Compliance team and identifies and escalates non-standard and emergency requests appropriately. The successful candidate will be self-motivated, reliable, and possess the ability to resolve emergency and standard request issues in an effective and efficient manner. Legal Specialists generally perform the key role tasks, but will also be required to support other tasks as needed. Key Role Tasks: - Reviewing, scrutinizing, and responding to emergency requests received from law enforcement agencies for customer information within established procedures. - Participate in on-call emergency requests after-hours, on weekends, and holidays. - Reviewing and responding to large volume of time-sensitive standard requests received from law enforcement agencies for customer information which are handled in strict accordance with applicable law, Apple’s terms of service, and our law enforcement guidelines, and determining when to escalate non-standard requests. - Researching relevant internal systems and retrieving appropriate information to include in emergency and standard-level responses. - Assisting with the development of reports and presentations about the operational area and providing administrative support as needed.", "key_qualifications": "", "preferred_qualifications": "Ability to perform in an information sensitive environment and manage work activities within strict Data Protection, Privacy, and Security protocols. Ability to analyze and process emergency and legal process documents and requests within departmental operating procedures. Investigatory process experience, able to work independently with impeccable judgment. Strong technical proficiency with ability to work effectively across multiple applications and databases and observe high levels of data accuracy and attention to detail in daily work management. Good analysis and decision-making capability with ability to reliably recognize non-standard and emergency requests and escalate accordingly. Strong work ethic and exceptional partnering skills.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $50.15 and $75.20/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557627"}