{"title": "Apple Video Lead - Canada", "summary": "Imagine what you could do here. At Apple, we celebrate stories. Stories told through words, music, games and of course through movies and TV shows. With the introduction of Apple TV+ and Apple TV Channels, we have doubled down on offering amazing content to our customers, both produced by Apple and our partners. We are looking for an experienced Video Business Lead to further grow our Video business in Canada. The Lead needs to be an outstanding team player and a seasoned manager with an extensive media business background managing video services, subscription services, and with a thorough understanding of the content, partner and market. Bring passion and dedication to your job and there's no telling what you could accomplish!", "description": "In this role, you will: -  Manage a team of business managers and editors that have a shared goal: to present our customers with the most engaging and relevant movies and TV shows, across both transactional (TVOD and EST) and subscription offerings. -  Take a data-led approach to optimise performance and growth across all of Apple’s Video initiatives including Apple TV+, Channels, 3rd party App-based services and transactional.  -  Split your focus between market analysis, performance analysis, commercial initiatives, partner management and editorial initiatives. -  Work collaboratively with multiple functions to create and develop opportunities for Video within the wider Apple ecosystem. -  Build, maintain and expand business relationships with established and prospective partners, generating increased awareness and engagement of our Video initiatives in the Canadian Market. -  Cultivate an Apple approach to doing business, as well as the Apple tone of voice and branding across all Video initiatives in Canada, with an emphasis on topical cultural moments and local releases.-  Nurture and develop the best possible customer experience and Video offering on TV app, building programmes to attract and engage customers.", "key_qualifications": "", "preferred_qualifications": "Occasional international travel may be required. Ability to define long-term development strategies within a global, multi-layered organization. Proven success managing partnerships, with experience in leading commercial strategies and planning. Outstanding analytical skills and the ability to clearly present business insights to Senior Leadership. Excellent management skills: setting goals, driving performance and developing a team, fostering collaboration and a can-do attitude. Proactive, results-driven and highly adaptable attitude, with outstanding communication and interpersonal skills. A strategic mentality that is naturally curious and is consistently looking for news ways of developing business in order to drive growth. Passionate about technology and obsessed over the best customer experience, combining attention to detail with the ability to see the big picture. Proficiency in French.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559171"}