{"title": "Sr. Backend Engineer, ASE Image Systems", "summary": "Apple Services Engineering (ASE) first delighted users with downloadable music in April 2003 with the opening of the iTunes Store. Since then, ASE has delivered countless innovations around the digital delivery of audio and video, and in 2008 revolutionized smartphone app distribution with the launch of the App Store. Being the source for so much digital content requires managing relationships with a vast number of providers, from record labels to movie studios to app developers. The Digital Supply Chain Engineering team (DSCE) is tasked with ensuring that new content is uploaded, processed, cataloged, and available on our storefronts when the provider expects it to be top-notch quality. The DSCE Image Systems Engineering team is seeking a forward-thinking, self-starter to join our team. ASE is an increasingly vital and central component of Apple’s ecosystem, and continues to rely heavily on processing of media at ever more massive scale, at a level of quality unmatched in the industry. Join us in building Apple’s platform for image ingestion and processing at the heart of Apple’s Services, and participate in the innovation that will drive the next generation of media features services at Apple.", "description": "This position is part of a team passionate about high volume content processing workflows critical to the Apple Media Products. We are looking for a self-starting, energetic individual who is not afraid to question assumptions and to learn new technologies. We are looking for someone who is interested in working in multiple languages to build real-time, user-scale image processing services and the toolchains that power them. Learning new skills and technology is part of the job, and we’re seeking a candidate ready for the challenge. This is a rare opportunity to join a team whose work visibly touches almost all Apple services. The team works with team members distributed across the continental US, so excellent written and oral communication skills are vital. Does this sound like you? Join our team!", "key_qualifications": "Proficiency in implementing software in Java and/or other JVM languages. Experience with SQL and relational database systems. Experience with NoSQL databases like Cassandra or MongoDB. Experience or curiosity about image processing or computer graphics. Experience with managing and manipulating digital media content formats. Have a belief in automation and tooling as a critical part of the software lifecycle.", "preferred_qualifications": "Experience with OpenCV, CoreImage, CoreGraphics and Metal. Experience in color science or subjective image quality assessment. Experience in computer vision/machine learning. Experience with large-scale server-side systems and service-oriented architectures. Experience with big data technologies (Hadoop, Hive, Kafka, Cassandra, etc.). Experience building REST API. Experience programming in Rust.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559130"}