{"title": "Senior Cloud Engineer, Ad Platforms", "summary": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Ads in the App Store. Our offline pipelines are highly performant, deployed to handle high-volume asynchronous events at scale, and set new standards for enabling effective advertising while protecting user privacy. We are seeking an experienced, hands-on Senior Cloud Engineer passionate about creating reliable, predictable, and easy-to-use (simple) automation to provision cloud infrastructure for our developers. These tools will help accelerate the delivery of product features for Ad Platforms within the App Store, Apple News, and other platforms. As a technical lead, you will take ownership of a solution from beginning to end and deliver quality infrastructure as code that is developer friendly. Our team is responsible for driving the adoption of standard patterns for using the Cloud and bringing operational efficiency across cloud platforms. We are also responsible for enabling developers with the required infrastructure to test their code early in the software development lifecycle to reduce the number of bugs slipping into test/review environments. You will partner closely with Ad Platform's Developer Platform team to enable the delivery of tools and processes that provide engineers with an exceptional experience. You are a respected as a thought leader who can influence, persuade, and direct engineering decisions across many teams. You will join a team of world-class data engineers with an appetite for applying innovative technologies to deliver extraordinary experiences to our customers. You will play a meaningful role in building data products that deliver on Apple's privacy commitments and change the way advertising works with data. You will be a leading voice in our technology strategy and its delivery, as well as developing and mentoring junior team members. You will collaborate closely with the business to deliver relevant data and insight to advise our strategy and decisions. You should have a proven track record in Cloud Engineer roles, ideally within the ads or media space. You will have an excellent understanding of scalable approaches and thrive working in Agile environments. Being a good standout colleague under tight deadline constraints is key to success!", "description": "Create frameworks that enable developers to interact with Apple Cloud Infrastructure to test their code. Design our next-generation container platforms to run Ad Platforms services. Create tooling to enhance the observability of Ad Platforms systems. Develop expertise in Apple Infrastructure and standard methodologies, applying them to run world-class distributed systems. Design and develop tools to improve infrastructure reliability. Improve areas such as capacity planning, configuration management, and monitoring. Collaborate with engineering teams to improve on-call efficiencies, drive incident management, and conduct post-mortem analyses. Design and improve new and existing system architectures based on reliability and high availability principles, integrating extensive logging and observability. Establish robust deployment and delivery pipelines.", "key_qualifications": "8+ years of extensive experience supporting internet-facing production services and distributed systems, Expertise in Infrastructure as Code (IaC) tools like Terraform, Expertise in operating Linux-based systems, with a solid understanding of its internals, Experience in container platforms like Kubernetes and Nomad, Proficiency in operating infrastructures on AWS, Strong programming skills in Python (required) or Go (nice-to-have), Demonstrated problem-solving ability with a creative and innovative approach, Strong sense of ownership, customer service, and integrity with a desire to communicate and collaborate with teams, Experience in mentoring and developing more junior engineers, Self-motivated and eager to learn and grow", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or equivalent industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546511"}