{"title": "Business Development & Sales Planning Manager", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. Join Apple, and help us leave the world better than we found it!", "description": "- Lead overall sales strategy planning for RTM channel and products that will result in the growth of Apple Japan's business, including iPhone, iPad, Mac, Apple Watch in Carrier, consumer reseller, Enterprise and Education channels. - Develop new business model / channel structure / program in conjunction with the Worldwide team, Sales account team, Finance, Marketing, Legal, and other cross-functional teams to ensure that sales activity continuously meets Apple’s standards and keeps evolving in a changing environment. - Drive strategic programs such as: Channel Back Margin, Demand Generation, Compensation, POS authorization, Reseller Digital channel strategy and Product launch. - Ensure the execution of the channel sales plan, including engaging partners in collaboration with sales account team. - Committed to the continuous pursuit of process efficiency/scalability in the ongoing development and execution of sales programs.", "key_qualifications": "- You should have minimum 5 years in strategic business planning, business development or project management including end to end analytical/operational experience at preferably retail industries (but not limited to) including e-Commerce space. - Outstanding business acumen for identifying areas of improvement and strategic insights with proven record of developing and executing strategic initiatives. - Experience of quantitative and qualitative target setting based on extensive cross functional collaboration is a plus. - Excellent time management skills by prioritizing tasks under a fast-paced working environment. - Extraordinary team-player, very detail oriented and capable of defining goals and meeting deadlines while keep fighting for excellence. - High quality reporting skills including interpersonal communication and leadership presentation experience to support effective strategic business decisions. - Prominent change management skills and ability to deal effectively with ambiguity or conflict of interest. - Understanding the balance between tactical sales execution/goals and the importance of brand and standards for the channel. - Exceptional verbal and written communications skills (Japanese & English), including presenting to both local/international employees.", "preferred_qualifications": "", "education_experience": "B.A./B.S. required, advanced degree in Science, Engineering or Business Administration preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528390"}