{"title": "Software Engineer, IS&T Ai & Data Platforms", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. The Applied Machine Learning(AML) Solutions Team build solutions that impact across Apple. Typically these problems are related to Machine Learning Platform & Solutions and Big Data...", "description": "This role will be responsible for defining and developing ML Platform and frameworks for generative AI powered applications. You will collaborate with diverse cross-functional partners, including model developers, machine learning systems engineers, data scientists, application developers and product managers. Our ML Platform allows cross-functional teams to build diverse, business critical ML apps leveraging LLMs...", "key_qualifications": "4+ years of industry experience designing, building and supporting machine learning platforms, services and frameworks. Strong proficiency in embeddings, vectorization, vector stores, database optimization, performance tuning, and relevant query languages. Familiarity with embedding, retrieval algorithms, agents, data modeling for vector development graphs...", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience or equivalent in Computer Science or equivalent field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545283"}