{"title": "Software Engineer (Cloud), Ai & Data Platforms", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nThe Global Business Intelligence team provides data services, analytics, reporting, and data science solutions to Apple’s business groups, including Retail, iTunes, Marketing, AppleCare, Operations, Finance, and Sales. These solutions are built on top of an extraordinary data platform and leverage multiple frameworks. This is an extraordinary opportunity for a proficient, experienced, and results-oriented cloud engineer to define and build some of the best-in-class frameworks and tools for Apple’s private and third party clouds!", "description": "As a Cloud Engineer, you will be responsible for building the next generation self-service tools and features that are used by data and platform engineers to build and deploy applications to various clouds. You will collaborate with other application and framework engineers in the organization to either leverage or build new reusable components and frameworks to improve developer’s productivity. Attention to detail and a passion to deliver a highly scalable and quality product are crucial.", "key_qualifications": "3+ years of experience with cloud paradigm - AWS or GCP.\nExperience with virtual machines, containers, and Kubernetes platform.\nExperience with developing Rest API using Java or Python.\nUnderstanding of cross-account access through identity-based policies or resource-based policies is a must.\nUnderstanding of high-level network architecture and topology in a cloud environment is a must.\nUnderstanding of Cloud Economics and cost optimization techniques.\nTechnical skills with programming languages such as Python, micro-service development using Java, etc., knowledge of DevOps and DevOps tools.\nGood communication and personal skills: ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownership.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or related field or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548829"}