{"title": "Full Stack Senior Software Engineer (Java/J2EE)", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. Marcom's Interactive Engineering team works on high-impact projects that serve various Apple lines of business. We use modern technologies to evolve and deliver solutions on a worldwide scale. Working with a variety of multi-functional teams, Interactive Engineering delivers experiences with an excellent group of software engineers while having fun along the way. The team is exciting and fast-paced; it’s a great place for people with exacting standards who want their work to matter.", "description": "The Full Stack Senior Software Engineer will collaborate with the members of multiple teams diagnosing and debugging complex systems, and participating in investigating build, deployment and operational issues. You will collaborate with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability. Responsibilities include but will not be limited to: - Work with developers in a fast paced environment where multiple releases daily are a fact of life in tight deadlines - Maintaining outstanding attention to details and a deep commitment to excellence within the team - Working within tight timelines to solve critical issues - Working equally well with people in creative and technical positions - Forging trusting relationships within a diverse team and across organizations - Working closely with business stakeholders to understand their requirement, define solutions and determine future strategies", "key_qualifications": "At least 8-10 years of professional software development experience designing and developing complex, highly available and scalable enterprise web/mobile based applications using Java/J2EE technologies, 3+ years of validated experience designing and developing large scale enterprise level Content Management Systems using Adobe Experience Manager (AEM) or any other similar CMS software with next generation Hybrid/Headless implementations, A Bachelors degree in Computer Science or equivalent work experience, with a focus on fundamentals in data structures, algorithms and object-oriented design, Deep understanding of core web technologies including XML, HTML5, CSS, client/server-side-scripting languages such as JavaScript with the ability to build a reliable, efficient, good-looking SPA and web services development using RESTful implementations, Solid understanding of software development lifecycles, testing methodologies, and solid QA automation processes, Knowledge of CI/CD tools like Jenkins, Maven, Docker, and configuration management systems such as Kubernetes or similar grid computing technologies, CI build tools such as Jenkins, and distributed logging and monitoring tools like Splunk, Grafana, Experience with any modern JavaScript frameworks (React/Vue/Angular), as well as designing and architecting SQL/NoSQL databases for scalable database schema designs", "preferred_qualifications": "Deep understanding of core technology frameworks such as GraphQL, Apache Web, Apache Sling, Apache Felix and OSGI, Experience with multi-caching solutions for real-time content delivery, Experience in AWS/Cloud Technologies, An appreciation for quality with experience writing unit tests and collaborating with quality engineering to develop test plans, In depth knowledge of source version control software (Git), Adobe certified AEM architect is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557612"}