{"title": "Database Engineer, Infrastructure Services", "summary": "The Data Services Team is on the lookout for an experienced Database Engineer to join our team. As a pivotal member, you will orchestrate the development of database architecture and design solutions to uphold our expansive database infrastructure crucial for supporting our critical IS&T environment.", "description": "In this role, you will not only navigate various RDBMS technologies but also oversee dynamic distributed database environments crucial for supporting OLTP, OLAP systems. Collaboration will be at the heart of your responsibilities, as you collaborate closely with a diverse, multi-functional team, both locally and remotely, to drive the design, development, and support of our next-generation products and processes.", "key_qualifications": "8+ years of experience in the field of managing complex and large scale distributed database systems. Proven track record in designing, implementing, and maintaining distributed relational data stores at scale, including platforms such as CockroachDB. Proficiency in Python, Perl, and Shell scripting, complemented by a proven track record of seamlessly migrating mission-critical applications to cloud environments. In-depth understanding of ClickHouse's columnar database architecture, its distributed capabilities, and expertise in optimizing query performance for analytical workloads. Proficiency in TigerGraph's graph database functionality, including schema design, traversal algorithms, and graph analytics techniques for handling interconnected data structures. Familiarity with infrastructure automation tools (e.g., Ansible, Terraform) and scripting languages (e.g., Python, Bash) for provisioning, configuration management, and deployment of distributed database environments across different platforms. Commitment to staying updated with emerging technologies, industry trends, and standard processes in distributed data management, adapting quickly to changing business requirements and technological advancements in relational, columnar, and graph database domains.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent experience", "additional_requirements": "MySQL/Postgres expertise, ML/AI experience, Docker/Kubernetes experience", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546114"}