{"title": "App Store Lead - META", "summary": "Apps have super powers. They not only have the power to transform your iPhone into a personal trainer or your iPad into a digital dark room, but they can also enable you to fling some birds at pigs or run a racing team while you're waiting for the bus. All these amazing possibilities live in the App Store. At Apple, we are committed to ensuring developers reach the right customers and provide them with these groundbreaking experiences. Helping developers find the best business models and guiding them to success is core to what we do on the App Store. We are seeking a highly qualified business leader to lead the App Store Business for the Middle East, Türkiye and Africa. A key member of the Services leadership team, you will be driving the vision for growth for the App Store and corresponding developer businesses in the regions you cover. The ideal candidate will be able to help grow our business through supporting developers and building outstanding customer experiences. If you have a passion for apps, games and the wider industry surrounding them, then we want to hear from you!", "description": "In this role you will : -  Define strategy in close collaboration with local & global management and leadership teams. -  Lead a team of Business Managers and editors, defining, coordinating and executing on programs that grow the App Store business. -  Run and expand business relationships with existing and prospective partners in the app developer and publisher space. -  Be aware of upcoming and ongoing releases and collaborate with Editorial and Marketing teams to execute promotional campaigns. -  Lead and inspire the App Store team to craft the best experience for customers and developers while featuring the best apps available. -  Strong strategic and analytical skills, with the ability to communicate results clearly and effectively to leaders with proficiency in Excel/Numbers and Keynote. -  You are creative and resourceful and know how to think different.", "key_qualifications": "", "preferred_qualifications": "Comfortable delivering against tight and sometimes shifting deadlines. Extraordinary social and relationship-building interpersonal skills. Ability to work with international peers collaboratively across timezones. Outstanding organizational skills and experience balancing multiple projects simultaneously. Fluency in English is required. Additional languages are a plus, Arabic fluency is useful but not a requirement", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555065"}