{"title": "AIML - Sr Engineering Program Manager, Siri Platforms", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? The Siri Assistant team is building groundbreaking technology... and we are looking for people like you! We’re looking for a strong Sr. Engineering Program Manager with a proven track record of building and maintaining complex software platforms, tools and processes that deliver new end-to-end experiences that delight customers. Our team is Siri Platforms where we build the solid foundation on which other teams create delightful user experiences. We are looking for excellent self starters with strong initiative and drive for results.", "description": "You will drive programs and/or projects that support Siri Platforms including driving feature definition, system architecture, timelines, milestones, risk management, and program execution. This includes collaborating with multiple partner organizations relevant to the project. Communication is critical. You will provide clear, timely, concise and objective communication, including regular program status updates, critical issues and mitigations, changes in plans, risks, and asks as needed. You will also drive (as needed) discussions and break down complex issues into manageable chunks in order to drive engineering, design, and other teams to alignment while maintaining great teamwork and collaboration. You will own the program end-to-end - from inception to delivery. You will create and manage project timelines and milestones with clear dependencies, critical path and deliverables with a communication strategy. You will also manage risks, mitigations, and re- plan as needed. You will drive on time delivery and deployment with necessary checkpoints and status updates. As a part of execution, you will also identify issues and drive towards solutions with cross-functional teams", "key_qualifications": "", "preferred_qualifications": "In addition to the minimum qualifications above, some preferred qualifications include: 10+ years of experience in project or program management Have personally orchestrated the delivery of multiple significant client/server and end user consumer facing software products requiring large organizations (20+) to execute Proficiency in Agile, SDLC development processes Strong leadership skills, including coaching and team-building Superior group facilitation and interviewing", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558259"}