{"title": "Enterprise Technical Support Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! We're seeking a Technical Support Engineer to work in the AppleCare Enterprise Services group providing advanced technical assistance via telephone, e-mail, and occasional on-site visits to ACES Enterprise customers deploying solutions based on Apple products.", "description": "In this role, you will:\nProvide solutions to technical problems for system administrators deploying, managing, and integrating Apple products with third party products and server platforms, or networks. Assist in the creation and maintenance of technical resource documents and other operational duties within the department. Work with customers to address post-sales technical customer support issues. Craft and supervise technical critical issues retaining customer issue ownership in order to provide timely follow up with customer as required. Work with many multi-functional groups including Apple Sales, Product Engineering, Product Marketing, and service groups within Apple, to champion and resolve customer issues. Responsible for effectively positioning Apple's support products and technical solutions. Follow established procedures. You will have maintained above average attendance and phone metrics in the most recently held support position. You will be a strong advocate for happiness of customers and have excellent general knowledge of networking and server administration, with strong technical foundation in troubleshooting theory and aptitude. Have validated experience with iOS, Windows, or Unix, administration is ideal. Strong self-motivation and flexibility and willingness to accept additional responsibilities as they develop. Research, investigate and provide high quality responses to technical inquiries and maintain an ongoing authoritative knowledge of diverse technologies and able and willing to pursue new roles, assignments, and responsibilities as needed.", "key_qualifications": "1+ years experience as an AppleCare SPS Business and Education Advisor, AppleCare Deployment Program Specialist Advisor or equivalent experience required. iOS deployment with Apple Business Essentials and/or 3rd party Mobile Device Management understanding desired. Ability to collect information and engage in complex problems as well as willingness to work with team members asking and answering inquiries. Experience with integrating, aiding support for and troubleshooting Apple products in multifaceted environments. Experience using client and device management tools such as Mobile Device Management software and supporting and troubleshooting Microsoft and UNIX operating systems and directory services. Knowledge of UNIX command-line, scripting, backup/restore operations, network storage troubleshooting a plus. Self starter with excellent Enterprise level customer-facing interface skills along with excellent written and verbal communication. Senior-level department server administration experience is a plus.", "preferred_qualifications": "", "education_experience": "BA degree, or equivalent experience", "additional_requirements": "Occasional (scheduled) domestic and international travel, after-hours, weekend, and on call duty rotation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $93,100 and $139,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551407"}