{"title": "User Research Scientist", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each otherʼs ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. Itʼs the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, youʼll do more than join something — youʼll add something. The Vision Products Group is working with some of Apple's most advanced and exciting technologies, including augmented reality (AR) explorations. As a member of our fast-paced organization, you will have the opportunity to be part of a rapidly evolving team, developing innovative technologies that will delight and inspire millions of people. We are seeking a User Research Scientist to join our team. In this role, you will be responsible for facilitating and managing multiple research-focused data collections. You will work full time on site with our core engineering teams.", "description": "A successful User Research Scientist will have excellent analytical and communication skills, strong study moderation and project management experience, and will thrive in high pressure, high performance data-driven organizations. In this role you will work full time, on site with our growing data collection, user research, and engineering teams. YOU WILL BE RESPONSIBLE FOR: Collaborating with software teams, quality engineers and data consumers to stand up and operate large-scale research data collections Moderating and troubleshooting highly-technical, hands-on user studies Leveraging observations from data collections to mitigate risks to project or product timelines Working both independently and in collaboration with highly technical teams on accelerated timelines Leading external vendors to handle project tasks and provide direction to achieve deliverables Communicating research findings with both technical and non-technical stakeholders Advocating for user experience Building strong relationships among cross-functional teams Actively ensures participant adherence to relevant study protocols", "key_qualifications": "Experience conducting in-person user studies & data collections operations, Strong leadership skills and ability to inspire teams, Ability to pivot and to formulate creative solutions to emergent problems, Enthusiasm for tackling rapidly evolving study and data demands, Ability to problem solve hardware and software issues under pressure, Strong advocacy for usersʼ experience and comfort, Consistent, clear communication of varying technical depth with colleagues, Adaptable, have precise attention to detail, and have a strong work ethic, Ability to work on-site full time, Occasional travel may be required", "preferred_qualifications": "", "education_experience": "Bachelorʼs degree in Computer Science, HW/SW Engineering, Data Science, Cognitive Science, Operations Engineering, User Research or equivalent industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552070"}