{"title": "Trainer - Asia Procurement and Ops", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Within Asia Procurement and Operations, we are looking for an experienced trainer who has a passion for inspiring and empowering others through impactful learning experiences. This individual will be primarily responsible for the designing, developing  and deploying of key learning solutions for managers and employees. The role also includes coaching managers and employees to improve performance...", "key_qualifications": "", "preferred_qualifications": "Certification in training or instructional design. Strong interpersonal skills. Ability to work with and influence cross-functional partners to build and achieve strategic goals. Familiarity with virtual training platforms and e-learning development tools. Advanced skills in graphic design, video and images editing is a plus. Experience to leverage AIML in learning solution design, development and implementation. Experience in event management. Experience in coaching. Experience in interacting with and influencing all levels of Management. Ability to work with a flexible schedule. Willingness to adapt to rapidly changing environment and new challenges.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560071"}