{"title": "SoC Power Flow Methodology Engineer", "summary": "Do you love creating solutions for complex challenges? As part of the Low Power group within Silicon Technologies, you’ll help deliver cutting-edge new technology and capabilities for low-power chip design that fuels Apple’s next-generation chips! In this role, as a member of our dynamic group, you will be responsible for the development and enhancement of our low-power flows, providing designers new capabilities in terms of power domains unseen in previous chips, while working on highly visible products used by millions of people every day!", "description": "As a Power Flow Methodology Engineer, you’ll deliver new automated solutions and capabilities for the Silicon Engineering Power team to build chips that are more power efficient than ever before. You will help with the architecture, implementation, and verification of new low-power design and verification flows and help to craft the low-power methodologies across a wide variety of future technologies. The work involves creating flows and tools related to power analysis, optimization and verification which may be run as part of RTL construction/verification, synthesis, or P&R. Additional responsibilities include communicating with the design team to answer questions about the materials and drive issues to resolution.", "key_qualifications": "Good understanding of VLSI designs and SOC design flows. Strong passion for scripting and applying low-power domain-specific knowledge to create new software solutions. Strong background with flow development and/or object-oriented language algorithm design such as Python / C++ / Java. Solid understanding and proven track record using modern software testing and development practices. Good written/verbal communications skills are required. Knowledge of Tcl / Perl, experience with EDA tools, GUI development, and/or low-power concepts such as UPF and low-power design is a plus.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552821"}