{"title": "SWE - Program Manager, Security Engineering", "summary": "Security is at the heart of each of the products that Apple ships and gives our customers confidence when using their devices. Apple’s Security Engineering & Architecture (SEAR) provides operating system security foundations across all of Apple’s innovative products, including Mac, iPhone, iPad, Apple Watch, and Apple TV. These foundations exist from the lowest levels of the device to the services off-device which work together to protect our users. Does the idea of shipping devices to hundreds of millions of users appeal to you? Are you passionate about driving forward security evaluations? We are looking for an individual with strong communication, program management skill and, ideally, a knowledge of security to support a team that is responsible for offensive research and security certifications of all Apple products. You will work with and influence colleagues across Apple to ensure security continues to be at the forefront of our products. You will join a team of project managers committed to and passionate about our security technologies.", "description": "You will coordinate with cross-functional teams to understand the program plan for the schedule and to define plans for the execution of security evaluation and certification. Also, you will need to quickly identify and resolve inter-dependencies or alignment issues to support the team in partnering with several organizations. It will be expected from you to clearly escalate major concerns to appropriate stakeholders. You will be the primary point of contact with partners from multiple divisions to define evaluation schedules and deliverables. Identifying projects risks to ensure the respect of timelines will be key. Communicating the project goals and progress to management, project team and partners will be an important part of this role. Finally, you will be responsible for identifying process improvement areas, for proposing solutions and carrying through roll-out.", "key_qualifications": "Project management experience in engineering development and/or security, Self-motivated and proactive with demonstrated critical thinking capabilities, Passionate about quality and meticulous attention to detail, Ability to distill relevant information for the right audience, including via usage of reporting and dashboards, Proven ability to work effectively with stakeholders across a cross-functional organization, Proven extensive experience leading complex and large cross functional projects, Exceptional verbal and written communication skills in English", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549367"}