{"title": "RF System Validation Engineer (m/f/d)", "summary": "Would you like to join Apple’s fast growing cellular wireless team? Our team is responsible for validating the RF performance of top-notch, monolithic, cellular transceivers and the RF sub-systems built around them. In order to expand our team’s validation capability towards future Apple products, we are looking for an experienced, passionate RF engineer with good programming skills. The world-class cellular RF sub-systems developed in our labs are enabling Apple mobile devices in un-compromised cellular network connectivity at lowest possible battery drain, enabling long hours of enjoyable customer experience. Thus join us and leverage your passion for RF and excellence, bringing your education and experience to the world's most innovative company!", "description": "We are searching for an experienced Cellular RF System Validation Engineer. In this role you have the unique opportunity to be at the forefront of market-leading, cutting-edge cellular transceivers. Responsibilities include: - Develop automated test scripts to characterize and optimize parametric performance on RF sub-system level, or block level, at a laboratory test bench or at remote test stations - Assess key performance parameters according to design specifications or 3GPP specifications, debug and optimize RF parameters on system level to meet 3GPP compliance in mass production (2G/3G/4G/5G) in SC / CA for FDD / TDD mode - Collaborate closely with tooling experts to program routines in a framework for HW regression tests - You will develop your verification plans in a cross functional team together with design and system leads - You operate with RF measurement equipment and communication tester for cellular standards in non-signaling and signaling mode on modem level - Analyze issues & root cause identification encountered during investigating the DUT, with the ability to identify and solve problems as well providing ideas for workarounds, either alone or in collaboration with other teams - Support RF feature definition with responsibility for implementation and validation (digital predistortion) - Ownership varies from component level / SoC bring up to fully featured operation on modem level - Connect the work carried out between existing pre-silicon investigations and implementation in post silicon environment and product design - Prepare and present status & progress tracking", "key_qualifications": "", "preferred_qualifications": "Master´s degree or PhD in Electrical/Hardware Engineering or Computer Science with RF background, or proven industrial experience/degree equivalent\nThe ability to collaborate technically with various teams of the project setup (Design, Firmware, System, etc.)\nTeam spirit, excellent communication skills and the desire to accept diverse challenges are essential\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559129"}