{"title": "Buyer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. BuySell is to achieve the strategic benefit for Apple by controlling the component purchasing from suppliers and selling to contract manufacturers.", "description": "-  Execute purchase requisitions, purchase orders to suppliers to enable the on time delivery from supplier. -  Execute sales orders to OEM and closely monitor the good receipt status. -  Monitor and optimize the logistic flows from supplier to OEM. -  Maintain the accurate business system data such as part source information, customer information, price and etc.) -  Coordinate with supplier and OEM to assist Finance department for payment issue investigation & resolution. -  Implement the EDI with supplier and OEM by participating the UAT and other Business Process Re-engineering projects. -  Lead the buy/sell process training and set up activities with new vendor and OEM to meet company supply chain strategy. -  Inventory hub space and inventory management -  Execute the RMA process with OEM and supplier", "key_qualifications": "", "preferred_qualifications": "Experience in multi-national company or JV is preferred, Strong driving & communication skills, through effective channels to build broad-based relationships and support, Coding experience such as Python, SQL, JAVA, etc, Maintain a positive attitude and forward thinking approach despite troubling circumstances or setbacks, Proven leadership and assume responsibility without instruction, Approach problem with flexibility, and move beyond traditional ways of doing things", "education_experience": "BS/BA and above", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552498"}