{"title": "NPI Operation Program Manager", "summary": "Imaging what you could do here! At Apple, creative ideas have a way of becoming wonderful products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! The Regional Operations New Product Manager leads all aspects of new product development and product launch within Operations in Asia and is directly accountable for the results. Responsibilities include achieving goals for time to market, cost, quality, product availability and order cycle time. The New Product Manager in region is the primary leader and interface between Operations, Product Design, Engineering teams.", "description": "-  Lead the operational side of development builds during new product introductions for any assigned products. -  Lead Apple team's new product introduction efforts during ramp within the Operations sphere. Specific goals include team leadership in driving issue resolution, supply chain design, schedule, cost, quality, availability and order cycle time goals. -  Engage with OEM manufacturing partners to develop, ramp, and introduce products. Develop rapport with partners and detailed knowledge of \"how the factory works,\" its capabilities and limitations. -  Lead matrix team members from across all functions in Asia within Operations to develop new product plans. Typical functions include WW Planning, Global Supply Managers, Technical Program Manager, Quality, Supplier Quality Engineer, Test Engineer, Design For Manufacturing. -  Represent operations with the product design teams. Use production expertise to influence and negotiate for DFX, supply chain, testability, product features. -  Identify, marshall and organize resources (Apple Staff, OEM Staff, Contractors, etc) to meet required goals. -  Communicate project status updates to various project partners, including team members and executives within Apple and OEMs. Synthesize a multitude of issues into a clear, concise and focused message. Present with confidence and brevity. -  Always push the leading edge of innovation and excellence in Apple products and program management practices. -  Support coverage in other products in the region. Travel to another location on other products on an as-needed basis to drive issue resolution and/or support build/ramp activities.", "key_qualifications": "-  A minimum of 8-10 years ops experience, preferably in a high tech or computer-related industry. -  Current knowledge of extraordinary supply chain management practices. -  Experience with consumer electronic manufacturing technologies (preferred) in the areas of design, process, commodity cost, factory cost, supply and quality management. -  Track record achieving significant results on sophisticated projects in an often ambiguous and always constantly evolving environment. -  Demonstrated leadership in driving solutions to challenges. -  Incredible drive, motivation, and energy to completing any challenge given. -  Strong analytical capabilities coupled with good business savvy. - Exceptional communication skills (in both Mandarine Chinese & English) - verbal, written and executive presentations. -  Exceptional ability to establish relationships and exert effective influence in a matrix organization. -  Ability to think strategically, while driving tactical program execution. -  Attention to detail without becoming lost in the details. -  Operate in an ambiguous environment, taking charge in the absence of leadership.", "preferred_qualifications": "", "education_experience": "-  An MBA or MS. A combination of both formal education and experience in Engineering and business is preferred. Equivalent experience is acceptable.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533971"}