{"title": "Senior Mechanical Engineer", "summary": "At Apple, we develop revolutionary technologies for products that will define how we interact with technology and communicate in the future. To help us with this, we are looking for very skilled people that want to do the best work of their lives in an environment of excellence, creativity, innovation and partnership. If that sounds intriguing to you, then let's talk. The Cambridge Hardware Incubation team is a small, agile and multi-disciplinary team forming part of the wider Apple Hardware Technology organisation. We are pursuing ground-breaking hardware development to enable future products and features that enrich the lives of our customers. We are looking for an exceptional multi-disciplined engineer with mechanical design, while having great practical and modelling skills. You will work on hardware development projects to help us explore new technologies, while working in a small team in Cambridge as part of a larger project involving teams around the globe.", "description": "A successful candidate will work on prototype development, beginning with initial hand calculations, progressing through 3D CAD, FEA and finally to realisation. As part of this process, an ideal candidate will be able to perform initial technology feasibility analysis by identifying top challenges and evaluate using first principles. A system-level mindset, considering multiple requirements is essential while experience in opto-mechanical design is a big plus. There is a strong practical focus in our hardware incubation team, so hands-on experience and a willingness to prototype new ideas is essential. A self-starting attitude and ability to work independently, but also as part of a team, is essential.", "key_qualifications": "", "preferred_qualifications": "Degree in Mechanical Engineering, Physics or another related engineering program. Higher degree or Masters preferred. Willingness to pick up novel tasks and acquire new skills. A scientific mindset and approach to problem solving. Excellent communication and teamwork skills. An innovative mindset is essential", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556860"}