{"title": "Engineering Project Manager, Retail Engineering", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe Financing and Retail Systems team is seeking a highly skilled Engineering Project Manager to lead Retail programs of varying scale and complexity. The ideal candidate will possess a blend of technical expertise and project management experience to drive successful project outcomes. This role requires exceptional leadership, communication, and organizational skills to ensure the efficient execution of Retail projects.\n\nAs an EPM, you will provide leadership and guidance to project team members, promoting accountability and driving performance excellence. You will be expected to establish effective working relationships with stakeholders and external partners, serving as the primary point of contact for providing regular updates on project status, milestones, and key deliverables.", "description": "- Lead multi-functional development teams and collaborate with both internal and external partners at Apple.\n- Effectively and consistently communicate overall program status.\n- Strive for excellence even under competing priorities and pressures.\n- Proactively identify and resolve conflicts, risks, and inter-dependencies.\n- Approach problems flexibly and be willing to adapt and modify your approach without compromising on the outcome.\n- Effectively lead meetings ranging from 2 to 40+ participants and communicate resulting actions.\n- Foster collaboration and seek to understand multiple perspectives.\n- Support Apple product launches.\n- Work across different time zones.", "key_qualifications": "", "preferred_qualifications": "Payments and financing background preferred but not mandatory\nStrong business acumen, with the ability to analyze data and make data-driven decisions\nSuccessful track record in handling large-scale, high-profile projects and meeting deadlines\nSolid understanding of software development methodologies\nExcellent documentation skills", "education_experience": "Bachelor's degree in Business Administration, Engineering, or a related field\n5+ years of proven experience in engineering project management", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559118"}