{"title": "AppleCare Strategic Quality Process Improvement Program Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. In the Quality projects space, we partner with worldwide cross-functional teams to implement effective quality initiatives that will improve customer support workflows, improve performance and deliver outstanding customer experience while prioritizing the needs of the business in a thoughtful and scalable way. We collaborate with operational and project teams on high-level requirements and strategies on projects that impact global support teams ensuring the highest level of customer experience is maintained. We consult on program KPI design, lead problem-solving efforts against performance gaps, prioritizing the needs of the organization in a scalable way.", "description": "This role has dual responsibilities. You will be responsible for running and assisting with quality improvement projects alongside managing the sustainability of select strategic quality programs. Projects will include project chartering, current state analysis, root cause analysis, testing/piloting/proof of concept, engaging Change Management and leading high-visibility partner readouts. Program management would include partnering on select strategic quality programs. It is critical that you develop a strong working relationship with each of your partners. You should be an excellent communicator who is self-motivated and is comfortable working in a global, matrix, fast-paced environment. You will work cross-functionally with a variety of internal groups to improve the quality of our services and efficiency and scalability of our quality operations. As a whole, you will: Build strong relationships with all key cross-functional teams from site management to AppleCare Engineering, Analytics & Reporting, Regional Quality, technology teams and more. Employ structured problem-solving methods to steward groups of subject matter experts through complicated problems. Lead business process mapping for new and pre-existing processes. Have a curious eye and look for innovative solutions to problems or new ways to achieve goals. Closely monitor operational metrics daily, weekly, monthly, and quarterly.", "key_qualifications": "Minimum 5+ years of process improvement/continuous improvement experience, Ability to deliver large scale DMAIC/A3 projects on-time with consistently successful measurable results, while working across departments and time zones, Experience designing balanced program scorecards and target KPIs, Experience leading Failure Modes and Effects Analyses, Extensive program & project management experience working with quality monitoring programs within a customer service organization or outsourcing partner, Collaborative, flexible and open working style, with an ability to establish and maintain close working relationships with key partners, Ability to influence and manage multiple organizational partners and balance the needs of our customers and business, Communicate priorities, wins and challenges back to organizational partners, Experience assisting organizations in establishing key risk indicators that enable effective monitoring of risks and early identification of potential issues, Has synthesized results of quantitative and qualitative analyses into key trends, implications, and recommendations for the program, Provided mentorship, oversight, and support to the evolution of quality programs and results throughout the customer experience lifecycle, Partner closely, and cultivate trust with the senior team members and SMEs to partner on, and implement, initiatives, Role requires 5-10% travel", "preferred_qualifications": "Lean Six Sigma Black Belt (CLSSBB), Project Management Institute Project Management Professional (PMP), COPC, Customer Experience (CX) certifications preferred, Understanding of call center quality management processes; calibration, joint-contact-monitoring, quality standards, quality metrics, Graduate degree in business or engineering", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560318"}