{"title": "Data Analytics Manager", "summary": "If you have passion for using data to drive design and architecture decisions, join Apple as a Data Analytics Manager in our Storage Analytics team. This role is perfect for a passionate individual with a strong background in distributed data processing who thrives on turning data into actionable insights. If you are driven by the challenge of continuously enhancing how we use data to create amazing products, we want you on our team!", "description": "As a Data Analytics Manager on the Storage Analytics team at Apple, you will play a pivotal role in managing a team of data analysts and data engineers working across various storage-related domains. Your responsibilities will include architecting data solutions, managing plans and schedules, and overseeing your team as they perform exploratory data analysis and build data pipelines. You will communicate with cross-functional teams and upper management to present results, conduct code reviews, and ensure statistical validation of the team's work. Additionally, you will guide your team in using tools like Jupyter and Tableau to explore and visualize data for publication to client teams. You will also participate in periodic infrastructure support for our team’s Python-based, distributed microservices. This role requires someone with a strong technical background who is comfortable working in a fast-paced, dynamic environment. If you have the required qualifications and are excited about the opportunity to join a world-class team, we would love for you to apply today!", "key_qualifications": "Ability to lead data investigations and analysis projects with ambiguous requirements. Advanced statistic and modeling knowledge. Experience visualizing and presenting analyses in tools like Jupyter and Tableau. Familiarity with distributed computation, storage, and workflow management (e.g. Splunk, Spark, Kubernetes, Kafka, Hadoop, MapReduce, AirFlow etc.). Proficient Python and SQL and not afraid to roll up your sleeves to handle complex tasks when needed. Excellent written, verbal, and data communication skills", "preferred_qualifications": "Experience leading high performing teams and engaging with senior stakeholders. Highly organized, creative, motivated, and passionate about achieving results. Self-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity. Curious and have excellent analytical and problem solving skills. Proficient in C/C++/Objective-C/Swift and source control management like svn or git. Familiar with storage, SSDs and IO paradigms", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554401"}