{"title": "Mac Product Design Engineering Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "PD EPM will be responsible for: -  Supporting system EPM to manage critical modules, upstream mechanical parts to meet project schedules -  Maintaining communication within product development team. -  Cross-functional organization, communication, and management -  Drive engineering activities at vendor side including build planning, material vendor qualification, DOEs, engineering validations etc. -  Collaborate with system team to resolve engineering issues related to upstream parts and modules -  Travel to support engineering builds, including managing pre- and post- build activities, and ensuring daily status communications get sent back to the Cupertino team -  Work with and coach suppliers on Apple project management expectations and requirements -  Reporting and presenting to senior management on project status and schedules.", "key_qualifications": "N/A", "preferred_qualifications": "3+ years in consumer products and/or other product development, Experience working with offshore manufacturers and travel to manufacturing sites, Strong organizational and management skills, flexibility during the change of time, Being flexible with domestic and international traveling", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554994"}