{"title": "Software Engineering Internships", "summary": "Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple is seeking highly motivated, engineering students with a strong background in either Back-End Engineering, Core OS, Web Development, and iOS and/or macOS app Development to join its team of highly skilled software engineers.", "description": "Some responsibilities in Software Engineering may include: Backend Development, Core OS, User Experience (UX), User Interface (UI), iOS and Web Development, Information Systems & Technology (IS&T), Information Security, Engineers at Apple work on both UI level and lower-level implementation details. The successful intern candidate will be amenable to working in an exciting, fast paced, dynamic, collaborative environment. The person filling this position must be a hands-on, enthusiastic, self-motivated developer with strong initiative. You will have a real passion for extraordinary user experiences and an eye for details.", "key_qualifications": "", "preferred_qualifications": "It’s helpful if you meet one or more of the following qualifications, but it isn’t a requirement. Strong object-oriented design skills, coupled with a deep knowledge of data structures and algorithms. Proficiency in one or more developer skills: Java, C/C++, PHP, Python, Ruby, Unix, MySQL, Clojure, Scala, Java Script, CSS, HTML5, Swift. Experience with distributed technologies such as HDFS, Spark, Golang, Hadoop, Mongo, Pig, Hive. Experience with web frameworks such as AngularJS, NodeJS, SproutCore. Experience with iOS and macOS developing in Swift, XCode or Objective-C. Client-Server protocol & API design Skills. Able to craft multi-functional requirements and translate them into practical engineering tasks. A fundamental knowledge of embedded processors, with in-depth knowledge of real time operating system concepts. Excellent debugging and critical thinking skills. Excellent analytical and problem-solving skills. Ability to work in a fast-paced, team-based environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554359"}