{"title": "GPU Performance Analysis Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Engineering Group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!", "description": "As a GPU Performance Analysis Engineer, you will:\n-  Analyze unit and system-level performance issues.\n-  Quantify the performance benefit of the features and algorithms implemented in HW or SW.\n-  Conduct studies and contribute solutions to performance challenges related to GPU design.\n-  Participate in micro-architecture specification and RTL logic design in the GPU team.", "key_qualifications": " ", "preferred_qualifications": "Experience with GPU design is a plus.\nWe prefer candidates who exhibit excellent communications skills, demonstrate a sense of motivation and show a high level of organization.\nWe like people who are fast learners and are eager to tackle technical challenges using innovation.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557177"}