{"title": "ACD Art Director, Marketing Communications, London", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "Collaborates with ACD/Writers/other team members to concept ideas and co-direct teams to produce quality work. Works with designers to guide art direction and design. Crafts, reviews, and empowers campaigns for the Apple brand and products. Presents work to senior creative staff, product marketing managers and Apple executives. Articulates concepts with energy and enthusiasm. Works across subject areas to integrate strategies and messaging for online, retail, channel, events, advertising and new mediums of communication. Works with project managers and creative directors to ensure that schedules are accurate and realistic, and that deadlines are met. Guides' creatives to do their best work and to support each other’s strengths.", "key_qualifications": "", "preferred_qualifications": "You have proven experience in ideating award-winning, mold-breaking, culture-shifting work. Your work is grounded in original ideas, implemented with outstanding craft and meticulous attention to detail. You have strong experience with cross-functional collaboration and successfully leading teams in creative projects. You have produced work in the multifaceted mediums of advertising, social media, conceptual campaigns, product launches, branding, photography, film and video. You are passionate about excellent design and art direction that is thoughtful, meaningful, provocative at times, clear and inspiring. You are used to working proactively in a creative and dynamic environment. You understand the worlds and language of film and photo production. You have an eye for the aesthetic and the ability to create a powerful story through your work.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559595"}