{"title": "Apple’s Core Services Network Operations - Network Engineer", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we create products and experiences people once couldn’t have envisioned — and now can’t imagine living without. If you’re excited by the idea of making an impact, joining a team where we pride ourselves in being one of the most diverse and expansive companies in the world, a career with Apple might be your dream job. Quite simply, our teams keep Apple’s world-class networks running. We are a global community of engineers who work together to operate a multi-vendor network that interconnects Apple’s large data centres, campuses and smaller regional or national offices, as well as providing connectivity to partner networks on our Internet-scale backbone network. We are looking for an enthusiastic and passionate person to join a dynamic and exciting team within Apple’s Core Network Services, supporting Apple’s backbone network. You will be skilled in cross-organisational collaboration, liaising with internal teams and external service providers to operate and maintain the network infrastructure. You will need to develop and maintain clear documentation and procedures associated with operations and known issues. This position provides the opportunity to operate a cutting-edge, worldwide, multi-vendor network.", "description": "In this fast paced role, you will provide front line support for Apple’s network to address a wide variety of business challenges. You will be comfortable in a dynamic environment with the ability to multi-task and provide operational support to various businesses within Apple. This position requires a collaborative teammate who will enjoy working in multi-functional groups and who has the ability and willingness to work with others around the globe. You will need to be a life-long learner, as we have such a diverse network that the opportunities to acquire new knowledge and experience are endless. Your responsibilities will include working on resolving incidents that occur, maintaining and upgrading existing networks to current standards, and sustaining operations, as well as contributing to technical and procedural documentation. In this role you will enjoy diving into minute details and drive operational excellence in every aspect of your work to deliver the best possible customer experience. In addition to the required technical networking skills, this position will also draw on strong interpersonal skills and an individual who enjoys the dynamic nature of Apple’s environment. If you enjoy close collaboration, open and active discussion, and following through on the details, we think you’ll love being part of our team.", "key_qualifications": "", "preferred_qualifications": "Some proficiency with Linux preferred. B.Sc. degree or equivalent experience. Juniper JNCIA/JNCIP, Cisco CCNA/CCNP, or equivalent experience. Additional Requirements: Flexibility to work in a day-time shift pattern.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555209"}