{"title": "Engineering Program Manager, Retail Engineering", "summary": "Imagine what you could do here! At Apple, excellent ideas have a way of becoming great products, services, and customer experiences. Bring passion and dedication to your job and there’s no telling what you could accomplish. The people at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. Apple is where individual creativities gather together, contributing to the values that lead to extraordinary work. Every new product we build, service we create, or Apple Store experience we deliver, is the result of us making each other's ideas stronger. The IS&T Retail Engineering organization has the goal of providing an intuitive, seamless and inspiring customer shopping experiences through interactions with our people, products and services. We are looking for a hands-on Engineering Program/Project Manager who can lead large strategic programs/projects by mobilizing cross functional team members across both business and IS&T leaders to influence, drive and implement groundbreaking retail concepts into reality. This person will be responsible for all aspects of large cross-functional projects including scope, requirements, timelines, risks, and change management. Our ideal candidate can lead communication - apprising status, and issues to team members, all levels of management, and strategic technical and business stakeholders.", "description": "Our ideal candidate can demonstrate courage, energy, and an ability to manage ambiguity. As an expert change leader navigating uncharted technology advancements, we need someone to build strong collaborative relationships and calmly manage conflicts along the way. We are looking for someone to be responsible for successful outcomes and delivery with laser focus on execution with a keen eye for the important details. If you relish challenge and are passionate about working with a great team on amazing new technology please apply!", "key_qualifications": "", "preferred_qualifications": "5 years e-commerce programs and product management experience in large corporate environment, Ability to exude confidence around business and engineering executives (Directors, Sr. Directors, VPs), Ability to lead, take action and provide goal-oriented direction in the face of ambiguity, Comfortable expressing a point of view and influencing change across projects, programs and processes, Knowledge of Apple Retail and core products and operating systems", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559205"}