{"title": "Computer Vision and Deep Learning for 3D Reconstruction and perception Student", "summary": "We are looking for a hardworking student to join our team and assist in prototyping advanced solutions for 3D reconstruction and perception using innovative deep learning techniques. This role promises hands-on experience in designing, building, and refining prototypes alongside our expert researchers.", "description": "Prototyping : Develop and refine prototypes for applications in 3D reconstruction and perception. Collaborate with team members to integrate deep learning models into functional prototypes. Ensure optimal performance of prototypes by debugging and optimization. Research: Assist in the development of algorithms and models related to 3D reconstruction and perception. Implement and validate models using experimental data sets. Stay updated with recent advancements in the field to inform prototyping efforts. Collaboration: Work in sync with interdisciplinary teams to integrate prototypes into larger projects or research studies. Collaborate with international teams.", "key_qualifications": "Strong understanding of machine learning, deep learning, computational geometry, and computer vision. Experience with deep learning frameworks like TensorFlow, PyTorch, or similar. Proven programming skills in Python (C++ and Metal/CUDA are an advantage). Knowledge in robotic perception, SLAM, or other related areas (Preferred). PERSONAL ATTRIBUTES: Analytical, diligent, with a drive for problem-solving. Proficient in both written and verbal communication. Ability to work both autonomously and collaboratively. Passion for building functional and efficient prototypes.", "preferred_qualifications": "", "education_experience": "Enrollment in a Master’s or Ph.D. program related to Computer Science, Computer Vision, Artificial Intelligence, or a related field.", "additional_requirements": "Please add your Grades sheet when applying. Apple is an Equal Opportunity Employer committed to inclusion and diversity. We take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, and individuals with disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545127"}