{"title": "Compensation Business Partner", "summary": "At Apple, our number one resource is our people. As a Compensation Business Partner, you’re in charge of maintaining competitive compensation for the people passionate about excellent customer service and support that encourages repeat visits and expands market share. The Compensation Business Partner will help lead the development of Global Compensation programs. Advises on the implementation, communication, and administration of our global programs. Leads efforts in crafting an innovative compensation strategy, in alignment with Apple’s Global Compensation Philosophy. When it comes to managing projects, deadlines, communications, and ideas in different time zones, you’ve got it under control. This position will partner with business leadership, recruiting and their HR Business Partners, as they fuel the talent to push Apple into the future!", "description": "- Provide expert consulting on base salary, bonus, and equity programs Evaluate current and proposed base pay and variable program design for alignment to established guidelines and Apple’s Compensation Philosophy - Deliver training to people teams and managers on compensation philosophy and programs - Lead Job Family Reviews and provide market-based recommendations to department leaders - Analyze and participate in compensation surveys to assess Apple’s competitive position - Develop a network of Compensation professionals for ongoing knowledge of pay practices and shifting trends - Perform analytics from internal and external sources and proactively provide recommendations to the business - Lead strategic projects while also managing routine activities - Provide ad hoc support and develop strong cross-functional partnerships to support business needs - Initiate and maintain strong working relationships with the entire people teams", "key_qualifications": "", "preferred_qualifications": "Experience in High-Tech and/or Consulting industries preferred. Proven team orientation with collaborative style. Flexible demeanor and an ability to get involved in details while maintaining wider view. Strong influencing skills with the ability to communicate clearly and confidently when advising senior leaders. Independent, self-starter with the ability to successfully handle multiple priorities and deal with ambiguity in a sophisticated matrix structure. Excellent process management, planning and organizational skills. Resilient and determined to ensure projects and results are achieved. Robust analytical skills and business sense, with an ability to see the implications of actual and planned activities, adding value to management decisions. Proven track record to learn on the fly and maintain composure in a fast-paced environment. Pragmatic, quick-thinking, and action-oriented to drive for results, with a solid bias for customer service. Excellent oral and written communication skills required. Additional language skills a plus. High integrity and ethics in handling confidential information. Attention to detail and commitment to excellence.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555450"}