{"title": "Embedded Firmware Engineer, Home and Audio Devices", "summary": "We are looking for a skilled and motivated engineer that will be able to define and develop software platforms for Home and Audio products of the future. The ideal candidate will have broad knowledge in embedded technologies and environments to coincide with firmware and OS capabilities. Apply today!", "description": "Genuine passion for innovation and product development with experience from inception through delivery to customers. The Sr. Embedded Firmware Engineer will be individually responsible for all things firmware related. Architect, design, develop, and maintain hardware and software systems for Apple home and audio products. You will identify and integrate technologies vital to solve complex problems to build out amazing new product features.", "key_qualifications": "7+ years of embedded firmware development in bare-metal or RTOS environments. Design and implement firmware platform, including application / state machine, middleware, comms, drivers, OS and respective toolchain. Experience driving large or complex projects throughout full product and sw development lifecycle; including defining goals and ensuring milestone delivery. Able to succeed in collaborative multi-functional environment across many teams and across organization. Influence and negotiate optimally at all levels of management. Strong, demonstrable coding skills in C/C++ in production environments. Ability to optimize software for resource constrained embedded systems (e.g. power, throughput, memory/compute). Clear understanding of customer experience and impact, respective use cases and expected performance. Enthusiastically passionate and inquisitive, and seek to solve everyday problems in innovative ways. Availability to travel domestically and internationally for development and on-site manufacturing support is also expected.", "preferred_qualifications": "Knowledge of audio, optical/image sensing technologies, ML model device integration, or platform security is a plus.", "education_experience": "M.S. in EE, CE, CS, or equivalent experience or skills.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539964"}