{"title": "Wireless SoC Design Verification Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible various aspects of wireless silicon development with a particular emphasis on highly energy efficient design new technologies that impact the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team. As a Wireless Design Verification Engineer, you will be part of a team that is responsible for pre-silicon RTL verification of communication subsystems, SoC sub-systems and chip-level functionality. The activity may focus on block level, sub-system level or chip level, including end-to-end simulations of the entire data/control path. You will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification.", "description": "- Own critical block and sub-system verification of wireless SoC projects\n- Architect and develop testbenches and environments, by using state-of-the-art verification methodologies\n- Define verification plan, create, simulate and debug test scenarios\n- Drive regression and coverage analysis to ensure high quality DV\n- Collaborate with design and systems engineering teams to review requirements, specifications and architecture, extract features and define DV attribute", "key_qualifications": "5+ years verification experience\nSolid verification skills in problem solving, constrained random testing, and debugging\nAdvanced knowledge of SystemVerilog and DV methodologies\nExperience with MAC or PHY Verification - a plus\nSelf-motivated and dedicated with proven creative thinking capabilities\nAbility to handle multiple tasks and prioritise work to meet deadlines", "preferred_qualifications": "", "education_experience": "BSc or MSC in Electrical Engineering or Computer Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527995"}