{"title": "Integrated Project Manager, SEA Marcom", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all media and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "This position requires a self-motivated multitasker with strong integrated project management skills who will : Elevate the creative; be innovative in supporting the ideation, sell-in and production processes, enabling great ideas to thrive. Manage integrated projects across platforms, film, content, digital, social and whatever comes your way. Collaborate closely with key stakeholders and creative production teams either in the Geo or across the globe to produce impactful marketing materials, feeling good at the end of the day knowing that you and the team have made a difference. Be first point of contact for incoming creative and production projects and responsible for assigning creative and integrated project management resources. Be responsible for forecasting creative and production staffing needs and resource additional team members or vendors as needed. Develop a network of preferred freelancers, creative agencies, production vendors to enhance SEA’s creative capabilities and / or production to execute all types of projects to the highest standards with greatest efficiency possible. Drives pre-production alignment, collates the asset production plan, ensuring the plans align to deadlines and annual / quarterly budget plans. Have a holistic view of the project status and be accountable for timely creative approvals, production and delivery. Proactively anticipate challenges and smooths the path of project execution by timely engagement of appropriate production partners at the right moments. Shares best practices with the broader Marcom team and champion new ways of working to continuously improve on the delivery process and quality.", "key_qualifications": "", "preferred_qualifications": "Works well in a collaborative environment and never shy away from contributing. An avid planner, highly organized and adept at driving multi-disciplined teams forward. Has the drive and enthusiasm to approach complex problems with a solutions mindset, feel at ease with working in a dynamic and highly matrix organization. Excellent project and time management skills, a quick learner and is highly adaptable at pivoting and shifting gears quickly if needed. Deep cultural curiosity and connectedness with SEA market, including extraordinary communication and negotiation skills. Highly aware of who needs to know what and when and never leave anyone in the dark. Have strong relationships with the creative and production community that bring an in-depth knowledge of resources and production vendors. You will continuously identify new talents and production vendors to build a robust network for producing the best work for Apple. Spent considerable number of years living and working in SEA will be beneficial. Excellent marketing communication expertise at both a strategic and executional level. University degree in Marketing Communications or equivalent experience.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556178"}