{"title": "US-Operations Lead", "summary": "An Operations Lead ensures operational readiness and excellence for our stores. They support the leadership team to build and maintain store team knowledge and engagement in inventory, presentation, and preservation standards. An Operations Lead uses their skills in communication to engage and influence the store team to ensure preservation standards and inventory accuracy are maintained in order to create an experience like no other for our customers. All Leads are an integral part of supporting the Store Leadership Team, playing a strategic role in crafting meaningful experiences both for customers and team members and embodying a whole store mindset. They inform and energize our teams to do their best work and contribute to operational excellence. They actively connect with team members ensuring everyone is equipped with the support, tools, resources, and strategies they need to curate exceptional customer interactions. They work with others to foster a culture where everyone belongs and is inspired to do their best work.", "description": "Ensure store compliance to Apple Values and policies such as Privacy and Environmental Initiatives all while maintaining a culture of operational excellence. Capture, interpret and share data with the leadership team to strategize, recognize successes and identify opportunities for improvement in key areas including Runner, Apple Pickup, Accuracy, Shrink, Service products, and Trade In. Ensure preservation work order tasks and supply budgets are being managed optimally and efficiently and comply with Apple standards. i.e. janitorial, third party vendors, and other partners. Ensure all applicable health and safety standards are being met, including the maintenance and testing of all life-safety and health systems Conduct daily store and remote space physical inspections and audits, and participate in a monthly review of the store with the GRS Preservation Manager while also informing leadership team on all major preservation events including repairs, scheduled services, and changes to service providers. Coordinate partnership with Operations Team and Technology and Merchandising Pro to ensure store technology and demos meet Apple Retail standards. Energize, inform, and align store employees around store performance goals and communications.. Address time-sensitive employee feedback, questions and concerns, and escalate to a store leadership as appropriate. Recommend daily staffing and/or scheduling to the store leadership team to align with changing customer and/or employee needs and traffic patterns. Ensure positive customer engagement, resolve customer concerns, and empower the team to reach a timely solution. Address the operational needs of the store (including, but not limited to, opening/closing procedures, cash management, overrides, visual standards, urgent maintenance issues, and Loss Prevention partnership). Fulfill the responsibilities of the Support role in alignment with Apple’s policies and procedures. Perform other duties as assigned.", "key_qualifications": "", "preferred_qualifications": "Experience motivating others to achieve positive results Track record of influencing and gaining the support of others Relates well to diverse groups of people and offers support as appropriate Experience de-escalating conflict among peers and colleagues Can make quality and timely decisions to adjust for changing business needs Able to effectively solve problems and make key decisions using analytics, experience and judgement Has excellent attention to detail and a willingness to take initiative Able to work autonomously and without close supervision Demonstrated organizational skills and experience Contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. Physically able to move product as required Has mentored, coached or led others personally or professionally Basic understanding of business tools (Excel or Numbers)", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560373"}