{"title": "Product Design Engineer - Power", "summary": "Looking for a highly motivated mechanical engineer to join the Power and Accessories Product Design Team. You will be part of an elite team responsible for conceiving, architecting, designing, and producing exciting new products. Your responsibilities will be extremely dynamic, focused to ensure Apple's Power products continue innovating in balancing cost, size, power, and performance. While contributing to the mechanical design of Apple’s products, you will work closely with many cross-functional teams, including Industrial Design, Electrical Hardware Engineering, Thermal Engineering, Reliability, Packaging, Safety, Tooling, EMC, Operations and contract partners.  You will be extremely well organized and able to balance numerous program needs simultaneously. Your excellent communication and social skills will help you to quickly grasp issues, understand the details, and drive the appropriate resolution. We work in a highly dynamic environment which will require you to respond quickly to changes, manage competing demands, and find creative solutions outside of standard convention.", "description": "We promote innovation and new technology to further improve Apple's hardware performance and user experience. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, Apple Watch, and AppleTV. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.", "key_qualifications": "Experience in mechanical design, developing parts and assemblies in 3D CAD\nInnovative thinking, high personal motivation, deep engineering capability and strong fundamentals\nAble to travel internationally (up to 20%)\nExperience in plastic and metal part design\nExperience with design cycle from concept to high volume manufacturing\n3+ years experience in Product Design\nDirect management or leadership of product development engineering teams\nUnigraphics NX fluency\nExpertise in the areas of: GD&T, Tolerance Analysis, Statistical Analysis, Design of Experiments, FEA, Thermal Design", "preferred_qualifications": "", "education_experience": "BS or MS degree in Mechanical Engineering.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550037"}