{"title": "IS&T Finance - FP&A Manager", "summary": "Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to perfection, and it is directly responsible for shaping the company’s future. Join us, and you’ll have an important role in continuing Apple’s legacy of efficiency and success. Our IS&T Finance team has an opening for an FP&A Manager who will be focused on the coordination, consolidation, and analysis of the IS&T and AIS organizations’ financials. This role partners closely with the Corporate FP&A team in aligning forecasts and managing targets. In addition, this role provides guidance and insights to the CIO in support of the organization’s strategic priorities. This role works closely with many Finance functions across Apple and requires someone who possesses a rigorous attention to detail, the ability to offer fresh opinions, and a drive to look for new and improved ways to achieve results.", "description": "Collaborate with the various IS&T and AIS Finance team member to deliver the monthly IS&T and AIS financial forecast. Coordinate the quarterly close activities across both organizations and manage the communications with leadership and Corporate FP&A on any fluctuations vs expectations. Modernize the forecast consolidation process and enhance the analytics capabilities of the broader team. Pilot, test, and deploy innovative methods of consolidation and reporting for the entire IS&T Finance team to utilize.", "key_qualifications": "", "preferred_qualifications": "Strong analytical background, Extensive Excel knowledge and experience, Tableau experience a plus, Strong communication and presentation skills; must be comfortable presenting to executives (Keynote experience a plus), Proactive problem solver, encouraged to present problems and recommendations simultaneously, Strong collaboration and interpersonal skills; must be able to form positive relationships with business partners and peers, Ability to work comfortably with incomplete information and deal with ambiguity in a fast-paced, high-pressure environment, Extremely curious; is not satisfied with easy or convenient answers; drives issues to root cause, Ability to maintain strict confidentiality around product launches, financial information and other critical initiatives", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $178,900 and $269,400, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557601"}