{"title": "Editorial Lead", "summary": "Apple is where people do the best work of their careers. Apple’s Internal Communications team informs and engages employees worldwide on everything from our innovative products and services, the values that drive our company, to our industry-leading benefits and support programs. We are looking for an outstanding editorial lead for our global internal platforms and channels. This is a role for a creative thinker, experienced communicator, and collaborative problem solver who wants to have their hands in several projects at once; who can deliver strategy from concept to completion, and effectively lead a team.", "description": "In this role, you’ll lead Apple’s internal digital and editorial content strategy, elevate our internal storytelling capabilities and showcase stories that matter. You are experienced in developing and executing an editorial strategy and have an advanced understanding of what makes content engaging and successful across platforms and audiences. At Apple, we collaborate cross-functionally across many organizations especially in the content space. We are a global organization, your ability to work across time zones, date lines and communication platforms is a must to our success. Not only will you lead the team to create compelling stories, campaigns and content, you’ll enrich the audience experience ensuring multi-media, multi-channel engagement. You’ll be adept at measuring and reporting on the success of content and channels, and ready to introduce and drive new approaches. You’ll have a passion for strengthening and building community within a global, diverse workforce.", "key_qualifications": "No information available", "preferred_qualifications": "Experience in media, publishing, corporate communications, and/or, or online publisher. Strong leadership and interpersonal skills, experience in building consensus and driving collaboration by building positive relationships. Demonstrated success managing teams. Strong project management experience and skills, with the ability to drive multiple priorities simultaneously on deadline. Clear and concise communicator with strong organizational skills, and ability to create clear processes, while maintaining flexibility for change. Ability to cut through ambiguity. Thrives in a very dynamic environment, and can effectively work across cross-functional teams and geographies while demonstrating integrity at all times.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $185,800 and $279,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554217"}