{"title": "Physical Design Engineer, Machine Learning", "summary": "At Apple we believe our products begin with our people. By hiring a diverse team, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers! These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Come help us design the next generation of revolutionary Apple products.", "description": "As a member of the physical design machine learning architecture team, you will be part of a dynamic team that is building the most efficient application processors on the planet, powering the next generation of Apple products.\n\n• You will use your experience in physical design and machine learning to solve very hard and unique problems.\n•  Your work will directly impact vast areas of the flow including RTL design, logic synthesis, floor planning, power/clock distribution, place and route, timing/noise analysis, power/thermal analysis, voltage drop analysis, design for manufacturing/yield, and beyond.\n•  You will collaborate cross functionally with design, power, post silicon, CAD, software and machine learning teams in an engaging and rewarding environment.", "key_qualifications": "", "preferred_qualifications": "Practical experience and knowledge in advanced machine learning algorithms like GNNs, VAEs, transformers, diffusion models, LLMs\nExcellent programming skills in Python and C/C++\nMaster's or PhD with relevant publications in Machine Learning and/or EDA algorithms\nExcellent communication and organizational skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509581"}