{"title": "Python Software Development Engineer - Apps Services", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Our team runs the CI/CD pipeline for Apple's applications which supports thousands of developers around the globe. We are passionate about continuously improving the way we enable the software development lifecycle and push the envelope to reimagine cutting edge solutions to engineering problems of scale. As a member of the team, you would develop applications and micro-services to build and improve our next generation CI/CD pipeline.", "description": "Develop and maintain CI/CD pipeline, services and integrations for Application development teams. Collaborate across teams to improve build, integration & release process. Develop and maintain services and integrations for Apps Services CI/CD pipeline. Maintain and administrate dynamic Linux/macOS build farm.", "key_qualifications": "Proficient in Python programming. Experience with software development processes such as compilation, unit testing, code analysis, release process, and code coverage. Experience working on Linux and macOS based platforms. Experience with DevOps tools such as Ansible, Docker, Kubernetes. Experience with CI/CD process and platforms. Ability to participate in an after hours on-call rotation schedule. Strong analytical and problem solving skills. Excellent written and oral communication skills and ability to work with large development teams.", "preferred_qualifications": "B.S. in Computer Science or equivalent. Experience developing Python based micro-services using Django/Flask. Experience with GitHub development workflow. Experience with Jenkins administration and scaling. Experience scaling CI/CD systems and micro-services. Experience with Xcode and Swift.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554885"}