{"title": "Regional Supplier Manager - Logistics", "summary": "Imagine what you could do here! AMR Logistics Operations is a fast moving and dynamic environment where flexibility and adaptability are key attributes for success. Regional Supply Managers oversee service providers for logistics operations related to inbound/outbound transportation, distribution, and/or post sales returns. Individuals must be customer focused, process-minded, and passionate for excellence. The candidate must be able to work towards achieving targets while demonstrating personal initiative with a focus on driving superior customer service and process efficiency. Additionally, candidates must have laser focus on supporting the key tactical and strategic initiatives including: Customer Delight, Process Excellence (Precision), Cost Leadership and Continuous Improvement. This role requires superior business acumen, strong service provider leadership, and innovative process improvement skills.  In addition, possess influencing and leadership skills that inspire and facilitate an energetic environment that will deliver excellence.  We hope you will consider joining our team!", "description": "•Oversight of supplier relationship and performance in support of Americas Logistics and Distribution\n•Identify areas for process improvement and innovation; Investigate problems, find root causes, and develop solutions.\n•Prioritize and multi-task effectively to provide strategic and tactical support for projects, including capital planning. \n•Monitor key performance indicators, drive performance, and expense management. \n•Evaluate existing capabilities and establish new systems and processes for tracking, measurement, reporting, and analysis of Logistics Ops.  \n•Collaborate with stakeholders as a representative of logistics, and provide updates to leadership: inventory, distribution, freight, cycle time, etc.", "key_qualifications": "Experience in world-class logistics operations with emphasis on vendor, 3PL, or service provider management.\nProven ability to lead continuous improvement projects and strong track record of customer service\nShould be systems literate in one or more Warehouse Mgmt Systems, as well as possess strong analytical and problem-solving skills.\nAbility to work in dynamic, cross-functional teams in a matrixed environment while demonstrating strong work ethic and a high degree of flexibility\nUp to 15% travel required", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Engineering, Supply Chain Operations, Business, or related field required.  MBA or advanced degree preferred. Multilingual skills a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547813"}