{"title": "Sr Software Engineer, ML Systems Engineering", "summary": "Apple products bring together amazing hardware paired with incredible software to create phenomenal experiences for our customers. This is your opportunity to be part of an outstanding software engineering team shipping features to surprise and delight customers on the iPhone, Mac, Apple Watch, iPad, and more! The Machine Learning Personalization team in Proactive Intelligence provides personalized machine learning on device without compromising user privacy. We are seeking exceptional software engineers to help with training, deploying, serving, and monitoring machine learning models on resource-constrained edge devices.", "description": "You will design and implement tools and frameworks primarily to support state of the art on-device ML in Apple’s products; deploy those algorithms and establish scalable, efficient, automated processes for validation and monitoring; communicate advanced ideas to our cross-functional team; and develop innovative tools and metrics that change the way we look at problems. Join us to enhance the lives of hundreds of millions of people around the world! Our team values creating and maintaining an inclusive environment prioritizing learning and growth. You’ll learn to use new technologies, work with various cross-functional teams, and exercise your creativity to improve our team and our products.", "key_qualifications": "No information available", "preferred_qualifications": "Attention to detail and drive to achieve excellence. Experience with production machine learning systems. Experience developing for resource constrained platforms, especially mobile devices.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560114"}