{"title": "Embedded/Firmware team lead", "summary": "Apple's embedded firmware/software team is looking for an extraordinary team lead to drive state of the art technologies for unreleased Apple products. Our team works on core hardware components and defines the way that Apple calibrates, tests and manufactures its products. To be a successful team lead on this team, your embedded fundamentals must be solid. We are a team that is a collection of top notch engineers. They’ll need you to guide, challenge, and defend them. You will create feature definitions, prototyping new ideas, create schedules, reporting progress to executives, hiring new people, and developing people already on the team. Your contributions will make a pronounced difference to future embedded products.", "description": "As an Embedded Team Lead you will be responsible for leading a team that creates software for all of Apple's current and future embedded devices (Macs, iPhones, iPads, Audio, Apple TV, watch, etc). You and the team will have responsibilities spanning all aspects of the product development and test cycle: Bringing up new SoCs, chipsets, sensors, and products. Writing, debug, and integrating new device drivers, protocols, and other firmware code across Apple's embedded product line Interacting with and influencing Silicon, Hardware, Software, Test, Operations and various other cross - functional teams throughout Apple locally and remotely (travel optional) Managing a team of 4 or more SW engineers, working on multiple projects Maintaining engineering relationships with vendors and contractors", "key_qualifications": "C/C++ experience.\nSolid debugging ability, especially with instruments such as scopes and logic analyzers\nUnix command line experience\nDevelopment experience on Unix/Linux, or Mac OS X\nEffective interpersonal, leadership, and communication skills\nFamiliarity with standard hardware protocols (USB, UART, SPI, I2C, PCIe, USB/Thunderbolt, DP/HDMI)\nAt least 4 years Engineering experience\n1-5 years team leading experience", "preferred_qualifications": "", "education_experience": "Master or Bachelor’s degree or equivalent experience in Computer Engineering or Computer Science from a University is required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550800"}