{"title": "Sales - Retail Channel Sales Lead (Vietnam)", "summary": "At Apple, we don’t just create products—we create the kind of wonder that’s revolutionised entire industries. It’s the diversity of people and ideas that inspires innovation; from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Apple’s Sales organisation generates the revenue needed to fuel ongoing development of products and services. This in-turn enables us to enrich lives. Our Sales team is, in many ways, the face of Apple to our largest customers. A unique opportunity exists for an outstanding leader to lead a team of highly motivated individuals to develop strong Sales growth strategies, deliver a phenomenal customer experience and expanded adoption of the Apple ecosystem across Vietnam. As the Retail Channel Sales Lead, you will focus on not just crafting and implementing the strategic plan for growing our Channel’s footprint and overall sales, but also to collaborate and develop deep, strategic relationships with our key Retail partners. This role is responsible for our key offline and online retail partners inclusive of coverage planning. You are someone who is outcomes-focused, has phenomenal drive and tenacity, proven leadership skills and deep experience in senior stakeholder management. We’re looking for a leader to drive a culture of excellence, collaboration and partnership. And to grow Apple’s Channel Sales business in Vietnam.", "description": "-  Lead and encourage the Channel Sales Retail Account Teams to build deep, strategic relationships with Retail Partners, ensuring Apple is top-of-mind in their business plans, and they’re motivated around strategy, direction and goals with Apple. -  Expand and develop Partners’ capabilities to deliver an amazing customer experience, outstanding merchandising presence and strong advocacy for Apple - in physical and digital environments. -  Drive innovations that accelerate partners growth and capabilities transformation -  Demonstrate deep understanding of the markets and trends, and develop strategic plans to expand and grow Apple’s footprints and business in the Retail Channel. -  Be accountable for overall growth and performance, and lead Account Managers to hold regular performance and planning reviews. Ensure dedication to, and solid execution of, strategic plans and corresponding sales actions. -  Is able to achieve advocacy for Channel Sales and Partner priorities through effective cross-functional stakeholder relationship management and influence.", "key_qualifications": "Demonstrated leadership experience successfully developing Channel growth strategies with teams and partners - delivering short-term goals, while building sustainable value for partners and demand for the future. Experience at the executive level, strong senior stakeholder management and ability to connect, influence and drive business objectives through relationships. Exceptional leadership and interpersonal skills. Experience leading and motivating team members to drive towards common goals. Strong commercial acumen, confident analytical skills and the ability to problem solve at pace. Proven track record in the achievement of stretch growth targets. A great team player who enjoys working in a collaborative environment with open dialogue and debate. Comfortable leading through considerable ambiguity. At least 8-10 years of leadership experience in technology/consumer/lifestyle sectors – related industry experience preferred. Strong insights and knowledge on Vietnam market from a multi-dimensional view with deep appreciation for the market opportunities and challenges", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent education", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512183"}