{"title": "ML Scientist - Operations Business Process Reengineering, Advanced Analytics", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nAre you interested in applying your quantitative skills in a fast paced tech environment? If so, then this is the job for you. The Worldwide Sales and Operations Advanced Analytics team is looking for an experienced ML Scientist with a deep passion for analytical solutions that have direct and measurable impact to Apple and its customers. You will design, build and deploy predictive and prescriptive end-to-end solutions for strategic and tactical supply chain decision-making.\n\nIn this role, you will have a history of engaging with business teams to find opportunities, driving critical projects, building and sustaining production applications and working collaboratively across teams to get things done.", "description": "As an ML Scientist, we look forward to your implementing data science pipelines and applications in a general programming language such as Python, Scala, Java or C++\n\n-  Deliver data analytics to the organization at scale as a key member of a small team of experts\n\n-  Design and develop Machine Learning based models to solve complex supply chain problems, with a focus on predictive analytics and forecasting\n\n-  Build large scale execution models in ambiguous environments\n\n-  Collaborate effectively with other business partners (supply demand planners, retail team, apple care etc.), peer data scientists, and IT groups\n\n-  Determine essential tradeoffs within the models and take an active role in clearly communicating the recommendations to senior management", "key_qualifications": "8+ years practical experience solving real world problems and understanding of algorithms for classification, regression, clustering, and anomaly detection\nExperience with database modeling, data warehousing principles and SQL\nFamiliarity with big data technologies eg: Hadoop, Spark, Hive\nAbility to comprehend and debug complex systems integrations spanning tools and teams. Strong critical thinking and problem solving ability\nSound communication skills - adept at messaging domain and technical content, at a level appropriate for the audience.\nInnate curiosity and bias to action with expert ability to identify, define and execute project plans and develop modeling approaches suitable for the problem\nStrong partner - invested in the collective success of the team and project outcomes\nSelf-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity\nExperience with data acquisition tools (e.g. SQL), data mining and data visualization\nExperience prototyping and developing software in programming languages (Java/C++/Python/Perl)\nSupply chain operations planning and material management experience and/or prior role in supporting supply chain business processes preferred\nExperience with large data sets, big data and analytics\nStrong communication and presentation skills", "preferred_qualifications": "", "education_experience": "BTech in Computer Science or IT / MBA from a premier school", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200508810"}