{"title": "Hardware Engineering Internships", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what can be accomplished. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with Apple products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, interns will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day!\n\nHardware Engineering interns support electrical & system design and integration of the Apple Vision Pro, iPhone, iPad, Watch and Mac computers. You will also assist in engineering processes that support the design, integration, implementation, testing, and qualification of various electrical sub-systems.", "description": "Responsibilities may include: \n\n• Camera/Touch/Display Engineering: Optics, Flat Panel/HW, Touch Mechanical Design. Design & Implement experiments validating new materials (optical, mechanical); Optimize for performance and reliability\n\n• Wireless Technologies: Antenna Design, RF System Level Validation, Automated Software/Tool Dev, Optimization of RF Automated Systems, RF Sys Analysis\n\n• ASIC / VLSI: RTL Design & Implementation, Verification, Integration, Validation, Emulation, Power/Tech & Circuits, CAD, STA, Physical Design, Low Power Design, Signal Integrity, Analog/Mixed Signal, LDV/HDV, DFT\n\n• System Development: Electrical System Design and Integration, System-Level Testing Support, Schematic Capture, Bug Resolution\n\n• Audio/Acoustics/Optical Production Testing and Mechanical Test Design\n\n• Embedded Systems, Low-Level Microcontroller Code Dev, Prototyping concepts, design verification (FPGA), Streamline Electrical Design\n\n• Firmware Development: Write/Debug low level firmware, drivers, protocols and other firmware code, developing embedded firmware solutions", "key_qualifications": "", "preferred_qualifications": "It’s helpful for candidates to meet one or more of the following qualifications, but it isn’t a requirement\nComputer system architecture, digital logic design and verification, digital and analog circuit analysis, and Analog IC\nChip design and microarchitecture of on-chip interconnection networks\nAntenna, cellular, wireless, OTA, RF Engineering, high-speed signals, wireless communication theory, and RF circuit design\nCPU & GPU Architecture\nProficiency in C, C++, Python, Perl, SQL, assembly, Mac OS X, PH, Obj-C, VHDL, Verilog RTL, Digital Logic Design\nExperience using measurement equipment, such as spectrum analyzers, network analyzers, and oscilloscopes\nExperience interpreting schematics with physical design and debugging of circuits via FPGA or PCBs\nPrior internship experience, relevant project experience (group or individual), TA experience, and/or relevant work experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554305"}