{"title": "Agile Engineering Program Manager", "summary": "At Claris, an Apple Company, we are dedicated to empowering problem solvers, enabling them to imagine, design, and create innovative solutions. We give them a platform that lets them do the hard things their users need, affordably and relatively quickly. With a focus on future-oriented technologies and a commitment to advancing creative potential, Claris has been a leader in workplace innovation for over 35 years. As part of our ongoing mission, we have embraced Agile as a methodology and Scrum@Scale as a framework for managing our work and operations and are seeking a dynamic individual to join our team as an Agile Engineering Project/Program Manager!", "description": "This role requires advanced experience in Agile frameworks with practical experience in an Agile role at either the program or team level with demonstrated ability to adopt Agile values, principles, mentality, practices, and methodologies. It requires coordinating the efforts of various teams to deliver a seamlessly integrated solution to our customers. It requires a resourceful leader who is passionate about getting things done and helping teams thrive, driving the team and business success.  - Work alongside their counterpart Product Owner and with Scrum Leads to ensure timely delivery of product increments.  - Gain a deep understanding of cross-team dependencies, including those outside of the Scrum of Scrums, and enable cross-team coordination and communication.  - Coordinate the teams’ delivery with the Product Owners Team’s release plans.  - Coordinate with other functions, such as Marketing, Sales, and Finance to ensure alignment, dependency resolution, and risk mitigation.  - Serve as a true servant leader, guiding multiple Agile teams in self-management and cross-functionality within the Scrum@Scale framework  - Facilitate Scrum of Scrums meetings, ensuring alignment and collaboration across teams.  - Work closely with Product Owners to maintain and prioritize the Product Backlog, enhancing value delivery.  - Identify risks, blockers, and impediments, and facilitate the prioritization and removal of them to enable teams to operate efficiently and effectively.  - Identify and drive continuous improvement initiatives within and across teams, fostering a culture of learning and innovation.  - Make impediments, process improvements, and progress visible to the organization.  - Collaborate with teams to determine and track metrics that will provide rich insights on productivity, quality, value delivery, and sustainability  - Guide teams in implementing and adhering to Agile and Scrum principles, practices, and theory.  - Act as a coach and mentor to Scrum Leads and Agile teams, promoting maturity and excellence in Agile practices.  - Collaborate with multifunctional partners and leaders as needed to resolve organizational impediments that impact the Agile teams.  - Champion the use of Scrum@Scale within Claris, advocating for its benefits and driving adoption across the organization.", "key_qualifications": "3+ years serving as a Scrum Master across multiple Agile teams in an Agile environment, preferably applying Scrum@Scale, Engineering Project Management expertise driving value delivery throughout a Software Development Life Cycle in an Agile methodology, Deep understanding of the Software Development Life Cycle, In-depth knowledge and practical application of the Agile methodology, servant leadership, continuous improvement, empowerment, and self-managing principles, Excellent communication and social skills, with the ability to optimally engage with leaders at all levels of the organization, Effective facilitation skills, fostering productive meetings and leading the team to generate solutions and make decisions in a timely manner, Experience in coaching teams and organizations towards Agile maturity and evangelizing Agile and Scrum principles, Proven analytics skills, with experience building dashboards and reports, Ability to independently learn new skills and technologies, Experience collaborating with distributed teams across different time zones", "preferred_qualifications": "", "education_experience": "- Registered Scrum Master (RSM), Certified ScrumMaster (CSM) or Professional Scrum Master (PSM I) certification required, with additional certifications such as RAC, RSM@S, RS@SP, A-CSM, PSM II, or other Scrum@Scale credentials preferred.  - Degree in Computer Science, Engineering, Mathematics, or other relevant field preferred or equivalent practical experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.  Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551192"}