{"title": "Senior Software Engineer", "summary": "People at Apple don’t just build products — they craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it. The Apple Service Engineering (ASE) team builds and provides systems and infrastructure that fuel Apple’s services (such as iCloud, iTunes, Siri, and Maps). We are the foundation on which Apple’s software developers build the products that our customers love. Our services have to scale globally, stay highly available, and \"just work.” If you love designing, engineering and running systems and infrastructure that will help millions of customers, then this is the place for you! We are looking for a passionate and talented Senior Software Engineer who will focus on creating fundamental security services, addressing identity and authorization challenges on a large scale within the ASE organization. Success in this role requires individuals to possess a blend of profound technical expertise, extensive knowledge in security, and substantial experience in large-scale operations.", "description": "We are seeking a highly skilled and motivated Senior Software Engineer to join our dynamic and expanding team. In the role of Senior Software Engineer, you will play a crucial part in ensuring that our customers adhere to the latest and most effective security practices for addressing identity and authorization challenges. Collaborating with cross-functional teams, you will be responsible for designing and implementing systems to bolster our overall security posture throughout the organization. Your duties will include defining, advocating, and driving the adoption of a standardized set of minimum security requirements while monitoring progress. By leveraging your experience, you will set high standards and influence the future of our security protocols, guiding engineering teams as they incorporate secure practices and tools into their development processes.", "key_qualifications": "Strong programming skills in Golang, as you'll be working extensively with Go-based applications, Proven experience with large scale, highly available, distributed, and fault tolerant systems, Excellent understanding of operating systems concepts including multi-threading, memory management, networking and storage, performance and scale, Experience with Kubernetes, Docker, and containerization (CNCF Kubernetes Developer or equivalent), Knowledge of cryptographic algorithms and protocols for securing data, including TLS/SSL, digital signatures, hashing, and encryption, Knowledge of authentication and authorization mechanisms, including OAuth, JWT, and other identity management protocols, Knowledge of securing APIs, including input validation, authentication, and authorization mechanisms for RESTful and gRPC APIs, Hands-on experience with Systems, including the ability to configure and troubleshoot system initialization processes, Proficiency in macOS system administration, with a focus on Launchd, the init and service management framework, Understanding of network security principles, protocols, and technologies, including firewalls, VPNs, and secure communication channels, Familiarity with incident response processes and the ability to respond to security incidents effectively", "preferred_qualifications": "", "education_experience": "- BS/MS in Computer Science or Equivalent (7+ years of software development or production operations experience in a large-scale environment), Prior experience in security related fields (or equivalent experience) Certs like OSCP, OSCE, OSEE, etc. helpful but not vital. Bonus points for community contributions like public CVEs, bug bounty recognition, open source tools, blogs, etc.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550186"}