{"title": "Software Engineering Manager, Edge Services", "summary": "Imagine what we could do together. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. Apple is looking for an expert Software Engineering manager to develop the next generation of Edge Services. You will be leading a team of developers designing new proxy services designed to connect customers to Apple Services faster than ever before. You will partner with OS and services teams to deeply integrate our devices with our services. Your team’s work will help improve the performance of Apple Services such as Apple Music, Apple TV, App Store, and many more!", "description": "The Edge Services team is responsible for connecting people across the globe to Apple. As an engineering manager on Edge, you will be responsible for leading a team of developers writing highly performant Edge proxy services designed to make Apple’s services fast, resilient, and scalable. You will be responsible for collaboratively setting direction with multi-functional partners, both client operating system teams and Apple Service backend teams, with the goal of crafting a unified Edge strategy for Apple Services. You’ll also be responsible for maintaining relationships with various open source communities we collaborate with. Day to day, you will be working with your developers to set priorities, review code and architecture, and lead production deployments. Your team will be responsible for second tier operational support. You will be required to review performance data and investigate any performance regressions that arise.", "key_qualifications": "3+ years experience in software engineering management\n5+ years experience in a software engineering role\nExperience with designing, implementing, and supporting highly scalable infrastructure services\nExperience in Rust or similar languages is highly desirable\nExperience with internet protocols such as QUIC/H3, TCP/H1/H2, DNS\nDeep understanding of core CS concepts including data structures, algorithms and concurrent programming\nAbility and excitement to learn and apply new technologies and frameworks\nGreat communication, time management, and product management skills", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or related field (or equivalent experience)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525179"}