{"title": "SW Engineer, Apple Cloud Quality", "summary": "The Apple Services Engineering (ASE) team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. We are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And we do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. We are looking for a passionate and dedicated engineer focused on building tooling to enable robust testing and monitoring of our infrastructure and services. Our solutions must scale globally, be highly available, performant, and simply 'just work'. If you love running, monitoring and improving systems that delight millions of customers, then this is the place for you.", "description": "As Apple Cloud Quality engineer, you’ll develop tools for developers to enable better testing practices like robust fault injection across various data centers and cloud services. You’ll also design and implement solutions to enable monitoring of the tech stack across various environments. This position requires practical knowledge of Kubernetes, public cloud platforms, software engineering, operations and automation. Building and managing relationships with diverse sets of customers will be critical to ensure collective success. You’ll build preventative solutions essential to diagnose and improve products and services that touch hundreds of millions of users. To be successful you should be self-motivated, flexible in your approach, and exude tight-knit collaboration skills, including the ability to mentor and be mentored. Creativity, innovation and a persistent drive for result will be required to design user experiences for tools that have no parallel. We are looking for a standout colleague who is able to take on challenges under tight deadline constraints and deliver imaginative solutions to complex problems.", "key_qualifications": "Experience with ephemeral environments and chaos engineering frameworks, Experience operating and developing infrastructure and services in public cloud environments, Experience with developer tooling and containerization, Programming in languages such as Golang, Java, JavaScript, Python, etc, Proven ability to self-start, learn, plan, prioritize and deliver on time, Excellent verbal and written communication skills", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or related field * 5+ years of industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547383"}