{"title": "SE-Creative Pro", "summary": "Din uppgift som Creative Pro är att förespråka och demonstrera fördelarna med Apples ekosystem för våra kunder, vårt interna team och samhället i stort.", "description": "Agerar ambassadör för Apples mål, produkter och tjänster gentemot dina arbetskamrater, genom mentorskap och genom att skapa möjligheter till lärande. Använder berättelser för att illustrera hur ett intresse eller en hobby kan fördjupas med hjälp av Apples teknik. Ökar försäljningen av tillbehör genom att rekommendera lösningar som uppfyller kundernas behov samt är med och förvandlar kunder till ägare. Håller dig uppdaterad om nya produkter, tekniker och trender för att leda relevanta workshops och aktiviteter. Tar reda på vad som intresserar kunderna och vad de tycker är viktigt i närområdet och kopplar detta till relevanta program och aktiviteter i butiken. Maximerar antalet deltagare och intresset för tjänster och produkter genom att marknadsföra och planera workshops på ett effektivt sätt. Håller kontakten och vårdar relationerna med lokala branscher med koppling till Apples passionsområden. Agerar mentor åt och utbildar Creative-teamet för att fördjupa deras kunskaper och färdigheter. Förbättrar Apple Store-upplevelsen genom att eftersöka, analysera och tolka feedback från kollegor och NPS-poäng från kunder och sedan agera därefter. Använder aktiviteter, workshops och evenemang för att skapa en förväntansfull stämning, samt för att väcka engagemang och entusiasm bland kunderna. Håller engagerande workshops som aktiverar kunderna. Förstår de utmaningar som ny teknik kan innebära och visar förståelse för varje kunds tekniska kunskapsnivå. Förser kunderna med de verktyg de behöver för att lära sig mer, skapa och dela så att de kan utveckla sina personliga intressen med hjälp av Apples teknik. Skapar praktiska kundupplevelser som gör att andra kan få ut mesta möjliga av Apples ekosystem. Ser till att det finns möjligheter till lärande och agerar mentor. Känner till alla interna och externa verktyg som finns för kunder som vill förbättra sina tekniska kunskaper. Erbjuder ytterligare support- och servicealternativ inom ramarna för tjänsterna och utbildningsmiljön.", "key_qualifications": "", "preferred_qualifications": "Dokumenterad förmåga att fånga kundernas intresse genom att berätta. Bra presentatör och talare med dokumenterad förmåga att anpassa sig till en komplex publik med många inlärningsstilar. Du känner starkt för Apples mål att ge bästa möjliga kundupplevelse. Du är en utmärkt pedagog med god social kompetens. Du har stor erfarenhet av att använda Apples produkter, tillbehör och appar i en kreativ miljö. Kollegorna ser dig som en mentor. Du har relevant yrkeserfarenhet inom ett kreativt område (meriterande). Du förstår den kreativa processen. Du förstår fördelarna med Apples ekosystem och kan påverka andra människors syn på det. Du har erfarenhet av musik- och ljudredigering, inspelning, digital fotografering, digitalt filmskapande, redigering och andra områden där Apples produkter och appar används. Du kan hantera flera olika uppgifter samtidigt.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535627"}