{"title": "Senior Software Developer - Server", "summary": "Are you interested in bringing something which was once an imagination, to life. On our team you'll be integral in enabling products used by more than a billion people! What happens when the world’s most innovative engineers' collaborate with the world’s most creative storytellers? TV gets reinvented! In the TV App Services Teams at Apple, we work every day to create products that enrich people’s lives. Meet the re-inventors: The Apple TV Services teams not only built and manage the Apple TV but also tvOS, this has redefined the way people watch sports, and so much more. Today, these teams handle an exciting realm at Apple! They enable viewers to leverage our platform, so they may enjoy their favorite team(s) and game(s). Imagine the feeling you will have when you can look over and see our users watching a game of their choice with access to various associations and leagues such as, NBA, NFL, MLB and many more. To deliver Apple-level quality on a global scale, these engineers employ talent and tools to efficiently ingest, process and display sports data. They also integrate at the OS level to build the best user experiences with the Siri ecosystem. This group is seeking a highly skilled Dev Ops and Infrastructure Engineer to help design, develop, and deliver new experiences for our customers. Join the team to see what else is possible!", "description": "-Design, develop, and manage CI/CD pipelines for critical services.\n\n-Optimize Kubernetes infrastructure for scalability, high availability, and cost-efficiency.\n\n-Collaborate with software teams to ensure smooth deployments and seamless operations of sports features.\n\n-Lead initiatives to improve infrastructure and application monitoring, performance tuning, and disaster recovery.\n\n-Stay ahead of the curve by exploring and implementing new technologies and solutions.\n\n-Keeping up to date documentation/reporting on infrastructure, pipeline management, and runbooks", "key_qualifications": "5+ years experience in DevOps/Infrastructure engineering.\nKnowledge of containerization and orchestration technologies (i.e. Docker, Kubernetes).\nStrong proficiency working with scripting languages such as; Bash & Python.\nExperience working with Java is a strong plus.\nExpertise in CI/CD pipelines and multi-cloud deployments (highly preferred: Spinnaker).\nProficient in monitoring and analytics with Splunk, Prometheus, and visualizing metrics with Grafana.\nIn-depth knowledge of cloud infrastructure services for building scalable, high-availability applications.\nExperience working with IaaC (Infrastructure as Code) to configure cloud infrastructure and manage deployment pipelines.\nPassionate about up to date documentation/reporting on infrastructure, pipeline management, and runbooks.\nPassion for delivering outstanding user experiences.\nAbility to thrive in a fast-paced collaborative environment.", "preferred_qualifications": "", "education_experience": "Bachelors/Masters in Computer Science or a related technical field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539897"}