{"title": "Battery Management System Electrical Engineer", "summary": "Do you have a passion for invention and self-challenge? As part of our Battery Engineering group, craft creative battery solutions that deliver more energy in smaller spaces than ever before. We work across disciplines to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world!", "description": "-  Design BMU from concept to mass production focusing on detailed board level design.\n-  Push the boundaries of technologies to maximize performance and minimize volume.\n-  Collaborate with multi-functional partners (Product Design, System EE, Cell Engineering, Firmware, Algorithms, etc.) to ensure the product is developed on time and on budget.\n-  Conduct investigations and prepare reports for problems or issues.\n-  Develop Schematics and BOMs to satisfy the design requirements.\n-  Develop layout guidelines for PCBs and guides Layout Engineers to meet all physical and electrical requirements of BMU.\n-  Specify custom parts and PCBs for use in BMUs.\n-  Analyze the design with simulation tools and calculations to verify its conformance to the requirements. (PSPICE, ANSYS, Verilog or equivalent)\n-  Conduct design validation on prototypes to implement the design.\n-  Conduct design reviews, incorporate team feedback and release the design documents for builds.\n-  Specify production test methods and limits and work with CM partners to realize design.", "key_qualifications": "", "preferred_qualifications": "- Advanced Degree in Electrical Engineering preferred.\n- Strong EE fundamentals in electronic circuit design/development with microcontroller-based embedded systems.\n- Good knowledge of inter-module communications protocols (I2C, SMBus, SPMI, etc.)\n- Experience with high volume manufacturing.\n- Knowledge of scripting (Python, Shell, Unix, MATLAB, etc.) for test automation and data analysis desired.\n- Self-starter with excellent time management skills and curious spirit.\n- Strong documentation and communication skills.\n- Proven track record working independently under high pressure and comfortable working in a dynamic environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554336"}