{"title": "Digital Marketing Operations Specialist", "summary": "Apple is seeking a dynamic, highly motivated individual to join the U.S. Education Strategy, Demand Generation and Enablement team.", "description": "-  Own the digital marketing tech stack for US Education including direct to customer campaigns and through partner campaigns.\n-  Enable data-driven decisions for the marketing team through reporting and data analysis of program performance and impact on the business.\n-  Create and maintain metrics reports on marketing activities, efficiency, and business impact.\n-  Be responsible for the marketing instance of Salesforce\n-  Lead marketing use of marketing automation platform\n-  Lead contact acquisition and database strategy and oversight and ongoing cleanse with new contacts - monitor and maintain data quality within the marketing database.\n-  Stay abreast of the latest marketing technology trends\n-  Lead web based event execution and reporting - develop robust knowledge of event tool \n-  Work closely with sales operations, BPR and engineers on developing marketing automation capabilities and execution\n-  SME on email scoring and nurture \n-  Collaborate with worldwide marketing team on social media enablement execution and metrics", "key_qualifications": "", "preferred_qualifications": "- Degree in marketing, education, business, or related discipline, preferred.\n- Pardot Certification preferred\n- Ability to quickly learn new marketing automation platforms and systems\n- Resourceful, creative, and results oriented with high energy and a positive attitude.\n- Ability to quickly establish trust, credibility, influence and drive results across a variety of cross-functional and multi-directional partners\n- Ability to cultivate relationships and work collaboratively across many functional teams.\n- Passion and self-motivation, with outstanding attention to detail, sense of urgency, and follow-through\n- Experience in social media metrics\n- Strong background in AB testing across digital channels\n- Content creation experience in Adobe Creative Suite, InDesign and After Effects", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,100 and $173,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555639"}