{"title": "Senior CloudKit Client Software Engineer", "summary": "Imagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. Apple is looking for an experienced Software Engineer to help develop the next generation of device frameworks for Apple's cloud infrastructure. You will be working on key components of the iCloud platform and introducing new fundamental capabilities. Your work will help to power and scale products across Apple and beyond, such as Photos, Notes, Messages, Backup, Safari, and many more. You will work with tenured engineers that have a real passion for designing and maintaining developer-friendly APIs.", "description": "We work on the device-side of iCloud building frameworks such as CloudKit and NSUbiquitousKeyValueStore that provide the foundations for secure and private cloud storage and computation. This position will involve close collaboration with engineers across Apple, covering dependencies below our frameworks and adopters above them. This job entails systems programming tasks such as synchronization protocol design, IPC, multi-process performance considerations, and API design. Reliability is essential, and we’re looking for engineers who are passionate about building complex systems that will seamlessly recover in the event of errors. In this role, you will: Work with adopters to craft flexible and ergonomic APIs Work with OS partners to build performant architectures Work with our server counterparts to design scalable features and protocols Work with teammates to help maintain and evolve test automation", "key_qualifications": "5+ years of software engineering experience with strong programming skills in Swift or Objective-C Experience building on Apple Platforms (macOS, iOS, watchOS, tvOS, etc.) Proven track record of working on rapid development cycles and shipping software on tight schedules Passion for building system-level frameworks and APIs Excellent written and verbal communication An interest in Swift concurrency", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science, an engineering-related field, or equivalent related experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545307"}