{"title": "Display Engineer", "summary": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Apple Inc. is looking for a Display Engineer for the development and qualification of Displays for Apple Watch & iPhone products. This individual will be working on flat panel displays both at the component and system level passionate about delivering the best front of screen performance display for our products. This individual serves as a focal point between the system design team, the display EE team, display mechanical team, the supply base management team, and the display suppliers, managing all activities vital to deliver displays into final products from initial concept to production.", "description": "-  Investigate the best display technologies from potential suppliers. -  Define the display module specs for new Watch/iPhone projects. -  Own an internal multi-functional team working with team members with optical, EE, ME, process and panel design expertise. -  Handle the display suppliers as the primary technical contact window. -  Perform the vital display testing and review test results from the display vendors, system OEMs, and multi-functional groups at Apple to ensure the performance specifications are met. -  Identify all open engineering issues and drive them to closure with efficiency to support project needs. -  Ensure display goals are met for engineering builds and initial mass production. Address issues from initial ramp and field returns related to displays and qualification of solutions", "key_qualifications": "Technical expertise and experience in a subset of the following fields are required: optical design and characterization, optical and/or human visual physics, semiconductor optoelectronics, display technologies, optical sensor technologies. Knowledge and experience in display specific optics is a strong plus. Hands-on experience in benchtop and industry standard optical measurement systems (characterization, test, and validation) Hands-on experience with programming languages used for data acquisition (Python, LabVIEW), statistical analysis (JMP, MATLAB) and/or optical simulation tools (LightTools) Experience with module engineering and mass production procedures is a strong plus Experience with failure analysis connecting optical device performance to process outcomes Excellent project management, communication and collaboration skills required. Willingness and ability to travel.", "preferred_qualifications": "", "education_experience": "BS in Electrical Engineering or Physics and a minimum of 3 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541453"}