{"title": "SoC Power Model Engineer", "summary": "Do you want to utilize your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? Do you have a passion for crafting entirely new solutions? Do you love building without precedent? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality.", "description": "Imagine yourself at the center of our SOC design effort, collaborating with all disciplines, playing a strategic role of getting functional products to millions of customers quickly. You will have the opportunity to integrate and come-up with new ideas, as well as work with a team of talented engineers.", "key_qualifications": "Electrical Engineering background is preferred. Familiarity with ASIC power analysis and optimization. Familiarity with Verilog and System Verilog. Proficient with Python scripting*. Familiarity computer architecture, logic and circuits design. Familiarity signal processing is a plus. Familiarity with SOC design flow and methodology is a plus. Silicon power measurement experience is a plus. Strong communication skills are a pre-requisite as the candidate will interface with cross-functional groups.", "preferred_qualifications": "", "education_experience": "Minimum requirement of a BS degree and a minimum of 3 years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543998"}