{"title": "PCB Layout Engineer", "summary": "At Apple, we work every day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually talented PCB Layout Engineer.", "description": "-  In this role you will develop the PCB Layouts for validation, characterisation and qualification purposes.\n-  You'll work closely with the Silicon Validation or Productisation HW teams to understand the board requirements, providing help and guidance during the schematic generation stage and proposing design trade-offs for resolution and implementation where appropriate.\n-  Assist lower level PCB Layout Engineers in the resolution of critical design problems along with mentoring and training.\n-  Participate in the evolution and definition of Apple’s Design For Manufacturing (DFM) guidelines.\n-  Provide competitive and accurate timeline estimates for project planning purposes.\n-  In conjunction with your peers, define best practice layout methodologies.", "key_qualifications": "", "preferred_qualifications": "- Deep knowledge of PCB Layout - experienced in the design of cutting edge dense, complex circuitry including HDI and extra fine pitches.\n- Deep understanding of PCB manufacturing, assembly processes and current state of the art.\n- Strong semiconductor background with an appreciation of power management circuits, with a clear understanding of high power density, mixed signal layout techniques applied to extra fine pitch BGA fan-out methodologies.\n- Experienced user of Cadence tools.\n- A detailed understanding of PCB Design tool flows.\n- Excellent communication and interpersonal skills, combined with the ability to collaborate, work independently and proactively while making sound technical decisions.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560250"}