{"title": "Data Center Technician", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. The people here at Apple don't just craft products - they build the kind of wonder that's revolutionized entire industries! It's the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Data Center Technicians are responsible for installing, servicing and maintaining Apple IT Infrastructure in a 24/7 environment with rapidly shifting priorities while maintaining high availability of the infrastructure. Strong attention to detail and effective documentation skills are critical components of success in this position.", "description": "As a successful Data Center Technician, your performance objectives include a strong desire and capability to learn, grow, and develop new skills. Empower a culture of safety, security, and compliance in all aspect of datacenter activities. Establish and enhance strong working relationships with various internal teams and external suppliers. Understand overall ticket management process. Perform power cycles, swap out failed components, handle storage media, and troubleshooting. Perform cable installations, hardware rack / stack installations, testing, and troubleshooting using standard data center processes. Physically assist in moving and racking equipment. Supporting deployment of on-site data center physical infrastructure including servers, NetDevices. Supporting parts/component replacement and physical hardware troubleshooting. Assist data center Inventory and Asset Management Team with shipping/receiving and inventory management to support high work volumes. Lead through change by bringing clarity, generating energy, and delivering success.", "key_qualifications": "Experience supporting IT equipment or related IT experience, Working knowledge of physical IT infrastructure components, Experience operating macOS, Windows, Linux, Experience running diagnostics, firmware updates, to resolve hardware/software issues, Experience working with network protocols and concepts, Experience with Linux command line script, Experience troubleshooting optical connectivity issues, Experience using cable analyzer, smart network tester, and OTDR, Experience using an Incident/Change request application, Experience using network and data center planning tools, Experience installing in-cabinet, uplink and structured cabling solutions, Experience with network architecture design and installation, Experience with cross functional collaboration and coordination between teams and team members, Ability to interact with the internal customers as well as vendors, Ability to create and update technical documentations, Ability to support frequent standing, walking, lifting, and working at heights, Responsible for ensuring government regulatory compliance, OSHA, EHS and other similar programs with direction from their management team, Valid license to drive standard street-legal automatic transmission vehicles within local jurisdiction, Experience operating heavy-load movement equipment up to 50 lbs (pallet jacks, chassis lifts, etc.), Flexibility to work non-business hours (shifts) that may include weekends and/or holidays, Excellent organizational, written and verbal communication skills", "preferred_qualifications": "", "education_experience": "Associates degree in computer science or Minimum 3 - 6 years of related experience Preferred technical certifications BICSI Installer I or equivalent, Server+, Linux+, Network+, ITIL, Linux/Unix Certification or related experience", "additional_requirements": "Works on assignments that are moderately difficult, requiring judgment in resolving issues and making recommendations, Receives little instructions on newly introduced assignments under minimal supervision, Ability to work extended hours (with accurate hydrations) within a Data Center environment typically within the heat range of 79 degrees Fahrenheit to upwards of 105 degrees Fahrenheit, Use of appropriate PPE such as safety shoes, safety glasses, gloves and facial covering in various environments with ranging temperatures as listed above", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552308"}