{"title": "AIML - Sr Machine Learning Engineer, Data and ML Innovation", "summary": "Do you want to play a part in the next revolution in large languages models, contribute to products that are redefining mobile and desktop computing, and work with the people who built the intelligent assistant and search products that helps millions of people get things done — just by asking or typing? The vision for the AIML Data organization is to improve products by using data as the voice of our customers. As a Sr Machine Learning Engineer on the team, you will build algorithms and data applications that leverage the power of data (real and synthetic) to improve model training efficiency and performance.", "description": "We are looking for people with a track record in building products and relationships to affect decisions. Join us, and impact hundreds of millions of customers across billions of their interactions with intelligent features on iPhone, iPad, HomePod, Mac, Watch, CarPlay, and tv across more than 30 languages. -  You will partner closely with data engineering and data science parters as well as product teams to identify areas for product and model quality hillclimb -  Develop micro-services that enable easier, programmatic integration of model training processes and frameworks across the AIML organization. -  Use appropriate modeling techniques (large model fine-tuning included) to extract high value training datasets, verified through ablation studies -  Apply ML rigor and complex algorithms in high impact projects. Evangelize findings throughout the organization to ensure integration of information into operational processes.", "key_qualifications": "Derive engineered metrics and statistical information out of massive and complex datasets (e.g. Spark MLlib, Druid, Solr, Kafka). Have built robust feature extraction and ML training pipelines and have a keen eye for where to automate (e.g. Airflow). Have expertise in modern deep learning techniques via packages such as PyTorch, Keras/Tensorflow.", "preferred_qualifications": "Good understanding of ML algorithms and ML inferences", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558297"}