{"title": "Creative Technologist", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability, and performance of the product? Dynamic, Inspiring people and Innovative technologies are the norm here. Apple’s Pro Workflow team (PWF) is seeking a multi-disciplinary creative expert with broad capabilities and a future-looking vision to join our team. A team within Apple’s Hardware Engineering organization, PWF joins creative domain experts with computer system architects to drive innovation and deliver astounding new features to iPhone, iPad and Mac. From beginners learning the basics of music or video creation to professional animation, virtual production, and broadcast customers, PWF is dedicated to elevating and accelerating the creative capabilities of our customers. Apple Hardware reflects a design philosophy at the intersection of technology and the arts. We strive to enable our creative customers with accessible and powerful tools. PWF is a core group contributing to the future of digital creativity; come join us!", "description": "Key responsibilities of the person in this position would include; Collaborating with System Architects to identify creative use cases that are impacted by hardware performance. Contributing to process that establishes and validates hardware performance targets for creative use cases. Working individually and collaboratively on research and development of new creative capabilities for iPhone, iPad and Mac. Leading cross-functional efforts to improve performance or bring new features to Apple products. Maintaining knowledge of current and next-generation hardware, software and workflows in media and entertainment. Creating presentation materials and presenting status reports and project outcomes regularly to peers and executive leadership. The person will be engaging in technical discussions with key external developers and strategic customers", "key_qualifications": "", "preferred_qualifications": "At least 5+ years industrial experience in video, visual effects, animation, immersive experience design or similar creative field. Multi-disciplinary creative with expert knowledge in two or more established creative software applications. Demonstrated success as a technical artist or similarly technical creative contributor in film, television, live events, immersive media, or social media production. Authoritative resource within areas of expertise; familiar with specification, design and configuration of all required software, hardware and peripherals. Proven ability to build innovative workflows and bring these into production environments. Experience debugging and resolving workflow issues independently, within a team, and as a beta tester. Excellent communication, organization and leadership skills with ability to inspire and align team members; ability to filter and distill relevant information and package for the right audience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553346"}