{"title": "Module Process and Prototyping Development Engineer", "summary": "At Apple, we believe our products begin with our people. By hiring a team with varied strengths, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? We are looking for a highly motivated process development engineer to join the Display Technologies Organization to work on module process development of new display and optics module architectures for future Apple products. The engineer will be working in a highly technical and fast paced team from Apple’s Module Technology Center (MTC). The candidate is expected to work efficiently and smartly to design experiments (DOE’s), drive process optimization, analyze & summarize project data, communicate & report technical learnings to cross-functional collaborators and management. The candidate is expected to have multi-disciplinary skillsets that can efficient work with mechanical, materials, and optical engineers. This is a hands-on interdisciplinary development role that will require versatility across a variety of tasks in a highly collaborative environment.", "description": "Responsible for leading new process bring up and development with R&D equipment. Convert incubation technologies and proof-of-concept process into scalable solutions through module process optimizations and builds. Hands-on module process validation in development labs, including resource and DOE planning, empirical validation trials, characterization, data analysis and visualization, parameter optimization, documentation, and reporting results. Collaboratively work with cross-functional teams to plan and align the validation plan & build activities, and demonstrate technical results / issues to executives", "key_qualifications": "", "preferred_qualifications": "Advanced Degree ( Ph.D. or M.S) preferred. Demonstrated ability to enable, improve and realize new design architectures through process development learnings. Proven track record to bring novel processes from R&D to scalable solutions. Well organized and clear communication of in-depth technical results and issues to executive management. Experience with mechanical design in CAD systems (Solidworks, NX, AutoCAD) is a plus. Experience with optical components, films, and assembly is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555461"}