{"title": "Product Designer", "summary": "People at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\nApple’s Services - App Store, Apple Music, TV+, and many more - are the most exciting and dynamic in the world. Our teams work together to craft products and experiences that impact people’s lives in ways they could not have imagined. The Apple Services internal tools HI design team is growing to deliver new and engaging experiences. These tools are the engines that power the delivery of Apple’s original content and partner content to millions of customers. We are looking for a talented Product Designer who is passionate about user experience design and wants to shape the vast machinery that powers Apple Services.", "description": "Join the internal tools HI design team at Apple and collaborate closely with cross-functional teams to design intuitive and user-centric tools for our internal creatives. As a key member of our team, you will play a pivotal role in shaping the user experience of our tools, making a significant impact on the efficiency and satisfaction of our internal creatives, and enable them to deliver the best content possible to Apple customers.\n\nAs a Product Designer on this team, your primary focus will be on:\n-Collaborating with internal creatives to understand their complex requirements and use cases for designing tools that support their workflows.\n-Conducting user research when needed to inform designs and ensure a deep understanding of our users' needs.\n-Solving for complex interaction problems and designing elegant user experiences that make complex tasks easy and efficient for our users.\n-Maintaining a high level of visual quality, ensuring all designs are pixel-perfect and align with Apple’s design standards.\n-Paying close attention to design patterns, consistency, color use, typography, and subtle details that can make or break an experience.\n\nThis role requires working under tight deadlines while receiving input from design leadership and various cross-functional stakeholders. Strong collaboration skills, composure under pressure, and adaptability to rapid change are essential. Above all, we seek a dedicated individual deeply passionate about Apple's high standards and design aesthetic.", "key_qualifications": "empty string", "preferred_qualifications": "Experience in designing internal tools or software for creative professionals.\nExperience designing big data enterprise tools.\nOutstanding ability to lead and present a design-first vision.\nDemonstrated ability to build strong relationships across an organization.\nSelf-starting, self-motivated, self-directed, and self-sufficient.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559718"}