{"title": "Software Development Engineer in Test - Platform Power Quality", "summary": "Are you a big-picture problem solver who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, multidisciplinary user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. Do you have a strong interest in the power and energy optimizations and technologies? A desire to work on complex software features, driving a high standard of quality into Appleʼs products? The Core OS Platform Enablement and Quality organization is looking for a dedicated and passionate software engineer to join the test engineering team. As a critical member of the team, you will be focusing on software technologies in low-level power management. Tightly integrated within the development team, your responsibilities will span across all phases of software delivery of Appleʼs products, from early design to product launch and beyond. Youʼll become intimately familiar with one or more major technologies, tackling responsibilities of software integration of key SOC parameters, test, framework and tool development, along with influencing design decisions.", "description": "Devise a testing strategy for one or more major SOCs, focusing on low-level power management Lead SW integration and test of various configurable SOC parameters Gain a deep understanding of the design, requirements and architecture Influence inclusion of testability into the software design Develop and automate unit, functional and system-level tests Define and drive quality metrics to track progress and improvements Collaborate cross-functionally with peer test, QA and validation teams Assess and represent end-user impact of issues, shaping key product decisions Explore novel approaches to create new test frameworks, automation and infrastructure to streamline testing", "key_qualifications": "5+ Years of experience in software development and test Skilled in testing embedded systems and firmware Strong Python and C/C++ programming and debugging skills Familiarity with computer architecture and operating systems concepts Demonstrate strong critical thinking, debugging and troubleshooting skills Excellent collaborative and communication skills", "preferred_qualifications": "", "education_experience": "Bachelorʼs degree or equivalent experience in Computer Science, Computer Engineering, or a related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540471"}