{"title": "Service Warehouse Lead - AppleCare Logistics", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products - they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Joining the AppleCare Service Operations team will give you the opportunity to lead and oversee a range of assignments within our service, repair and logistics process. You'll be responsible for guiding and coordinating the daily activities and team members for Service Warehouse Operations including test and repair, inventory control, data entry, and shipping and receiving. This is a fast-moving, dynamic environment where flexibility and adaptability are key attributes needed for success. Excellent project and time-management skills, with an ability to organize and drive critical tasks and objectives in support of our goals is something we value.", "description": "As an AppleCare Service Warehouse Lead you will work to ensure all new and existing employees are trained/cross trained and have the knowledge, ability and tools needed to perform their role. You'll work directly with the Service Warehouse Supervisor to ensure team members understand and are adhering to the required procedures and processes while providing objective performance data as it relates to safety, training, quality audits and productivity. Responsibilities will include, but, not be limited to: Identify and recommend products and process changes to improve efficiency and reduce costs. Monitor daily performance metrics and drive productivity standards and production objectives are achieved. Escalate functional and process failures to the appropriate support groups and supervisor. Provide daily metrics to track yield, quality, and productivity while using data to facilitate continuous improvement on the line. Perform additional duties and responsibilities such as task delegation and systematically follow up on progress reporting. Implement continuous improvement activities including Lean operation and 5S. May provide functional supervision in the absence of the supervisors. Collaboration with other Apple groups including Finance, Planning, and AppleCare and Engineering when appropriate.\n\nFlexible to work swing shift from 3:00 p.m. to 12:00 a.m Pacific Standard time Monday through Friday. Ability to move to other shifts based on business need is required. Successful completion of a pre-employment assessment, background check and drug screen.", "key_qualifications": "N/A", "preferred_qualifications": "Thrives on a team where expertise is shared and feedback is welcomed\nAble to effectively tailor written and verbal communication and style to differing audiences\nFamiliarity with SAP, FileMaker Pro, Mac OS, iOS, Excel", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $25.20 and $36.00/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559049"}