{"title": "Facilities Operations Center Operator, Data Center", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. Do you wish to be challenged to think creatively? As part of a group of like-minded people, you will address sophisticated topics that craft how we operate and respond to our facilities. Our vision of the future motivates you to optimize efficiencies and improvements while generating ideas that push team members and senior leaders to expand the boundaries of innovation and technology. With your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements, and serve as an expert in your specialty field(s).", "description": "As a Data Center Facilities Operations Technician you will excel among a team of thinkers and doers, committed to working in a mission-critical environment that values continuous improvement and adopts change. This position also requires escalation of incidents and risk level maintenance issues. The FOC monitors are the navigators and report technicians for the building systems (EPMS, BMS and FLS controls systems). The FOC monitors are relied on to monitor all buildings and the sites critical reporting systems. In this role, you will address sophisticated topics that craft how we operate and respond to our facilities. With your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements, and serve as an expert in your specialty field(s). Apple’s Data Center Operations team thrives with individuals like you that take pride of ownership for the services provided in our critical environments. We excel at actively leading and maintaining systems that expand our customer support capabilities, and assist the world with their daily lives!", "key_qualifications": "Proven knowledge of mechanical, electrical, and fire life safety systems. 2+ years of relevant experience with EPMS, BMS and FLS controls systems along with maintenance management systems. Routinely understand critical daily activities and projects with the ability to evaluate conflicting priorities, tasks, and risks while raising to the Senior Facilities Operations Center Operator  and/or onsite supervision as needed. Excellent administrative skills to document all critical activities taking place on campus with strong written and verbal communication skills in order to stay aligned across multiple shifts and disciplines. Execution of daily rounds and readings as defined by the Senior Facilities Operations Center Operator and/or management team. Experience and skills necessary to cross collaborate with multiple disciplines to assess and address high priority alarms and actively pursue risk mitigation. Assists with controls system manipulation with approval from the Senior Facilities Operations Center Operator and/or onsite supervision.", "preferred_qualifications": "", "education_experience": "High School diploma or GED equivalent", "additional_requirements": "Must be available to work rotation shifts to include 12 hour shift on an assigned basis. Ability to sit, stand, bend, stoop, push, pull, reach and lift as required, on a continuous basis, Ability to work extended hours within a Data Center Environment and typically within a heat range of 60 degrees Fahrenheit upwards of 110 degrees Fahrenheit while following OSHA driven work rest cycles. 2+ years of relevant experience with EPMS, BMS and FLS controls systems along with maintenance management systems.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552383"}