{"title": "Silicon photonics / Optical packaging engineer", "summary": "Silicon photonics (SiPh) technology is essential for realizing next-generation optical interconnects already implemented in data center connectivity and ready to penetrating into short distance within the boards. One critical technology to realize high-volume, low-cost SiPh optical interconnect applications is the development of high efficient optical I/O module architecture, assembly, optical coupling design and process for single-mode fiber packaging. We are looking for a hardworking and passionate Si photonics & optical Packaging Engineer to join our team. In this highly visible role, you will develop Si photonics engine/chiplet packaging and co-packaging solutions utilizing advanced packaging technologies, define assembly baseline processes, decide package BOM, establish optical coupling design/manufacturing that are optimized for performance, reliability, yield and cost.", "description": "Responsible to lead Si photonics packaging technology development. Work with cross functional team and lead optical engine module, optical coupling design/fiber array connector and co-packaging optics development efforts. Si photonics based optical engine package architecture / Package integration and drive micro-optical component assembly/interface characterization through Innovation Work with optical component vendors, foundry and OSAT to bring Si photonics packaging solution from concept to HVM. Minimum 5% International travel.", "key_qualifications": "", "preferred_qualifications": "M.S and or Ph.D. in Physic (Optics major), Electrical Engineering, Materials Science, Mechanical Engineering or an equivalent field desired, preferred. Min. 5 years works experiences in the related field with M.S and or Ph.D Hands-on experience of CMOS BEOL wafer scale processing and flip chip assembly (CoC, CoW, WLP, …) and experience with silicon photonics device (laser, modulator, PD, passive components such as Si WG, MUX/DeMUX is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560653"}