{"title": "Machine Learning Scientist - Health Sensing", "summary": "Would you like to be a critical part of an engineering team building next-generation features to improve health using sensing technologies? We are the algorithm team behind ECG, oxygen saturation, sleep tracking and many more health features on Apple Watch. Our team is looking for a Machine Learning Scientist/Lead with in-depth knowledge of machine learning/deep learning, human physiology and statistical signal processing along with strong programming and framework optimization skills. Bring passion and diversity to our team, and let us create useful and amazing things that do not yet exist.", "description": "Develop innovative algorithms for extracting insight from sensor and health data and optimizing performance using machine learning/deep learning on big data resources Collaborate with team members from prototyping to production Analyze and improve efficiency and stability of algorithms deployed to user devices Evaluate and model end user performance and impact Collaborate with team members to develop optimized frameworks to run machine learning experiments", "key_qualifications": "", "preferred_qualifications": "Master in BME/CS/CE/EECS/Math/Physics or equivalent Experience with algorithm design for health sensing, knowledge of human physiology is a plus Previous experience designing data collection studies, and analyzing data quality and usability Hands-on experience with large scale data solutions with distributed data processing frameworks (e.g. MapReduce, Spark) and designing/optimizing scalable frameworks to run machine learning experiments", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557031"}