{"title": "Americas Central Logistics-Planning Analyst", "summary": "The Central Logistics Planning Analyst will be responsible for capacity planning at our AMR distribution centers to include areas such as headcount requirements, volume demand forecasting, and planned production rates. The candidate will need to work closely with our 3PLs and Supply Demand Management teams to analyze both BAU & NPI demand projections and trends to understand impacts to our network. This role is key to foreseeing future challenges in our DC supply chain to understand what actions must be taken to prevent and possessing the ability to articulate throughout the organization. The candidate will need to be customer focused, process minded and have a passion for excellence. The candidate must be able to work in a broad organization, collaborate well with others, and have the ability deep dive into data going an inch-wide mile deep. This role requires superior business acumen, strong people and service provider leadership, and innovative process improvement skills to drive customer satisfaction in the areas of delivery management and fulfillment. In addition, leadership skills to inspire exceptional performance, facilitate an energetic environment, leading to results that deliver a consistent excellent experience for team members and customers are highly desired.", "description": "• A successful candidate will have 5+ years Logistics and/or Operations experience\n• Prior experience in forecast planning, forecasting controls, inventory management, and/or production / manufacturing operations is strongly preferred.\n• In this role, you will combine a working understanding of supply chain practices, strong problem solving capabilities, and business savvy.\n• You will need to have strong Excel & analytical skills\n• You are expected to exert thoughtful influence in a matrixed organization - should be a strong teammate and communicator.\n• You should be confident presenting to senior management.\n• Additional requirements include the ability to both think strategically and execute tactically, a persistent attention to detail, and a high level of ease in working with numbers.\nUp to 10% travel required", "key_qualifications": "Empty", "preferred_qualifications": "• Collaborate closely with 3PLs to develop and understand capacity plans to fulfill all demand for Online, Retail, and Reseller channels\n• Responsible for preparing, understanding, and effectively communicating out statistical data\n• Drive tool development and management systems\n• Investigate problems, find root causes and develop solutions\n• Provide analytical support for projects, key performance indicators, and capital planning\n• Ability to prioritize and multi-task effectively\n• Represent logistics on cross-functional teams\n• Evaluate existing capabilities and establish new systems and processes for tracking, measurement, reporting, and analysis of DC Ops\n• Providing reports to management; inventory, distribution, freight, cycle time, etc.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554458"}