{"title": "Senior Software Engineer - Apple Private Cloud", "summary": "The Apple Private Cloud Compute team is looking for an exceptional software engineer to integrate and test software features and components. In this highly collaborative role, you will be at the center of multiple efforts to utilize hardware acceleration for machine learning and high performance computing workloads. You will partner with teams across Apple to adapt, tailor, and scale software to build cloud infrastructure at scale. We are looking for someone with proven mastery building and managing scalable, resilient systems. You should have a strong mix of education and practical experience with a real passion for diving headfirst into challenging problems.", "description": "You will work cross-functionally with Cloud architecture, platform design, and software development teams to automate and validate best in class hardware, software and services. You will be responsible for building and maintaining system infrastructure that powers the next generation of data centers. You will ensure high quality and agility with unit tests, integration tests, and performance tests. You will be responsible for crafting, implementing, and executing test plans and test suites based on specification documents. You are the right match if: You possess strong skills in software development and testing. You have cloud domain knowledge and experience You are passionate about developing new features, automation, maintaining existing code, fixing bugs. You have strong problem-solving skills. You are skilled at the art of communicating and enjoy it", "key_qualifications": " ", "preferred_qualifications": "Excellent Automation skills and CI/CD pipeline experience is a plus Good understanding of microservice topologies and deployment patterns in the cloud and/or edge Experience with cloud orchestration engines such as Kubernetes, Nomad, Apache Mesos, or similar Expertise with Go, Swift, Objective-C, and Apple development tools is a definite plus! Passion for software architecture, APIs, and high-performance extensible software. Creative, collaborative, and product-focused Excellent communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557391"}