{"title": "Operations Program Manager, Core Technologies", "summary": "The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. We seek a Core Technologies Operations Program Manager (OPM) who will lead all aspects of new product development and product launch within Operations in Asia and is directly accountable for the results. Responsibilities include launching products on time, with high quality, and maximum customer availability. The OPM in-region is the primary leader and interface between Operations and Engineering, internally and with vendors. In Core Technologies, you will lead the key subsystems across all platforms that make Apple iPhone, Watch, Mac, iPad & VisionPro great.", "description": "OPMs are pivotal to the dynamic development and launch of Apple’s products. A successful OPM is a leader and facilitator, is driven, organised and detail oriented, excels in program/project management & communicates with ease at all levels. As an OPM, you will be responsible for operationalising and scaling new products. -  Lead Apple's new product introduction efforts during ramp within the operations sphere. Specific goals include team leadership in driving issue resolution, supply chain design, schedule, cost, quality and availability. -  Engage with manufacturing partners to develop, ramp, and introduce products. Develop rapport with partners and detailed knowledge of 'how the factory works,' its capabilities and limitations. Engage with vendor partners across levels to lead issue resolution and operational readiness. -  Lead matrix team members from across all operations functions in Asia to develop new product plans and execute on operational scaling. -  Communicate project status updates to various project partners, including team members and executives within Apple. Synthesize a multitude of issues into a clear, concise and focused message. Present with confidence and brevity. -  Always push the leading edge of innovation and excellence in Apple products and program management practices. -  Support coverage for other products in the region. Travel to another location on other products on an as-needed basis to drive issue resolution and/or support build/ramp activities.", "key_qualifications": "5-10 years of program management experience. Exceptional ability to build relationships, build cross-functional teams and exert effective influence in a matrix organization. Operate in an ambiguous environment, taking charge, and having an attention to detail without becoming lost in the details. Track record achieving significant results on sophisticated projects in an often ambiguous and always constantly evolving environment. Experience in working with teams across geographies and cultures. Outstanding communication & interpersonal skills. Incredible drive, motivation, and energy to completing any challenge given. Ability to travel up to ~40% to various domestic/foreign destinations.", "preferred_qualifications": "5-10 years of experience in dealing with high volume manufacturing, either as a customer or manufacturer. Ability to think strategically, while driving tactical program execution. Education: Engineering Degree with MBA from a premier institute.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560393"}