{"title": "AIML - Senior Applied Research Scientist, Health AI", "summary": "The Health AI team is at the forefront of machine learning and health science at Apple. We are a close-knit team of highly accomplished, deeply technical research scientists and machine learning engineers, focused on delivering innovative technologies that impact millions of users. We are looking for a research scientist passionate about solving real-world problems in the health domain that make a difference in our customers' lives.", "description": "In this role, you will in part be a senior individual contributor and in part lead a small team focused on domain expertise with machine learning to impact health AI and health-related hardware design. You will use your leadership and IC skills to define metrics and goals and align with partners. You will also use your skills and experience in state-of-the-art machine learning and deep learning to design, implement and evaluate new machine learning models and algorithms to solve challenging problems involving unique data and objectives. You will have the opportunity to explore and develop hybrid scientific modeling and AI technologies and new areas within Apple to expand the team’s portfolio. The ability to substantially improve model performance from a prototype by using domain expertise of partners, novel architectures, optimizing hyper-parameters or exploring data augmentation techniques while staying aligned with partner roadmaps is key. Writing publications and being engaged with the academic community is desirable, but not necessary.", "key_qualifications": "Hands-on experience in pioneering machine learning and deep learning combined with domain knowledge (e.g. Physics-informed ML, Sim2Real, simulation + ML, Hybrid Learning), applied to large scale data and challenging problems. Strong background in generative models, constrained optimization, scientific models (optional) and statistical inference. Passionate about applying machine learning methods to deliver end-user experiences in health space. Proficiency developing large scale models using modern machine learning packages (e.g. TensorFlow, PyTorch, Jax). Strong publication record in the field of Machine Learning or AI is highly desirable. Indicating an ability to not only understand but also contribute to ground breaking research. Experience in driving cross-functional collaborations. Having experience to do so across offices and timezones is a plus. Experience in contributing to shipping products is a plus. Excellent interpersonal and communication skills and experience in mentoring and / or managing applied researchers.", "preferred_qualifications": "", "education_experience": "Ph.D. in Computer Science, Machine Learning, or related fields or an equivalent qualification obtained through other avenues. Multiple years of industry and applied machine learning experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548739"}