{"title": "Payroll Analyst", "summary": "Responsible for ensuring assigned payroll countries / tasks are completed within SLAs, respond to employees’ related queries on their pay results & deductions, taxes as well as year end tax forms. Provide support to HR partners’ enquiries and participate in regional / global projects / initiatives as assigned. Back up for payroll analyst of other countries.", "description": "-  Responsible for assigned countries’ payroll and see through that the identified task for the countries’ payroll are completed timely and accurately\n\n-  Perform inputs into payroll systems / teach vendors on payroll related transactions\n\n-  Support and ensure successful completion of off-cycle processing - new hire / terminations / severance / bank rejections / missing bank accounts\n\n-  Respond to employees’ queries on pay results, payslips, deductions / tax payments / year end tax forms\n\n-  Verify vendors’ invoices and perform goods receipts on SAP Cycle\n\n-  Provide support to HR partners’ enquiries on payroll regulations / processes / specific matter on employees’ queries\n\n-  Provide support on audit / tax related queries\n\n-  On assigned basis, support payroll results validation for Project’s UAT / provide local compliance rules / regulations for purpose of business requirements for projects\n\n-  Provide payroll metrics on quarterly basis\n\n-  Ensure regular updates on documentations on payroll processing tasks and tax and social insurance related filing / reporting procedures", "key_qualifications": "", "preferred_qualifications": "Experience in payroll processing and employee queries handling is helpful\nExperience with SAP Payroll and/or Workday will be an advantage\nMust be a great teammate and has passion to initiate change\nAdaptable & Fast learner\nShown oral, written and interpersonal communication skills\nAble to work under stress and in a fast paced environment\nDirect handling on China tax filing will be an advantage\nJapan payroll experience is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547066"}