{"title": "Data Center Technician, Data Center", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. Inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work.", "description": "The Data Center Technicians is responsible for Empowering a culture of safety, security, and compliance in all aspect of data center activities. The role provides day-to-day functional support of work plans, coordinates with Data Center Operations teams, business groups, and project leads to support the lifecycle of IT hardware to include install, support, and decommission. Responsibilities Empower a culture of safety, security, and compliance in all aspect of data center activities. Establish and enhance strong working relationships with various internal teams and external suppliers. Understand overall ticket management process. Perform power cycles, swap out failed components, handle storage media, and troubleshooting. Perform cable installations, hardware rack / stack installations, testing, and troubleshooting using standard data center processes. Physically assist in moving and racking equipment. Supporting deployment of on-site data center physical infrastructure including servers, network switches and storage devices. Assist data center inventory and asset management team with shipping/receiving and inventory management to support high work volumes. Lead through change by bringing clarity, generating energy, and delivering success. Ability to assess & triage work requests, provide planning detail, assist in the prioritization and coordination of service delivery for data center operations teams. Flexibility to work non-business hours (shifts) that may include weekends and/or holidays Use of appropriate PPE such as safety shoes, safety glasses, gloves and facial covering in various environments with ranging temperatures.", "key_qualifications": "Empty", "preferred_qualifications": "Minimum 1 year of related IT experience, Excellent organizational, written and verbal communication skills, Ability to take direction with minimal direction, Ability to interact with the internal customers as well as vendors, Works well with others, thrive in a team environment, collaboration, Knowledge of safety procedures, established techniques, and equipment, Prior experience working in a data center environment", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556141"}