{"title": "Software engineer, OpenSearch/ElasticSearch/ NoSQL Services", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly! Bring passion and dedication to your job and there's no telling what you could accomplish. We are seeking an experienced and motivated Sr Network Reliability Engineer to join our Enterprise Networks team, dedicated to ensuring the reliability and performance of our global network infrastructure. This role is pivotal in maintaining the seamless operation of our enterprise networks, enhancing the overall reliability, visibility, and efficiency of our network services. Join the IS Data Services and work with a phenomenal group of motivated people that solves exciting and useful problems.", "description": "In this role you will; Lead architecture of large initiatives in scaling, security and availability. Build solutions that will deliver installation, monitoring and upgrade features for nosql and search clusters Work on challenging problems in areas such as data storage, query optimization, JVM performance optimization, security, machine learning and more. Produce bullet-proof code that is robust, efficient and scalable. Drive and work on algorithm and architecture design, execute and deliver results.", "key_qualifications": "", "preferred_qualifications": "3+ years of professional software development experience in Java and Python, Bachelor's degree in Computer Science or equivalent experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558087"}