{"title": "Power Systems Integration Engineer (HWEE) - Wireless Power Division", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "Key responsibilities for this role include providing critical on-site support for factory builds during early prototype and engineering build phases of various Apple programs leading up to Mass Production. This requires you to be able to dig deep into any problems that may arise during a factory build and think critically to help resolve them in a fast paced, data driven environment. You will be expected to meet a high standard for analysis and manufacturing discipline, and work with cross functional teams all around the world to enable us to pass all specifications and requirements necessary to ship a product. - System bring-up, characterisation, testing and validation - System-level problem solving - failure analysis, root cause & corrective action proposal - Debug test sequences on automated test equipment - Design of Experiments (DOE) creation, execution and data analysis - Write technical documentation (Eg. requirements, specifications and test plans) - Review and analyse build data to help inform critical program decisions. Provide detailed build report summaries and present findings with clear summaries and takeaways. - Frequent business travel required, up to or exceeding 50%. (Primarily within China. To a lesser extent New Zealand and USA)", "key_qualifications": "Bachelor’s Degree in Electrical Engineering plus 3 yrs related industry experience. Solid fundamentals in both analog and digital design and comfortable with tackling new challenges with critical thinking and problem solving skills. Hands-on experience in prototype bring-up, debugging, and functional verification. Clear communication (written & verbal) in both English and Mandarin. Team player with the ability to work independently and drive things with minimal supervision", "preferred_qualifications": "Knowledge and experience in Power & Magnetics preferred. Any background in Wireless Power would be advantageous. Familiar with various communication protocols (USB, SPMI, SPI, I2C and UART) and low power embedded systems. Experience working with cross functional FW partners. Direct coding experience in languages such as Python, Matlab and C would be a plus. Experience with high volume product design and manufacturing as well as statistical production tolerance analysis. Good understanding of Gauge R&R methodology would be a plus. Comfort with a fast-paced environment and appetite for innovation, rigour & healthy paranoia", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556851"}