{"title": "Operations Facilities Project Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Provide facility, energy efficiency and environment related initiatives project management and Infrastructure support to our Apple Product Operations Team and contract manufacturers. This will include facility and production equipment energy consumption measurement data collection, deploying new SMART technology with Apple team, in our manufacturing sites for real-time, predictive maintenance and utilization management. Provide guidance to the consulting engineers and contractors for the MEP trades to ensure that Apple standards are met while maintaining functionality, reliability, and energy-efficiency in a cost-effective design. Other responsibilities will include assisting the Facilities Operations staff on facility, mechanical, or electrical issues as needed. Supervises Contracted Architectural and Engineering professional services, construction contractors, including general and specialized trade contractors administrative support.", "key_qualifications": "Skilled in both Project Management, Facility Maintenance, Environment Health & Safety, Waste Management, IT systems, Piping, HVAC and electrical systems design and construction in manufacturing facilities. Experience in manufacturing building infrastructure systems, both primary/secondary systems and variable primary systems. Must be familiar with both pneumatic and DDC controls. Electrical experience should include UPS and backup generator systems designs for both office and data center facilities. Candidate should possess excellent communication skills, both oral and written, and able to deal effectively with both technical and non-technical persons. Candidate must be comfortable and flexible in serving in both supporting roles and leadership roles for projects of varying descriptions. Project management experience would be required as the role requires direct management of Contract Manufacturing projects. Candidate should be familiar with working with regulatory agencies, public utilities, and multidisciplinary teams. Ability and willingness to travel up to 25%.", "preferred_qualifications": "Bachelor’s and/or master’s degree in Architecture, Construction Management, Civil, Mechanical, or Electrical Engineering. Master degree is a plus. 10 years experience with the management of design and construction projects for medium to large facilities. Experience in the consumer, computer hardware or semiconductor industry preferred. Project experience must include general office, electronic test labs, and data center design and construction. Self-driven, proactive, strong communicator, and good team worker. Apple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "education_experience": "", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552686"}