{"title": "AIML - Sr Engineering Program Manager, Data", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? If so, then we want to speak with you! As a member of the AIML Data EPM group, you will be responsible for Apple’s ability to use data to power its products for hundreds of millions of users around the world. You will work with the AIML Data organization to deliver on our vision to make data the voice of our customers, and to inform product and machine learning development. We develop scalable, performant, and quality enterprise data services, for the ultimate goal of measuring and improving products such as Siri and Search. We're looking for an experienced hands-on program manager who can flex into product management as needed, to partner with data engineering, data science, product, and client engineering teams. Do you have a track record of successful program management across complex initiatives? Have you worked on highly leveraged data-schema processes, data efficiency initiatives, or data pipelines? Are you excited about driving the technical projects vital to effectively scale our understanding of our products in privacy compliant ways? Do you thrive working with teams to focus on what matters? We would love to talk to you.", "description": "-  Manage data collection and streamlining processes, creating frameworks that scale across different teams, and supporting and maintaining the operations of those processes. -  Own program and project planning for partner Data Engineering team, including gathering requirements, scoping effort, prioritization and resource allocation, blocking and tackling, and schedule of deliverables. -  Contribute to product definition with partner Data Engineering team, identifying and understanding customer needs and priorities, and developing roadmap. -  Facilitate communication cross-functionally with other teams, ensuring that requirements are well understood, and that priorities and delivery schedules expectations are managed.  -  Build and run processes that allow for the maximum agility and adaptation across data engineering teams to collect data and understand our products. -  Build relationships across the AIML organization and across Apple, aiding teams in working with data engineering; facilitate communication between cross-divisional groups around Apple.", "key_qualifications": "5+ years project management, engineering management, and/or QA/QC engineering experience for software development quality in a fast-paced, sophisticated service. Technical program management or engineering ownership of data collection, pipelines, or tools used by internal engineering teams; experience driving on roadmaps/long-term strategy of internal tools & systems. Experience gathering, analyzing, and presenting data and metrics to back up assumptions, make recommendations and drive actions. Career examples of hands-on involvement of delivering instrumentation, data platforms, data tools, or data processes that improved the customer experience. Self-motivated, independent, and proactive; demonstrated creative and critical thinking capabilities; can quickly triage, prioritize, and lead under pressure. Outstanding communication and presentation skills, written and verbal, to all levels of an organization.", "preferred_qualifications": "", "education_experience": "BS/MS EE/CS/CE or equivalent", "additional_requirements": "Bonus if you have prior data analysis experience (SQL, Python/Jupyter Notebooks, Tableau, Superset). Bonus if you have prior experience exploring data formats and tools for big data systems (e.g. Parquet, Avro, Protobuf). Bonus if you have prior experience working with data engineers (e.g. engineers who use tools such as Airflow, Luigi, Jenkins, MapReduce, Pig, Spark, Hadoop, Hive, HBase, Greenplum, Vertica, etc.)", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537997"}