{"title": "Site Reliability / Ops Engineer, Enterprise Technology Services", "summary": "Imagine what we could do together. At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Apple's B2B team manages critical integrations with Apple's supply chain partners such as manufacturers, logistics providers, banks, resellers and business customers. We are seeking a technically hands on individual with a real passion for programming and automation. Join our dynamic team as a Software Reliability Engineer (SRE) and dive into innovative work culture fueled by machine learning, anomaly detection and threat detection. Collaborate with a highly motivated team of professionals who push boundaries and delivering exceptional results. This position offers an exiting opportunity to build your career as an SRE in a supportive environment, where continuous learning and professional development are prioritized.", "description": "As an SRE at Apple, you will be part of a team who will implement and maintain best-in-class devops practices, work on complex technical challenges related to scalability, reliability and performance of Apple B2B systems. You will be managing the lifecycle of machine learning models in production and non-production environment. You will be responsible for continuously assessing and improving system processes, detecting anomalies, identify the areas of optimization and implementing solutions to enhance system reliability and performance. You should have a passion for programming and a good conceptual understanding of the operating environment - JVM, Operating System, File Systems, Network Protocols. Technical expertise, strong communication skills and teamwork are essential requirements for this role as it involves working with both technical and non-technical groups within Apple and externally with our supply chain partners.", "key_qualifications": "empty", "preferred_qualifications": "Experience in solving and resolving issues in Kubernetes from both an operating system and application perspective. Building and operating container orchestrating systems like Kubernetes or EKS. Strong programming experience in Java building web, middleware or backend applications. Deep understanding of Oracle or similar relational databases and NoSQL databases such as MongoDB. Firsthand experience in performance tuning of applications and databases. Knowledge of Webmethods Integration server or a middleware platform will be a plus.", "education_experience": "empty", "additional_requirements": "empty", "pay_benefits": "empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555784"}