{"title": "Sales - Channel Sales Account Executive  (Based in Sydney/ Melbourne)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Every role at Apple is crafted around our intention to leave the world better than we found it. Our values and our actions tell the world who we are. When you join a company like Apple, these same values fuel your aim to change things for the better — to enrich lives. Apple’s Sales organisation generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. A unique opportunity exists for an outstanding candidate to actively promote the sales of Apple products and services in retail sector, especially in the Consumer Electronics (CE), distributors and also online retail partners.", "description": "- Develop and maintain broad relationships with key partners, developing a strong understanding and alignment with their respective focus areas, value drivers and strategic priorities.\n- Build account plans to drive achievement of targeted business objectives.\n- Work collaboratively with key partner to ensure competitive positioning of Apple Products in all market offers.\n- Ensure efficient channel performance through ongoing analysis of sales data to understand performance, identify growth opportunities, and maintain an effective sales partnership.\n- Drive channel programs to ensure excellent customer experience and partner mindshare.\n- Identify demand generation and promotional opportunities which optimise sales performance, and negotiate commercial arrangements and drive execution against agreed plan.\n- Analyse emerging trends, competitor actions and partner capabilities to identify new opportunities.\n- Meet or exceed quarterly sales targets.\n- You will always represent the Apple brand to the highest level", "key_qualifications": "Experience with online retail industry would be a plus.\nConsistent track record in the delivery of ambitious growth targets.\nAggressive focus on goals and continuous improvement.\nSophisticated communication skills (including English)\nDirect experience with merchandising plans.\nProfessional manner, maturity and outstanding customer & partner skills.\nForecasting, prior quota management and partner management ability.\nCollaborate well with others\nPassion, personal drive and a sense of humour.\nAbility to deal with ambiguity.", "preferred_qualifications": "Analytical mindset\nDemonstrated commercial acumen and is tenacious in driving results.\nExperience with online retail industry would be a plus.", "education_experience": "We anticipate you will have a Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551134"}