{"title": "AIML Software Eng Manager", "summary": "Would you like to play a part in shipping groundbreaking technology for large-scale systems, natural language, and artificial intelligence? Are you passionate about building automation frameworks to evaluate ML models and validate ML applications? Come join Siri ML Systems Evaluation Engineering (ML SEE) team at Apple! Transform the way people keep up with the world and help craft Siri intelligent assistant that helps millions of people get things done — just by asking. We are seeking an experienced engineering manager to qualify Siri ML models by developing and scaling evaluation automation across devices, collaborating with multi-functional teams across the company, driving actionable reports, and ensuring high-quality feature release", "description": "The ML Systems Evaluation Engineering (ML SEE) team is looking for an experienced engineering manager with a combination of strong technical, and project management skills. As a Siri ML SEE Sr. Manager, you will play a critical role in the evaluation of various platforms and product areas for Siri. You will build the technical vision, roadmap for the team and lead collaborative efforts with various engineering teams across Siri to build automation, identify issues, and ensure that every release delivers an improved Siri user experience. You will be a critical engineering partner working to drive efficiency via automation, warrant against regressions for critical use cases, prevent performance regressions and benchmark performance for new features/platforms, and drive recommendations for improvements. This is a fast-paced role with high visibility, impact, and influence in building one of the most advanced AI systems in the industry.", "key_qualifications": "Empty", "preferred_qualifications": "Experience with Natural Language processing (NLP) is a big plus\nExperience with Databases (SQL, NoSQL), Big data is a big plus", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560317"}