{"title": "Assistant Video Editor", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "The Assistant Video Editor maintains a balanced and structured environment in the editing suite, while possessing the ability to closely collaborate with the editor from ideation through final delivery. Our assistant editors have technical, organizational and creative expertise in all aspects of post production and come to Apple to do the best work of their lives.\n\nResponsibilities include:\n\nSetting up editorial projects to studio specifications, importing/managing media, syncing footage, logging dailies, crating selects reels, recording scratch VO, editing rough assemblies and organizing timelines.\nFormatting and generating VFX, Color and Audio prep with corresponding formats: EDL, XML, AAF, OMF and QT picture reference with burn-ins.\nSupervising client sessions by taking notes, updating databases, creating dub lists, exporting cuts and posting to multiple destinations.\nPerforming basic compositing, tracking and rotoscoping.\nAbility and willingness to work unpredictable long hours, late nights, weekends and holidays.", "key_qualifications": " ", "preferred_qualifications": "Expert level FCPX, Compressor and Adobe Premiere user.\nThorough understanding of the post production pipeline and interchange: Ingest, Offline, VFX, Color, Audio, CG, Conform and Export.\nDeep knowledge of audio/video file formats, codecs, frame rates, resolutions, aspect ratios, compression schemes, color spaces, audio bit depths, sample rates and channel configurations.\nExtraordinary communication and organization skills, great attention to detail and quality control with a team first attitude.\nAbility to deliver results when it comes to hitting milestones and deadlines.\nHighly organized with drive to create efficiencies and streamlined processes.\nCan confidently build rapport, credibility and trust across multiple stakeholders - editors, creatives, producers, directors.\nExperience in the following: broadcast, web and event deliverables.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,100 and $173,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559051"}