{"title": "Sr. IT Operations Manager, Partner Solutions & Technology", "summary": "Are you ready to be at the heart of our organization's success, driving operational excellence and innovation? Our dynamic, fast-paced environment is the perfect place for a tech-savvy, visionary Senior IT Operations Manager who thrives on using data to make a real impact. In Partner Solutions & Technologies, we're not just about work; we're about creating groundbreaking solutions that materially impact Apple’s bottom line. Be part of a team where your work is vital and your contributions really matter. If you're passionate about finance and operational efficiency, and yearn to play a pivotal role in Apple’s success, we're looking for you!", "description": "As a Senior IT Operations Manager, you will play a crucial role in ensuring our organization operates at peak efficiency, while supporting our strategic goals. You will lead a talented team of IT professionals in managing our daily operations, from budget and resourcing allocations, to running organization-wide strategic initiatives. Your expertise and attention to detail will be vital in optimizing our operational processes, implementing innovative solutions, and ensuring our resources align with our business needs. You'll work closely with senior leadership to forecast our budget and resource needs, track our actual spend, and see around corners for potential issues and risks that may arise.", "key_qualifications": "Minimum of 7 years of experience in IT operations, with at least 3 years in a leadership role managing cross-functional teams. Proven track record of successfully managing large budgets across multiple teams. Demonstrated ability to analyze large datasets, synthesize the information, and summarize it for easy consumption at different levels using spreadsheets and visual aides to help tell the story. Strong ability to juggle multiple competing priorities while maintaining professionalism. Staying cool under pressure. Superior communication skills, both verbal (meetings) and written (e-mails, reports, and presentations). Proven ability to built strong trust-based relationships and collaborate with stakeholders and cross-functional teams at all levels of seniority. Excellent problem-solving skills and the ability to think strategically and analytically.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Information Technology, Computer Science, Finance or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547978"}