{"title": "Senior Machine Learning Engineer - SIML, ISE", "summary": "The System Intelligence and Machine Learning team is in charge of creating datasets that power many of Apple’s intelligent software. Our datasets range from very small targeted sets to Petabyte scale datasets. We are looking for an expert Machine Learning engineer, or Data Scientist who can help create and improve the datasets used in Generative AI through proven understanding and usage of ML and stats. As a senior member of the System Intelligence and Machine Learning Data team, you will be using Apple technologies to refine our datasets, perform ML-based QA, remove toxicity and select the right images, videos or texts through active selection and model-in-the-loop methodologies. Focus areas range from text processing across many languages (toxic language detection and removal, identification of colloquial vs formal language) to image and video understanding, deduplication and processing. As part of this role you will also own our data synthesis efforts in various modalities including image, text, videos, and audio.", "description": "In this role, you will be working to deepen our understanding of how various datasets can improve the quality of Apple’s ML models on a range of products. You will particularly help shape Apple’s Datasets that are used for generative AI by removing irrelevant or toxic assets, selecting the right assets by employing various asset selection algorithms, and synthesizing new datasets by utilizing Apple proprietary ML models. For this, you will also use your stats and ML background to build models and algorithms that can select the right assets for ML experiences from a large pool of available assets. And you will work with our data engineers to put your models in data pipelines to run on large scale datasets. In our team, you are encouraged to collaborate with other AIML", "key_qualifications": "Proven track record in a Machine Learning Engineering or Applied Scientist role, preferably in a technology company. Familiarity with a broad range of Machine Learning techniques and relevant statistical packages to engineer ML solutions end-to-end. Experience in contributing to production codes; ability to rapidly prototype algorithmic ideas in notebook environments and translate them into production code. Proficient in state-of-the-art ML techniques, particularly in the field of Generative AI and Large Language Models (Transformer architecture, diffusion models, CLIP and various visual and text embedding models, GPT and BERT style language models). Strong proficiency with Python (Scikit learn, Jupyter), PyTorch, SQL-based languages. Working proficiency with Git. Proven experience in data science and analytics, including statistical data analysis. Experience crafting, conducting, analyzing, and interpreting experiments and deep-dive investigations. Outstanding communication and presentation skills with the ability to explain difficult technical topics to everyone from data scientists, engineers, and business partners.", "preferred_qualifications": "", "education_experience": "Bachelors, Masters or PhD degree in Computer Science, Statistics, Mathematics, Engineering; or equivalent experience.", "additional_requirements": "-  Strong analytical product intuition: able to understand the user experience and use data to guide the development of products.\n-  Experience in synthetic data generation for videos, images, text, and audio is desired.\n-  Ability to understand a technically complex product, and work with engineering leads and data engineers.\n-  Ability to build relationships across multiple functions and establish strong partnerships.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551872"}