{"title": "Silicon Validation Software Engineer- ISP Validation", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!", "description": "Are you passionate about changing the world?! We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. As part of the silicon validation team, you perform block and system-level validation of image sensor data (camera) processing subsystems in silicon. Work with logic designers to understand the operation of image processing pipelines at the block and system levels. Investigate the use cases, system-level operation, performance requirements. Develop low-level software to validate functionality, conformance, and performance of image sensor processing subsystems. Work with other members of the validation team to incorporate your tests into system-level tests. Bring-up and debug devices on new hardware platforms.", "key_qualifications": "Strong software skills in C/C++. Experience with image sensor processing hardware pipelines (e.g. raw image processing, cameras, MIPI). Experience with bring-up of Camera Sensors and writing low level drivers for them. Experience with hardware/software interaction. Knowledge of image formats and color spaces. Embedded software experience is a must. Device driver experience a plus. Curiosity about writing software to validate the correct operation of hardware.", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200516367"}