{"title": "AMR Business Process Re-Engineering- Solution Architect", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We are looking for an individual that understands the importance of business architecture and solution design for complex problems in Supply Chain. The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Are you a deep thinker who excels at connecting the dots across multiple complex IS&T systems and seeing around corners by anticipating what could go wrong? Do you love to solve problems and have an uncanny knack for process optimization and transformation? As part of our Americas Operations Business Process Re-engineering (BPR) team, you will be responsible for reviewing business models, processes, and system architecture to ensure the integrity of Apple’s overall system designs and continuity of our supply chains. You’ll assist with developing solutions that support a broad, cohesive operations supply chain strategy. Most important, you will be free to innovate, challenge the norms and drive transformation. The ideal candidate will have deep process re-engineering experience with a focus on the solution architect domain, be self-directed, motivated, and comfortable working in an extremely fast-paced environment. Experience optimizing global supply chain and B2C / B2B fulfillment processes and technology is required. Flexibility and adaptability are key attributes needed for success. This individual should also have strong analytical, project management and leadership skills to handle a variety of activities and complexities spanning the organization. You are willing to work at both a very detailed and strategic level.", "description": "The candidate will be responsible for acting as a Solution Architect across multiple, concurrent complex, interrelated projects, while also leveraging existing solutions to ensure systemic integrity of Apple’s overall IS&T landscape.  This role requires a deep understanding of core operations throughout the supply chain to manage complex, global initiatives.  Success requires thinking strategically, connecting the dots of the bigger picture, as well as being comfortable in the details of the all key deliverables.  Candidates must be self-motivated, comfortable working with minimal direction in a global, fast-paced, sometimes ambiguous environment.  Successful candidates are consummate team players capable of working with cross-functional business teams to identify improvements and deliver capabilities that will exceed our customers' expectations.  Regular interaction with all levels of senior management requires exemplary written and verbal communication skills.  Candidates must be able to deal with ambiguity in a highly matrix environment with a strong propensity for documentation and management systems that keep key stakeholders informed on risks and mitigations.", "key_qualifications": "", "preferred_qualifications": "Proven track record of acting in a lead Solution Architect role, combined with the ability to execute and manage at tactical project-level activities and tasks. Demonstrated competence in functional design and solutions architecture. Led technology transformation projects in Quote to Cash, Supply Chain Enablement, Customer / Vendor / Material Master, Security and roles, etc. Experience with all SAP Supply Chain processes - Quote to Cash, Procure to Pay, Make to Deliver, Inventory management, and Reverse Logistics. Relevant experience implementing innovative Supply Chain solutions leveraging  Machine Learning, Optimization, etc. Has lead efforts in solutions designing across various functions - scalable, stable, and efficient with a focus on customer / business voice Has lead teams and change management strategies in driving process improvement projects Demonstrated ability to establish and maintain trust, credibility and build strong relationships As a leader in Solution Architecture, influencing others and moving toward a common vision or goal, including leading cross-functional workshops to drive consensus 10+ years experience in designing and implementing solutions in Retail, consumer, High Tech companies focused on supply, demand planning, eCommerce, Q2C, Logistics Execution, warehouse and transportation management, payments processes, financial and manufacturing 10+ years designing, configuring, developing, and testing in SAP modules such as SD, MM, PP, LE, and TMS. Minimum of 3 full life cycle migration projects from SAP ECC to S4 HANA Exemplary communication and presentation skills, flexible, open working style and an ability to establish trust and credibility quickly Self-motivated individual who thrives working in a global, matrix, fast-paced environment Experience working on projects with teams based outside the US including international engagements Prior experience in SDLC project management and analysis including scoping / timeline management, documenting use cases, process flows/swim lane diagrams, requirements (BRD) etc, UAT, change management etc", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553678"}