{"title": "Cellular Layer 1 Control Software Development Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "In this role you will be a key member of the Cellular Layer1 Control Software team with following responsibilities: - Specify, design, and implement Layer1/PHY Control Software/Firmware of an innovative mobile wireless communications system. - Implement key scheduling, control processing in tight timeline, latency, and energy constraints. - Lead design and development activities, problem solve and influence project level decisions (for ICT4 and 5 only). - Work with other Firmware and Protocol Stack Engineers, Systems Engineers, and Product Architects to collaborate on design and requirements, interface definitions and new features. - Assist in the development of pre-silicon emulation systems/virtual platforms and use them for pre-silicon Layer1 Control SW design and verification. - Evaluate and implement groundbreaking tools for build, formal verification, and test. - Define methodologies and standards.", "key_qualifications": "Bachelor's Degree or equivalent plus 5 or more years of relevant industry experience; In-depth hands-on L1/PHY Software/Firmware experience in Cellular 3G/4G/5G; strong knowledge and experience in embedded real-time control. Understanding of 5G and 4G 3GPP specifications and protocols, or similar Wireless standards, advanced digital signal processing (DSP), communications, information theory, estimation, adaptive filtering, control loops. Strong understanding of software engineering principles using C and/or C++, Real Time Operating Systems (RTOS) and concurrent programming. Working knowledge of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems. Experience with silicon prototyping, emulation systems, and virtual platforms. Experience in SW verification and HW validation utilizing scripting and/or automation frameworks with strong experience and proficiency in debugging embedded software systems using system simulators, JTAG debuggers, spectrum analyzers, oscilloscopes.", "preferred_qualifications": "Technical leadership experience in Cellular and or Wireless Embedded Software design and development; Product life cycle hands-on experience from concept, design and development through pre-silicon validation, chip bring up, stabilization, power and performance optimization, commercialization; Knowledge of communications systems theory and digital signal processing concepts", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554946"}