{"title": "Security Engineering Manager - Wireless Security", "summary": "Help Apple secure the world’s most advanced consumer devices, which people trust to store their personal and professional data. Security Engineering & Architecture (SEAR) is at the core of Apple’s product security strategy and we’re fanatical about protecting our users. We're looking for a talented manager to join our group of exceptional security engineers, to lead research and analysis identifying attack surface, inventing mitigations and defensive technologies to eliminate entire classes of issues, and building & delivering them to our customers. We design and secure platforms for billions of users. We make products that people LOVE. We are committed to user privacy and security. We have some of the most creative, passionate, hardworking engineers in the industry. We challenge each other to go beyond the norm to find new, innovative ways of solving problems and to make software safer, easier, and more fun to use. Not many jobs can offer all of these things. Security engineering jobs at Apple do, and much more.", "description": "You are joining an exceptional team focusing on securing all aspects of Apple’s platforms. Our team is responsible for securing the cellular, Wi-Fi, and Bluetooth components and interfaces used across Apple’s product line. You will be working alongside a wide variety of teams and vendors and your influence will be felt throughout Apple's extraordinary products, such as iPhone, Mac, and Apple Vision Pro. In addition, your team will be responsible for identifying threats in advance and responding to critical issues as they arise. The team’s work is as diverse as it is essential, from reverse engineering an exploit, providing insightful analysis and creating innovative tools, consulting with other teams on both hardware and software, to auditing code and reviewing designs. You’ll have the opportunity to drive inventing, building and shipping groundbreaking defensive technologies to billions of people.", "key_qualifications": "Experience leading a security engineering team\nStrong knowledge of wireless communication protocols\nUnderstanding of modern security mitigation technologies\nProven track record of successful and timely delivery of security technologies\nHistory of setting bold yet attainable goals, and motivating teams to achieve them\nPassion to dig in and lead the development of ground-breaking embedded products", "preferred_qualifications": "Ability to find security vulnerabilities through static and dynamic analysis\nExperience with software exploitation", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554414"}