{"title": "Systems Performance Architect", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Are you up for the challenge? The Mac System Performance and Architecture team leads all aspects of Mac performance spanning hardware (CPU, GPU, DRAM, storage), software (OS, drivers, applications), and other system characteristics (thermals, power, acoustics). This spans performance modeling, guiding architecture tradeoffs, performance verification, performance debug, and workload characterization. Come join us!", "description": "The Systems Performance Architect will own a few of the key responsibilities like Guiding architecture tradeoff decisions at an executive level. Defining and guiding new modeling approaches and features to improve influence in performance related decisions. Interacting with various cross-cross-functional teams to understand, model, and guide developments. Distilling key system interactions and abstracting them into high level performance models. Guiding modeling validation and accuracy to continually improve current methods and approaches. Generating performance projections for future systems. Assisting with complex performance debugging activities.", "key_qualifications": "Strong knowledge and experience in computer architecture, the broader the better. Experience in system performance modeling is desired. Prior experience in analyzing software/OS behavior, power, thermal, and acoustics aspects of performance is a plus! Good coding skills in some subset of (C, C++, System C, Python, shell, etc.). Strong communication and mentoring skills", "preferred_qualifications": "", "education_experience": "MS/Ph.D. in Computer Science, Electrical Engineering or relevant field is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551289"}