{"title": "Cellular Firmware Verification and Release Manager", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will be inspired! And you’ll be proud! At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. As a FW Verification and Release Manager, the role will work with Firmware development, System engineering, Hardware and Software teams to develop and manage comprehensive FW verification plan. This includes building verification engineering team, maintaining automation pipeline, CI infrastructure and verification toolchain.", "description": "As Manager for Cellular Firmware Verification, you will be responsible for leading a team that is accountable for firmware verification, ensuring FW release quality for 4G/5G cellular firmware. You will be in a critical function that requires continuous alignment with cross functional teams and determine the verification scope, incremental test strategy and release cadence. The team will be responsible for ensuring test readiness by delivering test plan, test methodology, test equipment planning and automation. You will also be responsible for high velocity FW releases with clear process for managing multiple FW trains and regression testing. The team has responsibilities spanning all aspects of FW verification from initial product concept, feature definition through implementation and in to high volume production. The team is also responsible for pre silicon verification including verifying on VP and FGAS for new products. The Firmware verification team must collaborate on a daily basis with both Hardware and Software teams. The manager must lead verification methodology discussions and decisions cross-functionally, always striving to ensure an unparalleled FW quality.", "key_qualifications": "Minimum 15 years of 4G/5G cellular industry experience (Master's preferred). 5+ years of direct people management experience, in particular building strong cellular verification teams. Demonstrated leadership in commercialization of multiple generation of cellular modems with responsibility in FW functional area. Deep understanding of Cellular FW verification process, dependencies to system level testing, IODT, IOT and FT campaigns. Leadership in ramping pre-silicon platforms and preparing for comprehensive modem silicon bring-up. Understanding of 3GPP standard, various conformance and operator requirement. Proven track record of large scale FW/SW delivery for complex projects. Hands-on experience in planning detailed project execution, establishing project milestones, resource planning etc. Proficiency in overall FW verification, continuous integration/delivery systems. Experience with automation of test on virtual platforms and hardware devices.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540425"}