{"title": "Lead Software Engineer, Apple Data Platform (ASE)", "summary": "The Apple Data Platform(ADP) group builds the data platform that enables the next generation of intelligent experiences on all Apple products & services. ADP makes it possible for Apple engineers to innovate ML-driven product features rapidly and at scale. The team enables future Apple intelligent products by making cutting-edge ML technologies, large-scale compute and data systems designed specifically for ML available to engineers within Apple. Are you a passionate about building scalable, reliable, maintainable infrastructure and solving data problems at scale? Come join us and be part of the Data Infrastructure journey.", "description": "The role involves designing and implementing distributed systems to build world-class ML platforms/products at scale and across different cloud environments that power ML at Apple. In this role, you will partner with data scientists and machine learning engineers across different Apple organizations to deliver high-impact product features quality. You will be responsible for system that hosts hundreds of petabytes of structured and unstructured multi-modal data which is used for Machine Learning and Foundational Models. You will be responsible for ensuring complete data lineage and legal workflow integration while optimizing performance and scalability. You will also be responsible for monitoring the performance of the system, optimizing it for cost and efficiency, and solving any issues that arise. This is an exciting opportunity to work on cutting-edge technology and collaborate with cross-functional teams to deliver high-quality software solutions. The ideal candidate should have a strong background in software development, experience with public cloud platforms, and familiarity with distributed databases.", "key_qualifications": "N/A", "preferred_qualifications": "Expertise in Open Table Format (Iceberg) is preffered, Experience or knowledge in public cloud is a big plus, preferably AWS. Familiarity with distributed databases, such as DynamoDB, MongoDB, or Cassandra. Experience with containerization and orchestration technologies, such as Docker and Kubernetes. Strong collaboration and communication (verbal and written) skills. Understanding of the ML lifecycle and state of the art ML Infrastructure technologies.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555226"}