{"title": "ML Data Program Manager", "summary": "Do you believe Machine Learning and AI can change the world? We do too! Join our Data Team in the System Intelligence and Machine Learning (SIML) group, within Apple’s Software Engineering organization. We build high-quality ML datasets at scale to train models powering AI features across Apple products, including iPhone, iPad, Mac, Apple Watch, and AirPods. Our work is behind essential features such as Camera, Text and Handwriting recognition, and Apple Intelligence experiences (Image Playground, Writing Tools, Smart Script, Math Notes…). As SIML is expanding its global presence outside of Silicon Valley, we are looking for a talented individual to drive Data Programs supporting ML models and features developed by R&D teams located in Europe. As our first Data Program Manager in Zurich, you will drive such Data Programs and run the corresponding data projects end-to-end (collection & annotation). AI-centric products are the future of software. At their core, data is the source code of AI, a key component of innovation and inclusive and fair ML products. We invite you to join us at this exciting time! Grow fast and positively impact multiple critical features on your first day at Apple!", "description": "Our SIML Data team focuses on acquiring, synthesizing, annotating, and ensuring the quality of ML data, driving numerous features in collaboration with R&D teams in Apple’s Software organization. As a Data Program Manager, you will oversee the end-to-end process to support machine learning data needs of R&D partners located in Europe, from conceptualization to completion. You will ensure that the data delivered to R&D meets Apple's rigorous quality standards. Responsibilities: Drive Data OPs plan in Europe to support client organizations, targeting excellence of data operations in a context of growing and evolving data needs (types of assets, nature of labels, skillset required) For each ML feature supported, collaborate with R&D partners to understand and define their data requirements from inception to delivery Design and implement ML Data Ops strategies optimized for each feature (collection and annotation), including the identification and sourcing or creation of necessary tooling, equipment or crowd Drive enhancements of data operations (increase scalability, diversity and quality, reduce cost and lead time), through innovative workflows that combine human and machine computation (leveraging capabilities of ML and foundation models) Work closely with privacy, legal, procurement, and product security teams to identify and clear options considered for data operations Thoroughly scope projects, estimating timelines, cost, and identifying potential challenges in advance Coordinate data program across internal data functions (data engineering, data science, QA) and other partners Establish clear guidelines and training material Collaborate with vendors to ensure tasks are calibrated appropriately; track and report on quantity and quality metrics As R&D presence in Europe grows, the position could evolve into a leadership or management role, in the future.", "key_qualifications": "", "preferred_qualifications": "Scripting skills (Python) to automate tasks, compute metrics and explore use of workflows combining ML and human inputs Demonstrated capacity to mentor and grow people A talent for creating ML datasets focusing on end-to-end user experience by foreseeing issues, handling edge cases, and removing bias while ensuring inclusion and fairness Proficient in problem-solving and critical thinking, with a focus on innovation and continuous improvement Self-starter, able to handle ambiguity, identify risks, troubleshoot, and find the right people and tools to get the job done Capacity to multitask and manage multiple projects in parallel while meeting deadlines, and maintaining clear and effective communication with stakeholders Familiarity with state-of-the-art ML techniques, including generative technologies (transformer architecture, CLIP and other visual and text embedding models, diffusion models)", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555732"}