{"title": "Software & AIML Products Counsel – AI Products and Policy", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your legal expertise to cutting-edge and often unexplored aspects of the law. We have a great opportunity for a passionate and practical product attorney to join our Software & AIML Products Legal group. This is a chance to be part of a hands-on team, dedicated to supporting Apple’s Artificial Intelligence and Machine Learning initiatives and related products.", "description": "Do you enjoy helping others find solutions to big challenges? Does new technology, and the legal issues it can present, excite you? Do you like building strong client relationships and working on teams? In this role you will be responsible for supporting and advising Apple’s engineering, product marketing, and government affairs teams on a wide variety of matters related to AIML products and policy, including research and publications, feature development, intellectual property, technology and content licensing, and regulatory proposals and compliance. You will also be responsible for staying current on the rapidly evolving legal landscape impacting AI, and the complex intellectual property, privacy, and ethical issues associated with its development. We are looking for someone like you to help uphold Apple’s high ethical and corporate standards, defend our intellectual property and provide the critical legal support needed for Apple’s software products and businesses. You’ll work with some incredible people and have fun along the way. Bring passion and dedication to your job and there's no telling what you could accomplish.", "key_qualifications": "4+ years of legal experience at a technology company, a leading law firm, or a government agency\nExperience advising on issues related to intellectual property, consumer protection, trust and safety, content moderation, or data privacy and security. Direct experience advising on AI and machine learning a significant plus\nExperience analyzing and developing global compliance strategies for new regulations\nExperience structuring, negotiating, and/or analyzing agreements for a wide variety of technology transactions\nExcellent communicator who is able to issue-spot and articulate complex and nuanced legal issues clearly and concisely to frontline business and engineering teams and senior executives alike\nCreative problem-solver who can drive projects and analyze and help resolve complex issues in innovative and practical ways\nBest suited for a high energy, assertive, self-starter who loves technology and thrives in a fast-paced, collaborative environment\nIn-house experience preferred", "preferred_qualifications": "", "education_experience": "JD or equivalent and admission to at least one US state bar.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $193,000 and $290,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551239"}