{"title": "Compliance Specialist- Privacy Audit and Compliance Team - Privacy Management Office (PMO)", "summary": "Do you love taking on big challenges without precedent? Do you possess a knowledge of privacy and a passion for innovation? As a part of our Legal group, you’ll play an important part in helping to uphold Apple’s high ethical and corporate standards.", "description": "We here at Apple are about creating great products. Part of making products great is designing products that respect consumer security and privacy. This role offers the opportunity to work directly with key members of the business, engineering and legal teams on a variety of cutting edge projects including: supporting compliance and auditing frameworks in relation to the GDPR and other regulatory requirements, and building out the Privacy Compliance Framework to track and monitor privacy compliance posture throughout Apple. -Sample and test controls to ensure effectiveness -Identify and remediate control gaps and deficiencies -Partner with external teams to gain acceptance of compliance projects. -Foster a strong security and compliance culture throughout the team.", "key_qualifications": " ", "preferred_qualifications": "Proven audit and compliance experience within a financial or technical environment. Experience with compliance controls and regulatory frameworks Able to clearly organize and inform through excellent written and verbal communications Ability to lead, take action and provide goal oriented direction in the face of ambiguity Strong analytical capability and problem solving skills with attention to detail Able to multi-task across diverse business units and geographical boundaries Comfortable expressing a point of view and influencing change Work both independently and collaboratively with numerous people at all levels throughout the company", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557310"}