{"title": "Business Development Manager, Content & Services - Korea", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a role with Apple's Service BD team is for you! We are seeking an experienced, individual with a passion for media and entertainment to help massively grow its distribution of Apple Services (Apple Music, TV+, Arcade, Apple One, iCloud, etc.) into the Carrier, retail, travel and financial services channels. You will work closely with cross-functional teams throughout Apple to solve problems and implement programs that achieve core performance objectives. You will be supporting the BD team’s growth efforts with a focus on developing new partnership opportunities, negotiating deal frameworks, and managing the ongoing relationships with Apple’s biggest carrier partners. In this role, you will lead, help coordinate, and prioritize multiple concurrent projects at once. The role requires a highly motivated and experienced person with phenomenal attention to detail. If you pride yourself on being collaborative, and bringing passion and dedication to your job, there is no telling what you could accomplish here. We invite you to Join us and help us leave the world better than we found it!", "description": "-  Seek and identify opportunities to grow Apple Services subscriptions through partnerships in various verticals not limited to retail, telco, financial as examples.\n-  Build cases and models that meet services, hardware and 3rd party goals\n-  Collaborate cross functionally to secure the support of Marketing, Finance, Operations, and other partners.\n-  Identify and prioritise partners; Engage with senior partner management\n-  Take advantage of the greenfield opportunity to conceptualize new initiatives that drive the exponential growth of any or all Apple services.", "key_qualifications": "", "preferred_qualifications": "Understanding of Apple’s subscription services\nUnderstanding of the disruptive changes digital content is undergoing and passion to make an impact in growing and developing Apple’s service business\nWillingness to travel\nDemonstrate a huge passion and energy for your work, that will enable you to help drive amazing partnerships and relationships\nExcellent presentation, written and verbal communication skills\nBA/BS degree in Business or related subject, MBA or equivalent degree preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555706"}