{"title": "Sr. Software Engineer - Performance Tools (ASE)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Our team is looking for a creative and driven Senior Software Engineer to design and develop tools and automation frameworks to enhance the overall performance of products in Apple Services. If you are someone who thrives on solving exciting problems across a wide variety of environments, all to provide continuous improvements of our Apple Services, please read on!", "description": "As a performance tools engineer, with full-stack development experience, you will be working with a broad set of front and back end technologies to help develop tools for Performance benchmarking and analysis of products in Apple Services like App Store, Apple Music, Apple TV+, Podcasts and others. You will partner with a diverse set of peers to design, implement and iteratively improve tools that will be used by developers across the organization to diagnose and improve products and services that touch hundreds of millions of users. We need a highly motivated and resourceful engineer that can balance pragmatism and purism, and easily move between big picture and details. To be successful you are self-motivated, flexible in your approach, and exude tight-knit collaboration skills, including the ability to mentor and be mentored. Creativity, innovation and a persistent drive for result will be required to design user experiences for tools that have no parallel. If you want to join this amazing team, this position is for you. Here you’ll find that we:\n• Have a peaceful work environment where you can choose when to socialize and when to focus.\n• Provide technical guidance and mentorship as needed\n• Have an encouraging and growth-focused workplace culture.\n• Encourage you to use accrued vacation time and maintain a healthy work-life balance.\n• Offer excellent benefits!", "key_qualifications": "Solid foundation in Computer Science including statistics and algorithms\nHands-on full-stack software development experience\nExpertise in building automation frameworks, services, developing REST APIs\nCollecting high-level requirements and translating it into product definitions\nAdept in coding using Java/Scala or any other high-level programming language\nUnderstanding of key cloud technologies and infrastructure like Docker, S3 and other cloud based functions\nPassionate about product quality and attention to detail regardless of complexity of solution\nDemonstrates a growth mindset and enjoys learning new skills and technologies\nEffective in consensus-building among multi-functional teams", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or equivalent", "additional_requirements": "These skills are nice to have, but NOT required:\n• Experience in developing Gatling simulations\n• Knowledge of Akka or Pekko framework\n• Splunk\n• Kubernetes", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525836"}