{"title": "Web Application Development Manager", "summary": "APO BPR RAD_DS team is seeking an experienced and creative application solution architect/manager to design and deliver world class applications for APO. The ideal candidate will combine exceptional managerial expertise with solid hands on technical capabilities. You will collaborate with business and technical teams to propose and deliver solutions.", "description": "-  Design and develop complex business critical systems, dashboards, and reporting.\n-  Conduct design and code review.\n-  Database performance tuning and infrastructure review and design.\n-  Work closely with project manager and business analysts to review project requirements, deliverables, acceptance criteria, and desired end result.\n-  Manage development and decision support team.\n-  Review and prioritize development resources to align with leadership priorities.\n-  Mentor team members to drive application quality.\n-  Present to leadership team.", "key_qualifications": "-  15+ years hands on experience in web application development, big data processing, infrastructure architecture design, and Cloud Migration/Implementation, LAMP stack preferred.\n-  7+ experience in leading development team with addressing conflicts/escalations, prioritizing resources to meet strategic goals, mentoring employees, conduct performance review, and recruiting/retaining talent. \n-  Consistent track record leading and delivering complex and scalable solutions to achieve business goals.\n-  Creative thinker and strong problem solver with meticulous attention to detail.\n-  Ability to create and execute plans in ambiguous settings.\n-  Ability to work in dynamic environment with shifting priorities and schedules.\n-  Ability to collaborate with Project Management and Business Analyst team.\n-  Good analytics skills and with curiosity to learn business processes and pain points.\n-  Good work ethics and passion to go beyond what is expected.\n-  Good verbal and written communication skills.\n-  Understanding of manufacturing, planning or logistics business processes preferred.", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or equivalent.", "additional_requirements": "We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547248"}