{"title": "Linux Systems Engineer", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it! A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! As a Systems Engineer with the Fleet Operations Engineering team, you will collaborate with team members and customers to build relationships that will be instrumental in your daily work. You will be responsible for using independent judgment and discretion to interact with internal and external teams through email, chat, and conference calls. Within a highly challenging team environment, you will investigate, identify, and build solutions. As a Systems Engineer, you will make recommendations for new processes that enhance customer experience by improving operational efficiency, and workflows, and driving automation and process improvements. As a member of Apple’s Fleet Operations Engineering team, you will be responsible for supporting Apple’s large-scale compute infrastructure, maximising uptime for services such as Pay, iCloud, Music, TV, Maps, News, FaceTime, Siri, and more.", "description": "Our Operations Center serves as the central point for monitoring, event management, and coordinating resolution efforts for our Fleet Operations Engineering teams. Within this role, you will work closely with teams to investigate, identify, and implement solutions in a team-oriented and highly challenging environment. We are seeking a highly motivated and collaborative Systems Engineer to support Apple's large-scale infrastructure. This individual will be detail-oriented, obsessing over minute aspects to drive operational excellence and deliver the best customer experience possible. Beyond the required technical skills, strong interpersonal abilities and an enjoyment of the dynamic nature of Apple's environment are essential.", "key_qualifications": "3 - 5 years of proven experience with building, automating, analysing, and solving critical large-scale Linux servers hosted in virtual and physical environments. Extensive Linux experience, especially with Oracle Linux, RHEL, CentOS, etc. Experience in GitHub, KVM, Docker, Kubernetes, and configuration management systems. Good understanding of administrating Linux Systems security and encryption. Experience in one of the following languages is required: Python or Go. Experience with bare-metal servers and an understanding of how the hardware of the Linux operating system works. Strong debugging abilities at all levels, from application to network to host. A firm understanding of networking concepts and protocols at all layers is essential. A deep understanding of Information Security, Regulatory Compliance, IPTables, and SELinux is crucial. The ability to conduct root cause analysis of critical issues is vital. Skills to identify and quickly resolve/mitigate issues are vital. Always iterating and seeking new ways to automate repetitive tasks. Excellent verbal and written communication skills. Flexibility to work in shifts is required. BE / B.Tech in IT or Computer Science is preferred", "preferred_qualifications": "Automation and configuration management skills using Puppet or Ansible are preferred. Familiarity with kernel debugging is a plus. Self-starter, motivated to learn in a dynamic environment, and comfortable in a team. Strong sense of ownership and urgency", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556871"}