{"title": "Marketing Manager - Southeast Asia, Apple Music & Apple TV+ (12 months contract)", "summary": "Apple is looking for a marketeer to lead marketing services in Southeast Asia, including Apple Music and Apple TV+.", "description": "Ideally you are someone with deep understanding of entertainment services marketing, digital marketing channels, and subscription marketing. This role is responsible for leading all aspects of Apple Music and Apple TV+ marketing, working closely with the international marketing teams and the local business teams. This is a role for you if you also possess the communication and interpersonal skills to work across a sophisticated matrix organisation, and be able to build positive relationships with key individuals to help deliver extraordinary marketing programs and partnerships. We’re looking for someone that would describe themselves as a marketing and digital enthusiast, that loves keeping up with trends, and how technology shapes our future. Most of all, this position is for an individual that is passionate about the role music and video play in people’s lives.", "key_qualifications": "", "preferred_qualifications": "Relevant marketing experience in a digital, subscription, or media business. Deep knowledge of marketing opportunities across the region and which channels work the best based on different objectives. Look at marketing from a broad ecosystem perspective that benefits multiple aspects of the business, instead of looking at it in a silo affecting a single business vertical. A dedication to handle timelines and work effectively with cross-functional teams on the basis of daily and weekly deadlines. Proven experience in implementing innovative and measured marketing programs that generate results and promote the brand. A strong project management background, which is key to handling varying levels of complexity and timelines running concurrently over extended periods of time. Natural collaborator, including perspectives of others in pursuit of the best approach to an idea. Skilled and obsessively analytical in measuring efficiency of marketing programs. Excellent written and verbal communication skills. Proficient in digital marketing, understand the role digital and social platforms play in the lives of consumers today and know how to harness their power to generate awareness and tell a story around a product or service. Experience in and enjoy working with others — either with external partners or with internal teams that help bring a project to life. Resourceful, high-energy, proactive, creative, inventive and team-player.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555494"}