{"title": "Product Quality Manager - Product Operations", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple seeks an individual with the skills to own and manage the superior iPhone quality in the market. You will have overall responsibility for developing and implementing the quality systems for the iPhone product. This role works closely with Apple cross-functional teams and contract manufacturers and will own and manage manufacturing quality. Strong interpersonal, communication, organizational and leadership skills are essential to succeed in this role.", "description": "Lead all in region quality related issues for iPhones made by Apple’s manufacturing partners. This person will need to develop a close working relationship with our manufacturing partners. Provide leadership and guidance to the manufacturing partners to ensure that Apple iPhones are manufactured in accordance with apple specifications and meet apple quality standards. Use production, reliability and field data to monitor, control and improve product quality to increase yield and reduce the field return rate. Help develop and execute product quality plans and systems, and manage quality bring up activities for new products at the manufacturing partners. Manage the product quality at the sites, working with onsite engineering and production teams. Perform audits to ensure compliance to Apple specification, quality standards and SOPs. Work closely with manufacturing partners both in region and in other regions to understand quality related factory issues and issues related to material. Aggregate and interpret data from multiple sources to drive decisions. Identification and prioritization of issues and improvement activities. Implement systems and processes to quickly identify root cause, containment and corrective actions.  Ensure lessons learned from prior projects are used to improve the quality management process, and leads to improved product quality and reliability for next generation products. Work with commodity managers and supplier quality engineers to ensure component quality and reliability. Communicate quality updates to executives and the larger cross-functional teams. This position can require frequent travel, up to 30%", "key_qualifications": "10 years technical experience (quality and/or engineering) supporting high volume consumer electronics, preferably in handheld phones. Experience in product quality management and systems/or operations. Good understanding of electronic assembly processes and testing methodologies. Solid experience and understanding of test and assembly fixtures, manufacturing equipment and processes is required (includes manual, semi-automatic and automatic fixtures/equipment). Working knowledge of statistics, and in depth knowledge of quality methodologies such as design of experiments, statistical process control, sampling strategies, FMEA, GR&R. Experience in failure analysis. Knowledgeable in data analysis and interpretation. Strong social and communication skills, with ability to understand and concisely communicate issues, are required. Ability to work and multi-task in a fast-paced, technically dynamic environment. High energy and highly motivated, with the zeal to drive closure of issues across cultures. Specific knowledge of key technologies used in mobile handheld products. Experience with cosmetic quality management, where cosmetic quality is as critical as functionality. Experience or knowledge with reliability engineering and supplier quality engineering. Written and verbal fluency in English required.", "preferred_qualifications": "", "education_experience": "BS Engineering (EE, ME, IE), MS preferred\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.\n\nApple benefits programmes vary by country and are subject to eligibility requirements.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505523"}