{"title": "Legal Counsel - Wallets, Payments and Commerce", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your legal expertise to cutting-edge and often unexplored aspects of the law. Apple is looking for an expert payments attorney to join Apple’s Legal Department in London to support the Apple Pay and Wallet team across Europe and the Emerging Markets region, with a primary focus on regulatory and product counseling, but also on other commercial, consumer, and legal matters impacting Wallet, Payments, and Commerce.", "description": "Do you enjoy fast-paced transactional work and helping others find solutions to big challenges? Does new technology, and the legal issues it can present, excite you? Do you like building strong client relationships and working with teams? Your key responsibilities will be advising the Wallet, Payments, and Commerce team on a wide range of issues related to offering and using consumer financial products and services through mobile wallets. You will need to have demonstrable working experience of UK and European directives, laws, and regulations related to credit, debit cards, prepaid cards, and mobile wallets, as well as counseling clients on day-to-day legal matters in a technology environment, including data privacy aspects. YOU WILL BE EXPECTED TO: serve as a product counsel and shape responses to legal and regulatory requirements applicable to consumer financial services and products, advise on the legal aspects of Apple’s relationships with third parties in the payments industry, advise on the contract structure and commercial terms for Apple’s partners and customers, understand and translate laws and regulations that apply to services provided by Apple and its partners, and advise on the expansion of certain Apple services across Europe and the Emerging Markets. You will be part of a close-knit local team and a global team spanning across the US, Europe, Asia and around the world. This role is based in London, UK.", "key_qualifications": "", "preferred_qualifications": "Experience working in an international team a plus; Excellent client development and interpersonal skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555400"}