{"title": "R&D Engineer (EE) - Display Development Team", "summary": "At Apple, we develop revolutionary technologies for products that will define how we interact with technology and communicate in the future. To help us with this, we are looking for very skilled people that want to do the best work of their lives in an environment of excellence, creativity, innovation and partnership. If that sounds intriguing to you, then let's talk. The Display Hardware Incubation team is a small, agile and multi-disciplinary team forming part of the wider Apple Hardware Technology organization. We are pursuing ground-breaking hardware development to enable future products and features that enrich the lives of our customers. We are looking for an exceptional multi-disciplined engineer with an electronics design focus, while having great practical and modeling skills. You will work on hardware development projects to help us explore and productize new technologies, at the intersection of R&D and product development. Experience of driving and sensing miniature actuation systems.", "description": "A successful candidate will have a creative and intuitive approach to engineering design that enables evaluation and development of a wide range of technologies, with an ability and desire to develop a deep understanding of physical principles while considering a practical system implementation. Experience in end-to-end development of a technology is desirable including Electronic and Mechanical CAD, prototyping, fabrication, assembly, firmware and software. Familiarity with actuator technologies (such as SMA, voice coil, piezo-electric) and their application in closed-loop systems is highly valued. There is a strong practical focus in our hardware incubation team, so hands-on experience and a willingness to prototype new ideas is essential. A self-starting attitude and ability to work independently, but also as part of a team, is essential.", "key_qualifications": " ", "preferred_qualifications": "Experience of designing and simulating sensors\nExperience of taking products from early design to mass manufacture highly desirable\nWillingness to pick up novel tasks and acquire novel skills\nA scientific mindset and approach to problem solving\nExcellent communication and teamwork skills\nAn innovative mindset is essential\nDegree in Electronic Engineering, Physics or another related engineering program. Higher degree or Masters preferred.\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559767"}