{"title": "Digital Telco Channel Specialist, UKI", "summary": "The people here at Apple don’t just create products—they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn enriches the lives of hundreds of millions of people around the world. Our sales team is, in many ways, the face of Apple to our customers. In this role you will be responsible for driving eCommerce sales with UKI carriers. You will be responsible for delivery of Apple's digital customer experience (CX) programs and digital sales growth programs with UKI carriers and be a key contributor to Apple's regional digital strategy. You build relationships, develop partner capabilities, and ensure flawless execution across the programs. You collaborate closely with Worldwide (WW) and EMEA digital channel teams, UKI Telco sales teams, cross-functional teams and external partners to maximise and grow Apple's eCommerce business with UKI carriers.", "description": "Have a deep understanding of the UKI channel and eCommerce landscape and the needs of carriers and our end customers. Study market trends, carrier capabilities, performance metrics and results to identify areas for optimisation and new online growth opportunities Collaborate with WW and EMEA Digital Channel teams to develop and execute the digital strategy for the UKI Analyse business opportunities to develop and drive regional and partner specific digital sales strategies, plans and roadmaps Support the tactical and strategic management of key UKI carrier accounts, which includes but is not limited to developing digital account plans, driving digital sales programs and sell-in to partners, program and offers negotiation, demand generation, operational optimisation, premium digital CX Develop regional digital reporting, reviews and planning, analysing data insights, digital KPIs, digital CX monitoring results to determine appropriate forward actions Responsible for ensuring Digital carriers data and analytics drive insights that enable key CX and Sales decisions across product categories and UKI carriers Work on special projects related to strategy development for digital channels", "key_qualifications": "", "preferred_qualifications": "In depth experience in digital and/or eCommerce with a mobile carrier - preferably in the UKI Ability to communicate in a clear and effective manner to carrier leadership teams to influence the overall digital strategy and program development Ability to inspire, influence and collaborate across many functions and levels of the organisation Proven experience succeeding in complex, matrix and cross-functional digital projects Solid understanding and experience implementing digital customer experience (CX) programs and digital sales growth programs with a mobile carriers Experience setting, managing and reporting against multi-year plans, budgets, KPIs, milestones, roadmaps, etc. Deeply data driven with proven analytical and numerical prowess; versed in site analytics and proficient in analysing data for decision making Demonstrated organisational skills, ability to prioritise tasks and manage time efficiently while maintaining attention to detail Excellent written, presentation and oral communication skills Action-oriented and enjoy working in a fast paced, dynamic environment", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534424"}