{"title": "Computer Vision Software Engineer - 3D Vision", "summary": "The Video Computer Vision team is working on exciting technologies for future Apple products. We're looking for a computer vision software engineer to join the team that ships gaze tracking feature for Vision Pro. The gaze team is continuing to work on Apple’s next generation products. Our work involves full-stack of Apple products including hardware definition, algorithm development in both 3D computer vision and deep learning methods, and on-device performance optimization. We are looking for an exceptional software engineer with broad skills to join us to take part in our high-impact projects.", "description": "Apple's Video Computer Vision team is looking for a computer vision software engineer that can work on several different aspects of computer vision applications. Including: • Design and prototype computer vision algorithms. • Perform pipeline optimization for real-time on-device applications. The team works on complex problems in computer vision that require robust, efficient, well tested, and clean solutions. The ideal candidate will possess the self-motivation, curiosity, and initiative to achieve those goals. Analogously, the candidate is a lifelong learner who passionately seeks to improve themselves and the quality of their work. You will work together with similar minds in a unique development team where your skills and expertise can be used to influence future user experiences and hardware that will be used by millions.", "key_qualifications": "Highly skilled in C++ and solid experience in scripting languages such as Python Knowledge and experience in working with 3D computer vision pipelines Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, and testing Proactive, analytical thinking, excellent problem solving and communication skills A bachelors degree and 3 years of relevant industry experience", "preferred_qualifications": "Desirable computer vision software development area in: camera calibration, multi-view geometry, graphics, numerical optimization, or robotics", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556115"}