{"title": "Control Systems and Sensing Integration Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "In this role you will partner with controls systems developers, motor, actuation, sensor and power electronics engineers to develop and manufacture systems, test stations and evaluation benches for pre-production hardware. You will work on the cutting edge of Apple’s latest motion system endeavors and build high visibility prototypes that lead to production systems!", "key_qualifications": "-  Strong fundamentals actuation, control systems design, and motor control.\n-  Skilled in rapid integration, prototyping, calibration and testing of actuated and sensor systems.\n-  Experience with embedded systems development, analysis and bringup.\n-  Expert in Matlab and Simulink with direct experience with deployment on real time target systems such as dSPACE, Speedgoat, or National Instruments HW systems.\n-  Experienced with serial communication protocols such as Ethernet, CAN, LIN, UART, SPI, I2C, BISS, etc…\n-  Experienced in test and debug of physical systems (sensors, actuators, algorithms)\n-  Strong in data analytics, root cause analysis with emphasis on data introspection\n-  Experienced with hardware in the loop (HIL) automation\n-  Experience with C/C++ development\n-  Confident with source control (eg. GIT) on multi developer projects\n-  Proficient at English(Listen, Oral, Written, Read)", "preferred_qualifications": "", "education_experience": "- BS or MS in Engineering or CS + minimum of 10 years of industry experience", "additional_requirements": "-  Experience in state estimation deployed on real time hardware\n-  Experience in sensor calibration for IMUs, Encoder, Optical Sensors\n-  Experience on control system design, modeling and implementation-moto", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548706"}