{"title": "Apple Cash Product Manager", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job! Apple Cash is built right into iPhone, making it an easy way to send and receive money.", "description": "Help envision and build new product features and strategies; define detailed use cases for engineering and design Evangelize and build consensus with executives, colleagues, and third parties Collaborate with Human Interface, Engineering, other Product Managers, Legal, Business Development, Marketing, Analytics and Operations to launch products Drive efforts with strategic partners on product development Represent business interests during design and development phases Work with program management to communicate project status, resolve issues, and ensure that high quality products are delivered on time Develop launch plans, ensure readiness of the various partners", "key_qualifications": "", "preferred_qualifications": "Proven Product Management success in financial services / financial technology Familiarity with financial technical infrastructure (e.g. processors and card networks) Technical approach when problem-solving with engineers Effective communicator who can synthesize complex topics, distill key business dynamics, and communicate effectively with senior executives Ability to lead and influence different cross-functional teams and external partnerships to drive decisions and outcomes Proficient problem solver and analytical abilities that can help structure ambiguous problems/situations as well as drive and perform complex analyses MS Degree in CS/EE and/or an MBA preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558920"}