{"title": "SAP LE / MM Functional analyst", "summary": "The people here at Apple don't just craft products - they build the kind of wonder that's revolutionised entire industries! It's the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s IS&T manages key business and technical infrastructure at Apple -- how online orders are placed, the customer experience with technology in our retail stores, how much network capacity we need around the world and much more. The SAP Global Systems team within IS&T runs the Operations and Financial transactional platform that powers all of Apple functions like Sales, Manufacturing, Distribution and Financials. We are looking for a SAP Logistics execution/Material Management functional analyst to participate in and drive initiatives supporting Logistics Execution and Supply Chain business areas. You should have in-depth knowledge of SAP LE / MM module encompassing Shipping, integration with MM/SD, EDI integration, awareness of end-to-end Logistics and Supply Chain execution processes and need to be familiar with customisation enhancements in LE / MM area. As the SAP functional analyst, you will work closely with our business teams to understand their specific needs, map these to standard SAP capabilities and then design and implement scalable and performing solutions.", "description": "As a SAP LE / MM Functional analyst, you will: -  Support business teams with requirements gathering, design, configure and deploy solutions. -  Engage in design presentation sessions with multi-functional IS&T and business audience  -  Participate in project execution following Apple SAP’s project life cycle methodology including design, test and launch activities -  Prioritise own work and as appropriate lead project tracks -  Propose conceptual and detailed designs to support the business needs, produce functional and technical specifications.", "key_qualifications": "Minimum 5 years’ experience with SAP LE / MM space; Consistent track record in designing and deploying solutions in SAP Logistics Execution / MM space; SAP certified in Innovative logistics processes in S/4 HANA Enterprise management is preferred; At least 1 full cycle project experience implementing SAP S4 HANA projects preferred; Good communication skills, pro-active in approach and ability to learn new technologies", "preferred_qualifications": "", "education_experience": "Masters or Bachelors in Computer Science, Management Information Systems or equivalent experience", "additional_requirements": "- Able to build and review detailed functional & technical documents for new or existing improvements for various types of SAP ECC system components; - Understanding of integration with the supply chain partners, work with technical team on defining and improving interfaces of various types.(IDOC, EDI, XML, RFC).", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534106"}