{"title": "Manager, Machine Learning– Advanced Analytics Team, Worldwide Business Process Re-Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just craft products - we build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!  Apple is looking for a dynamic, highly motivated experienced Machine Learning Manager for the Advanced Analytics team to join the WW Business Process Re-Engineering Org within World-wide Sales and Operations Support.", "description": "At Apple, the increasing supply chain complexity and scale presents unique challenges to traditional analytics techniques. You will be leading a team of experts responsible for designing and developing advanced data science solutions from strategic to executional decision-making. Key responsibilities include:•Lead and grow a team of highly skilled data scientists providing guidance, mentorship and support. Ability to recognize, attract and develop talent. Expert ability to dive deep with the team to solve complex challenges.•Architect and collaborate with data engineers on data strategy and infrastructure partners to implement robust, scalable solutions and operationalize models for seamless integration into processes and applications. Guide partner teams to enable data science infra from experimentation to deployment.•Communicate results of analyses and models to partners and senior leaders. Influence decision making with exec leadership.•Innovate and foster an environment of learning and development. Ability to instill focus on simplicity while handling complex challenges.•Engage with global business leaders to identify high ROI opportunities, understand requirements, translate those requirements into technical solutions and drive critical projects.•Own and drive key cross functional initiatives across Apple’s Operations teams.", "key_qualifications": "Experience leading high performing teams and engaging with senior stakeholders. Experience understanding key performance levers and metrics to highlight operational issues and drive improvement. Proven history of guiding the team in designing, developing and deploying analytical solutions at scale. Practical experience solving real world problems and understanding of predictive modeling and algorithms (eg: anomaly detection, NLP, LLM, CVML). Expert practical knowledge of algorithms, strong sense of levers impacting ML accuracy and ability to gain trust with stakeholders and leadership. Proficient in tooling and not afraid to roll up your sleeves to get in the weeds, as needed. Innate curiosity and bias for action with expert ability to identify, define and complete project plans and develop modeling approaches suitable for the problem. Self-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity. Capability to bring global multi-functional team along, Strong critical thinking and problem solving ability. Sound communication skills - adept at messaging domain and technical content, at a level appropriate for the audience. Phenomenal team leader - invested in the collective success of the team and project outcomes.", "preferred_qualifications": "", "education_experience": "• PhD/MS in Computer Science, Statistics, Applied Math or a related field and 12+ years of industry experience. Proven track record of 10+ years managing & developing a team, with emphasis on data science, machine learning and analytics. Experience in the application of data science within an Operational or Supply Chain context is preferred.", "additional_requirements": "To learn more about opportunities at Apple, visit http://www.apple.com/jobs/us/. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530687"}