{"title": "Software Release Program Manager - Apple Maps", "summary": "Can you be the conductor of our orchestra? Do you think clearly, have uncommon sense, innovate down to the very last details, and drive what matters? Join the Maps Client team and you can help deliver surprising and fabulous experiences in Apple Maps to hundreds of millions of customers every day! Apple Maps is seeking a hardworking, organized, and tenacious release manager to help us plan, track, communicate, and handle risk for our native software releases and web deployments. The next generation Maps experience is found on all Apple operating systems (iOS, CarPlay, macOS, tvOS, watchOS, and visionOS) and on the web and spans multiple applications: Maps, Find My, and Messages.", "description": "Release managers are the glue that holds various project teams together with a clear understanding of what each team is delivering in each release, and how these results fit together. In this role, you will contribute to the success of the team and work cross-functionally with other program managers, engineers, designers, and product managers to implement the product roadmap. The ideal candidate wants to be part of solving big problems and cares about getting the little details right. This requires continuous problem solving, rapid learning, and an innovative approach. It also requires attention-to-detail, patience, and self-awareness, as you will work with a variety of engineering teams. This role will include, but is not limited to: -  Prioritizing the release schedule, as well as tracking release progress. -  Analyzing and supervising releases in order to provide timely and actionable information to managers and Maps leadership. -  Coordinating scheduled and emergency deployments with Engineering, QA, and the Build/Release teams. -  Reviewing, updating, and creating release processes", "key_qualifications": " ", "preferred_qualifications": "Ability to filter and distill relevant information for different audiences. Ability to interpret technical requirements into layperson's terms. Experience Identifying risks, developing mitigation strategies, and facilitating conflict resolutions. Understanding and using a bug management systems. Prior experience supporting a full development life cycle for iOS/OS/Web or other Apple ecosystems.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558382"}