{"title": "Software Engineer/ Senior Engineer, Apple Services Engineering", "summary": "Are you ready to be part of a team that turns innovative ideas into extraordinary products and experiences? At Apple, we value passion, dedication, and the opportunity to accomplish great things. Join us in building world-class, scalable systems that power Music, App Store , TV+, Fitness+, Arcade, and more.", "description": "Join our server team that powers an array of Apple's media products, including Apple Music, App Store, iBooks, Podcasts, and Fitness+. In this role, you will collaborate cross-functionally to deliver exciting features to our customers while processing vast quantities of data. We maintain an exceptional standard of web service performance and are looking for like-minded individuals who want to push the limits of server performance and availability. encourage questioning assumptions, value teamwork under tight deadlines, and seek elegant technical solutions to challenges.", "key_qualifications": "Multiple years of experience developing and scaling high-availability, low-latency distributed systems\nAdvanced skill set in object-oriented design, complex data structures, and algorithms.\nExceptional problem-solving, critical thinking, and communication skills.\nExpertise in writing robust unit and integration tests.\nBonus: Familiarity with NoSQL technologies, including but not limited to Solr/Lucene, Redis, Memcached, Cassandra, Voldemort, and MongoDB.\nBonus: Proficiency in JVM languages like Java, Scala, or Clojure.\nBonus: Proficiency in handling vast data sets with Apache Spark and Flink or similar frameworks.", "preferred_qualifications": "", "education_experience": "- Bachelors or Master’s degree in Computer Science/Engineering or equivalent technical discipline. 5 years professional software engineering", "additional_requirements": "• Build and enhance large-scale web-based projects and features, ensuring robust and maintainable solutions that prioritize performance and usability.\n• Effectively demonstrate feature prototypes to executives.\n• Develop and advocate for coding standards and methodologies, fostering consensus.\n• Collaborate effectively with multi-functional teams to understand requirements and engineer highly performant implementations.\n• Experience in crafting web applications that scale to millions of requests per second is highly preferred.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539985"}