{"title": "Tools and Automation Engineer", "summary": "Be part of the Health Study QE team responsible for enabling research into the next generation of Health Sensing features. As part of this team you will be focused on testing application software used to collect a wide range of health and sensor data. This includes working with technologies such as ECG and PPG based Heart-rate sensing as well as novel investigative prototype sensors. Testing is focused on macOS, iOS, and watchOS applications that drive unique UI experiences, collaborate with firmware and low level software drivers, and provide data to processing pipelines. You will be a motivated individual who independently follows up on bugs, collaborates with developers to resolve issues and can understand and discuss technical problems with other Quality engineers, development partners and program managers.", "description": "Develop robust and repeatable automated testing solutions\nUnderstand the context where an application will be deployed, providing insights to potential failures\nAuthor detailed test plans that cover all functionality and edge cases of a system\nExecute manual and automated test plans on a variety of hardware and software configurations\nCraft quality from an early stage by being involved through the entire project lifecycle\nDocumentation of test cases and code used for test execution\nTracking performance, reporting results to management, driving issues to closure\nCollaborating with cross-functional teams, guaranteeing complete test coverage and a flawless end user experience\nBuilding creative new tools, fixtures, and methodologies to stress software features", "key_qualifications": " ", "preferred_qualifications": "Have a passion for quality, enjoy the challenge of breaking things through creative testing\nThrive in uncertain, rapid project schedules, being able to quickly shift priorities and maximize testing time.\nStrive to innovate and try new things, incorporating continuous improvement of testing methods\nUI/UX design or test experience\nTrack record of shipping great consumer products\nContinuous integration and scheduling systems\nPrior experience with Swift programming and developing iOS test automation with Xcode UI automation framework", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558919"}