{"title": "Apple Channel Store Advisor (m/w/d), Vienna (Part-time)", "summary": "Stellen Sie sich vor, welchen einzigartigen Beitrag Sie hier leisten könnten. Bei Apple geht es nicht nur um Produkte - es geht um die Schaffung von Innovationen, die ganze Industrien verändern. Unsere Vielfalt an talentierten Mitarbeiterinnen und Mitarbeitern und ihren kreativen Ideen treibt die Innovation an, die sich durch alles zieht, was wir tun, von revolutionärer Technologie bis hin zu wegweisenden Umweltinitiativen. Werden Sie Teil von Apple und helfen Sie uns, die Welt in einem besseren Zustand zu hinterlassen, als wir sie vorgefunden haben.\n\nAls Apple Channel Store Advisor (ASC) haben Sie die Chance, Ihren Ehrgeiz unter Beweis zu stellen, indem Sie den Verkauf, das Merchandising und den Betrieb eines Apple Shops in einem Partner-Reseller-Store leiten. Mit Ihrer dynamischen Persönlichkeit, Ihrem Geschäftssinn und Ihrer Fähigkeit, andere zu inspirieren, unterstützen Sie die Mitarbeiterinnen und Mitarbeiter unserer Partner mit Ihrem innovativen Ansatz, Ihrer Technikaffinität und Ihrer Begeisterung für Apple.\n\nDurch Ihre strategischen Ideen werden Sie das Apple-Geschäft in einem unserer Shops ausbauen, indem Sie herausragenden Kundenservice bieten, beeindruckende Produktvorführungen für Kundinnen und Kunden organisieren und das Partnerpersonal schulen. Gleichzeitig stellen Sie sicher, dass unsere Merchandising-Standards stets eingehalten werden.\n\nIhre Dienstzeiten richtet sich nach den betrieblichen Anforderungen und erfordert eine flexible Einteilung von 24 Stunden pro Woche, auf vier Tage, einschließlich Abend- und Wochenendarbeit.\n\nIntern wird diese Rolle als Apple Channel Store Advisor oder kurz ASC bezeichnet.", "description": "In dieser Rolle werden Sie:\n\n- Repräsentieren Sie Apple und nehmen Sie Einfluss auf einen einzigen Partnershop, um Pläne zu entwickeln, Verkaufsziele zu erreichen und das Geschäft auszubauen.\n- Zusammenarbeit und Schulung von Sales Teams in Bezug auf unsere Produkte, Dienstleistungen und Merchandising-Richtlinien, während wir gleichzeitig herausragende Kundenerlebnisse fördern und Markenbotschafter entwickeln. Informieren und ermutigen Sie Partnerpersonal, sich über das neueste Produkt- und Serviceportfolio von Apple auf dem Laufenden zu halten.\n- Treffen Sie Kundinnen und Kunden und fördern Sie das Apple-Ökosystem, indem Sie Produktvorteile und Wertversprechen durch Demonstrationen und Beratungen einzeln oder in Gruppen kommunizieren.\n- Streben Sie nach Exzellenz und stellen Sie sicher, dass Apples herausragendes Engagement für Merchandising und Markenstandards in Ihrem gesamten Gebiet aufrechterhalten wird. Dazu gehört die Sicherstellung, dass alle Apple-Geräte, Produktpräsentationen und Merchandising-Elemente auf dem neuesten Stand sind und gemäß den Apple-Standards gewartet werden.\n- Sorgen Sie für tägliche Pflege und Inspektion gemäß den Richtlinien und eskalieren Sie Probleme für eine zeitnahe und wirksame Lösung.\n- Bereichern Sie das Kundenerlebnis, indem Sie Probleme mit Kreativität, Neugier und neuen Ideen angehen.", "key_qualifications": "Leidenschaft dafür, Kunden und Partnern dabei zu helfen, zu verstehen, wie Apple-Technologie das Leben bereichern kann.\nNeugier auf kontinuierliches Lernen und Bereitschaft, Wissen mit anderen zu teilen.\nHervorragende Kundenorientierung.\nAusgezeichnete Kommunikations- und Präsentationsfähigkeiten.\nFähigkeit, andere zu erziehen, zu inspirieren und zu beeinflussen.\nSolide Fähigkeiten zum Aufbau von Beziehungen mit der Fähigkeit, ein vertrauenswürdiger Geschäftspartner an einer einzigen Verkaufsstelle zu werden.\nHohes Maß an Integrität, Vertrauen und Verantwortlichkeit.\nStarke Eigenmotivation und Fähigkeit, in einem schnelllebigen, sich ständig verändernden Umfeld selbstständig zu arbeiten.\nEffektives Zeitmanagement, einschließlich der Fähigkeit zum Multitasking, Organisieren und Priorisieren von Aufgaben.\nDer Ehrgeiz, die Verkaufsergebnisse zu steigern und Apple-Lösungen zu empfehlen, ist wünschenswert.\nKenntnisse im Direktvertrieb oder lösungsbasierten Verkauf sind von Vorteil.", "preferred_qualifications": "", "education_experience": "Verkaufserfahrung von Vorteil.", "additional_requirements": "Apple ist ein Arbeitgeber, der Chancengleichheit fördert und sich für Inklusion und Vielfalt einsetzt. Wir ergreifen auch positive Maßnahmen, um allen Bewerbern, einschließlich Minderheiten, Frauen, geschützten Veteranen und Menschen mit Behinderungen, Beschäftigungs- und Aufstiegsmöglichkeiten zu bieten. Apple diskriminiert weder oder übt keine Vergeltungsmaßnahmen gegen Bewerber, die sich nach ihrer Vergütung oder der anderer Bewerber erkundigen, diese offenlegen oder darüber diskutieren.\n\nWir stellen sicher, dass Menschen mit Behinderungen angemessene Vorkehrungen getroffen werden, damit sie am Bewerbungs- oder Vorstellungsgespräch teilnehmen, wesentliche Arbeitsfunktionen erfüllen und andere Vorteile und Privilegien der Beschäftigung erhalten können. Bitte kontaktieren Sie uns, um eine Unterkunft anzufragen.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546643"}