{"title": "Process & Technical Lead (Data Foundation)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Business Process Re-Engineering team is looking for a thought leader to help drive critical engagements focused on Apple’s Product Lifecycle Management and Data Foundation initiatives.", "description": "The WW BPR Supply Chain group works across Apple teams to deliver innovative solutions including system integration across the supply chain and analytics capabilities. The team partners across Apple to develop, maintain and implement solutions that bring efficiency with embedded data quality. This role is accountable for the relationships and solutions to deliver optimal business results.", "key_qualifications": "10+ years of relevant experience in electronic product manufacturing with extensive knowledge of electronic product supply chains and manufacturing principles, practices, concepts, and terms; Understanding of enterprise product lifecycle management (PLM) and related systems and technologies; Strong background in program management and leading adoption of large scale cross functional engagements; Proven track record in development and implementation of multi-year strategies solving complex business problems and delivering new enterprise capabilities; Demonstrate the ability to cut through ambiguity and synthesize a coherent strategy that delivers business value for multiple competing priorities; Demonstrated ability to engage and influence senior level executives across Apple.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree required, preferably in Industrial Engineering, Computer Science, CIS/MIS, MBA / MS, or related discipline with an information technology focus is preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $168,200 and $280,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545858"}