{"title": "Financial Analyst, Services & AIML FP&A", "summary": "The Financial Analyst will be an integral part of Financial Planning & Analysis (FP&A) team within the Services Finance organization and work on various financial tasks related to tracking, analyzing, and reporting of key financial and business information.", "description": "This is an exciting opportunity that entails the following responsibilities: - Prepare monthly forecasts and analyze key financial and business performance indicators across Services to provide a cohesive financial picture and narrative about Revenue, OCOGS, OPEX and Margins - Collaborate closely with Corporate FP&A and other Finance groups to support financial and planning deliverables, including quarterly close and monthly reporting - Perform profitability analyses and develop competitive insights on new and existing Services, and present findings to senior leadership - Work with technology partners to develop and deploy tools and systems to improve financial processes - Be an active team player in the Services FP&A team, striding for excellence, with desire to foster innovation while working on special projects directed by senior leadership", "key_qualifications": "", "preferred_qualifications": "Perform quantitative and financial analyses with careful attention to detail and provide valuable business insights; Strong business acumen, with high intellectual curiosity and deep interest in Apple’s products, services, technology, business, and strategy; Ability to work with a high level of ambiguity and complexity; Team player / interpersonal savvy who works across teams to solve complex issues and strives for excellence; Outstanding verbal and written communication skills and confidence to present findings in a simplistic manner; Passion for automating and improving processes and systems; Advanced Excel and financial modeling capabilities; Experience in Tableau, Essbase, SAP, SQL, or Oracle a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558994"}