{"title": "Camera Systems Architect", "summary": "Do you love taking on big challenges that require exceptionally creative solutions? Do you deeply understand how an incredible camera experience should work? As part of our Camera Technologies group, you’ll help design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems, from sensor to lens. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras. The Camera System Architecture team initiates & fosters deep collaboration between all cross functional teams involved in delivering final camera performance and features. This is true for any Apple product, from the hardware level through to the user facing applications. The end goal is to successfully tie in highly optimized camera hardware solutions with state of the art software providing market leading imaging experiences. Apple is seeking an energetic and highly motivated Camera System Architect to drive future camera hardware requirements that meet product vision, including considerations for feature requirements, ISP & silicon capabilities, power budgets, optical & mechanical design requirements and solution cost. The ideal candidate would have the capabilities required to perform detailed system analysis and tradeoff evaluations while pushing boundaries in this wide technology space with the goal of arriving at the most optimal solution.", "description": "- This role requires working closely with camera HW, ISP and algorithm design teams creating proposals for future Apple imaging solutions.\n- Guide design studies for imaging system proposals, mapping to system requirements and performance goals.\n- Analyze system simulations to quantify proposals and designs.\n- Creatively influence product roadmaps across groups.\n- Deliver executive level presentations based on solid facts and detailed analysis.\n- Collaborate on prototyping efforts for early evaluation where necessary.", "key_qualifications": "Strong communication, persuasion and negotiation skills in addition to being comfortable with working through ambiguities. Detailed understanding of mobile imaging systems & module designs (image sensors, optics, mechanics, auto-focus, optical image stabilization, assembly processes, etc). Good knowledge of state of the art ISP data-flows and processing blocks. Experience with modern imaging algorithms such as HDR, super resolution, image fusion, multi-camera registration, etc. Working knowledge of imaging system simulations and evaluation of simulation results. Good understanding of image quality metrics and image quality evaluation. Strong verbal communication skills across organizations and at the executive level. Excellent written skills for clear reporting of data analysis and conclusions.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519034"}