{"title": "Reseller Route To Market Team Lead - Logistics", "summary": "Imagine what you could do here! AMR Logistics Operations is a fast moving and dynamic environment where flexibility and adaptability are key attributes for success. The Reseller Route to Market Team Lead collaborates with Reseller Operations & internal LOG teams for logistics operations related to inbound/outbound transportation, distribution, and/or post sales returns. Individuals must be customer focused, process-minded, and passionate for excellence! The candidate must be able to work towards achieving targets while demonstrating personal initiative with a focus on driving superior customer service and process efficiency. Additionally, candidates must have laser focus on supporting the key tactical and strategic initiatives including: Partner QBRs, New Product Introductions (NPI), and Continuous Improvement. This role requires superior business acumen, strong service provider leadership, and innovative process improvement skills. In addition, possess influencing and leadership skills that inspire and facilitate an energetic environment that will deliver excellence. We hope you will consider joining our team!", "description": "Build and maintain effective working relationships with Reseller Operations, Supply Demand Management, & Logistics teams Ability to influence without authority within RSLR RTM team and across cross-functional teams Prioritizes workload, handling multiple and often competing tasks, and meets deadlines for a variety of deliverables Identify and implement process improvement opportunities within AMR Logistics Ability to think strategically and execute tactically, with persistent attention to detail Ability to use data and analysis to make decisions and influence others Recognize pattern and root cause/sub-root cause analysis and provide feedback to management to improve processes that will enhance internal and external customer experience Ability to think creatively and influence with data-driven models; ability to change the thinking of, or gain acceptance of, others in sensitive situations Excellent verbal and written communicator, with the ability to tailor the communications to the relevant audience Detail-oriented and self-motivated; able to function effectively when working independently or in a team Ability to maintain poise and a positive attitude in a challenging, fast-paced rapidly changing environment Ability to represent Apple externally at customer forums with professionalism Monitor key performance indicators and drive performance Evaluate existing capabilities and establish new systems and processes for tracking, measurement, reporting, and analysis of Logistics Ops. Excellent presentation skills", "key_qualifications": "", "preferred_qualifications": "3+ years of planning experience in Supply Chain, Sales Operations, or Retail industry required. Excellent business communication and presentation skills. Additional language proficiencies are a plus. Advanced level of Excel and data analysis skills Proven ability to lead continuous improvement projects and strong track record of customer service Ability to toggle between strategic and detail-orientated thinking. Ability to influence across multi-functional teams and work in a matrixed environment. Capacity to thrive in an environment where accountability without control is prevalent. Enthusiasm for working through ambiguity. Strong work ethics, perseverance and flexibility.", "education_experience": "Bachelors Degree in Engineering, Supply Chain Operations, Business, or related field required. MBA or advanced degree preferred. Multilingual skills a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545374"}