{"title": "SWE- Camera Software - Sr. Machine Learning Research Engineer", "summary": "iPhone is the most popular camera in the world. The flawless integration of software and hardware has led to features like Portrait Mode and Cinematic Mode which deliver experiences that are magical. The Camera & Photos team focuses on user-experience by using computer vision and image processing through machine learning. Our team works hard on products that ship to millions of people. We are looking for people who want to do the same.", "description": "You will leverage your research background and knowledge of computer vision to build, develop and improve Apple technologies. You will develop ideas and concepts into commercially viable algorithms. You should be up-to-date with the latests developments in computer vision and machine learning, both in academia and in industry, and will be able to leverage your knowledge to work and influence Apple's products.", "key_qualifications": "Extensive research and practical experience in developing algorithms for image processing. Possess an understanding and have experience in productizing or publishing your research results in fields such as: Image processing, depth/disparity estimation, optical flow, object tracking, image registration, alpha matting, Bayesian statistics, generative models, deep learning. Strong coding skills. Strong analytical and problem solving skills. Proven leadership in both research and development. Excellent written and verbal communications. Ability to work hands-on in multi-functional teams.", "preferred_qualifications": "", "education_experience": "PhD in Computer Science or a related field (mathematics or physics), ideally with a focus or related work on imaging, computer vision, or machine learning.", "additional_requirements": "Familiar with object oriented programming like: C++ or Objective C, is a plus. Skills in OpenGL/OpenCL/Metal would be a plus. MacOS or iOS development experience would be a plus. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529396"}