{"title": "AppleCare BPR Project Manager, Consumer Sales", "summary": "Do you feel a personal stake in everything that you work on, thrive in fast-paced environments with lots of ambiguity, and enjoy working with complex technologies? Do you develop positive relationships, build trust, and influence without direct authority? Do you communicate openly and clearly, collaborate enthusiastically, and value a culture of balanced debate? If so, we want to talk to you!  In AppleCare BPR (Business Process Re-engineering) we view inclusion and diversity as critical for innovation. That’s because our Project Managers lead the most challenging cross-functional initiatives in AppleCare, the ones that involve multiple systems and teams and drive sophisticated changes across the AppleCare organization and beyond. We turn ambiguity into order, and we know how to execute big projects successfully.  As a BPR Project Manager you will plan, mobilize, and execute mid to large scale projects, ensuring system changes are thoroughly tested and organizations are ready for process changes. You will be the prime mover of your projects including prioritizing, technological solutions and architectural decisions, resource-planning, communications, project governance, risk management, change management and readiness. You’ll connect the dots, build trust and understanding between groups, and orchestrate the activities needed to make your projects successful. The ideal candidate should have experience leading large global technical projects that interweave multiple functional teams and/or multiple systems.", "description": "CORE JOB RESPONSIBILITIES INCLUDE: \nPlan and lead multiple projects using AppleCare BPR’s methodologies for consistently high-quality results  \nLead the creation of to-be processes \nDrive all steps of the technological design process from problem identification through solution vetting and selection \nHost core team, leadership, and steering committee meetings, keeping core and management teams well-informed about project developments in a fast-paced environment  \nLead geographically-dispersed, cross-functional teams, including collaborations with third party partners\nBalance project scope, schedule, and budget constraints with business needs and expectations Identify and engage all resources needed to mobilize projects \nEstablish project roadmaps and schedules, keeping activities on track to major milestones   \n\nADDITIONAL RESPONSIBILITIES INCLUDE: \nElicit requirements/user stories/use cases from subject matter experts \nDrive solution design process with technical teams—generate and vet possible solutions; build, test, and refine models; finalize technical design \nHandle project risk throughout the life of the project Identify, document, and drive resolution of project issues\nIdentify key decision recommendations and broker agreements with internal and external partners  \nEnsure business teams and partners are prepared for system and process changes, including training plans for knowledge transfer to sustaining teams  \nFacilitate capital planning for new projects and project scope changes, including business justifications and strategic road maps", "key_qualifications": "Experience planning, managing, and efficiently delivering large cross-functional systems projects\nExperience establishing a project and it’s appropriate structure from mobilization through to post launch\nExperience supporting system configuration, architecture, and software development life cycles\nExperience with global projects incorporating regional and country-specific details\nPossess outstanding communication and presentation skills (written and verbal) to all levels of an organization\nAbility to form cohesive project teams across disparate organizations and groups\nAbility to navigate through ambiguity to clarify objectives and execution plans\nAbility to occasionally travel and work off/weekend hours to support projects, as needed\nBachelor’s degree", "preferred_qualifications": "Experience implementing Consumer Sales systems projects\nKnowledge of service, support, and warranty contract sales and operations\nGraduate degree in business or engineering", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560539"}