{"title": "AIML - Platform Solutions Architect - MLPT", "summary": "We are seeking a motivated and experienced Solution Architect to join our Machine Learning Platform Technology (MLPT) team. You will play a pivotal role in translating Apple’s machine learning engineers’ needs into effective and scalable technical solutions. As a Solution Architect, you will be responsible for bridging the gap between business collaborators and technical teams, ensuring that the technical solutions align with strategic goals and deliver measurable business value!", "description": "As a solution architect, you will have the following responsibilities: - Work with Apple’s ML Engineers to understand their ML lifecycle. - Work with Machine Learning Platform teams and related service teams to gain a deep hands-on understanding of their current tools and service offerings, roadmaps and target use cases. - Partner with internal teams to improve their model development pipeline and leveraging the right tools to improve their efficiency and effectiveness. Identify opportunities for improvement and recommend enhancements to machine learning service teams. - Stay up-to-date with the latest trends and technologies in the machine learning industry.", "key_qualifications": "5 or more years of working experience as a solution architect or related roles. Proven experience in designing, implementing, and managing production-quality software solutions. Deep understanding of cloud computing, distributed systems, and data architectures. Knowledge of Machine Learning Accelerators like GPU, TPU, and Machine Learning frameworks like PyTorch, Tensorflow. Experience with containerization technologies like Docker and Kubernetes. Hands-on experience with at least one programming language (e.g., Python, Java)", "preferred_qualifications": "", "education_experience": "Bachelors degree or Master's degree (preferred) in Computer Science, Engineering, or equivalent experience in related fields", "additional_requirements": "- Effective Communication: Explains complex technical concepts clearly to both technical and non-technical audiences. - Problem-Solving and Analysis: Identifies, analyzes, and resolves challenging technical issues with strong analytical skills. - Adaptability and Initiative: Can adapt to changing environments and takes ownership of tasks with self-motivation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551194"}