{"title": "Senior Legal Counsel - Commercial Litigation EMEIA", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Do you love taking on big challenges without precedent? Do you possess a deep knowledge of the legal field and a passion for innovation?  As a part of our Legal group, you’ll help uphold Apple’s high ethical and corporate standards. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your deep legal expertise to rare and often unexplored aspects of the law. Together with your team, you’ll provide the critical support needed worldwide for all Apple products and businesses. We are looking for a litigator to join Apple’s Commercial Litigation team in our London office. The ideal candidate is a self-starter who can quickly learn Apple’s litigation docket and practices and run their own set of cases across Europe and beyond. This role requires a litigator who has shown the ability to strategically be responsible for a broad variety of litigation matters from beginning to end by exercising excellent judgment and showcasing strong communication skills, all while being highly efficient with their time.", "description": "As a member of Apple's Commercial Litigation team, you will not be merely supervising outside counsel. Rather, you will be directly engaged in formulating and driving strategy as well as providing counsel to internal clients on a wide range of novel matters. The position requires a high degree of self-sufficiency, independent judgment and a trial-focused approach. You will operate as part of an encouraging and lively team of lawyers and support staff who work closely together to protect Apple's interests. Travel is required. The role sits at Apple's offices in London with a vibrant set of attorneys supporting other aspects of Apple’s business. The candidate will need to both work well with that team while also working with remote teams in the US and around the world.", "key_qualifications": "8+ years of major law firm and/or in-house litigation experience, UK or other common law qualification as Solicitor, Barrister or equivalent, Experience handling sophisticated multi-jurisdictional proceedings; litigation experience in civil law jurisdictions a plus, Experience leading and advising on regulatory litigation, Proficient in oral and written English and ability to work in at least one further European language a plus, Major law firm and/or in-house litigation experience, with the ability to match legal expertise to the business context, Strong technology interest and proficiency, Preference given to candidates with significant trial experience, Excellent communication, analytical, organization, and negotiation skills are critical, Able to work independently and also collaborate well with others in an organised manner", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "We honor individuality, human dignity and equality. We want people to be themselves. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200531470"}