{"title": "Evaluation & Response Senior Specialist", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML Data Operations team is passionate about technology with a focus on enriching the customer experience. We are looking for an Evaluation and Response Senior Specialist that has high attention to quality and accuracy. You are creative and have a passion for detail with proven expertise in English language analysis.", "description": "As part of the team, you play a central role in enhancing data quality. As an Evaluation and Response Senior Specialist, you’ll evaluate and analyze responses generated by our language models for accuracy, relevance, coherence, and appropriateness across various contexts and topics. In addition to achieving your production goals, you will collaborate with our AI research and engineering teams to provide insights and recommendations on improving model performance, including refining responses and addressing common shortcomings. You will assess responses for potential biases, harmful content, or inappropriate language, and implement measures to ensure the model's outputs align with safety and ethical guidelines. You’ll provide ongoing evaluation feedback to guide model development and fine-tuning to improve user experience and model behavior. You will maintain high-quality standards for annotated data and ensure consistent evaluation metrics are applied. Your flexibility and the ability to prioritize tasks is essential. We focus on data quality, thinking creatively on how customers use our products and use this knowledge for improvements.", "key_qualifications": "Ability to leverage creative writing skills to craft engaging and informative responses that resonate with the target audience and maintain a consistent tone. Experience working with language data (research, analysis, translation, review). Aptitude for acquiring advanced technical skills, an eagerness to learn and take on new challenges. Strong understanding of natural language processing and machine learning concepts. Proven skills in researching and analyzing content to ensure accuracy. Proven expertise in the English language with excellent comprehension and grammar skills. Expertise with navigating systems, tools and changing workflows. Attention to detail and critical thinking skills in evaluation of language context, tone, and intent. Ability to analyze and provide accurate reporting; with the ability to identify and communicate errors and inconsistencies in responses. Familiarity with AI safety concerns, and the ability to recognize and mitigate harmful content. Demonstrates flexibility and adaptability to changing workflows and responsibilities. Ability to conduct root cause analysis on key error trends, summarize findings, recommend solutions, and coach and mentor junior specialists to improve data quality. Minimum 1 year of experience in evaluating AI-generated content and working with large language models.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree English Literature or Journalism specialization preferred", "additional_requirements": "Successful completion of a pre-employment assessment and background check. Successful completion of initial training and certification testing", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540115"}