{"title": "Module NPI Operations Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something!", "description": "-  Lead a new product ramp, from initial design validation to mass production phase\n\n-  Work with global NPI team to drive ramp readiness with engineering, operations and contract manufacturers, focus in overall EQ/capacity planning, manufacturing process scalability, design convergence and overall bring up plan of multiple factory sites that includes factory space and production lines qualifications\n\n-  Support Engineering and global NPI teams in driving design development builds in Asia\n\n-  Coordinate all operations related communications through the organization, escalate key issues and present solutions and risk mitigations to cross functional executive teams;\n\n-  Drive Engineering, Operations and Contract Manufacturers on design for manufacturing to enable continued volume growth at the best product quality.\n\n-  Support EQ/ tooling / fixture qualification and validation and ready for mass production.\n\n-  Good logic and structure to bring up new or problematic vendor back to the right track, well management different layers communications to get consensus on the direction.", "key_qualifications": "", "preferred_qualifications": "Design or development experience along with operations knowledge or experience preferred\n\nMust be a self starter with innovation, integrity and attention to details\n\nWork in a highly dynamic, fast faced and ambiguous environment.\n\nAbility to facilitate difficult issues and drive cross functional teams for closures.\n\nExperience working with international OEM partners.\n\nMaster/MBA or equivalent experience is preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555343"}