{"title": "Fire Life Safety Specialist", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We believe the people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. We believe it’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it!Close coordination with all Real Estate & Development groups is encouraged, including but not limited to the Facility Service Center (FSC), Environmental Health and Safety (EH&S), Maintenance & Operations (MAOPS) and Project Management.", "description": "As a Fire Life Safety Specialist in our corporate campus, your primary focus will be on safety, customer service and maintaining an exceptional workplace experience for our employees. Your technical expertise will play a vital role in preserving the overall functionality and aesthetics of our facilities. You'll have the opportunity to work closely with various departments and employees to address their needs promptly and effectively, leaving a positive impact on their daily work lives.", "key_qualifications": "Knowledge of Maintaining Fire Life Safety Equipment and Systems.\nPreferred (but not limited to) 5+ years of hands-on experience working in a fast-paced multi-facility environment, with a focus on providing the best-in-class service.\nAwareness of applicable regulatory codes per County, State and Federal Fire codes.\nUnderstand record drawings and schematic diagrams.\nShown ability to plan and prioritize tasks in a focused work environment and maintain high levels of efficiency without direct supervision.\nConduct routine inspections and preventative maintenance to ensure the safety and functionality of all facilities and equipment.\nCollaborate with team members to prioritize and complete maintenance tasks in a timely manner, minimizing disruptions to daily operations.\nProvide exceptional customer service by actively listening to employees' concerns and ensuring their satisfaction with the resolution provided.\nIdentify opportunities to enhance the campus environment and propose improvements to management for consideration.\nMaintain accurate records of maintenance activities, including work orders, repairs, and inspections.\nUphold safety standards and protocols, promoting a secure and hazard-free workplace for all.\nEffective interpersonal skills to provide direction to contractors and vendors performing services for the company.\nValid Driver’s license.\nAbility to adapt and learn quickly, work autonomously, approach tasks with a sense of urgency, and address any issues that arise day or night.\nStrong attention to detail.\nA willingness to provide on-call support in case of emergencies or other off-hours issues.", "preferred_qualifications": "", "education_experience": "NFPA certification or status as a registered Fire Protection Engineer is preferred.", "additional_requirements": "Work includes but is not limited to:\n-  Basic knowledge and understanding electrical safety and facilitating electrical repairs.\n-  Reporting and completing repair requests made through the CMMS systems.\n-  General carpentry work.\n-  Response to emergencies including nights and weekends to correct unsafe or hazardous conditions.\n-  Experience working with a BMS systems.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549907"}