{"title": "GPU Post-Silicon Engineering Program Manager", "summary": "Come and join the team that delivers the GPUs in the Mac, iPhone, iPad, Apple Watch, and Apple Vision products! At Apple, we focus on innovative design and principled execution to build the most efficient GPUs that scale across our full range of products and deliver industry-leading power and performance. We work together across hardware, software and systems teams to build truly optimized products and amazing user experiences. To accomplish this, we need technical excellence combined with the expertise to work across the organization and to put each decision in the right context.", "description": "In this role, you will be working with the GPU team to drive post-silicon planning, bringup, and debug activities. This will involve some or all of the following: Work with the functional team to develop post-silicon validation plans (what needs to be tested, by whom and when); Driving debug of silicon issues (functional, electrical, performance, etc.) with GPU and cross-functional teams; Organizing and prioritizing debug tasks and experiments, and following up on action items; Tracking issues and bugs across multiple projects and communicating with software, system, and other teams; Focused issue reporting and communication of program risks & status in cross-functional and executive forums; Materials management (parts, boards, etc.)", "key_qualifications": "Proven experience in GPU or SOC validation, preferably as a lead/manager; Experience with end-to-end silicon bringup, validation and drive towards production; Meaningful experience in technical leadership and/or project management experience; Ability to work collaboratively and cross-functionally throughout the entire organization; Able to build trust and lead through influence in a highly complex matrix organization; Comfortable navigating tough situations, juggling priorities and managing constraints while running complex, fast-paced, programs; Driven to continuously improve processes, methodologies, and tools; Strong communication and executive presentation skills, ability to articulate complex problems in a simple and easy to understand manner; Strong time and task management skills with consistent attention to detail; GPU architectural experience is an advantage, but not required; Exposure to software driver and HW/SW interactions; Reasonable understanding of Power and Perf tradeoffs", "preferred_qualifications": "", "education_experience": "BS + minimum of 10 years of relevant experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552728"}