{"title": "WiFi SW Development Engineering Manager", "summary": "Do you want to build revolutionary networking system software? Do you want to make a huge impact to the WiFi industry? Do you love the challenge of solving sophisticated problems? If you're passionate about Wireless Technology, specially WiFi technologies, in the context of embedded software development and system-level integration, we may have the job for you.", "description": "As core team member, you'll be responsible for crafting, improving and maintaining WiFi networking subsystem software across a range of Apple products including iPhone and iPad. Due to the multi-functional nature of the technology, the ideal candidate should have strong communication and interpersonal skills to work well with a large variety of people from organizations within and external to Apple. The candidate needs to show initiative, take ownership of a technical area, and assume responsibility for leading all the related aspects that need to be coordinated to achieve success. The candidate should also be able to make intelligent choices when taking into consideration product-level constrains including regulatory requirements, power consumption, and thermal footprint.", "key_qualifications": "- In-depth understanding and strong hands-on experience on 802.11 technologies and standards\n- Strong experience with embedded software development and proven understanding of embedded OS fundamentals\n- Experience running and delivering large scale embedded SW projects\n- Proficient understanding of TCP/IP suite of protocols\n- Excellent analytical, programming and debugging skills\n- Succeed in a collaborative environment and can clearly communicate while deftly driving multiple projects across many teams\n- Laser-focused on customer impact with attention to the smallest details that are meaningful to our customers", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent  Masters Degree is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537425"}