{"title": "Technical Program Manager, iPhone", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!", "description": "We are looking for talented engineers across teams at Apple in Operations to support iPhone Final Assembly. Technical Program Managers have some of the following manufacturing engineering responsibilities, including: Design for Manufacturability - Provide early and ongoing manufacturing involvement to ensure new products are mechanically manufacturable. Product Engineering: Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering with respect to technically complex testing methods, procedures and failure analysis. Process Engineering: Designs and develops technically complex processes to improve quality and efficiency. Failure/Data Analysis: Plans, develops and implements technically complex procedures for the testing and evaluation of soon to be released products.", "key_qualifications": "Meaningful experience (5+ years) in introducing products into manufacturing, or high volume production a large plus. Excellent project management skills (Planning, Cost, & Delivery), experience working in a matrix organization. Direct experience leading any of the following functional engineering teams: Mechanical, Electrical, Test, DFX, etc. Experience working with international OEM partners. Ability to travel internationally ~25%. New product introduction and Manufacturing Operations experience.", "preferred_qualifications": "", "education_experience": "BS or MS in related Engineering field, MBA a plus.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551188"}