{"title": "SAP Project Manager, Enterprise Systems", "summary": "Apple’s Information Systems & Technology (IS&T) organization manages key business and technical infrastructure at Apple-- how online orders are placed, the customer experience with technology in our retail stores, how much network capacity we need around the world and much more.", "description": "Apple’s SAP Global systems organization is responsible to process end to end customer transactions in SAP systems. This position will be responsible to implement S/4 at Apple in a fast paced environment.", "key_qualifications": "", "preferred_qualifications": "Extensive experience in managing mid to large sized SAP projects, Integration experience with tax applications, and other SAP modules like FICO, FICA, RAR etc. preferred, Experience in BRF+ preferred, Experience in managing & architecting complex business models preferred, Proven track record of successfully delivering finance projects on time, working with various internal and external teams, Experience in leading a global and diverse team, Ability to drive the project forward with a sense of urgency, Domain expertise and consistent track record in designing and deploying solutions in SAP FICA or RAR, Strong written communication skills including business and functional requirements, management level presentations and proposals presentation, Lead SAP projects, prioritize work and coordinate multiple projects in parallel, FICO / FICA / S/4 RAR migration/Integration experience is highly desired.", "education_experience": "BS/BA in Business, Project Management or equivalent work experience is preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550657"}