{"title": "People Services + Technology, Workday Delivery and Governance Lead", "summary": "Join a dynamic team of People team professionals focused on product management of our core people solutions. The People Services + Technology team is looking for an experienced Workday Delivery and Governance lead to partner with our Workday team leads and cross functional partners to drive optimization through process, data and technology solutions.", "description": "Lead the design and execution of the Workday Delivery and Governance processes. Lead other team members in efficient process execution for twice a year Workday Product Releases. Lead team members in efficient and transparent Workday Project and Enhancement prioritization exercises keeping stakeholders engaged throughout the process. Drive the flawless execution of regular Workday feature deployments via monthly Sprints. Maintain constant and effective communication with team members, subject matter experts, and leaders. Perform qualitative and quantitative analysis of key performance indicators in an effort to identify opportunities for continuous improvement. Create effective presentations for executive updates regarding the Workday Program.", "key_qualifications": "10+ years of Project/Program Management expertise in the HRIS space. 5+ years leadership experience delivering projects with high discretion and autonomy. Well versed in software development life cycle methodologies including Agile. Experience with project management software building complex project and resource plans. Ability to use data and analysis to drive decision-making and prioritization crossing multiple functions. Thrives in ambiguous work environment bringing organization and order where it is needed. Demonstrated ability to complete multiple tasks under pressure. Project Management with high attention to detail driving team members to the same standards. Exceptional skills in communication, problem solving and strategic thinking. Extensive experience with cross functional stakeholder management. Ability to take complex processes and communicate them in a simple and effective way. Maintains a positive service oriented attitude. Bachelors Degree.", "preferred_qualifications": "Experience managing Workday post implementation delivery processes. Well versed in the Workday software landscape. Workday Functional expertise. Experience with Workday tenant management. Proven success in creating efficient business processes and willing to challenge the status quo. Familiar with Wrike project management software. Familiar with Apple radar tracking system. Familiar with Keynote software as a tool for effective presentations. MBA or Consulting experience.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $171,900 and $258,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555206"}