{"title": "Data Engineer (Infrastructure Systems)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Infrastructure Services Software Development team is looking for a passionate, self-motivated and hard-working engineer to be part of a diverse, fast paced and high-energy team. We are seeking an experienced Data Engineer to build high quality and scalable Data Analytics and Reporting solutions. You will be responsible for developing some of the key components of the platform including the data pipelines, dashboard & reports. Collaborate with multi-functional teams to gather requirements. You will be contributing to key and innovative technologies which supports major Apple applications, with all the scalability and high-availability requirements that entails.", "description": "-  Gather and communicate data capture requirements for new and existing customer facing platforms.\n-  Conduct end-to-end analysis across all of the data points, including data gathering from large and complex datasets. \n-  Develop and automate large scale, high-performance, scalable data pipelines\n-  Experience in building and maintaining custom frameworks to support engineering/analytics needs\n-  Drive the generation of insights from raw, unstructured data to improve existing features and explore future directions.\n-  Create new metrics for performance measurement and advocate for changes to existing metrics where needed.\n-  Develop and maintain complex Tableau dashboards, aggregating data from multiple data sources. Support Tableau developers by writing complex SQL queries and providing easily queryable datasets in the form of Tableau extracts & data sources.\n-  Work with technical teams—including DBA, SREs, Tools & data engineering—to ensure proper functioning of all data pipelines and dashboards/reports.", "key_qualifications": "4+ years of industry experience in a Data Engineering role with experience in designing and implementing scalable data pipelines, data services, and data products. Ability to present and articulate key performance metrics to collaborators and executives. Ability to construct and understand advanced structural query language (SQL) scripts. Dimensional modeling and business intelligence concepts. Ability to adapt data results for frequent and unexpected operational changes as needed to support improved customer experience across multiple business units. In-depth experience of analyzing data and creating reports, data profiling, understanding anomaly detection and working with data to identify trends and make recommendations. Experience in producing powerful visualizations and dashboards that balance both art and science, focusing on usability and interpretation. Extensive experience in using visualization tools to deliver actionable insights. Tableau/D3 skills are must to have. And certification would be a delight. Programming experience in building high quality software. Skills with Python, Shell, Perl preferred. Proficiency in SQL in the MPP/No SQL databases like Vertica, Snowflake, Redshift in a large scale environment. Strong ability to learn new technologies related to Data Engineering and Advanced Analytics. Strong attention to detail and excellent analytical capabilities. Demonstrate ability to work well independently and within a fast-paced, team-oriented environment. Knowledge in engineering machine learning, feature engineering systems is a plus.", "preferred_qualifications": "", "education_experience": "B.S or M.S in Computer Science, Mathematics, Statistics or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200531462"}