{"title": "Software Development Engineer in Test", "summary": "Be a part of the most exciting products in the market today—the revolutionary iPhone, the magical iPad, the Apple Watch, and more. Our team creates solutions centered around apps, services, tools, and systems that help Apple engineering teams worldwide realize the vision of the products they invent. We invite you to be part of this phenomenon!", "description": "This hands-on role demands the best and brightest; the ideal candidate will be well rounded and offer a diverse skills that aligns with the key qualifications listed above. Our team’s focus areas include Device Services; responsible for activating every iPhone, iPad, Apple Watch, Apple TV, iPod, and HomePod worldwide, PLM and Radar; Apple’s full product lifecycle management ecosystems for managing product and feature planning, testing, and defects. This is a highly cross-functional role; we interact closely with technical and business teams all across Apple and other third party partners. Collaboration with engineering, infrastructure, site reliability, project management, and partner technical and business teams to formulate engineering specifications. Working with other quality and performance engineers in crafting test plans, test cases, and associated automation, setting standards, estimating effort, and coordinating test execution. Identify and document defects, collaborating with stakeholders to prioritize and address resolutions. Engage with stakeholders to define and consistently assess metrics that monitor product quality. Think you’re a fit? We’d like to hear from you! As we are looking to fill a range of open positions for a new team, more experienced individuals may be considered for senior level roles within the team.", "key_qualifications": "Minimum of 3 years of professional experience in quality assurance or software engineering. Self-motivated, proactive, and meticulous individual with excellent written and oral English communication skills. Proficient in developing test plans and automation strategies for intricate full-stack applications. Hands-on experience in testing and automating Java-based web services, including end-to-end and unit testing using frameworks like JUnit or TestNG. Extensive knowledge of back-end development technologies, particularly in Java and related frameworks. Working knowledge of browser technologies and frameworks such as HTML, CSS, JavaScript, and React. Experience in testing and automating browser-based applications across various platforms, using automation tools like Playwright, Selenium, or equivalent. Automating and testing Asynchronous and distributed systems. Proficiency in relational database technologies like Oracle or Postgres.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530991"}