{"title": "Software Development Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. The Operations SWE team is a part of Manufacturing Systems & Infrastructure team and is responsible for developing infrastructure and manufacturing solutions used to create and service future Apple products. The Operations SWE Team is seeking a highly motivated individual with a background in software development.  In this position, the candidate’s primary responsibility will be designing and developing solutions on both our production lines and within our testing equipment, while collaborating closely with other Apple development software, hardware and testing teams.  The Ops Software Engineer will also be responsible for maintaining and improving existing software solutions.", "description": "Work cross functionally to define requirements. Work alongside developers to define architecture & design. Develop scalable software and be comfortable in Design reviews. Develop Unit test plan and work closely with QA team to help develop integration plan. Work with QA team to help debug production issues. Should be well versed with Git and bug tracking systems - can comfortably use them in day to day development processes. Provide constructive feedback for testability and suitable solutions relying on data to explain technical decisions", "key_qualifications": "Minimum 7 years of experience in programing in C, C++, or Objective C, Experience with scripting languages such as Python, Perl, Ruby, shell scripts, etc., In depth knowledge of RTOS, Unix and/or Linux, Excellent knowledge of TCP/IP, MQTT, CoAP (?) and HTTP, IoT Platforms experience such as NFC, Bluetooth for connectivity and communication, Skills in developing and debugging firmware for embedded devices, including knowledge of cross-compilation, flash programming, and peripheral interfaces, Knowledge of security principles and practices, Proficiency in data handling techniques, data analysis, and visualization tools for databases and big data platforms, Excellent debugging skills: ability to quickly recognize patterns in failures, Strong written and verbal communication skills, Prior experience in manufacturing software and robotic solutions is a plus., Self-motivated with excellent time management skills and entrepreneurial spirit., Proficient in using a variety of productivity tools and programming languages, Up to 10% domestic and international travel required", "preferred_qualifications": "", "education_experience": "BS in Computer Science. MS preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.<br/><br/>Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.<br/><br/>Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548268"}