{"title": "Software Engineering Manager - CoreAV", "summary": "The Core OS software team is looking for an exceptional software engineering manager to lead the CoreAV team in Core OS. Our team is responsible for device drivers and firmware for DP, HDMI, and MIPI displays supported across all of Apple’s innovative products, from iPhone, iPad, Apple TV, Apple Watch, Mac product line, and Vision Pro!", "description": "Leadership and management of a team of talented low level embedded software engineers in a fast-paced and demanding development environment. Ownership of device drivers and FW. Working with cross-functional teams to design, plan, and deliver high quality software features for our display ecosystem. Creating and promoting a development environment that encourages innovation and sets high standards for quality and productivity. Identifying and mitigating risks in development activities. Strengthening the team by hiring and retaining top engineering talent.", "key_qualifications": "Experience in leading a low-level systems software team. Direct experience with low-level systems software development. Deep understanding of operating system fundamentals. An authentic passion for low level programming. Deep and current understanding of the C and C++ programming languages. Experience with UNIX systems. Proven track record of successful and timely product delivery with high quality. History of setting aggressive yet attainable goals, and motivating teams to achieve them. Evidence of driving technical innovation. Passion to dig in and lead the development of ground-breaking features and products. Strong communication skills, both inward and outward", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or equivalent experience", "additional_requirements": "Desired Skills and Experience:\n- Knowledge of hardware architecture and assembly language programming\n- Understanding of system construction principles in the context of a microkernel-based environment\n- Cross-platform project development experience\n- Knowledge of Swift, Objective-C, or C++", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549377"}