{"title": "Manufacturing Design Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, you will help us leave the world better than we found it.", "description": "-  In this highly visible role, you will manage selection, implementation & optimization of manufacturing processes for mechanical enclosure subassemblies for our legendary products.\n-  You will utilize your Mechanical Engineering experience and work cross functionally with Product Design Engineering and Industrial Design to assess product features for manufacturability, and recommend capable production processes and equipment.\n-  Work closely with Cupertino-based SBEs in the development of above said processes.\n-  Partner with Global Supply Managers to develop new equipment from RFQ through factory implementation, and manufacture and deliver material to downstream supply chain nodes on time and on cost.\n-  You will work with Supplier Quality Engineers to drive yield improvement through analyses of part quality, defect pareto, and SPC.\n-  A heavy emphasis will be on working with suppliers to define and refine mechanical tooling and fixtures, and establishing process capability and readiness.\n-  Coordination of activities and direction through clear communication between the Asia and US-based teams, and vendors is a necessity.\n-  You may audit supplier secondary processes as well as support product phase builds from prototype through ramp and mass production.\n-  Provide leadership at manufacturing sites during development and product production ramp, and drive engineering issues to resolution\n-  Use data to drive process decisions, basic data analysis, DOEs, SPC, etc.\n-  Design best-in-class process based on cosmetic and drawing requirement, mapping out and document process flow and details which includes selecting processing equipments, designing corresponding fixtures/consumables/magazines/trays, initiating DOEs to find out the best machine setups, machining path and parameters, and finalizing the process solution from prototype stage to mass production stage.\n-  Define part tolerance and specifications by demonstrating process capability to Product Designers and Industrial Designers Lead process development/have expertise in CNC machining - Develop all CNC milling and turning processes. Scope appropriate CNC equipment to be used, develop CNC fixtures, implement touch probing, lead the reduction of cycle time, development of sophisticated cutters and coatings, High Speed Machining implementation, support the programming and optimization of all CNC-related activities at contract manufacturers worldwide. Own yield improvement actions and process change decisions based on statistical process control (SPC) data analysis.\n-  Identify, research, develop, and qualify premier equipment manufacturers and suppliers", "key_qualifications": "-  Hands-on experience and technical knowledge in fixture design, laser process.\n-  Other process knowledge such as surface finishing, assy and experiences in developing customized machine (non-standard machine) in 3C industry are preferred.\n-  Ability to learn, implement and use Statistical Process Control to make data driven decisions.\n-  Familiar with GD&T, DOE, SPC.\n-  Good written and oral interpersonal skills, fluent in English.\n-  On-site build support; willing to work from factories.\n-  Ability and willingness to work independently and travel frequently (mainly in Asia).\n-  A standout teammate and self starter with innovation, integrity and attention to details.", "preferred_qualifications": "", "education_experience": "-  Bachelor degree or equivalent experience in Mechanical Engineering and/or relevant manufacturing work experience.\n-  5 yrs+years relevant working experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545071"}