{"title": "Sr. Software Engineer - Developer Platform (ASE)", "summary": "Apple Services Engineering org is building the next generation of tools empowering Apple’s software developers to build products that surprise and delight our customers.", "description": "As a key contributor on the Software Platform Development team you will work on:• Developing automation infrastructure that can globally and efficiently distribute CI workloads• Building management planes to measure and control bespoke Kubernetes infrastructures• Creating developer facing tooling to build and monitor software across a variety of surfaces• Designing custom services to facilitate easier integration testing, resource utilization, and many more• Advocating for and compose hermetic systems for building Apple’s customer facing software• Introducing resiliency and consistency into Apple’s production systems• Collaborating with internal developers on scoping new features, triaging workflows, and crafting more ambitious testsSenior engineers will be expected to excel at making informed technology choices within complex architectures, whether it's deciding to build or buy specific components and selecting the right frameworks. Your deep understanding of the organization's business, products, customers, and strategy will empower us to pinpoint opportunities aligning with our team's mission.", "key_qualifications": "Extensive professional experience designing, building, testing, and supporting software• Enjoy ownership and individual responsibility to drive a project from idea to completion• Have worked directly with users and are able to offer technical expertise, often in a 1:1 environment• Operate as a generalist, working across many different technical domains, picking up skills as need• Are highly collaborative and can function effectively in a person-to-person culture• Have a passion for enabling people to do their best work and a focus on the end-user experience• Skilled with Kubernetes, Cloud Native technologies, CI/CD systems, build tools like Bazel & Gradle, and languages like Starlark, Go, Java, Kotlin, Scala, and Python• Proficient with Docker, Kubernetes, Jenkins, Tekton, and/or Spinnaker.", "preferred_qualifications": "", "education_experience": "BS degree in Computer Science, Mathematics, or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535137"}