{"title": "Strategic Engineering Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "This EPM role focuses on driving and aligning multi-functional engineering resources. Help formulate, follow and execute company’s priority with respect to the above specified areas. Work with multi-functional team DRIs and china OEM/CM teams to resolve engineering issues seen from mass production and field returns. Identify, evaluate, and drive various activities while clearly communicating the risks, priorities and schedules to multi-functional and management teams. Involve in partnering with NPI EPM group in next generation product developments in post-proto phase. Respond quickly and efficiently, to changes to the overall goals, schedule, and/or architecture. Work with highly skilled multi-functional engineering teams to identify risks, explore solutions, reach consensus and execute mitigations as quickly and efficiently as possible. Identify and prioritize project tasks and risks, and able to filter and distill relevant information for the targeted audience", "key_qualifications": "empty string", "preferred_qualifications": "Master degree of ME or EE or equivalent. Experience with portable products including displays, batteries, WiFi/BT, cellular, input devices, enclosures, silicon, and/or mass storage", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553253"}