{"title": "Applied ML Engineer - Localisation", "summary": "The Software Localisation team powers the tooling, features and processes used to create an exceptional localized experience for Apple’s international customers. We are responsible for the Localisation workflows in Xcode, framework-level Localisation support, localized OS features, and internal Localisation tools used for high quality Localisations across all of Apple’s products. We are in search of a creative, motivated, and passionate technical leader who has a robust understanding of large language models (LLMs), generative AI, Natural Language Processing (NLP) and Machine Translation (MT). An ideal candidate has the ability to lead diverse cross-functional efforts to build the next generation of ML tooling and end-user features for international locales. Strong engineering fundamentals and a passion for this area are required.", "description": "As an Applied ML Engineer in the Software Localisation team, you will join a phenomenal team of passionate engineers to design, implement and qualify Localisation features across a wide variety of Apple’s products. We are looking for an exceptional candidate to help architect the future of localizing ML models and machine translation. Your role is to ensure Apple and third-party developers using Xcode can deliver world-class software products to millions of users around the world. Your duties include:\n\n* Leading the exploration and application of Large Language Models (LLMs) for performing translation tasks\n* Translating the latest research into high-quality systems and models that can be practically applied to to further improve machine translation\n* Actively engaging in all aspects of model development, from ideation, training, experimentation to deployment.\n* Collaborating with translation, Localisation quality, project management and engineering teams to develop and implement machine learning solutions\n* Developing and maintaining features, frameworks and tools to help facilitate the software translation process", "key_qualifications": "* Experience with Machine Learning (ML), with a particular emphasis on Large Language Models (LLMs) and Natural Language Processing (NLP)\n* Proven ability to comprehend, interpret, and apply cutting-edge research into consumer-oriented products\n* Comprehensive knowledge and hands-on experience with fine-tuning approaches and training models\n* Experience adapting pre-trained LLMs for downstream tasks\n* Proficiency using open-source ML toolkits and frameworks (e.g. PyTorch, TensorFlow, OpenNMT)\n* Strong programming skills in Python, C or C++", "preferred_qualifications": "", "education_experience": "BS, MS or PhD in Computer Science, Artificial Intelligence, or Machine Learning (or equivalent experience)", "additional_requirements": "* Experience in software Localisation / internationalization\n* Familiarity with Localisation standards and technologies (Unicode, XLIFF, ICU, etc.)\n* Native-level foreign language skills in reading, writing and speaking\n* Experience in scripting languages (e.g. bash, Ruby, Perl)\n* Knowledge of Computational Linguistics\n* Published research in the field of Machine Learning or AI\n* Experience using Xcode to build software for Apple’s platforms\n* Proficiency with Objective-C and Swift programming languages\n* Proficiency with Apple’s development APIs (SwiftUI, Foundation, etc.)\n* Experience or curiosity in languages and culture\n* Comfortable working cross-functionally and cross-culturally", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549130"}