{"title": "Sr. Security Software Engineer, Ai and Data Platforms", "summary": "At Apple, great ideas have a way of becoming extraordinary products, services, and customer experiences. Bring passion and dedication and there's no telling what you could accomplish. Are you passionate about empowering decision making through security? Do you want to work in a highly energized environment where your abilities will be challenged on a day-to-day basis? If so, AI & Data Platforms org is looking for people like you! You will be part of Apple’s security engineering team in a unique organization driving secure developer experience, generative AI, and data platforms. You will be joining a team of highly-skilled and passionate security engineers working on this groundbreaking and constantly evolving space. Our security engineering team champions shift-left security by providing innovative and GenAI-powered security capabilities to accelerate detection and remediation of security issues introduced in the software development process.", "description": "This role is responsible for developing security capabilities, services, and tools leveraging both GenAI and traditional security techniques to proactively identify and remediate application security risks earlier in the software development lifecycle. This position requires deep expertise and hands-on experience with application security and software engineering at large enterprise scale using modern technology stacks running on wide range of production environments including Cloud. You will design and implement security solutions that provide timely detection of security issues while being performant and scalable. Understanding and solving for security challenges of developers will be a key focus for this role. You will improve developer experience through innovative solution implementations that accelerate security detection and remediation across the application stack. Given that security and GenAI domain is constantly evolving, you will research, learn and apply new technologies, techniques and methods to improve effectiveness of our security services. You will have a proven track record of technical leadership, innovation, responsibility, and creative thinking. You will work closely with other senior engineers on the team and independently lead a project or own significant components of a large project. You will collaborate with a diverse set of engineering teams across Apple to understand their challenges, design appropriate recommendations, and enable security solutions that both improve developer productivity and mitigate security risk for Apple. You will build sustainable relationships with our partner engineering teams to integrate our solutions into the developer platforms.", "key_qualifications": "10+ years of experience in software engineering\nExperience developing detailed solution architecture and components and leading development efforts with junior engineers and contractors\nProficient in engineering of highly scalable, multi-threaded security solutions using Python, Java, or Go and RESTful or GraphQL APIs and be comfortable with Reactive programming\nHands-on experience building and deploying applications on public cloud such as AWS or GCP, using infrastructure as code (IaC) as well as using container technologies such as Docker and Kubernetes\n5+ years in application security domain (preferred)\nHands-on technology experience in large enterprise environments is a must.\nHands-on experience integrating security checks and tools into developer toolset, GitHub, and CI/CD\nHands-on experience implementing and operating SAST and DAST tools\nKnowledge of OWASP and MITRE ATT&CK frameworks\nExperience doing code reviews to identify security vulnerabilities, developing secure coding practices and providing remediation guidance\nExperience with application threat modeling using industry standard frameworks\nExperience designing and implementing NoSQL databases\nKnowledge of CI/CD frameworks\nExperience leveraging and customizing open source projects\nExperience with test driven design and knowledge of 12 Factor application concepts\nExperience with application and service monitoring tools and techniques\nProficient in writing detailed solution design specifications, sequence diagrams, test plans, workflows, etc.\nExcellent verbal communications skills and ability to work effectively with multi-functional technical and business teams", "preferred_qualifications": "", "education_experience": "Bachelors or Masters of Science or equivalent experience in Computer Science, or Cybersecurity.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545192"}