{"title": "Sr. Engineering Program Manager -Business ASE", "summary": "Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology! The Business and Education program team within Apple Services Engineering is seeking an extraordinary Sr Engineering Program Manager with a deep understanding of technology and a genuine enthusiasm for delivering complex, cross-functional projects in a fast-paced environment. This role requires an enterprise attitude, technical curiosity a ‘big problem solver’ with a strong business sense in addition to project management skills. If you are curious about the details, driven to achieve, and passionate about the product, we would love to hear from you!", "description": "The Business & Education EPM will work closely with several Engineering leaders to drive key initiatives. They will: Partner with multiple Engineering leads to drive cross functional programs through delivery; inclusive of timelines, planning, requirements, and dependencies. Manage risks, mitigations, and drive alignment across the organization and between teams Provide clear, timely and objective communication, including regular program status updates and critical issues as needed to executive team Coordinate discussions and break down complex issues into discussion topics to drive engineering and design alignment with support from project team, maintaining an orientation toward teamwork and collaboration Proactively identify issues and solutions, and mobilize resources necessary to attack and resolve. Coordinate with teams to identify issues, prioritize tasks and track risks to schedule and product quality, including cross-functional dependencies", "key_qualifications": "5+ years of experience in Program / Project management successfully leading highly cross-functional software development; Experience leading large programs; from requirements gathering collaboration with product and design teams, through software development and release qualification while maintaining a high bar for quality. Have personally orchestrated the delivery of multiple significant client/server software products, under demanding timelines, managing multiple work streams cross functionally across a large organization Previous experience building customer facing products / services with foundational understanding of the technical details Exceptional verbal and written communication skills with the ability to filter and distill relevant information for the right audience Strong analytical thinking, analysis, and problem-solving skills Ability to communicate abstract ideas clearly and independently manage complex project objectives", "preferred_qualifications": "", "education_experience": "BS/MS/PhD CS/CE/EE or equivalent Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551782"}