{"title": "Engineering Project Manager (SAP Functional support and Upgrade Lead), Enterprise Systems", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work! Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that encourages the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "In this role you will have dual responsibility. You will be handling support delivery in a SAP functional area including leading a vendor team, driving SLA metrics, establishing relationship with business partners, drive system / process initiatives to improve efficiency and productivity. Identify trends for issues and implement solutions by performing root cause analysis. You will need to have a solid aptitude to solve support issues and experience to design and configure solutions in the functional area. As an upgrade lead be responsible for the planning, monitoring, driving efficiency and control of SAP upgrades. We are looking for a self-motivated, driven individual who is comfortable working in a global, fast-paced environment and has experience with agile method of working.", "key_qualifications": "", "preferred_qualifications": "Strong aptitude to do hands-on to troubleshoot production support issues, Excellent verbal and written communication skills across all levels of the organization, Excellent problem-solving skills and the ability to drive issue resolution across teams, Experience in partnering with vendor teams both onsite and offshore, Self-motivated, detail-oriented, and sensitive to established schedules and scopes, Ability to establish & manage relationships with various business stakeholders, Ability to understand ABAP code to aid troubleshooting, Hands on experience on S/4 HANA will be a significant plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558412"}