{"title": "Facilities Operations Center Operator, Data Center", "summary": "At Apple, we embrace diversity, continuously strive for excellence, and thrive in an environment of innovation and collaboration. We are seeking a Data Center Critical “Facilities Operations Center” (FOC) operator, that is committed to working in a mission-critical environment that values continuous improvement and adopts change!", "description": "The FOC monitors are the navigators and report technicians for the building systems (EPMS, BMS and FLS controls systems). The FOC monitors are relied on to monitor all buildings and the sites critical reporting systems. In this role, you will address sophisticated topics that craft how we operate and respond to our facilities This position also requires escalation of incidents and risk level maintenance issues. Responsibilities Monitors all controls systems, including, but not limited too, EPMS, BMS, Fire Systems, Generator Systems, Battery Monitoring, etc. Updates all logs used in FOC. Example: Daily Activities Report (DAR), Normal Change of State, Shift Turnover, etc. Provide daily updates during the turnover meetings on outstanding issues identified in the DAR, Normal Change of State, or any other platform used to track deficiencies or outstanding issues. Collaborate cross functionally with teams as well as vendors and suppliers to achieve goals. Understands the status of all critical system at all times. Assists with controls system manipulation with approval from the Senior Facilities Operations Center Operator and/or onsite supervision. Escalation process lead until relieved by management. Requires understanding and training of the escalation process. Note: Critical Facilities operations monitors work 12 hours per day on a rotating shift schedule including graveyard, weekend and holiday shifts and may work overtime depending on business needs.", "key_qualifications": "", "preferred_qualifications": "Experience and skills necessary to cross collaborate with multiple disciplines to assess and address high priority alarms and actively pursue risk mitigation. Verifiable and detail knowledge of mechanical, Electrical, and fire life safety systems. Planning, analytical, organization and problem solving skills. Comfortable with rapid change, and daring deadlines common to rapidly growing companies with evolving business models. Assists with controls system manipulation with approval from the Senior Facilities Operations Center Operator and/or onsite supervision. 4+ years of related experience in a critical environment. Knowledge of safety procedures, established techniques, and equipment Excellent verbal and written communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557699"}