{"title": "SoC Performance Validation Engineer, Platform Architecture", "summary": "In this role, you will be a member of the Platform Architecture team, working within the hardware technology group to shape the architecture of Apple's future System-on-Chips (SoC). We are seeking an upbeat and highly motivated SOC performance engineer to drive the architectural validation and design correlation of our software-based performance model.", "description": "You will help define the comprehensive performance test plan, systematic test methodology, and develop novel infrastructure for the software simulator for iPhone/iPad/Mac/Watch SoCs. The team pushes the system to its limits to help find and fix architectural and micro-architectural issues. Your data shall contribute to product performance and power trade-off decisions in our SoCs. This role will be highly visible and critical for driving architecture improvements in Apple’s future products.\n\nYour responsibilities will include:\n\n-  Learning about the state of the art in SoC IP and chip-level architecture\n\n-  Defining test plans and test planning methodology\n\n-  Definition and implementation of validation infrastructure like performance monitors, behavioral checkers, state space coverage\n\n-  Working on data analysis pipelines, visualization methodologies, continuous regression testing\n\n-  Running performance simulation of future applications\n\n-  Careful analysis and presentation of simulation results\n\n-  Tuning and validating future SoC HW/SW for the best user experience\n\n-  Interface and collaboration with cross-functional teams: architecture, hardware and software teams for collaborative debug, and correlation studies", "key_qualifications": "Knowledge of computer architecture\nPractical experience with data structures and algorithms\nUnderstanding of software engineering principles\nSolid programming skills in C, C++ or equivalent languages\nExperience with scripting languages like Python, Perl, Lua, Bash\nAbility to study a problem in depth, design experiments, analyze data, and present results", "preferred_qualifications": "", "education_experience": "Minimum requirement of a Bachelor's degree. MS or PhD in CS, EE, or related field preferred", "additional_requirements": "Preferred Qualifications:\n- Significant architectural research or embedded systems projects\n- Experience with micro-architectural performance modeling and architectural exploration\n- Experience with architectural, micro-architectural validation and performance correlation\n- Experience with on-chip interconnect fabrics, caches, and memory/DRAM controllers, quality-of-service architecture", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518864"}