{"title": "AppleCare Training Instructional Designer", "summary": "At Apple, we believe a fun and inclusive work environment where creativity and innovation thrive starts with hiring dedicated people from a diverse set of backgrounds that can approach problems with varying perspectives. Are you passionate about workplace learning and training development? Can you quickly and optimally identify learning needs and build instructionally-sound training materials to meet those needs? If so, keep reading. The AppleCare Training Development organization is responsible for developing training solutions for AppleCare Support Advisors. The AppleCare Training Instructional Designer works with business partners to identify training needs and build instructor-led, virtual, and self-paced training that uses innovative solutions. At Apple, we’re never satisfied with “good enough”; you will be challenged to continually improve the Advisor training experience through relevant activities, authoring measurable learning objectives, and developing materials that promote learning transfer, retention, and application. You’ll work under tight deadlines with minimal supervision in an environment where quality, creativity, and accountability are tradition.", "description": "In this role, you will design, develop, and maintain classroom, virtual classroom, and self-paced training content using traditional instructional design and rapid development strategies. Key responsibilities of this role include: Working with business partners to conduct training needs analyses Designing learning objectives following Bloom’s Taxonomy Building experiential activities appropriate for the targeted audience Working closely with subject matter experts to craft, revise, and maintain training content; eventually gaining and maintaining subject matter expertise vital for developing comprehensive, accurate content Developing valid assessment questions that correlate to learning objectives Assisting with question vetting and updating Participating in projects that further team innovation, technology integration, process improvement, and collaboration", "key_qualifications": " ", "preferred_qualifications": "Call center or customer service exposure and experience, Experience crafting learning content for global adult audiences, Experience with project management, Experience as a solo or lead content developer on instructional design projects, Proficiency with Apple operating systems, such as macOS, iOS, iPadOS, Proficiency with Apple software applications including Pages and Keynote, 5+ years of instructional design project experience, Master's degree in a related field", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $99,700 and $150,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560175"}