{"title": "Software Engineering Program Manager, Core OS Power & Performance", "summary": "Apple’s Core OS group is committed to building fully integrated operating systems that combine hardware, software, and apps into a polished Apple experience! The Power & Performance EPM team is looking for an experienced Engineering Program Manager to lead highly cross-functional efforts delivering exceptional user experience across all Apple platforms.", "description": "In this role you will be the central hub driving proactive engagement with feature development teams with the goal of delivering best in class performance & power across our operating systems. You will be responsible for collating and presenting key metrics at exec reviews to help drive critical decisions for our operating systems. You will be in the forefront of conversations with teams to prioritize power & performance asks and drive resolution for OS regressions.", "key_qualifications": "5+ years of program management experience in software, hardware or silicon development. Excellent spoken and concise written communication. Ability to build relationships and influence others. Strong understanding of and experience in managing complex, multi-functional software programs. Sound technical foundation and a highly motivated self-starter.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees can also become an Apple shareholder through participation in Apple’s discretionary employee stock programs. They are eligible for discretionary restricted stock unit awards, can purchase Apple stock at a discount if voluntarily participating in the Employee Stock Purchase Plan, and receive benefits including comprehensive medical and dental coverage, retirement benefits, discounts on products and free services, and reimbursement for certain educational expenses including tuition. The role might also be eligible for bonuses, commission payments, and relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512623"}