{"title": "Sr. Machine Learning Engineer - ML Platform & Technology (MLPT)", "summary": "Join us in enabling the next generation of intelligent experiences in Apple’s products and services with the latest advancements in Generative AI and Large Language Models! We are looking for a very experienced, machine learning engineer, who has also worked in ML infrastructure. Ideally, you should have experience with shipping intelligent features, end-to-end, and from idea to production. You should also have experience in building ML infrastructure to enable others to iterate faster and expertise in certain ML domains (preferably in Gen AI and LLM). You will help find novel solutions for our ML problems and collaborate with all ML teams at Apple to optimize our platform. Are you ready to impact billions of our users?", "description": "You'll be part of Apple’s internal Machine Learning Platform group that enables ML teams to iterate their projects faster, from: data engineering, labeling, training, online and offline evaluation, experimentation and more. Bring your expertise to help us define and build the next set of features (given the new challenges in the latest advancement of generative AI and large language models). You will also partner closely with our customer and other internal partner ML teams cross the company to help further adopt and apply our platform, gain feedback and iterate our products (services, SDK and web UI) to be more user friendly and scalable.", "key_qualifications": "A minimum of 3 years as tech lead, 8 years of proven experience in machine learning related software engineering, such as: product, infrastructure, frameworks or tools, Strong expertise in machine learning domains, such as: CV, NLP, recommender systems, Gen AI or LLMs (preferred), Proficient in ML training and deployment frameworks, like: Tensorflow, PyTorch, Faster Transformer, TensorRT, vLLM, Proficient in cloud computing and data processing infrastructure and tools: Kubernetes, Ray, PySpark, SQL, Ability to clearly and concisely communicate technical and architectural problems, while working with partners to iteratively find solutions", "preferred_qualifications": "", "education_experience": "Bachelors in Computer Science, related field or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519567"}