{"title": "Custom Silicon Applications Engineer - Camera Hardware", "summary": "Do you love taking on big challenges that require exceptionally creative solutions? Do you deeply understand how an incredible camera experience should work? As part of our Camera Technologies group, you’ll help design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems, from sensor to lens. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras. The Camera Hardware Engineering group is responsible for the design, development, and innovation of camera hardware for all related Apple products. Our target is to deliver superior camera hardware to enable best-in-class camera user experience. We are looking for an enthusiastic, high energy individual who can help us with tomorrow’s challenges.", "description": "In this role, you will be working with cross-functional teams including mechanical, optical, firmware, product/test and camera systems engineers to evaluate performance specifications. You will understand how complex system architectures translate to electrical and IC requirements. With a desire to “break things”, you will: - Work at the boundary of vendor requirements to search for incorrect implementations. - Develop and execute on plans for validation and debugging, and then complete data analysis to draw conclusions. - Developing software including scripts, firmware, and RTL for laboratory data acquisition, control systems, silicon validation, and prototyping. - Design and debug circuits and PCBs for validating, characterizing, and prototyping camera HW chipsets.", "key_qualifications": "", "preferred_qualifications": "Experience with low-level programming and debug for embedded development (C/C++) and/or RTL for FPGA platforms. PCB design and debug for drivers, converters, PMUs or high speed amplifier IC evaluation boards, including circuit design, schematic capture, layout and component selection. Sharp problem-solving skills and critical thinking. Strong commitment to going above and beyond to get work done at the highest quality. Strong written and verbal communication and presentation skills. MS in Electrical and Computer Engineering. Some travel may be required.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556668"}