{"title": "Engineering Program Manager (Hanoi)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Engineering Program Management (EPM) group is a growing, high energy, results oriented team. The Engineering Program Engineer/Manager role at Apple is both challenging and demanding. This role works with both in-region and US based Engineering Project Managers, Hardware Engineering, Product Design, Software teams and CM partners to handle risks associated with Engineering Development builds. As an Engineering Program Engineer/Manager in the New Technology organisation, you will be responsible for leading the development builds of key modules (Display, Camera, Touch ID, etc.). Your goals are to ensure that modules are built according to specifications, and given timeline.", "description": "In this role, you will lead multi-functional communication between Apple Internal project teams and external vendors. Work with Engineering Management and Vendors to define plan, track, communicate and call out as appropriate. Provide timely issue resolution and critical path management. Drive day-to-day Engineering build activities, at vendor’s factory, to meet overall program objectives.", "key_qualifications": "", "preferred_qualifications": "Knowledge in Display or Camera design will be an added advantage.", "education_experience": "Degree/Master in Electrical, Electronic, Mechanical Engineering or equivalent. More than 2 years of experience as a Project Manager. Extraordinary leadership and excellent interpersonal skills. Able to collaborate with multi-functional team to achieve project goals. Knowledge of the Hardware development process. Operations experience in a manufacturing environment. English Fluency a must for both written and spoken. Self-motivated and proactive in managing multi tasks under critical situation", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554758"}