{"title": "AIML - Machine Learning SW/HW Co-Design Engineer, Machine Learning Platform & Infrastructure", "summary": "Machine Learning and Platforms (MLPT) team is in Apple’s AIML Org. MLPT's On-device machine learning (ML) team builds the inference stack that runs all ML networks on Apple Silicon. In this team, we write the converter and compiler that translate a source network definition to one that execution units in hardware can interpret. We write tools for network optimizations, write the runtime that schedules and manages the execution on hardware as well as provide guidance for hardware/software co-design of current and future workloads alongside hardware accelerators. The team works cross-functionally with several partner teams inside Apple (such as CPU, GPU, Neural Engine, speech understanding, Camera, Photos, VisionPro) as well as external App-Developers. Core ML is an example of an external facing product from this team. If this role sounds exciting, we want to hear from you!", "description": "Machine Learning and Platforms Technology (MLPT) team is in Apple’s AIML Org. MLPT's On-device machine learning (ML) team builds the inference stack that runs all ML networks on Apple Silicon. In this team, we write the converter and compiler that translate a source network definition to one that execution units in hardware can interpret. We write tools for network optimizations, write the runtime that schedules and manages the execution on hardware as well as provide guidance for hardware/software co-design of current and future workloads alongside hardware accelerators. The team works cross-functionally with several partner teams inside Apple (such as CPU, GPU, Neural Engine, speech understanding, Camera, Photos, VisionPro) as well as external App-Developers. Core ML is an example of an external facing product from this team. In this role you’ll be digging into the latest research about efficient on device inference. You’ll prototype new approaches to improve inference on critical models without sacrificing accuracy. You’ll do deep dive analysis of both our software stack as well as our hardware and come up with innovative ways to improve. You’ll also look at ML inference performance across a range of devices from small wearables up to the largest Apple Silicon Macs.", "key_qualifications": "Understand the basics of ML, keeping up with innovative research in some area of ML, and are familiar with adapting and training neural networks — experience developing code in one or more of training frameworks (such as PyTorch, TensorFlow or JAX); Have knowledge of computer architecture (CPU and GPU), understand performance modeling and analysis of computer systems, and how to optimize code for a given platform; Have experience with ML systems, particularly for on-device inference scenarios; Know how to perform comprehensive analyses (for performance, power, accuracy, etc.) starting from first principles of various deep learning techniques and benchmarking to test/prove ideas; system optimizations including building out analytical models as well as implementing prototypes; Have a passion for software architecture, APIs and high performance extensible software; Programming and software design skills (proficiency in C/C++ and/or Python); Are collaborative and product-focused with excellent communication skills", "preferred_qualifications": "", "education_experience": "Masters or PhD or equivalent experience in relevant discipline (CS, CS&E, CE)", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543514"}