{"title": "Software Engineering Manager, Automation Frameworks", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. The Wireless Frameworks and Services team is looking for a highly motivated and hardworking Engineering Manager to help lead a team of engineers to develop and maintain automation frameworks across all Apple platforms. (i.e Apple Watch, Apple TV, AirPods, iOS and macOS) The candidate should have excellent leadership skills, value an iterative approach to problem solving and possess solid communication skills.", "description": "Our team creates frameworks, services and testing tools to aid in Wireless testing across all Apple platforms. We also contribute to core operating system frameworks and maintain/develop shared python and obj-c frameworks and modules. Your responsibilities will include; Leading a team of framework developers to design and maintain automation frameworks, serve as a mentor to entry level engineers, bring up a development team and help to define its charter it terms of tool delivery , structure and day to day deliverables.", "key_qualifications": " ", "preferred_qualifications": "Confirmed understanding of statistics as it relates to data analysis is a plus. Experience with Continuous Integration systems like xCode Server, Jenkins etc.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555307"}