{"title": "Emulation Verification Engineer", "summary": "Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our Emulation team focusing on the creation, deployment, and support of advanced emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines. Imagine what you could do at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Are you ready to help us deliver the next groundbreaking Apple products?", "description": "As a member of Emulation verification team, you will play a key role in utilizing Emulation for verification of large Wireless SoCs. The overall work will involve porting the design onto the Palladium platform, followed by executing the detailed Emulation testplan. Core Responsibilities: • Bringing up the emulation platform for large Wireless SoCs • Developing monitors and checkers for Emulation platform and come up with latest techniques to achieve better performance • Preparing and executing the test plan and performing reviews with the cross functional teams • Collaborating cross functionally with Design, Architecture, Power, Silicon Validation, Performance and SW Teams • Developing code for Design and verification that aids with emulation activities, using Verilog/System Verilog/UVM", "key_qualifications": "3+ years of experience with bring up, debugging and verification in Emulation • Understanding of the tool flow from RTL to Emulation is a plus • Some understanding of a Standard Emulator (Palladium, Veloce, Zebu) OR FPGA (Xilinx, Altera) flow • Proven design verification skills • Experience in writing Synthesize-able SystemVerilog/Verilog code and SystemVerilog assertions • Experience with System Verilog verification environments including C/C++ DPI, UVM • Experience on any Scripting (Perl/Python/TCL) • Excellent analytical and debug skills • Excellent oral and written English skills • Experience in UVM Acceleration is a plus", "preferred_qualifications": "", "education_experience": "B.Sc / M.Sc in Electrical or Computer Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200502607"}