{"title": "System Platform Engineer, Infrastructure Services", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. One of the missions of our Data Center Engineering Team is to collaborate in the analysis, development, and optimization of the IT and Data Center Infrastructure utilization. We are looking for a team oriented, logical mindset, forward-thinking, self-confident, experienced Systems Platform Engineer to join our team.", "description": "Analyze and document current data center information and IT control architectures and processes. Collaborate to propose changes to existing architectures, processes and new architectures across multiple Apple team. Analyze, develop, and optimize data center infrastructure and IT device utilization. Correlate lab results to field power and thermal data driving feedback and incremental improvements. Develop algorithms processes and dashboards to trend continuous improvement to data center infrastructure utilization. Produce data visualizations, dashboards, and reports.", "key_qualifications": "Genuine curiosity and a strong sense of ownership\nStrong engineering fundamentals; ability to visualize and document from details to the big picture; ability to lead to propose and inspire changes in processes\nExperience in data center infrastructure management, IT management and able to document existing and future architectures\nKnowledge of asset management tools, DCIM tools, EPMS, and BMS.\nExposure to methods of data center Software Defined Network architecture or platform with infrastructure control\nUnderstanding of data center infrastructure, power, cooling and security architectures, operation and telemetry/data\nFamiliarity with three phase power, power calculations and cooling terminology and calculations\nAbility to lead cross-functional team members and get results on assigned initiatives\nProficient analytical skills, using data analysis and problem-solving methods; experience in data-driven approach to evaluating tradeoffs\nAbility to mine data from multiple sources, develop algorithms, and perform rigorous statistical analysis to extract trends and other insights from data.\nPrior experience with at least one coding/scripting language (Python, Matlab, C, C++)\nUnderstanding of communication protocols: SNMP, SSH, HTTPS, and others\nKnowledge of SQL and Tableau is preferred\nProven track record of improving and validating end to end overall system operation and performance\nExcellent written and verbal communication skills; ability to clearly communicate and illustrate technical proposals, ideas, and issues at an executive level", "preferred_qualifications": "", "education_experience": "Bachelor of Science in Engineering or greater, plus min of 7 years of technical work experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552812"}