{"title": "PMU Analog Layout Designer", "summary": "The PMU team is looking for qualified, motivated layout engineers from a variety of skill levels. We are a fast-growing and highly diverse group...", "description": "You will be responsible to deliver PDV clean layout, this includes the following: Working with circuit design team to plan/schedule work and negotiate any necessary layout trade-offs as needed to build complex analog layout in deep SubMicron CMOS technologies...", "key_qualifications": "", "preferred_qualifications": "Relevant experience in analog/mixed-signal layout design of SubMicron CMOS circuits. Experience building tight matching, low capacitance, low power analog blocks, resistors, capacitors, high voltage devices, pad IOs, ESD structures, etc. Experience with custom and standard cell based floor planning and hierarchical layout assembly. Understanding of IR drop, RC delay, electro-migration, self-heating and cross capacitance. Looking for relevant experience with analog and DFM practices. Experience in PMU and chip level layout is highly preferred. Scripting experience in PERL or SKILL CODE is considered a plus...", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $38.45 and $66.00/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558357"}