{"title": "Computer Vision/Machine Learning Engineer", "summary": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. We're looking for highly self-motivated and enthusiastic individual with expertise in machine learning and computer vision to join our team to develop new technologies for Apple’s next generation products.", "description": "As a CVML engineer, you will develop new technologies for Apple’s next generation products. The focus will be innovating and delivering effective, efficient and well-tested computer vision based solutions from prototyping to shipping that are often deployed on edge devices. Beside domain expertise and technical knowledge the ideal candidate will possess the self-motivation, curiosity, and initiative to achieve those goals. Analogously, the candidate is a lifelong learner who passionately seeks to improve themselves and the quality of their work. You will work together with similar minds in a unique team where your skills and expertise can be used to influence future user experiences and hardware that will be used by millions.", "key_qualifications": "Solid background in ML and deep learning with expertise in computer vision\nStrong coding skills in Python or C++ and experience in modern deep learning modeling and development using ML frameworks such as Tensorflow and PyTorch\nExcellent communication and collaboration skills\nCreativity and curiosity for solving highly complex problems\nExperience in biometrics/face tracking/gaze tracking (preferred)", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551080"}