{"title": "Cellular RF Transmitter Systems Engineer", "summary": "Imagine what you could do here! At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We invite you to join our dynamic group, for the outstanding and great opportunity to contribute to upcoming products that will delight and encourage millions of Apple’s customers every day. Apple's RF systems engineering team is looking for a passionate, independent engineer with a proven track record in the field of cellular RF transmitter systems engineering. Our world-class team crafts the mobile market with innovative concepts while being fully accountable for execution and commitments on timeline and quality. Join our team of leading experts in cellular RF industry and deliver differentiating transmit architectures and solutions for Apple’s cellular products that builds amazing benefits for our customers!", "description": "In this role, you will be part of a best-in-class cellular systems engineering team. You will work closely with other teams like RX teams, PLL teams, architecture teams and RF design teams. You will define the architecture and implementation of cellular transmitters under real-life conditions and clear differentiation from other solutions. • Drive concept work, HW/SW specifications, simulation and reference model creation, cross-functional collaboration while meeting timeline and quality requirements. • Translate system level- and performance requirements into requirements for TX line-up and TX features. • Identify and analyze critical requirements and provide deep dive assessments with respect to critical metric impact, timeline, and risks. • Solve complex and interdisciplinary problems that are related to the transmit system and TX features. • Provide specifications as input for the HW and SW development.", "key_qualifications": "We would like you to have proven expertise and first-hand experience in architectures, concepts, design, and simulation of cellular transmitters. Your technical profile shall cover several of the following areas of knowledge and experience: • Proven expertise in analyzing transmit chains from RF – baseband (BB) interface to antenna and in translating top level requirements into specification items for transmitter building blocks and RF components (e.g., PA, filter, switches). • Solid knowledge of Cellular Radio/3GPP standards (LTE, 5G NR) which includes the RF aspects, physical layer procedures as well as system use cases and TX waveforms. • As a plus background in RF IC programming and interop topics between BB IC and RF IC. • As a plus background in line-up simulations and TX performance analysis. • Self-confident appearance and the ability to convincingly present and enforce complex technical topics in senior management read-outs and technical discussions with senior experts from other teams. • Excellent written, verbal communication and presentation skills. • BS and a minimum of 10 years of relevant industry experience.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533803"}