{"title": "Integration Engineer, Enterprise Technology Services", "summary": "At Apple, we rely on our employees diverse set of backgrounds and perspectives to champion innovation through extraordinary ideas to surprise and delight our customers. These ideas can come from anywhere. Will that next phenomenal idea come from you? Apple E-Business Services team is seeking an outstanding hands-on Integration Software Engineer with passion for developing highly scalable integrations with the external Partners. This is an excellent opportunity for a self motivated, enthusiastic, results oriented person to design and build critical integrations which enable Apple business. Enjoy the benefits of working in a fast growing business where you are encouraged to “Think Different” and where your efforts play a key role in the success of Apple’s business.", "description": "Apple eBusiness Services team is seeking an outstanding B2B Integration Software Engineer to implement innovative and scalable integration solutions. This is an excellent opportunity for a self motivated, enthusiastic, result oriented person to provide solutions using various integration technology stacks. If you want to be a part of this amazing team, this position is for you. Dynamic, hard-working people and inspiring, innovative technologies are the norms here.", "key_qualifications": "", "preferred_qualifications": "3+ years IT experience\nHands on experience in working with partners and business teams defining integration mechanisms like EDI X12, EDIFACT, APIs, REST/SOAP Web-Services and Flat Files.\nExperience in handling sensitive customer data like PII, SSN and other sensitive PCI and SOX data\nDeep understanding of different partner types in the Supply chain domain and their business processes\nProven ability to manage projects with on-time delivery.\nDemonstrated capability to look beyond the curve and add value to business teams.\nFamiliarity and implementation knowledge of cloud technologies.\nInsight & creativity to see around corners and to design systems in order to mitigate future risk\nWorking experience in middleware suite of products similar to Software-AG product suite like Web-Methods Integration Server, Trading Networks, Designer, Developer, My Web-Methods.\nGood functional knowledge in SAP function modules, HANA and SAP Cloud platforms.\nAI / ML implementation experience is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557126"}