{"title": "Touch ASIC Architect (Analog)", "summary": "Design, develop, and launch next-generation Touch Technologies in Apple products! The Touch Technology team develops ground breaking Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more! The key goal of our team is to enable the world’s best multi-touch user-experience.", "description": "You will be architecting Touch sensing systems and the ASICs required to realize them. You will also be expected to take high level user requirements and create a realizable system that meets these goals. This will include high level modeling of proposed solutions, along with creating detailed specifications of the requirements. Responsibilities include creating Touch sensor system architectures, developing high performance, low power signal processing and sensing architectures, authoring detailed specifications, analyses, and characterization plans for touch system ASICs, performing modeling of the system and ASIC using high level tools, optimizing designs across multiple disciplines, contributing technical assessments to strategic decision-making.", "key_qualifications": "Experience developing and launching high volume IC designs, Strong electrical engineering background in analog circuit design; exposure to signal processing, mixed-signal design, filter design, and/or embedded system design is a plus, Experience in system-level design, requirements documentation, and IC micro-architecture definition of complex mixed-signal ASICs, Experience with IC bring-up and debug, Proficiency in MATLAB, Verilog, or similar simulation, design & modeling tools, Excellent written and verbal communication skills, Direct experience with touch technology and/or flat panel display technology is beneficial", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534543"}