{"title": "AIML - Sr Engineering Program Manager, Machine Learning FM", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger.", "description": "Specific Responsibilities Include:\n-  Lead high profile Foundation Model programs, responsible for roadmapping, establishing goals with DRIs and reporting statuses to executives regularly and succinctly\n-  Drive consensus across multiple groups with varying opinions & needs. Influence entire teams around a common purpose and drive conference on the plan of execution\n-  Create and manage project schedules with clear dependencies, critical path and systematic methodology to communicate status\n-  Proactively identify and manage risks, close gaps with the ability to switch gears on projects in an agile manner\n-  Keep teams on critical path with efforts to minimize distractions\n-  Provide clear, timely and objective communication, including regular program status updates and one-off reviews as needed to executive team\n-  Keep an eye on any potential gaps across dependency teams and proactively promote regular communications on common source of truth\n-  Proactive and regular insurance of alignments across all stakeholder teams when new factors arise\n-  Plan yearly and quarterly budgets for data acquisition\n-  Maintain awareness of the Privacy and Legal aspects of data management and regional regulations, ensuring the team is meeting company-wide requirements", "key_qualifications": "5+ years of experience in program management, particularly in the data acquisition of ML technologies, international locales experience is a plus.", "preferred_qualifications": "Prior PM or engineering experience in search, speech recognition, natural language understanding, data pipelines is a plus\nExperience with international locales experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556772"}