{"title": "Health Software Engineer: Server - Clinical Health Platform", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly, and making the kind of impact that changes people's lives. The Apple Health Software team embodies the core Apple values around delighting our customers with groundbreaking user experiences, empowering users to live a better - and healthier - life, while keeping their data safe, private, and secure. Our team needs your help shaping the next generation of health-related experiences by working on the underlying technologies for data ingestion, modeling, and reasoning. You'll have the opportunities to work with world class physicians, designers, and engineers to help innovate in the healthcare space in ways that only Apple can. You will contribute to current and future Apple Health features such as Medication Tracking and Clinical Health Records.", "description": "In this role, you will:\n-Work with data at scale, designing and delivering knowledge graph resources for various health domains\n-Ensure interoperability and scalability for the backend that supports Apple Health features\n-Contribute to the development of tools and frameworks that support the extraction, transformation, and loading (ETL) processes for graph construction. \n-Ensure data quality and integrity within the graphs by implementing robust testing and validation processes. \n-Collaborate with a diverse team of clinicians, data analysts, iOS engineers, and quality engineers to deliver user facing features.", "key_qualifications": "", "preferred_qualifications": "Value a diverse and inclusive work environment, Demonstrated ability to work with a large cross-functional teams, Excellent judgment and integrity with the ability to make timely and sound decisions, Ability to stay focused and prioritize a heavy workload while achieving extraordinary quality, Strong interest and background in Health and Wellness topics., Open to learn front end coding", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560037"}