{"title": "Display Electrical Engineer", "summary": "The Display Hardware team is looking for a talented Electrical Engineer to lead the development and validation across a variety of Apple products. You will work in a reciprocal environment where creativity and innovation are supported and expected. Join us and be part of dynamic and exciting team that builds and integrates new technologies into Apple’s products.", "description": "- Design and capture PCB level schematic & layout for prototyping and test platforms - Lead electrical characterization / validation from prototype through mass production - Perform failure analysis on electrical, mechanical and optical issues - Run simulations to meet various requirements such as display, power, SI, EMC, and graphics - Handle EE project tasks and issues along with cross functional teams", "key_qualifications": "- 10+ years significant proven experience crafting consumer electronics and/or embedded systems - Must have strong EE fundamentals (analog/digital design, signal/power integrity, etc.) - Should demonstrate strong verbal and written communications - Experience in a lab environment prototyping circuits, design bring-up,plus hands-on with oscilloscopes, spectrum analyzers, DAQ, et - Experience in Scripting or test automation; experience with simulation tools such as Matlab, Python, - Should have experience leading high volume products from concept to mass production - Experience with leading PCB technology and electrical design and characterization of the following areas: Differential serial links (e.g.LPDP, MIPI) and I2C/SPI/UART buses. - Experience in one or more of: MCU/CPLD, power (DC-DC converters, power management, low power design), analog circuits,display technology, and system integration. - Expertise in board CAD tools including Cadence Concept & Allegro - Experience in modeling power consumption for various usage - Experience in predicting hardware performance by simulation - Experience in capacitive multi-touch preferred - Strong experience is cross functional collaboration to resolve problems", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541665"}