{"title": "AIML - Sr. Machine Learning Engineer, Search Language Understanding - Siri & Information Intelligence (SII)", "summary": "We are looking for a senior engineer with a passion for using machine learning to create intelligent search applications. Our team researches new machine learning algorithms, models and techniques that will power amazing search experiences across Apple products. We are looking for new ambitious team leader to join our ML group. This role will have the opportunity to initiate and lead exciting projects to further the state of language understanding at Apple, and use data science, machine learning and analytical skills to solve challenging technical problems and ship novel products that will delight millions of people.", "description": "This role will have the opportunity to design and evaluate new algorithms, models and methods that will impact Apple and the broad ML community. Role responsibilities include: Researching, proposing and leading innovative language modeling techniques to further language understanding capabilities at Apple. Building novel applications of LLMs to various search problems. Develop a long-term technical vision; propose a roadmap for team setting clear objections. Analyzing the loss patterns in the current search and assistant stack and coming up with new ideas, algorithms and techniques to resolve those losses with the goal of improving the top-line product metrics. Collaborating with various product collaborators across the company and partner with them to apply language understanding models to new product areas and use cases. Work on continuously improving the metrics and performance of models the team has launched in production by leverage state-of-the-art ML techniques.", "key_qualifications": "7+ year Experience in Search, Machine Learning, NLP, Large Language Models and applying these techniques at scale. Strong software engineering skills in a mainstream programming language, such as Python, Go, C/C++. Familiarity with NLP/ML tools and packages like Jax, TensorFlow, pyTorch etc. Practical experience building production quality applications related to natural language processing and machine learning. In-depth knowledge of machine learning algorithms and ability to apply them in data driven natural language processing systems. Ability to quickly prototype ideas / solutions, perform critical analysis, and use creative approaches for solving complex problems. Ability to collaborate closely with multi-functional teams. Clear oral and written communication skill.", "preferred_qualifications": "", "education_experience": "PhD/Masters in Machine learning or a related related field with a strong academic track record", "additional_requirements": "- Experience working in a complex organization with multiple collaborators, strong track record in scaling and launching projects in this setting.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546464"}