{"title": "Computer Vision Data Scientist", "summary": "Do you have a passion for computer vision and deep learning problems? We are looking for someone who thrives on collaboration and wants to push the boundaries of what is possible today! The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. Our data scientist will work closely with other members of the Video Computer Vision org to implement model evaluation pipeline, analyze large scale data to help influence product decision and improve product quality. This position will require strong analytical and coding skills, presentation skills, and collaborating with multiple teams. You will get to work on computer vision products like FaceID and exciting future technologies.", "description": "We work on complex problems in computer vision that require robust, efficient, well tested, and clean solutions. The ideal candidate will possess the self-motivation, curiosity, and initiative to achieve those goals. You will work together with similar minds in a unique team where your skills and expertise can be used to influence future user experiences and products that will be used by millions.", "key_qualifications": "Extensive knowledge in statistical data analysis and machine learning techniques. Solid programming skills with Python for data processing and development. Experience developing data science pipelines, tool-chains, and workflows. Have a big enough toolbox to know how to find patterns in large and messy data, identify targets for performance, and identify sources of variance about those targets. Experienced with data visualization (e.g. matplotlib/ggplot/tableau). Have excellent verbal and written communications skills and experience in influencing decisions with information. You are self-motivated and curious with demonstrated creative and critical thinking capabilities and an innate drive to improve how things work. You have a high tolerance for ambiguity in a fast-paced environment. You find a way through. You anticipate. You connect and synthesize!", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549745"}