{"title": "Senior Machine Learning Engineer, Productivity Apps", "summary": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly! The Productivity Apps team—the team behind apps like Notes, Freeform, and iWork— needs your help shaping the next generation of productivity tools by working on pioneering technologies to surprise and delight our users. As a Senior Machine Learning Engineer, you will be working alongside our world-class creatives, designers, and engineers to help innovate in the productivity space in ways that only Apple can. This is a highly visible, highly impactful opportunity!", "description": "Are you ready to be an early member of a new engineering team? Join us, and you’ll build state-of-the-art models and applications, partner with cross-functional teams and deliver end-to-end features to power the next-generation tools for creators. The ideal candidate should have deep experience in machine learning, care about long term sustainable software development, and can drive features from concept all the way to delivery. This position requires a self-motivated individual with excellent interpersonal skills to effectively collaborate with all levels of the organization.", "key_qualifications": "5+ years of experience designing, implementing, evaluating, and deploying machine learning models in production environments. Experience deploying models to memory or compute constrained environments is a plus. Experience with large-scale model training and parallelization is a plus. Experience improving data quality via active learning, core set selection, etc. for images, videos, and text. Experience reading research papers and the ability to build on key ideas. Demonstrated curiosity about the frontier of deep learning including generative AI and multi-modal models. Hands-on experience with GANs, VAEs, Diffusion Models, or Transformers is a plus. Strong programming skills and hands-on experience using one of the popular deep learning toolkits like PyTorch, JAX, or TensorFlow. Strong problem-solving and communication skills.", "preferred_qualifications": "", "education_experience": "MS or PhD in Computer Science, Machine Learning or related field, and 5+ years of significant industry experience delivering products using state-of-the-art machine learning technologies.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551406"}