{"title": "High Speed Analog/Mixed-Signal IC Design Engineer", "summary": "Apple products are impacting millions of people across the globe. Our mission in Analog-Mixed/Signal group is to deliver hard IPs to Apple’s products while exceeding the highest expectations of quality, innovation and efficiency. We face great challenges as SOC/PHY design complexity and the number of projects increase within short production cycles. Those great challenges are always tackled by our amazing team members who are driven and eager to learn new skills. If you have strong fundamentals and a track record of tackling technical challenges. If you are passionate about your curiosity and eagerness to learn new skills and to maximize the value and impact of your work. If you like to be tuned to the bigger-picture while diving deeply into the details to innovate and solve problems. If you love working with people and diverse teams to accomplish great things. If you like fire-fighting when challenges occur while keeping an extraordinary team spirit. If you care about society and have demonstrated leadership skills through commitment to great causes. We are looking forward to having you join our team and help us deliver on these challenges while enjoying a great culture where you own your career.", "description": "Given your high aspirations, we expect you to apply your expertise to the development of PLL and clocking architectures and circuits for diverse applications including SoC, SerDes, CPU and Cellular applications.", "key_qualifications": "Proven track record in high-speed analog/mixed-signal architecture and circuit design and productization\nDeep understanding of PLL and clocking fundamentals and solid understanding of phase noise, jitter analysis/budgeting and loop dynamics\nDemonstrated innovation, self-learning, leadership skills, and a growth mindset throughout your career\nExcellent teamwork and productivity/scripting skills\nYou are expected to have a proven track record in one or many of the following:\n- Design of High speed PLL and clocking circuits: RO/LC oscillators, drivers, phase interpolators, dividers, TDC, DTC, and reference circuits\n- Design/debug RTL of algorithms and functions for Digital PLLs\n- Develop System Verilog models and perform behavioral simulations to investigate new clocking architectures’ performance and function", "preferred_qualifications": "", "education_experience": "BSEE with preferred 8+ years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536119"}