{"title": "Executive Assistant - Product Operations", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. This role will support the leader of Product Operations.", "description": "As the Executive Assistant supporting the leader of Product Operations you will arrange travel, manage calendaring, and coordinate meetings as well as other responsibilities as detailed below: Organizing complex domestic and international travel arrangements including passport and visa requirements Managing daily calendar, showing flexibility and problem-solving abilities to adjust or prioritize schedules based to last minute changes Coordinating meetings and calls across all levels of the organization Creating and submitting expense reports • Coordinate and support team meetings, and conferences including registration for conferences Interface with a significant number of external stakeholders General administrative duties (office supplies, equipment, department mail, and software license orders) Collaborate and assist with projects for department needs as part of a larger admin team", "key_qualifications": "Empty", "preferred_qualifications": "Excellent organization skills, acute attention to detail, ability to balance multiple tasks in a fast-paced and time-sensitive environment Complex calendar management, organizing meetings and video/conference calls, prioritizing schedule to reflect most critical matters, pro-active management and preparation for meetings, resolving conflicts and challenges and anticipating needs Ability to remain calm and effective under pressure Excellent written and verbal interpersonal skills, and a strong sense of professionalism Direct experience handling sensitive and confidential information with integrity, discretion, and upmost secrecy. Ability to influence others; handle conflict appropriately, know when to delegate issues upward and when to apply common sense Experience on-boarding new employees and training new team members Submits and manages expenses Experience with heavy file management and organization Supports activities such as office space planning, maintaining printers, IS&T support, ordering office materials and supplies Proficiency with Apple Calendar, Apple Mail, Apple Keynote, Quip, Slack, and other office systems and tools are preferred", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $48.70 and $73.10/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559895"}