{"title": "Data Engineer", "summary": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work...", "description": "-  Analyze our data model and infrastructure, spotting gaps and suggesting architectural improvements.\n-  Collaborate with engineering teams to design and support the next generation of analytics and reporting systems!\n-  Work with product and analytics teams to understand their specific data system needs.\n-  Automate and optimize existing data processing tasks, recognizing patterns and implementing solutions...\n-  Guide partners on effective use of the data warehouse platform through knowledge sharing and best practices.\n-  Comfortably work as part of a distributed team.", "key_qualifications": "Minimum 3+ years experience in Cloud Data Engineering, preferably with a background in computer science, mathematics, or a related quantitative field.\nExpertise in building Cloud Data Warehouses in Snowflake, Redshift, BigQuery or analogous architectures.\nDeep SQL expertise, data modeling, dimensional modeling and experience with data governance.\nExperience with the practical application of data warehousing concepts, methodologies, and frameworks.\nExperience using data processing tools and technologies such as Python, Spark, Talend, Informatica, SSIS or DBT\nEmbrace data platform thinking, design and develop data pipelines keeping security, scale, uptime and reliability in mind\nAble to confidently express the benefits and constraints of technology solutions to technology partners, stakeholders, and team members.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products...", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $121,909 and $214,500 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549395"}