{"title": "Sr. Software Engineer, Tools and Framework (Data) - Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy.", "description": "We are seeking a highly skilled and motivated Tools and Developer Framework Engineer to join our team. The ideal candidate will be responsible for designing, developing, implementing, and maintaining the tools and frameworks essential for our software development lifecycle. This role will play a critical part in enhancing the efficiency, productivity, and quality of our development processes.", "key_qualifications": "Ability to design and develop tools for functional integration tests, including developing mocks and managing test data libraries. Demonstrate high coding skills in Java, Groovy and Python scripting. 5+ years experience in designing and maintaining test automation tools and frameworks by upgrading across various version of JDK, AWS library versions in addition to security vulnerabilities fixes in the code. Extensive expertise in distributed data processing and storage technologies...", "preferred_qualifications": "", "education_experience": "-  Bachelor's or Master's degree in CS or related field.", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working...", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549919"}