{"title": "AIML - Sr Machine Learning Performance Engineer, Siri and Information Intelligence", "summary": "The Siri team in the AIML group at Apple is seeking an exceptional Machine Learning Engineer to lead efforts in identifying bottlenecks and optimizing our model inference stack. In this highly collaborative role, you will be at the center of multiple initiatives to accelerate and optimize LLMs and other ML models used by Siri. This position involves consulting with multiple product teams to determine the appropriate foundation model (On Device vs Server) for their use cases and to help them achieve their accuracy and performance targets. Your work will directly impact Siri's performance and efficiency, enhancing the overall user experience. You will be expected to bring innovative ideas and a problem-solving mindset to tackle the unique challenges associated with optimizing complex ML models.", "description": "As a Machine Learning Performance Engineer, you will play a critical role in ensuring the efficiency and scalability of Siri's machine learning models. You will work closely with diverse teams to diagnose performance issues and develop innovative solutions that enhance model performance. Your expertise will be pivotal in shaping the future of Siri's AI capabilities. Analyze and optimize the performance of machine learning models and systems used by Siri. Develop and implement strategies for model tuning, parameter optimization, and efficient resource usage. Conduct performance benchmarking and develop tooling and metrics to measure model performance in terms of compute, memory and latency. Collaborate with feature and product teams to consult on modeling decisions to achieve Siri performance objectives. Collaborate with hardware and software teams to integrate research findings into product implementation.", "key_qualifications": "Strong understanding or Transformer and LLM architectures. Strong understanding of Operating System, Compiler and Computer Architecture fundamentals. Expertise in optimizing software to take advantage of underlying hardware architecture. Experience in analyzing, identifying, and optimizing performance bottlenecks.", "preferred_qualifications": "Strong plus if you have expertise in optimizing model architectures for on device inference. Strong plus if you have previously worked with modeling pipeline teams in model deployment and promotion pipelines. Creative, collaborative, and product-focused. Excellent communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559472"}