{"title": "Data Platform SRE", "summary": "People at Apple don’t just build products — they craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it.", "description": "Apple Cloud Services infrastructure is planetary scale. Data Platform Site Reliability Engineering manages infrastructure and applications on bare-metal and cloud computing platforms to deliver data processing, governance, and storage for many of Apple’s global products and organizations. Our platform teams work with exabytes of data, terabytes of memory, and hundreds of thousands of jobs to enable predictable and performant data analytics enabling features in Apple Music, TV, Maps, News, and other world-class products. Ensuring all of these technologies in geographically distributed data centers and platforms work together in harmony presents unique challenges. As an SRE at Apple, you’ll need to solve problems that arise using empirical data, teamwork, and your own unique expertise. The Data Platform SRE will work directly with our partner engineering teams in an embedded SRE model, operating in unison with the developers to deliver seamless experiences for our customers. We run a mix of open source, vendor-licensed, and internally developed tools which you will use and have opportunities to improve upon. The cross-functional team collaborates to ensure we apply a consistent incident management process across all data platform services and provide user journey-based SLOs derived from exhaustive observability metrics, high-availability architecture, and automation for deployments. We think critically and strive to balance the best solution with the need to get things done for each engineering challenge we face. Good ideas are heard, and results are rewarded.", "key_qualifications": "Strong sense of ownership and integrity demonstrated through clear communication and collaboration; The ability to design, author, and release code in languages like Go, Python, or Java; Acute drive to automate manual operations and to improve them through repeated iteration; Experience working with the Linux Operating Systems environment; Experience with deploying, monitoring, managing services on Kubernetes, or similar cloud-based orchestration platform; Experience with deploying, supporting, and monitoring new and existing services, platforms, and application stacks; Excellent troubleshooting and problem-solving skills; Experience with scale testing, disaster recovery, and capacity planning", "preferred_qualifications": "Experience with security-related infrastructure including MIT Kerberos, OpenSSL, and certificate management; Proficiency with the architecture, deployment, performance tuning, and troubleshooting of open-source data analytics technologies, especially Apache Spark, Trino, and related software in a large-scale environment; Hands-on experience managing large numbers of diverse systems with configuration management or software delivery platforms (such as Puppet, Chef, Ansible, and Spinnaker)", "education_experience": "BS/MS in Computer Science or Equivalent (5+ years of software development or production operations experience in a large-scale environment)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547797"}