{"title": "Software Development Engineer - SRE", "summary": "People at Apple don’t just build products — they craft experiences our customers love and depend on. Apple Services Engineering (ASE) builds and supports the systems that make many of these daily experiences possible. If you’ve used Apple products, you’ve likely interacted with us. iCloud Services SRE teams are responsible for the systems and services that directly support those customers and their experiences. We focus on availability and automation of key services that run iCloud every minute of every day all around the world.", "description": "We are looking for an SRE with experience building and supporting machine learning (ML) infrastructure. You will apply SRE best practices to ensure the availability, reliability, and performance of our ML systems and services. You will actively engage with our development partners and product teams regularly so the ML services we well aligned with business needs.\nIf you love designing and running systems and infrastructure that will delight millions of customers this team is for you!\nResponsibilities will include:\nSupport and maintain ML services by measuring and monitoring availability, latency, and overall system health\nDeploy and support existing and new ML models and infrastructure\nProvide insights to partner stakeholders through log and telemetry analysis\nMaintaining documentation and automating manual processes where possible\nBe part of an oncall rotation providing hands-on technical expertise during service impacting events\nCollaborate with other engineers on code, infrastructure, and design reviews, and process enhancements", "key_qualifications": "Experience with large scale distributed systems, especially ML infrastructure and services including LLMs, Generative AI, and transformers\nKnowledge of core operating system principles, networking fundamentals, and systems management\nDemonstrable fluency in at least one of Java, Python, Swift, Rust or GoLang\nAwareness of key security principles including encryption, keys (types and exchange protocols)\nUnderstanding of SRE principals including monitoring, alerting, error budgets, fault analysis, and automation\nStrong sense of ownership, with a desire to communicate and collaborate with other engineers and teams\nAbility to succinctly identify and communication technical and architectural problems, while working with partners and their team to iteratively find solutions", "preferred_qualifications": "", "education_experience": "BS degree in computer science or equivalent field with 5+ years of experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528617"}