{"title": "Sr iOS/macOS Software Engineer", "summary": "There are more than two billion active Apple devices worldwide and we are striving for a billion more. Come join a small team of highly-focused engineers who are working to make that possible. As a member of our team, you will have the opportunity to work on internal applications and services that play a critical role in how Apple develops and delivers high-quality operating systems.", "description": "As an engineer on our team, you will iterate quickly to create, maintain, and improve applications that run on Apple platforms (iOS, macOS, watchOS, tvOS, and visionOS). We collaborate closely with engineering teams across Apple to deliver tools that empower the day-to-day work of tens of thousands of Apple employees. As owners of internal tools, we drive the app development lifecycle from beginning to end, investing a high level of care and attention to detail at every step. Our work requires significant interaction with our users, cross-functional partners, and leaders across Apple so the ideal candidate will excel at communication and collaboration in additional to technical skills.", "key_qualifications": "Experienced with Swift & SwiftUI (and ideally Objective-C, UIKit, AppKit), Skilled at software architecture and API design, Familiar with daemons, frameworks, and multithreading, Can investigate and debug difficult problems, Can create roadmaps and drive product vision by prioritizing excellent user experience, Passion for quality and attention to detail, Creative thinker and strong problem solver, Excellent communication and collaboration skills", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or related fields or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528269"}