{"title": "Product Manager, Siri and AI/ML", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming outstanding products, services and customer experiences very quickly. We believe that if you bring passion and dedication to your job, there's no telling what you could accomplish! We believe in the power of combining product management and product marketing together - that the best person to communicate why a product is meaningful to consumers and developers is the same person that helped drive its creation. \n\nIn this role on the Worldwide Product Marketing team we are seeking a skilled product manager for the team responsible for the product management and marketing of Siri and AI/ML. The features and changes you enable across iPhone, iPad, CarPlay, Apple Watch, Apple TV, HomePod, AirPods and Mac will positively impact hundreds of millions of people around the world and play a crucial role in the lives of our customers.", "description": "In this position you will:\n\n-  Research and synthesize technology trends, competitive trends, and user feedback to identify new product and technology opportunities \n\n-  Collaborate with software engineering and design teams to define roadmap and strategy - Negotiate and influence product trade-offs impacting schedule and usability to improve user experience and consumer differentiation \n\n-  Drive a growth strategy to delight users and drive habitual usage of Siri \n\n-  Position Siri and Apple AI/ML technologies in the competitive landscape and craft compelling messaging to encourage developer and customer adoption \n\n-  Launch new technologies and features worldwide in conjunction with marketing communications, corporate communications, events, and developer relations teams \n\n-  Serve as an ambassador for Apple tools and technologies through press briefings and customer visits", "key_qualifications": "4+ years experience having led multiple product development cycles from concept to launch\nProven record working collaboratively with engineering, design, and marketing peers\nStrong understanding of the intelligent voice assistant and AI/ML technology domains\nTechnical track record working closely with engineering/technical teams\nStrong ability to lead through influence, debate and storytelling\nExperience and ability to synthesize technologies into product communication for broad audience including customers, media, analysts, and leading industry specialists\nBest-in-class oral and written communication skills\nPress and media experience with success as a product spokesperson on a national or global level\nStrong attention to detail\nWillingness to travel\nA self-starter who is dedicated and demonstrates creative and critical thinking abilities", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529022"}