{"title": "Design Verification Engineer - Neural Engine", "summary": "At Apple, our new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly! As part of a highly hardworking team you will be at the heart of developing the next generation of Apple’s Neural Engine. You will be collaborating with all subject areas with critical impact in getting top quality products to millions of customers. We bring passion and dedication to our job and when you are a part of our team there's no telling what you could accomplish. The SoC Performance Verification is a critical job within Apple's Hardware Technology. Join this group and be responsible for crafting and building the technology that fuels Apple's devices. Together, we will enable our customers to do all the things they love with their devices.", "description": "Responsible for ensuring the pre-silicon quality of Apple’s Neural Engine. Review architecture specifications to develop comprehensive test and coverage plans. Develop the verification environment and tests to implement test plans, using Object Oriented tools, in particular SystemVerilog and UVM. Work closely with design and architecture teams to understand the functional and performance goals of the design; and work together to make the Neural Engine work under all specified circumstances. Triage and debug functional and performance issues with the Neural Engine. Lead bug tracking and coverage convergence. Stay abreast with design specs, conduct test plan reviews, develop block, subsystem and full chip tests. Have strong communication skills combined with good team-oriented approaches to lead the verification efforts in a specific area of the design. Work independently and manage deliverables to align with the project goals and support cross-functional engineering efforts.", "key_qualifications": "Basic knowledge of computer architecture and digital design. Knowledge of Verilog and Verilog simulators. Knowledge of scripting languages such as Perl. Should be a standout colleague with excellent interpersonal skills and the desire to take on diverse challenges. Experience with UVM or SystemVerilog for verification. Experience with hardware acceleration or Silicon debug. Experience with low-level programming of sophisticated computer systems in C/C++/assembly.", "preferred_qualifications": "", "education_experience": "Bachelors degree + 3 years of industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550048"}