{"title": "Sales - Enterprise & Education Channel Account Manager (Vietnam)", "summary": "The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. We are here to grow Apple’s reseller business through partnering with our reseller’s sales force. We develop strategies that enable businesses to transform the way people work. To realize this goal, we enhance relationships, develop partner capabilities and ensure execution across the businesses. We collaborate closely with internal and external partners to craft plans and programs that scale the business and adoption of the Apple ecosystem!", "description": "・Develop account plans that align Apple and the partner’s growth strategies to expand adoption of the Apple ecosystem in the Enterprise and Education segments. ・Identify new business opportunities and support them through closure. We make certain that any customer issues and/or concerns are raised and addressed. We share status, progress and facilitate sales activity across the reseller and Apple sales teams. ・Effectively complete plans by cross-functionally collaborating with Sales Operations, Finance, Legal and AppleCare. ・Lead pipeline development, forecasting, deal management, order/fulfillment and continued management. ・Through working closely with our partners, we gain their hearts and minds for Apple. We use sales programs, enablement tools, and training to develop partner capabilities. We regularly assess and communicate the strength and effectiveness of the partnership.", "key_qualifications": "No matter the audience, you are confident at presenting. You share your deep knowledge of how our hardware, software and services integrate. You bring the highest level of integrity, honesty, and accountability in all that you do. As a trusted advisor who does what you say you’ll do – and always does what’s best for Apple. Customer and partner needs can often be unique – but, you’re quick on your feet and connect and influence the right people both inside and outside of Apple. To ensure the most innovative ideas become a reality, you recognize perspectives, patiently listen to every detail and commit to what is right, in order to move us forward. You know yourself – you have strengths, weaknesses and opportunities - but you also know the people around you and are open to their feedback. You craft bold and breakthrough strategies that truly shape the future. You bring a tenacious attitude, especially when dealing with resistance or setbacks, and you seize every opportunity and help others to reach their goals along the way. You can adapt to change and find the right path without necessarily having all of the pieces to the puzzle. Proficiency in Vietnamese and English is preferred.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526423"}