{"title": "Firmware Engineer- Airpods", "summary": "The AirPods Firmware team is looking for an enthusiastic engineer to join our team. This is an individual contributor role to develop the technical development of the audio platform for our products. You will have the opportunity to drive the technology and product development for Apple's consumer audio products. In this role, you will work with a wide cross-functional team to continually innovate technology implemented in Apple products.", "description": "This is a high visibility role that involves architecting and developing our audio platform. This platform is a key technology that integrates and manages the data and system states for our products. We are seeking someone who is passionate about our products and the drive to improving the quality and innovation of our deliverables. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. Excellent communication and collaboration is a must, as you will be asked to partner with team members and other engineering teams. AREAS OF RESPONSIBILITIES: - Collaborate with marketing and cross-functional engineering teams to define product features and requirements - Design, implement, debug, and test embedded C/C++ code running on 8-bit, 16-bit, and 32-bit MCU's for Apple-branded audio products - Support electrical bring-up and debug of prototype hardware - Enable expansion of our product ecosystem features through creation of test tools", "key_qualifications": "5+ years of proven excellence in firmware, device driver, or equivalent experience Experience with MCUs, peripherals, features, and development environments Solid C/C++ coding abilities Familiarity with real-time audio (sample rates, buffering, I2S, PCM, drivers) Strong electrical system and software debugging skills Passion for product ownership and track record of product development Excellent written and verbal communication skills BS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "preferred_qualifications": "Knowledge of audio, DSP and Bluetooth technologies is preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556431"}