{"title": "Country Leader, KSA", "summary": "The people here at Apple don’t just create products—they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Apple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn enriches the lives of hundreds of millions of people around the world. Our sales team is, in many ways, the face of Apple to our customers. The Country Leader will be responsible to lead and manage Apple’s local business, including all routes to market (Retail, Commercial, Telco), across the breadth of the Apple product line, and will be responsible for ensuring the local organisation works as a single and collaborative team. This collaboration should create the foundation to strengthen the Apple team with the clear goal of significantly growing the business. Apple expects innovation in every part of the company, and the Sales team meets that challenge by identifying and creating new commercial models for Apple products and services. The areas of work span, but are not limited to, new business development, partner and channel management, sales, team leadership, and collaboration. This role is responsible for driving revenue growth while obsessing over the customer experience. It requires strategic thinking, a deep understanding of what it means to be the custodian of a brand and a real passion for being a market leader.", "description": "Build and lead an experienced sales team through organising, developing, motivating, and enabling them with the right tools and with real-time feedback. Inspire your team’s collaboration and develop a diverse and inclusive environment. Demonstrate a deep understanding of country macro- and micro-dynamics. Develop and share a country business plan aligned to the MEA Sales strategy for all routes to market channels, strategic partners, and major accounts—integrated into a clear vision of optimal growth for the countries. Represent Apple internally and externally on a diverse range of challenges and opportunities. Lead the Country Sales team to drive route-to-market business plans by influencing and collaborating cross-functionally with key partners. Mobilise resources and execute activities for growth, ensuring partnership commitments are met, with an acute attention to detail that delivers the highest-quality results across all touch points. Proficient in the details of your country’s financials and performance which enables you to drive high quality outcomes. You mobilise resources for growth, drive sales activity and share status and progress with customers, partners and the relevant Apple teams. Proactively engages with a wide range of stakeholders to enlist their assistance and facilitate smooth progress toward goals, creating an environment that promotes cross-functional analysis and decision making. Creates, expands, and calls upon a wide-reaching network that stretches across multiple cultural, organizational, and global boundaries. Solves technical and business problems and ensure success for both Apple and its customers working alongside extended Apple teams and set the tone for an inclusive culture in line with Apple’s values, leading by example both internally and externally.", "key_qualifications": "You understand there are many moving parts in an organization. Navigating the interdependencies within Apple is needed for success. Understanding how business financials work, and strategies for sustaining profitable growth, are key to staying ahead of the competition. You analyze the market and think beyond the short-term. You believe that communication is key to Apple’s success. You’re a dreamer and someone who actively talks and listens through endless possibilities—with customers and teammates alike. To ensure the most innovative ideas become a reality, you recognise perspectives, patiently listen to every detail and commit to what is right, in order to move us forward. You think clearly. You simplify complex problems and distill big decisions down to their core. It’s rarely easy. Sometimes decisions require you to make tough calls, even after considerable time and energy has been invested—but you own it. You stand by your deep analysis, wisdom and experience to make quality and timely decisions. Customer and partner needs can often be unique—but, you’re quick on your feet and connect and influence the right people both inside and outside of Apple. As a go to person with leadership, you are trusted and comfortable in tough situations. You can settle disputes, negotiations and own the hard calls with minimal noise. You step up to conflicts and see them as opportunities to shine. No matter the audience, you are an expert at presenting. And, you’re cool under pressure. You make the complex simple and you command an audience by bringing them along for the journey. You empower others to learn, to be curious and ultimately, share your passion for the Apple story. When challenged with complex questions, you share your deep knowledge of how our hardware, software and services integrate. You adapt to change and find the right path without necessarily having all of the pieces to the puzzle. At Apple, things aren’t always clear but you shift gears and thrive when asked to explore new ground, rather than waiting on others. You are only as strong as the people around you, so you know how to build and motivate a team. You create an environment that is collaborative and one that empowers team members to do their life’s best work. When projects require extra support, you step up to the plate and mobilise the right resources to ensure all problems are resolved. You see the world through the eyes of the customer by deeply understanding their business needs, challenges, and concerns. At Apple, we obsess over how people experience our products and services. You not only meet our customers’ expectations, but you exceed them. Minimum Requirements: 8+ years of experience leading country or regional sales organizations; or similar experience in leading a technology solutions-orientated organization that balanced delivering on short-term goals, while creating sustainable value for customers and demand for the future. Fluency in Arabic preferred.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529663"}