{"title": "Display module engineering program manager", "summary": "At Apple, we believe our products begin with our people. By hiring a diverse team, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. Joining our hands-on development team, you will create the standard in cultivating excellence, creativity, and innovation. Will you help us design the next generation of revolutionary Apple products?", "description": "-  Lead cross-functional communication between Apple internal project teams and external vendors\n-  Work with Engineering Management and vendors to define, plan, track, communicate, and escalate as necessary\n-  Enable the development effort by creating and monitoring an efficient, streamlined process between Apple teams and external vendors\n-  Provide timely issue resolution and critical path management\n-  Facilitate good communication and provide multiple levels of status across a wide spectrum of individual contributors to executive management\n-  Drive day-to-day engineering build activities at the vendor’s factory to meet overall program objectives", "key_qualifications": "", "preferred_qualifications": "- Familiarity with technical risk assessment reviews\n- Proficient in writing status reports and technical review summaries\n- Strong analytical skills for problem-solving\n- Effective status tracking skills and attention to detail\n- Ability to work well with cross-cultural and multi-functional teams\n- Display technical skills (beneficial to have)\n- Knowledge of problem-solving methodologies/tools (e.g., FACA report, 5 Whys, fishbone diagram)\n- Understanding of general industrial manufacturing processes (e.g., Display TFT, SMT, die cutting, plastic injection molding, sheet metal stamping, etc.)\n- Experience with failure analysis tools (e.g., SEM/EDX, FTIR)\n- Experience with bringing up new production line equipment/testers\n- Knowledge of production line quality control", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559380"}