{"title": "Security Software Engineer - Apple Services Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple products. Within FairPlay team we have been securing valuable assets on user devices for more than a decade. We develop top of the notch digital right management (DRM) solutions, both efficient and secure, delivering the best user experience. Collaborate with some of the best in the business and see how we create the world's most innovative products and experiences.", "description": "Working as part of an extraordinary team, you will spend your time researching and developing our security technologies. Your friends, family and users worldwide will share the benefits of your work. Often this will focus on creative content, crafting techniques which protect a large variety of assets on user devices whilst maintaining efficiency. We have the freedom to bring new ideas and design innovative solutions. Passionate about cryptography we use the whole mathematical spectrum coupled with software implementation and optimization. You will be hands on with state of the art products from very early in their development, exploring software vulnerability, consumer expectations and behaviors in this space. As a white box cryptography developer, not only will you design the cryptographic core of our new solutions using innovative mathematical and cryptographic ideas, but you will also be in charge of their development taking into account cryptographic weaknesses and performance contraints. Tackling these challenges, we work closely with our Red Team and other colleagues internationally ensuring a smooth and secure integration of our solutions. That way we make sure to securely distribute the best content to millions of devices and the our customers enjoy the best experience. If this is you, we'd love to hear from you.", "key_qualifications": "Strong knowledge of cryptographic algorithms and their implementation; Proficiency in more than one programming language, including C, C++, Python and shell scripting; Fluent English (French not required); MSc in Computer Science or Mathematics with a major in Cryptography or equivalent required", "preferred_qualifications": "Interest in compilers and obfuscation techniques; Interest in machine learning and familiarity with ML languages; PhD or equivalent in Cryptography desirable", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558849"}