{"title": "Software Development Engineer in Test- Retail Engineering", "summary": "Apple’s Retail & Online Stores (R&OS) Quality Engineering team is actively seeking a motivated and innovative Software Development Engineer in Test (SDET) who possesses strong problem-solving abilities and effective interpersonal skills. This role is ideal for a proactive individual who excels in dynamic environments, thrives on ambiguity, and can collaborate effectively with minimal direct supervision. We are looking for a self-motivated teammate who not only flourishes in collaborative environments but also demonstrates initiative and confidence in questioning assumptions.", "description": "Design, develop, and maintain automated test frameworks and suites using Java-based frameworks such as JUnit, TestNG to validate backend functionalities of our eCommerce platform. Collaborate closely with software engineers, product managers, and other stakeholders to understand requirements and ensure comprehensive test coverage. Implement and execute test plans and test cases to ensure comprehensive test coverage. Perform API testing using tools like REST Assured to validate data integrity and functionality of backend services. As an automation specialist, you will define requirements and propose solutions to streamline the testing process with a strong commitment to ownership. Engage in in-depth technical dialogues with the engineering team, comprehend software workflows and use cases, and ensure the system's testability. Self-motivated, able to grasp issues quickly and make educated, critical judgment in the absence of complete requirements. Deliver timely and precise updates on testing status and quality metrics to stakeholders throughout all testing phases, and compile Quality outcomes summary upon project completion. Strong analytical and problem-solving skills to effectively debug and resolve complex technical issues. Advocate for superior software testing practices within the team and foster adoption across the organization, promoting software development methodologies that enhance overall software quality. Adaptability to thrive in fast-paced environments with frequent context switching.", "key_qualifications": "", "preferred_qualifications": "Proven experience as an SDET or similar role, with a focus on testing eCommerce platforms or large-scale web applications. Proficiency in programming languages such as Java. 2+ years experience with test automation framework like Junit, TestNG etc. Analytical, methodical, inquisitive and persistent problem solver committed to driving quality forward. Ability to abstract technical details and effectively communicate to audiences at different levels. Proficient at balancing multiple efforts simultaneously and meeting strict deadlines. Solid understanding of web technologies including HTML, CSS, JavaScript, and HTTP/HTTPS protocols. Familiarity with cloud platforms like AWS and containerization technologies (e.g., Docker, Kubernetes) is a plus. Effective communication skills and the ability to work collaboratively in a fast-paced environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556275"}