{"title": "Photos - Apps and User Experience Software Engineer", "summary": "iPhone is the most popular camera in the world. The seamless integration of software and hardware has led to features like Memories and Portrait Mode which deliver magical experiences. Our team works hard on products that ship to millions of people, and we are looking for people who want to do the same. The Photos Infrastructure team is responsible for building innovative on-device and cloud services to improve the user’s photo and video experiences. We shape the next generation of media for Apple and contribute to a product that is redefining the Camera and Photos experience for the iPhone, iPad, Mac, Apple TV, and Apple Watch.", "description": "Do you want to shape the future of Photos? Are you looking to contribute to a product that is redefining digital photography? The Photos Infrastructure team is looking for an exceptional software engineer to develop innovative applications and infrastructure for Apple platforms. In this position you will be involved in features that encompass: video & image processing, database programming, performance profiling, concurrent multi-process architectures, privacy & security initiatives, and managing network based assets. You will be joining a highly cross functional team that partners closely with many teams across Apple. Within a release there's a close collaboration with teams ranging from: Photos UI, Camera Foundation, CoreOS, AVFoundation & ImageIO, Privacy & Security, Internet Technologies, System Intelligence & Machine Learning, and iCloud. Amongst our most important partners are third party developers who provide great customer experiences by accessing our on-device services through the PhotoKit API. In recent releases the team has played key roles in delivering features such as: Deep Fusion with Camera Frameworks, Limited Library with Privacy & Security, Curated Library with Photos UI, JPG to HEIF with the media format teams, Photos Memories in partnership with various intelligence teams, and extending the functionality of iCloud Photo Library. This is a very dynamic space which will provide great career opportunities for the right candidate.", "key_qualifications": "A strong interest in systems engineering (examples could include projects that involve any of c/c++/assembler/operating systems/compilers/IPC/media transformations etc.), Knowledge in any of the following would also be looked upon favorably: Developing and testing embedded software, Experience building APIs or frameworks, A background in relational databases (SQLite, PostgreSQL, SQL, Core Data, etc.), Performance tuning optimizing memory, scheduling, IO, networking protocols or databases, Media database experience, On-device software development experience", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,731 and $204,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503943"}