{"title": "Senior Software Engineer - Data", "summary": "Athena Platform Services (APS) is looking for a talented Software Data Engineer to play a meaningful role in building data services and platforms that run machine learning analytics to prevent fraud, waste and abuse across Apple. Athena is a machine learning platform committed to providing high-quality, data-driven risk decisioning. We are passionate about operational excellence and providing data-driven solutions with meaningful results! As a Software Data Engineer, you will be working with large-scale data systems used by data scientists, analysts, and business partners. This position supports both online solutions for near-real-time decisioning, and offline solutions for batch analytics and reporting.", "description": "• Engage with business and analytic teams to understand data requirements and translate them into technical solutions • Build scalable and robust systems that gracefully recover from outages and system issues • Standardize and implement operational processes for data delivery, maintain SLAs, and ensure content accuracy • Automate technical solutions that integrate data from a variety of data sources • Spot and implement optimizations across data usage from multidisciplinary teams • Ensure data health & quality through monitoring and alerting tools", "key_qualifications": "5+ years of technical experience designing, building, and maintaining data pipelines and platforms • A drive to research and embrace new technologies and languages to solve business goals • You have seen systems operating at significant technical and organizational scale • Proficiency in implementing data pipelines and applications in a general programming language such as Python, Scala, or Java • Proven experience working with Spark, Flink, Hadoop, or other distributed data technologies • Experience working with large-scale data warehouse solutions such as Snowflake, or Redshift and messaging queues like Kafka • Ability to write efficient & complex queries and ETL jobs that span Petabytes of data • Ability to debug complex systems and integrations spanning tool chains and teams • Insight & creativity to see around corners and to design systems in order to mitigate future risk", "preferred_qualifications": "", "education_experience": "• BS/MS in Computer Science, Computer Engineering, Data Science, Machine Learning or related major", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546387"}