{"title": "Logistics Technician, Data Center", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. The Data Center logistics team is responsible for supporting Apples Enterprise of Apple owned and operated Data Centers and Co-Locations globally through shipping, receiving, inventory, and reverse logistics. We are searching for a highly motivated and passionate Logistics Technician to join our team.", "description": "As a Logistics Technician you will ensure products, materials, or supplies are shipped, distributed, or received in an efficient manner. We are looking for a hands-on individual who will lead by example while maintaining a safe and stabilized work environment. Responsibilities Work with peers to drive standard methodologies by recommending changes to site policies and procedures. Plan and prioritize daily work assignments for the team, including shipping and receiving, inventory management, order fulfillment, and returns processing to ensure optimal workflow and productivity. Coordinate with other departments and vendors to ensure smooth operations and timely order fulfillment. Be a subject matter expert to define and set up key supporting processes such as Inbound Operations (receipt to put-away), Outbound Operations (pick, pack, quality control audits, ship), Inventory Control (cycle counting, adjustments, movements). Track and document all shipping and receiving information for the data center, ensuring the accuracy of all related documents. Prepare and/or examine outbound parcels and freight in accordance with local, company, and legal requirements. Drive operational excellence in all warehouse operations to include: warehouse management systems, inventory receipt and processing, warehouse safety protocols, warehouse layout and product placement, maintenance and organization of all warehouse areas (5S).", "key_qualifications": "N/A", "preferred_qualifications": "Excellent organizational and time management skills to effectively prioritize tasks and meet deadlines. Excellent communication skills, both verbal and written, to effectively communicate with team members and other departments. Ability to work in a fast-paced environment and adapt to changing priorities and demands. Basic knowledge of health and safety regulations to ensure a safe working environment. Ability to work under pressure and handle stressful situations with composure. Ability to learn warehouse management systems and software. Proficiency using Apple products and software (Keynote, Numbers, Pages)", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559187"}