{"title": "Sr. Interactive Producer, Email Marketing Production and Delivery", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "Responsible for production execution of email programs for Apple marketing communications including product launches, customer engagement, ownership, marketing campaigns, and corporate initiatives. Serve as the subject matter expert for email production processes, workflow,  and best practices; supporting ongoing platforms, tracking email programs on a production calendar, overseeing the flawless execution of DM tests and managing the daily production QA pipeline. Prioritizes projects, ongoing changes, manages risk, and resources in real time, and refines the email delivery process based on feedback and the desire to innovate and improve production process. Builds strong relationships and effectively collaborate with creative, development, and cross-functional teams including Interactive Producers, Database Marketing, Analytics, Retail, Quality Assurance, Platform, and Marketing. Partner with agency, technology, and platform teams on an ongoing basis to support the success of all email projects.", "key_qualifications": "7+ years experience in email marketing production and project management. Experience with digital communication platforms and technologies with a strong emphasis in managing direct-marketing (email) campaigns.", "preferred_qualifications": "Experience in marketing and development of digital communications across all channels and platforms; proficiency in the latest Internet advancements and technology. Able to deliver results and have a can-do attitude when it comes to hitting milestones and meeting deadlines. You are highly organized and love to craft efficiencies to further streamline processes. You can confidently build rapport, credibility and influence across multiple stakeholders in a highly matrix’d organization. Passion for great work, seeing potential and nourishing it, with a tremendous ability to influence both internal and external stakeholders to drive the work forward. Deep understanding of email marketing platforms and how they can be leveraged to deliver the most compelling experience throughout the customer journey. Experience working within an interactive agency is preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558360"}