{"title": "Product RF Engineer", "summary": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for state-of-the-art products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products! We’re looking for self-driven and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications.", "description": "Product RF Design Engineers should have a broad-based knowledge in RF architecture, design, integration and manufacturing. They have deep theoretical and practical knowledge in one or more areas of electromagnetic theory, RF and Wireless system design, communication theory, and product design trade-off. They use electromagnetic and system simulation, hands on prototyping, test and measurement to understand complex system and sub-system interactions, implications to product level design, and manufacturing trade-offs to enable mass production. Product RF Design Engineers apply their expertise in all aspects of product design from concept, architecture definition, system integration and prototyping to final production. They work closely with wireless and software architects, industrial designers, product and system design teams to guide and sculpt the product design with an eye towards optimizing RF/Wireless functionality for the users. Traveling up to 15% of the time may be required to visit overseas manufacturing facilities to support builds from prototype phase to mass production.", "key_qualifications": "Knowledge of EM or RF or antenna design, Knowledge of integration of wireless technologies such as cellular, GPS, Wifi, BT and NFC into products, Knowledge of RF system integration and PCB layout practices and guidelines, Excellent interpersonal skills.", "preferred_qualifications": "As a Product RF Design engineer, you would have the opportunity to work and expand on multiple aspects of RF technology. While these are not required from you, they will help you in pushing boundaries of innovation at Apple. A non-comprehensive list may include: Knowledge of electromagnetic simulation tools, Hands-on experience with RF prototyping and lab instrumentation, Ability to debug Desense issues and characterize noise sources, Experience with production environment and statistical analysis", "education_experience": "BSEE or equivalent education Coursework or experience in antenna/RF design, wireless communications, EM, or circuits", "additional_requirements": "As a Product RF Design engineer, you would have the opportunity to work and expand on multiple aspects of RF technology. While these are not required from you, they will help you in pushing boundaries of innovation at Apple. A non-comprehensive list may include: -  Knowledge of electromagnetic simulation tools, -  Hands-on experience with RF prototyping and lab instrumentation, -  Ability to debug Desense issues and characterize noise sources, -  Experience with production environment and statistical analysis", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549599"}