{"title": "Sr. Cellular Platform Software Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Smart people and inspiring, innovative technologies are the norm here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team transforming wireless technology? Join us to help deliver the next groundbreaking Apple product. Wireless Technologies team is looking for highly motivated and creative engineer to work on our next generation products. The duties of this position will design, develop, debug baseband platform software, and work with cross functional teams to deliver the features into product", "description": "The duties of this position will design, develop, debug baseband platform software, and work with cross functional teams to deliver the features into product Perform architecture reviews with other Apple wireless teams Identify and drive innovation for cellular baseband architecture with focus on balanced optimization of modem KPIs Travel on demand to support factory testing and resolve critical issues on-site", "key_qualifications": "Solid understanding of baseband system(core, cache, memory, bus, interrupts, sleep/wake, clock, power control, dynamic frequency and voltage scaling, SPMI, PCIe, bootloader, core dump system, trace system, RTOS etc) Excellent software developing and debugging skills on embedded real time operating systems 3+ years of experience in embedded software design & development. Knowledge on modem cellular technologies Strong experience in C/C++ programming Automation experience and script language (perl, python, js) will be a plus Independent debugging and triage capability. Be skilled to drive xFunctional discuss and joint-debug Ability to work in multi-disciplinary teams and to present complex technical topics to a multi-level audience Good verbal and written English communication skills", "preferred_qualifications": "", "education_experience": "Bachelor or Master degree in Electrical Engineering, Computer Engineering or equivalent degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509627"}