{"title": "SRAM Compiler Design Engineer", "summary": "Do you love building without precedent? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking, often literally. Join us in an exciting silicon design group that is responsible for crafting state-of-the-art ASICs, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned. We have an extraordinary opportunity for SRAM Compiler Circuit Designers. In the custom digital circuits team, you will implement advanced circuit techniques to improve circuit performance, optimize dynamic/static power and support full bring up through productization. This highly visible role is at the heart of a processor design effort, making a critical impact delivering products to market quickly.", "description": "Imagine yourself at the center of our hardware development effort! Where you will collaborate with all fields, playing a strategic role of getting functional products to millions of customers quickly. You will have the opportunity to integrate and come-up with new ideas, as well as work with a team of hardworking engineers. In this role, you will work on SRAM/memory compiler delivery team collaborating with compiler vendors and design teams, working closely with compiler development and deployment to impact PPA of the end products. Here are the main responsibilities for this role:\n•\tInteract with compiler IP providers outside Apple and understand the compilers available.\n•\tInteract with compiler IP consumers within Apple, understand the memory requirements and communicate to external IP providers.\n•\tUnderstand the PVT corner requirements for various projects.\n•\tUnderstand the complete design flow, DFT and testing aspect of the compiler IPs.", "key_qualifications": "We are looking for applicants with circuit design experience.\nExperience developing Register files & SRAM Arrays\nCollaborate with multi-functional team for failure analysis, corrective action implementation plan and yield bridge to a successful ramp & mass production.\nKnowledge of industry standard circuit, design and integration tools.\nSolid understanding of device physics and processes.\nDrive Silicon debug and participate in production ramp.", "preferred_qualifications": "", "education_experience": "A minimum of a BS degree", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $56.65 and $85.52/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519432"}