{"title": "DFM PCBA Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly.", "description": "Verification of Quick Turn PCBA Vendor Technical Capabilities\nDevelop and Maintain PCBA DFM Procedures and Checklists\nDevelopment of Array Drawings for Product PCBAs\nEnsure Proper Management of PCBA Prototype, EVT, and DVT Assembly and Test at Manufacturing Subcontractor\nDevelop and Maintain PCBA Process Parameters and Procedures as Guidelines for Apple Subcontractors\nEnsure Proper Use of Approved Materials for PCBA Prototype, EVT, and DVT Assembly and Test at Manufacturing Subcontractor\nDevelop and Maintain PCBA Assembly Workmanship Standards\nSupport Component Engineering by Ensuring Component Specification Content meets PCBA DFM Requirements\nSupport ECAD Librarians by Ensuring Development of ECAD Library Parts which meet PCBA DFM Requirements\nEnsure Proper Management of PCBA PVT Assembly and Test at Manufacturing Subcontractor\nDevelop and Maintain Data Requirements for PCBA PVT Assembly at Apple Subcontractors\nVerification of Volume PCB Vendor Technical and Quality Capabilities\nEnsure Maintenance of Approved Manufacturing Processes at PCBA Manufacturing Subcontractor\nEnsure the Continued Use of Approved Materials at PCBA Manufacturing subcontractor\nEnsure Maintenance of Specified Quality Levels at PCBA Manufacturing Subcontractor\nSupport Ongoing Apple Service/Quality Issues as Resource for PCBA Manufacturing Issues\nDevelop or manage the development of necessary tooling and/or automation equipment\nDevelop and Maintain Cable assembly processes using hot bar equipment", "key_qualifications": "Engineer or Technologist with an extremely high level of creativity and curiosity about materials science and electronics packaging at all levels.\n3 or more years of research or process development experience in an applicable field.\nFamiliarity with the properties and process used in microelectronics fabrication and PCBA assembly.\nAbility to work with a cross-functional team to define requirements and suitable metrics for the performance of new products and process.\nDemonstrated ability to self-manage and deliver results in a pure development role.\nAbility and willingness to travel frequently, i.e. >25%.", "preferred_qualifications": "", "education_experience": "A degree in engineering disciplines (mechanical, industrial, chemical, electrical or materials science) is required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545251"}