{"title": "Ground Network and Infrastructure Engineering Program Manager", "summary": "At Apple, we strive every single day to craft products that enrich people's lives. Our successes are the result of skilled domain experts working in an environment which encourages creativity, collaboration, and re-thinking of old problems in new ways. As a member of the Satellite Connectivity Group, you will work on the ground-based network and infrastructure that enable satellite connectivity to iPhone when off the grid without cellular or Wi-Fi coverage. Every day, Apple customers use Emergency SOS via satellite to access emergency assistance when they are in need of help and have no other means to communicate. You will have the unique and rewarding opportunity to shape this and other critical services, to the benefit and safety of millions of Apple device users. Our team is looking for a motivated Engineering Program Manager with a specialty in infrastructure development and network monitoring to collaborate with internal and external partners to develop, operate and maintain the ground-based network that enables the satellite system. As a key member of the team, you will contribute to and influence both internal Apple engineering teams, as well as vendors, to realize the infrastructure deployment! This role will enable data center operations and networking maintenance to ensure development targets are met and integration objectives between the two meet schedule and performance requirements. This role will also be key in ensuring these services meet their functional requirements, and are deployed, operated, and maintained in a highly observable, reliable and resilient manner.", "description": "-  Work with internal and external development teams to define technical objectives and development goals, then manage and track development schedules to realize these goals.\n-  Interface and collaborate with cross-functional/organizational partners to drive technical alignment, schedule alignment, and issue resolution.\n-  Clearly communicate status, issues, and priorities to the project team and other stakeholders, including executive management.\n-  Foster and drive an environment of constant improvement across project teams.", "key_qualifications": "", "preferred_qualifications": "Experience with the deployment of edge node computing or cellular wireless infrastructure management.\nExperience with the vendor management.\nDemonstrated technical program management skills in environments that include internal and contracted development teams.\nExcellent verbal and written communication skills with an ability to adapt communication style as required for different audiences.\nA curious mind that thrives in collaborative, fast moving, and ambiguous environments.\nFamiliarity with data center and networking.\nExperience with satellite ground stations.\nExperience in large scale network infrastructure deployment.\nFamiliarity with schedule management tools.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554895"}