{"title": "Software Data Engineer- Apple Music Data Engineering", "summary": "Apple Services Engineering is looking for a Data Engineer to help build large scale systems and data pipelines powering insights into how our customers use some of the worlds most popular media services - App Store, Apple Music, Apple TV+, Apple Podcasts, and Apple Book Store.", "description": "The Apple Services Engineering - Music Data Engineering team is responsible for collecting, analyzing, and reporting on insights on how Apple's customers engage with our Apple Music product. To achieve this, we’re developing data processing and analytics applications operating at true cloud scale. You will be working on a small team valuing collaboration, brainstorming, with an emphasis on design. We are looking for a sharp engineer who also has a keen sense of how to build good products. You are a team player -- ready to engage in lively design discussions, and able to give and receive constructive code reviews. Your curiosity drives you to explore new technologies and apply creative solutions to problems. The ideal candidate pays close attention to details, but also keeps sight of the bigger picture.", "key_qualifications": "Expert knowledge and experience with SQL and/or Spark Dataframes, Strong experience building data pipelines and queries with Spark SQL, Snowflake or similar technology, Understanding of query plan optimisation on Spark SQL, Snowflake or similar, Familiar with visual data exploration and investigation techniques., Experience with large scale data platform infrastructure such as Spark, Flink, HDFS, AWS/S3, Parquet, Kubernetes is a plus, Experience with Java or similar JVM based language is a plus", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Software Engineering, Computer Science, or 2+ years of data engineering experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548259"}