{"title": "People Business Partner (DACH/MEA Sales and Marketing)", "summary": "At Apple, we’re a diverse collection of thinkers and doers, continually reimagining our products, systems, and practices to help people do what they love in new ways. This is a deeply reciprocal place, where everything we build is the result of people in different roles and teams working together to make each other’s ideas stronger. That same real passion for innovation that goes into our products also applies to our practices, strengthening our dedication to leave the world better than we found it. Join our People Team and help support the extraordinary talent it takes to make extraordinary products!", "description": "In this role you will implement all People strategies for your respective client groups whilst also working with the site leadership team in Dubai to build community and connection across all lines of business. You will work closely with local, regional and global business leaders as well as all other People functions flexing your style between strategic and operational execution. You will be an agile ambassador of the Apple culture and partner closely with the sales teams in DACH (Germany, Switzerland and Austria) and the Middle East and Africa. You will also partner with the CEMEA (Central Europe Middle East and Africa) marketing teams and act as a key member of the Dubai site leadership team. This is an exciting opportunity to join a fast paced, energetic team working as trusted advisors to senior leaders. This role represents a key partnership opportunity to inspire change, results and excellence. You will play a key role in the EMEIA People team.", "key_qualifications": "Proven experience as a Human Resources Business Partner in the DACH and CEMEA regions Outstanding communication skills, including influencing and mentoring senior leadership at Director/VP level and above Experience partnering with client groups from multiple countries and complex markets. Ability to produce analytical data and trends and deliver to the business Proven experience in Organisational Development, Change Management, Leadership Development, Talent & Performance Management Fluency in German", "preferred_qualifications": "HR Manager or HRBP experience in a sales environment Experience working with senior executives and working in emerging markets with a strong understanding of the cultural nuances of the region Understanding of German workers council regulations Experience collaborating with Employee Relations, Talent Acquisition, Comp and Bens and On-boarding functions Ability to navigate and cut through ambiguity and thrive in a fast-paced and vibrant environment Positive energy & attitude with a desire to drive constant improvement & change", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559556"}