{"title": "Generative AI Applied Scientist, Applied Machine Learning", "summary": "We are seeking a highly skilled and motivated Applied ML Scientist with expertise in Generative AI to join our dynamic team. In this role, you will be responsible for developing innovative and practical AI applications that drive enterprise transformation. Your work will have a direct impact on optimizing operations, improving efficiency, and fostering innovation within our organization. The Applied Machine Learning Data Science team in IS&T are a group of passionate applied ML scientists from various disciplines with extensive track records in both academia and industry. We have the opportunity to do groundbreaking applied machine learning work that will shape the industry. At AML, we develop cutting-edge machine learning solutions that enable current and future products and services for the enterprise!", "description": "As an ML Applied Scientist on our team, you will engage with Business Teams: Collaborate closely with business teams to identify opportunities, gain a deep understanding of their requirements, and optimally translate these requirements into innovative technical solutions. Designing Generative AI Solutions: Lead the design and development of generative AI solutions. Utilize established techniques and, when necessary, create custom algorithms to tackle complex challenges effectively. Collaborating with Cross-Functional Teams: Work closely with our team of engineers and platform architects to seamlessly integrate and deploy robust, enterprise-grade ML applications and systems that meet our business objectives. Continuous Research and Innovation: Stay at the forefront of data science and machine learning advancements. Continuously explore and evaluate new technologies and methodologies to enhance the technical capabilities of our team, ensuring that we remain at the cutting edge of ML innovation.", "key_qualifications": "5+ years of industry experience with strong ML & gen AI fundamentals, Hands-on experience with building Deep Learning applications, Proficiency in using ML toolkits, e.g., PyTorch, Strong analytical and problem solving skills, ML depth in generative AI, computer vision and/or multimodality an asset., Strong software engineering skills in Python to build scalable and robust infrastructure for deep learning data, modeling, and evaluation systems, Proven track record to train and debug deep learning systems: defining metrics and datasets, performing error analysis and training models in a modern ML framework, Familiarity with researching current ML literature and math including optimization methods and modeling techniques, Strong experience in the transition of a prototype into a final product, Excellent written and verbal communications skills, be comfortable presenting research to large audiences, and have the ability to work hands-on in multi-functional teams", "preferred_qualifications": "", "education_experience": "M.S. or PhD in AI/ML, EECS, or a related field (mathematics, physics, statistics or computer engineering). A minimum of 5 years of experience in applied ML and/or product development   PhD strongly preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552216"}