{"title": "Wireless System Test Engineer", "summary": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world.", "description": "You will be part of the dynamic and innovative Wireless/PHY System DVT team! The team is responsible for ensuring the Wireless/PHY system meets the design specification and functions correctly. The design specifications and functionalities include EVM, Sensitivity, Desense, RF/Baseband Performance, MIMO, Beamforming, and Coexistence. You will be responsible for testing and validating the Wireless/PHY Systems. You will also develop the test plans,execute test campaigns, generate reports, and triage issues within the wireless silicon design group on the radio and PHY. This will include debugging and extending the validation/regression test infrastructure.", "key_qualifications": "Knowledge in wireless communication systems: WiFi and/or Cellular Technologies\nUnderstanding of key performance indicators and impairments of RF and Baseband signals\nExperience testing wireless silicon in a lab\nExperience using and understanding lab equipment: signal analyzer, signal generator, spectrum analyzer\nExperience with Python, Shell scripting, and/or C/C++/C#", "preferred_qualifications": "", "education_experience": "Minimum qualification is BS in Electrical Engineering or Computer Engineering.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519844"}