{"title": "Technical Support Advisor - German Speaking", "summary": "We expect everything from an advisor that our customers do and we want Apple to be a reflection of the world around us. As a Technical Support Advisor, you’ll be supporting many of our popular products, from iPhones to iPads to MacBooks to desktop Macs. As our customers' first point of contact, you’ll be the friendly voice of Apple, providing world-class customer service, troubleshooting and technical support. We’ll rely on you to listen to our customers and use your technical knowledge, creativity and passion to meet their needs — and remind them that behind our great products are amazing people. We believe our individual backgrounds, perspectives and passions help us create the ideas that move all of us forward. We’ll train you to be the best!", "description": "Every single day, people do amazing things at Apple. Here’s your opportunity to do significant work by providing excellent customer support. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you a problem solver who can build rapport easily with customers? Do you exceed their expectations with your knowledge and passion for technology? If you are enamored by the way things operate and are able to determine how technology works when things go wrong, you could be Apple's next Technical Support Advisor. \n\nYou have excellent verbal and written communication skills, as well as the ability to effectively prioritize and manage your time. You can multitask across systems and applications while analyzing, isolating and resolving a variety of complex technical issues. You effortlessly engage, explaining solutions step by step with patience and tailor your approach to meet the needs of each individual customer. You’re not only here to help fix technical issues, but also provide an incredible customer experience. Do you have what it takes?\n\nThis is a full-time, permanent position located at our Apple campus in Cork, Ireland.\n\nThis position comes with competitive pay, relocation allowance, great benefits, eligibility to participate in our company stock plan, time off and product discounts.", "key_qualifications": "Fluent in English and German\nExperience supporting customers via phone, E-mail, chat\nReal passion for customer service and ownership of the customer experience, including comprehensive issue resolution\nHandle your own workload and work independently in a dynamic, constantly changing environment\nAbility to maintain a positive attitude through periods of change\nGrows with a team where expertise is shared and feedback is encouraged\nEffective time management including the ability to multi-task, organize and prioritize\nAbility to research and grasp technical information across multiple tools while talking with customers\nKnowledge of one or more of the following is an advantage: iOS, smartphone, tablet, PC or Mac experience\nAptitude for acquiring skills in technical troubleshooting and an eagerness to learn and take on new challenges", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Available to attend approximately 4-5 weeks of required training on a fixed schedule that may include weekends\nFlexible to work between the hours of 7:00 a.m. GMT and 7:00 p.m. GMT including weekends and holidays\nSuccessful completion of initial training\nSuccessful completion of a pre-employment assessment and background check\nPlease submit your CV in English (CVs in other languages cannot be accepted, unfortunately)", "pay_benefits": "This position comes with competitive pay, relocation allowance, great benefits, eligibility to participate in our company stock plan, time off and product discounts.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200514757"}