{"title": "Supplier Quality Engineer- Flex Assembly / FPCA", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. We are looking for a DFM engineer who will focus on flexible printed circuits assembly manufacturing process and quality.", "description": "-  Act as project leader and oversee a variety of projects, collaborate with factories and handle on technical and quality. -  Collaboration with upstream and downstream on design, process, quality, specifications and issues. -  Plans, develops and implements technical procedures for Flexible Printed Circuit Assembly (FPCA) manufacturing process and quality requirements. -  Provides early manufacturing involvement to ensure new products is manufacturable. Perform design, manufacturing process, quality review, identify design and manufacturing risks, provide design and process solutions during New Product Introduction (NPI) to mass production, and handle the implementations and qualification. -  Establish guidelines, Standard Operating Procedure & Best Known Method for manufacturing process & quality control. -  Handle NPI projects and build, improve quality and efficiency, to ensure seamless transition to mass production.", "key_qualifications": "", "preferred_qualifications": "5~10 years' experience of engineering, design, manufacturing, NPI, engineering program management, quality or supplier management in electronic industry, SMT /assembly experience and managerial experience. Familiar with quality management methods like 6 sigma, reliability test, failure analysis methodology and etc. Work with multiple functional groups, shown strong leadership. Passionate & highly independent individual, good discipline, responsible and trust worthy.", "education_experience": "-  Minimum Bachelor Degree or equivalent experience In Engineering or Science fields. -  Master Degree or equivalent experience or MBA is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543636"}