{"title": "CoreTech Supplier Quality Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple module engineering and quality team is looking for a motivated, technical oriented supplier quality engineer to lead VCM(voice coil motor) module quality at suppliers.", "description": "-  Provide direction to suppliers, developing quality programs to ensure highest level of quality and reliability is consistently delivered. -  Work with teams and lead suppliers for inspection system DFM and qualification, and OK2send processes at new product development phases. -  Work with ME to define quality specification as necessary. -  Define quality specification (SOP, cosmetic spec, etc) as necessary. -  Set up incoming material inspection, testing and sampling plan to ensure robust incoming quality control at suppliers. -  Work with TPM and suppliers to set up CTQ process control in manufacturing line, take actions to drive continuous process improvement. -  Establish OQC inspection and testing process through guard band and tester correlation to ensure out-going parts quality. -  Collaborate with suppliers in resolving sophisticated manufacturing process, quality and reliability issues, using DOE and statistical approach. -  Develop robust processes for FA on customer returns in order to synthesize voice of customer into process changes and product development cycles to impact current and future products. -  Publish reports on supplier performance based on production line statistics, system level data and address these issues. -  Regular process audits to ensure vendor align with POR or equivalent experience process parameters and achieve expected results. -  Build up data digitalization system with quality sense and computer science -  Good at SMT process and knows how to do good quality control at SMT", "key_qualifications": "-  Familiar with quality tools, including Cpk, DOE, MSA, sampling plan, data distribution, data correlation. -  Direct working experience in assembly, inspection and test process development. -  Proven ability to work directly with suppliers to solve product problems. -  Understand mechanical drawing specification and appropriate measurement techniques. -  Familiar with supplier auditing and development. -  Fluent in written and oral English communication. -  Familiar with data analysis tool like Minitab, JMP, etc. -  Familiar with TA analysis, understand the 2D/3D model and drawing.", "preferred_qualifications": "", "education_experience": "-  Master/BS or equivalent experience in Mechanical or Electro-Mechanical Engineering with relevant working experience in quality.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534717"}