{"title": "Embedded Software Engineer", "summary": "Are you passionate about changing the world? As a member of our multifaceted group, you will have the outstanding and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. Come join a team of expert software and hardware engineers with a diverse group of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next generation Wireless SoCs. As part of the Wireless team you will develop and port test software to evaluate functional blocks and debug silicon issues.", "description": "As an Embedded Software Engineer, you will work closely with designers and architects to understand various functional blocks and their use-cases. Write, debug, and integrate new tests for integrated Wireless chipsets, complex Digital Interfaces and Power Management Subsystems. You will push functional blocks to their limits and debug issues surfaced during testing. RESPONSIBILITIES: Write new tests including low level driver with embedded programming language. Work with cross-functional team to push these tests down into pre-silicon environments. Work closely with hardware design engineers to debug silicon issues exposed during testing. Enable test frameworks to scale into test racks and large-scale testing. Support product development builds locally and remotely.", "key_qualifications": " ", "preferred_qualifications": "Assembly language programming skills. Familiar with bench debug equipment such as Oscilloscopes, Logic Analyzers and DMMs..Experience in crafting tests to target specific portions of silicon designs and digital interconnects. Digital logic fundamentals including timing analysis, state-machine debug and/or RTL/test-bench development Experience.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549257"}