{"title": "Senior Privacy Engineer - Generative AI & Privacy Technologies", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple delivers great features and great privacy to our users. The Privacy Engineering team works with teams all across the company to make sure that products and services protect user privacy by designing architectures that reduce the exposure of user data at all levels of the technology stack. We are looking for an outstanding candidate to become a member of the Apple User Privacy Team.", "description": "We are seeking an experienced engineer to provide privacy guidance to teams across Apple working on machine learning and generative AI infrastructure. This includes feature reviews and the design of new, privacy preserving data collection methodologies to enable the evaluation of AI systems. It also includes guiding the roadmap of privacy technologies at Apple like differential privacy and private federated learning. In this role you will: - Review features to identify privacy exposures and partner with teams to design mitigations. - Audit new products to identify bugs in development, and review customer data collected by engineering teams to drive decisions for privacy impact. - Communicate privacy risks and potential mitigations to senior leadership to drive decisions. - Guide the development of data collection systems that enable training and evaluation of generative AI systems while preserving privacy. - Partner with cryptographers and technical experts in SWE and AIML to develop our roadmap for privacy technologies, and provide guidance to engineers and leaders on the right privacy technology to use when developing new features. Successful candidates will need to have superb communication skills and a passion for protecting privacy. Creative problem-solving, analytical, and deductive reasoning skills are critical for this position. You will be working on multiple unrelated systems each week, so the ability to learn quickly and an excitement for new things is a must.", "key_qualifications": "Passion for customer privacy, Strong collaboration, communication, interpersonal, and organizational skills, Ability to learn and research new technologies rapidly, assess privacy exposures, and suggest mitigations, Ability to analyze systems’ architectures for privacy impact, Ability to solve complex problems independently, Experience with foundation models, including training and evaluation, Experience with differential privacy or private federated learning, Programming experience", "preferred_qualifications": "", "education_experience": "BSCS or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549288"}