{"title": "Reliability Test Engineer", "summary": "Come to join a dedicated team who is committed to making Apple's products more durable. We work in a highly collaborative lab environment, balancing several projects and deadlines simultaneously. We're looking for someone to help us execute and oversee reliability testing in our state-of-the-art lab. You will review test plans, execute reliability testing, capture data, and share your analysis with Apple's reliability engineers. You will support building the lab’s testing capabilities, outlining the testing methods, and focusing on the small details to make day-to-day activities running efficiently. Your success will allow us to identify and correct design issues quickly.", "description": "In this role, you will collaborate with multiple Apple engineers to conduct reliability tests on all kinds of products, and to meet Apple’s technical standards and deadlines. You will report test result and discuss with the project teams about the findings or problems. And you will need to keep the equipment in the lab with good setup, calibration, and maintenance. Besides, you are also fully encouraged to make innovation and work on new test development.", "key_qualifications": "Proven ability to conduct tests in a laboratory setting\nHands-on experience with environmental reliability test equipment, microscopes, mechanical stress equipment, camera, multimeter, etc.\nExperience in setting up new lab and facilities\nCapable of processing and summarizing data, support data system setup\nExcellent English written and verbal communication skills\nAbility to effectively lead multiple projects simultaneously and meet strict deadlines\nDynamic and “can-do” attitude with a passion to deliver groundbreaking technologies and an exceptional customer experience\nExcited to collaborate among a diverse set of partners\nWilling to travel freely around APAC", "preferred_qualifications": "Bachelor or above degree in Material Science, Mechanical Engineering, Electronics.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553093"}