{"title": "TFT Panel Design Engineer", "summary": "Apple is looking for a world-class Thin Film Transistor (TFT) panel design engineer to design, develop and launch the next display technologies for the displays in Apple products.", "description": "TFT panel architecture scoping and definition\n\nTFT device design, modeling, simulation and characteristics measurement\n\nPixel and panel design, layout and parasitic parameter extraction\n\nTFT Pixel and panel modeling, characterization, and validation\n\nOn-glass integrated circuit design, simulation and validation\n\nFailure mode analysis, root cause investigation, and problem solving\n\nNew TFT technologies exploration, investigation, and validation\n\nInternational business travel to support project implementation\n\nEngage and collaborate with cross-functional teams, including TFT process, Display\n\nOptics, Touch EE, Display EE, and Mechanical Engineering, Display touch\n\nCollaborate with external vendors for display manufacturing", "key_qualifications": "", "preferred_qualifications": "Ph.D. degree or M.S. degree in Electrical Engineering or closely related field plus 3 years of TFT or related industry experience\nExperience in display touch\nExperience in measuring and characterizing IV and CV of TFT devices\nExperience in developing, designing and manufacturing high volume display\nExperience in characterizing panel optical and electrical performance\nExperience in gate, column driver IC and other display electronics designs\nExcellent written and verbal communication skills are required", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558505"}