{"title": "Systems Engineer PHY and Layer 1 Control Simulations (m/f/d)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY and Layer 1 Control (L1C) Simulations Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations.", "description": "You will take part in the pioneering work of creating and developing simulation models for innovative PHY signal processing and Layer 1 control algorithms which enable cellular modem system design and verification for very high-data rate applications. Your responsibilities will include but are not limited to: - Design and implement 4G/5G PHY and Layer 1 control models for pre-silicon simulation and verification - Perform functional and performance verification of the models using internal and 3rd Party test tools - Contribute to link-level simulator modeling, meaningful metric testing and framework design - Define test cases for new features and drive bring-up and issue resolution. - Integrate PHY reference models in PHY only, reduced signaling and full stack pre-silicon simulation and verification environments in close cooperation with our HW and FW design teams - Actively contribute to software architecture and design for existing and future PHY and Layer 1 control projects - Integrate Machine Learning based modem algorithms in our link-level simulator and employ Machine Learning based approaches for test case generation, coverage improvements and automated issue triage - Collaborate across functional teams to define and document project requirements, concepts, model architecture, interfaces and APIs.", "key_qualifications": "No information available", "preferred_qualifications": "Experience in chip bring-up including the use of lab equipment is a plus,Knowledge in Machine Learning,Good understanding of pre-silicon verification and critical metric testing,MS in Computer Science or Electrical/Information Engineering with advanced working experience or PhD in relevant field with proven working experience.,Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "No information available", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558362"}