{"title": "Realtime Engineer - AVConference Power & Performance", "summary": "Our team develops the technology that powers real-time audio and video communications features such as Group FaceTime, FaceTime, SharePlay, Sidecar, Airplay 4K HDR, Phone Continuity, HomeKit IP Cameras, Wifi-Calling / VoLTE, and RTT. We support iOS, macOS, watchOS, and tvOS. Apple's Audio and Media Technologies (AMT) is looking for a proactive and hardworking engineer to join our team focused on improving power and performance.", "description": "We are looking for a strong engineer to help drive improving power & performance of real-time audio and video frameworks that drive Apple's real-time communication software like FaceTime and WifiCalling. As a power & performance engineer in this role, you will be responsible for analyzing, identifying areas of improvements, and automating power and performance workflows.", "key_qualifications": "", "preferred_qualifications": "B.S or M.S or equivalent experience in EE/CE/CS with a strong focus on software engineering", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $55.64 and $83.75/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses – including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557368"}