{"title": "Materials Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "As a Materials Program Manager, you will play a crucial role in handling materials that have a critical impact on the organization. Responsibilities will encompass materials planning (Clear to build), Allocation, Executive reporting, Excess & Obsolete (E&O) analysis and projections, New Product Material readiness, logistics readiness from Suppliers to Contract Manufacturer’s. Develop the strategic direction, goals, objectives and key measurement systems to ensure the business goals are met. Specific responsibilities include, but not limited to: \n1, CLEAR TO BUILD - Handle the CTB process, ensure the process is working smoothly and we have clear visibility on materials over a 26-week horizon. Partner with the CM’s and the GSSMs (Global Supply and Sourcing Management) on all identified material issues (including sub-tier supply chain) until issues are closed/resolved. \n2, ALLOCATIONS - Play a meaningful role in the allocation of components that are in tight supply. - Provide an aggregated view of supply versus demand as the baseline for program and site-allocation decisions. - Collaborate with the SDMs (Supply Demand Management), OPMs (Operation Program Management) and GSSMs to make sure we allocate parts to contribute the best value. Communicate the allocation strategy with the significant parties. \n3, EXECUTIVE MANAGEMENT REPORTING - Build and maintain reports and summaries on a regular basis to support the business growth. Ensure reports are concise and on time to drive business decision making. \n4, NEW PRODUCT MATERIALS READINESS - During New Product Introduction (NPI) phase, lead material readiness to ensure that we understand the supply base and related challenges - Identify critical engineering release breakthroughs; assess necessity for risk ramp and associated liabilities, to ensure material supply for product ramp is protected. - Identify issues early in the NPI phase and monitor/drive these to resolution prior to ramp. - Identify supply chain on modules and components to ensure that we understand any challenges associated with the new product. \n5, EXCESS & OBSOLETE - Lead phase-out of obsolete parts and the transition to new production materials. - Identify and mitigate E&O in advance to ensure we make the correct company decisions regarding build plan changes, cut-in vs. roll-in requirements, post-ramp qualification opportunities, etc. - Highlight parts with liability and propose solutions to management. - Upon Engineering Change Notice (ECN) or End of Production (EOP) events, track & audit E&O claims, report to Finance for financial reserves, and ensure timely resolution and closure of such claims/reserves. \n6, LOGISTICS - Ensure the smooth flow of materials necessary to meet the production schedules, inventory control requirements, and ongoing production support.", "key_qualifications": "", "preferred_qualifications": "Passion to work in a fast-paced, evolving, and result-driven environment. Proven record of excellent communication, problem-solving, and digital tools. Learning agility to grow, contribute, and drive cross-functional excellence in a high-performance organization. Capacity to analyze complex situations, formalize the innovative solution, and lead the executive communication as needed. Familiar with advanced digital technologies – for example Python/VBA/SQL development and machine learning, etc., ability on both strategy and implementation to manage transformation. Curiosity to explore the details in the end-to-end supply chain and embrace the continued improvement.", "education_experience": "BS/BA or above, accumulate work experience in supply chain, project management, or digital transformation.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558960"}