{"title": "Channel & Partner Communications Lead - India", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will be inspired! And you’ll be proud! At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. The role of the Marketing Communications group at Apple in India is to develop unique creative marketing solutions that will support Apple’s business growth without compromising the need for flawless development and execution of world-class communications. As we grow our business in India, we are seeking an exceptional individual who can operate successfully in our exciting fast-paced environment and lead our Channel and Partner Communications team.", "description": "Lead the team responsible for driving ambition for Apple’s presence in the channel environments, making recommendations on closing skill gaps to drive integrated Partner marketing plans, represent groups on the India Marcom Leadership Team, and ensure alignment both internally with WW channel functions and sales, and externally with partners. Defining clear annual sales and marketing plans for key partners will be an important metric. This will require the channel & partner comms organisations to work closely with key sales account managers to define not only better branded merchandising solutions throughout a partner's retail estate, but also better integrated communications to support initiatives. Synthesising annual partner plans at the Geo level and identifying key opportunities will be critical insight to feed the Marketing planning review process. This role will be the primary contact within Marcom responsible for understanding and sharing insights as it pertains to key business partners across a variety of routes to market. The job will require close partnership with the WW Channel and WW Partner Communications leads to ensure ongoing alignment of platforms and content across all routes to markets. This position requires a self-motivated, flexible individual with very strong communication skills. The candidate must be a strong strategic thinker, capable of seeing the bigger picture and orchestrating projects to that end.", "key_qualifications": "A deep understanding of offline retail environments in India across different cities and types of routes to markets; ability to drive strategic points of view. Knowledge of channel marketing disciplines, including visual merchandising, retail marketing/campaigns, POS, and customer-engagement programs. An understanding of digital platforms in India, provide guidance on consumer journeys to drive platform engagements and content innovation. Proven experience of strong leadership skills at all levels of a global organisation, working with and inspiring a large team. Extensive experience in, brand communications (ATL and BTL), and a deep understanding of full spectrum communications. A strong strategic thinker, capable of influencing senior stakeholders, both internally and externally. Capable of decoding creative work quickly to feedback real time on partners ideas and creative concepts. Experienced in partnering with, and building productive relationships with creative teams. Strong influential and cross-functional coordination abilities combined with excellent communication skills. Develop excellent collaborative working relationships with all internal and external stakeholders. Proven flexibility/adaptability to change in dynamic environments and working as a member of a high performing team. Strong attention to detail and results orientation. Experience working with third parties, to influence, inform and guide their creative efforts. 18+ years experience in a marketing/advertising agency or in-house marketing communications organisation. Experience in the direct or indirect retail channel.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542920"}