{"title": "AppleCare BPR Project Manager, Logistics", "summary": "Do you feel a personal stake in everything that you work on, thrive in fast-paced environments with lots of ambiguity, and enjoy working with complex technologies? Do you develop positive relationships, build trust, and influence without direct authority? Do you communicate openly and clearly, collaborate enthusiastically, and value a culture of healthy debate? If so, we want to talk to you! AppleCare BPR is responsible for delivering cross-functional systems projects across all AppleCare business areas, including Sales, Service, Digital & Logistics. We build positive relationships across the company and stitch AppleCare systems and processes enterprise-wide.", "description": "As a BPR Project Manager you will plan, mobilize, and implement mid to large scale projects, ensuring system changes are thoroughly tested and organizations are ready for process changes. You will be the prime mover of your projects including prioritization, technological solutions and architectural decisions, resource-planning, communications, project governance, risk management, change management and readiness. You’ll connect the dots, build trust and understanding between groups, and orchestrate the activities needed to make your projects successful. The ideal candidate should have experience managing large global technical projects that interweave multiple functional teams and/or multiple systems.", "key_qualifications": "Knowledge and experience with enterprise scale supply chain and logistics systems including Warehouse Management Systems (WMS), Transportation Management Systems (TMS), and Event Management (EM) on SAP or similar enterprise platforms. Experience planning, managing, and successfully delivering large cross-functional systems projects. Experience establishing project structure for optimal return-on-investment, and coordinating cross-project initiatives or large-scale programs. Experience supporting system configuration, architecture, and software development life cycles. Experience with global projects incorporating regional and country-specific details. Possess outstanding communication and presentation skills (written and verbal) to all levels of an organization. Ability to form cohesive project teams across disparate organizations and groups. Ability to partner with data scientists and solution architects and navigate through ambiguity to clarify objectives and execution plans. Ability to navigate through ambiguity to clarify objectives and execution plans. Logistics, forward and reverse supply chain, planning systems, and procurement knowledge. Ability to occasionally travel and work off/weekend hours to support projects, as needed. Bachelor’s degree", "preferred_qualifications": "Experience implementing enterprise scale supply chain systems including Warehouse Management Systems (WMS), Transportation Management Systems (TMS), and Event Management (EM) on SAP or similar enterprise platforms. Service operations, forward and reverse supply chain, planning systems, and procurement knowledge and experience preferred. Knowledge of service, support, and warranty contract sales and operations. Project management certification (PMP or similar accreditations). Graduate degree in business or engineering", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $139,200 and $209,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554090"}