{"title": "Apple Store Online-Digital Commerce UAT Project Manager", "summary": "Imagine what you could do here! The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. Join Apple, and help us leave the world better than we found it! Here on the Apple Store Online team, we are responsible for Apple’s largest store.", "description": "The UAT Project Manager is responsible for project managing simultaneous medium-to-large cross-functional UAT projects, and delivering them in line with major releases. You'll develop deep subject matter expertise of E2E customer journeys, business processes, and impacted systems, and have the ability to innovate creative solutions. You will dynamically develop and drive comprehensive cross-functional UAT strategies. You lead and collaborate with multiple UAT partner teams to connect the dots and stitch across them to drive success. You will develop and sustain strong and trusted relationships with all cross-functional partners. You will manage, plan, and organize activities and tasks throughout UAT planning and execution. You lead, take forward thinking action, and provide goal-oriented direction in the face of ambiguity. You will keep the extended team advised, and ensure accountability to the resolution of key issues. You lead test resources required for successful execution of projects and provide input to and craft the UAT management processes in-line with industry standard methodologies. You contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn and demonstrate Apple’s values of inclusion and diversity in daily activities.", "key_qualifications": "2+ years of proven UAT Project Management experience, 2+ years of eCommerce and/or Contact Center experience, 2+ years of experience in creating test plans and managing cross-functional projects, Thorough understanding of the Project Lifecycle, Experience with both Agile & Waterfall, Strong technical ability, capable of quickly understanding sophisticated integrated systems, Detail oriented, quality-focused with analytical and problem solving skills, Able to fully comprehend current issues, and see around corners to understand downstream impacts, Be able to interact proficiently with a wide range of technical and business teams, Excellent written and verbal communication. Ability to organize and inform through excellent written and verbal communications.", "preferred_qualifications": "Bachelors degree or equivalent, Proficient in using the following applications: Radar, Keynote, Numbers, Excel, Quip, Box, Exhibit a genuine passion for innovation shown through creative strategies and continuous process improvement., Skilled in combining critical thinking with hands-on execution., Passion for innovation shown through creative strategies and continuous process improvement, SAP experience is a preferred, Automation experience is a plus, PMP is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559138"}