{"title": "Channel Fulfilment Analyst", "summary": "There’s work and there’s your life’s work. The kind of work that has your fingerprints all over it. The kind of work you’d never compromise on. The kind of work which surprises and delights others. You can do that kind of work at Apple. People don’t come here to play it safe. They come here to swim in the deep end. They want their work to add up to something. Something big. Something that couldn’t happen anywhere else. Join the Pacific Reseller Operations (PAC RO) team, the heartbeat of Operations at Apple. Experience the best of both worlds, working with thousands of our external Reseller Partners as well as working closely with the best minds within other functions of Operations. The RO team works in a dynamic environment as we engage Reseller Partners in Collaborative Planning, Forecasting & Replenishment (CPFR) in a portfolio which adds to our multi-billion dollar Channel business including Telco, Reseller, and Distributor routes-to-market. The PAC RO team is the key operations liaison with Apple’s Reseller Partners and works with our partners to ensure that the supply chain run as efficiently as possible, in order to maximize sell through across the fastest-growing region globally. Join us as we blaze new grounds and grow our footprint. This role covers Greater China, and will require Mandarin language in both spoken and written proficiencies.", "description": "- Analyse the demand and backlog data in conjunction with customers on distribution flexibility, channel directions against inventory and sales data to drive POS in stock and maximize revenue/sell-through - Ability to develop supply and demand forecast for selected products, reviewing supply/sell-in forecast and ensuring sufficient backlogs and credits to support the sell-in forecast - Review weekly allocation plan and ensuring supply visibility plan is communicated to partners in a timely manner Remain knowledgeable of Resellers’ performance requirements, product line and service offerings - Act as the single point of contact for communicating operational issues and solutions to accounts - Work with functional authorities to understand account business problems & processes and work towards solutions Identify and drive account process improvement opportunities - Active communication to Internal customers/partners on Apple order status and products - Strengthen business relationships with our customers -- end-users, external partners, sales, and internal partners - Knowledgeable of Apple systems and processes that impact CSR value chain - Handle issues on RMA/DOA - Drive and participate in New Product Introduction engagement with resellers - Lead or participate in cross-functional initiatives/projects - Participate in project work and User Acceptance Testing as/when required in order to implement improved systems", "key_qualifications": "- Top-notch analytical/negotiation skills - Ability to toggle between strategic and detail oriented thinking - Tenacious problem solving and issue resolution skills - Excellent presentation and communication skills - Ability to influence across multiple functional teams - Flexibility to adapt to fast-moving and rapidly changing environments - Ability to deliver quality work to tight deadlines - Capacity to thrive in an environment where accountability without control is prevalent - Strong work ethics, perseverance and flexibility - Enthusiasm for working through ambiguity", "preferred_qualifications": "", "education_experience": "BA/BS degree in Business or related field, MBA or equivalent degree preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200532499"}