{"title": "Apple Watch Test / Data Engineer", "summary": "The Apple Watch EE team has a dynamic opportunity for a test / data engineer who is passionate about using data to discover hardware interaction issues during the design processes, and influence the design. This is a deep collaboration with System EE and hardware module teams for test design and factory data collection. If you have a deep interest in data, designing and developing scalable automation infrastructure, applying data engineering techniques on terabytes of data, architecting storage and retrieval, processing data, analyzing failures for root cause, and creating immersive data visualization, come join our team to make a lasting impact!", "description": "- Collaborate cross-functionally for test design, and implement at-scale factory data collection, with a strong emphasis on timely data delivery, experiment prioritization, and understanding underlying issues and questions\n- Debug of various coex and hardware issues with System EE and Module EE teams, building custom build scripts, and data insights to pinpoint relevant factors\n- Deep-dive into data and outliers, applying relevant mathematical, statistical, and visualization techniques\n-Ensure automation, tooling, infrastructure and data pipelines are continuously and efficiently delivering data, implementing ideas and optimizations for both code and processes", "key_qualifications": "Deep interest in how data engineering helps product integration and system design challenges, experience using Python frameworks and libraries for scientific computing (e.g. Numpy, Pandas, Pytorch)\nStrong proficiency in Python with modern software principles, and OOP\nAdept at version control systems and CI/CD best practices\nNavigates ambiguity in work in a fast-moving environment with multiple stakeholders, distilling multi-dimensional problems to important constituent components\nSkilled at distilling questions and needs down to requirements for implementation\nPractical computer architecture and OS/SW debugging skills (e.g. firmware debug, triage and isolate software bugs)", "preferred_qualifications": "", "education_experience": "MS or BS Degree in Electrical Engineering, Computer Engineering, or equivalent", "additional_requirements": "The following skillsets are considered a plus:\n- Practical knowledge of cloud infrastructure and implementation of scalable automation solutions (e.g. Kubernetes, AWS, Spark, Celery, Postgres, RabbitMQ)\n- Practical knowledge of system integration issues in hardware design\n- Exposure to sampled systems (e.g. sensors, DSP), and various radio technologies (e.g. LTE, WiFi, BT, NFC)", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549350"}