{"title": "Camera Hardware Design and Test Engineer", "summary": "Why Apple? At Apple we believe our products begin with our people. By hiring a diverse team we drive creative thought. By giving that team everything they need we drive innovation. By hiring incredible engineers we drive precision. And through our collaborative process we create memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? At Apple, quality is built into our DNA. As test engineers, our objective is very simple, building optimized test solutions to deliver the greatest products with no compromise! As part of our Camera Technologies group, you’ll be in-charge of design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems testing, from sub-components to Camera module. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras. The Camera Hardware Engineering group is responsible for the design, development, innovation, and testing of camera technologies for all related Apple products. Our target is to deliver superior camera hardware to enable outstanding camera user experience.", "description": "Develop new test equipment and procedures for camera module validation and production test. Lead Apple vendor and X-functional teams to resolve critical electrical, signal and power integrity issues. Lead implementation for camera sub-system with challenging component and system requirements. Develop electronic testing prototypes for new camera features and product concepts. Optics / images processing and testing knowledge would be a plus", "key_qualifications": "Expertise in electrical and software for customized instrument and tester development. Board level experience across different applications and technologies. Hands on experience with lab test equipment to debug hardware issues (Lab validation). Schematic capture and rigid/flexible PCB layout. Fundamentals of Signal and Power Integrity and able to do measurement. Prototype design for test and validation with custom silicon. Programmable skills in python and preferably at least one of C/C#/Swift/C++/Matlab. Basic understanding in CAD 3D & 2D experience including DFM, DFMEA. Documentation of test engineering requirement specification and developing/executing project plans, specifying test stations and diagnostics for testing product features, specifying/implementing test process control and test data collection. Excellent written and verbal communication with ability to communicate clearly with both internal and external partners in worldwide geographies. Previous experience in consumer electronics & optical test station/fixture development would be a plus. Preferable to have data-base related application experience. Proactive, self-motivated engineer who can take the initiative and lead improvement. Willingness and ability to travel: up to 4~6 times travel a year and estimate in 8-10 day trips", "preferred_qualifications": "", "education_experience": "BS / MS Computer Science, 5+ years of Electrical Engineering, Mechanical Engineering equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543681"}