{"title": "WW Business Planning Analyst", "summary": "Imagine what you could do here. The people here at Apple don’t just create products —they create the kind of wonder that’s revolutionized entire industries. Join Apple, and help us leave the world better than we found it.", "description": "In this role, you will:\n- Assist in the development and execution of long-term business strategies, as well as business cases for new initiatives and projects\n- Analyze key financial metrics and performance indicators to assess business performance\n- Conduct market research and analysis to inform strategic initiatives\n- Track and monitor key business performance metrics on a regular basis\n- Develop Keynote presentations for senior management and other stakeholders\n- Develop and maintain Tableau dashboards and other analytical tools to support business operations\n- Lead or support special projects and initiatives as assigned", "key_qualifications": "", "preferred_qualifications": "Background in Sales Operations, Sales Finance, Corporate Strategy, Management Consulting, or similar analytical/business intelligence field Experience working with global teams to deliver complex initiatives across sales strategy and sales operations Ability to define, extract, and manipulate data to build reports, data visualization dashboards, and translate insights into actionable results through storytelling Strong verbal and written communication skills with the ability to articulate analysis clearly Ability to aggregate information from multiple sources to formulate a cohesive strategy or direction Strong organization skills and attention to detail; Ability to prioritize, manage, and advance multiple projects and deliver results in a fast-paced and ambiguous environment Excellent collaboration and relationship building skills, including the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560527"}