{"title": "Security Firmware Engineer", "summary": "The Core Platform team within Apple's CoreOS organization brings Apple’s iPhone, iPad, iWatch, Mac, and Home products to life. The ROMs and firmware we develop are at the foundation our devices’ security. We are looking for a motivated software engineer to bring our firmware security to the next level. Your work will have a real impact on Apple products and features, from the software down to the silicon. As an Apple employee, you'll be part of a company whose commitment to user privacy is at the heart of everything we do. You'll be surrounded by the most creative, passionate, and talented engineers in the industry, constantly being challenged to go beyond the norm to find new, innovative ways of solving problems and to make devices safer and secure.", "description": "In this role...\n\n* Work with the Product & System Security teams in implementing the security patches\n* Contribute to the software and hardware roadmap for new security features on a range of platforms, including iPhone, iPad, Mac, Apple Watch, and Home products.\n* Assist with audit of security critical code and hardware, review and implement patches.\n* Create tools that help automate security verification, testing. \n* Improve firmware architecture and APIs to build security into the core. \n* Deploy security mitigations suitable for use in an embedded environment. \n* Work with multi-functional teams to extend secure boot technologies. \n* Collaborate with testing organizations to verify security features and fuzz for vulnerabilities. ", "key_qualifications": "A passion for embedded development and security\nUnderstanding of software vulnerabilities and mitigations\nExperience with secure boot and related cryptographic applications for platform security, principles and use of cryptographic primitives and protocols.\nDirect experience in the overlap between software and hardware security, and firmware/software technologies.\nFamiliarity with modern processor architecture.\nBackground in secure coding and code auditing.\nHave an understanding of past, current, and emerging security exploit types.\nExperience in creating working proof of concepts from found vulnerabilities on systems with advanced anti exploitation measures (e.g. ASLR).\nExperience designing and architecting systems with security in mind.\nExposure to kernel programming.", "preferred_qualifications": "", "education_experience": "Master's (preferred) or Bachelor's degree or equivalent experience in computer science or a related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540628"}