{"title": "Associate Creative Director, Motion Design", "summary": "Marcom LA is Apple’s Global Marketing Communications group creating and overseeing the world-class marketing and advertising driving Apple's rapidly-growing Services sector including Apple Music, App Store, Apple Pay, Apple TV App, Arcade, News, Books, Podcasts, Maps, iCloud and more. Whether we’re launching the Apple Music Super Bowl Halftime Show, introducing Messi to MLS, finding the next generation of games in the App Store and Arcade, or celebrating the seamless joy of using Apple Pay, Marcom LA’s mission is to build love for Apple every day. We do that with inspiring creative, a culture first mindset, and the belief our Services make our incredible Apple devices even better.", "description": "As an ACD Motion Design, this person will be responsible for designing and directing the Motion Identity for Apple services. Responsibilities include: Direct innovative and inspiring campaigns that meet the requirements outlined in the brief. Drive collaboration cross functionally - build relationships, rapport and credibility within the creative community, senior leadership and executive team. Conduct regular reviews of creative work with key stakeholders, driving the conversation for creative solutions and ensuring work aligns with other projects within Apples Design community. Dynamic communication style, capable of realtime creative problem solving. Plan and direct projects from initial ideation through final delivery of production. Act as ambassador for Motion Design within Marcom across various lines of business within Apple, as needed. Lead a dedicated team of freelance motion creatives.", "key_qualifications": "", "preferred_qualifications": "10+ years experience in motion design with strong conceptual and problem-solving skills, Experience guiding and motivating teams of motion designers, developing projects from conception to handoff, In-depth knowledge of all steps required in the creative process, including effectively and efficiently staffing projects, providing communication and creative direction, and giving timely and helpful feedback to improve creative solutions, Strong design skills with high attention to detail and the ability to guide, evaluate and redirect work to achieve creative excellence, Demonstrates ability to learn and adapt quickly and is skilled in creative problem solving in a rapidly changing environment, Diplomatic collaborator who possesses excellent interpersonal skills, capable of negotiating creative input from multiple functional groups, garnering trust and influence, Works well under pressure and is capable of driving a culture of optimism and opportunity while navigating ambiguity, Familiarity with production tools (such as Maya, Houdini and Nuke) and how they relate to the design being implemented in a production environment, is a plus, Dynamic communication style, capable of realtime creative problem solving.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,100 and $255,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557194"}