{"title": "Processor Power Management Verification Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "As a Processor Power Management Verification Engineer, you will have the responsibilities as follows:\n-  Work closely with architecture and RTL designers on verifying the functionality correctness of the Power Management and Clock Control logic\n-  Execute test plans and schedules for the power management and clock control logic.\n-  Develop tests in Assembly, Scripts, System Verilog, or vectors according to test plans to drive testing in simulation and emulation environments\n-  Root cause failures and propose potential solution to the design team.\n-  Develop coverage monitors and analyze coverage to ensure all the test cases in the test plans are covered\n-  Develop checkers or Verilog/System Verilog-base transactor to verify the design", "key_qualifications": "Minimum BS\nKnowledge of digital logic design, micro-processor architecture and microarchitecture.\nKnowledge in developing verification test benches, Verilog/System-Verilog based transactors and checkers.\nKnowledge in VLSI design and low power digital design technique.\nGood programming skills including basic understanding basic object orientated programming and scripting language like perl or python.\nShould be an extraordinary teammate with excellent communication skill with the ability to articulate complex design issues during verification effort.\nBe able to create and follow detail work schedule and work independently on the verification efforts for a block/area of the design.", "preferred_qualifications": "", "education_experience": "Minimum BS", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526268"}