{"title": "Senior Embedded Software Engineer", "summary": "In this role, you will develop innovative firmware for future Apple products. The position requires high level architectural thinking along with low-level programming, excellent communication and leadership skills, and the ability to work in a fast-paced environment. You will be a mentor to the junior members of the team and will have the opportunity to lead cross-functional design with mechanical, electrical, and algorithms engineers. Working on this technology you will have the opportunity to have a major impact on the capability, user experience, and quality of Apple's future products. Our collaborative environment cultivate innovation within a creative solution space.", "description": "In this role, you will design and implement systems firmware for the complex embedded systems that form the backbone of groundbreaking Apple products. Working in a vibrant, collaborative environment, you will design, implement, and integrate software for some of the most sophisticated technologies on the planet. This position is ideal for candidates with a broad engineering background, a passion for problem solving, and specific expertise in firmware development. Backgrounds in multidisciplinary fields such as consumer devices, medical devices, robotics, mechatronics, aerospace, and the like would all be excellent preparation for the highly cross-functional environment at Apple.", "key_qualifications": "The ideal candidate will have at least 5+ years of real time embedded software development experience (design and implementation)\nProficiency in C or C++ on resource-constrained embedded platforms\nExperience with Real Time Operating Systems (RTOS), embedded Linux or QNX in real time applications\nExperience with networking, concurrency, and distributed systems, particularly for fault-tolerant, low-latency, closed-loop applications\nExperience in audio, video, motor controls or actuation is beneficial\nExperience with robust coding and software development standards in safety-critical environments such as DO-178B/C, MISRA C, ISO 26262, or IEC 61508 / 62304 are a plus", "preferred_qualifications": "", "education_experience": "Bachelor of Science degree in one of CS, CE, EE plus five years in industry, Masters plus three years, or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527824"}