{"title": "Commercial Country Manager, Apple Store Online", "summary": "Imagine what you could do here! The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. Join Apple, and help us leave the world better than we found it! Here on the Apple Store Online team (ASO), we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a Commercial Country Manager to help us do extraordinary things. Apple Retail sets out to deliver great customer experiences every day. We implement down to the very finest of detail with strong attention to local market needs to ensure whether the customer buys from a Store or Online they have been delighted not only by our products, but by the very best of service. This role will strive to exceed customer expectations for our Online Stores in EMEIA by leading all aspects of the day to day success of our business, while also identifying and developing opportunities for long term growth and development to deliver the best in class ownership experience.", "description": "Responsibilities for the position encompass both tactical actions as well as critical initiatives requiring an individual with strong leadership skills and deep commercial and digital commerce experience. For the day-to-day aspects, the role will involve interpreting results, providing market insights and the development of reports and metrics. The role will require deep commercial subject matter expertise on the commercial and customer needs of the country. You'll work with Commercial Programs, AFS, channel and external partners to understand what capabilities and experiences are required to drive the growth of Apple Retail. -  Lead the development and execution of the country commercial plan. -  Understand key commercial performance drivers, opportunity areas (gaps) and growth opportunities; represent country performance in WBR. -  Lead the creation and facilitate the delivery of the priority tracks of work. -  Provide day-to-day performance metrics for the business, and provide qualitative and quantitative feedback. -  Drive growth plans and initiatives to address challenges and opportunities in digital commerce, and be able to articulate requirements to senior/exec leadership.", "key_qualifications": "", "preferred_qualifications": "Local knowledge of consumers buying behaviour in market (researching, purchasing, support, etc), Additional European languages are valued", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558065"}