{"title": "AT-Business Pro (m/w/x)", "summary": "Business Pros entwickeln und pflegen Beziehungen zu wichtigen Businesskunden von Apple Retail. Sie arbeiten lösungsorientiert und gehen gezielt auf deren Bedürfnisse ein. Zudem verfügen sie über ausgeprägte Verkaufskenntnisse und kennen sich mit KMU Branchen, Herausforderungen und Trends in der Business Community vor Ort aus. Business Pros sind sehr erfahren darin, Kunden zu Lösungen von Apple und unseren Partnern zu beraten. Sie unterstützen und beraten das ganze Store Team und machen Business so zum festen Bestandteil der Storekultur. Sie arbeiten eng mit dem Store Leadership zusammen und sorgen dafür, dass Opportunities erkannt, bewertet und umgewandelt werden. Sie verfügen über herausragende soziale Kompetenzen und das Verhandlungsgeschick, starke Beziehungen innerhalb von Apple, mit unseren Kunden und mit unserem Team aufzubauen. Gemeinsam mit anderen trägst du zu einer inklusiven Arbeitsumgebung und einer Unternehmenskultur bei, in der sich alle zugehörig fühlen und ihr Bestes geben können.", "description": "Du gehst auf Businesskunden zu, vertiefst Beziehungen und steigerst den Umsatz und die Bekanntheit des Apple Angebots. Außerdem förderst du die Kundentreue, vor allem bei Kunden mit großem Potenzial. Du planst und erstellst Umsatzprognosen basierend auf Account Management, Pipeline Building und Opportunity Management. Dabei verwendest du CRM und andere Tools. Du begeisterst Businesskunden selbstbewusst mit unseren Technologien. Mit dir entdecken sie, wie Lösungen und Services von Apple und unseren Partnern ihre Arbeitsweise verändern. Du entwickelst effektive Strategien, um die Nutzung von Lösungen aus dem gesamten Apple Ökosystem in den Unternehmen unserer Kunden zu integrieren und auszuweiten. Du gibst und unterstützt Briefings und bindest Kunden auch über Sessions ein. Du nutzt CRM, um Infos zu Kundenaccounts anzulegen und zu pflegen sowie Beziehungen, Opportunities und Aufgaben zu verwalten. Du giltst bei deinen Kollegen als Mentor und Experte, wenn es um Bedürfnisse von Businesskunden und Businesslösungen geht. Du suchst, analysierst, interpretierst und teilst Feedback aus dem Business NPS, um das Kundenerlebnis fortlaufend zu verbessern. Du arbeitest mit dem Business Development Manager und dem Account Team zusammen, um für die nahtlose Übergabe von Accounts innerhalb der Account Engagement Strategie zu sorgen und ein tolles Kundenerlebnis zu bieten. Du kennst alle Retail Business Programme und Angebote und achtest auf die Einhaltung unserer Richtlinien und Abläufe.", "key_qualifications": "", "preferred_qualifications": "Mindestens 3 bis 5 Jahre Erfahrung und hervorragende Leistungen beim Verkauf von Technologie- und Businesslösungen oder in ähnlichen Bereichen. Ausgeprägte Apple Kenntnisse in den Bereichen Einführung von mobilen Lösungen und Businesstransformation sowie allgemeine Kenntnisse zu wichtigen KMU Branchen, Technologietrends, Herausforderungen und Chancen. Ausgeprägte Sozialkompetenz, Verhandlungsgeschick und Erfahrung im Umgang mit Kunden. Du trägst zu einer inklusiven Umgebung bei, indem du Unterschiede respektierst und offen bist, Neues zu lernen. Du lebst jeden Tag Inklusion und Vielfalt als Grundwerte von Apple. Du bist ein Kommunikationstalent – sowohl schriftlich als auch mündlich, persönlich und am Telefon. Mit Unternehmern und Führungskräften arbeitest du auf allen Ebenen einer Organisation effektiv zusammen. Du besitzt ein exzellentes Organisationstalent, setzt Prioritäten und gehst auf Kundenanfragen ein. In unserem dynamischen, schnelllebigen Retail Umfeld passt du dich erfolgreich an. Das Bruttojahresgehalt für eine Vollzeitstelle beträgt gemäß dem anzuwenden Kollektivvertrag mindestens €31,206. Das tatsächliche Gehalt orientiert sich an branchenüblichen Gehältern, deinen Qualifikationen und Erfahrungen.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553935"}