{"title": "PHY Systems Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team redefining hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements.", "description": "-  Design and simulate innovative physical layer wireless communication algorithms. -  Implement system models and perform detailed performance investigations to allow performance sign-off and enable RTL development. -  Collaborate with digital designers and firmware developers to realize algorithms with power and area efficient implementation.", "key_qualifications": "- In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization. - Deep-knowledge of communication system theory and signal processing will be important for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc. - Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation. - Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful. - Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc.. - Knowledge of cellular communication standards: 5GNR, 4G LTE. - Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)", "preferred_qualifications": "", "education_experience": "BS and 10 + years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533879"}