{"title": "Sr Security Engineer, Enterprise Technology Services", "summary": "Imagine what we could do together. At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Apple's B2B team manages critical integrations with Apple's supply chain partners such as manufacturers, logistics providers, banks, resellers and business customers. We are seeking a motivated and technically adept Security Engineer to join our team. Join the Apple B2B Team as a Sr. Security Engineer to contribute to the development, implementation, and maintenance of security measures within our B2B platforms. This role provides an excellent opportunity for professional growth in the field of cybersecurity.", "description": "As a Sr. Security Engineer, you will be responsible for: Code Reviews: Collaborate with application development teams and review code for security issues, ensure the secure coding standards and best practices. Utilize static and dynamic analysis tools to assess the security posture of software code. Security Assessments and Threat Modeling: Conduct threat modeling exercises to identify potential security risks in applications. Work closely with development teams to prioritize and address security concerns based on threat assessments. Security Tooling: Utilize various security tools and technologies to automate security testing. Incident Response: Assist in responding to security incidents, conducting investigations, and implementing corrective actions. Work collaboratively with the incident response team to improve incident detection and response capabilities. Security Awareness: Contribute to security awareness training for software development teams. Stay updated on the latest security trends, vulnerabilities, and industry best practices. Ensure that applications follow relevant compliance standards such as PCI, SOX, PII, GDPR Analytical and Automation Mindset: We seek candidates with strong analytical skills to efficiently address sophisticated security challenges and derive actionable insights. An automation approach is also valued, as candidates who can automate security processes contribute to efficiency, proactive threat detection, and reduced manual errors. We promote innovation and use of new technology to further improve our creative output. We're looking for a dedicated and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you.", "key_qualifications": " ", "preferred_qualifications": "Experience with cloud security principles and technologies, including container security, Familiarity with security incident response and root cause analysis, Knowledge of software development lifecycle (SDLC) security practices, Experience with security audits, compliance assessments, and remediation efforts, Relevant certifications such as CISSP, CISM, CEH, or CompTIA Security+ is desirable.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554025"}