{"title": "Instructional Designer, Retail Customer Care", "summary": "At Apple, we believe in creating a fun and inclusive work environment where creativity and innovation come about as talented people from diverse backgrounds approach problems with varying perspectives. Knowing that even the smallest of details matters, we see each customer contact as an opportunity to engage, delight and inspire! Inclusion is a shared responsibility, and we hold ourselves and one another accountable for bringing everybody in. We are looking for a hard-working and motivated instructional designer to join the Retail Customer Care Quality team. You will collaborate with cross-functional business partners to design and create course materials with focused learning objectives in support of our Retail Customer Care network. You will coordinate with global and regional business partners to create learning solutions based on identified emerging trends, needs, and gaps within the business and assess current learning content. You will evaluate training solution effectiveness and propose adjustments or different strategies as needed to cross functional partners and global peers.", "description": "- Collaborate with regional and worldwide learning team members in content development, content maintenance, and developmental projects - Design learning experiences to support a variety of learning types and audiences, including but not limited to eLearning, micro-learning, classroom, virtual classroom, and blended learning experiences - Create and follow training needs analysis process - Evaluate data to determine discovery and partnership needed to complete design plans - Conduct content reviews with subject matter experts and key collaborators and incorporate their feedback  - Facilitate and host Train-the-Trainer sessions - Utilize templates and guides to prepare content for publishing in a learning management system (LMS) - Create learning assessments and apply data and analysis to determine learning effectiveness - Update existing content to maintain its relevancy and accuracy - Perform other duties as assigned", "key_qualifications": "Empty", "preferred_qualifications": "Knowledge of, and experience within, industry-proven and trending learning and development disciplines, processes, approaches, and technologies Understanding of HTML5 based authoring tools, virtual collaboration tools, and enterprise LMS systems Experience working with global and virtual teams Adaptive to changing technologies, process, and environments Experience hosting Train-the-Trainer and content business review sessions Ability to work efficiently under deadlines in fast-paced environment with numerous projects on hand Project management experience Familiarity with graphic design, video editing, image manipulation, and formatting Strict adherence to company policy on confidential materials", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555755"}