{"title": "Fitness Software Integration Manager", "summary": "Imagine what you could do here at Apple. Innovation runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. As the manager of Fitness Software Integration team, you and your team play a critical role in the lifecycle of Fitness software components contributing across all of Apple’s software platforms, primarily iOS, watchOS, and tvOS. We are part of the Fitness Software team, which is responsible for developing the user-facing experiences like the Fitness App on iOS, Workout, Activity, Depth, and Mindfulness on watchOS, and Fitness+ across all platforms. We work closely with a wide variety of teams across apple including QA, Project Managers, Design, Product Marketing, Location and Motion technologies, Fitness Technologies, and more. We work across all of the groups to empower all of the capabilities of your devices to provide you with an extraordinary Fitness experience.", "description": "Software Integration breaks down into two key components. First is bug screening, which involves triaging, understanding, prioritizing, and categorizing all incoming bug reports for the Fitness software components. This is an important and difficult task as the volume of incoming bugs is high and you have to quickly separate bugs of varying priority and importance, diving quickly into the details of each issue. The second component of the role is Integration and Pre-submission testing itself. Integration involves packaging up the changes from the engineering teams and then carefully testing via a combination of manual and automation before submitting the components to the larger software build trains. Across multiple major software trains and dependencies, there is often extra complexity and diligence involved to make sure the end result is successful. Both roles are very dynamic and changing with different technologies, priorities, and projects coming into play. Both roles also involve embedding and close collaboration with partner engineering and quality teams, attending standup and other meetings to understand the state of projects. As manager of the team, you are responsible for empowering and growing your engineers and knowing the latest or ahead of the curve of internal Apple technologies involved in Screening and Integration. As the manager of the team, you may also have to step into these roles and fill gaps or provide coverage to ensure processes are working well. You will also be responsible for fostering an inclusive work environment that values and listens different perspectives on and off the team. There is lot we can do using more automation and new technologies like natural language processing and large language models to improve and streamline all of the functions of the team. The end goal is helping to deliver high quality software that our customers will love.", "key_qualifications": "", "preferred_qualifications": "You will need deep technical knowledge and confirmed computer science fundamentals to be successful in this role, but a specific degree or concentration is not required. Critical problem solving skills with attention to the details and nuance of sophisticated issues. Confirmed ability to encourage, mentor, train, and develop team members to deliver high quality software. Experience adapting to challenges, providing support, and leading by example in a constantly changing environment. iOS swift development and or python experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556307"}