{"title": "Panel Design Engineer", "summary": "Do something different! Apple is looking for an elite engineer that can help identify and incubate new display technologies. You will work with both suppliers and internal teams at Apple to craft the display related technologies that go into Apple products. A successful candidate will not only need to develop new tech, but also educate a broad audience of people at Apple about their benefits and tradeoffs.", "description": "-  Evaluate and analyze trade-offs of state of the art panel designs, architecture, driving schemes, integrated circuitry and interface technologies\n\n-  Collaborate with cross functional stake-holders to establish panel requirements\n\n-  Define panel electrical architectures that enable the best display performance through total system optimization including pixel design, active matrix addressing, integrated driver circuitry, power architecture, and driver/panel interface\n\n-  Conduct panel circuitry design and simulations, layout studies, and parasitics extraction\n\n-  Support panel design and tape-out activities\n\n-  Electrical and optical characterization of displays, conduct failure analysis and define corrective action DOEs", "key_qualifications": "Proven track record with hands-on experience in the design and development of active matrix displays or similar technologies\n- Background in display panel design and/or analog/mixed-signal IC design; ability to perform circuit & panel design, layout, RC extraction, modeling and SPICE simulation\n- Knowledge in flat panel display technologies, related fabrication processes and device physics is a plus\n- Experience in panel testing, validation, failure analysis, and defining corrective DOEs\n- Proficiency in data analysis using coding languages such as Python or Matlab\n- Strong analytical, critical thinking, and problem-solving skills\n- Strong presentation and communication skills", "preferred_qualifications": "", "education_experience": "B.S. in EE or related field with minimum 3 years of experience of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534262"}