{"title": "North Asia Commercial Program Manager", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! Here on the Apple Store Online team, we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a North Asia Commercial Program Manager to help us do extraordinary things. The North Asia Commercial Program Manager will collaborate with partners across Apple to develop, launch and operate localized global programs that optimize customer experience and drive commercial performance with a focus on Japan and Korea markets. The role will identify program opportunities based on market landscape, customer feedback and commercial partner input. Key Cross-Functional partners include Ownership Operations, Retail Engagement and Marketing, Apple Online Store, Retail Fulfillment Operations, and Retail Technology. Inclusion is a shared responsibility, and we work together to cultivate a culture where everyone belongs and is inspired to do their best work.", "description": "The North Asia Commercial Program Manager is responsible for managing select Carrier, Monthly Payments and Trade-in programs within the APAC region and to stitch these across Apple to ensure smooth, consistent performance of our consumer-facing offerings. This requires supporting the day-to-day execution of program activities, including marketing, customer experience issues, process improvement and co-ordination with Apple’s Carrier, Monthly Payments and Trade-in partners across APAC. One of the key elements of the role is to develop program roadmap (including capital investment opportunities) based on the respective local landscape, purchasing trends and Apple’s strategy. The successful candidate will also need to define the Go-To-Market strategy for new countries and lead the execution/implementation of key programs. This role will also work closely with internal teams to define external partner strategy and drive commercial as well as contract negotiation with select partners. The role requires direct management of program operational elements such as issue escalation, new product introduction readiness and offer/pricing management. In addition, this role will drive regional program performance through analysis and partnership with Apple Retail Stores and Apple Online Store business teams.", "key_qualifications": "Expert knowledge of the retail industry, commerce, and financial services (8-12 years experience), Proven track record delivering consumer-facing programs that have a great customer experience while delivering strong business results, Partner management experience and expertise, Demonstrated ability to prioritize, plan, and implement strategies, programs and projects successfully, Demonstrated ability to analyze data and information, identify trends and problem statements to support the development of innovative solutions and strategies, Dedication to identifying and communicating innovative ideas in a way that gains consensus and builds partnership, Contribution to an inclusive environment through respecting each others’ differences and having the curiosity to learn, Demonstrates Apple’s values of inclusion and diversity in daily activities", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in relevant field (MBA a plus) or equivalent experience", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519408"}