{"title": "Privacy Compliance Engineer, Wallet & Payments", "summary": "Are you passionate about protecting customer data and privacy? Are you a strong engineer passionate about building products that change the world? If so, you might be right for our Privacy Compliance Engineer position. This position’s focus is on the privacy compliance within the Wallet, Payments and Commerce Engineering team. This is a highly technical, hands-on role that requires experience and expertise managing privacy in complex environments. Apple is a place where extraordinary people gather to do their best work. We don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. We believe it's the diversity of these people and their ideas that inspire the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple to become a part of our talented team!", "description": "You will work across all Wallet, Payments and Commerce products and participate in discussions on bleeding edge technical implementation new and existing privacy requirements, including CCPA and GDPR. You will partner with technical experts in their products and Apple’s legal counsel and analyze existing systems and processes against global privacy requirements and architect changes when needed to improve compliance with the Regulation. Conduct Privacy Impact Assessments (PIA’s) for projects and products Assess system design, implementation, and release processes. Identify areas of privacy risk, and work with cross-functional teams to mitigate Effectively integrate compliance risk/context and technical knowledge to address complex problems. Establish continuous monitoring processes to effectively track and manage compliance with security and privacy controls. Deliver security and privacy awareness training program(s) Contribute to company privacy governance, policies and procedures and implementation of security controls supporting privacy objectives Identify and assess new and emerging privacy risks, and reporting these to management", "key_qualifications": "Knowledge of software development lifecycle, infrastructure and data management techniques Excellent collaboration and relationship building skills. Capability to work effectively with a mix of technical and non-technical teams across multiple functions and levels to resolve concerns and issues. Previous project management experience, or experience in a fast-paced dynamic environment with the capability to prioritize and switch context between multiple ongoing, complex, projects on a regular basis. Superb written communication skills Deep passion for user privacy", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science, Engineering, or related discipline, or commensurate experience Familiarity with security and privacy standards such as GDPR, CCPA, SOC, ISO 27001 etc. 5+ years of experience in analyzing and implementing privacy frameworks (HIPAA, GDPR, CCPA etc.); 5+ years of experience assessing project and product privacy risks and recommending mitigating controls, creating privacy assessment templates and administering privacy assessments with project and product teams", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551183"}