{"title": "Partner Communications Manager, Italy", "summary": "The role you're looking at is part of the Marketing Communications (Marcom) group at Apple. Our team works to ensure that the company’s strategic products are conveyed in the most compelling way to a wide array of audiences in multiple markets and languages across Europe.", "description": "Develop deep understanding of the Apple brand, the partner’s brand, and the local market to help drive an innovative partner strategy and amazing partner creative for all Apple products and services. Ensure timely and seamless development of all partner-led communications from advertising to the partner’s owned marketing channels in-store and online. Ensure strong planning and execution supporting Apple’s new product introductions and seasonal partners’ campaigns - Provide partners the resources for campaigns execution (assets, guidelines, BOX, meeting room). Reviews and approvals of Partners’ communications. Work closely with the Sales organization to understand business opportunities and challenges that might influence our marketing and comms strategies and solutions. Provide market and partners’ insights to the rest of the Marcom group to develop programs to help drive awareness, consideration and sales. Set up robust tracking systems to measure campaign’s performance. Monitor, screen grab and document partners’ activities.", "key_qualifications": "Extensive brand/marketing communications experience ideally from leading industry, or affiliate marketing / digital agencies. Experience with integrated communications and account/client relationship management. Deep understanding of digital platforms (social, eCRM, e-commerce platforms, content, performance marketing, digital in-store) and how they can be leveraged to deliver the most compelling product experience throughout the customer journey. Experience working within a recognized creative/digital-driven organization is a strong plus. A highly detail-oriented team player with persuasive/negotiation skills. Knowledge of marketing and channel environments and curious about trends and future developments in this area.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Full business level fluency in Italian and English. This position is based in London, UK.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548242"}