{"title": "Cloud Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Health team is looking for a hardworking Sr. Cloud Engineer with a background in large scale engineering support. You will enjoy using technology to automate solutions and optimize outcomes focusing on data/backend engineering, continuous integration and continuous deployment in a fast-changing world of software delivery.", "description": "Apple's Health team is seeking a high-energy Sr. Cloud Engineer. As a member of our dynamic group, you’ll have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day.", "key_qualifications": "Hands-on experience in engineering, Cloud, or as a software engineering staff member; Strong programming and scripting fundamentals (Python/Bash); Comfortable with weekly on-call rotation; Modern web services architectures, cloud platforms such as AWS, GCP; Source control management such as Git, SVN; Linux fundamentals, experience with hardening operating system images; Hands-on experience with Log mining frameworks like Splunk, Elastic, Prometheus, Loki etc; Container services(Docker/Kubernetes), UNIX system administration; Grafana or similar for investigating or monitoring problems on systems; Release and management of NoSQL, Zookeeper, Spark, Mesos; In-depth knowledge of build/release systems and process; Excellent oral and written English communication skills; BS Computer Science or equivalent experience.", "preferred_qualifications": "Passionate about Continuous Build, Integration, Test, and Delivery systems; Able to quickly learn new and existing technologies; Strong attention to detail and excellent analytical capabilities; A desire to write tools and applications to automate work rather than do everything by hand; Self-motivated, pro-active and solution-oriented individual", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545218"}