{"title": "HID -  Software Engineer", "summary": "The Human Interface Devices Software team is responsible for delivering high-quality drivers, frameworks and tools supporting sensing technologies across all Apple products. Primarily supporting the multitouch technology, we have deep experience developing systems software and building stacks that enable the best user-experience. We work closely with Algorithms, Firmware, Design, and UI teams to ensure sensor and software performance is optimized across all layers of the stack.", "description": "We are looking for an engineer to work on drivers, frameworks, and tools for iOS, macOS, tvOS, and watchOS. In this role, you will maintain existing software and design new software stacks for future products and sensing technologies. Ideally, you have experience dealing with human factors, care deeply about user experience, enjoy supporting technology investigations, and are comfortable jumping between multiple levels of the software stack.", "key_qualifications": "2+ years experience developing system software such as drivers or frameworks\nStrong C/C++ and object-orientated programming skills\nExcellent debugging skills\nExperience with profiling code in both kernel and userspace.\nAbility to quickly familiarize yourself with code you’ve never seen before, and understand the pertinent functionality\nStrong verbal and written communications skills\nSelf directed, analytical, and work well in a team environment\nComfortable working at both higher and lower levels of software", "preferred_qualifications": "", "education_experience": "BS or MS in CS/CE", "additional_requirements": "-  Experience designing SW interfaces or APIs\n-  Experience implementing customer-facing features is a plus\n-  Familiarity with IOKit, Objective-C, and other iOS/OS X", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539784"}