{"title": "Machine Learning Engineer, SIML", "summary": "We work on the cutting edge of Artificial Intelligence and Machine learning to build intelligent system experiences for the world’s most impactful platforms such as iOS, macOS, tvOS, etc. This system-wide intelligence aims to provide best-in-class solutions for problems that are critical to the success of 1st and 3rd party applications in Apple platforms.", "description": "As a ML engineer in the SIML HOUr team, you will work with large-language models and multi-modal generative models, following closely groundbreaking advancements in this domain, to adjust and apply them to internal use cases. One main mission of the role is building adapters on top of large models to enable specific use cases, having a direct impact on features across the Apple ecosystem. The work will involve translating high-level product goals into different levels of the stack. From defining the data needs, manipulating data, fine-tuning pre-trained models for the task, evaluating it across relevant metrics and power and performance, prototyping and delivering it for integration. The work will be multi-functional, collaborating with ML researchers, software engineers, product design, and other teams. Be expected to iterate quickly to deliver a high quality model, that is performant, reliable, tested extensively, and documented. Apart from model development, the role will also give the experience of scoping projects, estimating timelines, multi-functional planning and presenting your work to organization leadership. If this could be of interest, please apply!", "key_qualifications": "Familiarity with Python, PyTorch, TensorFlow, Hold yourself and others to a high bar when delivering a model, Have great communication skills, for collaborating across many participating teams, Hands-on experience with LLM-based workflows: prompt engineering and parameter-efficient fine-tuning of pre-trained LLM, Experience with multi-modal setting, specifically Vision and Language, Ability to rapidly iterate with fine-tuning toolboxes, Ability to translate high-level product goals into data, model and metrics requirements, Awareness and attention to model complexity, power and performance.", "preferred_qualifications": "", "education_experience": "Master's or Ph.D. in Computer Science, Artificial Intelligence, Machine Learning, or a related field", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal-opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509737"}