{"title": "Hardware Systems Design Electrical Engineering Manager - iPhone", "summary": "Would you like the chance to lead a team of engineers and work on the development of one of the most influential products in the world? The iPhone team is looking for a highly motivated individual to be a leader in its world-class engineering team to deliver the future of iPhone to our customers. The role calls for a technical engineering manager who is motivated by the chance to make design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!", "description": "This is an outstanding leadership position in hardware design that starts at product concept and continues all the way through to mass production. You will be at the center of iPhone product development with a critical impact on overall design. In this role, you will manage and support a team of talented Electrical Engineers working on designs that continually push the boundaries of technology and ultimately improve the iPhone user experience. The role involves the design and integration of custom hardware into constrained systems, as well as working daily with multi-functional technology teams in a fast-paced environment. There will also be opportunities for international travel.", "key_qualifications": "", "preferred_qualifications": "2+ years of lead or management experience, Exposure to solving unwanted coupling and interference between subsystems, Design of complex system architectures, Proven track record of leading dynamic multi-functional teams, Familiarity with the challenges of taking a product from early architecture through to production, Hands on experience with lab test equipment to debug difficult/intermittent hardware issues, Strong fundamentals in Signal and Power Integrity, Understanding of low voltage power regulation and delivery, Experience in prototype design and validation of custom silicon, Ability to use scripting languages to assist with hardware development", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559974"}