{"title": "Machine Learning Systems Engineer", "summary": "As part of Apple Cloud Platform, our team is responsible for building libraries and services which form the foundations of critically important systems at Apple. Specifically, as a ML Systems Engineer, you will focus on building software stack to run large machine learning models (generative AI, LLMs) over multiple high performance Apple Silicon SoCs.", "description": "We write software in Swift, Python and C++ to build services and infrastructure around innovative generative AI and machine learning. We write performant and scalable frameworks to distribute and coordinate ML inference tasks to different hardware acceleration IP blocks on different SoCs; we build jobs to deploy and load models, and support high level machine learning platforms like PyTorch. Our software has a growing user base and the team is looking to expand to build amazing products making it a truly exciting place to work. We’re a collection of highly skilled and friendly engineers who value each other’s opinions and experience. We strive for excellence and believe strongly in the quality of our output. We have formed a team of domain experts who specialize in specific core subject areas, and also have broad experience of cloud software services and platforms. You will integrate inference code into a full service stack to ensure that user traffic is served reliably and performantly, and will have a strong focus on developing code that is easy and safe to develop, update and monitor.", "key_qualifications": "Practical experience running and evaluating machine learning models for quality and performance metrics", "preferred_qualifications": "", "education_experience": "- B.S. in Computer Science or other numerate subject, with 6+ years experience; or\n- M.S. in Computer Science or other numerate subject, with 4+ years experience", "additional_requirements": "-  Quality focus - produce reliable, maintainable, deliverable software\n-  Comfortable diving deep - working across multiple levels of abstraction\n-  Good at handling relationships & communication - collaborate well with colleagues across a wide range of functions\n- Advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n- Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you are applying for a position in San Francisco, please click here.\n- Apple participates in the E-Verify program in certain locations as required by law. Learn more.\n- Apple's committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Learn more.\n- Apple is a drug-free workplace. Learn more.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528911"}