{"title": "AIML - iOS Engineer Voice Input/Dictation, Siri and Information Intelligence", "summary": "Would you like to shape how customers interact with Apple devices? Would you like to contribute your talent and skills to elevate the customer experience? Our team focuses on how voice can be used to take on everyday tasks efficiently like writing a text, crafting emails, taking notes and so much more. We build, maintain, and evolve the on-device user interfaces and frameworks that power the voice input experience across iPhone, iPad, mac, Apple TV, Watch, and Vision Pro. We work on exploring new innovations to improve the voice input experience for customers around the world in the many languages they speak. If you're passionate about using voice as an input method, have strong ownership and good communication skills, and enjoy seeing your work used all over the world then we have the job for you!", "description": "As a member of our team, you will make substantial contributions to the voice input experience on iPhone, iPad, Apple TV and Watch. Daily duties will include working with multi-functional teams to drive Voice Input features to support new initiatives, developing UI and framework improvements to support existing and new features, shipping high-quality software, being responsive to emerging issues, as well as helping develop a vision for the future of the product.", "key_qualifications": "Strong Swift, Objective-C, or C/C++ coding skills\nSystem programming experience with daemons, frameworks, multithreading, and IPC (XPC).\nPerformance analysis and tuning experience including memory usage, CPU utilization, - Power/Battery usage, leak checking, etc.\nExcellent communication, organizational skills, and ability to work in a diverse group\nHighly professional, with the ability to deliver solid work on tight schedules", "preferred_qualifications": "", "education_experience": "BS degree in Computer Science / Engineering or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541464"}