{"title": "Embedded Security Engineer", "summary": "Software is often referred to as the “soul” of Apple’s products. In this position you will play a critical role in ensuring the security of the systems and infrastructure used to manage, build, and distribute, Apple’s software. We are looking for a proficient Embedded Security Engineer to join our team and contribute to the protection of our critical assets. The ideal candidate will be responsible for conducting comprehensive threat modeling and security assessments, as well as supporting our engineering teams in adhering to established security standards and requirements. This role involves a blend of technical acumen and collaborative skills, as you will develop solutions to identified risks, write test cases for security controls, and actively participate in offensive security assessments.", "description": "We’re looking for an exceptional candidate with a proven track record in making a security difference in the projects under their purview. Passion for security and development excellency is required. In addition to solid technical skills, candidates should have strong interpersonal and communication skills, be self starters that are comfortable with the unknown and are capable of mentoring engineers and more junior security teammates. Additionally a candidate should have experience in the following areas: Threat Modeling and Security Assessments, Support Engineering Teams, Development of Technical Security Solutions, Security Assessments.", "key_qualifications": "Proven experience in threat modeling, security assessments, and penetration testing. Strong understanding of cybersecurity principles, frameworks, and standards. Experience with various programming languages and security tools. Excellent analytical, problem-solving, and communication skills. Previous experience in a Software Engineering or Operations role. Experience with python, perl, golang, bash, kubernetes.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. [Learn more](https://www.apple.com/careers/us/benefits.html). Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548084"}