{"title": "Senior Software Engineer, Apple Services Engineering", "summary": "Imagine what you could do here. The people here at Apple don't just build products — we craft the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. This team is more than a group of engineers -- it's a group passionate about Apple products, services, and engineering culture. The team is seeking an experienced Software Engineer to focus on building the next generation of cloud services. Your work will power marquee Apple experiences such as FaceTime, iCloud Drive, Photos, Backup, and Push notifications services while also helping build new ones.", "description": "We are a high-leverage team designing, building, and growing Apple's privacy-focused platform enabling many of Apple's signature apps and experiences. Our work impacts over a billion users and is essential to the success of Apple's growth in services. Our team is growing, and you will have the unique opportunity to help us shape our culture and processes. As part of this role, you will: • Collaborate to solve complex problems with the opportunity to invent innovative solutions • Evolve the design and architecture to support the continued growth of our platform • Develop the next generation of cloud platform that powers FaceTime, iCloud Drive, Photos, Backup and Push notifications services • Partner with various teams across Apple to develop features and functionality to enable new experiences in the Apple ecosystem", "key_qualifications": "5+ years of experience building scalable microservices Experience with Containerization and Serverless Technologies Experience collecting high-level requirements and translating them into pragmatic solutions Proficient with various programming languages such as Java/Python/Go for automation or integration with multiple APIs (RESTFul, gRPC, etc.) Experience operating and developing infrastructure and services in public cloud environments (AWS, GCP, or Azure) Enjoys learning new skills and technologies Solid communications skills, capable of working with cross-functional technical and business teams and varying levels of management in a professional manner", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in an engineering-related field, or equivalent related experience. Advanced degree preferred.", "additional_requirements": "Experience in the below is a plus: • Understanding of security & cryptography • Programming Languages: Go (golang) and Java", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542840"}