{"title": "Content Developer for Apple Online Retail Engineering", "summary": "The Online Retail Engineering team at Apple is seeking a hard-working, diligent Content Developer to handle data within our CMS and catalog management tools. This role will contribute to the success of the team by setting up content and guiding data infrastructure for new features and projects that the Apple Online Retail Engineering team delivers into production. Your work will be seen by millions of customers world-wide.", "description": "The Content Development team works on developing and improving features of the customer journey for all of Apple's e-commerce customers. In this role, you will work alongside many dedicated individuals who design, engineer, validate, and ship these phenomenal e-commerce features. Your role will be to set up and manage multiple types of data that are key to these new features. Your day-to-day would include setting up content, products, and media assets in the Publishing tools to support engineering projects and testing. You would track, package, and deploy all project data to production in accordance with sophisticated release plans. You will work proactively to achieve a bug-free environment, coordinate with off-shore and onshore resources to ensure tasks are completed efficiently, and produce detailed documentation of feature setup", "key_qualifications": "No information available", "preferred_qualifications": "Attention to detail, and the ability to work with minimal supervision, Demonstrated experience working on large, multi-functional projects, Strong decision making and prioritization skills; have experience driving sophisticated production schedules with dependencies and challenging priorities, Ability to build rapport, credibility and influence across a large, matrixed organization, Comfortable upholding interpersonal values and standard methodologies, while balancing competing time-to-market pressures and maintaining business relationships, Possess a passion for effective communication, both written and verbal, with technical and non-technical multi-functional teams, Able to anticipate, troubleshoot, and resolve problems on the fly, Strong technical background, and an ability to collaborate optimally with engineers, Passion for delivering an excellent user experience for both business-users and customers, Comfortable working in a rapidly changing environment where ambiguity and short turnaround schedules are the norm, High degree of ownership and accountability, 2 or more years' experience with CMS tools such as WordPress, Joomla, Drupal, or AEM, 2 or more years' experience with Catalog Management tools such as FileMaker, SAP CRM, or Salsify, 2 or more years' experience with global e-commerce shopping experience development and execution, Experience with a repository such as SVN or git", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556612"}