{"title": "Engineering Project Manager - Connectivity Platforms ", "summary": "The SWE Connectivity EPM team is looking for an engineering project manager with strong OS & HW fundamentals, excellent communication skills, and a desire to work with an amazing team. This cross functional role will involve working with Hardware, Software, Factory teams to track and manage the delivery of iOS/macOS Software to the module & system factory across different Apple products. A great opportunity for a project manager who is interested in technology and wants to help drive and deliver software used in various Hardware builds.", "description": "You will oversee the software deliverables to the wireless module & system factory during various hardware builds starting with development phase to mass production. This role requires an energetic and motivated individual with excellent communication, organization, and technical skills to work cross functionally with other organizations. Communication of status and risks to all levels of management is an expectation. Understanding of wireless technologies and hardware is a plus.", "key_qualifications": "5+ years of working experience in software and project management\nStrong program management skills with cross functional teams\nSelf-motivated and pro-active with demonstrated creative and critical thinking\nAbility to drive multiple programs, prioritize and solve complex problems\nAbility to understand and mitigate risks associated with programs\nExceptional verbal and written communication and presentation skills\nKnowledge of Software and Hardware development lifecycle\nKnowledge of WLAN & BT PHY/MAC and RF", "preferred_qualifications": "", "education_experience": "BS/MS EE/CS/CE or equivalent", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200507249"}