{"title": "OEM BPR Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work! Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "In this role, you will work with a globally dispersed cross-functional team to onboard new OEMs, add new supply chain capability, drive process optimization, increase scale & efficiency. You’ll plan, mobilize, and implement medium to large scale global projects, ensuring system changes are well tested and signed off by before moving into production. You will be the prime mover of your projects including collaborating with WW and Regions, resource planning with OEMs, communications and project governance, risk management, change management, and readiness. You’ll connect the dots, build trust and understanding between groups, and orchestrate the multitude of activities needed to make your projects successful.", "key_qualifications": "", "preferred_qualifications": "Experience B2B communications (EDI, XML, SFTP, Restful Web Services). Understanding of manufacturing, planning or logistics business processes. Proficient at managing multiple projects simultaneously and proven track record to manage deadlines. Experience with global projects, incorporating regional and country-specific details. Shown expertise in leading and maintaining project team’s awareness of big picture objectives while also helping them navigate the details. Ability to develop options and broker decisions across diverse project and management teams; assess and mitigate project risks and respond with urgency to emerging issues. Ability to navigate through ambiguity to clarify objectives and execution plans; unafraid to forge a new path toward an objective that’s never been done before. Ability to work in fast-paced environment with time-critical launch dates (not typically subject to negotiation.) . Good work ethics and passion to go beyond what is expected. Clear, well-curated written and verbal communication, including polished executive presentations. Ability to brainstorm solutions and contribute new strategies and options for all projects. Excellent analytical skills to investigate business or systems problems to expose root causes and identify solution options. Ability to diagram business process flows and elicit business requirements, user stories, and use cases. Direct experience with Information System, Business Enterprise Application, ERP system, Order Management System, Shop Floor Management, and/or Warehouse Management System.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556865"}