{"title": "Product Management Team Lead, Mac", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. When you bring passion, dedication, teamwork, and a sense of ownership to your job, there's no telling what you can accomplish! We're looking for a highly motivated Team Lead to join the Mac Team as part of the Worldwide Product Marketing broader team and community. As a member of our Worldwide Product Marketing group, you’ll represent the customer throughout a product’s journey from concept through development and launch.", "description": "The Product Management Team Lead within the Mac team is responsible for product management and marketing of several product lines within the Mac hardware team. As a team lead, you will have a team of talented product managers and will be responsible for managing daily operations, planning, and developing skills. You will work with key cross-functional partners from Engineering to Operations and Design to represent our customers’ needs and influence and impact new product definition. You will also drive product management for the currently shipping product lines and lead all marketing deliverables for new products in collaboration with Marketing and Geo teams.", "key_qualifications": "", "preferred_qualifications": "Successful track record of working closely with design and engineering teams during the full product lifecycle, including research, planning, implementation, and launch. History of managing teams and scaling organizations through processes that drive team growth, efficiency, and productivity. Exceptional organizational, communication, and leadership skills with experience in building consensus cross-functionally, driving collaboration by building positive relationships and bringing to bear data and handling high stakes decisions with ease with the ability to cut through ambiguity. Proven oral and written communication skills including product storytelling; ability to explain technical concepts thoughtfully to non-technical partners and deliver compelling presentations for a broad audience including customers, media, analysts, and industry experts. Apple Keynote presentation-building skills preferred. Structured thinker and keen strategist who understands technological and social trends, including their differences across geographies. Demonstrated ability to prioritize investments accordingly and drive fast decision-making. Ability to operate seamlessly between highly detailed and technical situations and strategic business situations. Experience with computer technology. Experience in professional customers, workflows, and software (video, music, 3D, development, science, AI, medical, etc.) is a plus. Travel required for product launch. BS/BA degree, MS/MA/MBA preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $238,300 and $358,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560147"}