{"title": "Engineering Project Manager - ETS", "summary": "At Apple, we rely on our employees diverse set of backgrounds and perspectives to champion innovation through extraordinary ideas to surprise and delight our customers. These ideas can come from anywhere. Will that next phenomenal idea come from you? The global ETS eBusiness team is responsible for delivering system connectivity both internally and externally using industry standard solutions and in-house developed systems and platforms. We are seeking a program/project manager to work in our PMO. Our PMO lead all our global strategic initiatives working with leading edge technologies. You will have a background in engineering and project management. Do you feel a personal stake in everything that you work on, thrive in fast-paced environments with lots of ambiguity, and enjoy working with complex technologies? Do you foster strong relationships, build trust, and influence without direct authority? Do you communicate openly and clearly, collaborate enthusiastically, and value a culture of healthy debate? If so, we want to talk to you!", "description": "This is a hands on role, working and establishing relationships with our business, finance and operations teams understanding what their needs are and translating those needs into innovative solutions with our engineering teams. You will take responsibility and feel personally accountable for the projects you deliver. You have a curious mind, always seeking to learn how things work. You thrive in uncertainty and strive to bring clarity and focus in a fast paced environment. You will independently lead multiple concurrent programs and projects through the full lifecycle including scope, requirements, project planning, delivery, and prioritization. You will drive on time delivery and deployment, establishing checkpoints, and communicating status updates to internal and external stakeholders. You will play a key role in the strategic direction of our global organization by delivering these key strategic projects and programs.", "key_qualifications": "8+ years proven experience delivering cross functional programs and projects. Excels in relationship building with strong ability to connect with people at all levels and develop partnerships. Knows how to cut through ambiguity by establishing priorities, developing plans, anticipating risks and having difficult conversations. Is self-motivated and enthusiastic, enjoys solving problems and has demonstrated creative and critical thinking capabilities to think differently. Best-in-class communication and presentation skills (written & verbal) to all levels of an organization Overall, a highly driven, results-oriented, problem solver who will drive programs to deliver value quickly to our customers", "preferred_qualifications": "Bachelor’s Degree or deep related field of work experience. Project management certification preferred Agile development methodology Supply Chain background or knowledge is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536733"}