{"title": "Machine Learning Engineer / Generative AI Engineer", "summary": "Are you interested in creating products that use machine learning and computer vision in novel and interactive ways? Are you looking to apply your expertise to produce transformative features like Live Text and Scribble? Using generative models to build highly visible products that are getting into the hands of hundreds of millions of users? We are an applied machine learning team distributed between Zurich in Switzerland and Cupertino in California, searching for a motivated research lead engineer to help develop the future of ML models to power products around text and freeform drawing recognition and generation. We work closely with diverse teams throughout Apple.", "description": "As a member of the team you will be responsible for bringing innovative ideas to our next generation of products, applying modern machine learning methods to solve problems that matter. The work spans the entire product life cycle from project inception to shipping models on billions of devices. We are seeking an engineer who will be responsible for prototyping new features as well as contributing to the overall design and development of existing components. The ideal candidate should have experience in computer vision, speech recognition, deep learning, and/or other applications of machine learning systems. Apple's most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "", "preferred_qualifications": "Experience with modern machine learning algorithms including generative models, Experience with image processing, computer vision, speech recognition, or natural language processing, Strong programming, debugging, and design skills, Excellent problem solving, critical thinking, and interpersonal skills, Ability to produce creative and innovative solutions to challenging problems, Enthusiastic about building end-to-end experiences using machine learning, Experience building deep learning toolkits with modern tools, Detailed knowledge of one or more of the following programming languages: C++, C, Objective-C, or Swift, Detailed knowledge of a common ML toolchain such as PyTorch, Tensorflow, or JAX, Proficiency with Unix, iOS, or macOS development", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554644"}