{"title": "Senior Accessibility Quality Engineer Apple Services Engineering.", "summary": "Are you passionate about ensuring Apple's media products (Music, Podcasts, App Store, TV) and products are accessible to everyone? Join us in the dynamic field of accessibility to make a profound impact on how our apps and products serve users relying on alternate modalities and workflows. We're seeking individuals who can innovate, advocate, and elevate the accessibility standards of our products.", "description": "The ASE Accessibility Quality team seeks an individual passionate about enhancing the accessibility of our products through rigorous testing. Expand knowledge base of existing accessibility features. Acquire proficiency with testing tools and processes, including automation, triage, developer tools, web testing tools, and standards. Identify gaps in current testing procedures and drive solutions through advocacy. Develop new accessibility test plans for upcoming features. Collaborate across teams at Apple to establish a network of accessibility advocates. Compile clear and precise reports to facilitate prioritization in fast-paced development cycles. Provide quality status updates to executive-level stakeholders and escalate issues within a diverse, cross-functional team.", "key_qualifications": "3-5 years of experience in software tracking and bug life cycles. 3 years of experience in a quality assurance role. Familiarity with WCAG/web accessibility testing standards. Knowledge of hardware devices that interface with Apple products (e.g., Works with iPhone Hearing aids, Braille displays, switch controls). Proficiency in languages and test frameworks such as Python, JavaScript, Swift, PyTest, SwiftUI, XCTest, XCUI, Nimble, Selenium, Appium, and Cucumber. Extensive experience and deep knowledge of accessibility features and technologies such as VoiceOver, Voice Control, Full Keyboard Access, and Switch Control, as well as familiarity with screen readers like JAWS, Narrator, NVDA, and TalkBack. Strong understanding of Accessibility design principles, especially in human interface design contexts. Basic understanding of the software development life cycle, including creating comprehensive test plans, analyzing logs, enabling development features for testing, and utilizing test tools and frameworks like XCUI and Accessibility Inspector. Ability to teach and advocate for accessibility features, and effectively communicate with engineering teams. Familiarity with UI Testing and QA testing methodologies.", "preferred_qualifications": "Extensive experience and deep knowledge of accessibility features and technologies such as VoiceOver, Voice Control, Full Keyboard Access, and Switch Control, as well as familiarity with screen readers like JAWS, Narrator, NVDA, and TalkBack. Strong understanding of Accessibility design principles, especially in human interface design contexts. Basic understanding of the software development life cycle, including creating comprehensive test plans, analyzing logs, enabling development features for testing, and utilizing test tools and frameworks like XCUI and Accessibility Inspector. Ability to teach and advocate for accessibility features, and effectively communicate with engineering teams. Familiarity with UI Testing and QA testing methodologies. 3-5 years of experience in software tracking and bug life cycles. 3 years of experience in a quality assurance role. Familiarity with WCAG/web accessibility testing standards. Knowledge of hardware devices that interface with Apple products (e.g., Works with iPhone Hearing aids, Braille displays, switch controls). Proficiency in languages and test frameworks such as Python, JavaScript, Swift, PyTest, SwiftUI, XCTest, XCUI, Nimble, Selenium, Appium, and Cucumber.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559042"}