{"title": "AI Architect - Large Language Models & Generative AI", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. We are looking for a highly skilled and experienced AI Architect who has a robust understanding of Artificial Intelligence, Machine Learning and Generative AI to help work on exciting technologies for future Apple products and bring it to life. You will collaborate with cross-functional teams of business SMEs, engineers, data scientists, designers, and researchers. This role is exceptionally technical, and will require you to actively engage in all aspects of the work, you will be responsible for running 1000 steps ahead, looking around the corner, and help bridge the gap between business and technical teams, ensuring that the technical architecture and solutions aligned with strategic goals and deliver measurable business values and KPIs.", "description": "In this role, you will focus on the following key areas: - You’ll be working in a team of machine learning engineers of different specializations to prototype and ship world class algorithms that are state of the art. Lead the exploration and application of Large Language Models and Generative AI, venturing into new areas within these fields, including multi modal capabilities. Lead MLOps, automating ML pipeline, including the training, testing, deployment, monitoring, and scaling of AI models. Turn prototypes into automation pipelines and deploying them to production; deciding when to use out-of-the-box solutions vs. building custom solutions and utilizing both. Ongoing data analysis to build new or fine-tune existing models such as GPT to optimize results. Partner closely with software engineers to implement these models into high-performing systems and models in our production environment that can be applied to create amazing experience for our worldwide audience. Actively engaging in all aspects of model development, from ideation and experimentation to deployment. Communicate results of analyses to business partners and executives. Maintain expertise in the latest advancements in AI technology. Partner with your team members to prepare presentations, papers, and patents for your inventions. Proactively address and reduce potential biases in model predictions, ensuring our products are inclusive and fair. Design and implement efficient data pipelines to support large language model training and inference.", "key_qualifications": "Experience in identifying and delivering state-of-the-art product architecture for our end to end solutions. 5+ years building NLP/AI software professionally and successfully releasing to customers. 5+ years of hands-on experience in building scalable systems for training & evaluating of machine learning/deep learning models. Experience with state-of-the-art NLP algorithms and AI models, Multi-modal LLMs, Multi-modal contrastive learning, Foundation models, Diffusion based models and parameter efficient fine tuning of LLMs. Experience with Cloud technologies and familiarity with AWS & GCP. Familiarity with deploying model for large scale inferencing & optimizations. Solid understanding of inference speed up techniques such as speculative decoding and optimization of LLMs for human preferences. A strong track record of shipping products and publications / patents. Strong proficiency in PyTorch, TensorFlow, Transformers, Kubernetes, Docker, LangChain, vectorDB and cloud platforms like AWS, GCP, or Azure, and Monitoring tool like Grafana, and CI/CD like airflow, gitlab, and Big Data management like Spark, Kafka. A thought leader having a good balance of business acumen, domain and technical expertise. Excellent presentation, written and verbal communication, engagement and interpersonal skills along with validated skills in building great design.", "preferred_qualifications": "", "education_experience": "• Ph.D. in Computer Science, Artificial Intelligence, Machine Learning or related field; or • M.S. in related field with 3+ years experience applying machine learning engineer to real business problems", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200532554"}