{"title": "Sr. Engineering Program Manager -Cloud Infrastructure- ASE", "summary": "The Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. Our Program Managers partner with engineers who build secure, end-to-end solutions. Our SRE team is looking for a dynamic EPM to help build and run services that millions of customers use every day.", "description": "The Cloud Infrastructure team, as part of the Apple Services Engineering team, is seeking an extraordinary engineering program manager (EPM) to deliver innovative product solutions that will shape the future of large scale infrastructure at Apple. You'll partner with a diverse set of teams across Apple to provide them with groundbreaking infrastructure that operates at substantial scale and use open source technologies such as Kubernetes along with proprietary systems.", "key_qualifications": "5-10 years proven experience in software development project management for Site Reliability Engineering / DevOps / Infrastructure domains, Exceptional organizational, project management, and technical savvy, Experience leading Cloud native Infrastructure programs, Experience with Kubernetes is a big plus, Agile project experience, Proficiency and experience in delivering large scale infrastructure projects, Process re-engineering experience, Self-motivated and proactive, Strong analytical, troubleshooting, and problem-solving skills, Strong verbal and written communication skills, Ability to handle multiple simultaneous end to end infrastructure projects", "preferred_qualifications": "", "education_experience": "BS or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547885"}