{"title": "Optical Systems Engineer", "summary": "As part of Hardware Test Engineering at Apple you will work on groundbreaking Display technology for the next generation of products. Your work will encourage innovation in metrology arena for sophisticated optical stacks of Display devices. You will author novel image processing algorithms to calibrate and screen devices with Apple’s strict quality targets. Your solutions will be highly optimized and deployed at scale across our Contract Manufacturing sites. An ideal candidate will be eager to learn from the past and be curious about all related fields, such as: software, physics, data science, and technology fundamentals. Excellent written, verbal, and visual communication skills are required.", "description": "You will work on introducing powerful technology to people around the world to make their life better. The ideal candidate will have had direct experience with optical imaging systems and/or extensive application with computer vision techniques. Day to day responsibilities may include: -  Developing and evaluating industry-leading metrology solutions to support a range of Apple products -  Architecting image processing algorithms to extract relevant metrics from raw measurements -  Automating operation of sophisticated measurement systems -  Analyzing large data sets to extract critical knowledge on product performance -  Providing streamlined and detailed presentations", "key_qualifications": "7+ years of experience with optical sensors and system, Strong computational imaging, image processing and computer vision fundamentals (object detection, segmentation, geometric correction), Practical experience applying principles from geometrical and physical optics (e.g., lens modeling), Proficiency with optical simulation tools (Zemax), Familiarity with color science fundamentals, Hands on experience prototyping bench top optical systems, Programming fundamentals (C/C++), familiarity with Python, Bash, MATLAB, Self-motivated, independent, and takes initiative, Resourceful, prepared to champion work in front of a large group, and enjoys working in multi-functional teams", "preferred_qualifications": "", "education_experience": "MS or PhD in Electrical Engineering, Applied Physics, Optics, etc.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537432"}