{"title": "AMR Retail Carrier Program Manager", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! Here on the Apple Store Online team, we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive.", "description": "*  Manage key carrier relationships across the US and Canada, developing mutually successful go-to-market plans and execution.\n*  Develop a deep understanding of carrier market dynamics, customer buying trends, and country plans.\n*  Identify market opportunities across carriers and help craft commercial programs and future carrier roadmap to capitalize on these opportunities.\n*  Drive program performance through analysis and partnership with Apple Store Online and Apple Retail Stores business teams.\n*  Ability to craft compelling, insightful presentations for the Retail Leadership Team and Apple Executives including annual business plans, quarterly priorities, and critical metric performance.\n*  Own internal relationships with cross-Apple teams such as Sales, Product Marketing, and Operations within Apple.\n*  Influence key collaborators and Retail cross-functional partners across Product, Finance, Retail Marketing, Retail Operations, and Retail Contact Centers to prioritize, deliver, and implement business initiatives to hard deadlines\n*  Demonstrate Apple’s values of inclusion and diversity in daily activities.\n*  Contributes to an inclusive environment through respecting each others' differences and having the curiosity to learn.", "key_qualifications": "10+ years experience in Retail, Commerce, or Carrier industries. Strong partnership and relationship management skills. Proven track record in strategy or customer experience function, developing and leading the business through impactful plans that address clear long-term objectives. Demonstrated ability to be a self-starter and deal with ambiguity. An aptitude to quantify and support conclusions with analytic data. Strong communication skills and the ability to thrive in a highly cross-functional environment. Attention to detail and ability to manage complex processes comfortably. Highly collaborative, works well across all levels of a matrixed organization. Ability to make decisions in a timely manner, sometimes with incomplete information and under tight deadlines. Skilled at crafting compelling, insightful presentations to effectively influence Leadership (strong written and verbal comms)", "preferred_qualifications": "", "education_experience": "BA or equivalent industry experience required; MBA preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546869"}