{"title": "Graphics Emulation Engineer", "summary": "Would you like the chance to collaborate across diverse, energetic teams, supporting and enabling various aspects of design verification and analysis? As part of our Silicon Technologies Group, you will have the opportunity to contribute to the successful execution of virtually every GPU that lands in an Apple device via our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! The Graphics Emulation Engineer is responsible for supporting functional verification, power and performance analysis, and silicon validation by building emulation models, running both synthetic and real-world test cases on those emulation models, debugging and resolving issues, reporting status, and driving emulation and acceleration solutions from concept to Silicon!", "description": "- Run specified tests on appropriate emulation builds, debug issues, report status. - Participate in debug of system by capturing waveforms and writing triggers. - Architect builds for emulation environment. - Bring up and support regular builds of emulation models, debug any build issues. - Interface emulation with virtual systems, simulation environments, and silicon validation. - Leverage emulation capabilities to accelerate silicon bring-up. - Respond to and work with vendor field service/AEs to address emulation hardware and software issues. - Work with pre- and post-silicon validation teams to develop and implement support plans. - Architect and implement transactors between software test bench and emulation hardware. - Explore and develop new technologies and methodologies to leverage emulation and hardware acceleration for new applications.", "key_qualifications": "No information available", "preferred_qualifications": "Ability to interface emulation hardware with virtual systems, simulation environment, and silicon validation. Graphics knowledge; 3D graphics pipeline, OGL/OCL programming. General verification skills.", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "No information available", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554728"}