{"title": "Commodity Financial Analyst", "summary": "Team up with Apple, one of the most influential technology leaders in the industry. Join the Apple Finance organization and make a positive impact on a company that is known for its impressive lineup of products, including Mac, iPhone, iPad, and Apple Watch. At Apple, you’ll share in a commitment to perfection by working with world-class managers, all with one unified vision – creating innovative products that delight customers. Finance is about “fueling innovation”. We do this by hiring quality individuals with integrity, personal accountability, partnership, excellence, and can-do thinking. If you exemplify our values and want to be part of something big, contact us today.", "description": "The Worldwide Procurement Finance group creates and provides analytical support for critical cost data, including standard costs, forecasted costs, and actual costs for Apple. Within the Worldwide Procurement group, this position reports to the Manager of Commodity Financial Management. Ability to work with minimal direct supervision while performing a variety of complex and non-routine tasks.", "key_qualifications": "3+ years related finance/accounting experience\nCapable of clearly communicating complex analyses to a non-technical audience, including extensive experience presenting to leadership groups\nAbility to initiate, refine, and complete projects with minimal guidance\nAbility to work with large amounts of data and see the ‘bigger picture’\nCritical thinking: able to look at numbers, trends, and data and come to new conclusions based on the findings\nPreparation of key commodity forecasts used in monthly purchase price variance forecast and gross margin analysis\nProvide support and guidance to operations personnel as issues arise related to the supply chain or business processes\nReconciliation of actual costs to forecasted costs for key commodities supply chain analysis for key commodities to identify major drivers in cost changes for key commodities\nReconciliation and analysis of Apple supply chain data to contract manufacturer and supplier data\nPreparation of quarter end accounting entries necessary for accurately representing the cost of key commodities in the financial statements\nOther ad hoc requests related to the supply chain business process reengineering\nEffectively handle ambiguity and uncertainty", "preferred_qualifications": "", "education_experience": "BS degree or equivalent in Accounting, Finance or related field", "additional_requirements": "- Experience with SAP is a plus\n- Operations and Supply Chain Finance experience a plus\n- System automation projects a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552046"}