{"title": "iPhone Hardware Validation Automation Engineer", "summary": "Do you want to help create the next iPhone? The system integration team is looking for individuals with real passion for shipping exceptional products. You will work as part of a team that drives innovation in ensuring the highest design quality for future iPhone releases. As an iPhone Hardware Validation Automation Engineer, you will be a leader who is responsible for the creation and management of various software-based solutions used in the execution of system hardware validation, including scripting and data-acquisition and analysis tools. As part of the System Validation Engineering (SysVE) team, you will have the opportunity to dive into technical issues with creative debug solutions and architect validation infrastructure roadmaps impacting multi-disciplinary teams. You are someone with strong software and electrical engineering fundamentals, solution-driven, willing to be hands-on with debugging efforts, and able to work expertly with multiple engineering teams to close a list of critical tasks and improve our designs.", "description": "As Validation Automation Engineer, you will be directly responsible for building innovative software solutions to aid with system hardware validation, as well as optimizing internal processes to improve efficiency. These include automating data collection from lab equipment and building infrastructure to handle large data sets for local and cloud-based servers. Develop test scripts to control lab test equipment and post-process raw data sets using key electrical performance indicators. Lead innovative solutions to minimize bulk data transfer and processing time. Author reports and communications pertaining to key results and checkpoints. Maintain user documentation and training content for code. Participate in debug activities, including actively driving design of experiments (DOEs). Engage and collaborate with multi-functional development teams in the US and Asia in order to integrate their work into the project.", "key_qualifications": "", "preferred_qualifications": "Strong EE/CS fundamentals with relevant experience in consumer hardware or electronics industries. Experience with lab equipment test set-up (e.g. digital oscilloscope, logic analyzer, power supply, DMM, etc.) and instrument automation (SCPI commands, py-visa). Solid understanding of design and validation requirements for common interfaces (e.g. I2C, SPI, I2S, etc.) and high-speed interfaces (e.g. USB, MIPI, PCIe, etc.). Proficient with analyzing, processing, and visualizing large data sets. Understanding of mobile system architecture and design tradeoffs. Web development framework (React, Django) and database server maintenance (MySQL, MongoDB, etc.). Experience with schematic/layout capture tools.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558386"}