{"title": "AIML - Sr Engineering Program Manager, Siri Information Domains", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Then, we're looking for you! Here, you could play a leading part in empowering many ground-breaking intelligent experiences, and redefine how people use their devices. The Siri team is crafting groundbreaking technology for virtual assistants, knowledge graph, and algorithmic search using machine learning, natural language processing, and artificial intelligence. We’re looking for a strong Engineering Program Manager with a proven track record of building and maintaining sophisticated software platforms, tools and processes that deliver new end-to-end experiences that delight customers. You would work with top tier engineering and product teams to serve over 1 billion customers, crafting the highest quality user experience that Apple customers expect and love. You would drive search relevance, machine learning, and user experience improvement projects to build and improve end-to-end information products on all major Apple platforms including iPhone, CarPlay, macOS, and HomePod.", "description": "As a Senior Program Manager, you will lead program management efforts for Search and Information in Siri, Spotlight, and Safari. You will coordinate and drive early engagements on product architecture, feature definition and program execution. This includes collaborating with all partner organizations relevant for a project, You will: Communicate: Provide clear, timely and objective communication, including regular program status updates and critical issues as needed to executive team Coordinate: Coordinate discussions and break down complex issues into discussion topics to drive engineering and design alignment with support from project team, maintaining an orientation toward teamwork and collaboration Plan: Create and run project timeline with clear dependencies, critical path and systematic methodology to communicate status. Handle risks and mitigations, and re- plan as events warrant. Drive alignment across the organization and between teams Execute: Drive on time delivery and deployment, identifying development and feasibility needs, establishing achievements for checkpoints and status updates Problem solve: Proactively identify issues and solutions, and marshal resources necessary to attack and resolve. Coordinate with teams to identify issues, prioritize tasks and track risks to schedule and product quality, including cross-functional dependencies", "key_qualifications": "5+ years experience in Program or Project Management, QA management, or similar role leading cross-functional product or software engineering teams\n2+ years experience bringing a product from concept to completion, ideally related to joining together the complex backend and front-end systems with the user experience in mind\nExcellent project management skills including project structuring and leading multiple work streams interdependently\nDeep understanding of software development lifecycle and quality metrics\nSelf-sufficient in analyzing and drawing conclusions about quality from raw and refined data\nSelf-motivated and proactive, with demonstrated creative and critical thinking capabilities\nOutstanding communication and presentation skills, written and verbal, to all levels of an organization\nAbility to independently draft and present deliverables, recommendations and communication strategies\nExperience shipping AI/ML products/projects.", "preferred_qualifications": "", "education_experience": "BS/MS/PhD EE/CS/CE or equivalent", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549450"}