{"title": "Hardware Development Engineer", "summary": "Apple is seeking a Senior EE for MacBook Pro electrical & system design integration. The candidate will design, implement, test, and debug the electrical subsystem of the world’s best professional notebook computers within a collaborative cross-functional team. Our engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers!", "description": "-  Component datasheet analysis and selection for schematic capture\n\n-  Coordinate layout of highly constrained multilayer PCBs including HDI and fine pitch BGAs\n\n-  Forecast and plan design time to meet constrained schedules\n\n-  Drive design tradeoffs across manufacturing, test, thermal, performance, reliability, battery life, and electrical stakeholders\n\n-  Prototype bring-up, debug, functional verification, and electrical characterization\n\n-  Use advanced lab tools such as 25 GHz oscilloscopes, network analyzers, and BERT scopes to judge the quality and robustness of electrical designs.\n\n-  Analyze factory-scale data to adjust signal parameters for maximum margin\n\n-  Review designs of factory test fixtures, ensure manufacturing test plans provide adequate coverage to ensure the design is assembled correctly\n\n-  Debug problems found in manufacturing, feedback root cause and corrective action into design or manufacturing process in preparation for high volume.\n\n-  Communicate and present status on concurrent top issues and deadlines\n\n-  Lead, teach, and mentor junior engineers", "key_qualifications": "Minimum 5 years relevant industry work experience. High-volume consumer electronics system experience preferred.\nLab skills: oscilloscopes, logic analyzers, electronic loads\nExperience with schematic design and PCB physical design using Cadence Concept and Allegro or similar CAD tools\nDesign experience in digital logic, simulation, power conversion and delivery\nFamiliarity with RF/wireless concepts\nExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentals\nExcellent written and verbal communication skills\nCommand line interface and scripting skills\nSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnect\nStatistical data analysis and visualization (ex. JMP) is a plus\nTravel to foreign contract manufacturer (estimate 5 weeks per year)", "preferred_qualifications": "", "education_experience": "BS in electrical or computer engineering required, MS preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544417"}