{"title": "SE-Technical Expert", "summary": "En Technical Expert kombinerar omfattande kunskaper om felsökning med förmågan att väcka förväntan kring att äga produkter i Apples ekosystem – med särskilt fokus på iPhone. Efter en noggrann felsökning hjälper en Technical Expert kunden att välja det reparations- eller uppgraderingsalternativ som passar bäst. Vid behov kan en Technical Expert utföra reparationer på iPhone-enheter och andra Apple-produkter. En Technical Expert utbildar och handleder även butikens Technical Specialist-medarbetare och hjälper dem att utöka sina kunskaper. De själva får i sin tur vägledning av Genius-teamet.", "description": "Felsöker, diagnostiserar och reparerar iOS-enheter, Apple TV, Apple Watch, Beats, AirPort samt andra små enheter och tillhörande mjukvara. Använder sina omfattande kunskaper om hårdvara och mjukvara för att förklara vad tekniska problem kan bero på. Bistår såväl kollegor som kunder vid hämtning i butik. Hjälper Technical Specialist-medarbetare med problem relaterade till teknik och kundservice. Tar reda på kundernas alla behov och erbjuder produkt- och servicelösningar. Visar förståelse för kundens frustration när tekniken inte fungerar som förväntat och förklarar svåra tekniska problem på ett sätt som kunden förstår. Tar hand om varje kund så fort som möjligt. Prioriterar så att både individuella och teamets produktivitetsmål nås. Skapar rimliga förväntningar hos kunderna och håller dem informerade och uppdaterade under hela processen. Dokumenterar all nödvändig information om användaren och problemets natur så exakt som möjligt i alla system som stöds. Registrerar alla transaktioner korrekt så att antalet service- och lagerdelar stämmer. Fördjupar produktkunskaper och använder alla tillgängliga verktyg och material för att skaffa viktig information. Håller sig uppdaterad gällande aktuella produkter och tjänster i butiken och online – såsom kampanjer, produktfunktioner, lagerstatus, riktlinjer och rutiner. Föreslår lämpliga tillbehör som förbättrar kundens upplevelse av iOS-enheter och andra enheter. Samarbetar med Product Zone-teamet om en kund väljer att köpa något. Tar reda på och informerar Apple löpande om specifika kundproblem och andra frågor. Kan vid behov erbjuda ytterligare support – såsom incheckning eller andra servicefunktioner.", "key_qualifications": "", "preferred_qualifications": "Certifierad för att reparera iOS-enheter. Kan både ta emot och ge feedback och vägledning till andra. Kan identifiera mönster utifrån tidigare erfarenhet av felsökning för att diagnostisera symptom ​and orsaker. Du är bra på att analysera och lösa tekniska problem. Du har relevant teknisk kunskap om Apples produkter och tjänster. Du har erfarenhet av att felsöka hårdvaru- och mjukvaruproblem i en kundservicemiljö. Du har god social kompetens och erfarenhet av att hantera kundserviceproblem på ett empatiskt sätt. Du är handlingsfokuserad och motiverad att göra det som är bäst för kunden och teamet. Du kan ofta förutse och parera problem och hinder. Du har förmåga att arbeta i en hektisk butiksmiljö och fatta snabba beslut, ibland inom snäva tidsramar och i pressade situationer. Du har uppvisad förmåga att arbeta i team och dela ansvar med andra teammedlemmar. Du uttrycker dig väl i både tal och skrift samt är bra på att anpassa din kommunikation och stil efter olika målgrupper.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535574"}