{"title": "CAD Development Engineer", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. Join Apple, and help us leave the world better than we found it. Are you up for the challenge? The Apple Hardware Engineering organization is looking for an ECAD development engineer...", "description": "The CAD Development Engineer will be responsible for; Developing and testing design tools, workflows, customizations and automation. Collaborating with engineering and customer success teams. Architecting and implementing data and system integration solutions. Acting as subject matter expert for vendors, customers, partners and teammates.", "key_qualifications": "•Experience with EDA vendor software - Cadence, Zuken, Mentor\n•Comfortable in web development, HTML, CSS and modern JavaScript frameworks\n•Proficient in SQL\n•Expertise in object-oriented programming and complex data structures\n•Excellent debugging and critical thinking skills.\n•Excellent analytical and problem-solving skills.", "preferred_qualifications": "•Expertise in scripting languages - Tcl, Perl or Python preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553081"}