{"title": "Compiler CPU Backend Engineer", "summary": "The CPU and Accelerator Compiler Performance Team is seeking engineers with different levels of experience passionate about working on advancing compiler-based optimization technologies. Our team is responsible for optimizations and code generation for CPUs and Accelerators on all Apple platforms. We work across many different organizations on state-of-the art, industry impacting tools that enhance the user experience for all Apple customers with better run-time performance, battery life, code size, and enhanced security. A lot of the team's work happens directly in the LLVM open source project and gets presented at the LLVM Developer Meeting. Our team embodies diversity, collaboration, and creativity.", "description": "In this role you will be part of a highly motivated group of engineers dedicated to pushing compiler technology to the next level. Your responsibilities will encompass a range of tasks, including development of optimizations targeted at new hardware or programming language features, generic compiler optimizations in LLVM, advancement of link-time and profile-driven optimizations, and conducting workload performance analysis. You’ll also review and provide feedback on the work of your peers, and collaborate with them on solutions to the problems they are working on.", "key_qualifications": "Strong C++ expertise; Knowledge of common data structures like linked lists, sets, maps, and graphs; Experience in analyzing benchmarks and application performance; Ability to communicate clearly and effectively; Hands-on experience developing compiler analysis and optimization passes is a big plus; Experience working with LLVM or other open source project is a plus; Experience in collaboration with teams across different organizations and timezones is a plus", "preferred_qualifications": "", "education_experience": "BSc in Computer Science/Computer Engineering/Electrical Engineering or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538228"}