{"title": "ASE - Software Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job and there's no telling what we can accomplish together. Do you love crafting elegant solutions to highly complex challenges? Are you passionate about building distributed, scalable solutions? Our team develops end to end cloud platforms and services with RESTful apis and services that are used by numerous customers. The individual needs to be adept in software development, system architecture and cloud technologies. Understanding the security challenges of the platform will be important for being successful in this role.", "description": "You will partner with developers, system and site reliability engineers and customers to understand their challenges, work through their issues and provide solutions that can be embraced widely. The ideal candidate is someone with a consistent track record, deep technical knowledge and skills in delivering large scale, distributed complex software solutions deployed on multiple cloud platforms. This is a highly technical, hands-on role that requires a wide and deep experience in leading infrastructure and applications. The successful candidate will design and implement complete products, demonstrating expertise in entire software development lifecycle. You will serve as a technical lead with strong architectural design and software engineering skills, experience with infrastructure as code technologies, operations, security concepts. Building and maintaining relationships with diverse sets of customers that use the platform will be critical to ensure the business units are successful. We are a team of highly skilled and hardworking engineers working on this groundbreaking and constantly evolving space. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "Bachelor's Degree with 8+ years of experience, Significant expertise in programming using languages such as Java, GO or Python, Experience with architectural and detailed design, incorporating aspects of security, high availability, and resiliency in the design, Strong software engineering background, with deep experience with multiple design patterns and building RESTful APIs, Experience with CI/CD tools and techniques, containers, Kubernetes, Experience operating and developing infrastructure and services in cloud platforms, Experience with AuthN and AuthZ technologies and protocols, including IAM and SSO, Experience with application and service monitoring, Working knowledge of network protocols and Linux/Unix system internals and transport protocols (TCP, TLS, HTTP, UDP)", "preferred_qualifications": "Strong leadership skills, with experience mentoring and inspiring others, Experience leading and driving projects with minimal direction., Expert in writing detailed solution specifications, diagrams, standards documentation, operating procedures, test plans/test reports, etc., Excellent communications skills and ability to establish and maintain collaborations with partners, capable of working with multi-functional technical and business teams and varying levels of management, in a professional manner.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560578"}