{"title": "Senior Team Lead - AIML Data Operations", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have imagined and now can’t imagine living without. If you’re excited by the idea of making a real impact and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job, Just be prepared to dream big.\n\nAre you a leader who advocates for their team? Do you have a knack for strategic planning, program development and forecasting business needs? Our AIML Annotation team is passionate about technology with a focus on enriching the Siri customer experience.\n\nWe are seeking an Area Manager (Senior Team Lead) who will manage the daily operations of the AIML Annotation team. You will coach, mentor and guide a group of Team Leads to encourage quality, innovation and strong performance from their team of language Annotation Analysts. You will use your analytical mindset, collaborative approach, and personal drive to achieve team performance goals.", "description": "In this role, you will be leading day-to-day operations to ensure organisational delivery of quality results. You’ll assist in the development of tools and reports to analyse and run the business, including workflow optimisations, workforce management, and volume predictions. You will help determine staffing requirements and participate in interviewing and hiring. \n\nYou will effectively lead team performance by developing managers through one-on-ones, team meetings, mentor sessions and setting expectations. \n\nThis position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, an employee discount, and dedicated resources to support your ongoing growth and career development.", "key_qualifications": "Consistent track record in people management, leading teams passionate about consumer-facing applications, content or service.\nExperience defining and analysing KPI’s, with the ability to identify trends and opportunities for innovation and improvement.\nConsistent track record of collaborating cross-functionally to drive operational improvements.\nExperience scaling operations in a fast-paced and dynamic environment.\nManagement experience in a global or multi-tiered organisation.\nUse data to optimise operational efficiency and drive strategic decision making", "preferred_qualifications": "Ability to empower and drive the team’s performance and be accountable for business priorities.\nSelf-starter with an analytical orientation, strategic vision, and strong executional track record.\nExcellent verbal and written communication skills.\nStrong communication skills, both verbal and written and proven ability to communicate clearly at all levels of the organisation.\nExcellent forward thinking capabilities. Must be able to see beyond the current state, identify risks/opportunities and drive project teams toward the desired program outcome", "education_experience": "", "additional_requirements": "", "pay_benefits": "This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, an employee discount, and dedicated resources to support your ongoing growth and career development.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534719"}