{"title": "Global Sourcing and Supply Manager", "summary": "Imagine what you could do here. At Apple, creative ideas have a way of becoming wonderful products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Acting as a key interface among Worldwide Operations Team, strategic suppliers and contract manufacturers, APO GSSM is responsible for managing strategic and tactical initiatives of the Apple supply chain. This role will focus on a specific commodity and will play a critical role in the overall success of the Apple Operation.", "description": "-  Act as resident expert in an assigned commodity\n-  Collaborate with Worldwide Team to plan manufacturing capacity, prepare supply chain for new product ramps, lead timely actions to resolve supply issues and provide accurate risk assessments and supply projections\n-  Manage forecast and supply, ensure supply chain flexibility to minimize risks\n-  Manage and develop suppliers to maintain industry leading quality, delivery and cost\n-  Develop and maintain professional and productive business partnership with suppliers\n-  Work with Apple cross-functional teams and supply chain to achieve business goals and objectives\n-  Spot improvement opportunities in supply chain and work to execute key initiatives and strategies\n-  Participate in supplier evaluation and selection", "key_qualifications": "", "preferred_qualifications": "Quick learner\nDemonstrated ability to drive and deliver strategic business initiatives\nOutstanding analytical capabilities\nExcellent written and verbal communication skills\nAbility to work cross functionally in a dynamic environment - individually and as a member of a team\nAbility to handle different and competing priorities\nHigh level of personal and professional integrity\nStrong work ethic with a high degree of flexibility\nFamiliar with Python/Tableau, data analysis etc. is a plus\nTravel: Frequent travel might be required during some parts of the year, depending on the commodities", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559240"}