{"title": "Software Engineer Database POS, Retail Engineering", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "As a member of POS database team, you will be working on designing and writing database programs for our stores. You will design cross platform databases, Cloud, Performance tuning, providing Cache. The ideal candidate should possess a demonstrated background in database technologies and should be skilled in the Oracle PLSQL and database concepts. They will be responsible for designing and developing innovative solutions utilizing micro-service architecture, along with evaluating business requirements, identifying gaps, and transforming them into technical designs. It is essential to have leadership qualities to lead small teams and to communicate proficiently with partners, engineers, and stakeholders. The candidate should also conduct reviews of design and code, create effective unit test, and demonstrate proficiency in analyzing and resolving production issues within a reasonable time frame", "key_qualifications": " ", "preferred_qualifications": "Positive and can-do attitude. Problem-solving skills and the ability to design scalable, high-performance, and maintainable software solutions. Knowledge of distributed messaging and caching technologies such as redis", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557009"}