{"title": "Senior Product Design Engineer - Apple Vision Pro", "summary": "Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us!", "description": "Do you thrive on building solutions? Are you ready to explore a new domain with a talented team? We are the hands-on technical team that carries the design of Apple products through the entire process, from early prototyping to mass production! Our goal is to ensure the highest quality product for our customers. As a Product Designer on this team, you will be given ownership over the mechanical design of specific parts or modules within the product and will be responsible for the analysis, assembly, and reliability of these parts. In this role you will engage in frequent multi-disciplinary collaboration with teams like Industrial Design, Project Management, Materials, Manufacturing, EE, Display, Camera, Antenna, Battery, and more. You will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day.", "key_qualifications": "6+ years of hands-on, detailed product design experience; Strong analytical skills with regard to mechanical engineering theory; Experience in driving challenging architecture, managing trade-offs and design down-selection, and working within ID, weight, and manufacturing constraints; Experience in prototyping quick-turn, high fidelity mechanisms and concepts to enable architecture down-selects and data collection; Experience in mechanical integration of electromechanical subsystems, including cameras, sensors, and other opto-mechanical modules, to meet strict cross-functional and reliability requirements; Experience with both cosmetic and structural enclosure parts and light-weighting designs; Experience driving technical discussions with ID and/or cross-functional partners; Experience in designing for ergonomics and comfort; Consumer electronics knowledge in a majority of these disciplines: industrial design, optics and lenses, cameras, sensors, displays, PCBs and flexes, silicon, antennas, batteries, thermals; Creative problem solving, with experience in failure analysis, root cause investigation, and DOE creation; Experience working in technical project groups in a professional environment; Proficiency in 3D CAD (any modeling package); Basic GD&T knowledge and experience releasing 2D drawings; Proficiency in performing tolerance analyses; Working knowledge of FEA principles; Practical experience working through DFM challenges with external vendors; Wide knowledge of basic engineering materials and manufacturing processes; Experience with vendor FAI/CPK dimensional reports; Excellent communication skills (verbal and written) including emails, preparing slide presentations, and presenting technical concepts to multi-disciplinary teams; Detail orientated and capable of handling multiple assignments at once; Experience collaborating with Asian manufacturing facilities, specifically in high-volume mass production", "preferred_qualifications": "", "education_experience": "Bachelor of Science in Mechanical Engineering required\nMaster of Science preferred", "additional_requirements": "Travel will be 15-25% (domestic and international)", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544669"}