{"title": "Hardware Systems Engineer", "summary": "Are you ready to carry on the iconic legacy of the Mac? Come join the Mac hardware team! We are a team of system electrical engineers that own Mac products from concept to ship. We sit at the center of Apple’s wider engineering team, working cross-functionally with mechanical engineering, software, silicon engineering and other module teams such as wireless, battery, camera, sensing, and display. In this role, you will help mold a design concept into reality for the next set of insanely great products.", "description": "As a hardware engineer in Mac, you will be responsible for delivering the next quality computer our users have grown to know and love. You will use your skills in electrical engineering to design logic boards, integrate new technologies, and debug electrical issues. You will work closely with our cross-functional partners to innovate, iterate, and craft a great product. Responsibilities: PCB and flex (FPC) design, Electrical circuit validation, Electrical failure debug from reliability, factory, validation, or QA testing, Cross functional collaboration with design, manufacturing, and marketing teams, Factory build support from NPI through product ramp", "key_qualifications": "Strong EE fundamentals grounded in a solid understanding of E&M physics and first principles, Background in schematic capture and constraint-driven PCB layout using Cadence tools or similar, Experience with PCB bringup, debug, and validation using standard lab equipment e.g. DMM, Oscilloscope, Power Supply, Electronic Load, Logic Analyzer, Spectrum Analyzer", "preferred_qualifications": "Experience in circuit design for a variety of domains including power, digital, analog, and high-speed communications, Understanding of computer architecture and product design tradeoffs, Ability to manipulate large data sets in order to provide insightful analysis coupled with strong visualizations, Excellent written and verbal communication/presentation skills, Eagerness to take on new challenges, learn new skills, and continuously develop, Strong sense of ownership and the ability to handle tasks comprehensively from start to finish", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefits, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559827"}