{"title": "Developer Support Specialist", "summary": "The App Review team is looking for an experienced technical customer relations or developer relations communicator adept at resolving complex business issues while supporting the global Apple Developer Program community.", "description": "Represent Apple to support developers by enabling them to develop their life best’s work on the App Store and navigate App Store policies compliantly. You will interact with developers in the Asia Pacific region on the phone and in writing, but depending on your language skills, you may be focused on a certain market. Responsibilities include: • Communicating, tracking, and managing issues from day-to-day operations with business partners.  • Developing strong relationships with App Review colleagues and peers.  • Collaborating with colleagues, providing support, listening and being open to others when they need you. Empathy is a key attribute to be successful in this role.  • Superb communication skills and attention to every detail is vital. Being accurate, thorough and complete is key to your success.", "key_qualifications": " ", "preferred_qualifications": "Able to hold conversations clearly and fluently. Able to self-manage without guidance and supervision. Able to effectively resolve conflicts and exercise great negotiation skills. Able to summarize and explain complex issues in easy to understand terms while providing detailed reporting on issues and case summaries. Has a positive and upbeat attitude to help developers resolve issues with their apps, while maintaining composure and remaining resilient during challenging situations. Problem solving mindset and technical aptitude: Able to evaluate situations and problems and approach them in a methodical manner. Ability to be resourceful to research issues and provide potential solutions. Highly adaptable: Able to understand work related changes quickly and accurately while being able to effectively apply them to your work. Multi-lingual capability is highly desirable to support multiple markets in APAC. Knowledge of the app development environment, key players, and business models, with a fundamental understanding of mobile technologies, mobile app ecosystems, app business models, and app development processes. Strong data analysis, time management, and reporting skills. Experience with Mac development platform a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554731"}