{"title": "Communication Applications Software Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We’re looking for a motivated software engineer to develop cutting-edge networking technologies for Apple’s communication applications, including iMessage, FaceTime, Apple Watch, HomeKit, Apple Push Service, and more! We need someone who is good with working in an exciting environment with rapidly changing priorities, and someone creative and inspired to invent new ways to help build better products", "description": "Please join us in strengthening the Apple ecosystem and bringing users together with innovative communications technologies. The Communication Applications team is a passionate collection of engineers who are looking for a highly motivated engineer with aspirations to build powerful products that change our customers lives, cultivate learning, and lead cross-functional efforts to success. This team’s products are deeply important to Apple users and our success depends on partnership, technical leadership, and diverse experiences", "key_qualifications": "Strong software development and design skills for embedded systems\nFamiliarity with client-server driven architecture and network protocols used for real-time communications\nStrong object-oriented programming skills in at least one language like Objective-C, C++, Java, or Swift\nStrong communication, collaboration, and social skills\nSelf-directed and can tackle problems independently\n3+ Years of experience", "preferred_qualifications": "", "education_experience": "BS in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533243"}