{"title": "Critical Facilities Technician, Data Center", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Critical Facilities Technicians are responsible for the safe, professional, and operationally sound manipulation of the systems, such as cooling and electrical, that support systems in high-availability, high-risk, or high-reliability environments. Responsibilities Regularly inspect and supervise critical equipment and respond to irregular or malfunctioning conditions. Complete assigned tasks efficiently and without disruption to the business. Follow established procedures for assigned activities Collaborate cross functionally with teams as well as vendors and suppliers to achieve goals. Follow all federal, state, and local regulations for operations and work safety. Use appropriate PPE such as ARC Flash suits and/or coverall in a variety of environments. Note: Critical Facilities Technicians work 8, 10 or 12 hours per day on a rotating shift schedule including graveyard, weekend and holiday shifts and may work overtime depending on business needs.", "key_qualifications": "", "preferred_qualifications": "4+ years of related experience in a critical environment. Ability to perform practical applications of, preventative and corrective maintenance for mechanical, electrical, plumbing and other infrastructure systems Understanding of hyper scale electrical and mechanical systems and NFPA70e and OSHA Regulations that pertain to data centers Knowledge of safety procedures, established techniques, and equipment Ability to build relationships and collaborate Excellent time management skills Ability to take initiative with minimal direction Excellent communication skills, both verbal and written, to effectively communicate with team members and other departments", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557600"}