{"title": "AR/VR Module Development Engineer", "summary": "Apple is looking for a AR/VR Module Process Engineer to join Panel Process and Optics (PPO) Engineering team. The candidate will be based in China. Module Process Engineers are responsible to develop new innovative manufacturing process technologies to solve complex design challenges that have direct impact to future product, quality and delivery of Lens Modules. Individual in this role will serve as a focal point in the process development of advanced key process modules from the concept/architecture stage through product engineering validation builds. We work at a fast pace and require everyone to be highly self motivated. A successful candidate needs to be a flexible thinker and be able to problem solve outside of their respective technical area.", "description": "1. Process technology feasibility studies through practical engineering methods\n2. Equipment and Process Development - Leads design and development of material, process, and equipment for technically complex manufacturing processes with special emphasis on advanced equipment design to enable new products designs & functional requirements.\n3. Develop Equipment and Process for Manufacturability - Provide early and on-going manufacturing leadership to ensure new process is scalable for high volume\n4. Process FMEA - Lead PFMEA generation for new process technology\n5. Failure Analysis - Lead root cause analysis and metrology development for issues related to new process technology\n6. Cross-functional interaction with Mechanical Engineers, Optical Engineers, Manufacturing Engineers, Operation Engineers and international vendors\n7. Keep abreast of relevant industrial process & material manufacturing technical trends", "key_qualifications": "Must have experience in development of sophisticated module process equipment for mass production in the Flat Panel Display & Touch industry or other related industries\nSelf-starter with validated ability to lead a project from lab scale development to high volume production without major last minute surprises\nProven ability to perform DOE, data analysis, SPC control\nDemonstrated failure mode analysis, root cause investigation, and problem solving for product yield and quality issue\nExcellent written & verbal communication skills and proven leadership ability\nProject Management- Excellent data handling, documentation, critical turning point creation, and organization skill\nAbility for frequent domestic and international business travel to support project implementation and collaborate with external vendors for product manufacturing", "preferred_qualifications": "", "education_experience": "Ph.D. or M.S. degree in Physics, Material Science, Mechanical Engineering, Chemical Engineering, Electrical Engineering with 3+ years of experience in related field preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543339"}