{"title": "Cellular System Stability Test Engineer", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will be inspired. And you’ll be proud. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join the Wireless Technologies and Ecosystems Engineering (WTE) team and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. Our team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. If you're passionate about building technology that will make a difference, we may have the job for you!", "description": "5+ years of hands-on experience with testing cellular technologies (5G, LTE, UMTS, IMS, VoLTE, VoNR etc). We are looking for a highly technical Cellular Software Test Engineer with excellent problem solving and communication skills. You will join a diverse team responsible for qualifying the wireless features and software for the latest Apple Product Lines - iPhones/iPads/Watch etc. In this role you will be responsible for development of test strategies, test plans/cases for broad feature coverage, both in live network and on simulators across multiple locations and multiple operators, as well as tests execution, working on automation frameworks/scripts, issues log analysis/debugging and test reporting. Will be interfacing with test framework development teams on automation improvements, new test cases and end-to-end workflow", "key_qualifications": "Good understanding of 3GPP specifications / Cellular Radio Standards (5G NR, LTE, UMTS, 2G etc). Good understanding of Modem SW Architecture (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP and NAS layer). 5+ years of hands-on experience with testing cellular technologies (5G, LTE, UMTS, IMS, VoLTE, VoNR etc). Strong hands-on experience in Wireless System Testing, Stability/MTBF and/or Cellular System Stress testing. Good experience in defining test strategies, developing test plans and validating cellular modem system test cases for mobile devices. Excellent problem solving skills, analysis of test failures, issues and crashes, modem logs analysis and triage, followed by engagement with respective development teams to fix issues. Exposure to Tier 1 Mobile Operators across the globe and IOT requirements testing. Ability to work efficiently with teammates who work remotely. Working experience with commercial test simulators and test systems such as: KeySight, R&S, Anritsu call boxes will be a plus. Knowledge in Test Automation and Scripting skills using Python will be a plus. Good attention to detail, strong written and interpersonal skills", "preferred_qualifications": "", "education_experience": "Education Bachelors/Master Degree in Computer Science, Electronics & communication Engineering, Electrical Engineering, or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551130"}