{"title": "Senior Software Engineer, Analytics", "summary": "The ASE Analytics & Data Engineering organization powers the analytics behind the App Store, Apple TV, Apple Music, Apple Podcasts, Apple Fitness+, Apple Books, Apple Wallet, and more. We’re looking for an engineer to join the team working on defining the future of our data and instrumentation capabilities. As a member of the Instrumentation team, you will work with a number of multi-functional collaborators to answer two main questions: What metrics should we collect for our media products and how will we get those metrics from client devices?", "description": "You’ll be tasked with designing, launching, and supporting new metrics infrastructure products as necessary to answer high-level analytics questions at scale. Your responsibilities will include all aspects of software development management, from brainstorming, design and analysis to development, implementation and maintenance. You will also be expected to write and maintain instrumentation specifications—documents that specify what fields and values should we collect as well as what triggers this data collection—for all new features released across our media products. To accomplish all this, you’ll collaborate with a wide range of collaborators including product managers, client and server engineering, data scientists/business analysts, privacy engineers/attorneys, QA, and more.", "key_qualifications": "5+ years of experience working as a software engineer, technical product manager, or engineering-focused management consultant; Strong software design skills, coupled with a deep knowledge of data structures and algorithms; Experience working with large, multi-functional teams spread across multiple locations; Comfort with translating ambiguous high-level analytics questions into concrete engineering asks; Clear and concise communication; Strong prioritization skills with the ability to handle multiple programs simultaneously with overlapping deadlines; Development experience in some or all of the following is a plus: metrics or analytics systems, frameworks or toolkits, Swift, Objective-C, JavaScript, C/C++, Java, TypeScript, React, Angular, Ember, Vue", "preferred_qualifications": "BS or MS in Computer Science or equivalent industry experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555795"}