{"title": "AIML - Senior/Staff Software Engineer (Security), ML Platform and Infrastructure", "summary": "The Data Platform team within the AIML organization powers analytics, experimentation, and ML feature engineering to power Siri, Search, and other ML features we all love in our Apple devices. The mission of the Data Platform org is to provide our engineers and data scientists an innovative, reliable, secured, and easy-to-use infrastructure for ingesting, storing, processing, and interacting with data and ultimately help the teams that build data-intensive applications be successful. You will work with many cross-functional teams and lead the planning, execution, and success of technical projects with the ultimate purpose of improving Siri and Search experience for Apple customers. We are looking for a Senior Software Engineer for Infrastructure Security who is passionate in enhancing our data platform by building frameworks and architectures using cutting edge technology at every level of the technical stack. You will guide product and infrastructure teams to ensure user data security is a core component in every feature we ship. Are you passionate about building security-first data platform and solving data problems at scale? Come join us and be part of the Data Platform journey.", "description": "You will be responsible for defining and driving the data security roadmap for our data platform, offering the best data security control and governance across our stack at Apple scale. You will collaborate with cross functional teams of innovative software engineers, product managers, and engineering managers to continually enhance our security posture. We embrace the use of open source technologies including Kubernetes, Ranger for secured compute platform and Spark, Flink, Trino, Iceberg for data processing. RESPONSIBILITIES INCLUDE: Define and drive technical vision, roadmap, and strategy for data security of our platform. Participate in product design reviews to ensure security is a core component of design. Collaborate with stakeholders and cross-functional leaders in engineering, product, and operations across Apple to ensure the adoption of our data platform is done in a security compliant manner. Liaison and coordinate with Corporate Information Security group for reviews, risk assessment, vulnerability treatment, security patches, etc. Lead and mentor new hires or junior engineers. Provide guidance and establish processes to ensure engineering excellence and operational sustainability with security compliance. Foster a healthy, inclusive, collaborative, and technology-driven culture", "key_qualifications": "10+ years of software development experience. Proficient in best practices and enforcement for data security and data governance. Experience with commercial and/or open source large scale data processing, storage frameworks and platforms. Experience architecting, building authorization/authentication solutions and working with Identity and Governance. Excellent verbal and written communication skills, able to collaborate cross-functionally with program managers and engineering partners. Experience in influencing and driving key product innovations and opportunities across diverse collaborators", "preferred_qualifications": "", "education_experience": "BS, MS, or PhD degree in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540146"}