{"title": "Systems Quality Project Manager - 12 Months Contract", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it! The AppleCare Business Process Reengineering team has an immediate opening for a Systems Quality Project Manager to manage and lead User Acceptance Testing (UAT) activities for Regional and Global AppleCare systems and software projects. You will be responsible for the planning, coordination, execution management, issue resolution, and progress reporting of testing activities across business and technical groups on BPR led projects. You will also play a role in our ambitious testing transformation journey. Through your knowledge of testing methodology and quality assurance, you will help to evolve the way we approach test planning and execution.", "description": "Quality advocate who will partner with business and technical teams to build comprehensive test plans for cross-functional systems projects, with particular focus on UAT. Inspire others to fight for excellence, even under competing priorities and pressures. Participate in testing transformation activities by driving forward innovative approaches and methodologies. Proactively look for risks (technological, organizational, political) and identify appropriate mitigation plans. Seek expertise and involve the right experts for the best testing outcomes. Drive schedule, planning meetings and activities for UAT preparation and execution. Facilitate identification of test scenarios and ensure requirements traceability. Foster healthy debate and seek to understand multiple perspectives. Estimate resource requirements to complete testing, and ensure realistic plans are in place. Ensure the test environments and required data are available to support testing. Identify opportunities to leverage automation for test prep and execution. Utilize analytical skills to investigate and drive resolution of issues found in UAT activities. Report progress on UAT activities and issues to the project team and to management. Effectively lead meetings ranging from 2 to 60+ participants, and communicate resulting actions. Approach problems flexibly, and be willing to adapt and modify your approach, without compromising on the outcome.", "key_qualifications": "3-5 years quality assurance experience in testing of enterprise applications, with emphasis on planning and managing cross-functional testing. Ability to develop technical expertise and understanding of system interdependencies, and their impacts on testing plans. Experience with different testing methodologies and driving a quality mindset. Ability to abstract technical details and effectively communicate to audiences at different levels. Excellent listening, communication, leadership and presentation skills. Demonstrated experience balancing multiple efforts at a time. Ability to develop and maintain relationships with internal partners. Exemplify flexible thinking, curiosity, self-motivation, dedication to quality, focus on the details, and a positive perspective. Strong organizational and documentation skills. SAP functional experience, and experience migrating from SAP R/3 to SAP S/4 HANA is beneficial. Knowledge in test automation tools and frameworks is beneficial. Ability to travel up to 10% of the time.", "preferred_qualifications": "", "education_experience": "Bachelors degree or commensurate experience. Quality Assurance certification (ISTQB, ASQ, etc) and/or PMI certification is highly desirable. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551125"}