{"title": "Hardware Systems Engineer - Power Analysis and Modeling", "summary": "This is an exciting role in which you would influence Apple Watch through a potent combination of system modeling and hands-on characterization! You will be part of a team that drives the battery life modeling projections and optimizations for the various sub-systems of the Apple Watch, thereby making a deep impact on it’s architectural definition and performance. Using analysis and coding skills, you would model the power consumption of the unique features that make the Apple Watch best-selling smartwatch worldwide. At the same time you would be validating these features through hand-on characterization. Ultimately, you would be using this advanced system modeling and hard data to influence various teams across Apple to optimize power consumption while delivering the most delightful user-experience!", "description": "- Generate battery life projections for the team. \n- Driving battery life modeling, projections, optimizations, etc. \n- Define, develop, and use tools, scripts for system modeling and analysis; tool and model development / maintenance. \n- Power validation, testing, and characterization. \n- Characterization of HW and SW feature power vs performance across product releases. \n- Analysis of characterization results to help drive power optimizations across Apple Watch system. \n- Specify, negotiate, and document system power management & user level behaviours. \n- Cross-functional collaboration with module and SW teams. \n- Build internal and external system specifications. \n- Review & influence system performance decisions.", "key_qualifications": "Experience in power management modeling and energy-efficient system design.\nScripting expertise (Python, C++ proficiency would be a plus).\nExperience with lab measurements, characterization, debugging.\nExcellent written and verbal communication/presentation skills.\nBeyond technical capability, we prize curiosity, creativity, team-work and a passion for learning.\nExperience in wearable and/or mobile platforms would be a plus.", "preferred_qualifications": "", "education_experience": "BS or MS Degree in technical discipline.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549721"}