{"title": "Systems Signal Integrity Engineer - Apple Mac", "summary": "The Mac System Technology organization is looking for an enthusiastic engineer to support the system-level Signal Integrity (SI), analysis and validation aspects of Mac and Accessory products development. You should have deep knowledge and familiarity with all aspects of Signal Integrity for high speed SerDes, parallel bus, single ended signaling, and signaling interfaces deployed in personal computers and peripherals. If this is you, come join our team!", "description": "-  Model technique for physical signaling channel topologies including differential, single ended, and parallel bus types\n-  Interconnect modeling capability, using S-parameter, W-elements\n-  Understanding of channel types including cabling, PCB materials, flex materials, and connector design methods and limitations is required\n-  Skills with associated tools for 2.5D (PowerSI, SIWave, Sentinel-PI, nSys)\n-  Skill with associated tools for 3D Full wave (HFSS, nWave), quasi-static tools (Q3D, nApex)\n-  Relevant working knowledge of IBIS-AMI, HSPICE, Spectre, AMS, and Simplis models for system-level transient analysis is also necessary\n-  Working knowledge of ADS\n-  Measurement expertise with frequency and time domain tools (VNA, TDR) including calibration methods\n-  Ability to complete channel analysis, target impedance analysis, transient voltage droop and phase margin/stability analysis\n-  Experience with PERL, MatLab and other scripting languages\n-  Excellent documentation and communication skills\n-  Ability to work independently, and demonstrated ability to innovate", "key_qualifications": "", "preferred_qualifications": "PCB and PKG layout skill - plus\nWorking knowledge of IEEE 802.3bj and OIF multi-level signaling\nFamiliarity with RF schematic and PCB layout practice and ability to debug Desense issues.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552997"}