{"title": "SoC Performance Validation Engineer, Platform Architecture", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. In this role, you will be a member of the system-on-chip (SOC) performance team, working within the hardware technology group to shape the architecture of Apple's future devices. Our team initiates and fosters deep collaboration between the SOC architecture, design, power, and software teams, to deliver world-class network-on-chip and caches/memory system quality-of-service. The end goal is to provide the best customer experience in the world by enabling all the CPUs, GPUs, Machine Learning, Camera, Display, and Connectivity components on our chips to work seamlessly together. We are seeking an upbeat and highly motivated SOC performance engineer to drive the architectural validation and design correlation of our software-based performance model.", "description": "You will help define the comprehensive performance test plan, systematic test methodology, and develop novel infrastructure for the software simulator for iPhone/iPad/Mac/Apple Watch SoCs. The team pushes the system to its limits to help find and fix architectural and micro-architectural issues. Your data shall contribute to product performance and power trade-off decisions in our SoCs. This role will be highly visible and critical for driving architecture improvements in Apple’s future products. Your responsibilities will include: - Learning about the state of the art in SoC IP and chip-level architecture - Defining test plans and test planning methodology - Definition and implementation of validation infrastructure like performance monitors, behavioral checkers, state space coverage - Working on data analysis pipelines, visualization methodologies, continuous regression testing - Running performance simulation of future applications - Careful analysis and presentation of simulation results - Tuning and validating future SoC HW/SW for the best user experience - Interface and collaboration with cross-functional teams: architecture, hardware and software teams for collaborative debug, and correlation studies", "key_qualifications": "", "preferred_qualifications": "MS or PhD in CS, EE, or related field preferred. Experience with data structures and algorithms, Understanding of software engineering principles, Ability to study a problem in depth, design experiments, analyze data, and present results, Experience with micro-architectural performance modeling and architectural exploration, Experience with on-chip interconnect fabrics, caches, and memory/DRAM controllers, quality-of-service architecture", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559041"}