{"title": "Event Strategy Lead - Apple Events", "summary": "We want the world to be a better place! Join our team and imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish! The Worldwide Events and Experiences Team brings Apple’s iconic brand and products to life for audiences around the world. From launches and keynotes to live productions and hands on experiences, this team is charged with managing the planning, end-to-end production, guest journeys and unique details that set the standard. Apple is seeking a senior lead to join the event strategy team to lead Initiatives that help drive alignment, optimize the team, maximize resources and deliver consistent results.", "description": "You will be responsible for developing processes, plans, solutions and tools to drive operational standards and exceptional results. Help drive the organizational and cross-functional planning process, lead point on strategic presentations, ensure prioritization and help with scoping and substantiating new initiatives. You will be a positive influencer across diverse teams to proactively remove roadblocks and deliver best in class work. This new role will drive highly-visible, strategic projects and initiatives. Responsibilities: - Streamline complex organizational needs and projects to create greater efficiency. - Manage special projects as they arise. - Consistently identify and seize opportunities to optimize and accelerate outcomes. - Build strong partnerships, integration and alignment with key cross functional teams with a focus on finance, procurement, comms, product marketing, marcom, and other key internal cross-functional partners and vendors. - Lead vendor onboarding. Create playbooks, intake forms, and vendor catalogs, develop processes, documentation and trainings, and drive implementation across functional teams. - Establish collaborative relationships across the org and the company. - Track key work streams, set and communicate clear success metrics and re-calibrate as necessary to ensure the success of each project. - Drive high-level comms strategies to keep key partners and execs informed. - Manage issues and concerns through the proper levels of the organization in a timely and efficient manner. - Operate with a “no surprises” commitment to business partners and key partners, and become a role model for communication and collaboration. - Partner with Procurement and the Events team to outline broader organizational vendor needs and bidding process - Work closely with the event team leads, sourcing and procurement, finance and legal in selecting and on-boarding vendors - Collaborate on the annual and quarterly planning process ensuring clear communication and coordination with the team. - Drive weekly/monthly team meetings, setting clear agendas, assigning ownership and ensuring that action items are tracked and completed. - Support compliance with policy and procedures.", "key_qualifications": " ", "preferred_qualifications": "Experience working on, leading or supporting successful event teams. Proven success in leading indirect teams to achieve short and long-term goals. Exceptional program, project, and time management skills. Keynote proficient. A strategic operator and strong communicator, who thrives in a fast pace environment. The consummate multitasker, who can move quickly and cut through ambiguity to advance objectives and deliverables. A true partner, who is dedicated to developing and ensuring impactful individuals and teams. Passionate about building a structure and processes that support amazing work in a creative and demanding environment. Be equally comfortable drilling in to business requirements as you are with understanding the architecture and technical schemes of a vendor provided service, product, or tool. A problem solver with a consistent track record for delivering operational excellence within a dynamic organization. You are a humble and collaborative teammate who operates without ego. Know how to simplify the complex and can turn around a concise and digestible presentation quickly. Have an ability to develop/deliver solutions to nuanced problems where analytics, process change/development are keys to success. A person with the energy, drive and passion to do and be the very best. A driven leader who approaches things with a sense of urgency.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $179,000 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556729"}