{"title": "Bluetooth Systems Engineer", "summary": "Join our Bluetooth Wireless Performance Engineering team and be part of our innovation engine that drives the future! You will be part of the team where the focus is on enriching people’s lives by designing efficient and useful algorithms and driving well established technologies like Bluetooth to its maximum potential.", "description": "Join our Bluetooth SW Wireless team and be part of our innovation engine that drives the future! You will be part of the team where the focus is on enriching people’s lives by designing efficient and useful algorithms and driving well established technologies like Bluetooth and its coexistence with other radios. In this role you will take a systems approach to enable the best performance of wireless radios. This work requires strong understanding of wireless communications, signal processing and software engineering knowledge. If you think you are a great match for this role and are passionate about building awesome Bluetooth solutions, reach out to us.", "key_qualifications": "Excellent Wireless Communications and signal processing skills; Excellent debugging skills in wireless communications environments; Strong experience in building and maintaining wireless evaluation setups; Excellent scripting and data analysis skills in languages like Python; Prior exposure to Bluetooth/WiFI/Cellular wireless technologies is a must; Self-motivated and driven with creative and critical thinking capabilities; Thrive in a collaborative environment and can clearly communicate while driving multiple projects across many teams; Obsessively passionate and inquisitive, pursue problems in innovative ways; Laser-focused on the smallest details that are meaningful impact to our customers", "preferred_qualifications": "", "education_experience": "Master’s degree or foreign equivalent in Computer Science, Computer Engineering, Electrical Engineering or related field. Experienced and fresh graduates are encouraged to apply equally.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534200"}