{"title": "Virtualization Software Engineer", "summary": "Are you a big-picture problem solver who loves setting adventurous goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, multidisciplinary user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. Apple is where individual imaginations gather together, committing to the values that lead to great work. As a member of the Virtualization team within Apple's Core OS organization, you will play a critical role in developing frameworks and tools that enable our users to create applications and services leveraging virtualization technology. Your work will ensure that users achieve optimal performance and feature sets from virtual machines, creating interoperable and well-defined VMs without requiring deep expertise in virtualization. This role is pivotal to the enhancement of Apple’s products and services, offering a chance to contribute to a relatively new and dynamic field within Apple's core operating system, rich with opportunities for innovation and improvement.", "description": "Develop features and tools using Swift and Objective-C as part of Apple's OS release process and for internal use. Triage issues, identify root causes, and produce high-quality fixes. Ensure code is well-tested and maintain high standards of quality. Collaborate with other teams within Apple to integrate and optimize virtualization features. Take ownership of key features and initiatives, driving them to successful completion.", "key_qualifications": " ", "preferred_qualifications": "Previous development experience with virtualization (ARM or Intel). Experience with the design and development of application frameworks. Experience developing tools and systems that enable automation at scale. Familiarity with kernel debugging.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553402"}