{"title": "Software Engineering Manager - Applied ML Localization", "summary": "The Software Localisation team powers the tooling, features and processes used to create an exceptional localized experience for Apple’s international customers. We are looking for a proven leader to manage a diverse team of Applied ML engineers who will work cross-functionally and globally to deliver the next generation of ML tooling and end-user features for international locales. This person will be a creative, motivated, passionate technical leader who is great with people and has a robust understanding of large language models (LLMs), generative AI, Natural Language Processing (NLP) and Machine Translation (MT).", "description": "As the manager of the Applied ML Engineering team in the Software Localisation, you will manage a phenomenal team of passionate Applied ML engineers to design, implement and qualify ML localisation features, processes and tooling across a wide variety of Apple’s products. Your role is to ensure Apple Internal Engineers, Translators, Linguists, and Apple third-party developers can deliver world-class software products to millions of users around the world. This team’s duties include: Leading the exploration and application of Large Language Models (LLMs) for performing translation tasks and Apple product features, Translating the latest research into high-quality systems and models that can be practically applied to further improve machine translation or Apple product features, Actively engaging in all aspects of model development, from ideation, training, experimentation to deployment, Collaborating with translation, Localisation quality, project management and engineering teams to develop and implement machine learning solutions. Responsibilities You and your team will be responsible for delivering the ML tools and features to answer product, engineer and customers' requirements in an Agile-like environment. This includes: Working cross-functionally with various software teams to analyze requirements, prioritize and define goals, and then achieve them, Tracking progress of the team's tasks, Find ways to improve ML engineering workflow, support and maintenance, Present and scope solutions, Lead, support, and help your team members to grow, build their careers, and do the best work of their lives", "key_qualifications": "Excellent communication and team leadership skills, Proven track record of growing and developing people, Extensive cross-functional project leadership and delivery experience, Experience with Machine Learning (ML), with a particular emphasis on Large Language Models (LLMs) and Natural Language Processing (NLP), Proven ability to comprehend, interpret, and apply cutting-edge research into consumer-oriented products, Experience adapting pre-trained LLMs for downstream tasks, Ability to manage a diverse team, Self-motivated and proactive, Ability to work in a fast-paced environment with frequent context switching and changing priorities, Experience in software engineering", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Engineering/Computer Science, or equivalent work experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549724"}