{"title": "Carrier Sales Manager - T-Mobile Consumer Lead", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\n\nApple’s US Sales organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. We are, in many ways, the face of Apple to our largest customers. As the Carrier Account Sales Lead you will be responsible for driving day to day commercial operations and relationships with our carrier partner's HQ teams across Apple product lines. \n\nWe are looking for a proven leader, who excels in coaching and developing field based account executives. Detail-orientated and self-structured in your approach to work, with the ability to manage relationships at all levels. Ideal candidate should have proven presentation and partner leadership skills, and thrive in a fast-paced environment and a culture that relies on teamwork.", "description": "-  Lead pipeline development, prospecting, deal execution, implementation, and continued management.\n-  Manage compliance to key commercial obligations and identify gaps/opportunities to drive increased performance year over year.\n-  Identify business opportunities and guide initiatives to grow the account and the carrier’s dedication to Apple products over time.\n- Facilitate Apple interactions across all levels of the organization - with Operations, Marketing, Legal, Product, Engineering and more. \n-  Help develop and negotiate deals and agreements - across all of our products and Services.\n-  Facilitate all aspects of account management from day-to-day troubleshooting to strategic interactions.", "key_qualifications": "", "preferred_qualifications": "Have proven presentation and partner leadership skills, and thrive in a fast-paced environment and a culture that relies on teamwork.\nExcellent problem solving skills with expertise in understanding carrier data, developing creative solutions and execution to get results\nDemonstrated strengths in relationship management, teaming across functions, deal making & negotiations\nExpertise in influencing internal and external partners to attain financial approvals and negotiate critical business terms\nAbility to quickly develop, iterate, and navigate through large scale contracts and agreements in partnership with legal teams\nStrategic agility: demonstrated ability to identify and drive new opportunities\nAbility to work in a fast-paced, entrepreneurial environment\nAbility to succeed through ambiguity and get results", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $159,500 and $239,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558127"}