{"title": "Performance Engineer, Tools and Framework - Ad Platforms", "summary": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.", "description": "- Build tools and frameworks that provide real time application performance metrics that can be correlated with system metrics.\n- Develop tools and automation frameworks that empower applications to thoughtfully predict and overcome system/infrastructure failures, ensuring fault tolerance.\n- Dive into source code, profiling information, and system metrics to root cause analyze performance issues.\n- Run experiments and benchmarks to understand the performance of complex distributed systems and isolate performance issues.\n- Collaborate with software teams to pinpoint and address performance bottlenecks.\n- Plan, strategize, and execute tests to evaluate low latency and high throughput applications.\n- Design, prototype, and integrate solutions that deliver demonstrable performance gains in production environments.\n- Design and implement frameworks to performance test online and offline systems.\n- Work efficiently with cross-functional teams, understanding product requirements and designing performance test strategies, planning, executing, and monitoring tests.\n- Build the product expertise needed to help debug production performance issues.\n- Qualify product features for production release and sign-off.", "key_qualifications": "Expertise in writing performance test plans, defining performance test strategy, and large dataset generation techniques.\nProficiency in developing performance tests using open-source frameworks and ability to write new frameworks based on requirements.\nExperience in load generation using JMeter, Locust, Gatling frameworks, and developing extensions or plugins for the same\nGood understanding and working knowledge of HTTP client libraries, JDBC, gRPC, microservices architecture, and distributed systems.\nExperience using monitoring tools like DataDog, Grafana, AWS CloudWatch, and Splunk or similar.\nWorking knowledge of Kubernetes, Docker, Kafka, AWS S3.\nAbility to work in dynamic, agile teams, driving and delivering highly scalable products to production.\nExcellent analytical, problem-solving, and communication skills.\nExperience with CI/CD Jenkins integration, AWS EMR & Spark SQL is a plus.", "preferred_qualifications": "", "education_experience": "BS/MS in computer science or equivalent field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548292"}