{"title": "Software Engineer, System Experience", "summary": "The System Experience team is looking for a proactive and highly skilled engineer to build to new experiences and future technologies. Come work with a creative and hardworking team of engineers, multi-functional teams, and world-class designers to deliver the best experience on the planet!", "description": "As an engineer on the System Experience team, your responsibilities will range from prototyping new user interface paradigms and implementing new features to fixing bugs and improving performance. You should have an excellent understanding of software design, good debugging skills and an eagerness to work hard and learn a lot. As our team works cross-functionally with many other groups across Software Engineering, Hardware Engineering and Design, you should have a good understanding of systems and excellent communication and collaboration skills!", "key_qualifications": " ", "preferred_qualifications": "Passion for building beautiful products, Excelled in collaborative, cross-functional environments", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557161"}