{"title": "Junior Cloud Network Software Engineer - Platforms", "summary": "Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming industry leading products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for an indivual to be part of the software defined infrastructure (SDI) architecture team focusing on networking for the Cloud Platform. We build web services that work at scale to support infrastructure and security management and control. As an engineer in the SDI group, you will be part of a team building infrastructure and tools for cloud platforms that will shape the future. You will work in a startup-like environment where products are still being defined and developed, giving you the chance to influence some of the core tools used by the project and be part of every stage of development from concept to deployment. We are looking for engineers to build, scale and operate a robust ecosystem for software defined network engineering. If you are passionate about innovating and building highly available distributed systems from scratch for the massive scale of our network infrastructure, then our team might the right place for you.", "description": "You are passionate about solving new problems, simplifying complex technical challenges and continuous improvement. In this role, you will partner with passionate teammates to engage with engineers and software developers to architect and solution highly available, secure, efficient cloud services that operate at enterprise scale. WHAT YOU WILL DO: - Contribute to the delivery of cloud infrastructure automation to support cloud adoption - Build services on cloud and / or provide standard Infrastructure as code (IaC) modules Work on complex distributed systems, deployed across multi cloud environment such as in AWS, GCP, Ali - Idea to running in production: design, code, writing unit tests, performing integration tests, deploying to production, supporting the system in the production environments - Streamline, automate and consolidate complex infrastructure - Work in a dynamic Agile development environment and remain adaptable to changing requirements - Engage with customers and support to solve production issues.", "key_qualifications": "3+ years of experience with Great problem-solving skills, Curious and motivated learner, Clear communicator - you are concise and articulate in speech and writing and practice active listening, Coursework or relative experience with data structures, algorithms, and debugging (bonus if you’ve completed at least one of these courses: Distributed Systems, Web Development, Network or Application Security), Fluent in any one of the following programming languages: C, C++, Go, or Rust, Strong ability to prioritize, deliver on aggressive deadlines and drive closures, High tolerance for ambiguity", "preferred_qualifications": "", "education_experience": "Bachelors (Masters is an advantage) Degree in Computer Science", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501688"}