{"title": "Spatial Audio & Live Streaming Engineer", "summary": "Imagine what you could do at Apple! Everyday, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. The Audio & Media Technologies (AMT) group is at the center of audio, video and graphics support in Apple’s innovative products, including the AirPods, HomePod, Mac, iPhone, iPad, Apple Watch and Apple TV. AMT’s Audio team provides the audio foundation for various high profile features like VR & Gaming Audio, Siri, FaceTime, media capture, playback and API’s for third party developers to enrich our platforms. The team is looking for talented engineers who are passionate about building audio features and products for millions of customers and care about overall user experience. You will revolutionize the audio experience for game and future audio technologies. The team is seeking an experienced audio engineer to bring up Content Creation and Live Streaming infrastructure for compelling VR experiences.", "description": "In this dynamic role, you will called upon to develop technology to enable the creation and streaming of next generation audio and video content. Duties will include the design, enhancement, and software development of various toolboxes from DAW plugins to Audio Authoring and Monitoring Units for Live workflows. You will be integrating and developing novel DSP tools for the creation, manipulation and acquisition of 3D/Spatial Audio in conjunction with Video. The platforms for these tools will be various Apple platforms and also embedded platforms for live content creation", "key_qualifications": "", "preferred_qualifications": "7+ years experience in software development of DAW plugins and/or Live Audio Broadcast infrastructure, In depth knowledge of ProAudio Hardware and Software tooling, In depth knowledge of Spatial/3D Audio, Knowledge of Audio Digital Signal Processing, Experience with creation of DAW plugins (VST, AAX, AU), Masters degree or above in Music Technology, EE, CS and or related fields - or commensurate experience, Experience with AR/VR technologies is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560394"}