{"title": "Software Engineer - Silicon Engineering Documentation", "summary": "Does an exciting, dynamic, fast paced and team oriented environment catch your attention? Do you love crafting sophisticated solutions to highly complex challenges? If so, consider joining us! Apple’s Silicon Engineering Group is looking for a high energy, highly motivated Software Engineer to support a variety of key internal projects by improving and streamlining the design and development process. You’ll ensure Apple products and services can seamlessly and deftly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!", "description": "- Streamline and automate aspects of specification creation, review and verification with a view to improving the quality of the technical specifications used by the internal hardware and software teams.\n- Diagnose and optimize performance problems on a variety of tools.\n- Deliver toolchain training and guidance to the support team that works directly with designers,\nDocument toolchain workflows and processes.\n- You will be expected to bring experience and good judgment to continuously drive process improvement across multiple, simultaneous projects, and systems.", "key_qualifications": "Experience in Scala and/or Java.\nWorking knowledge of XML and related technologies (XSLT, XPath).\nExperience working with PostgreSQL or other relational databases.\nUnderstanding of software test environments and release cycles.\nDomain modeling and schema design.\nFamiliar with source control systems such as Perforce, SVN, Git, etc.\nFamiliar with build systems such as Gradle, Ant, SBT, Maven, etc.\nExperience with continuous integration such as Jenkins, Team City, or GitLab CI/CD — especially building customized CI/CD pipelines.\nKNOWLEDGE OF THE FOLLOWING IS A PLUS:\nPrior experience with XSLT 2.0/3.0, XPath 2.0/3.1, XQuery 3.1, XSD 1.0/1.1, and XProc.\nBuilding build systems plugins\nHands on frontend development (HTML/JavaScript/CSS).\nExcellent scripting skills with Bash, Perl, or Python.\nPrior experience working with Mac OS, Linux, and/or other UNIX environments.\nFamiliar with content management approaches and concepts.\nExperience with silicon workflows and development processes.", "preferred_qualifications": "", "education_experience": "BS and 3+ years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527589"}