{"title": "SAP BTP Engineer, Enterprise Systems", "summary": "Apple is seeking an expert SAP BTP Engineer passionate about delivering outstanding enterprise business applications. The individual must be self-motivated, an excellent problem solver, and a fast learner. Good technical skills and experience writing commercial-grade applications on SAP BTP are required. The candidate will work with dedicated engineers in a rapid, technically demanding environment to deliver new features.", "description": "As SAP BTP Engineer, you will be responsible for designing, developing, and deploying cloud enterprise solutions using a combination of SAP technologies and platforms. Work with functional analysts to capture requirements, and collaborate with developers to design consumer-grade business applications. Be up to date with the latest SAP BTP features and services. Analyze and resolve significant, sophisticated, high-impact production problems, assessing alternatives as appropriate and implementing solutions. Ability to review the work of contractors and come up with standard methodologies. Balance multiple tasks and be flexible in switching between different tasks. Work with multi-regional teams across different time zones", "key_qualifications": "Understand Micro-service Architecture, SAP Cloud Foundry features & capabilities. Experience on Hana Cloud HDI Containers with SQL Script, PL/SQL, Stored Procedures, Designing tables, calculation views. Core Data Services (CDS) with Strong Cloud Application Programming model(CAPM), OData & JavaScript Experience. Knowledge of BTP Services Identity Services, XSUAA. Hands-on experience with SAP Business Application Studio (BAS), GIT, and DevOps. 4 - 6 years of experience in designing and developing SAP applications", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505240"}