{"title": "Systems Re-Engineering Project Management", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have envisioned - and now can’t imagine living without. The Business Process Re-Engineering and Business Analytics team are looking for a Project Manager with strong SAP experience. In this role, you will devise and implement process & systems solutions that meet the needs of our dynamic business conditions, and partner with our IS&T team to perform UAT and deliver these solutions. Applying project management methodology to support the completion of key projects, you will lead and handle multi-functional projects. You'll need to maintain priorities and deadlines, and maintain an excellent level of focus on detail. You will bring a strong customer service ethos, as well as superb communication and computing skills. Are you excited by the idea of making a real impact? Are you prepared to dream big? Then a career with Apple might be your dream job. We would love to hear from you!", "description": "Influence and build consensus among partners on strategies, priorities, and solutions. Maintain a strong commercial focus with high levels of enthusiasm and energy. Lead multi-functional re-engineering project implementations. Provide clear and consistent status updates on solutions and progress to all key partners across various platforms and organizational levels. Drive and manage regional and global process integration. Stay informed on current and future IT capabilities. Establish and maintain professional and transparent relationships with external parties. Understand business needs and approach problems with creativity and innovative ideas. Conduct post-mortems on critical programs to ensure continuous improvement. Lead the analysis of new program requirements, define their scope, develop execution plans, oversee project implementation, and establish metrics to ensure success.", "key_qualifications": "", "preferred_qualifications": "Skilled at balancing multiple projects and stakeholders simultaneously. Possess excellent business acumen and a comprehensive understanding of the broader business context. Strong analytical and problem-solving abilities. Proven experience in leading key stakeholders at all senior management levels, becoming a trusted advisor to functional business leaders. Preferable previous experience working with manufacturing and procurement teams. Degree in MIS, computer science, IIPMM or business related fields.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526994"}