{"title": "iPhone Touch Sensing Architect", "summary": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. As a Touch Sensing Architect, you’ll play an integral role in conceiving, modeling, prototyping and integrating new sensor solutions for the iPhone. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity.", "description": "You will play a key role in the architecture, integration, and launch of next-generation touch sensing technologies. Your responsibilities will include: Develop key figures of merit critical to performance and author requirement specifications Develop end-to-end models capturing sensor, circuits, DSP, and algorithms to predict key figures of merit and inform technical decisions Develop tools, scripts, and infrastructure to enable scalable modeling Sensor design, ASIC application design, system-level integration and bring-up Analyze and reconcile build data with model predictions Perform failure analysis, identify root causes and propose corrective actions Provide clear technical updates to broader team and leadership", "key_qualifications": "Deep understanding of physics, analog circuits, linear algebra. Experience in modeling, building and testing complex, multi-physics systems Proficiency in MATLAB, SPICE, COMSOL or similar packages Hands-on experience in system-level design, architecture, characterization and validation. Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams. Excellent communication, teamwork, and leadership skills Experience with high-volume mass production is a plus.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551430"}