{"title": "ASIC Design Engineer - Neural Engine DMA", "summary": "Do you love crafting elegant solutions to highly sophisticated challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!", "description": "As an ASIC Design Engineer in the Pixel IP DMA team, you will work closely with architecture, design, and verification teams to build commitment and low power DMA engines. Apply your knowledge of flow control, arbitration, cache design, compression, pipelining, sequencers, and other techniques to coordinate moving large amounts of data between the memory subsystem and the Apple Neural Engine Core (ANE).\n\nIn this front-end design role, your tasks will include:\n-  Coding high-quality RTL, with embedded assertions and cover points.\n-  Writing detailed micro-architectural specifications.\n-  Collaborating with multi-functional teams to explore solutions that enhance performance while minimizing power and area.\n-  Working closely with design verification and formal verification teams to d...", "key_qualifications": "Experience in SoC front-end ASIC RTL digital logic design using Verilog, or System Verilog.\nExperience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designs.\nExperience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.\nGood collaboration skills with strong written and verbal communication skills.\nGood understanding of flow control, arbitration, address translation, caching, on-chip interconnects, and performance analysis.\nPrefer previous experience designing dedication DMA engines, multimedia IPs (especially AI/ML applications), data storage, memory controllers, networking, image processing, interconnects, and/or low power design.\nPrefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB), and relevant scripting languages (Python, Perl, TCL).", "preferred_qualifications": "", "education_experience": "Bachelor's degree + 3 Years of Experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock un...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549156"}