{"title": "Churn Optimization Lead, Apple TV+", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Come be a part of the team driving the growth of Apple TV+! This is a global role that requires you to work closely with many groups.", "description": "The Churn Optimization Lead, Apple TV+, will be responsible for the execution of experiments designed to optimize the on platform and off-platform experience for subscribers to drive conversion and retention. Partnering with collaborators, this person will help with the development and implementation of tests across a variety of channels, while maintaining results and using findings to continue to optimize the experience.", "key_qualifications": "B.A./B.S or M.S. or advanced degree in Marketing, Business, or Project Management; Minimum 5 to 7 years of relevant industry work experience with a good understanding of video streaming and/or subscription businesses - especially user engagement, conversion and retention; Structured and modeled AB tests with data science and analytics to optimize and increase engagement, retention and LTV", "preferred_qualifications": "Experience collaborating effectively with multiple internal teams to meet business objectives specifically to drive growth from our existing membership base; Self-starter who works effectively in a fast-paced environment; Excellent analytical skills with the ability to quickly translate data into actionable insights; Laser focus on the business goals and the end consumer; Strong project management capability with attention to detail; Energetic and collaborative teammate with exceptional relationship-building and interpersonal skills; Passionate about media and consumer technology; Excellent presentation, written and verbal communication skills; Ability to articulate a strong point of view clearly and succinctly", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $108,200 and $206,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556769"}