{"title": "Enclosure Global Supply Manager - Beats", "summary": "The Enclosure Global Supply Manager (Enclosure GSM) will work within the Beats organization. GSM will partner with cross-functional product teams across Apple to develop and introduce new products that are both innovative and cost advantaged.", "description": "-  Successful GSMs thrive in a changing environment and constantly drive excellence across their own responsibilities as well as that of team members and partners. They frequently use strategic internal relationships to effectively collaborate with engineering, operations and other Apple teams. You are able make decisions with the information available, think and stay focused, and communicate concisely and effectively with senior management as well as peers. GSMs identify and scale new and existing manufacturing partners as well as implementing creative and strategic commercial deals to achieve goals around cost, supply, and quality.\n-  Plan and implement NPI strategies from the product concept stage to the engineering builds and through product ramp.\n-  Work as a project manager to lead NPI ramp at enclosure vendor site.\n-  Manage healthy supply of sustaining products, line extensions, market drops till EOL.\n-  Work with US counterpart on should cost, work with vendors to meet cost target during NPI and cost down plan post ramp.\n-  Drive detailed cost trade-off analyses. \n-  Manage mechanical cost BOM to ensure mechanical cost targets meet overall product cost goals. Challenge high cost parts and propose alternative solutions, until cost target is met.\n-  Investigate and propose manufacturing processes, materials, and designs that optimize cost for our x-functional engineering partners. \n-  Investigate and propose off-AVL suppliers and/or vertically integrated supply chains and spearhead the x-functional team to bring them up as a strategic Apple AVL supplier.\n-  Drive product cost optimization and industry/supply chain intelligence through competitive product tear down activities and bottoms up cost estimation.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "", "preferred_qualifications": "-  Top-notch analytical/negotiation skills\n-  Excellent presentation and interpersonal skills\n-  Ability to toggle between strategic and detail orientated thinking\n-  Tenacious problems solving and issues resolution skills\n-  Deep expertise with “should cost” modeling\n-  Ability to challenge the engineering design team on requirements, specifications and suggest alternate designs that meet design requirements\n-  Ability to influence across multiple functional teams\n-  Flexibility to adapt dynamic and rapidly changing environments\n-  Excellent communicators, capable of working in multinational environments, driven and motivated by accomplishing extraordinary objectives\n-  Hands-on experience in any of the following: Mechanical engineering, mechanical development, manufacturing practices / techniques involving CNC machined parts, enclosures, casings, jigs, tooling, fixtures, injection molding, cable extrusions, cable assembly, etc\n-  Good & efficient data analysis ability. Knowledge in machine learning would be nice to have.\n-  Ability to travel 50%", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554037"}