{"title": "Site Reliability Engineer (SRE) - ASE / Provisioning", "summary": "People at Apple don’t just build products — they craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it. The Apple Service Engineering - Provisioning SRE team is looking for Site Reliability Engineers to build and run the services that hundreds of millions of customers use every day.", "description": "This role is for a full-time SRE to develop on the automation of provisioning new hardware for Apple datacenters, and for running that automation in production, with users such as high-traffic orchestration systems that drive mass configuration changes. The role involves understanding the team's roadmap; taking ownership of projects or deliverables within that roadmap; designing solutions and building buy-in for those designs; and successful delivery of those designs in order to meet the project goal. The role involves giving technical feedback to colleagues to assist them in the delivery of their designs, features and projects, as well as follow and champion technical standards across the two-site team in collaboration with other members of the team. The team has an on-call rota including the weekends and the successful candidate should expect to handle alerts and other escalations in order to maintain a high level of availability and functionality for our provided services. The team is in two shards in the UK and US, and cross-timezone meetings are a core feature of how our team collaborates, reaches agreements, and executes to deliver projects. While we develop and run automated services, a deep understanding of OS/hardware interactions, BIOS configurations, and low-level networking protocols is necessary in order to investigate anomalous behavior and document constraints and expectations in an automated format.", "key_qualifications": "Experience in DHCP and PXE, or other low-level networking protocols. Motivated problem solver with an understanding that business needs are a balance between velocity and scope. Must have some experience working across multiple timezones to deliver and launch production-changing projects. Multiple years' experience in one or more of the following languages: Golang, Python, YAML, JSON, Anaconda, Puppet. Experience in multiple of the following technologies: CI/CD, Spinnaker, Jenkins, Prometheus, PKI/asset identity management.", "preferred_qualifications": "", "education_experience": "Bachelors degree in Computer Science or related field, or equivalent employment", "additional_requirements": "The candidate may be expected to travel to other Apple locations from time to time e.g. the USA", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540602"}