{"title": "Global Supply Manager, SoftGoods", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts! Imagine what you could do here!", "description": "-  Supply chain managements: identification, development, negotiation and management of developing Apple soft goods materials suppliers. -  Site lead: Take the lead to facilitate the communication and co-ordination on cross functional issues timely to avoid supply Impact -  Build support: engage into new product introduction & readiness review for factory ramp, capacity plan, equipment readiness, labor readiness -  Cost managements: develop, negotiate and implement a part and assembly cost strategy. -  Supplier capabilities bring up: An understanding of materials manufacturing processes/ techniques is important to better evaluate supplier capabilities and opportunities for Apple -  On-time-delivery : schedule, capacity and supply planning to meet Apple’s / FATP production demand -  Risk mitigation: evaluation of technical and business risks using data based analysis and developing sound risk mitigation alternatives -  Program Management: the ability to manage all of the above tasks and personnel resources", "key_qualifications": "", "preferred_qualifications": "Excellent communication and interaction skill, Proven ability and passionate to drive and deliver strategic business initiatives, Outstanding analytical capabilities with focuses a decision down to critical insights, even when it means giving up other options, Expresses confidence that their decisions are rooted in clear thinking, Self motivated with innovation, integrity and attention to details, result driven, Building partnerships and working collaboratively with others to meet shared objectives, Understanding of costing structure / concepts, Production plan / DN / liability analysis model building by ML/AI skill, Able to speak Japanese is an advantage", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557713"}