{"title": "Cellular PHY Systems Engineer – Millimeter-Wave Beam Management (m/f/d)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. The Wireless Communication group at Apple is a high energy, results-oriented team. We are looking for highly motivated and committed engineers to join our exciting team of innovators. In this role, you will be a key member of the cellular system engineering team working on physical-layer development, with a focus on millimeter-wave beam management.", "description": "In this technical role, you will be responsible for scoping and development of millimeter-wave beam management physical-layer features in 5G-NR as part of cellular system engineering team working on state-of-the-art wireless products. Core responsibilities: • Define features and requirements, as proprietary initiative or based on 3GPP standards; • Explore and propose concepts & algorithms, identifying performance trade-offs; • Develop and simulate models to ensure robust functionality & performance; • Work with architects, upper-layer designers, and RF engineers to optimize architectural partition, control/message flows, and timelines; • Collaborate with firmware and software developers for power- & area-efficient realization; and • Drive end-to-end verification and resolve issues for commercialization.", "key_qualifications": "", "preferred_qualifications": "Experience in wireless beamforming research and development, including collaboration with HW/FW/SW towards product commercialization. Knowledge of cellular communication standards, in particular 5G-NR RAN1/RAN4, including PHY/MAC/RRC procedures. Familiarity with cellular user equipment (UE) baseband modem architecture, including interfaces among subsystems. Familiarity with RF, phased arrays, AGC, and inter-chip communication & control. Experience in chip bring-up and conducted/over-the-air lab/field verifications. M.S. in Electrical Engineering or Computer Science with applicable years of working experience or Ph.D. in relevant field. Candidates with more experience will be considered for suitably senior positions. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558347"}