{"title": "Critical Facilities Technician, Data Center", "summary": "At Apple, we embrace diversity, continuously strive for excellence, and thrive in an environment of innovation and collaboration. We are actively seeking a Data Center Critical Facilities Technician who will excel among a team of thinkers and doers, committed to working in a mission-critical environment that values continuous improvement and adopts change! Apple’s Data Center Operations team thrives with individuals like you that take pride of ownership for the services provided in our critical environments. We excel at actively leading and maintaining systems that expand our customer support capabilities, and assist the world with their daily lives! As part of a group of like-minded people, you will address sophisticated topics that craft how we maintain and operate our facilities. We vision of the future motivates you to optimize for efficiencies and improvements. Generate ideas that push team members and senior leaders to expand the boundaries of innovation and technology. With your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements and serve as an expert in your specialty (e.g., cooling, electrical).", "description": "Solid understanding of hyper scale electrical and mechanical systems and NFPA70e and OSHA Regulations that pertain to data centers. Ability to perform practical applications of, preventative and corrective maintenance for mechanical, electrical, plumbing and other infrastructure systems. Responsible for the safe, professional, and operationally sound manipulation of electrical systems that support systems in high-availability, high-risk, or high-reliability environments. Regularly inspects and supervises critical equipment and responds to irregular or malfunctioning conditions. Responds quickly to emergency situations that impact the operations and coordinates with other critical facilities professionals to perform corrective repairs. Demonstrates the ability to read and interpret fire system, electrical system, and mechanical system drawings. Follows all federal, state, and local regulations for operations and work safety to include knowledge of safety procedures and equipment, procedures and established techniques.", "key_qualifications": "Solid understanding of hyper scale electrical and mechanical systems and NFPA70e and OSHA Regulations that pertain to data centers. Ability to perform practical applications of, preventative and corrective maintenance for mechanical, electrical, plumbing and other infrastructure systems. Responsible for the safe, professional, and operationally sound manipulation of electrical systems that support systems in high-availability, high-risk, or high-reliability environments. Regularly inspects and supervises critical equipment and responds to irregular or malfunctioning conditions. Responds quickly to emergency situations that impact the operations and coordinates with other critical facilities professionals to perform corrective repairs. Demonstrates the ability to read and interpret fire system, electrical system, and mechanical system drawings. Follows all federal, state, and local regulations for operations and work safety to include knowledge of safety procedures and equipment, procedures and established techniques.", "preferred_qualifications": "", "education_experience": "High School diploma or GED equivalent", "additional_requirements": "Data Center Environment, Controls, Power Generation, UPS, STS, Batteries, Critical Facilities, Troubleshooting, Mechanical, HVAC, Electrical Code, Evaporative Cooling, Pumps, Motors. Critical Facilities Technicians work 8, 10 or 12 hours per day on a rotating shift schedule including graveyard, weekend and holiday shifts and may work overtime depending on business needs. Ability to sit, stand, bend, stoop, push, pull, reach and lift as required, on a continuous basis, with items that can weigh up to 75lbs. Ability to work extended hours within a Data Center Environment and typically within a heat range of 60 degrees Fahrenheit upwards of 110 degrees Fahrenheit while following OSHA driven work rest cycles. Requires ability to climb and utilize a ladder varying in types from A-Frame to extension ladders at various heights. Requires ability to operate a forklift, pallet jack or other material handling equipment after accurate training is provided. Use of appropriate PPE such as ARC Flash suits and/or coveralls, in a variety of environments.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547651"}