{"title": "Wireless System Engineer - Ranging and Sensing", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!", "description": "As a Wireless Systems Engineer, you will be responsible for the design of next generation and proprietary ranging and sensing technologies at the PHY layer. This role requires collaborating closely with multiple cross-functional teams to derive the requirements, create and implement the ranging and sensing designs, validate pre-silicon, bring up post-silicon, and optimize performance and reliability. Ultimately, you will need to deliver a solution that achieves the target requirements and satisfy user-level expectations.", "key_qualifications": "Knowledge of ranging and sensing protocols, experience developing ranging and sensing algorithms, experience with Matlab or C/C++ for algorithm development, modeling, and simulation, strong analytical skills, and strong understanding of communication theory and signal processing.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant experience required. MSEE/PhD preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $135,400 and $250,600. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Additional benefits include comprehensive medical and dental coverage, retirement benefits, discounted products and free services, reimbursement for certain educational expenses, discretionary bonuses or commission payments, relocation assistance, and more.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534164"}