{"title": "Safari Web Intelligence Engineer", "summary": "We are looking for an engineer to help us us build models and systems to make interacting with webpages easier and more delightful. The Safari Core Technologies team builds on the industry-leading WebKit engine and Apple's frameworks to deliver features like AutoFill and Reader, which intelligently offer better and more efficient ways to interact with webpages!", "description": "In this role, you’ll help us develop new, innovative Safari features that make it easier to find information on and interact with webpages while taking existing features to the next level! You’ll be involved from beginning to end — brainstorming, prototyping, coding, debugging, shipping, and addressing customer feedback. You will work directly on the product in highly cross-functional teams; you will collaborate with other Machine Learning and AI teams across Apple, with the WebKit team, with other iOS and macOS application and framework teams, and with Apple’s Human Interface group. You will take primary responsibility for designing, training and shipping new models, from initial ideation through data collection to model development and evaluation and ultimately through to deployment. Your work will have large-scale impact, so we want you to be imaginative and self-motivated and to care deeply about craftsmanship and quality.", "key_qualifications": "Ability to thrive in a highly collaborative environment focused on learning\nExcellent communication skills\nStrong object-oriented programming experience\nThorough understanding of at least one of; Swift, Objective-C, C++, or C\nThorough understanding of Python\nKnowledge of popular machine learning frameworks and the Python data science ecosystem (including experience with at least one of PyTorch, TensorFlow, or Jax)\nExperience of developing, deploying and evaluating new machine learning models, ideally in cross-functional teams\nFamiliarity with JavaScript, HTML, and CSS", "preferred_qualifications": "", "education_experience": "M.S. in Computer Science, Machine Learning, or a related field with extensive programming experience preferred, or equivalent.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505389"}