{"title": "Product Manager - Data-as-a-Service", "summary": "Apple is seeking a highly motivated and innovative Product Manager to join our team and oversee the development and expansion of our Data-as-a-Service (DaaS) platform.", "description": "We are looking for a world-class Product Manager who has the right mix of technical, communication and business skills to lead and deliver strategic initiatives in a fast-paced environment.", "key_qualifications": "", "preferred_qualifications": "Master’s degree in Computer Science, Information Management or related field\nMinimum 7 years of experience in product management, setting the vision for, enabling the development of, and launching complex DaaS or data-related products\nExperience in leading and influencing various cross-functional teams and external partnerships to drive decisions and outcomes\nStrong understanding of market trends, technologies, best practices and customer behavior in the DaaS industry , with deep knowledge in data governance, data security and privacy best practices\nSelf-motivated and proactive with demonstrated critical thinking and creative problem solving skills, and the ability to assimilate and learn complex processes in a changing and dynamic work environment on a steep learning curve\nExcellent communication and presentation skills, written and verbal, to all levels of an organization, with the ability to filter and distill relevant information for the right audience, including Senior Executives and Technology Leaders\nWork experience in sales, finance or business development teams with exposure to sales finance, pricing or supply chain processes and strategies, including demand generation, pricing, sales scenario planning and sales forecasting\nFamiliarity with cloud computing platforms such as AWS, Azure, or Google Cloud & AI/ML frameworks", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555694"}