{"title": "Logistics Program Manager - WW Business Process Re-Engineering", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We are looking for a Logistics Program Manager to be a part of the WW Business Process Re-Engineering within the Worldwide Business Process Engineering organization. We look forward to your working with a globally dispersed cross- functional team, lead resources, prepare appropriate documentation based on the project size, delegate tasks to team members, effectively and clearly communicate project status, manage project risk, monitor change readiness of the business as well as conduct post implementation audit reviews. The role entails coordinating all aspects of project information including timelines, budgets, resource allocation, prioritization, scope and definition, and provide oversight of a global portfolio of projects.", "description": "This exciting role is part of the BPR team focusing on improving Business Processes across Apple. We seek someone with the ability to lead medium to large size, global cross-functional projects. This effort is directly linked to our product strategy and needs to be forward-looking. Responsibilities include: Responsible for managing cross-functional and cross-organizational teams to define, build and roll-out innovative technology and business process solutions that increase efficiencies, reduce costs, improve customer satisfaction, and increase quality and/or throughput. Work with senior management and global teams to define processes and system roadmaps and drive improvements of the organization. - Serve as domain expert in BPR on SAP focused solutions. Be able to consult across projects including those not directly owned, and give feedback on where solution designs may not be making the best use of standard SAP capabilities and functionality. - Partners with key cross-functional partners to solicit customer and associate feedback to identify program improvement opportunities for implementation - Act as a liaison between the business teams and IS&T (Information Systems and Technology or Apple's IT organization) and/or Partner IT teams to ensure that the business requirements are complete and met by the proposed technology solutions - Drives the design, development, implementation and management of solutions for internal customers - Work with business leads to define and manage business process and technology roadmaps in support of long-term divisional strategies - Manage complex projects to major milestones. Develop project justification proposals, cases and return on investment estimates; obtain executive approval and funding - Develop and maintain key project governance documentation to ensure the proper amount of structure is applied to enable project success", "key_qualifications": "", "preferred_qualifications": "10 plus years of global supply chain management/execution experience across multiple industry sectors, with High Tech strongly preferred. Broad supply chain management/execution exposure with expertise in a specific area to include Logistics, Fulfilment, transportation, global trade compliance, procurement or Supply chain operations Deep understanding of Business enablement and setup in India (Customs, Export, transportation, Cross Dock Operations) Experience with boundary technologies that integrate with SAP/ERP to support/execute the business with external/internal partners including warehouse management systems. Experience working with external partners, including 3PLs/4PLs and distributors in implementing the data share requirements, IT systems and data pipelines to support the business Deep knowledge of Order to Cash, Omni-channel fulfillment, Distribution Centre and Shop Floor processes Proven track record of leading strategic projects combined with the ability to implement tactical project-level activities and tasks. Excellent communication across project and management teams. Adaptability and flexibility including ability to manage deadline pressure, ambiguity and change Excellent leadership skills that enhance project team effectiveness. Excellent organizational and documentation skills.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559410"}