{"title": "Graphics (GPU) RTL Design Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Join us to help deliver the next groundbreaking product containing an Apple designed GPU!\n\nAs a member of Apple’s GPU Shader Core team, you will develop power efficient, high-performance 3D graphics processor micro-architectures targeted for low power mobile devices and high-performance personal computers that are used by millions of people every day.", "description": "As a GPU Design Engineer, you will be responsible for delivering high-quality, low-power graphics IP that meets our performance, timing, and area goals. You will explore design trade-offs, while exercising rigorous design principles. Additionally, you will be required to understand and contribute to pioneering micro-architectural specifications in order to design best in class GPUs. To accomplish this, you will collaborate closely with multi-functional teams in architecture, validation, modeling, and physical design.", "key_qualifications": "Strong background in GPU, CPU, or SIMD architectures\nUnderstanding of GPU Schedulers, Execution Units, or Caches\nLogic design, including low-power techniques and timing optimizations\nAbility to drive bring up and debug of complex designs\nProficiency with synthesis tools, timing analysis, floor planning, and understanding of the PNR flow\nExperience in hardware performance analysis and debug\nProficiency in System Verilog HDL\nExperience with scripting languages such as Python, Ruby, or Perl\nAbility to work well in a team in order to be productive under aggressive product schedules", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of a B.S. degree and 3 years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545915"}