{"title": "Site Reliability Engineer - ASE", "summary": "People at Apple don’t just build products — they craft experiences our customers love and depend on. Apple Services Engineering (ASE) builds and supports the systems that make many of these daily experiences possible. If you’ve used Apple products, you’ve likely interacted with us. iCloud Services SRE teams are responsible for the systems and services that directly support our customers and their experiences. We are looking for passionate and talented Site Reliability Engineers to continue our focus on providing our customers the highest quality Apple Services experience. Our services have to scale globally, stay highly available, and \"just work.” If you love designing, engineering, and running systems and infrastructure that will help millions of customers, then this is the place for you!", "description": "Do you love engineering and running systems and infrastructure that will delight millions of customers? Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. When you bring passion and dedication to your job, and there's no telling what you could accomplish. Our best candidates have proven software development skills, strong distributed systems expertise, understand SRE principles, and know what it will take to run services at Apple scale. We play a critical role in the day-to-day operations of services that are relied upon across Apple. Our team leads the reliability engineering for iCloud Identity core services. IN THIS ROLE, YOU ARE EXPECTED TO DO 1. Lead data-driven roadmap, quarterly planning for a subset of core services from a reliability perspective 2. Be responsible for the subset of core services for the entire software lifecycle from a reliability perspective including infrastructure setup, capacity planning, deployment, monitoring, architecture, and software implementation by collaborating closely with the development team. We're looking for a creative, versatile, and passionate person who loves solving engineering problems and working broadly across a fast moving and collaborative organization. If this sounds compelling, please reach out!", "key_qualifications": "5+ years of software development or production operations experience in a large-scale environment\nAttention to detail, allergy to ambiguity, and a firm grip on deadlines\nSRE Principles - Skills and experience in monitoring, alerting, error budgets, fault analysis, and automation\nCoding experience using an object-oriented programming language like Java, Golang, or Python\nExcellent troubleshooting and problem solving skills\nExcellent written and verbal communication skills\nExperience in improving the whole lifecycle of global services from inception through deployment, operations, and refinement\nExperience with Linux/Unix, Networking, Systems Management, Systems Security\nExperience managing large numbers of diverse systems\nAbility to participate in on call service support", "preferred_qualifications": "Solid understanding and hands-on experience with Kubernetes and container orchestration’s implementation.\nExperience leading a team or projects from the scoping to the delivery\nBroad leadership and partnership skills\nExperience managing customer-facing internet scale systems\nExperience managing Distributed Systems / Large Scale Systems Operations\nEducation:   BSCS and/or equivalent 5 years of experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558990"}