{"title": "Cellular Systems Engineer - Power", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design and power optimization for wireless modems. As a member of systems engineering team working on cellular power, you will have the unique and rewarding opportunity to work on most exciting and ambitious problems related to power architecture and optimization. In our team, we have the mission to design and deliver most power efficient and optimized design for the wireless and cellular products. We are looking for expert and highly self-motivated system engineers to work on the most exciting problems related to cellular modem power optimization. In this role you will be working cross-functionally across many teams to drive the optimal power architecture starting with the product requirements all the way to commercialization. You will work on defining system level requirements, proposing innovative ideas, define power architecture, and perform power measurements driving the power optimizations to meet the product requirements.", "description": "-  Work closely with the product teams to drive cellular modem power requirements and analysis of system level use-cases for power optimized operation.\n-  Contribute to system design and power architecture in cellular modem. \n-  Study and analysis of post-Silicon power data and waveforms to identify potential optimization opportunities. \n-  Active participation in modem power measurement an optimization and work cross-functionally to drive the product to commercialization meeting the set power goals.", "key_qualifications": "", "preferred_qualifications": "Shown track-record of innovation and hands-on experience in working with pre-product silicon HW and power measurement setup.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556966"}