{"title": "Systems Performance Architect", "summary": "The people here at Apple don't just create products — they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Are you up for the challenge? Our System Performance and Architecture team is looking for an outstanding engineer to collaborate with Architects to guide ML performance analysis and modeling across Apple's products and investigate performance and power characteristics of new ML workloads. In this highly collaborative and cross-functional role, you will be at the center of multiple efforts to accelerate and optimize on-device machine learning. We are looking for someone that is familiar with Machine Learning and is passionate about identifying and optimizing performance bottlenecks. Experience with system-level performance spanning hardware (CPU, GPU, DRAM, storage), software (OS, drivers, applications), and other system characteristics (thermals, power, acoustics) is a plus. Come join us!", "description": "This role will entail: •Guiding architecture tradeoff decisions at an executive level •Interacting with various multi-functional teams to understand, model, and guide development. •Working with high level software features including 3rd party developers and ML inference stack. •Collecting the findings from investigations and collaborate with SoC, HW, and SW architecture teams to provide insight for future silicon and products. •Generating performance projections for future systems •Assisting in complex performance debug activities.", "key_qualifications": "Solid understanding and experience in computer architecture, Strong and proven software development and performance analysis skills, Understanding of machine learning fundamentals, Experience with performance on low-level software and computer architecture, Passion for software architecture, APIs and high-performance extensible software, Proficiency in C/C++ and Python, Strong communication and mentoring skills", "preferred_qualifications": "", "education_experience": "MS Degree or PhD in Electrical Engineering or Computer Science or equivalent years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540309"}