{"title": "Supplier Quality Engineer- Flex Assembly / FPCA", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "-  Act as project leader to oversee a variety of projects, interface with factories and manage on technical and quality.\n-  Collaborate with upstream and downstream on design, process, quality, specifications and issues.\n-  Plan, develop and implement technical procedures for FPCA manufacturing process and quality requirements.\n-  Provide early manufacturing involvement to ensure new products is manufacturable. Perform design, manufacturing process, quality review, identify design and manufacturing risks, provide design and process solutions during New Product Introduction (NPI) to mass production, and handle the implementations and qualification.\n-  Establish guidelines, Standard Operating Procedure &amp; Best Known Method for manufacturing process &amp; quality control.\n-  Manage NPI projects and build, improve quality and efficiency, to ensure seamless transition to mass production.", "key_qualifications": "", "preferred_qualifications": "Master Degree or MBA is a plus.\n5~10 years' experience of engineering, design, manufacturing, NPI, engineering program management, quality or supplier management in electronic industry, SMT /assembly experience and managerial experience.\nFamiliar with quality management methods like 6 sigma, reliability test, failure analysis methodology and etc.\nWork with multiple functional groups, shown strong leadership.\nPassionate &amp; highly independent individual, good discipline, responsible and trust worthy.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555178"}