{"title": "Camera Module Calibration & Test Engineer", "summary": "Are you passionate about changing the world? Come and join us! As a member of our multifaceted group, you will have the outstanding and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. Do you enjoy being involved in making products which always surprise and delight the world? Do you love tackling challenges that require creative solutions? You will be part of a team that sets the standard in encouraging excellence, creativity and innovation. Bring passion and dedication to your job and there's no telling what you could accomplish here.", "description": "Work with modules integrators (MIs) and their vendor to design, develop, review, manufacture camera calibration and test solutions, such as SFR test, VCM and OIS calibration, Open-short test, electrical noise or color calibrations. Work with MIs to validate and qualify test solutions on a regular basis. Participate in yield loss investigation and failure analysis for possible test related issues or improvement. Work with MIs to improve test system UPH, retest rates, and efficiency. Oversea regular test related activities at MIs.", "key_qualifications": "", "preferred_qualifications": "Measurement System Analysis (MSA) Knowledge is preferred. Being familiar with MATLAB/Python programming skills and data analysis experience using JMP is strongly desired. Strong problem solving ability and critical thinking. Possessing knowledge to review mechanical and electrical design for socket, fixtures and test systems as well as to tackle their related issues. Korean and Japanese language skill is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556174"}