{"title": "iPad Touch HW - Touch EE Engineer", "summary": "The Sensor Technology team develops cutting-edge sensor solutions and technologies that are central to Apple’s products. The key goal of the team is to enable the world’s best user-experience through state-of-the-art sensor solutions, such as the high-precision, low-latency multi-touch and stylus sensors in our products. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation.", "description": "Sensor technology scoping and proof-of-concept investigations. Support Product definition, Market Surveys, Competitive Analysis. Collaborate across the board, with different technology teams to evaluate the System design options & trade-offs. Cross-functional leadership, guidance and mentoring to engineers. Sensor & Module design and modeling. End-to-end application (sensor, signal processing, ASIC, algorithm configurations) definition and design. Oversee complete module design and execution, tracking various architectural and execution risks, schedule and inter-team collaboration. Review and/or define algorithms for various signal and noise conditioning requirements -Design, prototyping and integration of Sensor, (rigid / flexible) PCBs and ASIC application -Optimize design across multi-disciplinary boundaries (e.g., Mechanical, Materials, Process, FW/SW/ Algorithms, Cal /Test, Reliability, Operations). Failure mode analysis, root cause diagnosis, and system-level problem solving -Statistical data analysis and data mining. Design analysis, characterization, and validation. Business travel to support product development", "key_qualifications": "Strong logical thought process and analytical skill set. Ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactions. Electrical engineering background in analog and mixed-signal design, especially board-level circuits. Hands-on experience in system-level design. Excellent written and verbal communication skills and solid teamwork and leadership skills. Proficiency in FEA (Comsol, ANSYS, Maxwell) MATLAB, SPICE, or similar simulation and modeling tools", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540947"}