{"title": "Sr SW QA Engineer, Machine Learning", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming outstanding products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Creativity Apps QA team is seeking a Senior Software ML QA Engineer to help us ensure that our iOS and macOS creativity applications are high-quality. We’re looking for an engineer to take projects from initial data mining and research through all stages of prototyping, development and final integration into our Apps' clients. You will have the unique and rewarding opportunity to help shape upcoming products that will delight and inspire millions of Apple’s customers every day.", "description": "This position requires a self-motivated individual with strong technical, problem solving and communication skills, and the willingness to work in a sophisticated environment. Responsibilities include scripting, parsing data, and working closely with the annotation operations team. Analyzing annotations and test results to ensure the features work end-to-end for customers. Developing and implementing workflow projects, regression testing, and bug filing. You will work closely with other team members to develop requirements, identify appropriate testing implementations processes, and methodologies. You should be able to be comfortable with ambiguity and make educated, critical judgments. You must be effective and systematic at managing priorities, and communicating progress as well as risk through regular status updates. Have a proven ability to ramp up quickly on both existing and new technologies.", "key_qualifications": "A minimum of 5 or more years in quality assurance and/or quality engineering with a prior focus in Machine Learning. Strong comprehension of machine learning algorithms, supervised and unsupervised modeling techniques. Understand of the mechanics of machine learning, deep learning, computer vision, natural language processing, and generative AI. Preparing and collecting data for evaluation and ensuring data quality. Proficient in Python and/or Swift or comparable languages. Preferred understanding of photography, video, and in-depth knowledge of image processing algorithms and related statistical metrics. Understanding of subjective/objective image and video quality evaluation, and color science concepts is a strong plus. Understanding of SQA methodologies and practices, software engineering experience preferred. Meticulous, analytical, methodical and creative problem solving ability with a commitment to driving quality forward. Inquisitive with the ability to investigate and debug difficult problems. Comfortable and adaptable in a fast-paced, dynamic environment. Prototyping and tools development is not required but nice to have. iOS and macOS familiarity is not required but nice to have.", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or an equivalent of 5 years experience focused in machine learning is required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550313"}