{"title": "Engineering Project Manager, Business Technology Solutions (BTS)", "summary": "The Business Technology Solutions (BTS) team champions and executes technology-enabled business solutions that have material top-line and bottom-line impact to Apple. BTS participates in all elements of the product or program development life cycle, and is fundamental to the launch of revenue generating programs, implementation of cost efficiencies, support of sustainable strategies and establishment of scalable technologies.", "description": "The BTS Engineering Project Manager will be responsible for: Aligning cross-functional business/technical partners Clarification of business requirements and use cases Defining & documenting solutions, options and approaches in partnership with engineers Project & schedule management, as well as status updates Detailed Responsibilities: Represent BTS in cross-functional forums throughout product development life cycle to clarify requirements, influence solution design, resolve conflicts, set expectations & align on deliverables Partner with engineers to understand potential solutions, define options and document decisions, solutions and process flows Prioritize initiatives via quantitative and qualitative metrics Stitch across partner teams on (re)iteration of scope, LOEs, project milestones and deliverables Communicate and adjust timelines internally; resource work to ensure successful deployments Identify and execute on process optimization opportunities (internal and with partners) to ensure engineering resources are focused and protected Create and maintain management system to enable visibility and prioritization around future work, ensuring clear alignment with Capital projects and company priorities Define and execute on strategy for updating, sharing and exposing documentation created", "key_qualifications": "8-10 years of Program or Project Management, Operations, Supply Chain, Process Flow Design & Documentation, Analytical, methodical, metric- and process-driven, Detail obsessed, highly organized, able to keep accurate documentation at all times, Thrives in ambiguous work environments with initiative & ability to unblock him/herself, Curious with aptitude to learn new things, Has tenacity to dig deeper to get to the heart of the issue, Excellent written, verbal communication and presentation skills, Proclivity to work well under pressure; prioritizes work efficiently and with urgency, Ability to gain alignment from business/technical teams and influence cross-functionally", "preferred_qualifications": "", "education_experience": "BS degree in engineering preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $195,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538178"}