{"title": "SE-Pro", "summary": "Som Pro är du vår mest kunniga säljare. Du förstår hur Apples produkter och tjänster kan underlätta för kunderna att utforska sina intressen och se hur våra produkter skiljer sig från konkurrenternas. Du bidrar till att utveckla Apples företagsnätverk och är väldigt bra på att presentera eleganta lösningar som förenklar det som är komplicerat. Du använder din breda expertkunskap om teknikbranschen, inklusive Apples konkurrenter, för att ta fram unika och värdefulla erbjudanden som visar hur Apples lösningar skiljer sig från andra på marknaden. Du ger vägledande rekommendationer om Apples produkter och tjänster som skapar lojalitet och förbättrar kundupplevelsen och bidrar till ökade färdigheter och teknikkunskaper i hela teamet.", "description": "Ökar försäljningen genom att ta fram kompletta lösningar  från Apple – med produkter och tjänster från både Apple och våra externa leverantörer. Visar och tipsar kunderna om hur de kan integrera tekniken i sina hem och skräddarsyr lösningar för små och medelstora företag samt utbildningsinstitutioner. Utnyttjar sin passion för teknik i syfte att bli den som alla i butiken kan vända sig till med frågor om hårdvara, mjukvara och tjänster. Leder och assisterar vid presentationer. Ger rekommendationer om driftsättning och uppstart och upptäcker om det krävs mer stöd. Upptäcker nya trender inom såväl teknik som bland kunder och tar reda på hur teamet kan använda dessa kunskaper för att utveckla nya säljmöjligheter. Håller sig uppdaterad om teknikbranschen och vertikala makrorörelser för att kunna förutse hur tekniken kan användas. Håller koll på konkurrenternas erbjudanden och nya produkter inom hela teknikbranschen. Är en förebild och mentor för andra i Product Zone – med sin unika produktkännedom, sitt branschkunnande och sina säljtekniker, samt sina kunskaper om köpalternativ, inklusive finansiering och operatörsabonnemang. Tipsar kollegorna i Product Zone och hela butiksteamet om goda exempel när det gäller försäljning och att bygga kundlojalitet. Har ett nära samarbete med butiksledningen, Global Retail Support och kollegor inom regionen. Håller sig uppdaterad om Apples alla produkter och tjänster (i butiken och online), vårt ekosystem och produkter från andra tillverkare, för att kunna erbjuda kompletta lösningar. Är tidigt ute med att använda och förespråkar nya produkter, tjänster och initiativ inom företaget. Bidrar till framgång inom alla områden i butiken och tillgodoser på ett flexibelt sätt verksamhetens behov. Går på eget initiativ fram till och pratar med kunder för att förstå deras behov och presentera kompletta lösningar för alla kunder, både i butiken och online. Visar potentialen med Apples produkter, tjänster och ekosystem med hjälp av demonstrationer, genom att anpassa sig efter kunderna och svara på kundernas frågor. Skapar minnesvärda upplevelser som visar fördelarna med Apples produkter och tjänster. Erbjuder anpassade lösningar utifrån varje kunds specifika behov, såsom företagare, pedagoger och personer med kreativa yrken. Ställer in kundernas nya Apple-produkter och erbjuder personlig anpassning. Ger råd om felsökning och berättar om fördelarna med att handla hos Apple – ofta för flera kunder samtidigt. Tillgodoser kundernas behov med hjälp av kunskaper om Apples teknik, teknisk expertis och kreativitet. Håller sig uppdaterad om ny information, utbudet av produkter och tjänster samt företagsinitiativ med hjälp av interna verktyg och resurser, kollegor och erfarenheter på jobbet. Finns där för kollegorna i Genius Bar när det behövs genom att dela med sig av sina kunskaper och berätta om ägaralternativ. Erbjuder kundservice i världsklass. Utför alla arbetsuppgifter och transaktioner med stor noggrannhet.", "key_qualifications": "", "preferred_qualifications": "Har under långa perioder nått toppresultat inom försäljning och kundupplevelse. Kan det mesta om Apples produkter och tjänster i butiken och online samt om tredjepartslösningar inom olika branscher och områden – kunskaper till nytta i kontakt med enskilda personer, företag, kreatörer och vid utbildning. Kännedom om företagslösningar och branschtrender. Du har en förmåga att kommunicera och samarbeta effektivt med företagare och höga chefer. Du tar egna initiativ, kan uppnå individuella mål och skapar samtidigt framgång för hela teamet. Du har en förmåga att samarbeta över rollgränserna i butiken och med viktiga samarbetspartner. Du är van vid att använda ett CRM-verktyg. Du har suverän social kompetens och förmåga att bemöta kunder. Du är resultatinriktad och handlingsfokuserad. Du kan bemöta kunders funderingar med fattning, behärskar förmågan att lyssna och är duktig på presentationsteknik. Du är bra på att samtidigt hjälpa flera kunder med olika behov. Du har en lysande tidshantering och simultanförmåga. Du är nyfiken, tar reda på information och delar den med resten av teamet. Du har bra samarbetsförmåga, social kompetens och förmåga att bemöta kunder. Du är flexibel i arbetet och van vid att göra flera saker samtidigt. Du har en förmåga att prioritera arbetsuppgifter på ett effektivt sätt. Du kan ta emot feedback och ge feedback till andra.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535007"}