{"title": "Financial Analyst, R&D Finance", "summary": "As a part of Apple’s R&D Finance team you will partner with Apple’s engineering teams to plan, analyze, and manage the finances for some of the world’s most innovative engineering development projects. Apple continually strives to develop exciting new technologies and products that enrich our customers’ lives — this is an opportunity to be a part of that mission. You will prepare, track and evaluate performance metrics, business analyses and financial analyses in addition to forecasting, reporting, and providing best-in-class business support to our Engineering organization. We are looking for a finance professional who is proactive, strives for excellence, and is excited to be a part of the future of Apple!", "description": "- Partner with Engineering teams to compile periodic spending forecast updates.  \n- Drive Quarterly close/accrual process for HW Technology teams.  \n- Support Annual Operating Plan process.  \n- Maintain data integrity and accuracy in our financial systems for key data sets such as cost centers, project codes and signature authority limits.  \n- Educate and enforce Accounting/Finance Policies across the Engineering organization.  \n- Review Purchase Requisitions to validate budget impact and accounting compliance.  \n- Ad Hoc financial analysis to support product/roadmap decisions.", "key_qualifications": "", "preferred_qualifications": "3+ years of professional work experience in Finance/Accounting with exposure to financial processes related to close, forecast and annual operating plan cycles.\nUndergraduate degree in Finance, Accounting or Economics Required; CPA preferred.\nCrisp verbal and written professional interpersonal skills; ability to compile and present data to senior leadership.\nStrong financial systems and business application skills including SAP, Essbase, Excel, Keynote, Filemaker, Workday/Adaptive & Tableau\nCuriosity and willingness to learn about technology through the lens of finance.\nStrong analytical skills and ability to work within ambiguity\nAbility to manage multiple programs or projects at once and to self-direct efforts as appropriate among competing priorities\nWork well with others in a team setting and independently", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\n...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557665"}