{"title": "Senior Wireless RF PHY FW Engineer", "summary": "Would you like to join Apple’s growing Wireless Connectivity Silicon team? Our wireless System on a Chip (SoC) organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. In this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers. Responsible for crafting and implementing embedded firmware for SoC bring up and wireless connectivity enablement. You will work closely with product software and manufacturing teams to enable RF and PHY calibrations, algorithms and testing to enable productization of the silicon / system.", "description": "-As an Embedded FW Engineer, the individual will be a core member of a Wireless SoC firmware team, with emphasis on radio and PHY bring up, RF calibrations, signal processing algorithm implementation and performance tuning. -Work closely with product SW and manufacturing teams to provide system-level API and firmware functionality to meet productization needs. Develop SoC test and calibration capabilities for wafer, module, and system factories. -Collaborate with RF/Radio design, DVT, PHY and System engineering teams to architect, define and implement innovative algorithms, calibrations, and protocols. -Debug realtime systems with limited visibility, working hands-on with development boards and lab equipment. -Support pre-silicon validation efforts, including simulation, emulation, and FPGA prototyping. -Support post-silicon bringup, validation, performance characterization, system integration, and debug.", "key_qualifications": "Strong background in embedded FW development using C and assembly languages, familiarity with ARM CPUs and its internals. Good understanding of embedded wireless communication systems, Radio and PHY fundamentals and key RF performance metrics. Familiarity with digital signal processing algorithms. Experience with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock, and power management. Solid understanding of basic embedded concepts such as RTOS, concurrency, multi-processor systems. Fluency in using lab equipment such as logic analyzers, oscilloscopes, network analyzers, spectrum analyzers, signal generators, power meters etc. Experience implementing diagnostics, manufacturing tests, and protocol compliance software. Knowledgeable of industry standards for wireless communications such as Bluetooth, WLAN, Zigbee, UWB is a plus. Comfortable with at least one of the scripting languages such as Python, Perl, or Tcl. Excellent communication skills – both written and oral.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience. MSEE and PhD are preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200521441"}