{"title": "AIML - Senior Software Engineer, Siri and Information Intelligence", "summary": "Would you like to play a part in shipping groundbreaking technology for large scale systems, natural language, and artificial intelligence? You will be providing the foundations by building, maintaining, and developing frameworks to make Siri and other AIML related products more testable for existing and new features, integrating products and frameworks that can interact with, proposing new innovative, challenging and scalable solutions to support our automation infrastructure across multiple multi-functional teams that help drive the sustainability and quality of AIML products.", "description": "The Machine Learning Systems and Evaluation Engineering (MLSEE) team is developing frameworks and tools for making Siri and other AIML related products more testable across all the OS stack. As a result, we need to keep a continuous development of our tools and frameworks that guarantee the testability and scalability of Siri and AIML products for automation. The role is to design architectures that help integrate keeping the pace on a very dynamical environment, build all vital APIs, frameworks and libraries so that Development and Evaluation teams can benefit from it for writing their tests, support features and evaluate them. Ensure the scalability and sustainability of the framework to solve new challenging problems that currently exist and that will come as the continuous growth and support of Apple features and products.", "key_qualifications": "6+ years as Software Development Engineer. 4+ years of Designing and Architecting tools and frameworks. Experienced in Machine Learning. Excellent leadership in driving the development of tools and frameworks driven towards excellence in quality. Shown problem-solving and debugging skills: analyze and investigate test failures, errors, and build issues, able to accurately drive issues to completion and support issues with data. Excellent verbal and written communications skills.", "preferred_qualifications": "", "education_experience": "BS or MS Degree in Computer Science or equivalent work experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple’s benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551095"}