{"title": "Power Integrity Engineer - Apple Mac", "summary": "Apple is seeking an enthusiastic electrical engineer for the Mac Engineering Team. As a part of the Mac team, you will help with concept and feature development, rapid prototyping, The Mac organization is looking for an outstanding engineer to support the system-level Power Distribution Network (PDN) design, analysis, and validation aspects of Mac and Accessory products development! You should have deep knowledge and familiarity with power delivery network design, analysis, and validation methods. You will work with multi-functional teams design and implement a power supply network solution, develop and validate impedance and droop targets and verify the quality of the power supply using lab and in-situ silicon measurements.", "description": "The role involves pathfinding studies in silicon development phase where feedback is provided to silicon and packaging team on system integration tradeoffs. Ability to complete target impedance analysis, transient voltage droop and phase margin/stability analysis is required. The candidate is expected to work closely with System Design teams to provide detailed layout strategy and guidelines during design execution phase. The candidate is also expected to work with HW Validation teams to develop test-suites to perform system-level validation for evaluation of design margins on the power domains. The roll includes the PI support through the specific project design process which can include system pathfinding and verification stages, and characterization reviews with continuing guidance through production and ramp.", "key_qualifications": "empty string", "preferred_qualifications": "PhD (preferred) with minimum 3 - 4 years experience\nDeep Experience in CPM (Chip-Power-Model) usage for system transient analysis is an added benefit\nExperience with Perl, Python or other scripting languages is desired. MATLAB Experience is a plus.\nExcellent documentation and communication skills, ability to work independently, a desire to mentor, and demonstrated ability to innovate are required\nCandidate is expected to have demonstrated experience in driving initiatives that improved process, procedures, and result quality.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552996"}