{"title": "Lead Machine Learning Engineer, Frontier AI Technologies", "summary": "We’re looking for industry-leading machine learning technologists to help shape the future of AI-driven system experiences across the Apple ecosystem. You’ll be joining a small, dynamic team that will develop novel ML techniques and applications, build tools and infrastructure, rapidly iterate on prototypes, and deliver new product experiences. This is an exciting time to join and have impact across Apple’s entire product portfolio. You will be working alongside highly accomplished and deeply technical scientists and engineers to advance the state of the art in AI-driven products. If you’re a leader in the field of machine learning, we’d love to talk to you.", "description": "Our team is seeking extraordinary machine learning engineers who are passionate about creating machine learning driven user experiences. Work includes designing high-performance machine learning models and infrastructure in concert with designers, software/hardware engineers, and applied R&D teams.", "key_qualifications": "5+ years industry experience as a Machine Learning Engineer or Software Engineer, working on advancing the state of the art of machine learning, and deploying large-scale distributed systems. Strong understanding in ML, deep learning, natural language understanding, distributed systems, reliability, and cloud services. Strong hands-on experience in building large scale ML based solutions or in building and scaling distributed systems. Ability to efficiently develop, debug and support new technologies in a changing environment. Positive and respectful attitude in a diverse environment.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541460"}