{"title": "Python Software Development Engineer - Apps Services", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Our team runs the CI/CD pipeline for Apple's applications which supports thousands of developers around the globe. We are passionate about continuously improving the way we enable the software development lifecycle and push the envelope to reimagine cutting edge solutions to engineering problems of scale. As a member of the team, you would develop applications and micro-services to build and improve our next generation CI/CD pipeline.", "description": "Develop and maintain CI/CD pipeline, services and integrations for Application development teams. Collaborate across teams to improve build, integration & release process. Develop and maintain services and integrations for Apps Services CI/CD pipeline. Maintain and administrate dynamic Linux/macOS build farm.", "key_qualifications": " ", "preferred_qualifications": "B.S. in Computer Science or equivalent. Experience developing Python based micro-services using Django/Flask. Experience with GitHub development workflow. Experience with Jenkins administration and scaling. Experience scaling CI/CD systems and micro-services. Experience with Xcode and Swift.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554783"}