{"title": "SWE - Full Stack Software Engineer - CoreOS", "summary": "The Platform Services & Operations team in Core OS is looking for a Full Stack Software Development Engineer to lead the architecture and development of essential workflow tooling at scale. The Workflow Engineering team enable teams to deliver high quality software through best in class engineering experiences, efficient workflow, data driven insights, and a culture of continuous improvement. Your focus is building a services platform that enables visualization of data across the organization in user intuitive and configurable formats.", "description": "You are passionate about software engineering and web development You are effective at implementing acceptance criteria requirements You are an advocate for continuous improvement culture and DevOps concepts in software engineering You have extensive experience architecting solutions for scalability and testability You are excited when leading engineering discussions and demonstrating your achievements If this is you, we'd love to hear from you!", "key_qualifications": "5+ years’ of professional experience in full stack software development\nIn Depth knowledge of Node.js\nApplicable knowledge of web libraries and frameworks like AngularJS, React, Express\nDevelopment experience designing object oriented JavaScript.\nExtensive experience working with PostGres or other SQL databases.\nFamiliarity with web client, server optimization techniques\nExtensive experience with RESTful API", "preferred_qualifications": "", "education_experience": "-  B.Sc. in Computer Science or equivalent experience", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552509"}