{"title": "Mixed-Signal Behavioral Modeling Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Modeling Engineer. If you are early in your journey towards a chip design career and wish to challenge yourself in a technical and multi-disciplinary effort, we have an exciting position for you in the extraordinary Apple mixed-signal silicon design team. This position will encourage building of a validated foundation in logic circuits and gentle entry into understanding analog circuits. You will gain transparency into a variety of flows fundamental to modern silicon engineering: insight into full custom schematics for analog as well as high-speed digital circuits, translating functionality of such circuits into an efficient software behavioral representation, simulation of such code and ensuring formal equivalence between custom designs and their abstract representation. You will gain experience and knowledge into software methods and analysis that is increasingly significant for a variety of fields.", "description": "In this job you will be responsible for translating custom mixed-signal circuit schematics into efficient SystemVerilog behavioral models for higher level simulations. You will have to closely interact with circuit design teams to understand fine details of custom circuits, and with DV teams to craft hooks for effective verification. You will have to run various simulations and equivalence checks to ensure that the model matches closely with the custom circuits. You will have to handle the quality of such models for production worthiness across projects. You will have to write scripts and simple tools for automating repetitive tasks or performing calculations.", "key_qualifications": "", "preferred_qualifications": "Excellent knowledge of digital logic gates, clocking and state elements\nExcellent knowledge of Verilog/SystemVerilog with ability to write behavioral code\nSolid understanding of logic simulations\nSome understanding of SPICE circuit simulations understanding of synthesis and timing of digital logic\nBasic knowledge of reading device level schematics for circuits such as logic gates\nFamiliarity of writing scripts in PERL/Python and basic algorithms is a strong plus\nFamiliarity with blocks such as PLLs/DLLs/SERDES is a strong plus\nKnowledge of digital signal processing and numerical concepts is a plus\nKnowledge of probability and statistical concepts is a plus", "education_experience": "BS degree in technical discipline.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555643"}