{"title": "SFDC Senior Finance Analyst, WW Sales Finance", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Are you a strategic thinker who excels at tactical execution? Do you love to solve problems and have a passion for analytics? We are looking for an experienced professional with high analytical capacity and strong interpersonal skills to join the WW Sales Finance team. You will be responsible for managing worldwide channel margin structures & will be the subject matter expert for all back margin programs. You will lead the SFDC project providing key business requirements for implementing back margin programs/processes in the Salesforce tool and support the channel terms process. You must work cross functionally across Sales Finance, Sales, Sales BPR, GBS BPR, WW Product Marketing Finance & Geo teams", "description": "The ideal candidate is a top performer with a proven track record of accomplishments. In joining the fast-paced, growth environment of WW Sales Finance, the candidate is expected to quickly become as key contributor with a high degree of ownership, presenting the channel margin analysis to leadership on a regular basis. As subject matter expert for channel pricing & back margin programs globally, the candidate will take the lead in understanding local programs and processes to ensure the right solution is built in the salesforce platform. Partner with Sales BPR, GBS BPR & global teams and colleagues across geographies to develop requirements and implement system solution for back margin programs. It is important that you can think strategically, connecting the dots in the bigger picture, as well as being comfortable in the details of the deliverables Identify solutions beyond what has been requested by our business partners. Negotiate with cross-functional teams and business partners to remove barriers and get results, without compromising the overall quality of end deliverables. Work with Sales BPR to prepare the business for change, ensuring that there is the necessary change management plan in place so the business is ready to take on adjustments to people, process, and technology. Set success criteria for your initiatives that are clearly measurable and achievable through the scope of deliverables, then ongoing tracking against this criteria.", "key_qualifications": "5+ years of finance experience, Knowledge of reseller pricing and back margin, Experience working with reporting structures & data analytics and dashboards, Working knowledge of excel and tableau, Strong communication and presentation skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners, Experience collaborating on cross-functional, complex projects in a matrixed, fast-paced environment, Ability to think strategically to see the big picture while working with ambiguity and uncertainty, Be an intellectually curious self-starter with a desire to find creative and innovative solutions to issues at hand, Ability to work autonomously while completing a variety of complex, non-standardized tasks with an acute attention to detail, Strong prioritization skills with ability to manage multiple projects", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Finance or equivalent", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551182"}