{"title": "Solutions Engineer - Payments and Reconciliation", "summary": "Apple’s Employee Experience and Productivity group is looking for a Functional Engineer in Hyderabad, India to lead Revenue and Reconciliation projects.", "description": "The Corporate Systems group at Apple focuses on creative ways to engineer business solutions to meet the growing needs of Apple Finance, iTunes, App Store, Sales, Retail, Apple Care, and Apple Online. Our portfolio comprises engineered custom solutions to process very high-volume micro-transactions from iTunes and App Store Downloads, iPhone Activations, Sales from Retail/Online, Resellers, etc. These solutions are based on ground breaking enterprise technologies ranging from Server Side Java, Web Technologies, Oracle, and No-SQL Databases.", "key_qualifications": "At least 3 years experience in Software Development. Assess product capabilities for requirements, and configure them for various payment projects. Strong communication skills and ability to propose design, seek feedback, and iterate with business. Basic coding skills and/or Fundamental knowledge in languages like Java, C#. Hands on experience with scripting languages like bash or python. An eye for detail to accurately assess business requirements. Exposure to building technical solutions that are fast-paced and critical to business. Dealing with ambiguity. Embrace work with a sense of urgency and the ability to adapt to resetting priorities depending on business demands. Must be able to brainstorm and communicate technology ideas and issues with peers and IT management. Familiarity with database querying and databases. Knowledge of noSQL like Mongo db is a bonus. Hands-on Implementation or integration experience. Understanding of distributed systems.", "preferred_qualifications": "", "education_experience": "BS/MS Computer Science or Equivalent.", "additional_requirements": "-  Background in Payments and Finance is desired -  Prior experience in reconciliation products is a plus", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536691"}