{"title": "Senior CoreMedia Format Engineer", "summary": "The Audio and Media Technologies Group (AMT) provides the media foundation across all of Apple’s innovative products. The CoreMedia engineering team within AMT is responsible for implementing software services around linear audiovisual media. This includes local media playback, video-on-demand and live streaming of multimedia content.", "description": "We are looking for an engineer who has passion for solving end-to-end system design problems in media workflows which have implications on the media file formats (e.g. QuickTime Movie, MPEG-4). The role requires the commitment to not only propose solutions but also help with the implementation - specifically in the area of format reading, processing and format writing.", "key_qualifications": "Understanding of multimedia file formats (QuickTime Movie, MPEG-4, MPEG-TS, etc.), Proven ability to propose and develop enhancements to a multimedia format specification while considering the impact on the larger ecosystem (production, delivery and playback), Experience with video, audio, captions/subtitles and/or metadata container-level carriage technologies and standards, 5+ yrs of experience working as part of a software development team in C/C++ and understanding of real-time multithreaded programming systems", "preferred_qualifications": "", "education_experience": "Master's degree in Computer Science/Engineering, or equivalent.", "additional_requirements": "Nice to have but not required: Experienced in key multimedia specifications from ISO, ITU, SMPTE, etc., Familiarity with video and audio compression technologies, Seasoned at media pipeline problem solving and debugging skills, Experience using the CoreFoundation, AVFoundation and/or CoreMedia frameworks or equivalent technologies is a plus", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200504492"}