{"title": "RFIC Test Engineer", "summary": "The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our transceivers have powered wireless connectivity solutions for Apple wearable products, enabling the smallest form factor at the lowest power envelope. You will have the opportunity to do innovative development in transceiver design while working closely with systems and product teams at Apple. In this role, you will be part of an RFIC design team and perform test, debug and measurement for RF SOC IP. Would you like to join us and become part of this dynamic team?", "description": "- Run bench test and debug of RF SoC IP including transmitters, receivers, PLL, power amplifiers, ADC/DAC, crystal oscillators, and PMU. - Debug chip level or board level desense and EMI issues. - Write scripts using a build up environment in order to automate measurements. - Perform RF system characterization measuring EVM, spectral mask, phase noise, sensitivity, and other radio parameters. - Design external matching networks to optimize Tx/Rx radio performance. - Generate RF design/verification/test report. - Collaborate with RF systems and integration teams on RF board layout, test interface methodology and programming sequence, and RF calibration programming. - Synchronize radio register settings between simulation environment and test environment.", "key_qualifications": "", "preferred_qualifications": "Experience in RF test development, debug, and reporting. Scripting and debugging knowledge in any of the following: Python, Perl, TCL, C++, or equivalent. Working knowledge of RF test equipment (network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.) Strong RF background and familiarity with RF systems fundamentals. Good knowledge on RF, PLL, and general wireless systems measurements (i.e. IP3, NF, ACPR, phase noise, lock time, etc.) Some experience of RF PCB board design, debug, and development. Exposure to RFIC design and simulation/verification.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555776"}