{"title": "Applied Scientist - WWBPR Advanced Analytics", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The Worldwide Sales and Operations Advanced Analytics team is looking for an experienced Applied Scientist with deep passion for analytical solutions that have direct and measurable impact to Apple and its customers. At Apple, the increasing supply chain complexity and scale presents unique challenges to traditional analytics techniques. You will be part of a team of experts responsible for designing and developing advanced analytics models for strategic and tactical decision-making.", "description": "• Experience understanding key performance levers and metrics to highlight operational issues and drive improvement. Proven history of designing and developing in-depth analytical solutions • Expert knowledge and practical experience in building and communicating results of forecasting models. • Strong sense of levers impacting forecast accuracy and ability to gain trust with stakeholders  • Practical experience solving real world problems and understanding of predictive modeling and algorithms for classification, regression, clustering, and anomaly detection • Innate curiosity and bias for action with expert ability to identify, define and execute project plans and develop modeling approaches suitable for the problem • Self-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity. Strong critical thinking and problem solving ability  • Sound communication skills - adept at messaging domain and technical content, at a level appropriate for the audience. • Phenomenal team player - invested in the collective success of the team and project outcomes • Experience with data acquisition tools (e.g. SQL), data mining and data visualization. Familiarity with big data technologies eg: Hadoop, Spark, Hive. Strong background in machine learning libraries and frameworks such as Scikit Learn, TensorFlow, PyTorch • Familiarity with optimization algorithms and tools (Gurobi/ Cplex/ Xpress) is a plus • Experience prototyping, developing software and implementing data science pipelines and applications in programming languages (Python/Java/C++)", "key_qualifications": "Engage with business teams to identify opportunities, understand requirements, translate those requirements into technical solutions and drive critical projects Design data science approach, applying tried-and-true techniques or developing custom algorithms as needed by the business problem Collaborate with data engineers and infrastructure partners to implement robust solutions and operationalize models. Enhance and evolve solutions to meet changing business needs with agility. Work collaboratively across teams Communicate results of analyses and models to partners and senior leaders Research new technologies and methods across data science, data engineering, and data visualization to improve the technical capabilities of the team", "preferred_qualifications": "", "education_experience": "PhD in Computer Science, Statistics, Applied Math or a related field and 5+ years of industry experience OR MS in related field with 7+ years hands on industry experience  Experience in building forecasting models and implementing them in production is highly desired", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528394"}