{"title": "Advanced Battery Management System Engineering Program Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services & customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here...", "description": "Develop project plans, lead, track and report progress to plan and drive solutions to address any/all identified gaps. Identify and prioritize project tasks and risks, drive engineering discussions and decisions on critical system parameters. Drive day-to-day activities to meet overall project objectives. Identify and engage multi-functional partners for project definition decisions. Develop and drive multi-functional validation plan for new Si and FW design. Drive FW bug review and leads development sprint. Communicate status and big picture to the project team and executive...", "key_qualifications": "Industry experience (preferable Battery or Consumer Electronics) of taking Si technologies from concept definition to mass production. Understanding of BMS advantageous. Technical project management experience in EE, Battery Management Unit, Modeling and / or Software. Technical Degree in EE required, experience in embedded SW is an advantage. Knowledge of Battery performance estimation and health, and Battery to Platform interaction desired. Experience in developing models with large data sets and test tools. Experience with battery charging algorithm and protocols...", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3+ years of relevant industry experience is required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550911"}