{"title": "Quality/Automation Engineer, Retail Engineering", "summary": "The Apple Online Store Quality Engineering team is looking for a motivated and talented engineer to join our team. To be successful, you must be a strong programmer, proficient at thoroughly testing applications and build test automation tools, and helping improve team velocity through automation. We are looking for a creative and passionate automation engineer with excellent problem solving and communication skills. As part of Quality Engineering team, you will be tasked with continuous quality analysis and you will be responsible for identifying automation opportunities, defining the test approach, and finally implementing a robust solution that has a sound architecture to ensure that deliverables are of the highest standard.", "description": "In this role, you will be involved in Quality Assurance for critical customer facing applications. Provide functional and integration quality-assurance testing for features at black-box testing tools. Build Quality test plans and cases, automation suites and reduction of regression test cycle take Quality to next level by using ML and AI in automation. Work closely with multi-functional organizations, project teams and clients to develop test plans, execute test plans and cases, and deliver high quality products. Act as a strong advocate for quality in the software development process. Identify gaps or inefficiencies in workflows and suggest vital process improvements. Self-motivated, able to grasp issues quickly and make educated, critical judgment in the absence of complete requirements. Provide Project Managers with timely and accurate testing status and progress during all testing phases, including summarizing Quality results at project conclusion. Able to multi-task in a multifaceted, fast-paced environment in Agile method. Create Test plan, develop manual/automated multi-functional tests, report bugs, and assess overall product quality of frameworks across Apple's existing and new products. Work with Agile team ensuring high quality delivery for each sprint and confirming to user story acceptance criteria. Provide leadership in testing, solving, and implementing features through automation. Work closely with engineers, project managers, and x-functional teams throughout software lifecycle in successfully delivering quality across projects. Communicate detailed QA status to the team and report any critical issues in a timely manner. Ability to analyze crash logs, back-traces, and assist Engineers by applying debugging techniques. We seek a self-motivated, hands-on, multifaceted, and detail-oriented individual with a strong technical background and proven hands-on experience in the relevant field. As the ideal candidate, you must demonstrate the ability to take ownership of outcomes and collaborate effectively with multi-functional teams to coordinate testing efforts seamlessly. We're looking for a hardworking and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you.", "key_qualifications": "", "preferred_qualifications": "5+ years of combined work experience in Software Development/Quality Engineering with Testing experience (White box + Black box, Automation Infrastructure development, functional, performance, stress testing). Solid understanding of development lifecycles, testing methodologies, and QA processes. Experienced in developing test plans, building tools and test frameworks. JUnit, TestNg. Computer Science fundamentals and experience in object-oriented design, data structures, and algorithms. Test experience in Java, SQL, Unix, Scala, NoSQL, and Web Services (Rest & SOAP) environments. Programming experience with automation scripting/tools/tests harness (e.g. Selenium, Cucumber, Karate, RestAssured). Solid understanding of software build tools and CI/CD integrations. Ability to investigate, debug and triage difficult problems both independently and collaboratively. Highly organized, creative, motivated, and passionate about achieving results.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555477"}