{"title": "SWE- Automation Framework Engineer, WTE", "summary": "Join our Wireless Technologies and Ecosystems (WTE) org and drive innovation that matters! We create and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. If you’re passionate about quality and innovation, we may have the job for you. The Wireless Frameworks and Services team is looking for a highly motivated and talented Software Engineer to help develop and maintain automation across all Apple platforms. (i.e Apple Watch, Apple TV, AirPods, iOS and macOS) The candidate should have excellent problem solving and communication skills.", "description": "Our team creates frameworks, services and testing tools to aid in Wireless testing across all Apple platforms. We also contribute code to core operating system frameworks, maintain/develop shared python frameworks and modules. Responsibilities: Design and implement new classes and tools to aid in the development of our newest triage framework and tooling issues as reported by our clients. Maintain existing python tools and libraries. At Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "", "preferred_qualifications": "Experience with Machine Learning (ML) and/or Artificial Intelligence (AI), Familiarity with any of the Wireless Technologies like WiFi/BT/HomeKit/GPS or Cellular Experience working across full-stack (Framework to Daemon level), Industry experience in testing of wireless silicon within wireless communication systems. Development experience with Objective-C and/or Swift", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558636"}