{"title": "Infrastructure and Data Solutions Engineer", "summary": "Imagine what you could do here. At Apple, new insights can become phenomenal products, services, and customer experiences very quickly. This position involves a wide variety of skills in development & implementation such as production networking, machine learning applications, test software platforms, and data integration. It is an opportunity to work on running applications and services that support Apple’s manufacturing for uninterrupted mass production which are essential to the success of upcoming product launches. We are looking for a hardworking individual who can excel in a multifaceted environment, be a self-starter, and bring their passion to ensure the quality and reliability of the solutions we deliver.", "description": "As a member of Infrastructure and Data Solutions Engineer, you will be collaborating with teams across Apple to build and deploy a variety of production applications that help to build the future of our smart manufacturing systems. On top of that, you will be providing support in infrastructure incident management as well as driving long-term resolutions. Review infrastructure and application related to product testing for optimization - Identify performance bottlenecks and work closely with the application and network teams to drive resolution。", "key_qualifications": "-  Proven skillsets in architecting data including data pipelining, data planning, data integrity, and data analytics\n-  Solid understanding of network infrastructure, databases, telemetry, container, and cloud technologies.\n-  Experience in the development & implementation of machine learning solutions.\n-  Software development skills in one or more general-purpose languages such as Python, C/C++, or Swift, and adhering to the best coding practices will be an added advantage.\n-  Experience in tools (application-based, web-based, or tableau) development is helpful\n-  Good understanding of product testing. Understanding test sampling solutions\n-  Good communication and teamwork skills.\n-  Excellent written and oral communication skills, proficient in English.\n-  Minimum 5 years of proven experience in related areas.", "preferred_qualifications": "", "education_experience": "BS, MS, or Ph.D. in Computer Science, Human Machine Interface Design, Human Computer Interaction, or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200520382"}