{"title": "Senior Software Engineer, Apple Services Engineering", "summary": "Imagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. The Apple Cloud Platform - Developer Experience Team is responsible for building cloud-focused tooling to help make developers more effective on the iCloud Platform. We integrate mobile, desktop and cloud systems into a single experience that brings powerful features to our developers. Our team is looking for a Server Side Software Engineer with a passion for developing extraordinary, highly scalable, and resilient systems with knowledge and hands-on experience in developer tools and server engineering. You can help make a difference by working on products that are public-facing and affect thousands of developers and hundreds of millions of end users.", "description": "We are a small team in the Apple Services Engineering organization, focused on building developer experiences to improve the efficiency of both internal and external teams. In addition to helping developers focus on their application work, we are also introducing technologies that better position developers to take advantage of the Apple Ecosystem, both now and in the future. We also maintain a telemetry and logging platform to ingest, process and visualize application data real time. In this role, you would be responsible for helping build out server side applications and infrastructure to help manage developer workflows. Job Responsibilities • Build server infrastructure which powers Apple Cloud Platform developer tools • Design and implement thoughtful and concise private and public REST APIs using the OpenAPI Specification • Design public client libraries for internal and external consumers • Develop distributed systems at an Internet scale and deploy them as microservices • Build tooling and infrastructure that enable software development standard methodologies in terms of automation, testing, and delivery", "key_qualifications": "Java engineer with production-level experience\nJava JDK Concurrency, multithreaded programming APIs\nExperience with relational and non-relational data stores and concepts\nExperience with public cloud providers like AWS, Azure or Google Cloud", "preferred_qualifications": "", "education_experience": "Bachelor's Degree, or above, in an engineering related field, or equivalent related experience", "additional_requirements": "While the following are not necessary, these skills would be advantageous:\n• Experience with big data technologies like Spark, HDFS, Iceberg or any distributed data storage.\n• Knowledge of Continuous Integration and Continuous Delivery, along with the tools which support these\n• Interest in server-side Swift programming\n• Experience with Netty, Jetty, Spring Boot or similar frameworks\n• Experience with tools such as Gradle, Maven, etc.\n• Dependency Management\n• Serverless/FAAS experience\n• Swift, Objective C, or C++ experience", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549231"}