{"title": "Video Machine Learning Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. We are looking for talent who will join us to craft the future of video. Our team develops cutting edge machine learning technology and system that enable intelligent and interactive video experience in Apple’s products, such as Photos, Camera, Spotlight, FaceTime, AirPlay, SideCar, TV+, etc. You will work closely with a group of highly motivated specialists to develop exciting machine learning technologies that will make a huge impact in the products.", "description": "As a video machine learning algorithm engineer in our team, you will be responsible for developing machine learning technologies, implementing and optimizing the solution, and shipping it in the products. You will be responsible for developing new algorithms, improving existing ones, designing neural network architectures, training, implementing, integrating and optimizing networks, etc.", "key_qualifications": "", "preferred_qualifications": "MS Computer Science or MS Electrical Engineering or equivalent", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559306"}