{"title": "Sr Engineering Program Manager, Ai & Data Platforms", "summary": "At Apple, great ideas have a way of becoming extraordinary products, services, and customer experiences. Bring passion and dedication and there's no telling what you could accomplish. Are you passionate about empowering decision making through data? Do you want to work in a highly energized environment where your abilities will be challenged on a day-to-day basis? If so, the Apple GBI org is looking for people like you!", "description": "In this role, you will drive project management - including large, cross-functional ones - to deliver for important business initiatives. This requires leading all aspects of SDLC (software development life cycle) efforts: you will define, schedule, prioritize, track, measure and communicate status. You will lead efforts across teams representing multiple layers of the technology stack as well as other cross-functional partners, including project managers, engineering, platform, framework, and business groups. Facilitating requirements brainstorming and design review sessions with internal and external partners, while understanding functionalities and features implemented are essential. Identifying and mitigating risks, removing road blocks and facilitating communication between teams are critical aspects to the role. Additionally, you’ll assist in other EPM responsibilities including but not limited to maintaining roadmap, providing oversight on resource capacity and funding at portfolio level, rolling out project framework and governance, etc. We value your ability to lead and develop new processes and ideas when it makes sense to re-evaluate, which at Apple is always!", "key_qualifications": "7+ years of hands-on engineering project management experience in Business Intelligence/Data Engineering/Analytics areas\nExperience in various project methodologies and processes, including Waterfall, Change Management and Agile/Scrum\nProven track recording managing large and complex cross functional programs, bringing multiple teams (including project managers) together and march towards a common objective\nSelf-motivated, collaborative, curious, proactive with demonstrated critical thinking capability\nGood listening/comprehension, verbal and written communication skills, ability to distill and present information for the right audience\nExceptional attention to detail and organization\nDemonstrate resilience and adaptability, in the midst of ambiguity and uncertainty, to promote transparency and inclusion, and ultimately drive business impacting change\nWorking knowledge of SAP and data warehouse, and/or prior experience with large scale system migration projects strongly preferred.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent work experience preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539790"}