{"title": "Machine Learning Engineer", "summary": "As a machine learning engineer/researcher on the Apple Vision Pro team, you will orchestrate ground breaking artificial intelligence development and initiatives that are poised to revolutionize spatial computing! Our mission is to leverage computer vision fused with other modalities to understand human interactions with the physical, social, and virtual worlds. Our primary focus revolves around using machine learning for gaze tracking, paving the way for seamless and intuitive user experiences in the spatial computing era. In this pivotal role, you will work with world-class computer vision and machine learning researchers and engineers, as well as the best talents in other domains like silicon, camera technology, and VFX to collectively take on previously unsolved challenges and push the state of the art in the field. As a member of our team, you have the unique and great opportunity to craft upcoming products that will delight and inspire millions of people every day.", "description": "Inventing and implementing state of the art computer vision algorithms to solve cutting edge problem.\n\nBring research ideas to production and directly impacting Apple products. \n\nCollaborating with other teams in software and hardware to ensure the full pipeline runs efficiently and utilizes Apple hardware effectively.\n\nHave the opportunity to and present your work in world-class scientific venues in machine learning.", "key_qualifications": "Domain expertise in training deep neural nets, such as CNN and transformers and proficiency in least one deep learning framework, for example PyTorch, TensorFlow\nStrong fundamentals in 3D geometry and geometric computer vision\nStrong interpersonal skills and ability to collaborate in a diverse environment\nPublication record in relevant venues (e.g. NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV and etc) or track record of optimally building and shipping computer vision products", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549813"}