{"title": "Senior Software Engineer - Apple TV", "summary": "Do you have a passion for creating exceptional user interfaces that delight users? Do you love writing clean, efficient code that's a happiness to maintain? Here's your chance to elevate the UI experience for our users by developing seamless, efficient, and visually stunning applications. As part of our engineering team, you'll design and build a sophisticated streaming application, collaborate with other Apple team members on cross-platform features, and mentor junior developers. If this excites you, join our expanding team of UI engineers and do the best work of your career!", "description": "Apple TV's outstanding content deserves an extraordinary viewing experience. Our team builds the UI to delight our users and deliver an unparalleled viewing app for TVs. As part of an exceptional development team, we seek individuals who are passionate about their work. As a UI developer at Apple, you are given both individual responsibility and influence. We will be drawing on your experience delivering streaming media applications across a broad array of device types and media formats. Your work will affect millions of users and be necessary to the success of some of the most visible current and future Apple products. To be successful, you will enjoy discussing the best way to tackle technical challenges with your colleagues and have an eye for detail. You will champion best practices and adoption of new ideas.", "key_qualifications": "N/A", "preferred_qualifications": "Familiarity with tvOS or iOS development, Experience with Test Driven Development, Understanding of Node.js and v8 engine, Knowledge of Smart TVs, set top boxes, JavaScript memory and CPU profiling tools, Knowledge of adaptive streaming technologies such as HTTP Live Streaming (HLS), DASH etc. is a plus, Knowledge of testing frameworks Chai, Mocha, Knowledge of Gulp, NPM, Rush", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553432"}