{"title": "Product Quality Manager (PQM) – Color– Accessories, Home and Beats", "summary": "At Apple, a Product Quality Manager – Color has responsibility for Accessories quality and works across multiple products, suppliers, management levels, and functions to define product color appearance specifications and manufacturing quality control methods.", "description": "We enable the mass production of incredible products and work in tandem with Apple's renowned designers to develop measurement technologies, quality control strategies, information systems, and manufacturing methods that achieve ambitious specifications at massive production scale.", "key_qualifications": "Subject Matter Expert for all things related to visual color and texture comparison and assessment. 5+ years of experience in developing quality plans or experience with color appearance, gloss, texture and GD&T metrology preferred. Knowledge of quality concepts, supplier management, and manufacturing operations including; Quality Plans, FMEA, auditing, corrective and preventative actions, sampling methodologies, and process capability. Proven understanding of problem-solving tools including root cause analysis and statistical process control principles. Understanding of project management concepts. Direct PM experience a plus. Knowledge and ability to execute limit sample analysis in manufacturing settings. Experience with optical coatings, plating, anodizing, resin compounding, pigmentation, textiles, dyeing or color formulation. Detail oriented with excellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "BS or higher in Engineering or Color Science required. Project management experience is a positive. Apple is an equal opportunity employer that is committed to inclusion and diversity.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527055"}