{"title": "SWE- Engineering Project Manager, SWE Programs", "summary": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are targeting will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. As a Software EPM, you will get a front row seat to deliver the best experience to our users. You will need experience with software development fundamentals, proven leadership capabilities, excellent interpersonal skills, and a desire to work with an amazing engineering team to develop ground-breaking initiatives in the cellular software space. If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!", "description": "We are looking for someone to drive, own, and ship all aspects of large, multi-functional efforts and feature areas. Partner with engineering teams throughout feature development from architecture, design, implementation, and validation both in pre and Post Silicon phases. Proactively identify, prioritize, and drive resolution to program issues. Present and communicate new feature initiatives, top issues, risks, critical achievements to executive leadership. Help the team with ongoing improvements to the program management processes. Collaborate with cross functional SW and HW Engineering and Quality teams. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "Proven program management experience in wireless software, system and platform development. Good Understanding of cellular communications technologies (5G-NR/4G LTE/ UMTS/GSM/CDMA) is a significant plus. Driving multi-functional efforts across major technical fields: SW, HW, Silicon, and QA. Outstanding communication and presentation skills to engineers, managers, and execs. Identifying risks, developing mitigation strategies, and facilitating resolutions. Sound technical foundation and a highly motivated self-starter. Knowledge of software engineering standard methodologies and related dependencies. Strong leadership skills and ability to encourage team members.", "preferred_qualifications": "", "education_experience": "BSc or MSc in a technical field or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548541"}