{"title": "New Product Operations Program Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. New Product Operations is pivotal to the dynamic development and launch of Apple’s products. A successful NPO Manager is a natural leader and facilitator; is driven, organized and detail oriented; excels in program/ project management; communicates with ease at all levels; thrives in an ambiguous environment; is adept at facilitating actions and resolving conflicts; leads through relationships and influence: and displays grace under fire.", "description": "You will lead the Team within WW Operations and be the primary operations interface to the core product development team and other functional organizations within Apple. As the owner of the product, either through direct involvement and/or influence, you will ensure the successful launch of the product towards meeting its stated Cost, Quality, Schedule, Availability and Customer Experience goals. Plan and execute all development builds and rapid ramps of new products. Coordinate Engineering, GSM, SQE, TPM and other internal and external teams by ensuring security, materials, equipment, fixtures, staffing, training, documentation plans are in place; For development builds and ramp readiness activities at the OEM site(s). Drive ramp readiness that include materials, equipment, fixtures, training, documentation, and transition and supply chain plans. Through influencing product’s manufacturability, testability and material composition, you will drive for responsive supply chains that are optimized for lowest costs, greater operational flexibility, regional fulfillment and the highest quality. Assess, analyze, consolidate, and communicate risk and status clearly and succinctly to management, raising key issues and presenting options for resolution to the cross-functional executive team through the new product reviews.", "key_qualifications": "5+ years of industry experience. New Product Introduction / Supply Chain Management / Manufacturing Operations / Development or Operations Engineering experience. Ability to succeed in a matrixed environment. Excellent program management and communication skills. Exceptional ability to build relationships; data-driven and willing to take action; enthusiastic and motivated; and detailed while managing several work-streams. 25-30% travel to Asia required", "preferred_qualifications": "", "education_experience": "BS or MS degree in Engineering. Advanced degree preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552872"}