{"title": "AIML - Sr Software Engineer, Siri Performance and Reliability Metrics", "summary": "AI/ML Siri Performance and Reliability Metrics team is looking for a Sr Software engineer with experience building large data systems and skills to function in a fast-paced environment with scope for tremendous impact. We seek a talented engineer who can work well across teams and organizations, and has a passion for excellence. We thrive on designing and implementing performance metrics and visualization tools for delivering data and insights to AI/ML engineering and leadership.", "description": "We are looking for an engineer who will be responsible for defining, developing and delivering key user facing performance metrics to engineering partners and senior leadership. In this role, you’ll partner closely with engineering teams to find opportunities for improvement of Siri performance. You work will include maintaining large scale data systems on server and on-device for performance metrics computation and observability. We’re looking for someone who has excellent communication skills, the ability to engage with colleagues and leadership to find common ground on solving hard problems! You’ll be someone comfortable executing in a rapidly changing environment with ambiguous requirements to drive impact incrementally. You demonstrate strong problem solving skills and are self-directed with a proven ability to execute. You continually desire learning and demonstrate attention to details and find opportunities to innovate and share knowledge with others. You demonstrate best practices for code development including unit testing, CI/CD, performance testing, documentation, monitoring and alerting. You will be responsible for collaborating with customers to understand metric needs, provide technical guidance and gather requirements and deliver effective data solutions and dashboards.", "key_qualifications": " ", "preferred_qualifications": "Experience in Swift and common iOS libraries and architecture. Experience building dashboards and visualizations using BI tools like Apache Superset, Tableau, Looker or similar. Experience in data architecture and data modeling. Experience in performance and reliability measurement and identification of hotspots. Experience in troubleshooting and optimizing data systems issues at scale. Experience shipping code on device and troubleshooting performance bottlenecks. Experience in logging data from devices and understanding of telemetry protocols", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553525"}