{"title": "Sr. Legal Counsel - Global Supply Chain, FATP", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. Do you love tackling big challenges without precedent? Do you possess a deep knowledge of the legal field and a passion for innovation? As a part of our group, you’ll help uphold Apple’s high ethical and corporate standards, as well as defend our intellectual property. You’ll help provide legal support for all our products and businesses across the globe. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your deep legal expertise to rare and often unexplored aspects of the law. Together with your team, you’ll provide the critical support needed worldwide for all Apple products and businesses. At Apple, we are dedicated to making the best products on the planet. We have a fantastic new opportunity for a talented lawyer to join our team of diverse, creative, and hardworking people. As a member of the Products & Regulatory Legal Group, you will work with Apple’s engineering, operations, and marketing teams to help create and introduce Apple products to the world. With passion, dedication, and a desire to tackle challenges, you will play a crucial role as we provide the legal support needed for Apple to continue to build cutting-edge technologies.", "description": "You will join a team of attorneys in the Products & Regulatory Legal Group who support development teams, advising engineering and operations teams on a wide variety of matters, including product assembly, technology development, sourcing strategy, and supplier relationships. You will collaborate with other legal groups and cross-functional business and engineering teams to strategize on, draft, and negotiate complex product assembly, equipment, manufacturing and other commercial agreements. You will also advise Apple management on risk allocation/mitigation, business strategies, and policies.", "key_qualifications": "N/A", "preferred_qualifications": "Knowledge of Apple business is preferred, Excellent communication skills with the ability to advise and build relationships with executive management, teammates, and cross-functional partners, Strong analytical skills and business sense with the ability to resolve complex issues in creative and effective ways, Ability to develop and facilitate collaboration by cultivating relationships and effectively counseling and communicating with legal and cross-functional partners, Excellent organizational skills with the ability to manage a high volume or projects, Self-starter who is curious, loves technology, and thrives in a dynamic environment", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $221,600 and $333,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557979"}