{"title": "Copywriter, Marketing Communications", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. Marcom is looking for a Copywriter to join our marketing and communications team. You will work with an Art Director and a team of hardworking creatives to build concepts across all mediums for products, product launches and campaigns. You have a deep love of Apple and Apple products. Your work will be seen by Apple customers all over the world.", "description": "-  You’ll write, review, and empower campaigns for the Apple brand and products. -  You will present work to senior creative staff and product marketing managers. -  You will collaborate with an Art Director to concept ideas, and with designers to help bring them to life. -  Work across subject areas to integrate strategies and messaging for social media, online, retail, channel, events, advertising and new mediums of communication. -  You should be ready to do the best work of your life.", "key_qualifications": "", "preferred_qualifications": "Your work is grounded in original ideas, implemented with outstanding craft and meticulous attention to detail. You have produced work in multifaceted mediums of advertising, social media, conceptual campaigns, product launches, branding, photography, film and video. You are passionate about excellent writing that is thoughtful, meaningful, provocative at times, clear and inspiring. You are used to working proactively in a creative and dynamic environment. You understand the worlds and language of film and photo production. You have an eye for great writing and the ability to create a powerful story through the work. A multi-skilled English writer — you love coming up with a clever, concise headline as much as you enjoy crafting a well-honed paragraph of body copy or a script for a social animation. Apple is an equal opportunity employer that is committed to inclusion and diversity! We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants! Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. It’s a recognition of us all as individuals, who thrive when we have the resources that meet our own unique needs. That’s why Apple offers all kinds of ways to experience well-being, confidence, and satisfaction. Because when you feel good, you feel like you can do your best work and live your best life. Benefits include medical insurance, dental and vision coverage, life insurance, annual leave, sick leave, wellness programs, discounts and more.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559590"}