{"title": "AIML - Machine Learning Engineer, Siri & Information Intelligence (SII)", "summary": "The Siri & Information Intelligence team is looking for engineers to build and maintain models for our on-device search technologies. As part of this group, you'll work with our machine learning, natural language processing, and infrastructure teams; optimize your work to run efficiently across Apple's range of products; and build partnerships across Apple in order to deliver great user experiences underpinned by modular, thoughtfully designed software.", "description": "In this role, you'll be working to build and support the machine learning basis of Apple's groundbreaking search technology across our entire range of products. You'll work closely with multiple teams across the organization, building durable and reusable technologies written with future evolution in mind. You'll additionally be responsible not only for delivering the latest advances in search to our users, from text to media, but also safeguarding their privacy by using the unique features of Apple devices. Successful candidates must be passionate about machine learning, caring not only about user experience but also the tradeoffs and optimizations required to deliver great mobile experiences. Cross team collaboration is a key part of this position, and you'll be expected to work with our natural language processing, application, and OS framework teams to tailor their technologies for each and every Apple platform and device.", "key_qualifications": " ", "preferred_qualifications": "Software optimization experience, accompanied by knowledge of profiling tools and techniques, Prior experience developing applications for Apple platforms, Knowledge and experience in search and indexing technologies", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558590"}