{"title": "AIML - Machine Learning Engineer, Siri Perception", "summary": "Play a part in the next revolution of human-machine interaction. Work with the people who created the intelligent voice assistant that helps millions of people get things done — just by talking to Siri. Join the Siri Perception team at Apple. The Siri Perception team is looking for a machine learning engineer to contribute to and influence the development of the next generation virtual assistant on Apple’s latest and most innovative devices. You should be passionate about hands-on work focused on research and development of new Siri experiences using data from multiple modalities, e.g., speech and vision.", "description": "You will be a part of the research and development team who developed the Siri invocation and conversational interaction experiences on a full range of Apple’s devices. The position requires passion for researching and developing machine learning algorithms and systems. As part of the team, you will partner with the speech, vision, natural language understanding, and personalization teams, to deliver the best user experience with Siri. You must have a “make this happen” attitude, and be able to collaborate with various teams across Apple, to design user experiences, run user studies, collect data, and train/evaluate machine learning models.\nResponsibilities:\n        * Do research, design and deploy machine learning/deep learning models\n        * Benchmarking and fine tuning machine learning/deep learning models\n        * Optimizing algorithms for real time and low power constraints devices\n        * Support algorithm deployment into Apple products\n        * Collaborate with multidisciplinary teams across Apple", "key_qualifications": " ", "preferred_qualifications": "Proficiency in parquet, iceberg, AWS, pyspark and other data processing and analytics pipelines in big data ecosystems\nExperience using data integration, processing, scalability, automation, and workflow orchestration tools\nGood background of user study development and data collection to capture natural human-machine interaction\nConsistent track record of researching, inventing and/or shipping advanced machine learning algorithms\nOutstanding communication and interpersonal skills with ability to work with cross-functional teams.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558756"}