{"title": "Camera Image Sensor Digital Design Engineer", "summary": "Are you a leader and want to apply your engineering background to make big things happen, and can you influence, connect, get results and communicate effectively while delivering on a predictable and dynamic schedule? The Custom Silicon Management Group provides critical custom sensor silicon for all mobile products including iPhone, iPod, and AppleTV. We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies. We are looking for a remarkable Digital Designer with mixed signal SOC experience to work with multi-functional teams and external vendors to define, develop and productize the next generation of image sensor solutions. This position focuses specifically on all major blocks of an image sensor ASIC including digital timing and control of the pixel array and analog readout, signal processing in the sensor datapath, interface control, and overall sensor integration into a camera system.", "description": "As a Sensor Digital Designer you will own the specification and verification of sensor digital signal processing and many aspects of sensor interfaces, you will be: Collaborating with global sensor suppliers to develop and evaluate new sensors Collaborate with sensor designers in analyzing digital micro-architecture and embedded sub-systems Detailing and communicating your results to multi-functional engineering teams Working with the internal customer teams to evaluate the contribution of the sensor to system performance Working with collaborators to assure that sufficient and correct verification/testing is implemented at all stages to guarantee performance", "key_qualifications": "Bachelor's degree and 10+ years of digital design experience in the context of large mixed signal SOC ASICs; Experience in crafting digital systems at the RTL level, performing synthesis, and working with place & route teams; Proven ability to drive and lead technical engagements", "preferred_qualifications": "Experience with modern design verification techniques in mixed signal environments; Ability to use industry standard ASIC design tools including Lint, CDC, DFT tools; Hands on experience with bring-up of ASICs; Multi-disciplinary understanding of EE, CE, and Physics principles is a plus; Ability to work closely with others in a very multi-functional team environment; Ability to document and present your results to both internal and external engineering teams", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553680"}