{"title": "Software Developer in Test, File Systems", "summary": "The Local File Systems QA team within Apple's Core OS organization is looking for a talented and inspired Quality Engineer to work on the Local File Systems Quality Team. The team is responsible for validation and support of file systems on all platforms. This position’s primary focus will be supporting The APFS file system, but an understanding of our teams other deliverables will also be required. Successful candidates will work hands-on with a team of quality engineers on the validation of new features, protocols, and hardware, as well as provide world-class support for existing deployments.", "description": "You will join a dynamic team responsible for qualifying the latest Apple Products with a focus on file systems. We work hand in hand with the Software Engineering teams to support code changes, focusing on increasing the depth and breadth of related tests in both an automated and hands on manner. The successful candidate will drive both documented and adhoc testing to ensure high quality releases for all our products. Core Responsibilities Include: Drive the validation of file system changes on a weekly basis in the automation racks Run and analyze weekly automated test executions. Write and review Test Plans for all file system operations. Lab hardware setup and maintenance Collaborate with development teams to help root cause issues found in test and verification of fixes Write test software to address new features or changes in operational code Work with team members to incorporate testing enhancements for efficiency.", "key_qualifications": "A solid understanding of QA testing methodologies and practices preferred. Excellent understanding and ability in a scripting language such as Python, Bash, Ruby, LUA, Perl. Familiarity with C. Should be able to use scripting ability to create new automation tests. Detail oriented, analytical, and creative problem solver with passion for quality processes. Comfortable working in a constantly evolving and dynamic environment and driving top issues to resolution. Familiarity with Source Control Management such as svn or git. Excellent written and verbal communication skills. Familiarity with iOS, macOS or other operating systems such as Unix/Linux desirable.", "preferred_qualifications": "", "education_experience": "Strong computer science fundamentals required - no matter how you got them.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552689"}