{"title": "Computer Vision and Machine Learning Research Scientist - Physiology", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "You’ll be working in a team of researchers and engineers to implement world class algorithms that push the state-of-the-art. This is a multi-faceted scientific role that will require you to be versatile across a variety of tasks in a highly collaborative environment. You will have the following responsibilities: Develop machine learning models to pull out meaningful and actionable insights from complex multimodal datasets. Work cross-functionally with other team members to translate these insights into transformative prototypes and demonstrations. Help architect and port closed-loop, real-time algorithms to a variety of platforms.", "key_qualifications": "Hands-on experience with applying both traditional CV models (for example: optical flow, structure from motion, state estimation, feature descriptors, Eulerian magnification) and deep learning models (for example: body/face detection, segmentation, stereo depth, saliency, recurrent and convolutional nets, transformers) on physiological datasets. Fluency in a high-level programming language (Python and/or Matlab) and experience with ML tools (scikit-learn, pandas and deep learning toolboxes such as TensorFlow and PyTorch). 2+ years experience with OpenCV or similar. 2+ years experience in signal processing, linear algebra and time-frequency analysis. Excellent programming, problem solving and debugging skills. Interest in applying machine learning techniques to help improve user’s wellbeing, health and comfort. PhD (or MS and 3 years of research experience) in Computer Science, Biomedical Engineering, Computational Neuroscience, Applied Mathematics, or related field.", "preferred_qualifications": "Experience with human visual system and perception. Experience with translating exploratory data analyses into production models. 2+ years industry research experience is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557148"}