{"title": "Sr. Software Engineer - Apple Service Engineering", "summary": "The Apple Service Engineering (ASE) Data Services team is looking for an extraordinary engineer to design and build the best of breed systems for dealing with our complex and ever-growing data and infrastructure needs. We are a key part of the Apple ecosystem, supporting millions of users and billions of transactions. We're looking for someone ready to work at huge scale and have a hand in bringing amazing new products and services to market.", "description": "The Apple Service Engineering team supports tens of millions of pieces of content in more than 150 markets enjoyed by hundreds of millions of users, which powers various features within the Apple client applications - iCloud, App Store, Apple Music, Apple TV+, iTunes, iBooks, Podcast, etc. We've got unique and growing needs for data storage and consumption. You will help build the large scale data services, which provide and support abilities like structured and unstructured storage, caching, queueing and much more. You'll collaborate cross-functionally with various Apple teams, from store and commerce through to search and recommendations, AIML, creating services and infrastructure platforms and pipelines that can rapidly scale and serve personalized and non-personalized data with very low latency. You should be someone who is willing and capable of diving deep into details, is not afraid to question assumptions, is a good team player who collaborates well, tackles problems with elegant technical solutions and always fight for excellence.", "key_qualifications": "Empty", "preferred_qualifications": "Experience contributing to Open Source projects is preferred. Experience with NIO frameworks such as Netty is a plus. Experience with compute/container platforms such as K8s is highly preferred. Experience in distributed data stores replication and CRDT is a plus. Experience in scalable message queue systems like Kafka, KubeMQ, RocketMQ is a plus.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through stock programs. Apple employees are eligible for restricted stock unit awards, can purchase Apple stock at a discount, and receive benefits including medical and dental coverage, retirement benefits, discounted products and free services. Additional benefits may include discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559523"}