{"title": "EHS Food Services Specialist", "summary": "As an EHS Food Services Specialist, you will support and be involved in a wide range of work across Apple Càffe Macs retail food facilities, food production sites and corporate buildings! You will conduct routine inspections to meet internal requirements, as well as ensure compliance with government regulations. You will support day-to-day operations to ensure compliance with and collaborate on food safety sanitation procedures and employee safety practices. This will include providing education, improving employee engagement, collecting and recording EHS information, and driving continuous improvement of overall EHS processes and systems.", "description": "-  Identify and advise management of compliance issues, safety risks, and improvement opportunities through the conduct of regular EHS inspections.\n\n-  Support the EHS team in coordinating safety meetings, events, evaluations, program deployments, and other safety-related activities.\n\n-  Facilitate continuing education and ensure compliance with applicable written programs and regulations (FSMA, HACCP, ROP, Acidification, Allergen, etc.).\n\n-  Submit and track EHS action items and Operations & Maintenance work tickets.\n\n-  Facilitate incident investigations and update internal database.\n\n-  Organize, file, and maintain safety documentation (e.g., training records, database updates, EHS metrics)\n\n-  Participate in emergency response activities, including after hours. \n\n-  Support Emergency Response, other EHS programs and local regulatory ordinances with inspections, labeling, data entry, and training development and verification.\n\n-  Review and upload chemical Safety Data Sheets (SDSs) to internal database.\n\n-  Collaborate with EHS Team on tasks, projects and programs.", "key_qualifications": "5+ years health & food safety EHS experience, preferably 2-3 in a regulatory capacity\nHighly proficient and adaptable to technology and software tools\nExcellent interpersonal/customer service skills, organizational skills and attention to detail\nAbility to earn trust, maintain positive and professional relationships, and add to our culture of inclusion", "preferred_qualifications": "", "education_experience": "BS in relevant EHS subject area", "additional_requirements": "-  Trained or certified REHS, CP-FS, HACCP preferred\n-  Trained subject matter expert familiar with OSHA regulations\n-  Knowledge and experience in both retail food and food manufacturing\n-  Experience supporting EHS initiatives, including EHS metrics reporting and inspections\n-  Experience collaborating with EHS team partners on EHS processes, programs, tools, and materials", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547890"}