{"title": "Software Engineer - Embedded Systems", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do.", "description": "This team is responsible for developing software and firmware for the System Management Controller, Power Systems and Private Cloud Compute Management Controller. Work on new silicon bringup for wide range of Apple Products. Collaborate with cross-functional teams to design and develop innovative solutions.", "key_qualifications": "Proficient in Embedded firmware or kernel driver development in C or C++; A fundamental knowledge of embedded processors, with in-depth knowledge of real time operating system concepts; Experience with at least one peripheral protocol; e.g. I2C/SMBus, UART, SPI, USB, Network stack etc; Excellent communication and collaboration skills; A focus on generating stable code through detailed testing; Highly professional, with the ability to deliver proven work on tight schedules; Bachelor or Master degree in Computer Engineering, Computer Science, or Electrical Engineering.", "preferred_qualifications": "Extensive experience designing, developing and testing embedded software using C/C++; Experience with advanced micro-controllers or kernel level SoC programming; Experience in silicon and pre-silicon bring-up; Experience developing tools using Python; Ability to comprehend hardware specs and schematics; Experience with code management tools such as Git, CVS, SVN, or Perforce; Experience with debuggers such as gdb, lldb, etc; Hands on experience with test equipment including scopes, analyzers, and multi-meters.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525628"}