{"title": "Engineering Program Manager, Core Services, Apple Services Engineering", "summary": "The Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, Fitness+ and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. On this team, we work closely with Core Services Engineering and with teams that have dependencies on Core Services to drive cross functional projects across Apple's Services. This role will also help lead strategic initiatives to modernize platforms and technology that enable partner and client teams to greatly improve the customer experience.", "description": "In this role you will partner with software engineers and managers from our Core Services Engineering team to define, schedule, and track the team's work and also to do the same for many multi-functional initiatives. Fast-paced engagement is a requirement, where multiple concurrent projects are active and where priorities change often. You will be the central hub bringing together different teams across Apple Services to deliver on groundbreaking technology across all of our operating systems.", "key_qualifications": "Not Available", "preferred_qualifications": "Drive yearly, quarterly and other strategic roadmap planning, discussions and communication. Be able to deeply engage and immerse yourself into the program and projects where engineers that you support are engaged. Strong understanding of and experience in managing complex, multi-functional software projects. Experience leading driving complex and cross-platform integrations. Be able to dive into detail about how full-stack platforms and technologies work. Strong technical understanding of operating systems and how the various layers in the software stack fit together Excellent spoken and written communication with the ability to tailor communication style to multiple audiences Proven track record in defining processes and executing on them. Self-motivated and enthusiastic with demonstrated creative and critical thinking capabilities. Excellent attention to detail and highly organized. Ability to build relationships and influence others. Previous engineering experience a plus. BS in Computer Science or experience in related field preferred.", "education_experience": "Not Available", "additional_requirements": "Not Available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559270"}