{"title": "Employee & Labour Relations Business Partner", "summary": "At Apple, we believe in hard work, a fun environment, and the kind of creativity and innovation that only comes about when talented people from diverse backgrounds approach problems from varying perspectives.", "description": "• Applying Apple values to support leaders and People team colleagues to resolve people challenges, including performance management, policy interpretation, business conduct issues, and terminations.\n• Conducting independent and timely investigations into alleged workplace misconduct and policy breaches, including interviewing employees, creating concise investigation reports, making recommendations to leadership.\n• Developing training and local policies, when applicable, and communicating and implementing company-wide programs, policies, and procedures.\n• Coordinating and leading Work Council, including any information or consultation process\n• Identifying and supporting development of strategy to mitigate labour relations risks including monitoring the external environment.\n• Coordinating and leading responses to government audits, information requests and inspections.\n• Using metrics with key stakeholders to highlight trends and developing strategies to cultivate positive employee relations in the business and to mitigate risk.\n• Maintaining accurate case entry practices in ER case management systems.\n• There will be some travel required to stores in France.", "key_qualifications": "Demonstrated experience related to employee and labour relations\nStrong knowledge of and experience with employee relations cases\nStrong knowledge of and experience with France labour relations system\nStrong problem-solving and critical thinking skills\nAble to work successfully within ambiguity and within a complex, fast pace and challenging business environment\nAbility to learn quickly and adapt flexibly to different situations\nA demonstrated ability to partner effectively with key internal stakeholders including senior business managers\nStrong communication skills including effective listening, writing and presentation\nAbility to work independently and as part of a team\nFluency in French and English required", "preferred_qualifications": "Customer focused, detail oriented individual with ability to maintain a positive attitude in high-stress and fast-paced work environment\nDrive for quality results and demonstrates high degree of determination", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553095"}