{"title": "Software Engineer (Cloud Data Platform), Ai & Data Platforms", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers. The Global Business Intelligence team provides data services, analytics, reporting, and data science solutions to Apple’s business groups, including Retail, iTunes, Marketing, AppleCare, Operations, Finance, and Sales. These solutions are built on top of a great data platform and leverage multiple frameworks. This position is an extraordinary opportunity for a proficient, experienced, and results-oriented data platform engineer to solve database design and optimization problems and provide a scalable, high-performance and dynamic Enterprise Data Warehouse (EDW) platform!", "description": "As a Cloud Data Platform Engineer, you will be responsible for leading all aspects of a database platform. This would include either database design, database security, DR strategy, develop standard processes, new feature evaluations or analyze workloads to identify optimization opportunities at a system and application level. You will be driving automation efforts to effectively manage the database platform, and build self-service solutions for users. You will also be partnering with development teams, product managers, and business users to review the solution design being deployed and provide recommendations to optimize and tune. This role will also address any platform-wide performance and stability issues. We're looking for an individual who loves to take challenges, takes on problems with imaginative solutions, works well in collaborative teams to build and support a large Enterprise Data Warehouse.", "key_qualifications": "3+ years experience in relational cloud-based database technologies like Snowflake (preferred), Teradata, BigQuery or Redshift, Demonstrated ability working with Advanced SQL, Shown experience handling DBA functions, DR strategy, data security, governance, associated automation and tooling for a database platform, Experience in performance tuning, capacity planning, managing cloud spend and utilization, Experience with object-oriented programming in Python or Java, Experience with SaaS/PaaS enterprise services on GCP/AWS or Azure is a plus, Familiarity with in-memory database platforms like SingleStore is a plus, Experience with Business intelligence (BI) platforms like Tableau, ThoughtSpot, and Business Objects is a plus, Good communication and personal skills: ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownership.", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in Computer Science, equivalent or related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548830"}