{"title": "Software Quality Engineer, Mobile Apps - Retail Engineering", "summary": "The Mobile Apps team at Apple creates mobile e-commerce and retail experiences through the Apple Store App, used by millions of Apple customers. Join our Mobile Apps team as a Quality Engineer and play a key role in driving the testing and coordination of QA efforts.", "description": "The Mobile Apps team is looking for a Quality Engineer with strong technical, problem-solving, and communication skills to ensure the quality of applications that millions of customers use every day.", "key_qualifications": "5+ years of experience in testing, Deep understanding of software QA methodologies & practices, Skilled at debugging, troubleshooting, applying analytical thinking skills to systematically assess project quality, Knowledge of Client/Server Architecture and mobile E-Commerce domain, Knowledge of test automation frameworks, MS/BS in Computer Science or equivalent experience", "preferred_qualifications": "iOS Mobile Application testing, Proficient at balancing multiple efforts simultaneously and meeting strict deadlines, Ability to own quality for a complete functional area of an application or product, Excellent written and verbal communication skills, Experience working in global, cross-functional teams (QA and Engineering), Proven bug detection and regression skills, Easily adaptable in a dynamic, constantly evolving, and demanding environment", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556125"}