{"title": "Global Supply Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple is seeking a Global Sourcing & Supply Manager (GSSM) to assist with strategic planning, long term deal structuring and negotiations. This position requires the ability to work with procurement, engineering, finance and legal teams and also third-parties such as foundries and suppliers. Position requires strong quantitative and analytical skills, critical thinking, and ability to manage multiple projects and deadlines simultaneously. The Global Sourcing & Supply Manager is positioned at the interface between Apple’s product teams and the industries that supply core technologies. We are responsible for developing and executing sourcing strategies as well as recommending product innovations based on improving technology. The position requires an interest in market dynamics, negotiation and pricing, manufacturing processes, and risk mitigation. The Global Sourcing & Supply Management team drives centralized capacity planning for all components used across Apple products and helps drive long term strategic deals.", "description": "- Develop a nuanced understanding of the commodity landscape in order to forecast industry trends and gauge emerging competitive forces. Identify changes in buyer and supplier power and use industry dynamics to Apple’s advantage.\n- Perform supplier financial research, spend analysis and ad-hoc financial analysis for strategic procurement deals.\n- Effectively work with suppliers to negotiate optimal terms for sourcing. Understand the trade-offs between cost, volume, and quality in order to strike agreements that meet Apple’s performance criteria and secure long-term supply continuity.\n- Collaborate across the Apple organization to ensure business objectives are met. Includes the ability to rapidly synthesize and communicate findings to senior leaders and to actively identify potential supply issues that can affect product strategy.\n- Optimize supply chain performance through cost and capacity scenario analysis, and benchmarking.\n- Develop an in-depth understanding of value-added manufacturing processes and costs and market intelligence, and apply this knowledge to influence Apple’s future product roadmap and sourcing decisions.\n- Provide overall program management support and contribute to ongoing development of processes, templates, escalation procedures, and reporting.", "key_qualifications": "", "preferred_qualifications": "Analytical and critical thinking skills\nExperience working in Supply Chain, Operations, or a related field is a plus\nAbility to operate independently\nUnderstanding of contract negotiations for both commercial and legal aspects\nAbility to support resolution of complex supply chain issues\nDirect experience in long-term capacity planning a plus\nA tenacity, passion and demonstrated skill in negotiations\nSuperb communication and interpersonal skills\nCan build, grow and develop key cross-functional relationships to be able to influence and drive projects\nAbility to make quick decisions and solve complex problems with 80% information", "education_experience": "", "additional_requirements": "Willingness to travel internationally up to 30%", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546626"}