{"title": "Site Reliability Engineer (SRE) - Object Storage", "summary": "People at Apple don’t just build products — they craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it.", "description": "We are looking for seasoned software and systems engineers to join the Object Storage SRE team at Apple. The role involves tremendous amount of individual responsibility and influence over the direction the platform, shaping its use by many critical Apple Cloud services for years to come. You are solution-oriented and have a passion for software delivered as a service to improve reuse, efficiency, and simplicity. Your work will affect hundreds of millions of users and be essential to the success of some of the most visible current and future Apple features.", "key_qualifications": "Experience in building, operating, and scaling distributed storage systems in a private, public, or hybrid cloud environment. The ability to design, author, understand, and release code in languages like Go (preferred), Java, Python, or Rust. Good understanding of block, object, and file storage solutions in Linux (such as LVM, XFS, ext4, S3, Ceph, Gluster, NFS). Understanding of Linux internals, standard networking protocols, and distributed systems. Experience with provisioning, data migration, backup & recovery, at-scale testing, disaster recovery, and capacity planning.", "preferred_qualifications": "", "education_experience": "Bachelors degree in Computer Science or related field, or equivalent employment", "additional_requirements": "Acute drive to automate manual operations and to improve them through repeated iteration. Awareness of best practices for deployment of storage systems - implication of physical and virtual deployment models to change management. failure domains, hardware lifecycle management, etc. Hands-on experience managing large numbers of diverse systems with configuration management or software delivery platforms (such as Puppet, Chef, Ansible, and Spinnaker). Experience with deploying, supporting and monitoring new and existing services, platforms, and application stacks. Familiarity with microservices architecture and container orchestration with Kubernetes. Familiarity with relational & non-relational databases (such as Cassandra, Postgres, & RocksDB)", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541645"}