{"title": "Camera Software — Computational Photography/Machine Learning Research Engineer", "summary": "The Camera Algorithms team is looking for passionate, self-driven computer vision/computational photography research engineers who enjoy both innovating down to the details and collaborating with broader cross-functional teams to bring exciting new imaging technology to our Apple products. We have worked on many core algorithms in the Apple camera imaging pipeline like DeepFusion, Photonic Engine, SmartHDR, and Panorama. In this role, you will research and develop novel machine learning techniques for various image restoration and image fusion applications and contribute to shipping the most popular camera in the world.", "description": "As a machine learning research engineer on our team, you will contribute to algorithm design and implementation. You will develop deep learning models and collaborate with cross-functional teams like camera hardware, firmware, GPU, and image quality teams to bring your innovate ideas to product. We are seeking an innovative and inquisitive engineer who can leverage their knowledge of classical computer vision and computational photography techniques to build and deploy deep learning models that help us design the next generation Apple camera imaging pipeline.", "key_qualifications": "Demonstrated ability in developing machine learning algorithms for computational photography/computer vision and image processing problems\nExtensive knowledge in camera processing pipeline, classical computer vision, and classical computational photography techniques\nStrong coding skills in Python and/or C/C++\nGPU programming skills a big plus\nExperience with deep learning frameworks like PyTorch or TensorFlow\nExcellent verbal and written communication skills\nCreativity and curiosity for solving complex problems", "preferred_qualifications": "", "education_experience": "MS/PhD in Computer Vision, Machine Learning, Computer Science, Electrical Engineering or related fields", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519262"}