{"title": "CPU Performance and Workload Analysis Engineer - Platform Architecture", "summary": "Modern system-on-chip (SoC) designs have dramatically changed how hardware and software is developed. It is increasingly important to understand the concerns of software developers when designing hardware while it is also increasingly meaningful for software developers to understand how their applications can map efficiently to modern iPhone, iPad and Mac hardware. Those who can understand both and prefer to live at the intersection of hardware and software are deeply valuable, especially to Apple. The Apple CPU Architecture and Performance Team is seeking highly motivated and self-driven engineers who want to live at this intersection, individuals who have or want to develop domain expertise in emerging areas like AI, individuals who have a high-level CPU architecture understanding and desire to work with a world class team for CPU, SoC, and software development. Are you deeply accountable for your work? Your passion for product ownership and track record of product development will prove critical to your success on our team.", "description": "We drive advanced exploration for next generation CPU architectures. As a member of this team, you are the interface between the CPU team, system teams, and many software teams at Apple. We have a data driven approach that is focused on real user workloads (both existing and emerging) so your work will guide optimizations and the direction of future CPUs. At the same time, you will be working with software developers to optimize code for our CPU designs and roadmap. Your responsibilities will include: - Profile and analyze existing and emerging workloads, bring up in CPU/SOC simulation environment - Develop and maintain performance and trace analysis tools - Develop and implement visual extensions to assist with data analysis that can be used internally and also by the various software partners in Apple - Run and analyze workloads on simulators and prototype devices as well as work on developing and automating performance analysis infrastructure - Develop domain expertise in emerging fields (ex: ML, AR/VR) in order to both identify hardware advancement opportunities and assist software teams in optimizing for our devices. - Profile and analyze workload in potential new product areas to help guide CPU roadmap decisions", "key_qualifications": "", "preferred_qualifications": "MS or PhD in Electrical or Computer Engineering, or related field; Experience working multi-functionally with people of very diverse backgrounds; Demonstrated communication, influence, and negotiation skills; Technical documentation skills; Knowledge of visual/UI or data analysis frameworks; Knowledge of OS internals and compiler technology", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556226"}