{"title": "SWE - Technical Translator (French Canadian), Localisation", "summary": "Passionate about delivering beautifully localised software for hundreds of millions of users, we're looking for a translator to localise software and related content into French Canadian. Join the team responsible for the localisation of Apple software and Siri. You'll be challenged to solve sophisticated problems and have a tangible impact on the Apple user experience.", "description": "Our localisation team is looking for highly motivated individuals with the right mix of technical, creative, organisational and communication skills to provide technical translations and adaptations for our software. Proficiency and translation experience in French Canadian language are crucial. This position is highly suited to technical translators with previous localisation experience. It provides a chance to work within an exciting, supportive team, interact with other localisation teams at Apple, as well as engineering and QA teams, and gain valuable insights into the development process at Apple. The environment is fast paced, requiring the capacity to handle workload with bold delivery schedules. In addition to project work, other responsibilities include: - Hands-on translation of Apple products into French Canadian. - Utilising internal tools to identify changes with localisation impact. - Bug monitoring, blocking issues, reporting and resolution. - Working with multi-functional groups to ensure the process runs smoothly and on schedule. - Ensuring terminology consistency across all Apple products and services - Assisting with quick-turnaround translations. - Identifying tools and process improvements. - Performing linguistic QA and runtime testing. - Maintaining style guides. - Maintaining language glossaries.", "key_qualifications": "", "preferred_qualifications": "Background in software localisation, CAT tools, Language qualifications in French Canadian", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556257"}