{"title": "India Geo Product Marketing Lead", "summary": "The Product Marketing leader for India will own and drive Apple’s product centric marketing strategy in the market, and articulate the market ambition to deliver impact and growth...", "description": "-  Articulate the product opportunity in market and provide product insight and leadership from product introduction through end-of-life to both the Marketing and Sales organisations\n-  Lead the team to deliver product launches with excellence every time\n-  Own and drive the annual Marketing plan, outlining opportunities and actions that lead growth and category leadership, instilling quarterly and half yearly reviews on what’s working, what’s not\n-  Build high performing teams through coaching and developing talent. Actively develop an inclusive culture by recognising the value that different perspectives and cultures bring to the organisation\n-  Act as a primary liaison between Market and Worldwide teams for all local business needs and feature requirements, shaping strategic thinking and contributing to global initiatives and programs\n-  Influence product feature roadmaps, and make clear recommendations that improve the customer experience\n-  Devise and craft a singular market narrative to enable clear understanding of market dynamics, customer voice, opportunity and set actions that all key stakeholders understand, as well as defining a common geo voice into Worldwide planning\n-  Become a visible and vocal member of the senior Marketing management team as well as the overall Leadership Team in the geo, providing strategic input and influencing long term plans.\n-  Build a sphere of influence across multiple internal functions / divisions \n-  Be the guardian of product and segment messaging and positioning across every customer touch point, advancing the cause of excellence\n-  Possess expert knowledge of competitive and third party products and strategies. Make pricing and forecasting recommendations to management and cross-functional teams", "key_qualifications": "", "preferred_qualifications": "Master’s degree in Business, Information Technology or Marketing\nCreates competitive and breakthrough strategies that show a clear connection between vision and action.\nIntroduces new ways of looking at problems, encouraging diverse thinking to promote and nurture innovation.\nPlans and prioritises work to align with broader organisational goals.\nBuild effective teams that apply their diverse skills and perspectives to achieve common goals.\nAn instinctive ability to be the voice of the consumer\nExcellent analytical skills\nDepth of technical awareness\nStrategic planning expertise\nSuperior storytelling capabilities\nPresentation & negotiation skills\nSpoken and written English fluency", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559538"}