{"title": "Wireless Coexistence Software Engineer", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly motivated and self-directed individual who can excel in a fast-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it.", "description": "Apple’s Wireless Coexistence Software team is seeking talented, highly motivated and self-directed engineers to work across layers on cutting-edge wireless technologies including Cellular, Wi-FI and Bluetooth. You will collaborate with multi-functional hardware and software teams to gather requirements, understand interactions, and design as well as implement innovative solutions to complex multi-radio coexistence problems. Bring your knowledge in radio technologies and you will extend your expertise to understand multiple radio/sensor technologies. You will learn how they interact with each other and how they can successfully coexist in Apple products such as iPhone, iPad, and Apple Watch.", "key_qualifications": " ", "preferred_qualifications": "* Highly motivated and self-directed\n* Consistent track record of project deliverables from concept to commercialization\n* Excellent communication, collaboration, critical thinking, and problem-solving skills\n* Passionate, inquisitive, and driven to solve everyday problems in innovative ways\n* Laser-focused on the smallest details that are meaningful to our customers", "education_experience": "Bachelor's in Electrical Engineering, Computer Engineering or equivalent.", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540438"}