{"title": "ML Ops Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact the future of ML for Manufacturing here at Apple by developing an extraordinary platform? This position involves a wide variety of skills, innovation, and is a rare opportunity to be working on ground breaking, new applications of machine learning, research and implementation. Ultimately, your work would have a huge impact on billions of users across the globe. You can help inspire change, by using your skills to influence globally recognized products' supply chain. The goal of Apple's Product Operations organization is to take a vision of a product and turn it into a reality. Through the use of the scientific process, machine learning, and software engineering the team recommends and implements solutions to the most exciting problems. We’re looking for experienced software professionals with a passion for or expertise in machine learning to help us revolutionize how we manufacture Apple’s amazing products. Put your experience to work in this highly visible role.", "description": "As a member of the Machine Learning Operations and Infrastructure engineering team, you will collaborate closely with teams throughout the organization to design, develop and deploy advanced Machine Learning and data solutions utilized in the mass production of our exceptional Apple products. You will play a pivotal role in shaping the future of our intelligent manufacturing systems. Your responsibilities will encompass designing and implementing ML/data infrastructure, platforms, and solutions tailored to our specific needs. This will involve developing infrastructure and platforms that empower others and facilitate collaboration to address a wide range of challenges within dynamic production environments. You will also be actively involved in the hands-on implementation and deployment of Machine Learning systems within factory settings, ensuring seamless integration and operation. Additionally, you will explore opportunities within our production and development processes to leverage computer vision, deep learning, LLM, and other ML/software tools to drive continuous improvements and innovation.", "key_qualifications": "Solid software development skills in one or more general purpose languages such as Python, Golang, C/C++ or Swift, adhering to the best coding practices. Demonstrated experience in designing and developing production web services using Python or Golang. Proficient in network infrastructure, databases, telemetry, containerization and cloud technologies. Familiarity with data processing and ETL technologies, including NumPy, Pandas, Amazon S3, Kafka, Airflow, Kubeflow, Dataflow, etc. Proven ability to translate business requirements into design concepts. Basic knowledge of Machine Learning concepts and frameworks. Minimum 3 years of relevant experience.", "preferred_qualifications": "Effective communication and collaboration skills. Fluency in both written and verbal English. Good understanding of software engineering best practices.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553134"}