{"title": "Senior Houdini Technical Director", "summary": "Apple’s Human Interface VFX team designs product experiences, from early ideation all the way through to the shipping product. To ensure high-quality results, we work closely with other HI design teams, software teams, graphics engineers and product marketing.", "description": "We are in search of a Senior Houdini Technical Director to help us achieve the highest levels of photorealism in our designs. Using Houdini's procedural toolkit, you will be at the forefront of crafting complex shaders/materials, dynamic simulations, and artist-friendly tools for geometric optimization. The ideal candidate thrives in a dynamic, collaborative setting, constantly exploring the limits of next-generation technology and procedural content creation.", "key_qualifications": "10+ of production experience in procedural modeling, geometry processing & optimization, dynamic simulation and HDA generation for feature films, advertising or AAA games\nMastery in manipulating physical dynamics and lighting to achieve lifelike imagery through Houdini's node-based workflow\nDemonstrated ability to build complex, procedural network graphs that are easy to follow\nExpertise in developing advanced shading networks in Houdini, utilizing geometry data and math operations with an eye to realtime experiences\nProficiency in working with renderers such as Mantra, Karma, Arnold, or V-Ray, and familiarity with Solaris and USD composition\nVersatility in adapting content for various platforms, from high-end renderings to real-time assets, without compromising quality\nExceptional communication skills, capable of leading collaborative efforts across departments\nIndependent and driven, with a keen ability to adapt to new tools and workflows\nReel required", "preferred_qualifications": "", "education_experience": "BA/BFA in Digital Media, Visual Effects, Animation, or a related field, or equivalent professional experience", "additional_requirements": "Proficiency in VEX and Python scripting for automation and tool development.\nSolid understanding of other DCC tools\nExperience working with external art teams and outsource partners\nStrong leadership and mentoring abilities and interpersonal skills\nAbility to find creative solutions for technically challenging tasks", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548657"}