{"title": "Wi-Fi Automation Engineer", "summary": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience. If you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination.", "description": "You will join a dynamic Software Engineering team in the sensing and connectivity organization at Apple. The team is responsible for building and shipping quality wireless solutions across all Apple products. You will be delivering a detailed connectivity user experience to our customers. You will be responsible for development of test methodologies for validating the WiFi and BT FW software on RF modules and collaborate with cross functional teams for factory support. Other responsibilities include Continuous Integration, bot maintenance and crafting of test strategies using various test methodologies, building test setups, automating test framework / test cases and design documents to ensure the best quality in Connectivity for Apple products.", "key_qualifications": "Proficiency in Python and/or C/C++, Previous automation experience required. 3+ years of experience in CI, DevOps, SQA methodologies and practices. Experience in developing test strategies and executing it with automation or manual testing. Experience in WiFi and/or Bluetooth is a plus. Experience in root cause analysis, debugging complex problems and collaborating with cross functional teams. Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy. Laser-focused on the smallest details that are meaningful to our customers. Ability to write automation and automate existing test cases to improve efficiency.", "preferred_qualifications": "Experience with Wi-Fi", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553323"}