{"title": "Software Engineer - Location and Spatial Awareness", "summary": "Help craft the next generation of capabilities leveraging Apple location and spatial awareness technologies. Our team focuses are innovating, building, and productizing new ways for our devices to be spatially aware of each other, coupling different sensing technologies with sophisticated algorithms and AI/ML to enable new and more intuitive forms of interaction. We nurture new ideas from prototype to production, helping to establish hardware requirements and system design, conduct developmental testing, write production software, and track our results relative to physical and theoretical limits.\n\nThis role is for a strong and experienced software generalist to help architect and develop software at the daemon and framework level — someone who thinks carefully about architectural decisions, is disciplined and dedicated to doing it right the first time, and is passionate about continuing a culture of software excellence in both developmental and production software.\n\nShape the next generation of location-aware mobile experiences by working on state-of- the-art technologies to seamlessly integrate people’s digital and physical lives. If you're passionate about building technology that will make a difference, we may be the team for you.", "description": "Join a team which designs, implements, and powers brand new technologies and services on the world's fastest-growing mobile development platform. We are looking for a highly-motivated and creative Senior Software Engineer with a strong background in Computer Science to help develop new technologies for special projects on the location\nservices team. Our special projects target innovative new signals and technologies to enhance location-aware user experiences.\n\nArchitect and implement production software systems for new technologies, fusing them with existing capabilities, and bringing new experiences to our users. Collaborate with developers on other iOS teams to architect the full iOS solution. Design and implement full-stack technologies integrating wireless technologies to solve real-world problems. Participate in brainstorming and evaluating new technologies as iOS continues to evolve.", "key_qualifications": "Strong software generalist and experience with object oriented languages (C++, Objective-C)\nExperience shipping production software\nDeep understanding of software design paradigms, and software development\nbest practices\nAbility to architect and implement software for technology evaluation, prototyping,\nand production\nStrong interest in location and/or RF-related technologies\nExcellent collaboration skills\nAbility to design and debug complex systems\nStrong creative problem solving skills\nA passion for programming and building things\nExperience with data analysis and results dashboards a plus\niOS, OS X, application, and/or unix system development a plus\nFamiliarity with basic signal processing techniques a plus", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Takes initiative to address new problems and responsibility for the results\n• Passion for actively learning new skills, techniques, and programming languages/\nlibraries/frameworks.\n• Thrive in a collaborative environment and communicate effectively.\n• Creative and inquisitive, seeking to solve everyday problems in innovative ways.\n• Laser-focused on the smallest details that are meaningful to our customers.\n• Desire to be exposed to all aspects of development; prototyping, planning,\ndesigning, productizing, launching, and scaling", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509127"}