{"title": "Software Engineer, Information Systems & Technology", "summary": "Apple is a place where extraordinary people gather to do their best work! Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job!", "description": "As a Software Engineer you will be responsible for building and enhancing the next generation of Apple’s IS&T Platforms and Applications. You will be part of an Agile team and partake in every aspect of the product, from planning to design to implementation and documentation. You will work with project managers and technical teams in a multi-functional environment to implement quality products that meet the business goals. The ideal candidate will be self-motivated, pro-active and solution oriented. Attention to detail and dedication to providing a high-quality, stable delivery are essential.", "key_qualifications": "3+ years of experience in designing and developing scalable enterprise level back end solutions. Proven skills and Hands-on programming experience in Java, Spring, multi-threading, REST, Data Caching Services, DB schema design and data access technologies. Hands-on with design, development, and deployment of enterprise systems.", "preferred_qualifications": "Excellent analytical and quantitative skills. Experience in working in a large enterprise, with a global environment, across multiple timezones and geographies. Excellent communication and collaboration skills and ability to multi-task. To be successful you are self-motivated; driven to achieve and go above and beyond. Experience in working with No-SQL Databases: Cassandra, MongoDB, etc. Experience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clients. Understand security concepts and build reliable and safe distributed applications. Solid knowledge of applications performance improvement techniques and caching solutions. BS or MS degree in Computer Science, Information Management, or equivalent.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558942"}