{"title": "Fitness Tester", "summary": "Join our Location team and drive innovation that matters. We create and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you're passionate about building technology that will make a difference, we may have the job for you. The Location team works on the next generation of location technologies on iOS, MacOS, tvOS and the revolutionary Watch. In this position, you will be a key player collaborating with the development team to help conduct experiments to collect test data and validate them for upcoming innovative location features. You'll be part of a highly high-energy team that has delivered amazing location technologies such as GPS, Indoor Location, iBeacon, Auto Unlock of Mac and many more. Our team is seeking a motivated, highly technical and comprehensive individual to help us build the best location experience for our customers.", "description": "As a Manual Tester, you will be responsible for running tests on iOS/tvOS/watchOS/macOS devices, report issues that are found, and follow up to verify they are fixed. You will also be implementing experimental protocol operating with different kind of measurement systems and report the results in a timely manner. Works on assignments that are moderately difficult, requiring judgment in resolving issues or in making recommendations. Be able to work independently once the task is assigned and execute them to excellence", "key_qualifications": "", "preferred_qualifications": "BA/BS Engineering, Passion for fitness", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $46.80 and $78.05/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558887"}