{"title": "Apple Support Business Analyst", "summary": "The most admired companies in the world have one thing in common: they stand for something. The world can change, the market can change, their products can change - but their core beliefs remain the same. At Apple, we've spent the last few years affirming the values we've always stood for: a real passion for design and an unwavering belief in the power of human creativity. You can see it reflected in everything we do and even more so in our people. Apple Support Analytics is looking for an intensely curious, analytically-oriented professional to join us in a senior business analytics role!", "description": "You will be change maker and influencer. Demonstrating a passion for conducting research, answering high impact business questions with data, and presenting findings and recommendations to key decision-makers across the region and globally. Partner with senior leaders to drive action that improves contact centre efficiency, quality, and productivity. Use your expertise, strategic mindset, and business acumen to offer recommendations for actions that drive cost-savings and significant business improvements. You will have extensive experience in communicating with collaborators across all levels of the organisation, and will have the passion to stand behind their recommendations which are based on advanced analytical and statistical techniques.", "key_qualifications": "Highly experienced and analytical, with the ability to articulate quantitative and qualitative insights that influence business leaders to take action that improves business performance. Excellent communication and influencing skills. Expertise in advanced analytical techniques and statistical analysis. Scrupulous attention to detail and desire for end-to-end ownership of work you're doing. Self-motivated, driven individual who is comfortable working in a global, fast-paced, often ambiguous environment with the ability to work with multiple multi-functional teams. Strong business acumen and consumer focus with demonstrated ability to think strategically and act tactically, with a solid sense of urgency to resolve issues. Outstanding written, verbal, and presentation skills with the ability to develop and present conclusions and recommendations to senior management. Comfortable supporting, collaborating and communicating with senior management and a demonstrated ability to build strong working relationships through active listening, delivering promised results, and establishing trust. High level of integrity, energy and sense of urgency to “make things happen”. Great teammate with a positive attitude, solid sense of empathy and ability to make decisions. Strong technical expertise in SQL, Tableau, Python, and other data science tools (preferred). Lean Six Sigma expertise (preferred)", "preferred_qualifications": "", "education_experience": "Bachelor or Master’s degree in a field related to analytics, such as Operations Research, Statistics, Econometrics preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546591"}