{"title": "Sr. RF System Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. In this role, you will be part of the RF system engineering team responsible to specify, develop and validate state-of-the-art wireless silicon for application in Apple’s products.", "description": "- Develop complete RF specifications governing silicon and module-level designs, working with partner teams in - Platform Architecture, Product Systems, PHY Algorithm Systems and RFIC Design.\n- Develop innovative RF architectures to achieve best-in-class performance, power, and area.\n- Introduce RF system features with digitally enhanced innovations.\n- Produce RF line-up specifications in close collaboration with the RFIC design team to guide the development of new radio designs.\n- Develop and maintain infrastructure for system-level simulation and system verification to ensure first-time design success.\n- Validate silicon and drive any required revisions to achieve compliance with all RF system specifications to meet full system performance.\n- Support the delivery of new wireless technologies to the Product Systems teams.", "key_qualifications": "Industry experience in RF system specifications, developments and validations is a must.\nRF system engineering, including familiarity with RF transceiver architectures, line-up analysis and performance budgeting and simulation.\nWorking knowledge of RFIC architecture, design concepts and techniques.\nDeep Understanding of key RF performance metrics (e.g. NF, IP2, IP3, dynamic range, EVM, ACLR, etc.) and the tradeoffs involved in practical approaches to achieving high performance.\nFamiliarity with wireless / cellular standards, such as those found in IEEE 802.11, 802.15, Bluetooth or 3GPP.\nHands on experience with RFIC System validation methods and test equipment.\nWorking understanding of communications theory and signal processing algorithms.\nWorking understanding of digital architecture principles.\nStrong working knowledge of MATLAB, SimuLink, SystemVue, or ADS.\nPrior experience working with cross functional teams: RFIC Design, RF SiVal, PHY, System and System Validation.\nFamiliarity with Python coding is a plus.\nGood communications skills – both written and oral.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience. MSEE and or PhD is preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503081"}