{"title": "Emulation Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, inspiring, and innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it.", "description": "As a member of the team, you will be involved in: - SoC bringup on emulation, root cause failing SoC/Processor tests and emulator environment issues - Support multiple Emulation environments using the latest emulation techniques: - C/C++ DPI Transactors, SV assertions, Coverage, Power Estimation, SpeedBridges, Accelerated UVM Testbenches - Close collaboration with Design, DV, Power, Silicon Validation, Performance and Software teams. Strong design, debug, communication and teamwork skills are essential - Work with the top tier emulation vendors to improve capabilities, debug issues", "key_qualifications": "", "preferred_qualifications": "Experience with UVM verification environments\nDesign verification, DFT , TestBench modeling experience\nKnowledge of communication/Interface protocols, like (PCIE, USB ), DDR, SPI\nStrong communication skills and ability to work as a team", "education_experience": "Bachelor's degree and a minimum of 3 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536773"}