{"title": "HID - Sensor ML Algorithm Engineer", "summary": "Be part of the engineering team crafting next-generation hardware user experiences, through sophisticated algorithms. We are looking for an algorithm engineer with a solid understanding of signal processing, statistical modeling and algorithm development for embedded systems. The ideal candidate has strong programming skills, ideally with some familiarity in human computer interaction. Any experience in control systems, machine learning, algorithm design for HW and user interface design will broaden your role and efficiency.", "description": "This is a key position at a focal point for HW/SW/UI integration. This engineer will explore architectural improvements for multi-modal input such as multi-touch and gestures. HID algorithm engineers combine skills from a variety of fields to tackle sophisticated data processing and sensing challenges. The process starts early in a product’s lifecycle as we explore what might be possible, continues as we rapidly iterate on cleaning and analyzing data, and building and testing algorithms, and finishes with detailed implementation and analysis. You should have excellent mathematical skills and experience working with algorithms and data, be proficient at programming, and have a desire to work closely with others in a multi-functional team. In return, you will get to work in ambitious and captivating problems with dedicated co-workers, and ship phenomenal solutions at scale.", "key_qualifications": "Exceptional expertise in algorithm development for signal de-noising, gesture/touch recognition, target tracking, or related applications. Ability to build mathematical/heuristic models, including prototyping in a high-level language (e.g., Python, MATLAB,…). Experience with filters, statistical signal processing and numerical linear algebra. Strong background in physics, and experience with embedded systems. Experience with both classical and deep learning Machine Learning, or the mathematical fundamentals to enable this. Proficiency in Python programming, quality software design practices, and the use of a version control system", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "Developing data processing pipelines. Investigating new technologies, prototyping concepts, evaluating user impact, and delivering products. Support cross functional teams to ensure developed algorithms meet design intent at large scale. Track record of developing new algorithm ideas to translate human interactions to human intent, as shown by publications, patents or open-source projects (preferred). Experience in human computer interaction (HCI) space", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546199"}