{"title": "Software Engineering Manager, Health", "summary": "“I believe, if you zoom out into the future, and you look back, and you ask the question, ‘What was Apple’s greatest contribution to [hu]mankind?’ it will be about health.” – Tim Cook, 2019 Health is a diverse, talented, and passionate team working on health features at the center of Apple’s strategy to improve how people manage their health, and are helping our users live healthier lives. Our team, Health Experiences, focuses on end user experiences to help people better understand their health. We have previously built features like Cycle Tracking, ECG, Irregular Rhythm Notifications, Heart Rate, Sleep, and Mental Wellbeing. We’re looking for an exceptional software engineering leader to guide the development of new health software features on iPhone, iPad, and Apple Watch. This is an opportunity to help a small team of bright engineers to build rich experiences and participate in shaping our product roadmap. This team expects and encourage engineering excellence. Come join us in creating solution that will delight our customers.", "description": "As manager of the team you’ll have the opportunity to work with experts in their field to build new and expand on existing Health features on iPhone and Apple Watch. This position requires a self-motivated individual with strong technical, communication, and project management skills to handle responsibilities including: -  Defining product features, functional specs, resource planning, and development schedules -  Scoping and prioritizing features and bug fixes -  Representing the team and its technology in technical and project meetings -  Advise and encourage engineering best practices to deliver quality features -  Define and grow a diverse and world-class engineering team", "key_qualifications": " ", "preferred_qualifications": "Passion for and prior experience designing and implementing outstanding user interfaces and customer experience, Highly organized, someone who thrives working in a fast-paced environment, and loves learning new technologies, Development experience on watchOS or similar, Obsessively passionate and inquisitive, and seeks to solve everyday problems in innovative ways, An understanding and passion for wellness or medical concepts, BS Computer Science or equivalent experience", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550355"}