{"title": "Display Engineer", "summary": "Imagine what you could do here! At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nApple is searching for a candidate on display hardware development and validation for the next generation Apple products, as well as future display technology research and development.\n\nThis individual will serve as a focal point in managing new display technology development and drive the implementation of technology platforms to final products. You will involve in system modeling to assist in the design and validation. You will work with a diverse and multi-disciplinary group of colleagues. As a directly responsible individual, you will collaborate with cross-functional teams and suppliers to understand design tolerance and sensitivities, optimize system level performance base on critical metrics, and validate system designs through engineering builds and design of experiments.\n\nA successful candidate needs to be comfortable with new technology, a flexible problem solver, meticulous attention to detail, highly independent and motivated to get results. You should be able to tackle problems outside of your respective technical area, have strong presentation and communication skills, and can thrive in a highly dynamic, agile, multi-disciplinary and hands-on environment that values engineering excellence and innovation. You will be part of something big, come join us!", "description": "- Define overall optical and module architecture and requirements, and drive rigorous validation plan to meet display performance target\n\n- Identify critical metrics impacting display performance, analyze experimental and build data, present analysis summary to management\n\n- Drive issue failure analysis and corrective actions, communicate with broader team on pros, cons and risks associated with any proposed solution, drive implementation of the solutions\n\n- Collaborate with cross functional team, drive display module design convergence, and deliver the display product\n\n- Investigate new display technologies, perform detail tradeoff studies, and generate new approaches to further enhance display performance", "key_qualifications": "1-2 expertise subsets of the following fields are required: optics, physics, electrical engineering, optical components (lens, film, thin film coating etc), image processing, machine learning, computer science.\nDeep understanding of one or more of the following display technologies, i.e. TFT, LED, OLED, optical fundamentals, display system, etc.\nProficiency of using statistic tools (JMP etc) and programming languages (MATLAB, Mathematica etc) and optical simulators (LightTools etc) to tackle practical engineering problems\nStrong analytical & critical thinking, and problem-solving skills.\nHands-on experience in high volume mass production consumer electronics, display related system strongly preferred.\nExperience in working closely with cross-functional teams, as well as with overseas suppliers, is preferred.\nConcise & effective verbal and written communication and presentation skills in English.\nAble to travel overseas.", "preferred_qualifications": "", "education_experience": "Bachelors or above in optics, physics, EE, or related fields with minimum of 3 years of experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544084"}