{"title": "ML Data Scientist - Computer Vision", "summary": "Do you have a passion for computer vision and deep learning problems? Are you interested in the latest development of the multi-modal models? The Data Analytic and Quality (DAQ) group is seeking a Machine Learning Data Scientist to specialize in the evaluation of GenAI models. This role involves collaboration with teams at Apple passionate about developing foundation models, including ML engineers, data scientists, and ML Infrastructure engineers.", "description": "Your primary responsibilities will include developing methods for the evaluation and improvement of foundation models, as well as refining the data used in training them, applying data centric AI approaches:\n\n-Design and develop image/video analysis (ROI, SOD, content classification, artifact detection, etc.) and quality assessment algorithms\n-Participate in crafting testing strategies and solutions for E2E quality evaluation with a combination of image/video analysis, processing, and encoding algorithms\n-Conduct detailed failure analysis on large GenAI models and machine learning models in different aspects like Operational/Ethical/Security & Privacy\n-Work with developer teams to define and request data to ensure the data coverage\n-Prototype novel evaluation and benchmark methods from foundation model literature research\n-Develop tools for analyzing and visualizing data\n-Design and implement experiments (DOE) for engineering studies and large-scale user studies and analyze results\n-Facilitate and support data collection and analysis in collaboration with other groups\n-Contribute to defining feature specifications and anticipated user experience based on data insights", "key_qualifications": " ", "preferred_qualifications": "Familiarity with various foundation models in GenAI, like VAEs, Transformers, Diffusion Models, NeRF, CLIP, etc.\nExpertise of video analysis algorithms or subjective/objective video quality algorithms, and pioneering technologies\nExpertise in photography, videography, or image science and a passion for learning more\nExperience in training models using frameworks like PyTorch, TensorFlow, Jax, etc.\nProficient in distributed systems and a good understanding of operating systems\nExpert in at least one scripting language, preferably Python\nSelf-motivated and curious with demonstrated creative and critical thinking capabilities and a highly developed aim to improve how things work\nProficient verbal and written communication skills, along with strong collaborative abilities", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560272"}