{"title": "Mechanical Systems Design Engineer", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Are you up for the challenge? Apple’s Measurement R&D group is recruiting Mechanical Systems Design Engineer with mechanical and automation design experience, strong communication and technical leadership skills.", "description": "-  Automated measurement system development and optimization from ideation to deployment. -  Detailed mechanical design of manual and automated measurement and calibration systems (including component and materials selection, 3D/2D CAD, mechanism design, FEA) -  Collaboration with vendors to develop measurement systems and improve manufacturing and metrology capabilities and processes -  Management of vendor prototyping schedule and manufacturing plan -  Support new product failure analysis and continuous improvements in product manufacturability and performance, contributing to the production of the highest quality products available -  Support new vendor development to expand Apple’s vendor base with regards to capability, capacity, and geographical influence -  Requires up to 50% China domestic and international travel to support equipment design, deployment, and validation", "key_qualifications": " ", "preferred_qualifications": "-  You have excellent communication and interpersonal skills -  You love stress-strain relationships, static mechanics (determinate and indeterminate systems) -  You get excited about kinematics and mechanism design -  High volume electronics manufacturing equipment design, including structures, sheet metal, plastics, fixture/mechanism design, robotics, probe design, plating materials and thermal design is a plus -  UG NX experience preferred -  FEA (stress analysis) highly desirable, ANSYS preferred -  Plastic part design, molded part design highly desirable -  Metal and plastic materials science, tribology and wear principles highly desirable -  Project and product management experience strongly preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540829"}