{"title": "Mac Product Marketing Manager, Apple Southeast Asia", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!", "description": "Provide Mac product leadership from product introduction to end-of-life for our Southeast Asia business, supporting business and marketing reviews as needed. Support Mac, macOS and Pro Apps launches with press, partner and customer-facing staff. Contribute to the annual research and marketing plan, articulating and validating the opportunity and priorities for the overall Mac category across key Southeast Asia countries, subsequently driving and supporting in-market execution as needed. Liaise with worldwide Product Marketing and Engineering teams on relevant local business needs and feature requirements, influencing the product roadmap through clear recommendations that improve overall customer experience across hardware, software and services. Become a visible and vocal member of the international Mac Product Marketing team. Be the guardian of product messaging and positioning across all key customer touch points, advancing the cause of excellence. Possess expert knowledge of competitive and third party products, applications and market trends across related consumer, enterprise and education segments", "key_qualifications": "Superior storytelling capabilities, presentation and negotiation skills, with strong oral and written communication in English. 7+ years experience in product marketing or other marketing disciplines, preferred but not limited to computer, creative pro apps, software and/or internet services industries. Excellent analytical skills and strategic planing expertise, with deep technical awareness and knowledge of industry trends. A self starter with the ability to continually prioritize and multi-task in a dynamic, creative, matrixed and fast paced environment. Prior work with international teams in a multi-national company, in roles that require technical fluency and the instinctive ability to be the voice of the consumer. Flexibility to travel (up to 50% of the time)", "preferred_qualifications": "", "education_experience": "Bachelor’s degree required. MS/MA/MBA preferred but not conditional.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547921"}