{"title": "EMIR / Power Integrity Engineer", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there is no telling what you could accomplish. Multifaceted, amazing people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our multifaceted group, you will have the outstanding and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. We are in search of a Power Integrity Engineer for our special Physical Design team developing SoCs for Apple’s mobile devices. Are you ready and excited to be responsible for all power integrity analysis of our large scale SoCs? Dynamic, inspiring people, and innovative technologies are the norm here. Join us!", "description": "Responsibilities include especially, but are not limited to: You will perform power integrity analysis using Apache Redhawk and/or Voltus, provide feedback, and recommend supply noise design solutions. You will develop procedures, analysis, and design automation methodologies for power integrity challenges. You will assists in defining on-chip power grid and power switch solutions.", "key_qualifications": "", "preferred_qualifications": "Proven track record using Apache Redhawk and or Voltus IR/DVD tool set. Proven experience in silicon (on-chip) and package power delivery network principles. Knowledge in high frequency power integrity simulation and analysis. Demonstrated ability in signal and power electro-migration simulation and analysis. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.", "education_experience": "B.Sc / M. Sc Electric Engineering / Computer Engineering, Ability to fluently speak & write in English.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517061"}