{"title": "SoC Silicon Debug Engineering Program Manager", "summary": "Do you want to use your engineering background to make a huge impact? Can you influence, connect, get results, and communicate optimally? Come to Apple and work within a dynamic team to deliver innovative silicon technologies that enable the world’s best products for our customers.", "description": "In this high-profile role you will be responsible for the following:\n-  Work on a PM team responsible for driving technical issue resolution to enable on time silicon to meet daring product schedules.\n-  Drive internal program process to guarantee high-quality silicon execution.\n-  Interface and drive silicon issues across multi-functional teams: Design, Verification, Validation, Technology, System Hardware and Software.\n-  Focus silicon team on meeting near term work and unblocking technical issues by pulling together the right multi-functional technical expert(s) to resolve issues with data based decision-making.\n-  Attend and drive technical sessions with suppliers/design partners to track & follow-up issues/escalations.\n-  Focused issue reporting, bug tracking and communication of program risks & status.", "key_qualifications": "Proven track record in SOC / VLSI Chip Design, DRAM, Product Engineering.\nTechnical program management / vendor management experience.\nExperience in silicon validation or qualification of ASICs.\nExperience with ARM architecture and leading silicon projects from concept to production is considered a plus.\nExtraordinary leadership skills and ability to encourage and influence team members with an innate ability to see the bigger picture.\nPassion to own/drive project development using well-defined metrics.\nExperience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking and real-time crisis management.\nThrive in multifaceted schedule driven development environment.\nAbility to understand and extract action plans from sophisticated technical discussions and translate into succinct messaging for multifunctional and executive status reporting.\nExcellent debugging skills. Shown ability to drive resolution of critical problems.", "preferred_qualifications": "", "education_experience": "BS + 10 years of relevant experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525843"}