{"title": "Engineering Program Manager, Retail Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! IS&T Point of Sale (POS) Engineering team is responsible for the technology and solutions used to enable Apple Retail Store to service millions of customers across the Globe. While in POS, every day is a new innovation.", "description": "We are looking for a hands-on Technical Project Manager who will be involved in business requirements analysis, functional and technical design discussions, testing, working with key strategic partners, and more. This is not a task-based job. We are looking for someone to be responsible for the delivery and success of your features. We are looking for someone who can drive and ship all aspects of large, cross-functional projects and feature areas. In this role, you will oversee all aspects of multiple concurrent projects including scope, requirements, timelines, risks and resource allocation. We need someone who can lead communication — apprising status and issues to team members, management and other project partners. Our ideal candidate can demonstrate integrity, energy and feel comfortable in a multifaceted environment. As an expert change leader navigating uncharted technology advancements, we need someone to build strong collaborative relationships and calmly manage conflicts along the way. This person will be responsible for successful outcomes and delivery with laser focus on execution with a keen eye for the important details. If you relish challenge and are inspired by working with a great team on amazing new technology, then we want to hear from you - please apply!", "key_qualifications": "", "preferred_qualifications": "MBA degree and/or Industry recognized Certified Scrum Master, Project Management Professional certification; Familiarity using project management software such as Jira, Rally, Trello; Retail Systems or Retail Store experience; High sense of personal ownership, with a self-motivated and hands on approach; Ability to operate well in an environment with rapid development cycles and constant changes; Able to focus and simplify, balancing the details with the high-level goals to make accurate prioritization decisions and trade-offs; Excellent spoken and written communication with the ability to tailor communication style to multiple audiences; Possess strong facilitation skills (requirements sessions, design meetings, demos, progress and status meetings)", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556960"}