{"title": "WW Education Senior Manager, Customer Success Programs", "summary": "Imagine what you could do here. The people here at Apple don’t just create products —they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "As WW Education Senior Manager, you will oversee Apple’s global education sales programs, including Apple Professional Learning, Apple Distinguished Schools, Authorized Training Centers for Education as well as any future pre- and post-sales education Customer Success programs.", "key_qualifications": "Typically requires minimum of 15+ years of related experience. 8+ years of people leadership experience focused on teacher professional development, indirect channel development, advocacy programs, and/or education systems. Extraordinary knowledge of the global Education vertical, including go-to-market strategy, customer profiles, market trends and challenges, key use cases, associated solutions, and competitive landscape. Experience designing and managing education programs. Bachelor’s degree or equivalent experience is required.", "preferred_qualifications": "Background working with channel partners and/or supporting multiple routes to market is highly preferred. Deep knowledge of the Apple education ecosystem and high level of proficiency with Apple products and services is a plus. Ability to build, lead, and develop inclusive teams and attract and retain talent through performance management, coaching, guidance, and support. Outstanding communication and presentation skills. Ability to motivate and inspire others, articulate vision and purpose, and advocate for Apple’s values. Excellent collaboration and relationship building skills, including the ability to influence cross-functionally, navigate organizational structures, and manage complex relationships. Strong negotiation skills with the ability to gain alignment on program objectives and priorities with senior leaders. Comfort with ambiguity and the ability to bring structure and clarity where none exists. Experience managing a remote/geographically dispersed team is a plus. Advanced degree in Education is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $211,800 and $317,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555604"}