{"title": "Cellular RF Hardware Design Engineer", "summary": "The Cellular RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will be responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required.", "description": "This RF Hardware Design Engineer will: \n-  Architect RF front end designs to realize our wireless product requirements\n-  Perform RF system lineup analysis to ensure our system designs meet industry and internal standards\n-  Create and maintaining specifications for RF components and drive component development with vendors\n-  Be involved with schematic capture and PCB Design\n-  Integrate our cellular radio platforms into Apple products", "key_qualifications": "BSEE with 3+ years of directly relevant experience\nExperience with radio hardware design and/or RF component design\nFamiliarity with the challenges of development for high-volume manufacturing\nHands on experience with RF circuits and hardware on the lab bench\nUnderstanding of core technologies and physics that drive innovative RF performance.\nProficient in wireless communications standards, wireless technology and communications market trends.\nExcellent written and verbal communicator, proven track record of working in a dynamic multi-functional team.\nWell organized and have the ability to be flexible in a changing work environment.\nCellular Handset experience (preferred, not required)\nExperience with RF simulation tools (ADS, HFSS, Matlab) (preferred, not required)\nExperience with Python for test setup automation and data analysis (preferred, not required)", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200510276"}