{"title": "Sr. Software Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple's Manufacturing Systems & Infrastructure (MSI) team is responsible for gathering, consolidating and tracking all manufacturing data for Apple’s products and modules worldwide. This data is used throughout the company and the product's lifecycle, from the very beginning, to validate that units being built are fully tested and of high quality before leaving the factory, all of the way through to warranty support for customers. Apple's MSI team is seeking a Senior Software Engineer who possesses a real passion for developing extraordinary products with a deep appreciation for user experience. We are looking for a passionate and results-oriented Sr. Software Engineer to join our team and work on some of the highly visible data projects in Operations organization!", "description": "In this role you will be responsible for defining and developing ML Platform and frameworks for generative AI powered applications at Apple Product Operations. You will be responsible in crafting, developing and maintaining our large-scale systems, storage, and integration services. You will collaborate with diverse cross-functional partners, including model developers, machine learning systems engineers, data scientists, application developers and product managers. You will work closely with the SRE team and develop monitoring and alerting on various applications and systems integrations. You will have the opportunity to learn and work on the latest technologies, lead POCs to demonstrate new ideas and influence the future direction of our technology stack", "key_qualifications": "", "preferred_qualifications": "Deep experience developing large scale distributed computing systems. Experience in crafting, implementing and supporting highly scalable systems. Familiarity with embedding, retrieval algorithms, agents, data modeling for vector development graphs. Experience supporting infrastructure for LLM and other related frameworks like Langchain, LLamaIndex. Experience building cloud native platforms using containerization technologies like Kubernetes, docker, helm and well versed in AWS/GCP or Azure. Adept at quickly grasping and distilling highly complex matters into clean, understandable solutions. Self directed, self motivated and detail oriented with ability to come up with good design proposals and thorough analysis of production issues. Ability to thrive in a multi-functional team on high profile, critical projects", "education_experience": "Bachelor’s degree or in Computer Science, Engineering or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547992"}