{"title": "Cross Functional Test Lead, IS&T, EMEIA", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The IS&T Retail Systems is looking for a Senior Cross Functional Test Lead to join our group. In this role you will be responsible for planning, coordination, execution, and continuous improvement of processes for end to end integration testing.", "description": "This position demands a self-motivated individual with strong technical and interpersonal skills who can contribute in a team environment. This candidate must be able to create and present risks and mitigations to Senior Management. Day to day work involves the following: Manage/Lead testing efforts for multiple cross functional retail projects with concurrent timelines Establish QA standards, guidelines, technologies, and approaches for the projects and for the testing team Manage and coordinate onsite and offshore testing team activities Actively participate in development and execution of test processes, strategies, and plans Work with Automation Lead to reduce regression test cycles with goal of 100% automation Work with the business, technical project development teams, and project managers to establish project development schedules and execute test plan to deliver high quality product releases", "key_qualifications": "Empty", "preferred_qualifications": "Possesses the skills necessary for working closely with the engineering team during all aspects of the development process. In addition, this position requires someone who is ‘very detailed oriented’, inspire and lead a team of talented individuals, and can work in a fast-paced testing environment. This position will require not only Leading but also should be hands on and ready to work independently on other projects assigned. Must also be flexible to support projects being lead in different timezones and regions globally.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555394"}