{"title": "CPU Performance Architect - Platform Architecture", "summary": "Do you have an uncommon desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do isn’t easy, but you don’t take the easy path. We are seeking a highly motivated, innovative, and confident individual to join the CPU Architecture and Performance Team; we are a group that is driving advanced exploration for next generation iPhone, iPad, and Mac CPU architectures.", "description": "As a CPU Performance Architect with a focus on CPU micro-architecture, you will be part of a team that is pushing the boundaries of innovation in the areas of branch prediction, code/data prefetchers, novel prediction schemes to improve latency and optimization of CPU pipelines. With others, you will seek out areas for improvement while collecting data and measurements that either confirm the idea or rule it out. You will collaborate with experienced CPU designers in micro-architecture and RTL to assess the feasibility of ideas through modeling and refine those ideas to make them implementable. The role requires the analysis of specific single-threaded and multi-threaded workloads across existing and new product categories to identify bottlenecks and opportunities for improvement. We collaborate as a larger CPU architecture and performance team to maintain and improve the simulation environment to enable data driven decisions and look for ways to boost the productivity of the entire team.", "key_qualifications": "Minimum requirement of a BS degree\nKnowledge of CPU architecture and micro-architecture\nAbility to combine micro-architecture knowledge and performance bottleneck analysis on relevant workloads to conceive novel performance ideas\nExperience working with design and implementation teams to iterate on ideas to solve timing and power efficiency challenges and fit them into system constraints\nFamiliarity with performance and/or power simulation environments and ability to take ideas from concept to C/C++ simulator implementation.\nExperience in scripting languages such as Perl or Python", "preferred_qualifications": "15+ years of relevant industry experience\nMS or PhD in Electrical or Computer Engineering or Computer Science\nUnderstanding of common data structures and algorithms\nKnowledge in software design patterns\nFamiliarity with SIMD and vector architectures\nKnowledge of OS internals and compiler technologies\nComfortable in an environment of uncertainty and able to work through ambiguities\nCommunication, influence and negotiation skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560322"}