{"title": "Regional Supply/Demand Planner", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? People here at Apple don’t just create products - they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do! We are looking for forward-thinking individuals who will be tasked with leading all aspects of Supply and Demand Management (SDM) for a number of our Product Lines.", "description": "Analytical - Liaise with Sales, Sales Finance and Worldwide planning to balance supply &amp;/ demand for the region. Forecast end consumer demand for all channels. Evaluate associated risks and plan for contingency. Develop weekly and quarterly supply and demand plans to meet Apple’s financial objectives. Present forecast performance while highlighting changes in business trends in order to drive strategy conversations. Analyse product sales on a weekly basis to recognize opportunities and drive cross-functional partners on both supply and demand side to maximise end consumer sales. Work closely with cross-functional teams to execute plans. Driving Strategic Objectives - Drive analysis to set launch quantities of new product introductions and to ensure smooth product transitions. Identify improvement opportunities in the product planning process, marshal resources, and drive projects to completion. Track &amp; improve key metrics through process development. Complete root cause analyses and develop mitigation plans for any unexpected changes. Present regular product updates and recommended actions to Operations leadership.", "key_qualifications": "Demonstrated experience in supply chain/planning/forecasting/analytical role. Strong data analysis and numeric skills. Practical and enthusiastic approach to problem solving and process improvement. Solution oriented analytical planning skills. Strong work ethic, perseverance and flexibility. Organised and able to react to the challenges of a fast-paced environment. Excellent communication, interpersonal and negotiation skills, both written and verbal. Ability to build effective relationships in a cross functional team environment. The ability to deliver quality work to tight deadlines. Proficiency in at least one MRP system and strong Excel Skills. A self-starting, innovative individual who also can work as part of a team.", "preferred_qualifications": "", "education_experience": "-  Masters/Bachelors degree ideally, however if you have relevant experience, you are encouraged to apply! -  Prior experience in fields that demand multiplex quantitative analysis such as finance or consulting is desired. -  Prior experience in product planning, production control, inventory management, and/or production/manufacturing operations is preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533711"}