{"title": "Senior Layout & Rendering Engineer", "summary": "As a WebKit Layout & Rendering Engineer, you will ensure the best possible user experience on the web. Collaborate with people from around the world to develop new CSS and HTML Web Standards and design APIs for Web Developers. Work on an Open Source software project to develop new designer and developer facing features while maintaining quality, performance, and security.", "description": "The WebKit Layout & Rendering team is looking for an engineer who loves solving problems with their team. Design and implement changes to the rendering engine to deliver improved security, better performance, and new designer and developer features. Collaborate with teams across Apple that display HTML and CSS content (ex. Books, Mail).", "key_qualifications": "Modern C++ programming, Ability to architect code for correctness, readability, maintainability, and performance, Experience finding and correcting bugs in a large code base, Experience with Web technologies such as HTML, CSS, and JavaScript, Experience leading projects and mentoring teammates, Interest in typography, graphic design, visual layout, or geometry.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or equivalent education or work experience", "additional_requirements": "Engineers often build successful careers on the WebKit team without prior experience working in web browsers. Some advantageous skills include experience with art, graphic design, visual layout, or geometry, creating demos and reduced test cases, debugging and profiling, experience with the UIKit, AppKit, or graphics frameworks, experience working on a developer facing product, and collaborating with the team to cultivate good engineering practices and team culture.", "pay_benefits": "At Apple, base pay for this role is between $175,800 and $312,200 and will depend on skills, qualifications, experience, and location. Employees also have the opportunity to become an Apple shareholder through stock programs, receive benefits including medical and dental coverage, retirement benefits, discounted products and free services, and reimbursement for certain educational expenses. The role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551818"}