{"title": "Software Development Manager - Wireless Technology Ecosystem (WTE)", "summary": "Do you have a passion for invention and challenge? The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join our Wireless Technology Ecosystem (WTE) team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you're passionate about Embedded Security Development and want to work on the world's most groundbreaking mobile payment systems, then we may have the job for you!", "description": "The Wireless Technology and Ecosystems group is looking for an extraordinary, hands-on Software Development Manager to join our Secure Element team. As part of this team, you will manage a team to architect, design, and develop new features for Apple products. You will work with multi-functional teams driving products from conception, design through execution and delivery. We are looking for a self-starting, daring individual who is not afraid to question assumptions or charge head-first into grey areas. Excellent written and interpersonal skills are a must to collaborate in our environments. You should have in-depth experience developing embedded system, EMV point of sale solution and kernels, and secure element knowledge a plus. We partner with a variety of multi-functional teams across the company as well as external partners. Be ready to make something extraordinary when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have invented and defined entire industries with our products.", "key_qualifications": " Proven ability, with a minimum of two years in a lead or management role on payment solutions, JavaCard Applets, or secure elements\n Experience in software development with a focus on Java/Python projects\n In-depth understanding of the EMV payment system and Point of Sale terminals\n Strong design and analysis skills\n Strong sense of responsibility, willingness to take ownership and set direction\n Facility working collaboratively with multiple teams on different aspects of the project\n Ability to move seamlessly from big picture objectives to development specifics\n Laser-focused on the smallest details that are relevant to our customers\n Proficiency in English. The position requires daily interactions with multiple internal teams and partners/vendors across the globe, necessitating communication in English.", "preferred_qualifications": "", "education_experience": "Bachelor or Masters Degree in Computer Science, Computer Engineering, Electrical Engineering preferred, or equivalent experience.", "additional_requirements": "Fundamental understanding of various cryptographic algorithms (RSA, ECC, AES, etc.)\n Experience with object oriented languages, such as C++/Java/Python\n Experience with firmware level of debugging\n Exposure to Swift, Objective-C, iOS and MacOS is a plus", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549144"}