{"title": "ASE - Site Reliability Engineer (Singapore)", "summary": "Apple Services Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. Join Apple Services Engineering Cloud Service Infrastructure team, as a Site Reliability Engineer, to help support and scale cloud services for millions of Apple users. We are building and supporting new and existing critical infrastructural systems and frameworks which provide and support services like structured and unstructured storage, caching, queueing, searching, and much more at hyperscale. These form the platform upon which many iCloud and other backend systems at Apple are built. The team is responsible for the next generation platform that will power Apple’s infrastructural services. These services operate at extremely large scale and store exabytes of data. The platform will support a variety of services based on open-source software, such as Kubernetes, Cassandra, Zookeeper, Kafka, Redis, etc, alongside internally developed services.", "description": "The Apple Services Engineering Cloud Services SRE organization is looking for a strong, enthusiastic developer to join as a member of this group. This person will have a tremendous amount of individual responsibility and influence over the direction the core platform of many critical Apple internet services takes for years to come. You are someone with ideas and real passion for software delivered as a service to improve reuse, efficiency, and simplicity. This engineer’s work will impact hundreds of millions of users and be essential to the success of some of the most visible current and future Apple features. We are domain experts in fleet management, systems, and software engineering. We build automations, instrument reliability tools, and respond to alerts and incidents which may pose a risk to the reliability of the platform. Team’s focus is on infrastructure capabilities and processes, improving the reliability and efficiency of the systems, at scale. DESIRED SKILLS: -  Experience with large scale server provisioning and maintenance (OpenStack Ironic, Metal3, MAAS, xCat, Netbox, Tinkerbell) -  Experience with development within Kubernetes ecosystem, including operator framework, controllers and CRDs -  Experience with UI frameworks such as React, Angular or JQuery SOME EXPOSURE TO THE FOLLOWING: -  Hardware bootstrap and associated security (PXE, BIOS, TPM, secure boot, trusted computing) -  Structured or unstructured storage and caching -  Automating operations processes via services and tools -  Configuration management and fleet orchestration via Puppet, Chef, Ansible, or others -  Cloud Services (AWS S3/EC2/CloudFront or equivalent)", "key_qualifications": "Strong emphasis on SRE as an engineering subject area, with proficiency in at least in one of the following languages (Golang, Rust, Python, Swift) Successful track-record and proven experience as a backend internet services software developer Knowledge of SDLC, including continuous integration, testing methodologies, TDD and agile development methodologies Understanding of base internet infrastructure services including DNS, DHCP, LDAP, server virtualization, server monitoring in critical, large scale distributed systems experience, combining Hardware, Operating Systems and Software Understanding of SRE principals, including monitoring, alerting, error budgets, fault analysis, and other common reliability engineering concepts, with a keen eye for opportunities to eliminate toil by code and process improvements.", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Computer Science, Computer Engineering, or equivalent experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525753"}