{"title": "Site Reliability Engineer - Apple Services Engineering (ASE)", "summary": "The iCloud SRE team is looking for a Service Reliability Engineer (SRE) to design, build tools and support multiple public facing services in iCloud. Do you love engineering and running systems and infrastructure that will delight millions of customers? Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly! Bring passion and dedication to your job, and there's no telling what you could accomplish.  The best candidates will have proven software development skills and strong Linux / Systems expertise, understand SRE, and know what it will take to run services at Apple scale with high operational precision. We play a critical role in the day-to-day operations of services relied upon across Apple while partnering with engineering teams to ensure we, and they are successful!", "description": "Our team is collaborative; we work closely with partner teams to deliver the best results for Apple. We strive to balance the best solution with the need to get things done for each engineering challenge we face. Good ideas are heard, and results are rewarded.    As an SRE at Apple, you will: • Operate, monitor, and triage all aspects of our production and non-production environments. • Pioneer and implement the next-generation telemetry system. • Prepare alert handling procedures, runbooks, and collaborate with the off-shore SRE teams. • Automate deployment and orchestration of services into the cloud environment as well as other routine processes. • Actively participate in capacity planning, scale testing, and disaster recovery exercises. • Interact with and support partner teams, including engineering, QA, and program management.", "key_qualifications": "5+ years in a Site Reliability Engineering, DevOps, or Infrastructure focused role , Experience supporting internet-facing production services and distributed systems , Ability to implement and coordinate telemetry using monitoring and observability tools such as Splunk, Grafana, and Prometheus , Coding experience using a high-level programming language like Java, Golang, or Python, Familiarity with cloud infrastructure concepts (region, AZ, VPC, LB, compute, etc.) and experience with IaaC process, Experience with GitOps, CI/CD tools, and deployment strategies, Experience with configuration management solutions such as Puppet, ansible, or Saltstack and orchestration solutions like Kubernetes or Mesos, General understanding of security and networking concepts", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science, an engineering-related field, or equivalent related experience. Advanced Degree preferred.", "additional_requirements": "• Strong verbal and written communication skills • Automation advocate - you truly believe in removing operational load via software. • A strong sense of ownership. At the same time, you're a great teammate who communicates clearly and transparently - Self-motivated, inquisitive, and always looking to learn more. • Experience managing, scaling, and troubleshooting Java applications", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541155"}