{"title": "Salesforce Business Analyst & Admin", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you a strategic problem solver who excels at tactical execution? Do you love to solve problems and have an uncanny curiosity about analytics? The sale of Apple products and services fuels our ongoing development. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple. We are here to grow our business through partnering with our consumer, enterprise, and education channel sales teams.", "description": "We work closely with the business teams to become functional experts in key channel sales / end-user sales / merchandising / digital and physical retail processes and related solutions needs. We establish credibility as trusted advisors by listening, understanding business requirements and quickly providing options for consideration. Effectively leading discussions with various partners and intelligently asking probing questions that get to the real business needs (asking 'why' and not just taking requirements at face value) will be essential to success in this role. Understand the strategy and the changing needs of the business via business workshop facilitation and roadmap development for future state...", "key_qualifications": "Organized, with a natural inclination for both strategic and tactical planning and turn strategy into tangible deliverables. Resilient and tenacious with a propensity to persevere. Problem solving and root cause identification skills...", "preferred_qualifications": "", "education_experience": "Bachelor degree in Business management, Computer Science, Engineering or related field required. MBA degree preferred. SALESFORCE CERTIFICATIONS: - Salesforce Administrator Certification (required) - Agile SCRUM Master certification (preferred) - Salesforce Sales Cloud Consultant Certification (preferred) - Salesforce Marketing Cloud Consultant (preferred)", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548348"}