{"title": "ML Data Scientist - Forecasting (Consumer Analytics), Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both consumers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV.", "description": "We're seeking a Machine Learning Data Scientist to join our Consumer Analytics Team. As a key member of our data-centric team, you'll drive the exploration, analysis, development, execution, and measurement of analytical solutions critical to our business. Your work will transform data generated by user searches, app content, and App Store context into business insights, improving customer experiences and driving discovery and productivity for app developers! Successful analytics teams include data scientists and data engineers working hand in hand to build insightful and efficient solutions. In this role, you'll be a key player in a multi-functional team that delivers insights with direct and measurable impact! -  Support Finance, Product, Sales, and the Executive Team with forward looking expectations of our marketplace performance. -  Design and evaluate strategies that help define opportunities for increased usage, improved marketplace performance, and greater customer happiness. - Monitor usage metrics and provide business-based explanations for large scale trends and patterns in advertiser lifecycle behavior. Detect and surface anomalies. - Develop reusable models and assets working closely with Data Technology team, to ensure scalability and industrialization as models move into production. - Lead business analytics projects through all phases, including defining investigations, exploring data, conducting analysis, interpreting, and presenting results", "key_qualifications": "6+ years of recent experience in data science or machine learning role. Working experience with Python and SQL. Comfortable with hybrid cloud technologies such as Hadoop, AWS, Snowflake, Spark and PySpark. Experience in quantitative analysis including time-series, regression, classification, and clustering. Ability to clearly and effectively communicate the results of analyses with product and leadership teams, to influence the overall strategy of the product. Ability to partner with engineering, meet the data needs of the business, find creative analytical solutions and develop initial prototypes to address messy business problems. Experience with end-to-end implementation of a model prototype specifically training, processing, feature engineering, evaluating model outputs, and putting models into production. Ability to operate comfortably and effectively in a fast-paced, multi-functional, continuously evolving environment. Bachelor's in Computer Science, Applied Mathematics or similar quantitative field", "preferred_qualifications": "6+ years of recent experience in data science or machine learning role, within digital advertising industry or related field. Familiarity with packages such as scikit-learn, XGBoost, PyTorch, and JAX is highly desirable. Deep learning and Time series forecasting is highly desired. Familiarity with job orchestration frameworks like Airflow. Graduate degree in Computer Science, Applied Mathematics, or similar quantitative field", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558578"}