{"title": "Manager - Logistics Programs", "summary": "We are looking for a Manager - Logistics Programs to be based in Bangalore. The role requires extraordinary flexibility and adaptability in leading a team to deliver requirements from internal & external customers and the ability to provide strategic responses and effective solutions to Finished Goods outbound and Material inbound management in support of OEM production, Holiday work schedule, Supplier’s management, Quarter end and Spring-back support etc. These are just a few of the key attributes needed for success in this dynamic and exciting logistics environment.", "description": "This role will be responsible for managing a team of driven individuals, each responsible for the logistics co-ordination and operations from the OEM’s.\n\nYou should have good analytical and problem-solving skills and communicate clearly to collaborators - bother internal and external.\n\nWe are looking for ability to work on your own initiative, and ideally having experience working with logistics & supply-chain environment. \n\n-  Develop project / execution plan to support volume surge and NPI launches and ensuring suppliers compliance to Apple HSR/FSR\n\n-  Maintain metrics and analyze data to assess supplier’s key performance indices and implement operational improvements across the supply-chain.\n\n-  Drive for operational excellence across the supply-chain in achieving on-time shipment execution at origin and maintaining product confidentiality, (zero loss, zero disclosure) for all NPI shipments.\n\n-  Engage and provide sound guidance and support on new suppliers on-boarding (OEMs & freight forwarders)\n\n-  Work with freight forwarders on cost savings and carbon footprint reduction initiatives through process and packaging improvements.\n\n-  Periodically conduct impromptu freight forwarder’s warehouse security audits in the drive to ensure compliance to Apple’s HSR & FSR requirements.\n\n-  Work closely with all Suppliers (OEMs and freight forwarders) to ensure Apple’s TDM & specific Standard Operation Procedure (SOP) are met.\n\n-  Conduct monthly meetings with OEMs and freight forwarders in driving for continuous operational and process improvements.\n\n-  Develop and optimize logistics networking in achieving the shortest delivery cycle-time time for inbound material movements.\n\n-  Interface closely with the Worldwide / Regional Logistics team on daily operations and update them on any logistics risk, challenges & developments within China.\n\n-  Able to travel as required on short notice to international or domestic cities to support APO Logistics overall requirements.", "key_qualifications": " ", "preferred_qualifications": "Strong interpersonal skills and the ability to work well with the team.\nAbility to generate creative ideas and has excellent problem-solving and analytical skills.\nProficient with supply-chain and have good logistics networking relationship with key and reputable contributors in the freight industry.\nHigh-energy, positive attitude and the ability to accept and manage change in a fast-paced logistics environment\nAbility to work individually or as part of a multi-task functional team, to cut through ambiguity, to decide and act without having the total picture and comfortably handle risk and uncertainty.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549320"}