{"title": "Tooling Engineer - Plastics", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products...Join Apple, and help us leave the world better than we found it.", "description": "Lead the development of new plastic injection tooling projects to meet a wide range of product performance and cosmetic requirements. Lead Apple suppliers to design and produce world-class plastic tooling. Lead tool design and build, tool and process development and tool qualifications at the supplier. Collaborate with supply management, product design, industrial design, and manufacturing engineering groups on material selection, design feasibility and aesthetics of new plastic part & tooling designs. Serve as Apple’s internal plastic tooling and manufacturing authority by demonstrating a thorough understanding of properties of various mold-making materials and tool component fabrication techniques. Institute continuous process improvement measures from initial product design through production ramp of new products. Proficient with the use of Design For Manufacturing, SPC, DOE and Six Sigma techniques. Take the leading role in driving the improvement of productivity and quality of plastic part manufacturing, molding and tooling techniques. Train engineers at supplier plants in Asia to utilize new tooling materials and fabrication techniques. Develop collaborative relationships with Apple suppliers through training and quality control visits. Advise supplier plants on maintaining correct controls on the processes.", "key_qualifications": "Position requires 7+ years in the mold making and molding industry. Extensive experience in tooling design and manufacturing required. Knowledge of plastic materials and design for manufacturing in terms of geometry and cosmetic quality. Lens and optical tooling experience. Experience in developing plastic processing parameters. Experience in leading complex development programs with overseas vendors (Asia) is preferred. Excellent written and oral communication skills are necessary. 25% Travel required", "preferred_qualifications": "", "education_experience": "BS or MS Plastics Engineer preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542555"}