{"title": "Cellular Modem Systems Engineering Program Manager", "summary": "Are you a cellular modem system engineering professional who is looking to make big things happen and can you influence, connect, get results, and communicate optimally? Do you thrive delivering innovative technologies that deeply affect people's lives? Come to Apple and work with us to deliver a broad range of wireless technologies. This is an extraordinary opportunity to engage with the latest technologies and contribute to groundbreaking Apple products year after year. You will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas! Apple seeks a technical leader to program manage our groundbreaking cellular baseband modems to meet performance, quality and schedule requirements for Apple products! You will be responsible for multi-functional team coordination, communication and representation across the systems & silicon engineering ecosystem from concept to production. Technical background in cellular systems engineering will be key to your success in this role. Ideally, you will also have validated project management experience in some aspect of modem architecture, requirements engineering and/or cellular platform/system development. You will work in a multifaceted engineering environment, using sophisticated multi-tasking skills and real-time crisis management are all desired strengths for this position.", "description": "-  Lead cellular modem systems development across several projects simultaneously and meet execution targets. -  Cover all aspects of the modem development: PHY, MAC/RLC/RRC, multi-sim or concurrent RAT operation, etc. -  Track project schedule for all development phases: architecture, design, prototyping, system bring-up, validation, integration, field test, interoperability testing, and production ramp. -  Drive closure of technical requirements/specifications with cellular system partners, supervise requirements compliance, handle issues, and drive bug resolution. -  Work with multi-functional teams and organizations to enable progress on dependencies for requirement definition, architectural exploration and implementation. -  Anticipate risks, develop mitigation strategies and facilitate conflict resolution. -  Drive resolution of technical issues between functional teams: Modem systems, VLSI, FW, RF systems, Technology, IP owners, design, digital verification, firmware/software, characterization, test, etc. -  Provide regular project status presentations for executive reviews. Distill large amounts of data into a clear story to communicate to partners and organizations at all levels.", "key_qualifications": "Experience working in the development of cellular baseband modem systems, algorithms, hardware and/or firmware. Understanding of end to end system involving the UE and network is desired. Good knowledge of wireless communications (OFDM/MIMO, etc.). Experience in wireless standards a significant plus (5G-NR/4G LTE/ UMTS/GSM/CDMA). High tech shown experience with a track record of hands-on product development, program management, project management, or engineering management. Experience in leading algorithm development, modeling, and systems simulation. Good understanding of modern cellular PHY building blocks. Extraordinary teammate and creative problem solver with ability to lead technical teams and multi-functional groups against plans. Excellent written and verbal communication.", "preferred_qualifications": "", "education_experience": "BS and 10+ years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526870"}