{"title": "Senior Privacy and Data Governance Engineer - iCloud Data", "summary": "Would you like to drive the future of Apple’s products and services privacy while having the outstanding opportunity to impact some of the most far-reaching software applications in the world? iCloud Data organization enables to ship better products for iCloud users to access all their content across apps (Photos, Mail, Messages, FaceTime, Calendar etc) from all of their devices all the time by providing consistent, scalable, timely, accurate, complete and fully integrated data infrastructure and capabilities to accurately surface relevant information. If this excites you and you are motivated by solving hard, data privacy and compliance problems at scale, we'd love to hear from you! We’re looking for outstanding privacy engineers with experience and expertise managing privacy and compliance in sophisticated environments.", "description": "We are seeking an experienced engineer to be at the forefront of solving privacy and compliance problems for iCloud data. In this role you will: - Work as a privacy champion across iCloud data, helping the team navigate through continuously evolving privacy policies, compliance, and regulatory requirements. - Partner with multi-functional teams across organizational boundaries on the overall privacy narrative for iCloud data, helping to craft iCloud data’s privacy and compliance strategy for upcoming initiatives. - Guide the design of new privacy-preserving data collection methodologies to enable the evaluation of iCloud products and services. - Promote a culture of data minimization and help strategize and implement technical data engineering and data science solutions that meet iCloud data and business needs. - Provide mentorship to data developers on the right privacy and compliance approaches, frameworks, and solutions to leverage for their use cases. - Partner with privacy champions across Services Engineering to ensure the application of consistent principles and unified solutions to solve iCloud-specific privacy and compliance problems.", "key_qualifications": "Empty", "preferred_qualifications": "Industry experience in Privacy-Enhancing Technologies for large-scale distributed systems", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555749"}