{"title": "Tools and Automation Engineer", "summary": "The Xcode team provides the tools to develop software for Apple’s innovative iOS, macOS, watchOS, tvOS and VisionOS platforms. The Xcode team is looking for a detail-oriented and focused Quality Engineer to work on API/Integration testing, manual/LiveOn testing, building test tools, developing automation platforms, and improving Xcode and the debugging process.", "description": "We’re looking for a highly creative, detail-oriented and self-motivated individual, excellent at creating and maintaining tests/tools required. Provide technical guidance, software architectural review, and mentorship. Have an encouraging and growth-focused workplace culture. Identify test scopes, prioritize testing, execute tests with attention to detail, and communicate the overall quality to stakeholders.", "key_qualifications": "Strong object-oriented programming experience preferably in Objective-C, Swift, Java or Python. Excellent troubleshooting skills with a passion for quality. Experience in writing automation tests at API, UI, and non-UI levels. Collaborative and curious contributor with proactive communication and ability to lead projects. Knowledge of complex system level debugging and root cause analysis. Comfortable with rapid development release cycles and tight schedules.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or equivalent experience", "additional_requirements": "Experience in iOS or macOS development using Xcode, is a plus", "pay_benefits": "At Apple, base pay is one part of the total compensation package and is determined within a range. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. Comprehensive medical and dental coverage, retirement benefits, discounted products and free services, reimbursement for certain educational expenses, discretionary bonuses or commission payments, and relocation may also be available.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548687"}