{"title": "RFIC Design Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design, and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.", "description": "As RFIC Design Engineer, you are going to be responsible for providing RFIC designs for wireless SoC and driving them to mass production for Apple’s Wireless Connectivity products. Responsibilities include: - Hands-on design contributions starting from concept, architecture and topology to transistor-level feasibility studies, power, area, and performance trade-off analysis to actual design, simulations, and extractions. - Design and delivery of radio transceiver building blocks and chains including TX, RX, and PLL-LOGen for wireless connectivity products. - Work closely with RF Systems in block level and high level specifications of the TX, and RX line ups and PLL-LOGen, and proper distribution of spec margins in the chain. - Design of RF and Analog loopbacks for calibration and compensation. - Work through Co-Existence scenarios and design to meet the CoEx requirements. - Oversee the floorplan layout and verification of the design to ensure a successful tape-out. - Close collaboration with RFIC test engineers in the bring up, debug and optimization of the wireless connectivity chip through the productization. - Provide design versus silicon measurements correlation, and compliance with specification for a volume production.", "key_qualifications": "RF/analog and mixed signal design experience in cutting-edge RF CMOS design. Deep experience in designing and bringing into mass production of wireless transceivers is a plus. Deep understanding of analog, mixed-signal and RF circuit design. This includes design of LNAs, and PAs, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers, data converters and calibration methods associated with such high performance wireless systems. Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments. Familiarity with various RF transceiver architectures and their trade-offs, system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience. MSEE and PhD is preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200514201"}