{"title": "SDS Fraud Prevention Supervisor", "summary": "At Apple, we believe that hard work, a fun environment, creativity and innovation fuel the ultimate customer experience. We believe each customer interaction is an opportunity to delight, engage, and inspire. By focusing on the smallest of details, we can make a big impact with our customers. Building this environment starts with you! Inclusion is a shared responsibility, and we hold ourselves and one another accountable for fostering a culture where everyone feels seen, heard and inspired to do their best work. Apple's Strategic Data Solutions (SDS) is seeking a Fraud Prevention Supervisor. In this role, you will be responsible for providing daily supervision, developing the fraud prevention team’s talent, and leading the daily execution of the business. We contribute to the customer experience by preventing and minimizing customer contacts and working to resolve any fraud prevention issues in a timely manner. Critical thinking and self-motivation are an absolute must.", "description": "The SDS Fraud Prevention Supervisor is responsible for managing and promoting the development of Fraud Prevention Investigators. You are a customer focused person who is self-motivated, friendly and has a passion to prevent fraud in an efficient and effective manner. Responsibilities include:  Lead employee performance and support their success. Achieve or exceed team performance and productivity goals. Conduct regular 1:1s with employees. Identify and communicate training and development opportunities. Lead regular team meetings and calibration sessions. Submit and track production issues for resolution. Work cross-functionally with SDS, RCC partners and global peers. Represent Apple with customers and partner organizations. Identify innovative ideas to improve the experience of Apple customers.", "key_qualifications": "2+ years management experience, leading a team of 15+ direct reports OR actively acquiring fundamental experience in Fraud Prevention Team Lead Rotation Excellent English reading comprehension and writing skills Strong analysis and problem-solving skills Strong decision-making capabilities and sound judgment Excellent written and verbal communication skills Strong work ethic with a high degree of flexibility Excellent interpersonal skills Passion for developing direct reports Ability to work in a fast-paced, challenging environment Flexibility to work any shift within 7-day work week Role models inclusive leadership behaviors and embraces their responsibility to build, develop and retain diverse teams Makes space to listen, learn, and amplify diverse perspectives and experiences Confronts barriers to greater inclusion with tenacity, care and commitment", "preferred_qualifications": "Proven leadership experience driving organizational change Knowledge of the Retail Customer Care and customer support model Fraud prevention and/or banking experience Experience in people management with strong leadership background preferred Bachelor’s degree preferred, plus 1–3 years experience in a customer service and support environment", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559184"}