{"title": "ANZ Product Marketing Lead", "summary": "The Product Marketing leader for each market will own and drive Apple’s product centric marketing strategy in the market, and articulate the market ambition to deliver impact and growth. This role is the primary spokesperson for Apple’s products in their market as well as a vocal member of the senior marketing and GEO leadership teams.\nThe Product Marketing lead will manage a team of product and segment marketing experts who champion products, education and business marketing in Australia and New Zealand and seek innovative ways to keep our products at the heart of the customer conversation. Continuous improvement of product launches, comprehensive business and market analytics, instinctive insights and the discipline to focus are valued attributes. The lead will have a deep understanding of product, portfolio and marketing strategy, twinned with the ability to execute for results.\nThe lead must have the ability to work collaboratively with other critical functions, to articulate and shape the opportunity ahead, influence local sales strategies and programs, and to define and communicate region-unique requirements for current and future products in a coherent way to multiple stakeholders in worldwide and across the globe. They will also proactively collaborate with other Geo Product Marketing leads to define and articulate strategic thinking as a collective voice into WW Product Marketing, providing thought leadership to better communicate Geo opportunities and priorities.\nTo be truly successful in this role, you will need to have an undeniably strong passion for Apple products, a desire to win, be curious about being better, have the ability to navigate in a world of ambiguity, show finesse and craft in product storytelling, show creative and innovative problem solving, have the motivation to inspire others, and build strong and lasting relationships throughout the organization.", "description": "- Articulate the product opportunity in market and provide product insight and leadership from product introduction through end-of-life to both the Marketing and Sales organisations\n- Lead the team to deliver product launches with excellence every time\n- Own and drive the annual Marketing plan, outlining opportunities and actions that lead growth and category leadership, instilling quarterly and half yearly reviews on what’s working and what’s not\n- Build high performing teams through coaching and developing talent. Actively develop an inclusive culture by recognising the value that different perspectives and cultures bring to the organisation\n- Act as a primary liaison between Geo and Worldwide teams for all local business needs and feature requirements, shaping strategic thinking and contributing to global initiatives and programs\n- Influence product feature roadmaps, and make clear recommendations that improve the customer experience\n- Devise and craft a singular market narrative to enable clear understanding of market dynamics, customer voice, opportunity and set actions that all key stakeholders understand, as well as defining a common Geo voice into Worldwide planning\n- Introduces new ways of looking at problems, encouraging diverse thinking to promote and nurture innovation\n- Become a visible and vocal member of the senior marketing management team as well as the overall leadership team in the Geo, providing strategic input and influencing long term plans\n- Build a sphere of influence across multiple internal functions / divisions \n- Be the guardian of product and segment messaging and positioning across every customer touch point, advancing the cause of excellence\n- Possess expert knowledge of competitive and third party products and strategies. Make pricing and forecasting recommendations to management and cross-functional teams", "key_qualifications": "Excellent analytical skills\nDepth of technical awareness\nStrategic planning expertise\nAn instinctive ability to be the voice of the consumer\nAbility to prioritise and lead the team to focus on the most critical tasks\nSuperior storytelling capabilities\nPresentation & negotiation skills\nPeople management skills\nSpoken and written English fluency required", "preferred_qualifications": "", "education_experience": "We anticipate you will have a Bachelor’s degree or equivalent experience.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550317"}