{"title": "Retail Outreach Software Engineer", "summary": "Are you passionate about designing solutions that deliver amazing customer and employee experiences? Do you love the idea of solving a new business, technical problem every other day? Do you enjoy learning new and emerging technologies? Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Inclusion is a shared responsibility, and we hold ourselves and one another accountable for bringing everybody in. Apple Retail is seeking a hardworking professional to work with us on customer communications. Proven analytical and social skills with confirmed ability to code in a dynamic project development environment. The ideal candidate will perform detailed design and hands-on content development to support customer communications across multiple platforms. To be successful in this role, you will need to excel at working together with internal partners collaboratively while focusing on an exceptional customer experience to build the right customer outreach solution.", "description": "The Retail Outreach Software Engineer creates and supports customer communications using Apache Velocity, java-based template engine. They write code for both new and enhancements to, email, SMS and push notification communications. They apply their knowledge of the software development lifecycle, testing methodologies, QA terminology and processes and provide support for existing applications through analysis and debugging. They participate in Agile Scrum ceremonies to recommend and review development. Additionally, the Software Engineer frequently interacts with technical leadership and provides technical guidance to senior business leaders and cross-functional project managers.", "key_qualifications": "", "preferred_qualifications": "Laser-focused on the smallest details that are meaningful to our customers. Makes space to listen, learn, and amplify diverse perspectives and experiences. Actively seeks out opportunities to champion and celebrate inclusion and diversity. Able to analyze business requirements, brainstorm technology ideas and design/build efficient solutions. Experience using Splunk or similar. Experience with templating engines such as Apache Velocity, JSP, or PHP. Excellent written and oral communication skills on both technical and non-technical topics. Developing skills in CI/CD including internal CI/CD frameworks such as PIE, Rio and Jenkins. Passionate, inquisitive, and seeks to solve everyday problems in innovative ways. Upbeat, adaptable, and results oriented with a positive, can-do attitude. BA/BS computer related degree or combination of relevant work experience and education.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559348"}