{"title": "RFO Readiness Program Manager (12 months contract)", "summary": "Every day, people do amazing things at Apple. Join us and you’ll do the best work of your life and make a difference in other people’s lives. The Pacific Retail Fulfilment Operations (PAC RFO) Digital team is responsible for ensuring an outstanding customer experience through planning and executing end-to-end supply chain fulfilment processes for Apple Online. An opportunity exists for a self-motivated individual to join as RFO Readiness Program Manager.", "description": "-  Own and drive Apple Online and Store launch plans, including end-to-end planning, system setups, execution, reporting and post-mortem, for NPI and direct promotions\n-  Own launch status updates and executive reporting to Regional and Worldwide senior management teams for assigned line of business and promotions\n-  Collaborate closely with Worldwide and Regional cross-functional teams to influence, align and support launch strategy and Plan of Records, to ensure successful implement of launch requirements\n-  Be the key point of contact to RFO management and Pacific Operations (Pac Ops) leadership during launch/promotion health reviews and drive risk mitigation under tight timelines\n-  Review past launches and promotions to identify key wins and opportunities for process improvements\n-  Document and implement new processes effectively through change management and cross-functional collaboration\n-  Lead or participate in cross-functional initiatives including business requirements definition, User Acceptance Testing (UAT) as required in order to implement new, improved systems/processes capabilities that have impact to peak event planning/execution", "key_qualifications": "-  Minimum 6-9 years of experience in program, project management and/or business analytics with proven track record of successful implementation of mid to large-scale projects\n-  Excellent interpersonal and stakeholder management skills in a fast-paced matrix organization\n-  Critical thinker with a strong sense of urgency to resolve issues\n-  Agile in ambiguity, with an ability to persevere and adapt under pressure\n-  Meticulous with great attention to detail\n-  Good analytical skills, with ability to translate complex findings and analysis to a business audience and executive level\n-  Strong communication and presentation skills, with the ability to tailor presentation style to different levels of an organization\n-  Strategic problem solver with demonstrated ability to make and implement process improvement recommendations\n-  Experience and knowledge of multiple disciplines within supply chain operations and product management is a plus", "preferred_qualifications": "", "education_experience": "Degree in fields such as Operations, Business Management, Supply Chain Management, or Finance required. Masters or advanced degree is a plus. Apple is an equal opportunity employer committed to inclusion and diversity with affirmative action to offer employment and advancement opportunities to all applicants and provide reasonable accommodation to applicants with physical and mental disabilities.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549951"}