{"title": "Coating Engineer", "summary": "Apple is looking for a Plastic / Metal materials Coating Process Engineer to Manufacturing Design Engineering team base in APAC China. Painting Process Engineers are responsible to manage process development, material selection, implementation and optimization of enclosure components at vendor sides. Conduct early DFM review, DoEs studies and present conclusions to work with cross functional teams to achieve product manufacturing ability. Develop new innovative manufacturing process technologies to solve complex design challenges that have direct impact to future product. A successful candidate needs to be a flexible thinker and be able to problem solve independence on their respective technical area.", "description": "1. Process / materials technology feasibility studies through practical engineering methods to take the leading role in driving the improvement of productivity and quality of Plastic/ Metal parts manufacturing, spray painting and decoration techniques.\n2. Drive DFM, PFMEA - Lead on processes / technologies / new material of relevant component decorations development for manufacturability validations.\n3. Collaborate with supply management, product design, industrial design, and manufacturing engineering groups on material selection, design feasibility estimation, fixtures development, aesthetics and POR parameters set up and qualifications.\n4. Proficient with the use of Design For Manufacturing, SPC, DOE and Six Sigma techniques.\n5. Develop collaborative relationships with Beats suppliers through training and quality control visits. Lead supplier plants on maintaining correct controls on the processes and equipments.\n6. Lead the decoration processes development of plastic/Metal projects to meet a wide range of product performance and cosmetic requirements.\n7. Failure Analysis - Lead root cause analysis and metrology development for issues related to decorations.\n8. Institute continuous process improvement measures from initial product design through production ramp of new products.\n9. Continuously maintain competitiveness product cost through early design engagement and processes yield optimization. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "key_qualifications": "", "preferred_qualifications": "5+ years in the Plastic / Metal coating engineering, Paint manufacturing industry or related supplier management is preferred.\nKnowledges of decoration material, processes design for manufacturing and Chemical composition analysis background is preferred.\nExperience in development process of plastic / metal decoration technology and familiar with related equipment, fixtures parameters and test conditions are especially preferred.\nExperience in managing complex development programs with overseas vendors (Asia) is preferred.\nExcellent written, oral communication, coordination and organizational skills\nAI/ML skills is nice to have.\nPeriodic (overseas) travel is required.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554625"}