{"title": "Multimodal and Generative ML Engineer - Health Sensing", "summary": "The Health Sensing team builds outstanding technologies to support our users in living their healthiest, happiest lives by providing them with objective, accurate, and timely information about their health and well-being. As part of the larger Sensor SW & Prototyping team, we take a multimodal approach, using a variety of sensors across HW platforms, such as camera, PPG, and natural languages.", "description": "In this role, you will be at the forefront of developing, evaluating and improving multimodal and generative models for real-world health/wellbeing applications on their objective quality and alignment with human intent and perception, such as truthfulness, adaptability, and model generalizability. You will work on data and evaluation pipeline of both human and synthetic data for model evaluation, leverage ML technologies such as reinforcement learning with human feedback and adversarial models.", "key_qualifications": "No Key Qualifications provided", "preferred_qualifications": "Expertise in deep learning (e.g. hands-on training and evaluation experience with transformers), Experience incorporating multiple modalities into large language models (LLMs), Proficiency in Python and ML frameworks (e.g., PyTorch, TensorFlow), Ability to write clean, performant code and collaborate using standard software development practices", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "No Additional Requirements provided", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546475"}