{"title": "Supply Demand Execution Planner", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? People here at Apple don’t just create products - they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do! Flawless operational excellence is a cornerstone of our ability to consistently surprise and delight our customers. An opportunity exists for an ambitious, highly motivated professional to join the Supply Demand Execution (SDE) team as an SDE Planner. We are looking for forward-thinking individuals who will be tasked with leading the end to end execution process for a number of our product lines...", "description": "Lead the execution activities for your designated product lines, ensuring a seamless exceptions based process. Identify, communicate and resolve any issues impacting the plan with the critical focus being on the customer. The scope of the execution activities will be managing across the Online, Retail and Reseller routes to market. Evaluate risks to the execution plan and proactively work with internal to implement contingencies & mitigate risk to achieving execution goal.....", "key_qualifications": "", "preferred_qualifications": "Meticulous attention to detail & ability to achieve precise system execution of supply chain strategies\nDemonstrate initiative, adaptability and problem-solving skills in a changing and dynamic environment\nExcellent communication, interpersonal and negotiation skills, both written and verbal – ability to present complex system execution plans to executive teams\nAbility to interact proficiently with a wide range of business and technical teams with the ability to adjust communications and messaging for the intended audience\nStrong work ethic, perseverance, flexibility and ability to work comfortably in a fast-paced, highly-matrixed environment\nAbility to cultivate relationships & lead within teams through heightened business insight and consumer focus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550481"}