{"title": "Advanced Manufacturing Engineer - Audio", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology", "description": "Responsible for designing precision assembly and measurement processes for Apple products. Perform the research and development on new technologies necessary to tackle complex assembly and automation problems that have direct impact to the quality and delivery of Apple products. Design, implement and successfully scale automated and semi- automated solutions based upon sound engineering principles and the technologies developed for a specific application. Develop new and or improved processes through the application of theoretical and practical engineering. Keeps abreast of all meaningful technical trends and developments and incorporates them in appropriate assignments. Provide direction and mentorship to third party machine/automation suppliers and/or CM’s; be the technical leader and driver on owned projects; serve as a technical resource to other engineering groups and project leaders. Organize cross-functional reviews of the machine requirements, design, qualification and capability. Create Request for Quotation/Proposal (RFQ/RFPs) that documents the design requirements of the automated equipment, delivery schedule, required documentation and qualification for acceptance at machine supplier facility and contract manufacturer’s factory. Engage machine suppliers for automated equipment design reviews and proposals. Drive machine qualification including correlation, process capability (CP/CPK) and Gage Repeatability / Reproducibility. Drive failure analysis and machine issue resolution when working with machine suppliers and contract manufacturers. Ability to travel internationally up to 40%. Run equipment experiments to bound the capability of the machine. Responsible for data analysis reports to communicate machine capability to the multi-functional teams. Performs assignments in several of the following manufacturing engineering functions: Design for Manufacturability, Product Engineering, Process Engineering. Failure/Data Analysis. Plans, develops and implements technically complex procedures for the testing and evaluation of soon to be released products. Specifies test to be performed, compiles data and makes recommendations for product design changes and final assembly standards. This will include the use of Design of Experiments (DOE) and statistical analysis using Six Sigma principles", "key_qualifications": "3+ years of strong work experience in precision assembly, inspection and automation equipment. Required to understand and build tolerance analysis for parts and assemblies. Knowledgeable in crafting machine qualification requirements, design of experiments and failure analysis. Understands machine qualification including calibration, correlation, capability, repeatability and reproducibility. Able to communicate effectively in a worldwide environment. New product introduction and Manufacturing Operations experience desired. Proven track record of cost reduction, project management and engineering design required. Working knowledge of GD&T principles favorable. NX, SolidWorks CAD or ProE experiences a plus. Knowledge of optics principles as they relate to CCD cameras, 2D and 1D lasers, and their use for positioning and critical alignment machines. Basic understanding of liquid adhesives, PSA’s and VHB’s a plus. Working knowledge of robotics (6-axis and/or SCARA), pneumatics, servo motors, motion controllers, PLC and and PC-based control systems. JMP, Minitab & Six Sigma experience preferred", "preferred_qualifications": "", "education_experience": "BSME or equivalent (MSME desired), with 5 plus years in an engineering role with experience in automation equipment used for alignment, assembly and/or measurement of components.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512494"}