{"title": "Sr. Failure Analysis Engineer", "summary": "We are establishing a new presence in Bangalore, it is paramount that we build a strong foundation. We are looking for an experienced engineer who can run many complex issues with minimal oversight. Projects will come in, the engineer will determine the best plan of attack, and be responsible for the execution, analysis, and reporting of results. This engineer will work on a wide variety of products/modules/technologies, executing a wide range of analysis. One day could be a hinge, the next an adhesive, the next a shorted MLB. Expect lots of variety. The engineer will be required to learn and increase their skillset over time to include a wide range of materials and techniques.  This growth will be done through mentoring from senior subject matter experts and extensive 3rd party training. The engineer will need to interface directly with requesters and coordinate on a daily basis with other global laboratory resources. These updates include publishing comprehensive reports and presenting key findings to engineering teams and executives. All of these activities must be done adhering to strict deadlines and status reports / interim findings must be communicated on a regular basis.", "description": "In this role, you will be responsible to help drive the team toward solutions, clear roadblocks out of the way, and ensure crisp communication between all parties.  You will be responsible for running lab equipment and collecting data.  You’ll meet with cross-functional partners, collect and distill information, advise on the best path forward, and communicate back to the technical lab staff. We are seeking an experienced bridge-builder who is outgoing and passionate about working with people. You should have a desire to bring teams together to ensure the customer has the best experience possible.", "key_qualifications": "To be successful in this role, you should have hands-on experience lab experience in CT/X-ray and a deep understanding of a variety of materials characterization techniques (SEM/EDS, FTIR, FIB, etc.) and fundamental failure analysis methodology. You have the ability to apply understanding of advantages and limitations of FA tools to follow the best course of action to determine root cause. You have the ability to convey complex data sets from multiple sources into a concise and understandable form. This role deals with high volume activity.  Being organized and detail-oriented will help you keep up with all of the action. You have exceptional problem-solving abilities. You have excellent verbal and written communication skills. You have the ability to juggle multiple high-priority tasks at the same time. Willingness to collaborate closely across the organization. Flexible and able to quickly change course to meet the needs of the business. RSO Certification is a plus.", "preferred_qualifications": "Bachelors, M.S. or PhD in Materials Science, Engineering, or a related discipline.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554367"}