{"title": "Product Safety Engineer", "summary": "At Apple, phenomenal ideas have a way of becoming exceptional products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Imagine what you could do here! This position is offered in the Product Safety Engineering department within Apple's Product Integrity organization.", "description": "Secure IEC 60950 or IEC 62368-1 safety certifications to facilitate global commercialization of our products. Evaluate product designs of consumer electronics and new technologies for safety. Develop a deep understanding of our products and work with multi-functional teams to identify and address related safety requirements and resolve design challenges of new technologies. Using scientific methods, conduct design of experiments and failure analysis. Own and drive the safety aspects of Apple products while influencing product design engineering and cross-functional teams in regulatory and compliance requirements. Develop an understanding of engineering and manufacturing processes to drive continuous improvement and prevent safety issues. Work with suppliers to ensure product safety is addressed and maintained during production.", "key_qualifications": "", "preferred_qualifications": "Evaluate, test, and author reports in compliance with IEC/EN/UL/CSA 60950 and 62368 standards. Familiarity with IEC 60065, 60601, or 62133 is acceptable, and experience with IEC 61508 is a strong plus. Interpret, evaluate, test, and write reports to product safety standards. Use engineering fundamentals, Failure Mode Effect Analysis (FMEA), and fault trees to analyze electric circuits, schematics, assemblies, and manufacturing processes. Proficiency in using laboratory test equipment, safety test procedures, and agency requirements from consumer electronics safety standards. Power/electronics/electrical background and ability to conducting component-level safety analysis of electrical circuits and modules.", "education_experience": "Master’s degree Electrical Engineering, Electronics Engineering, or Mechatronics, and 5 years of experience in the job offered or related occupation.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550040"}