{"title": "Music Editor, Apple Music", "summary": "Apple Music is a streaming service that allows you to listen to over 100 million songs. Its features include the ability to download your favorite tracks and play them offline, lyrics in real time, listening across all your favorite devices, new music personalized just for you, curated playlists from our editors, and much more. All this in addition to exclusive and original content. We are seeking a strategic and creatively-minded Music Editor to join the Apple Music Editorial team in China. The successful applicant will have a proven history of managing editorial platforms, ideally with experience across multiple mediums. There should be high confidence in content curation and user behavior and a track record of optimizing a platform based on a solid understanding of analytics and trends. The applicant will have an exacting eye for detail and be able to apply it to all Editorial spaces, overseeing a high-quality and vibrant environment for our users.", "description": "In this role, you will: - Drive strategies that maximize how content is featured throughout our platform, enhancing the user experience and optimizing engagement. - Deliver day-to-day elements of maintaining a vibrant and engaging platform, such as content curation and programming. - Develop and manage our homepage and playlist brands, maintaining a deep understanding of musical culture and the lifestyles of different target users. - Manage the relationships with the artists in preferred genres. - Key Editorial voice on large-scale, cross-functional content initiatives, helping to manage and maximize execution. - Work with internal teams to create and deliver original events and drive complex, time-critical editorial projects with cross-functional teams globally. - Use analytical skills to translate data into insights and actions, reinforcing an environment where you and your teammates can thrive and innovate. - Articulate our platform and editorial voice by being a passionate advocate for Apple Music.", "key_qualifications": "", "preferred_qualifications": "Significant experience in Classical, R&B/Soul, and Jazz is preferred. Solid experience in managing relationships with artists in preferred genres. Exceptional communication inside a complex, cross-functional global business and be able to handle multiple projects simultaneously. High level of comfort with engagement metrics and analytics generally and an ability to apply learnings. Passion for Apple brand and products and ability to inspire that passion in others.", "education_experience": "All backgrounds are welcome to apply.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548529"}