{"title": "Senior ML Research Engineer, Apple Services Engineering - Search Science", "summary": "The Apple Services Engineering (ASE) team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power Search for the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books.", "description": "We’re a diverse collective of problem solvers and doers, continually reimagining what’s possible to help us all find what we love in new ways. Our engineers have created some tough acts to follow, and they continue to lead us to innovative breakthroughs.", "key_qualifications": "Deep understanding of search and information retrieval fundamentals including indexing, query understanding, retrieval and ranking\nStrong industry experience with one or more of the following: search, classification, regression, recommendation systems, ranking systems, fraud detection, online advertising, or related\n4+ years of relevant industry experience\nKnowledge of ML models using Transformers, Large Language Models, Reinforcement Learning, TensorFlow, and PyTorch\nExperience building big data pipelines with Hadoop, Java, Scala, and Spark\nFamiliarity with A/B experimentation and data/data-driven product development\nExperience leading technical aspects for complex multi-functional projects\nPassion. Our customers love what we do at Apple and we want the same from our engineers", "preferred_qualifications": "", "education_experience": "MS or Ph.D. in Computer Science or related subject area", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547625"}