{"title": "Embedded Software Engineering Manager - Memory and Boot", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will be inspired. And you’ll be proud. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "We are looking for a capable manager with 10+ years of significant experience in embedded FW and/or SW architecture/development who is upbeat, innovative, adaptable, and results-oriented with a positive attitude. Practical experience with memory management, security, and architecture in embedded products and Cellular Firmware Development experience are pluses. Genuine passion for innovation and product development with experience from inception through delivery to customers. The Embedded SW Manager will be responsible for all things firmware related. Architect, design, develop, and maintain hardware and software systems for Apple products.", "key_qualifications": "At least 10 years of validated experience in wireless SoC firmware engineering, Experience in engineering leadership, including prior leadership of firmware team(s) with a strong high-volume production track record, Extensive technical background in one or more of the following:  Strong embedded SW fundamentals, including a deep understanding of design and development flows, real-time constraints, concurrency, and multi-processor systems, Strong understanding of embedded memory architecture and resource management, including virtual memory, MMU, MPU, system fabrics, and memory attributes, Experience with configuration and release management, continuous integration, and regression testing, Knowledge of design strategies for maintainability, scalability, and code reuse, Experience designing secure and efficient services in an embedded software stack, Hands-on experience with chip bringup, including pre-silicon validation and driving challenging cross-functional issues to conclusion, Leading large and complex projects, including feature planning, prioritization, status tracking, and issue triage and reporting, Excellent interpersonal skills, including experience leading teams, Excellent communication skills – both written and oral, Experience with executive communication is a plus", "preferred_qualifications": "", "education_experience": "Bachelors/Master Degree in Computer Science, Electronics & communication Engineering, Electrical Engineering, or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551137"}