{"title": "SoC Display Subsystem Validation Engineering Program Manager", "summary": "Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Come to Apple and work within a dynamic team to deliver innovative technologies to our customers. This is an excellent opportunity to engage in groundbreaking display technologies and add to the development of new Apple SoCs and products year after year.", "description": "This high profile role will be responsible for the following:\n-  Work with multi-functional teams to ensure end-to-end validation plan and de-risk strategy of the SoC display subsystem is established early in the SoC Concept phase.\n-  Collaborate with systems, software, module and SoC integration teams to plan and track 'Golden C-model' development and validation, early software driver development, SoC pre/post-silicon validation, and image quality evaluation.\n-  Debug technical silicon and system issues and drive them to closure by bringing together key partners.\n-  Collaborate and facilitate communication across multi-functional engineering teams and their management.\n-  Clear and focused communication of program risks and status, including issue reporting and tracking.\n-  This is a highly visible role that requires the ability to understand and extract action plans from complex technical discussions and translate into succinct messaging for multi-functional and executive status reporting.", "key_qualifications": " ", "preferred_qualifications": "Technical Program Management/Engineering Management experience.\nSoC display pipe architecture / digital signal processing.\nExposure to different display technologies.\nExcellent debugging skills. Proven track record to drive resolution of critical problems, while under pressure.\nAbility to filter and distill relevant information for the right audience.\nPassionate to own/drive project development using well-defined metrics.\nThrives in dynamic schedule driven development environment.\nAbility to succinctly summarize complex details for executive reporting.\nExtraordinary leadership skills and ability to encourage team members with a commitment to see the bigger picture.\nExperience working in a dynamic multi-disciplined engineering environment, strong at multi-tasking.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560252"}