{"title": "Senior Motion Control Systems Engineering Manager", "summary": "One of Apple’s R&D groups is currently seeking a senior motion control systems engineering manager. This engineering manager will lead a team to develop custom control algorithms, optimization routines and drive implementation for a host of systems and applications.  We are looking for passionate and creative individuals to push the performance bounds of control systems design. Does working on new technology excite you? Innovation is in your hands! We are ready to help you help us grow.", "description": "In this role you will partner with mechanical, power electronics and embedded FW engineers to develop robust and highly customized control algorithms for unique applications. Responsibilities include: Control system design, analysis, and integration Design, implementation and maintenance of an automated system for optimal system identification and control system tuning at scale. Prototype, develop, bring-up, debug and characterize new control techniques on real hardware. Define factory test & calibration requirements for complex systems  Author engineering requirements and specifications based on analysis and validation Communicate progress cross-functionally (written, verbal, and presentation) Perform failure analysis and problem solving", "key_qualifications": "Experienced in leading and managing a team of skilled engineers. Skilled in the development, theory, design, modeling and implementation of motion control algorithms. Experienced in control system state management (gain scheduling, bumpless transfers, state machine development). Experienced in state-space design, traditional controls methods (PID, observer/compensator) and modern control techniques such as MPC/LQR. Experience in both linear and non-linear estimation Hands on experience prototyping control algorithms and demonstrating capability at an executive level. Confident with source control (eg. GIT) on multi developer projects", "preferred_qualifications": "", "education_experience": "M.S. in Engineering + minimum of 10 years of industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548748"}