{"title": "Readiness Programme Manager (NPI)", "summary": "Apple is a place where extraordinary people gather to do their best work. Together, we build products and experiences people once could not have envisioned, and now cannot imagine living without. The EMEIA Product Launch Readiness team at Apple is looking for a dynamic, experienced and ambitious candidate for the role of the EMEIA New Product Introduction (NPI) Readiness Manager. In this role you will be responsible for coordinating the delivery of Appleʼs New Products to our customers in line with company strategy. The suitable candidate will play a key role in the NPI Operations Readiness team that requires strong leadership skills and provides the platform to influence cross-functionally at site, regional and global level. If you have exceptional communication and project management skills, are proficient with change management and thrive in a challenging and dynamic environment, this could be your ideal role. We'd love to hear from you! We believe that collaboration is one of our key strengths, and every day we will connect you with your peers and colleagues, at one of the most diverse companies in the world. As an individual, you'll be a key player within the function.", "description": "Coordinate new product launches across all operational groups Proactively share updates and ensure all deliverables / dependencies are clearly & concisely called out Build and execute the regional plan with input from your functional partners Develop and implement each launch strategy by route to market Own regional strategy and ensure that it aligns with global direction while driving efficiencies in-region Provide timely notification to partner and leadership teams where course correction is required Executive reporting of launch progress to senior management (Regional & WW) Lead in-depth post-launch discussions to review performance and identify key opportunities for improvement Analyse the root cause of issues, drive resolution and implement process improvements Demonstrate agility to meet the challenges of Apple’s constantly evolving business needs. Continuously drive improvements in process, tools, systems with the team to achieve scalability, simplification and accuracy", "key_qualifications": "Empty", "preferred_qualifications": "Relevant supply chain experience, Comfortable with analysing data", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558967"}