{"title": "Senior Wireless Standardization Engineer", "summary": "The people here at Apple don't just build products - they build the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. As a Senior Wireless Standardisation Engineer, the candidate will be responsible for representing Apple in standard bodies and driving Apple’s strategic interest in those organisations. With the great opportunity to create innovations that benefit Apple’s product lines and generate new IP, he/she will be working with a dynamic team in driving Apple’s global standardisation activities.", "description": "As a Senior Standardisation Engineer, you are responsible for the development of standards and specifications specifically for China. In working with Apple’s standardisation and product teams, you actively engage in China standardisation processes and discussions through participation in working groups and plenary meetings. You actively participate in working group discussions and contribute in the development of China-specific standards and specifications, covering CCSA and other relevant China Technical Committees.", "key_qualifications": "- You are familiar with China standards such as CCSA, or other cellular standards bodies.\n- You have a minimum of 5+ years of direct standardisation experiences in CCSA or other equivalent standardisation working groups, with a proven track record in achieving effective standardisation deliveries through collaboration with standardisation partners.\n- Direct working experience, or extensive networking facilitations with major Chinese certification labs and research arms are preferred.\n- You exhibit strong verbal, written, and inter-personal communication skills, including effective project management capabilities in driving standardisation efforts both internally and externally.\n- Direct hands-on working experience, including necessary research and development experience in China standards organisations, or equivalent experience in 3GPP or other wireless standards organisations are preferred.\n- You are fluent in both English and Chinese Mandarin.", "preferred_qualifications": "", "education_experience": "MS or above in Electrical Engineering or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505475"}