{"title": "Marketing Lead, Services, Greater China", "summary": "We're searching for a dynamic, highly motivated senior marketer with phenomenal ideas and a real passion for content to run the marketing organization supporting our Services businesses in Greater China. As the Head of Marketing, you'll be the primary person responsible for the strategy and execution of marketing programs to grow and support the App Store and Apple Media Products including Apple Music, Apple TV+, iTunes and Apple Podcasts in Greater China. You will be collaborating with World Wide and local teams responsible for marketing programs, sales, partners, content, and product management for these services.  We are looking for an experienced marketer with a deep understanding of entertainment services marketing, a knowledge of digital marketing channels, and/or subscription marketing.  You should have excellent communication skills to work across a complex matrix organisation, and should be able to build positive relationships with key partners to help deliver world-class marketing programs and partnerships.  If you are a marketing and digital enthusiast, love keeping up with pop culture, passionate about how technology shapes our future, and most of all, are excited about the role apps, music, movies, and games play in people’s lives, then we are keen to hear from you.", "description": "- You will develop impactful marketing strategies and programs to reach the apps, music, and video markets in Greater China to grow Apple’s service businesses.  - You'll manage the marketing team for App Store and Apple Media Products in Greater China.  - You will be the site leader who pulls together a wide range of teams across different functions who are based on the same site. Many of these teams don’t report into your org, but you would cultivate and lead them under a strong sense of one team across functions.  - You will drive growth across Apple Services through acquisition, user engagement and churn reduction via multiple channels such as Strategic Partnerships, Performance, CRM and Affiliate marketing.  - You will analyse and optimise all projects and campaigns to find opportunities to grow based on customer insights that are aligned with Apple values.  - You will prepare and present recommendations, reports, and findings from experimental data all the way up to the executive level to help develop programs. - The work location can be based in Shanghai or Beijing. Your success in the role will be measured according to your ability to execute on marketing programs leading to the growth in business.  The programs you develop will be assessed based on overall impact on customer excitement that leads to revenue, cost-effectiveness, return on investment, and alignment with company goals and strategies.", "key_qualifications": "", "preferred_qualifications": "Experience in App, digital, Music, subscription, or media business. A deep understanding of digital entertainment trends and influences in Greater China is key. Experience in developing and executing large national consumer marketing programs. Seasoned leadership skills with demonstrated ability to present to senior management. Skilled at developing and exercising cross-functional influence. Attention to detail and excellent project management skills running schedules, deliverables, cross-functional responsibilities, etc. A highly motivated team-player who is able to work in dynamic environment. Deep understanding of marketing channels and which ones work the best based on the objective. Ideally, you'll have over 15 years of relevant marketing (digital, entertainment) experience. Mandarin and English fluency required. BA/BS required; MBA a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554992"}