{"title": "AIML - Annotation Team Lead", "summary": "You’re passionate about supporting others to achieve the highest level of service in every interaction. You’re a role model and leader who advocates for their team. You’re invested in your work relationships and hold yourself and your team to a high standard of accountability. You’re naturally curious and gravitate towards tools and resources that enrich your team. If you are ready to inspire and lead, join Apple and help us leave the world better than we found it. Are you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send a message, play their favorite song or even take a selfie. As the AIML Data Operations Team Lead, you will focus on leading a team of Annotation Analysts. You will be responsible for the team’s operational success, mentoring their career growth, and collaborating cross-functionally with other internal teams.", "description": "As an AIML Data Operations Team Lead, you’ll be responsible for providing daily leadership and promoting the development of 25-30 Annotation Analyst team members. You are self-motivated, friendly and have a passion to support your team’s development through critical and creative thinking. You’ll identify, promote, and implement innovative ideas to meet and exceed performance and quality goals set by leadership. You will support employees’ success through establishing relationships and seeking to understand what motivates individuals. You will oversee performance management, ensuring daily, monthly, quarterly operational metrics are met. You’ll effectively execute on management and administrative tasks such as leading staff meetings, conducting regular one-on-one’s, hiring, training, and development of employee performance. You will drive operational improvements, team collaboration, and recommend innovative solutions to business challenges. You’ll establish clear and effective working relationships and communication channels with internal partners. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "key_qualifications": " ", "preferred_qualifications": "Experience in the field of AIML- Data Annotations, Project Management Skills, Quality Management Systems, Data Analysis", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554635"}