{"title": "Circuit Design Automation Engineer", "summary": "Do you want to apply your engineering background to make big things happen! Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? Do you have a passion for crafting entirely new solutions! As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality. You and your team will apply engineering fundamentals and start from scratch if needed, bringing visionary ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before imagined! You will be part of an exciting silicon design group that is responsible for crafting state-of-the-art ASICs. We have an extraordinary opportunity for Custom Design Automation Engineers. This is a highly visible role at the heart of a processor design effort, making a critical impact delivering products to market quickly.", "description": "Imagine yourself at the center of our hardware development effort. Where you will collaborate with all disciplines, playing a strategic role of getting functional products to millions of customers quickly. You will have the opportunity to integrate and come-up with new ideas, as well as work with a team of talented engineers. As a Custom Design Automation engineer for digital design team, you will perform the following: - Responsible for working on initiatives to automate custom analysis flows for fixing the design margins - Build and maintain memory compiler technologies to facilitate in creating memory arrays in large SoC designs - Debug and provide quick solutions for digital IP designers and/or users. - Define and develop QA checks to verify EDA views of SRAM and register files. - Collaborate with design and CAD team to optimize design flows and timing / power methodologies for SRAM designs - Apply machine learning to optimize flows and QA checks", "key_qualifications": "", "preferred_qualifications": "MSEE is preferred, We are looking for applicants with fundamentals in custom transistor level circuits and SRAM designs, Proven understanding of industry standard circuit simulator and debug tools, and STA tools., Knowledge of timing, power, noise and EMIR analysis, Efficient programming skills in languages like: SKILL, Perl, Python, TCL, Shell., Exposure to ML based programming algorithms, Ability to provide automations for rapid and dynamic design needs., Ability to work collaboratively with the circuit team to define and maintain design flows and tools.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559159"}