{"title": "Sr. Software Engineer - Full-Stack (ASE)", "summary": "Imagine what you could do here. The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "This opportunity is with the Apple Services Engineering (ASE) Architecture team. We are responsible for developing critical services, tools, and frameworks that are used by our client and server teams. This includes configuration services, intelligent k8s autoscaler, and customer privacy supporting systems - all running in our various data-centers. We are looking for a self-starting, energetic individual with very strong leadership and technical capabilities to join our experienced team.", "key_qualifications": "Expertise in building applications and services across tiers using REST/gRPC, Proficiency re-architecting existing systems to take advantage of new technologies, Highly skilled with various UI frameworks, React preferred, Significant experience in software development on JVM platform with Java language, Solid foundation in Computer Science including statistics and algorithms, Understanding of key cloud technologies and infrastructure like Docker, K8s, S3 and other cloud based functions, Solid object-oriented and functional design techniques and reusable component design, Sophisticated analysis, problem solving, and troubleshooting skills, Ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Software Engineering, Computer Science, Mathmatics  or equivilant experience.", "additional_requirements": "Expertise in the following areas is a huge plus but NOT required: • Background and experience with other JVM-languages, Rust or server-side Swift, is a plus.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200516593"}