{"title": "Touch Sensing HW-Algorithm Systems Engineer", "summary": "The Sensor Technology team develops innovative sensor solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Sensor Technology team is to enable the world’s best user experience. New challenges arise every day that require the sharp problem-solving skills of hardworking individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. Come join this amazing team!", "description": "-You will responsible for developing advanced sensing algorithms for future Apple products. This will involve analyzing sensor architectures, assessing algorithm HW and performance requirements, and engaging in algorithm prototyping, performance bounding and validation. \n-You will be developing and validating advanced architectures to ensure sensor system performance. \n-Development and negotiation of multi-functional requirements to ensure module performance will be a key part of the role, and as such you will collaborate closely with Electrical Engineering, Firmware Engineering, and Mechanical Engineering teams, to create innovative sensor solutions.\n-  Use estimation and machine learning techniques to analyze and improve sensor architectures\n\n-  Sensor technology scoping and prototyping investigations\n\n-  Develop comprehensive, multi-functional sensor system models \n\n-  Develop detailed sensor module and algorithm architecture specifications \n\n-  Analyze engineering and production data sets in order to reconcile system model \n\n-  Author regular technical communications for executive and multi-functional briefings \n\n-  Failure mode analysis, root cause diagnosis, and system-level problem solving", "key_qualifications": "Strong background in imaging, digital signal processing, estimation, machine learning, or mathematical modeling\nMulti-disciplinary understanding of EE, ME, and Physics principles\nHigh proficiency in prototyping/analysis scripting languages like MATLAB/Python\nExperience in modeling complex cross-disciplinary systems\nExperience with sensor interfacing, signal conditioning, and signal-to-noise analysis\nHands-on experience in system-level design of imaging or sensing systems\nExcellent written and verbal communication skills\nExcellent critical analysis, statistical analysis, and logic/problem solving skills", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548447"}