{"title": "AIML - Robotics Research Engineer, MLR", "summary": "Our team works at the intersection of modern machine learning and robotics to shape the AI that will power the next generation of Apple products. We are looking for innovative and hardworking ML and robotics researchers and engineers that help us research, define, and develop complex intelligent robotic systems and experiences in the real world. Join Apple and help us leave the world better than we found it! In this position, you will be working on challenging AI and robotic research problems with an innovative and cross-functional team.", "description": "Our work centers on the research and innovation in the AI and robotics technologies and systems that enable the new generation of Apple products. Your contribution will ensure that Apple delivers these products with extraordinary differentiation and a magical user experience.", "key_qualifications": "", "preferred_qualifications": "2+ years of experience in programming autonomous robots and systems.\n2+ years of experience in areas like perception, SLAM, decision making, motion planning, and control systems.\n2+ years of experience in applied machine learning and AI algorithms for embodied and autonomous systems.\nExperience in working with foundation models for robotics is a plus.\n2+ years of professional software development experience in C++ and Python.\n2+ years of hands-on experience in R&D of pioneering AI and robotics algorithms, systems.\nBackground in robotics algorithm integration, testing and experiments.\nFamiliarity with real-time, multi-process, multi-threaded coding, and command line in Linux.\nExperience with agile development methodologies.\nAbility to cut through ambiguity and follow through to task completion despite roadblocks or distractions\nAbility to prioritize with technical expertise and manage time wisely in a fast-paced, dynamic environment\nCreative, collaborative, and passionate about R&D on extraordinary products and experiences\nExcellent communication skills — you collaborate optimally with other teams and communicate clearly about your work\nAbility to work effectively within a geographically distributed team", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553943"}