{"title": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "summary": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause.", "description": "- Work with designers and architects to understand the functionality of various blocks in the SoC\n- Create validation test plans, ensuring all key features are covered \n- Develop SW workloads to validate various CPU and memory subsystem features\n- Integration of these workloads into an existing system validation tool\n- Make enhancements to the tool's SW framework to support new CPU architectures\n- Drive the bring-up and execution of our validation SW in pre-silicon (FPGAs) and post-silicon (development boards) \n- Debug workload failures using a variety of tools and hooks\n- Release and distribute our system validation SW to cross-functional teams across Apple", "key_qualifications": "Strong understanding of micro-processor architecture\nGood knowledge of ARM or another CPU instruction set architecture\nFamiliarity with memory technologies and power management\nExperienced C and assembly programmer.\nExperience with scripting languages such as Python, Perl, or Tcl\nKnowledge of software tool chains including including compilers, assemblers, and source control tools\nBackground in silicon bring-up and debug experience a plus.\nAbility to work well in a team, but to be responsible and self-driven.", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551485"}