{"title": "Business Markets Program Manager, ALAC", "summary": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We believe that if you bring passion and dedication to your job, there's no telling what you could accomplish. Bring your enthusiasm, dedication and focus, and help invent the future! We are looking for a passionate enterprise, small & medium business marketing leader who loves technology and believes in the power of Apple products for business. The Business Markets Program Manager will be responsible for executing programs and developing content that amplifies all the great ways our customers in Latin America and around the world are putting Apple technology to work in businesses small and large.", "description": "In this role, you will serve as the critical link between Apple and the WW Business Markets team. You will build and localize content and programs to educate and inspire customers about the impact of Apple products and platforms. The Business Markets Program Manager is part of a team of product experts who champion products within their respective markets and seek innovative ways to keep our products at the heart of the customer conversation. You will work cross-functionally with PR, Marcom, Sales, and Developer Relations to expand Apple’s presence in the market. Additionally, you will: Articulate the product opportunity in market and provide product insight and leadership. Build and execute the annual ALAC Business Markets Marketing plan, outlining opportunity and actions that lead to growth and segment leadership. Be the liaison between the Market and the worldwide Business Markets teams influencing messaging and programs for business. Be the guardian of product messaging & positioning across every customer touch point, advancing the cause of excellence.", "key_qualifications": "", "preferred_qualifications": "Superior storytelling capabilities and presentation skills. Excellent analytical skills with knowledge of industry trends. Strong ability to think strategically, then follow through to execution with unyielding attention to detail. Collaboration and inter-personal skills that encourage partnership and influences others to work together to move things forward. Possess expert knowledge of competitive and 3rd party products and strategies. Flexibility to travel (up to 20% of the time). Proficiency in Portuguese is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553269"}