{"title": "Senior PR Manager, Security", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish. Apple's worldwide communications team informs the world about the Company, our innovative products and services, and the values that drive our company. The team includes professionals with backgrounds in public relations strategy, journalism, buzz marketing and event production. We’re looking for trailblazing, collaborative professionals from a variety of creative fields. If that’s you, then your next home may be here. Come and do the best and most exciting work of your career at Apple.", "description": "In this role, you will drive strategy, planning and execution of corporate PR programs and initiatives, in addition to managing security-related issues and crisis across the business.", "key_qualifications": "Experience managing successful PR programs with global brands in international settings. Strong product knowledge and PR experience in the areas of consumer electronics, technology and information security strongly preferred. Hard-working, with a positive team-player attitude and be passionate about consumer technology. You should be able to handle multiple projects, be willing to dig-in quickly on projects and thrive in a very dynamic environment. You have excellent organizational skills and attention to detail. A self-starter who is dedicated and demonstrates creative, technical and critical thinking abilities. You possess excellent writing skills and are an effective communicator with detailed project management skills. You are highly adaptable and work well under pressure, with proven experience working on complex, international, large-scale, time-critical projects. Experience with academic and highly technical research, data incident response or issues management and the general concepts of device and platform security a plus. A minimum of 10 years experience in Public Relations, agency or corporate.", "preferred_qualifications": "", "education_experience": "Bachelor's degree or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541948"}