{"title": "Retail Supply Planner", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for a dynamic, highly motivated individual with strong analytic abilities to support Retail Store Operations. The individual will focus on Supply / Demand analytics to ensure the right supply is in the right place at the right time.", "description": "Primary responsibility is planning and fulfillment to meet product demand at over 300 of America’s Apple Retail Stores. Actively lead and maintain replenishment to stores using systems, reporting tools, and metrics. Provide the highest level of customer service and responsiveness to store requests and collaborate with key internal partners to ensure fulfillment of product demand. Experience in product planning, demand forecasting, inventory management, or supply chain management Strong Excel modeling and analysis skills Ability to think strategically and execute tactically with a persistent preciseness and a high level of comfort in analyzing data. Drive alignment of supply & demand plans with America's Supply Demand Management team Extraordinary communication skills, verbal, written and presentation, to all levels of an organization Able to exert tactful influence in a matrix organization MRP Expertise APICS, CPIM or IBF|CPF Certification a plus Exposure to Oracle Demantra and SAP desirable", "key_qualifications": "", "preferred_qualifications": "The Supply Planner (Inventory Planning/Store Replenishment) actively works with cross-functional partners and sources of supply to ensure timely fulfillment of retail product demand. Manage replenishment systems to ensure accurate product replenishment by SKU/store for assigned products. Manage overall inventory to ensure optimal levels while supporting number of turns and higher ranking customer levels. Manages in stock exceptions daily; react as needed to ensure product fulfillment to storefronts. Researches and expedites orders when appropriate. Work closely with regional and internal Logistics partners to optimize freight expense and expedite requests. Manages inventory levels during product transitions to minimize excess inventory and consumer impact.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556930"}