{"title": "K20 Education Leadership Executive", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. As an Education Leadership Executive, you will be a key part of our Education Sales team and will drive Apple’s core education messaging with customers focused on influencing education leadership to implement Apple solutions. You will be a trusted advisor to education leaders who are looking to Apple for guidance on driving change and transformation into their learning environment. This is a highly strategic role that requires working across complex environments, inspiring others, and making effective business decisions. Communicating with clarity is essential, as is the ability to form strong relationships with education customers and cross-functionally at Apple. Knowledge of educational structures and policies must be significant in both breadth and depth. An understanding of change management and a track record as an influencer are essential to success.", "description": "In this role, you will: - Drive market share with pedagogical system leaders to ignite learning outcomes and priorities. - Serve as a trusted advisor to education leaders helping them transform teaching and learning with Apple products and services at scale. - Design and implement pedagogical sales strategies from end to end. - Develop innovative projects to drive adoption and implementation of Apple Education’s solutions with a focus on collaboration and on the customer.", "key_qualifications": "", "preferred_qualifications": "School Board leadership level preferred. Master's degree or Doctorate preferred. Proactive; takes initiative and challenges the status quo. Excellent presentation and storytelling skills with the ability to motivate and inspire others. Strong team player with dynamic confidence in an education environment. Proven track record in leading and driving substantive change as a school or system leader.", "education_experience": "5+ years of experience in an academic leadership position. Extraordinary knowledge of the education market, from kindergarten to higher education, and a deep understanding of effective classroom technology. Experience in business development. Solid understanding of the Apple ecosystem. Bachelor's degree required. French fluency required. Apple is a global organization with offices worldwide and, as a result, candidates must be able to speak English.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555748"}