{"title": "Developer Relations Lead, India", "summary": "Apple is seeking a Developer Relations Lead in India. The lead will own and drive Apple’s developer centric technical evangelism and engagement strategy in this growing and vibrant developer market. The lead will also articulate the market opportunities and ambition to deliver impact and growth. A critical function of this role is to be the chief evangelist for Apple’s development tools, platforms, frameworks and services technologies in India. This role will manage a team of Partnership Managers and Tech Evangelists focusing on cultivating the culture of apps and games design with the best end user experience, optimized performance and creative innovations to deliver surprise and delight for both India and global markets...", "description": "-  Articulate developer opportunities in the market and provide developer market insights and leadership throughout the developer’s lifecycle experience in partnership with other developer facing teams across Apple\n-  Lead the team to achieve good-to-great of our developers’ apps and games and mobilize Apple resources to effectively amplify surprise and delight our developers deliver\n-  Own and drive annual developer community engagement plan, outlining opportunities and actions that lead growth and technical thought leadership, instilling half yearly reviews on what’s working, what’s not\n-  Lead and develop a strong bench of senior partnership managers and technical evangelists\n-  Act as a primary liaison between India market and Asia/WW for all local business needs and feature requirements. Influence developer related product and service feature roadmap, make clear and prioritized recommendations that improve developer and customer experience\n-  Devise and craft singular market narrative to enable clear understanding of market dynamics, customer voice, opportunity and set actions that all key stakeholders understand\n-  Become a visible and constructive member of the senior Developer Relations management team as well as the overall leadership team\n-  Be the guardian of developer messaging and positioning across every developer touch point, advancing the cause of excellence\n-  Possess expert knowledge of competitive and 3rd party developer products, services and strategies as well as the local regulatory situation that impacts developer community", "key_qualifications": "", "preferred_qualifications": "Curiosity, a passion for excellence, ability to ask the right questions, and the love of working as part of a team\nAbility to continually prioritize and multi-task in a dynamic, creative, fast paced environment\nHighly collaborative with exceptional interpersonal and relationship-building skills\nExceptional organizational skills and attention to detail\nExcellent oral, written, and presentation skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554623"}