{"title": "Car Experience Partner Engineer", "summary": "Our Car Experience team is looking for a hardworking, highly motivated systems engineer to help provide technical design and development support to automotive partners from initial concept through production launch. We expect your technical expertise in embedded systems and software development enables you to provide hands-on support to automotive systems developers in form of integration directions, technical specification clarification and failure assessment. Excellent user interface solutions excite you and you’re able to constructively critique product experience and design concepts. You’ll be interfacing with automotive industry engineering, designers and development executives to integrate CarPlay and other iOS car integration features into their systems, and to achieve the highest level of end customer quality. It would be great if you came with previous automotive software development experience, ideally in fields of infotainment, connectivity solutions or online applications.", "description": "You will join a hands-on development team that cultivates creativity and quality to deliver engineering excellence. We assist industry partners in developing first class automotive solutions and completing system certification activities with Apple. We track and triage partner issues with development and current shipping automotive systems. We also coordinate with cross-functional team members from a diverse array of groups across the company. Are you deeply accountable for your work? Your passion for product ownership and attention to detail will prove critical to your success on our team. You have excellent judgment and integrity with the ability to make timely and sound decisions. You are upbeat, adaptable, and results oriented with a positive attitude.", "key_qualifications": "Development experience on embedded automotive systems\nUnderstanding of automotive development, design-to-release\nBalanced expertise between technical development work and project management. Ownership experience. Responsible for a feature, product, protocol or interface\nFocus to create and enable great user experience\nExcellent problem solving skills\nProject updates and documentation\nExperience to engage with external development partners\nCreating and fostering industry relationships\nDriving initiatives with external development teams, i.e. system design, requirement review, debugging workshops. Experience in multi-functional collaboration\nProficiency in handling development escalations\nExperience with wired and wireless communication standards (USB, Wi-Fi, Bluetooth, NFC)\nExperience to assess usability concepts, to provide design feedback and constructive improvement suggestions\nTrack record to successfully multitask, prioritize & follow through\nExperience in authoring technical requirements and specifications\nSelf-starting and independent, working with limited supervision", "preferred_qualifications": "", "education_experience": "Bachelors in Computer Science, Electrical Engineering, or related degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517941"}