{"title": "Sr. Equipment and Process Development Engineer", "summary": "At Apple, we believe our products begin with our people. By hiring a team with varied strengths, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers.\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\nWe are looking for a highly motivated equipment and process development engineer to join Display Technologies Organization to work on module process development of new display and optics module architectures for future Apple products. \nThe engineer will be working in a highly technical and fast paced team from Apple’s Module Technology Center (MTC). The candidate is expected to work efficiently and smartly to design and bring up new equipment architectures, drive process DOE & optimization, summarize project data, communicate and report technical learnings to cross-functional collaborators and management. The candidate is expected to have multidisciplinary skillsets, with specialty in equipment design and hardware/software system integration.\nThis is a hands-on interdisciplinary development role that will require versatility across a variety of tasks in a highly collaborative environment.", "description": "Responsible for leading new equipment system bring up and module process development for new product pilot line. \nConvert incubation technologies and proof-of-concept equipment and process into scalable and executable solutions, and validate through module process optimizations and builds. \nHands-on design, modify, test, and refine hardware equipment and systems to enable reliable and repeatable process validation. \nHands-on module process validation and builds in labs, including resource and DOE planning, empirical validation trials, characterization, data analysis and visualization, parameter optimization, documentation, sharing and reporting results. \nCollaboratively work with cross-functional teams to plan and align the validation plan & build activities, and demonstrate technical results / issues to executives.", "key_qualifications": "Hands-on experience in designing, building and optimizing mechanical / electrical / optical equipment.\nHands-on experience in designing, building and testing automated control systems to integrate mechanical / electronic / optical components, sensors and process EQ.\nDemonstrated experience in process development, characterization, and data analysis to enable, improve and realize new design architectures\nDemonstrated experience in high precision manufacturing process and equipment.\nGood technical communication to drive cross-functional planning & alignment, demonstrate development results and communicate technical issues to executive management.\nFlexible and collaborative, willing to work in fast-paced lab environment.\nAttentive to detail, with demonstrated ability to work with teams to produce professional, high-quality results.\nMechanical: 3D CAD (i.e. NX, Solidworks), GD&T, and manufacturing materials & techniques.\nControl & Programming: Control systems and software interface (i.e. Labview, Python), Mechatronics and robotics, Sensing technology and integrations.\nData analysis: Data processing and visualization using Matlab, Python, JMP, or similar tools.", "preferred_qualifications": "", "education_experience": "MS or Ph.D. degree in relevant engineering field with minimum 5 years of experience is preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545356"}