{"title": "Performance Modeling Architect - Technical lead", "summary": "Passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. We are looking for a highly motivated technical leader with hands-on experience who is passionate about performance engineering and performance modeling of sophisticated SoC features.You will be joining a team of extraordinary engineers and interacting daily with software and hardware engineering teams across Apple.", "description": "Technically lead areas of the performance architecture. Collaborate with Platform Architecture, Microarchitecture and core software teams to Lead, develop, model and analyze performance features in modern and sophisticated SoCs. Analyze workloads to identify performance bottlenecks and opportunities Perform self-guided performance simulation studies of architectural alternatives Write and maintain features, sections and tools of the architectural performance model Develop and implement C++ model and interface it to the different agent models and software simulation platforms Define and document performance targets and details of interesting and important use cases", "key_qualifications": "", "preferred_qualifications": "Strong SoC architecture knowledge, micro-architecture knowledge, and an understanding of competing architectures\nExperience working in a performance modeling environment\nStrong knowledge and proficiency in software development in C/C++\nProficient in scripting languages such as Python\nAbility to conduct experiments in all phases of design, gathering and analyzing data; and to utilize scripting/spreadsheet to document and present results\nKnowledge and experience with common performance benchmarks and workloads\nExperience technically leading small teams", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557354"}