{"title": "Software Engineer, Partner Solutions & Tech", "summary": "Imagine what you could do here. The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Our ideal candidate must have demonstrated expertise in the web technologies with proficiency in the Java/J2EE stack. Design and develop innovative solutions using micro service architecture; Analyze business requirements, identify gaps, translate them into technical design. Solid engineering capability with an eye towards performance, scalability and quality. Communicate effectively with partners and engineers; participate in design reviews, code reviews, write effective JUnits; Analyze and debug production issues and provide timely solutions.", "key_qualifications": "- 5+ years of experience with Java and J2EE, Java related technologies: Spring Framework, JUnit / TestNG.\n- Strong knowledge and understanding of data structures, algorithms, design patterns, concurrency, multi-threading, scalability, fault tolerant designs, enterprise architecture and software engineering principles\n- Solid understanding of data modeling and database systems using NOSQL technologies\n- In-depth knowledge of technologies such as Web Services, XML, JSON, HTTP, SSL, TCP/IP, Caching solutions, application performance tuning\n- Experience in Designing and developing Application layer in SOA/Micro Services landscape\n- Experience in designing systems with high performance, scalability and availability\n- Experience with messaging systems like Apache Kafka or similar technologies\n- Experience with CI/CD tools like Git, Ansible, Jenkins and others\n- Nice to have experience with search engines like Apache Solr or similar\n- Ability to work in a collaborative team environment\n- Curios and a willingness to learn new technologies along with a positive and enthusiastic attitude\n- Familiarity with OS X, Linux, Shell Scripts\n- Familiarity with public cloud environments like AWS, GCP and others\n- Knowledge of containerization concept like Docker, Kubernetes and others\n- Experience in Content Management Systems ( CMS ) is a plus.", "preferred_qualifications": "", "education_experience": "Bachelors degree in Computer Science, or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530586"}