{"title": "Software Quality Engineer - Mail, Messages and FaceTime", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Internet Technologies QA & Ops team is seeking an experienced and passionate software quality engineer to take our existing regression defense to the next level. Our teams design and engineers the communication cornerstones of iOS, macOS, watchOS and visionOS for: FaceTime, Mail, Messages and Phone applications. We're looking for critical thinkers to play a key role qualifying Apple’s software releases and ensuring a high-quality customer experience. We need someone who is comfortable working in an exciting environment with rapidly changing priorities, and someone creative and inspired to invent new ways to help build better products.", "description": "You will be responsible for planning, crafting, maintaining and executing test cases. You will work to identify, reproduce and isolate bugs found through concise bug reporting. Excellent communication skills are a requirement due to the high level of interaction with engineering teams, management and other organizations within Apple. You will need to be highly technical, organized, creative, motivated, and passionate about achieving results.", "key_qualifications": " ", "preferred_qualifications": "Automation/coding experience in Python, Swift, or similar languages.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,100 and $222,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558236"}