{"title": "Software Optimisation Intern (m/f/d)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Multifaceted, amazing people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? At Apple, we are pushing the boundary of what is possible to improve the lives of our customers. Come join a world class group in Platform Architecture focused on low level software performance optimization. We are seeking a highly motivated, innovative, and dedicated intern to join the Platform Architecture Software Performance Optimization Team. We are a group that is driving performance improvements in software running on Apple silicon as well as Apple software and hardware itself. Join us!", "description": "In this role you will work on the analysis of existing and new workloads to identify performance bottlenecks in the hardware and/or software. Working with your colleagues you will address performance limitations in application software, and deliver prototypes of software tools helping with performance characterization. Engineers in Platform Architecture at Apple work on lower-level implementation details. The successful intern candidate will be amenable to working in a dynamic, collaborative environment. The person filling this position must be a hands-on, enthusiastic, self-motivated developer with strong initiative and desire to succeed in a challenging environment.", "key_qualifications": "", "preferred_qualifications": "Strong debugging and problem-solving skills\nAvailable for 9-12 months\nPreferably close to finishing a degree program", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553267"}