{"title": "Cross Functional Test Lead, Retail Engineering", "summary": "Imagine what you could do here! At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The IS&T Retail Engineering Programs team is looking for a Cross Functional Test Lead to join our group. We are looking for someone who can be responsible for planning, coordination, execution, and continuous improvement of processes for end to end integration testing.", "description": "We are looking for a self-motivated individual with strong technical and interpersonal skills who can contribute in a team environment. This candidate must be able to create and present risks and mitigations to Senior Management. Day to day work involves the following: We are looking for someone who can lead testing efforts for multiple cross functional retail projects with concurrent timelines. This person will establish QA standards, guidelines, technologies, and approaches for the projects and for the testing team. Other day to day work involves managing and coordinating onsite and offshore testing team activities, actively participating in development and execution of test processes, strategies, and plans, working with Automation Lead to reduce regression test cycles with goal of 100% automation, and working with the business, technical project development teams, and project managers to establish project development schedules implement test plans to deliver high quality product releases.", "key_qualifications": "Empty", "preferred_qualifications": "Able to quickly identify and understand issues. Outstanding team player with excellent interpersonal skills and ability to work cross functionally. Excellent written, verbal communication and presentation skills. Able to collaborate with business partners, developers, and various support teams to troubleshoot and resolve defects and issues.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559202"}