{"title": "Production Services Engineer, Employee Experience & Productivity, Early Career", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives.", "description": "The IS&T Broadcast Services team is looking for a broadcast systems engineer to join the team and play a critical role in working on engineering projects as well as in supporting live broadcast events. In this role you will be working on various aspects of our broadcasting and live streaming platform, such as production, encoding, transcoding, packing, delivery, playback and analytics. Responsibilities include: Develop, test and support scalable and reliable broadcasting and live streaming solutions using various technologies and frameworks. Work with multiple internal and cross functional teams to understand systems, workflows, and issues. Provide support for Production, Post-Production, Transmission activities and related tasks. Work to quickly resolve issues and advance to the appropriate teams and individuals when needed. Update documentation such as standard operating procedures for the team. Provide setup and configuration assistance for broadcast control room production equipment and staff as needed. Ability and flexibility to work within a 24x7 emergency response as needed. Limited travel as required.", "key_qualifications": "Experience in broadcast and streaming engineering and operations. Experience with broadcasting and live streaming protocols such as HLS, DASH, RTMP, etc. Experience with video and audio code such as H.264, HEVC, AAC, etc. Education: BS/BA in Computer Science/Engineering or equivalent is preferred - equivalent or relevant field experience acceptable.", "preferred_qualifications": "Ability to support complex workflows for broadcasting events using multi-vendor technologies such as AWS, Arista, etc. Experience with streaming media security and DRM. Good understanding of AWS media services. Experience with automation tools and scripts. Ability to work collaboratively with multiple multi-functional teams. Excellent verbal and written communication skills.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557390"}