{"title": "Caffe Macs Line Cook", "summary": "The people here at Apple don’t just build products - they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do. Joining the Caffè Macs team will give you the opportunity to craft inspiring meals that fuel the innovation within the company.\n\nAs a Line Cook you are responsible for the daily preparation and cooking of food items in the pantry, fry and/or stations or other areas of the kitchen. This position is responsible for other duties in the areas of food and final plate presentation including plating and garnishing of cooked items. This position reports to the Chef, Sous Chef, or Kitchen Manager.", "description": "You will set up your food station according to Caffè guidelines and prepare all food items as directed in a sanitary and timely manner. Follows recipes, portion controls, and presentation specifications as set by the restaurant. Restocks all items as needed throughout shift. Maintains a clean and sanitary workstation and practices good safety and organizational skills. Assists with the cleaning, sanitation, and organization of kitchen, walk-in coolers, and all storage areas. Performs additional responsibilities, as requested by the management team at any time.\n\nWe serve our campus by maintaining a first-class level of food-safety and cleanliness standards at all times. This includes maintaining a tidy station before/during/after service hours. Our work areas are kept clean and clutter-free while you maintain our equipment and tools. Under the supervision of a Kitchen Manager, each Cook receives detailed instructions for the day to include opening/closing duties, and services duties. Executes multiple tasks with direction to complete daily menus. You will execute various kitchen tasks as set out by Lead Cooks and Kitchen Manager. We need people who know and are willing to learn appropriate methods for each task, managing time in each task appropriately, and have a general understanding of cooking techniques, methods, and kitchen equipment. You should also stay up to date on health and food safety rules.", "key_qualifications": "Do you have a basic understanding of professional cooking and knife handling skills, appropriate cooking methods and techniques?\nUnderstanding and knowledge of safety, sanitation and food handling procedures.\nBeing able to multi-task, work quickly, and effectively within a team\nCommunicates clearly, listens attentively to staff, peers, managers, and guests\nFlexibility and adaptability to work calmly and effectively under stress\nAbility to take direction and work effectively in a team environment\nProblem-solving abilities, be self-motivated, and organized\nDedication to quality service and expectations\nYou should have an approved Food Handler’s Card and non-slip shoes prior to the first day of work.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "This position will spend time sitting and standing\nThings happen fast here. Bring your ability to multi-task in a high-volume experience and your love for working in a fast-paced environment.\nEnvironmental exposure to cold, heat and water\nLift up to 50 pounds\nAble to understand sanitation directions", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $27.75 and $36.35/hr, and most new hires start at $27.75. Your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544719"}