{"title": "SWE - GPU ML Engineer, GGD", "summary": "Apple’s Compute Frameworks team in GPU, Graphics and Displays org provides a suite of high-performance data parallel algorithms for developers inside and outside of Apple for iOS, macOS and Apple TV. Our efforts are currently focused in the key areas of linear algebra, image processing, machine learning, along with other projects of key interest to Apple. We are always looking for exceptionally dedicated individuals to grow our outstanding team.", "description": "Our team is seeking extraordinary machine learning and GPU programming engineers who are passionate about providing robust compute solutions for accelerating machine learning networks on Apple Silicon.\n\nRole has the opportunity to influence the design of compute and programming models in next generation GPU architectures.\n\n-Responsibilities:\n    * Adding optimizations in machine learning computation graph.\n    * Defining and implementing APIs in Metal Performance Shaders Graph, investigating new algorithms.\n    * Develop/maintain/optimize ML training acceleration technologies.\n    * Support adoption of GPU-accelerated training across 1st and 3rd party clients.\n    * Tune GPU-accelerated training across products.\n    * Performing in-depth analysis, compiler and kernel level optimizations to ensure the best possible performance across hardware families.\n\n- Intended deliverables:\n    * ML training GPU acceleration technology.\n    * Optimized ML training across products.\n\nIf this sounds of interest, we would love to hear from you!", "key_qualifications": "Proven programming and problem-solving skills.\nGood understanding of machine learning fundamentals.\nGPU compute programming models & optimization techniques.\nGPU compute framework development, maintenance, and optimization.\nMachine learning development using one or more ML frameworks (TensorFlow, PyTorch or JAX).\nExperience with adding computational graph support, runtime or device backend to Machine learning libraries (TensorFlow, PyTorch or JAX) support is a plus.\nExperience with high performance parallel programming, GPU programming or LLVM/MLIR compiler infrastructure is a plus.\nExperience with system level programming and computer architecture.\nBackground in mathematics, including linear algebra and numerical methods.", "preferred_qualifications": "", "education_experience": "Technical BS/MS degree and Equivalent experience.", "additional_requirements": "Strong communication and collaboration skills\nStrong background of building high performance, production quality software on schedule.\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to allapplicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536347"}