{"title": "Design Integration Engineer", "summary": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply.", "description": "As a Design Integration Engineer, you will be involved with all phases of implementing high performance, low power wireless SoCs from RTL to delivery of our final GDSII. Your responsibilities include but are not limited to: - Generate chip or block level static timing constraints. - Synthesize design with UPF/DFT/BIST. - Close timing on critical blocks by working with design and PD teams. - Perform timing optimization and implement the design for functionality. - Generate and implement functional ECOs. - Run static timing analysis flows at chip/block level and provide guidelines to fix violations to other designers. - Participate in establishing/improving CAD and design flow methodologies. - Work with multi-disciplinary groups to make sure designs are delivered on time and with the highest quality by incorporating proper checks at every stage of the design process.", "key_qualifications": "Knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation. Understanding of UPF and low-power design & implementation techniques. Hands-on experience in timing/SDC constraints generation, analysis, and management. Knowledge of timing corners, operating modes, process variations, and signal integrity-related issues. Exposure to industry standard Timing, Logic Equivalence, Physical Design and Synthesis tools. Knowledge of basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixes and functional ECOs. Experience with script-based tool automation and familiarity with API’s and scripting languages such as Perl/Tcl is a plus.", "preferred_qualifications": "", "education_experience": "BS with 3+ years relevant experience required. MS preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542993"}