{"title": "Senior RFIC Design Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs Sr. RFIC Design Engineer within the Wireless Radio team, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products.", "description": "As a Senior RFIC Design lead, you are going to be responsible for providing RFIC solutions for wireless SoC and driving them to mass production for Apple’s Wireless Connectivity products. Responsibilities include:\n- Lead design of radio transceiver chains including TX, RX, and PLL-LOGen for wireless connectivity products. \n- Drive radio KPI (power, area, performance) to meet product requirements.\n- Work with cross-functional teams including platform architecture, wireless design, RF HW and SW to define radio features enabling wireless innovation.\n- Work closely with RF Systems in block level and high level specifications of the TX and RX line ups and PLL-LOGen, and proper distribution of spec margins in the chain. \n- Hands-on design contributions starting from concept, architecture, and topology to transistor-level feasibility studies and KPI trade-off analysis to actual design, simulations, and extractions.   \n- Design of RF and Analog loopbacks for calibration and compensation.   \n- Work through Co-Existence scenarios and design to meet the CoEx requirements.\n- Oversee the floorplan layout and verification of the design to ensure a successful tape-out. \n- Close collaboration with RFIC test engineers in the bring up, debug and optimization of the wireless connectivity chip through the productization.\n- Provide design versus silicon measurements correlation, and compliance with specification for a volume production. \n- Work with the foundry team to understand the capabilities, and limitations of the new technology nodes to achieve the optimum radio performance. \n- Provide guidance on analog and RF issues across Apple.", "key_qualifications": "Typically requires 10+ years of RF/analog and mixed-signal design experience in cutting-edge RF CMOS design.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience. MSEE and PhD is preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200514200"}