{"title": "Software Architect (Java and React JS)", "summary": "The IS&T Product Engineering Systems group is seeking a SW Architect who has a consistent track record in crafting and developing high quality enterprise software solutions! Our group is responsible for Enterprise Product Lifecycle Management (PLM) transformation initiative to deliver next generation PLM/PIM(Product Information Management) Platform to drive Apple’s Product Innovation across hardware, software and services lines of business. We are looking for someone with experience in building and delivering large scale, on-premises, and cloud-based enterprise solutions. This individual should have sound technical knowledge and leadership skills!", "description": "Join the IS&T Product Engineering Systems group as Software Engineer, where you will help build innovative enterprise software applications. Your responsibilities include: - Working with the business partners to define the project requirements - Developing architecture and detail design; implementation and maintenance - Ownership of all engineering and product feature work in release cycles - Design and develop solutions for scalability, extensibility, security, and performance - Must be able to communicate and work with multi-functional IS&T and Business groups - Must be self-motivated, creative, operates with minimal directions with on-time results - Strong multi-tasking skills are crucial This is a technical architect role that will demonstrate your experience designing complex data/integration architectures and leading other developers and vendors to deliver the solution. You will also enjoy the benefits of working in a fast-growing business where you are encouraged to 'Think Different' and where your efforts play a key role in the success of Apple's product design and innovation.", "key_qualifications": "15+ years of experience developing enterprise applications using Java/J2EE, including Web Services (e.g., RESTful, SOAP), Spring Framework and SpringBoot, and ORM (e.g. Hibernate) Experience with micro-services architectures and container-based deployment (e.g. Docker, Kubernetes) Strong web development skills, including JavaScript, NodeJS, React, and Bootstrap Experience with Relational Database Management Systems (RDBMS) and SQL, as well as multi-modal NoSQL databases, including DocumentDB and GraphDB Experience working with distributed teams using collaboration tools for software configuration management (e.g. Git / GitHub), agile project management (e.g. Jira), and knowledge repositories (e.g. Confluence / wikis) Effective interpersonal, analytical and communication skills", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience in Computer Science or related field", "additional_requirements": "- Experience with Extraction, Transformation, and Load (ETL) technologies, data replication, and event streaming - Experience with Cloud solutions, like Infrastructure as Code (e.g. CloudFormation), Configuration as Code (e.g. Ansbile), Elastic Computing, Virtual Private Clouds (VPCs) - Proficiency in Test Driven Development (TDD), Continuous Integration / Continuous Deployment (CI/CD), and DevOps best practices - Experience working with business to define, track, and manage usability and performance metrics to ensure proper service levels", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533991"}