{"title": "Baseband Hardware Design Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "This is an EE (a.k.a baseband HW) position in the Hardware Technology group of Apple and it is one of the most diverse roles out there! This team is responsible for the digital and power management domain of all wireless chipset in Apple products from concept to product announcement. During architectural stage you will work with world-class architects and IC designers on next-gen chipset’s Power/Digital/Clock management. During development, you will drive schematics/layout/bring-up of both development and form factor HW. You will debug HW/SW/Co-existence issue that are often seen only by the scale and volume of an Apple product. You will also have the full weight of the world’s leading contract manufacturer behind you in factory prototype support. This role also requires heavy multi-functional collaboration with other teams (Apple SoC, battery, sensors, iOS…etc) and therefore, you will also maintain a firm grasp of the entire product landscape outside of wireless design.", "key_qualifications": "", "preferred_qualifications": "Experience with voltage regulators, LDO, switch mode power supplies (SMPS)\nExperience with high-speed and low-speed digital interfaces, e.g. PCIe, SPMI, I2C, UART, etc.\nBench-level design verification experience with high-speed oscilloscopes\nSignal/Power integrity simulation experience with Matlab, PowerSI, SIwave, HFSS, etc.\nStrong problem solving and analytical skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557388"}