{"title": "Cloud Data Engineer", "summary": "Apple is seeking an experienced cloud data engineer to join our worldwide business development and strategy team. This is an opportunity to play a crucial role in defining and delivering cloud based analytical and big data solutions that have a substantial impact on our business. If you are someone who looks forward to solving complex business problems and is excited about this opportunity, please get in touch with us!", "description": "We are looking for a cloud data engineer to help define and deliver cloud based data solutions and technical strategies across our product portfolio. You will design, implement, and test data solutions to provide efficient analytical and reporting capabilities across Apple’s global and regional sales and finance teams. Your responsibilities will include: Designing, building and operating innovative data solutions that can scale and apply various technologies and frameworks to solve our complex business requirements. Driving innovation within a technical team by playing a lead role in technology decisions for the future of our analytical and reporting needs. Collaborating closely with cross-functional teams to optimize our data infrastructure for performance, scalability, and cost-efficiency, while continuously monitoring, improving cloud data systems’ performance. Conducting thorough analysis and forecasting of compute and storage costs, and implement strategies for cost optimization and resource utilization. Developing highly scalable data pipelines and fine tuning, supporting existing pipelines as needed. Collaborating with data scientists, engineers, and other partners to support data modeling, analysis, and reporting needs. Ensuring compliance with data governance and security policies, including data encryption and access controls.", "key_qualifications": "Expertise in designing and implementing scalable and secure data storage solutions in the cloud, ensuring optimal performance, cost and accessibility. Hands on experience using cloud services and tools to automate data workflows and streamline the data engineering process. Proficiency in database design and development with relational, non-relational, and OLAP databases. Solid understanding of cloud cost management principles and experience in forecasting and optimizing compute and storage costs. 5+ years of proven experience designing, and implementing large scale data solutions in public cloud(s) and big-data platforms like Spark, Dremio, Hadoop, Hive, etc... 3+ years of proven experience operating big-data platforms or data-planes. 3+ years demonstrated ability designing and developing of custom ETL pipelines using SQL, and/or scripting languages (Python, Shell, etc...). Familiarity with version control systems, CI/CD practices, testing, and migration tools for database and software. Experience with implementing cloud security best practices for data platforms, including handling sensitive datasets. AWS Data Engineer Associate certification (preferred).", "preferred_qualifications": "", "education_experience": "Bachelors or Masters degree in Engineering / Computer Science", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550890"}