{"title": "Channel Fulfillment Lead (Japan Market)", "summary": "The mission of Pacific Reseller Operations is to be the voice of Reseller Channel within Operations to ensure our products are in the right places at the right time, supporting Sales and our Partners to achieve Apple’s financial goals. We are passionate about crafting and managing our supply chain as efficiently as possible, in order to improve sell-through while striving for a streamlined Channel Fulfilment and Returns experience for our partners. Within the Reseller Operations team, the Channel Fulfilment Lead is responsible for driving continuous innovation by crafting practical solutions to complex cross-functional recurring issues that enable fulfilment and execution with speed, cost and quality at the highest levels.", "description": "- Accountable for Channel Fulfilment, Order and/or Returns Management process for one or more sub-regions and/or lines of business\n- Use advanced analytics to help improve the efficiency of key business processes. \n- Work with data warehouse architects and software developers to generate seamless business intelligence solutions for business partners\n- Perform ad-hoc and reoccurring statistical analyses\n- Own and regularly supervise/trend key performance indicators, root causes issues, design preventive solutions and acquire leadership agreement by influencing without authority \n- Own and strategically pipeline opportunities, design and rollout sustainable solutions with the goal of optimising cost, fulfilment, efficiency and scale in execution for Pacific Operations\n- Responsible for leading sophisticated projects, providing updates to Leadership on execution insight and performance, and inspiring change within and across functional departments. \n- Lead and represent Pacific Operations in Global or Regional Capital / Non-capital projects involving Business Requirements Definition (BRD), Partner Reviews and Implementation Testing\n- Plan and lead New Product Introduction execution activities such as Launch execution strategy, System Configurations, Order Repricing/Cancellations and Returns when required\n- Japanese language is mandatory as this role will take care of Japan market as their main portfolio", "key_qualifications": "Self-starter that takes initiative, accepts change and has an affinity to challenge the status quo\n- Extensive experience working as a data/business analyst, or related role\n- Experience with data analytics and modelling techniques, programming skills in Python / R and advanced analytics such as Excel Macros, VBA and Tableau would be a great advantage\n- Strategic problem-solving ability to design and operationalize solutions from concept to implementation independently\n- Strong verbal and written communication skills with the capacity to foster relationships and influence across various levels of the organization ranging from executives to peers\n- Consistent record to build presentations, pitch ideas and obtain consensus from all team members (incl Senior executives)\n- Experience in an Operations role such as but not limited to Industrial Engineering, Fulfilment, Returns & Logistics Management will be an added advantage.\n- Expertise in ERP and reporting tools such as SAP will be an added advantage.", "preferred_qualifications": "", "education_experience": "A bachelor is required in fields such as Engineering, Statistics, Mathematics, Operations, Business Management or Finance\nMaster's degree is helpful but not required (Business Analytics or Operations, Supply Chain or Business Management)", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity! We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517967"}