{"title": "Sr. Engineering Program Manager -  Apple Service Engineering (ASE)", "summary": "The ASE iCloud Platform PMO team is looking for passionate, motivated individual looking to contribute to the extraordinary services and products we offer at Apple. You will partner with teams whose mission is to build, maintain, and improve the platform and product layer of Apple’s most critical cloud services. Your work will focus on Content asset lifecycles and analytics platform services, features, reliability and scalability while also passionate about defining and implementing standard processes that improve our operational efficiency.", "description": "Drive processes and best practices to develop, build, qualify, and release high-quality software to internal and external audiences Manage and communicate program/release schedules with clear dependencies, driving alignment across the organization Drive on-time development and delivery, establishing checkpoints, and re-planning as events warrant We are seeking an expert program manager for the Apple Services Engineering. Technically curious, you will autonomously lead multiple projects and tracks of works of varying scale and complexity with cross-functional and geographically dispersed development teams with only consultative direction from leadership. With strong analytical and communication skills lead and review business requirements across all levels of the organization. Ensure transparency and establish expectations for services requested while developing and executing processes, frameworks, metrics, project plans, defining scope, schedule, deliverables and resources. You will prioritize team activities and drive resolution of issues across all areas of the program while communicating strategic direction, status and issues to teams, leadership and other partners. You will drive focused concise program operations. You will advise and carry out risk assessment and mitigation plans as needed. Execution is critical so you can drive maturity in programs while continuously working to improve the software development lifecycle process within the org. You must have a successful track record of being a great partner to represent the iCloud Platform Engineering teams, with other internal and external organizations within Apple.", "key_qualifications": "N/A", "preferred_qualifications": "Proficient in software development processes (SDLC) Experience with content and lifecycle management a plus. Blob storage or storage optimization a plus. Experience with partnering with data analytics platforms.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560190"}