{"title": "Senior Environmental Analyst - Environmental Data Engineer", "summary": "Are you passionate about reducing environmental impacts through innovative designs? Do you have experience with life cycle assessment or advanced data analysis and want to use it to affect real- world change? Are you excited working at the cutting edge of technology and seeing it make its way into products at scale? We are looking for a candidate to help us design world-leading products with lower environmental impacts. We use a combination of detailed measurements, comprehensive modeling, and targeted engagements with design teams to drive strategic and relevant environmental initiatives.", "description": "The Environmental Metrics and Design team at Apple has developed some of the most detailed carbon and material models for our products. Our methods are rooted in life cycle assessment (LCA) and material flow analysis (MFA), but cover a range of fields within science, technology, and engineering. We are determined to uncover where impacts occur within our products and product supply chains, find opportunities to mitigate those impacts, and drive initiatives to reduce them. You will be advancing these models by seamlessly integrating supplier reported data and identifying hot spots for strategic environmental initiatives. You will build partnerships with various teams across Hardware, Supply Chain Operations, suppliers and industry experts to develop a comprehensive supply chain environmental data strategy to standardize supplier data and influence industry data standards. Your work will help bring efficiency to environmental data management and apply the latest data models to reduce environmental footprints across Apple products and beyond.", "key_qualifications": "Scientific computing skills, including data analysis, visualization, and working with large datasets. Programming experience with SQL/Python/R and advanced spreadsheet capability required. Comfortable developing assumptions, working and making decisions with limited and imperfect data, and quantifying and identifying sources of uncertainty. Familiarity with environmental indicators and impacts, particularly with respect to carbon, water, energy, and resources. Ability to understand data protocols/standards and improve on them.", "preferred_qualifications": "", "education_experience": "BS degree required; MS and PhD degrees welcome; engineering or operations background strongly preferred.", "additional_requirements": "- 10+ years of relevant experience\n- Self-motivated, enthusiastic, detail-oriented, and insatiably curious.\n- Comfortable with uncertainty and ability to cut through ambiguity, knowing when to dive deep vs. focus on the big picture.\n- Excellent at written and verbal communication, comfortable navigating cross-functional relationships.\n- Comfortable presenting to and working with both technical and non-technical teams through powerful visualizations.\n- Experience with data manipulation and maintenance of large data sets with varying granularity and formats.\n- Experience with Machine Learning tools a plus.\n- Experience with LCA methods, modeling approaches, data, and applications. Fluency with one or more professional LCA software packages (e.g., GaBi, SimaPro), including architecting and running complex, multi-parameter models is a plus.\n- Familiarity across a wide range of technologies/supply chains such as IC’s, cameras, sensors, displays and batteries is a plus.\n- Willingness to travel domestically and internationally (10% time)", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $195,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551654"}