{"title": "AIML – Sr Full-stack Software Engineer, Data Operations", "summary": "Imagine what you could do here. Are you excited to take on big challenges that could create a positive impact for billions of people? Are you passionate about building elegant product experiences with a world-class engineering and design team? Do you have a passion for solving complex business and user problems with high-quality software?\n\nAt Apple, great ideas quickly become extraordinary user experiences.\n\nApple’s central AIML organization is looking for a talented full-stack software engineer to join our Data Operations engineering team.", "description": "Our broader organization is responsible for delivering high-quality, human annotated, machine learning data at scale for product teams across Apple. We are both an operations engineering team and a trusted partner in the development of Apple’s consumer software and hardware experiences.\n\nThis global data annotation and collection initiative enables Apple to create amazing machine learning driven experiences and advance flagship experiences like Siri, Photos, Vision Pro and more. Our team delivers custom, high-value, scalable, self-service solutions to accelerate the machine-learning data annotation program such as reinforcement learning from human feedback (RLHF) at Apple. We are an Agile product and engineering team making and augmenting user experiences by providing insights into key metrics, creating automated work flows, and providing services, APIs, and user-interfaces to a diverse set of stakeholders.\n\nWe build and maintain cloud-based services, large-scale data pipelines, web applications, and native applications (iOS and macOS). Robust, predictable, scalable, monitored, efficient and highly-available services are critical to our success.\n\nWe are a user-focused, multi-disciplinary team of exceptional designers, product managers and software engineers with a variety of backgrounds. We embrace diverse opinions, open debate, taking risks, and are always looking to grow as a team. We work backwards from our customers' needs.\n\nThis role is focused on distributed systems engineering and with specific responsibilities including:\n- Definition of vision and strategic plans\n- Ownership of multi-functional and cross-organizational programs as the “directly responsible individual”\n- Partnering with leaders and engineers to influence and define execution plans\n- Fostering a collaborative culture of excellence both within the Data Operations Engineering team and across Apple\n- Design and evaluation of software and infrastructure architectures\n- Creating prototypes and/or proof of concepts to demonstrate that a proposed solution would work\n- Mentorship of junior engineers and technical leaders\n- Research on industry landscape and technology developments\n- Authoring technical reports and presentations\n- Presenting to audiences at varying levels of the organization\nIf you are a software engineer and technical lead who has excellent engineering practices and a sharp focus on customers, then come join us!", "key_qualifications": "N/A", "preferred_qualifications": "Exceptional candidates may have experience with one or more of the following:\n- Familiarity with or interest in Agile software development processes (Scrum, Extreme Programming, or similar).\n- Experience with parallel distributed computing systems like using Spark or Hadoop.\n- Experience with more than one modern programming language.\n- Experience with databases and strong SQL skills.\n- Experience using Infrastructure as Code orchestration systems (Terraform, Pulumi, or similar).", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551324"}