{"title": "Software Update and Mobile Asset Engineer", "summary": "Be part of the team that keeps billions of Apple devices up to date on the latest operating systems! The Core Operating Systems team is looking for talented problem solvers with a deep understanding of computer architectures. Identifying and mitigating possible problems in a sea of a billion devices is the ultimate reliability challenge. A problem affecting 1% of the 1 billion+ device population still affects 10 million devices! Are you up for the challenge?", "description": "Identify failure patterns in incoming reports, through aggregate user reports, analytics and logging that you will augment. Investigate failed software issues, and devise tools and methods to isolate the problems encountered. Communicate the top issues and trends, helping teams across the company to get the right solution. Develop new features and improvements in the operating system to improve asset delivery reliability.", "key_qualifications": "Programming skills in C. Objective C, Python and Object-oriented programming knowledge is a plus. Strong debugging skills are a must, particularly post-failure analysis. LLDB debugging expertise is a plus. Should be familiar with compiling and building complex systems. Knowledge of Xcode is a plus. Should be familiar with OS trouble shooting. Apple product specific knowledge is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in CS/CE/EE (or equivalent, or related field)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550439"}