{"title": "Sr. Platform Engineering Leader, Apple Services Engineering", "summary": "People at Apple don’t just build products. They craft the kind of experiences that have revolutionized entire industries. The diverse collection of our people and their ideas inspire innovation in everything we do.", "description": "This role entails leading a dynamic team tasked with developing a state-of-the-art observability data platform and warehouse. This system is designed to provide near real-time insights, facilitating deep data engineering queries, expediting diagnostic processes and issue resolution for Site Reliability Engineers (SREs), and providing a crtical foundation for our Observability reporting capabilities. A key aspect of this position involves fostering collaborative partnerships with various platform teams to ensure a seamless data integration process. As a distinguished technical leader, the successful candidate will be encouraged to establish and maintain trustful working relationships with Directors, Senior Directors, and Vice Presidents, as well as with peers across multiple engineering disciplines, contributing teams, and key stakeholders. Furthermore, a significant responsibility of this role includes nurturing the growth and development of both engineering managers and engineers within the team.", "key_qualifications": "Leadership and Management: Over a decade of experience leading and managing diverse teams, with a proven track record in fostering cross-organizational collaboration to achieve high-impact results. Leadership Development: Demonstrated success in mentoring managers and individuals to evolve into high-performing leaders, with a focus on delivering transformative results across various teams and organizational structures. Strategic Alignment: Exceptional ability to synchronize engineering initiatives with overarching company goals, underpinned by a deep understanding of the strategic implications of technical decisions. Technical Strategy Integration: Distinct expertise in connecting technical team efforts with broad organizational strategies, ensuring engineering projects are in alignment with key business objectives. Big Data Architectural Expertise: Proven capability in designing and deploying comprehensive big data solutions that prioritize a unified user experience. This includes integrating a spectrum of big data technologies, platforms, and tools to streamline data handling processes from ingestion to insight generation, underpinned by scalable, high-efficiency data architectures that demystify complex interactions and enhance accessibility to critical insights.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in a technical discipline required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $208,300 and $360,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545876"}