{"title": "AIML - Senior Engineering Manager, Siri", "summary": "Would you like to play a part in the next revolution in human-computer interaction? Join the Siri team at Apple. Contribute to a product that is redefining mobile computing, build groundbreaking technology for Apple intelligence. Transform how people keep up with the world and work with the people who crafted the intelligent assistant that helps millions of people get things done — just by asking. The Siri team is seeking an exceptional engineering manager to lead our engineering efforts in the Siri platform. As Apple continues to ship more devices, providing a consistent, responsive, and high-performance experience is critical for our users. This is a great opportunity to impact Siri across all of Apple’s devices and play a critical role in ensuring we can deliver new experiences on a range of hardware with different capabilities.", "description": "In this role, you will support an existing team and will help to define its charter, working closely with partner teams both inside the AIML organization and across Apple to find innovative ways to improve performance, drive down memory usage, and manage thermal challenges across all devices supporting Siri. Core Responsibilities - Lead the investigation, analysis, and development of platform engineering work across the Siri platform team. - Manage a highly talented team of software engineers. - Collaborate with cross-functional teams to understand the constraints of different hardware and platforms, align on goals, and drive innovative solutions to engineering challenges. - Work with AIML and Apple partner teams to ensure a phenomenal user experience.", "key_qualifications": "", "preferred_qualifications": "Demonstrable experience leading cross-functional projects that have had a tangible impact on the direction of the org Strong organizational skills and experience working on large multi-functional teams Strong Computer Science fundamentals, object-oriented programming, and design skills Excellent problem-solving, critical thinking, and communication skills", "education_experience": "BS/MS in Computer Science or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $252,400 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552827"}