{"title": "Caffe Macs - Prep Cook", "summary": "The people here at Apple don’t just create products - they create the kind of wonder that’s revolutionized entire industries. Joining the Caffè Macs team will give you the opportunity to craft inspiring meals that fuel the innovation within the company.", "description": "Prepares all food items for the execution of the line cooks including all hot, cold and baked products. Maintains proper food temperatures of foods during preparation and service; pre-preps food according to the menu; notifies chef immediately when food and supplies are not available; maintains food production areas in a clean, neat and orderly manner; cleans assigned areas following established cleaning procedures and schedules. Correctly follow all health, safety, and sanitation guidelines. Collaborates with co-workers. Performs additional responsibilities, as requested by the Chef, Sous Chef or Kitchen Manager.", "key_qualifications": "Knowledge of healthful, nutritional-based cuisine preferred. Display a real passion for food and cooking and be self-motivated preferably with 2 years of cooking experience preferred in “from scratch” environments and culinary education. Basic understanding of professional cooking and knife handling skills. Speaks clearly, listens attentively to staff, peers, supervisors, and guests. Maintain the highest standards of conduct and confidentiality.", "preferred_qualifications": "", "education_experience": "-  Typically we look for talent with 0-1 Years of experience in customer service or high volume food service - preferably larger, innovative corporate programs, in house or 3rd party but may also be food & beverage experience in a full-service hotel, resort or multi-restaurant chain. You will work with and serve a versatile diverse workforce. Extraordinarily Service Oriented - show high level of customer service is positively mandatory…We hire for attitude, train for skill.", "additional_requirements": "-  This position will spend 100% of the time standing. Things happen fast here. Bring your ability to multi-task in a high-volume experience and your love for working in a fast pace environment. Occasional environmental exposures to cold, heat, and water. Ability to lift and transport up to 50 pounds (pots, pans, etc.) on occasion and up to 35 pounds regularly.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $27.75 and $34.65/hr, and most new hires start at $27.75. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Additional benefits include comprehensive medical and dental coverage, retirement benefits, discounted products and free services, educational expense reimbursement, discretionary bonuses or commission payments, and relocation assistance.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540789"}