{"title": "Audio Products, Product Design EPM", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products!\n\nAs a Product Design Engineering Program Manager (PD EPM) you will be responsible for the technical management of the development and implementation process for the mechanical components of one of our Audio Product Design teams.\n\nWe want you to join our collaborative team of engineers to perform the most impactful work of your life. In this role, you will drive the day-to-day activities to meet key program objectives focusing on engineering, development planning and validation cycles. This involves engaging with cross-functional teams to balance competing objectives and meet challenging timelines. We’re excited for you to come join us and help build amazing Audio Products!", "description": "- Support product definition and drive closure of architecture and technical opens in early stages of a project\n- Establish and manage program feature baseline, scheduling, budget, critical paths, and technology risk areas for execution through final delivery of the product\n- Identify and highlight technical risk areas and mitigation strategies in partnership with impacted teams to help drive them to closure\n- Enable the development effort by creating and monitoring an efficient, streamlined process\n- Drive drawing releases and tooling kickoff with PD Engineering and the vendors to meet aggressive schedules\n- Plan and execute prototype builds by directing OEM partners\n- Lead cross functional communication between project teams and external vendors\n- Drive day-to-day activities to meet overall project objectives including calling and running meetings among engineering stakeholders\n- Offer multiple levels of status across a wide spectrum of individual contributors to executive management via written and verbal communication", "key_qualifications": "", "preferred_qualifications": "Excellent communication, collaboration, organizational, presentation and leadership skills\n- Self motivated and proactive with demonstrated creative and critical thinking capabilities\n- Deep understanding of rapid development cycles; remains flexible when faced with uncertainty and changes in direction\n- Knowledge of product development processes as well as an understanding of manufacturing processes, mechanical engineering fundamentals; prior experience with metal stamping, forging, machining (CNC), die casting, plastic injection and metal injection molding (MIM) is highly desirable\n- Strong attention to detail and ability to effectively manage complex, ground breaking design strategies\n- Participated in delivering products comprised of multiple materials and high esthetic quality\n- Experience interfacing with cross functional teams including Mechanical Engineering and Design, Manufacturing, Systems Engineering, Reliability, Operations, and Marketing\n- Embraces ambiguous situations and drives closure\n- Ability to travel internationally to support builds", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557156"}