{"title": "Compiler Backend Engineer", "summary": "The CPU compiler team at Apple is seeking senior engineers passionate about working on advancing code generation and optimization technology. We are responsible for compiler backends for CPUs and Accelerators on all Apple platforms. Our team works across many different organizations on state-of-the art, industry impacting technology that enhances the user experience for all Apple customers with new silicon, better run-time performance, battery life, compile-times, code size or enhanced security. A significant portion of our work is carried out in close collaboration with silicon architects, platform architects, operating system developers, and application experts. Our team emphasizes diversity, collaboration, and creativity. Join us to shape the future of compiler backends at Apple!", "description": "When you join us, you will be part of a group of engineers committed to advancing compiler CPU technology. Your responsibilities will include working closely with hardware and software architects designing compiler features for new silicon on all Apple platforms. You will collaboratively explore and develop features for new silicon, perform application and benchmark analysis, and advance our compiler backend technologies.\nIn this environment you will continuously apply and grow your expertise, learn new technologies, and engage in projects spanning hardware and software teams. Your work will impact all classical applications used by everyday users, countless customers, and give raise to new applications and technologies our customers love.\nIf you believe you have additional skills not listed here that would make you a good candidate for this position, please feel free to include a cover letter describing those skills and their applicability to the position.\n\nIf this sounds of interest to you, we'd love to hear from you!", "key_qualifications": " ", "preferred_qualifications": "Good understanding of CPU architecture and micro-architecture, familiarity with ARM is a plus\nExperience working with LLVM or other open source project is a plus\nAbility to communicate clearly and effectively", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557133"}