{"title": "Cellular RF Receiver Systems Engineer - RF Lineup Control and Interfaces", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We invite you to join our dynamic group, for the outstanding and great opportunity to contribute to upcoming products that will delight and encourage millions of Apple’s customers every day. Apple's RF Systems Engineering team is looking for a passionate, independent expert with a proven track record RF receiver system engineering. Our world-class team shapes the mobile market with forward-thinking concepts while being fully accountable for execution and commitments on timeline and quality. As member of Apple’s Cellular RF System Engineering Team you will do concept work for innovative wireless products used by millions. Come and deliver leading-edge radio frequency receivers for Apple’s wireless products that enable a unique customer experience!", "description": "In this role as Cellular RF Receiver System Engineer you will be a part of an experienced system engineering team that is tasked with driving innovation of cellular transceiver architectures across the whole cellular frequency range. You define the specification of Cellular RF receiver line-ups in close collaboration with a wide team of experts from the first idea till the final product. You are responsible for defining the architecture that configures and controls the whole receiver lineup (RF front end, analog and digital signal chain) covering all RF system use cases. The hardware/firmware split is in your hands! You work closely with RF circuit designers, firmware and verification teams to define and optimize all sequencing. The development of clever algorithms supports the control tasks for best overall system performance. As an individual contributor you will collaborate in a wide network of experts to ensures a product bring-up at highest quality. Occasional travel including international may be required.", "key_qualifications": "3+ years of experience in Cellular RF systems engineering or similar area of expertise. Solid knowledge of radio receiver architectures from antenna to analog/digital base band processing. Understanding of Cellular Radio/3GPP Standards (UMTS, LTE, LTE-A, 5G NR FR1, 5G NR FR2) with focus on modulation schemes and system use cases. Expertise in micro controller architectures used for real time operation and how to program them is important. Matlab is essential. Experience in an object oriented programming language like C++, Python is a plus. Background in digital signal processing is highly welcome. Interest in RF circuit impairments and how to calculate their system impact. This role requires strong analytical thinking and the ability to collaborate and communicate in multi-cultural global teams", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200513165"}