{"title": "Sensing Hardware Engineer", "summary": "The Sensor team develops ground breaking sensors that are central to a variety of Apple platforms, like Audio, iPads, Macs, Accessories. You will play a key role in specifying, developing, characterizing and validating sensor systems used in these platforms. You should be familiar with product integration and manufacturing technologies used to implement sensors in consumer products. The ideal candidate would have experience with technologies such as capacitive touch sensors.", "description": "You will be encouraged to specify, build and validate capacitive sensors in new product applications. You must work multi-functionally with test, firmware, and system engineering teams as well as product operations teams to deliver: New sensor design and integration. Schematic design of PCBs and/or flexible assemblies. Failure mode analysis, root cause diagnosis and system-level problem solving. Hands on bench measurements of prototypes. Key performance indicators for sensor/system level test. Documentation of specifications, design, test and FA processes. Business travel to support product development (up to 10% travel required)", "key_qualifications": "Experience in architecture, design, characterization, and validation of sensing systems that includes theory of operation, signal processing, and design trade-offs. Fundamental knowledge and experience in math, physics, and electrical engineering. Experience with manufacturing technology relevant for sensor fabrication is a plus. Proficiency in MATLAB, SPICE, or similar simulation and modeling tools. Proficiency in Python or other scripting languages. Experience with high volume mass production is a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541205"}