{"title": "FR-Manager", "summary": "Pour que l'activité d'un Apple Store demeure florissante, il faut posséder toute une gamme de compétences de direction et en tant que Manager, vous les maîtrisez toutes. Dans l'environnement trépidant et dynamique du magasin, vous faites preuve de calme et apprenez de chaque nouveau défi. Vous créez et motivez des équipes ultra compétentes formées de personnes d'exception capables d'offrir une expérience positive aux clients qui découvrent, achètent un produit ou bénéficient d'une assistance. Et surtout, vous partagez la vision Apple avec vos collaborateurs et vos clients.", "description": "En tant que Manager, vous devez devenir une source d'inspiration pour votre équipe afin d'inciter les clients à acquérir des produits sur la surface de vente. Par ailleurs, vous guidez les talents en charge de l'assistance technique et de la formation, tout en travaillant en partenariat avec l'Équipe Entreprises. Et en coulisse, vous surveillez des activités telles que la gestion des stocks et la mise en place visuelle. Vous constituez vos équipes de manière active : vous embauchez, formez et faites évoluer les membres de vos équipes dans tous ces domaines et bien plus. Promouvoir la simplicité Apple est une mission complexe, que vous rendez évidente.", "key_qualifications": "", "preferred_qualifications": "Capacité manifeste à favoriser le développement personnel de l'équipe pour qu'elle se surpasse et offre ainsi un service exceptionnel aux clients, avec des résultats notables. Expérience dans la gestion parallèle de nombreux engagements envers les clients, le personnel et les activités du magasin, menée avec toute la diplomatie requise. Capacité à s'adapter à tous les défis tout en restant calme dans un environnement de vente au détail en perpétuelle évolution. Compétences de direction manifestes avec une expérience dans un environnement de vente directe aux clients. Une expérience intersectorielle sera appréciée. Vous êtes impatient d'acquérir des connaissances sur les technologies et produits Apple. Vous maîtrisez l’anglais (à l’écrit et à l’oral) et la langue locale. La connaissance de plusieurs langues est un plus. Vous faites preuve de souplesse dans votre emploi du temps. Vos horaires de travail seront déterminés en fonction des besoins de l'activité.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558832"}