{"title": "Senior Manager, Software Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Asia Pacific IS&T team builds systems for the most dynamic and versatile business teams at Apple. We work on many high-impact projects that serve various Apple lines of business. We use the latest technologies and are constantly opening up the boundaries. Will you join us in crafting solutions that do not yet exist? Come be part of our Asia Pacific IS&T team if you want to help deliver the next amazing Apple product. We are currently looking for an Engineering Leader to join us as a Software Engineering Manager.", "description": "- This Engineering Leader will possess great verbal & written communication skills, self-motivated, driven, detail oriented, hands-on, and a strong technology leader.\n- You will be responsible for architecture, design, development, and deployment of custom Java, software package and cloud-based solutions.\n- A strong background with development, implementation and operational experience is required for this leadership role.\n- A consistent track record with managing, motivating and providing technical guidance to a team of software engineers and functional business analysts to draw out their best work will be key to success.\n- Creative thinking, strong problem solving, and the ability to collaborate with multi-functional, global teams in a fast-paced environment will be meaningful attributes to possess.\n- Ensuring quality in every deliverable.", "key_qualifications": "empty string", "preferred_qualifications": "Strong exposure to designing and developing iOS application is highly preferred.", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "empty string", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557918"}