{"title": "Hardware Reliability Lab Manager", "summary": "At Apple, we work every single day to ensure our products enrich people’s lives. Apple’s Reliability group ensures legendary reliability and quality of Apple hardware products through cutting-edge stress testing and characterization. The Reliability Labs team is looking for a Lab Manager responsible for leading all aspects of our US-based operations such as lab construction, equipment installation, start-up, maintenance, and calibration for all our stress and characterization tools. Come join our team!", "description": "-  Manage engineering lab day-to-day operations working with external vendors as necessary and ensuring lab security, and safety protocols are upheld.\n-  You will be analyzing and effectively communicating lab related issues and make recommendations for next steps in lab tools and infrastructure.\n-  Review test equipment specs with engineers and work with vendors to obtain quotes\n-  Be the point-of-contact for engineering lab-related equipment activities. You will be helping to procure materials for engineering needs and inventory control spare parts for lab equipment.\n-  Manage the lab layout and moving tools, equipment, and inventory as required for optimum performance.\n-  Overseeing vehicle use for transporting equipment between lab spaces, maintaining instrument calibrations, servicing laboratory equipment, and managing equipment and asset database.\n-  Design and produce parts as needed for equipment modification to meet engineering deadlines\n-  Occasional travel to help repair/diagnose vendor housed Apple-owned equipment.", "key_qualifications": "5+ years of experience in lab design, set up, management and maintenance of engineering labs.\nDeep understanding of Thermal chamber operations and refrigeration repairs\nExperience in 3D CAD modeling and machining\nWorking knowledge of Mac OS and Windows OS\nExcellent verbal and written technical interpersonal skills", "preferred_qualifications": "", "education_experience": "College degree or it’s equivalent in a technical or vocational training is preferred and 5+ years of relevant experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,900 and $234,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544044"}