{"title": "Global Admin Manager", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have invented — and now can’t imagine living without. If you’re excited by the idea of making a real impact, a career with Apple might be your dream job… Just be prepared to dream big. We support and promote career development throughout the organisation, offering a long and exciting career with many opportunities to enable you to perfect your existing skills - and acquire new ones.", "description": "The delivery of an outstanding employee experience is at the forefront of what we do in H2R. The Global Admin Manager will lead the newly established Global Admin Team. This is a new role in Apple and offers huge opportunity for the right candidate. Some of the core responsibilities of the Global Admin team are: Time Away Administration, Benefits Administration for centralized processes, Manage reimbursement processes, Action Time Away transactions/business processes generated in Workday, Action Allowance transactions/business processes generated in Workday, Support Supplemental Leave process for the US. This is a high volume fast paced environment, the successful candidate needs to be a person of high integrity and sound judgment, who is highly organised and can work to tight deadlines. This person should thrive working in a fast-paced environment and can adapt to last minute changes with ease as we establish the team and stabilize following Workday go live. Manage the newly established Global Admin team, Be a passionate and dedicated leader to this team, supporting the employee experience, Ensure that all team members are trained & motivated to perform their roles to the highest standards, Innovate and think creatively as the primary partner for supporting Global Admin, Collaborate effectively with our business partners to ensure optimum solutions are implemented, Find solutions to challenges in a rapidly changing environment, Anticipate business needs and think proactively, Develop excellent working relationships with our many, varied internal and external stakeholders, Strong vendor management skills preferred, Excellent communication and customer service skills are essential, Ensure the team meets our agreed SLAs, including time to close, Promote excellent customer experience as the top priority, Ability to quickly react to escalations and problem solve are key to the success of this role.", "key_qualifications": " ", "preferred_qualifications": "Proven leadership skills as demonstrated through clear problem-solving skills, effective process evaluation, strong team and business relationship building, and delivery of high-quality work, Ability to function in a fast-paced environment and prioritise multiple projects with competing priorities, Ability to quickly develop strong working relationships with business partners, including People Support, People Operations, Benefits and the wider Finance and People teams, Ability to coach, mentor and advise to help team grow and develop in line with business and personal goals, Ability to meet tight deadlines and quickly adjust to changes, Ability to build long term scalable solutions, Excellent organization skills, ability to manage time and priorities effectively and efficiently, Customer Service experience in a high-volume environment is preferred, Previous Benefits Admin/HR Admin experience an advantage.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554740"}