{"title": "Site Reliability Engineer - Payments and Reconciliation", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. At Apple, great ideas have a way of becoming extraordinary products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "In this role, you will be a part of the operations team for a payments platform. The role requires candidate to embrace a complex software product architecture to support a continuous stream of payments data to ensure accurate invoicing, disbursements, receipts and payments. This role is responsible for infrastructure design and scalability to support the platform and for the related product development. The role will actively monitor production health of the platform including tickets, operational retrospect’s and definition/management of necessary controls. As business evolves, this role will identify utilities that can assist in operations and complete the product development for it. Monitoring, alerting, profiling tools, fault tolerance etc will be a charter for this role. The platform is a part of very fast paced initiatives from a range of business units. Good communication, building business relationships and thriving in fast pace are necessary for this role.", "key_qualifications": "5+ years experience supporting critical production applications\n3+ years of software development experience\nExperience with application monitoring, alerting and profiling tools like JMeter, JProfiler, App Dynamics etc.\nFundamental knowledge in Java and fluency in scripting languages such as Bash and/or Python\nExperienced in fixing and resolving production incidents\nExperienced in identifying performance bottlenecks and suggesting optimizations\nFamiliarity with CI/CD systems\nFamiliarity with Docker, Kubernetes, etc.\nFamiliarity with MongoDB and OracleDB setup\nExperience querying and updating using SQL and NoSQL databases\nExperience with cloud migration\nExperienced with log management systems (ex: Splunk, Sumologic)\nExperience with distributed storage systems like GridFS, S3", "preferred_qualifications": "", "education_experience": "Bachelor's in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534961"}