{"title": "Hardware System Integration Engineer - AirPods", "summary": "At Apple, new ideas have a way of quickly becoming extraordinary products, services, and customer experiences. Sound is an essential and compelling facet of the customer experience. Apple is assembling a world-class team of engineers who obsesses over the delivery of products that enables our customers to experience music with delight and communicate with clarity. The AirPods System HW team consists of exceptional electrical engineers who own and deliver electronic solutions by closely collaborating with multi-functional teams such as industrial design, product design, technologies and manufacturing. The small form factor of these products enables us to innovate in every aspect of product development that includes areas like advanced physical architectures, new RF technologies and highly power-optimized IC development. We are a diverse team of electrical engineers with a passion for audio, music and product development.", "description": "Seeking hardworking engineers/technical leaders who will be responsible for owning system HW development like driving product architectures, overseeing PCB/flex design, influencing optimized system validation plans, reviewing manufacturing test requirements, prototype bringup and testing, data analysis and issue debug. Some travel to support manufacturing is part of the role. Experienced team members will get to lead technical aspects of the product development by working closely with peers or managing small teams.", "key_qualifications": "7+ years of experience as a hands on electrical engineer in designing high volume products from proof of concept to mass production\nExpertise in board and flex designs including schematic and layout with strong abilities to implement to a timeline and deliver high quality designs\nExpertise in prototype bring-up, electrical measurements, debugging and functional verification\nSolid electrical engineering fundamentals covering both analog and digital concepts such as power and data converters, amplifiers, high-speed serial and memory interfaces, digital logic, RF/wireless and signal integrity\nExperience working with technology, software, reliability, manufacturing, operations organizations is desirable\nExcellent oral and written communication skills are desired\nExperience leading/managing small teams of four to five people is desirable", "preferred_qualifications": "", "education_experience": "BS/MS/PHD EE. 7+ years in wearable or consumer electronics industry experience desirable", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549165"}