{"title": "Talent Management-Talent Management Lead", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. As a member of Apple’s People team, you’ll help discover and develop our most important resource: our people. You’ll work within the Talent Management Team and provide deep expertise across talent architecture, talent planning, performance management, and growth and development.", "description": "Design, develop, and implement talent management initiatives for the enterprise. Manage organization-wide talent programs and events end-to-end. Partner closely with Total Rewards and Compensation experts to ensure a highly integrated approach. Collaborate closely with People Business Partner Leaders and cross-functional partners to implement performance management initiatives and programs across lines of business.", "key_qualifications": "You influence and strategically advise leaders to get to the best outcomes. You understand how to manage significant change efforts. You partner well with others to develop the best solutions and find the best path forward. You adapt to change and find the right path — even without having all of the pieces to the puzzle. You know yourself — your strengths and opportunities for growth. And you’re open to feedback. You enjoy a collaborative environment with open dialogue and debate.", "preferred_qualifications": "You deeply understand the connection between performance management, talent planning, and compensation. You’re analytical and are comfortable conducting analysis in numbers, excel, or other data-analytics tools. You’re familiar with HR tools and technologies, such as Workday, and have experience integrated performance management strategy within the system. You manage projects in a highly organized, structured way — identifying and mitigating risks to best drive results.", "education_experience": "A degree in Organizational Psychology or related field is helpful but not required, Master’s or PhD in Industrial/Organizational Psychology, 2+ years of experience working as a specialist in Performance Management or Talent Management programs", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $170,200 and $255,400. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. You’ll also receive benefits such as Comprehensive medical and dental coverage, retirement benefits, discounted products and free services, and reimbursement for certain educational expenses.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551906"}