{"title": "CAD ML Timing Optimization Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor and system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. We invite you to help deliver the next groundbreaking Apple products. In this highly visible role as a key technical member of the Design Methodology and Tools team, you are an integral part of the effort to improve the performance of Apple silicon. You will be responsible for delivering industry-leading solutions for design optimization, design closure, and visualization. Combining machine learning algorithm application with practical design know-how and software engineering best practices, you will help to differentiate and streamline Apple’s silicon engineering methods.", "description": "As a CAD ML Timing Optimization Engineer, you will:\n- Deliver methodology and tool solutions for static timing closure and power optimization.\n- Apply data science and ML analytics to quantify, mine, and predict intriguing patterns.\n- Deploy innovative modeling and optimization approaches to achieve globally optimal targets.\n- Prudently apply best-in-class learning algorithms to deliver value-adding design solutions.\n- Pursue deep analysis of design implementation alternatives to isolate key issues and identify appropriate ECO remedies.\n- Implement code infrastructure to facilitate analytics and visualization.\n- Collaborate with silicon design, CAD, and EDA partners to identify flow deficiencies and enact creative solutions.", "key_qualifications": "Practical knowledge and experience in applying ML and/or GPU accelerated approaches to solving challenging optimization tasks.\nProven software engineering background and experience with C++, Python, and a variety of deep learning libraries and infrastructure.\nStrong analytical skills and ability to identify high ROI opportunities.\nProficiency with optimization algorithms, data modeling, and mathematical representations.\nHands on experience in static timing analysis and/or design optimization flows.\nSolid understanding of Physical Design challenges, proficiency with place and route tools and implementation exploration.\nGood communicator who can accurately assess, describe issues to management and follow solutions through to completion.\nFamiliarity with timing and power ECO techniques and high performance deep sub-micron processor designs is a plus.", "preferred_qualifications": "", "education_experience": "Minimum requirement of BS + 10 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552016"}