{"title": "GPU Performance Modeling Engineer - Platform Architecture", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. Join us to help deliver the next groundbreaking Apple product!", "description": "As part of the Platform Architecture GPU Performance Modeling team, you will be working with architecture, design and software partners on the definition and tuning of Apple’s future GPU architectures. The role involves the C++ code development and maintaining of GPU performance models from the shader core up to the full system. You will collaborate with experienced architects, compiler engineers, RTL designers and software teams to assess the feasibility of new hardware and software features, running performance experiments and reporting them. You will work on the analysis of existing and new workloads to identify bottlenecks in the design or software and working on solutions with the team. You’ll be architecting new Metal APIs, simulator features, and brainstorming novel ideas to boost simulation performance and accuracy.  This is an opportunity to join Apple’s world-class GPU team to collaborate, develop and improve GPU simulators for research, performance analysis, and microarchitecture tuning.", "key_qualifications": "Strong knowledge and experience in GPU architecture, micro-architecture design, or performance analysis with an emphasis on hardware/software co-design; Strong software skills and proficiency in C/C++ and a scripting language such as Python or Ruby; Experience working on performance model development and experimentation (GPU or CPU); Knowledge and experience with GPU performance benchmarks and workloads; Strong interpersonal skills and creativity to help the team solve design challenges; Knowledge of 3D graphics APIs, operating system internals, and compiler technology a plus; BS and a minimum of 3 years relevant industry experience", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience. MS or PhD in Computer Science, Electrical Engineering or Computer Engineering is preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505915"}