{"title": "Display Electrical Engineer", "summary": "At Apple, we don't just create products - we create innovation that transforms entire industries. Our team is made up of diverse individuals who bring a range of ideas and perspectives to the table. This is what drives the innovation that runs through everything we do, from ground-breaking technology to industry-leading sustainability initiatives. Imagine what you could do at Apple. This is a place that makes great products for millions of happy customers all around the world. Bring passion and dedication to your work and there is no limit to what you could accomplish. We are looking for Display Electrical Engineer to join the Display team in Shanghai. Our team develops most innovative display features and deliver the best display products to the market. Joining us, you will be able to work with most talented engineers in the industry and grow, learn, then make significant influence the world with your innovative thinking. We are welcoming passionate individuals who are committed to pushing boundaries and achieving excellence.", "description": "As a Display Hardware Engineer, you will mainly help cover: Define overall module EE architecture requirements (including both equipment/panel considerations), and drive validation plan to meet engineering requirements. Develop production calibration process, issue FA and equipment bringup. Working with supplier to form MP electro-optical requirements and SOPs. Identify critical metrics impacting display/EE performance, analyze experimental and build data, present analysis summary to team and management. Drive issue failure analysis and corrective actions, communicate with broader team on pros, cons and risk associate with proposed solutions, drive implementation of the solutions. Collaborate with multi-functional team, drive DOE plan and design convergence. Investigate new display technologies, perform detail tradeoff studies, and generate innovative ways to further improve display performance.", "key_qualifications": "BS or equivalent experience in electrical, electronics, physicals, optics, image processing, computer science. 3+ years working experience in consumer electronics, display, automation industry. Strong understanding of electrical circuit design and analysis. Proficiency in using common design software. Strong electrical measurement skills and hands-on experience of oscilloscope, power supply, logic analyzer, signal generator, etc. Concise & effective verbal and written communication and presentation skills in English.", "preferred_qualifications": "Hands-on experience in high volume mass production consumer electronics, display related system. Working experience of display technologies: TFT, LCD, OLED, optical fundamentals, display driving system, etc. Experience of IC design and verification. Knowledge of display calibration and compensation technologies. Proficiency of using statistic tools (JMP, minitab, etc) and scripting languages (Matlab, python, Lua, etc). Experience in working closely with multi-functional teams, as well as with overseas suppliers. Strong problem-solving skills and the ability to analyze complex technical issues. Ability and willingness to travel overseas.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555512"}