{"title": "Battery Material Scientist", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here?! We have an opportunity for a material scientist with strong business sense to build new innovative next generation Lithium-ion battery solutions with new anode materials. With your unique in-depth understanding of cathode, electrolyte, binder and cell design, you will be expected to provide strong leadership over strategic partnerships with materials vendors, cell vendors, aligning them to Apple's development programs and roadmaps. You will also take ownership for rapid development of processes and technologies to lead this R&D agenda, while demonstrating initiative, and the ability to maintain highly interactive relationships with various partners and influence senior management. We invite you to join us on this journey and help us leave the world better than we found it!", "description": "• Lead and run this R&D team and complete novel anode material innovations for next gen LIB realization under daring timelines • Create implementation plan and documentation of a R&D roadmap to be followed by the R&D team member • Define key material factor, procedures, measurement way, and create solution to meet this R&D goals • Produce and organize R&D budgets and forecasts • Mentor staff members and assist their further growth. Assist in the recruitment of new team members • Identify potential external partners, assess their technologies, and take the role of negotiation for establishing partnerships on strategic technology initiatives with your internal partners • Build interactive partnerships with material vendors, cell vendors, external R&D institute, as well as all related Apple teams across the globe", "key_qualifications": "", "preferred_qualifications": "Pro-activeness and self-motivation, The rare ability to collaborate across disciplines, constituencies, both internal and external, and across geographies, with strong leadership and passion to guide multiple dynamics towards a common goal, A dedication and commitment for results in a dynamic and fast-moving environment", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558843"}