{"title": "Streaming Graphics Software Engineer - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "We are a team of architects and specialists who are looking for an individual to help build and extend the frameworks that power connected applications across our ecosystem. You will help architect and implement the core system frameworks that power experiences like FaceTime, Mac Virtual Display, and more. Working at the intersection of 3D graphics, networking, and compression will be central to this role. The ideal candidate will have experience working on graphics APIs and 3D rendering. Primary responsibilities include leveraging Objective-C and Swift frameworks (e.g. RealityKit) together with networking frameworks for cross-device communication. You should be comfortable participating in architecture discussions, taking ownership of specific problem areas, articulating design choices, and delivering highly optimized code in performance-critical environments.", "key_qualifications": "No information provided", "preferred_qualifications": "Experience or interest in AR/VR applications, Experience with iOS / macOS development", "education_experience": "No information provided", "additional_requirements": "No information provided", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552972"}