{"title": "Technical Program Manager - Mac", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "It takes deeply dedicated, intelligent and hard-working individuals to maintain and exceed the high expectations for the exciting brand at Apple. You will lead a team of engineers (DFx, DFm, test, SQE, PQE, etc.) and others in support of new product development as well as sustaining operations and ensuring the contract manufacturer readiness for very high volume production. You will bring your knack and thirst to drive all technical operational issues related to SMT and system integration processes to ensure effective closure of all issues to enable operational success of the entire new product introduction cycle and into the mass production phase. • Technical lead for manufacturing operations at multiple vendors and sites. • Driving contract manufacturer preparation for pre-production builds. • Production process development, documentation, optimization and validation. • Development and implementation of new technologies to improve production quality, capacity and efficiency. • Sets standard practices and independently settles impact to design approaches and parameters to the final product. • Provides direction, mentorship and resources to other engineering groups and project leaders as well as factory technicians. • Act as lead engineer on a variety of projects and participates in the project planning of major sub-projects. • Performs assignments in several of the following manufacturing engineering functions: • Design for Manufacturability - Provide early and ongoing manufacturing involvement to ensure manufacturability of new products. • Product Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering with respect to technically complex testing methods, procedures and failure analysis. • Process Engineering - Designs and develops technically complex processes to improve quality and efficiency. • Failure/Data Analysis - Plans, develops and implements technically complex procedures for the testing and evaluation of soon to be released products. Specifies test to be performed, compiles data and makes recommendations for product design changes and final assembly standards. This will include the use of Design of Experiments (DOE) and statistical analysis using Six Sigma principles. • Provide regular VP level communication of technical health of program.", "key_qualifications": "Typically requires at least 3+ years of experience in engineering and manufacturing. Meaningful experience in introducing products into manufacturing, or high volume production a large plus. Excellent project management skills, experience working in a matrix organization. Direct experience leading any of the following functional engineering teams a plus (ME, EE, TE, DFX, Etc.). Shown bottom line project management experience. (Planning, Cost, & Delivery). Experience working with International OEM partners. Ability to travel internationally up to 40%. You should have the ability to communicate effectively in a worldwide environment. New product introduction and Manufacturing Operations experience desired. You should have validated working experience with DFm & DFx Consistent record of cost reduction, project management and engineering design required. Required to understand and tolerance stack ups for assemblies and part level. Strong knowledge of GD&T principles a plus Working knowledge of pneumatics, servomotors, PLC and PC-based control systems a plus. JMP, Minitab & Six Sigma experience a plus.", "preferred_qualifications": "", "education_experience": "MS or BS in related Engineering discipline, MBA a plus.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512526"}