{"title": "Hardware Validation Engineer", "summary": "Hardware Engineering is looking for a hardware validation engineer to develop, implement and execute hardware validation plans for systems designed for large scale deployment and integrated use. This is a highly collaborative position, working cross- functionally with multiple teams and vendors to validate hardware ensuring requirements are met and issues have been captured early in the development life cycle. As a key member of our hardware validation team, you will have the unique and rewarding opportunity to be responsible for validating, reviewing, and debugging the customized platforms for Apple's future application environments.Come join us!", "description": "As a Hardware Validation Engineer, your primary responsibility is to ensure the quality, reliability, and performance of system hardware, components, CPUs and associated subsystems. You will specialize in system hardware validation of modern CPU architecture based technologies for large scale deployments. Your role encompasses hardware validation, including low level validation, characterization, and margins to ensure the hardware for systems meet requirements and specifications. You will collaborate with design teams, develop, implement, and execute validation plans, and engage with vendors to drive validation of systems. Your expertise in system-level debug and root cause analysis contributes to the reliability and scalability of the system in large scale deployments.", "key_qualifications": "", "preferred_qualifications": "Experience using various stress tools and benchmarks to evaluate system behavior and identify patterns and test cases that rapidly expose design flaws. Understanding of electrical engineering design principles, transmission-line theory, signal integrity, and high-speed circuit designs. Experience performing PCB schematic and layout reviews to ensure specification compliance. Experience with hardware bring up, debug and troubleshooting. Ability to identify and develop tools that can expand test coverage. Experience with Linux operating systems and Python, C, and/or Shell scripting. Experience interfacing with cross functional teams and external vendors to successfully deliver results. Ability to think creatively, problem solve, and innovate. Outstanding communication and collaboration skills.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $121,909 and $214,500 annualized, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557883"}