{"title": "Pre-Silicon Machine Learning Compiler Engineer", "summary": "We live in a mobile and device-driven world where Deep Learning technology enables a new class of applications. Are you passionate about enabling unique user experiences on Apple products; such as Apple Vision Pro, iPhone, iPad, Apple Watch and the Mac? Imagine the countless possibilities powered by Artificial Intelligence! In the Video Engineering team, we are dedicated to providing hardware acceleration using the new proprietary Apple Neural Engine SOC to enable real time, low power and high performance execution of Deep Learning workloads. The Apple Neural Engine compiler team is working on exciting technologies for future Apple products. We're looking for a driven and dedicated engineer to work on the next generation of Apple products. Our success is the result of very dynamic people working in an environment which cultivates creativity, partnership and cross-functional collaboration. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives! Will you help us design the next generation of revolutionary Apple Products?", "description": "In this role, you will be empowered to: •  Implement ML algorithms using Apple Neural Engine SoC, with an emphasis on performance and power •  Add support for new hardware feature into the Apple Neural Engine compiler stack •  Run performance analysis and optimization of ML workloads running on Apple Neural Engine •  Evaluate existing hardware blocks and contribute to the definition of new hardware blocks •  Collaborate with the hardware team to review hardware specifications; in addition, you will work closely with the design and micro-architecture team to understand the functional and performance goals of the design, and design appropriate tests •  Partner with the driver/firmware teams to integrate HW acceleration in our software stack", "key_qualifications": "Experience with SoC and/or GPU acceleration for Artificial Intelligence, Experience with SW/HW parallelism, and asynchronous processing, Experience with embedded systems, and real time OS development, Experience with low level OS/driver programming, Excellent programming skills of C/C++, Excellent software design, problem solving and debugging skills, Good understanding of Deep Learning workloads, Excellent communication and teamwork skills", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519815"}