{"title": "SAP Engineering Project Manager, SAP Global Systems", "summary": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. A job at Apple is unlike any you’ve ever had. Be inspired and be challenged. Bring passion and dedication to your job, and there is no telling what you could accomplish! SAP Retail is the backbone of the Apple Retail Store Sales and Support. SAP Retail systems empower the Store systems with Product data, Assortment, Pricing, Promotions and Product Availability! This is an ERP system. All Retail Sales are recorded in SAP Retail for financials and reporting to our other SAP systems. SAP Retail Inventory Management in Stores are supported by mobile devices using iOS App. You are self-driven and motivated with a deep desire to understand business processes and how they map into the software development landscapes. You will be required to master both business process skills as well as technical leadership skills, to be able to design and implement secure, scalable and sustainable solutions. It also requires the ability to create process flows, functional specifications and work with both onsite and offshore resources to build and test solutions, solve problems and resolve issues under pressure to meet timelines and present solutions to multiple levels of management. This is a tremendous opportunity for someone who has the ability to own and drive initiatives and a passion to work in a highly integrated global solution platform within Apple’s SAP Retail landscape. Be ready to make something great! Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. Join Apple to help deliver the next amazing Apple product", "description": "The successful candidate will contribute to the design and implementation of deliverables within SAP Retail Logistics area. Ability to coordinate with the global IS&T and Business teams on solution design and development, testing and Golive. Lead the teams through the full project lifecycle including complex designs. The role involves: Partnering across the SAP Retail, Online Engineering and Retail Store teams and within Corporate IS&T to influence the successful delivery of key solutions that have direct business and customer impact, and accordingly must demonstrate strong eye for business and technical knowledge. Leading delivery teams including external vendors, ensuring all Apple development and delivery standards are followed to ensure the highest quality project outcomes.", "key_qualifications": "", "preferred_qualifications": "Ability to lead complex, cross-functional projects working closely with multiple business and technical teams. Ability to review complex Business Requirement Documents and translate them into deliverable objects. Proven experience in tracking, managing and communicating project status to cross functional teams. Ability to articulate complex ideas and solutions in a clear and easy-to-understand way. Demonstrated analytical and problem solving skills. Ability to communicate clearly and concisely at all levels. Innovative, highly motivated with the ability to learn quickly and motivator of others.", "education_experience": "BS/MS in Computer Science, Management Information Systems or equivalent are preferred", "additional_requirements": "Demonstrable ability to complete multiple tasks under pressure without direct supervision. Excellent planner and team leader. Superb communication, presentation and facilitation skills", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552104"}