{"title": "Fullstack Engineer", "summary": "Apple Sports is dedicated to enhancing the way fans engage with sports. Our mission is to bring fans closer to the action by connecting them with their favorite sports, teams, and players. We are a passionate and driven team committed to making sports accessible and engaging for everyone.", "description": "Apple Sports is seeking a talented and motivated Full Stack Software Engineer to join our dynamic team. As an engineer at Apple Sports, you will play a crucial role in designing, developing, and maintaining the tools and features we need to support our sports initiatives. You will work closely with cross-functional teams to build innovative solutions that enhance the sports experience for millions of Apple users. Responsibilities: Design, develop, and maintain scalable applications using Java, React, and TypeScript. Create and manage developer-friendly APIs for client and server communication. Collaborate with program managers, users, designers, and other engineers to define, design, and ship new features. Write clean, maintainable, and efficient code following best practices in software development. Conduct code reviews and provide constructive feedback to peers. Troubleshoot and resolve issues related to application performance and reliability. Stay up-to-date with emerging trends and technologies in software development.", "key_qualifications": "Empty", "preferred_qualifications": "Experience with GraphQL. Knowledge of cloud platforms such as AWS, Google Cloud, or Azure. Familiarity with containerization and orchestration tools (e.g. Docker and Kubernetes) Understanding of CI/CD pipelines and automated testing frameworks. Passion for sports and knowledge of sports data and analytics.", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555505"}