{"title": "Camera and Photos Software Engineer", "summary": "iPhone is the most popular camera in the world, and the Photos team builds a set of best in class features to highlight the amazing images that it can produce. The flawless integration of software and hardware has led to magical experiences in features like Memories and Portrait Mode. The Photos team focuses on building new user-experiences that also leverage computer vision and machine learning based image processing. Our team works hard on products that ship to millions of people - We are looking for people who want to do the same!", "description": "Our team focuses on building experiences that allow users to browse their photos and relive their best experiences through the Photos app. This includes features such as Memories, Live Photo Effects, For You and the Photos tab (Years, Months, Days, All). Our team develops features across the iOS, macOS and tvOS platforms. We're looking for an engineer who is excited to help create new experiences for our users to relive their content. As users are capturing and keeping more and more content, we want to make sure we provide innovative and scalable ways of enjoying this content. These features touch the lives of millions of customers and we work closely with design, computer vision, and machine learning technologies to build something great!", "key_qualifications": "Proven programming fundamentals and knowledge of object-oriented programming\nHave built projects using Objective-C or Swift and experience with iOS, macOS, and/or tvOS SDKs\nGood sense of UI design and a passion to focus on every detail, large and small\nExcels at solving and debugging hard problems\nEnjoys working with, learning from, and mentoring teammates from different disciplines and backgrounds", "preferred_qualifications": "The team is always making sure the code is robust, super performant and well tested. We are looking for an engineer who is thorough in their art, understands performance bottlenecks, and knows how to write high-quality code.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555623"}