{"title": "SWE - Tools & Automation Engineer - Developer Publications", "summary": "The documentation engineering team is responsible for creating world-class developer tools and framework-level support for the documentation workflows in Xcode, Swift Playgrounds, and Apple’s developer website. We are looking for a senior software engineer with experience implementing and working with complex infrastructure, and a sensibility for software quality to help us build the next generation of tools supporting Apple’s Developer Publications ecosystem. In this role you will work with software engineers, program managers and designers, to build automation and infrastructure for testing various features. These features and products range from web services to Xcode and are used by thousands of developers globally every day. We value candidates from all experiences and backgrounds; don’t hesitate to apply if you don’t meet all the key qualifications below.", "description": "This is your opportunity to join a highly motivated team who value collaboration and is committed to quality and innovation. We are passionate about the products we build and are dedicated to delivering high-performance software that exceeds our customers’ expectations. In this role, you will: - Collaborate closely with software developers, designers, technical writers and program managers to define and scope automation projects. - Drive cross-functional automation efforts to improve the quality of the developer documentation pipeline for internal and external developers. - Participate in the team culture and engage in code review, pair programming and architecture discussions with other members of the team. - Work cross functionally with other teams across Apple, to ensure our tools and systems integrate seamlessly. - Formalize quality protocols and processes to prevent regressions and increase quality", "key_qualifications": "Excellent understanding of the software development lifecycle and SQA methodologies. Track record of delivering comprehensive SQA automated solution for complex software applications. Ability to work effectively with cross-functional teams, understand needs, and define test strategies. Excellent communication, problem solving, and critical thinking skills. Experience developing with a scripting language (e.g., Shell, Python, Ruby). Experience with container application tools and environments (e.g., Docker, Kubernetes). Knowledgable with monitoring/alerting tools (e.g., Splunk, Mosaic, Grafana).", "preferred_qualifications": "Knowledge of iOS, macOS, and Xcode. Experience on testing shipping consumer-oriented products. Passion for Apple products, the documentation user experience and the developer user experience within Xcode. Knowledge of Unix/Debian variants", "education_experience": "BS/MS in Computer Science, Computer Engineering (or equivalent experience)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552648"}