{"title": "Software Engineer (Big Data), Ai & Data Platforms", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nAt Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you passionate about developing data platforms in Cloud? Do you have it in you to be part of a fast paced growing environment with many exciting responsibilities? If so, Apple’s Global Business Intelligence (GBI) team is looking for highly motivated, detail oriented, technical savvy professionals who like to think creatively!", "description": "The GBI Big Data Engineering team is responsible for building and managing data platforms at scale on Cloud, that help Apple process, store and access petabytes of data. We’re looking for a Big Data Engineer with strong understanding of big data and ML platforms, passionate about building and managing cloud infrastructure and can demonstrate to Apple’s high standards. As a part of our team, you’ll be responsible for building and integrating various compute and storage infrastructure using open source or other solutions to aid various critical applications, such as analytic, reporting, AI/ML apps. Additionally, you will be deploying cloud stacks supporting big data and AI/ML platforms, locating production errors and issues. \n\nYou are able to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams. You will interact with many other teams to lead and deliver best-in-class products in an exciting fast-paced environment. Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. Will you join us in crafting solutions that do not yet exist?", "key_qualifications": "5+ years of programming experience Java, Scala or Python\nIn-depth knowledge of Spark, Ray or other distributed computing frameworks\nUnderstanding of SQL query engines like Trino, Hive etc.\nExperience with Docker, Kubernetes or EKS\nExperience with debugging issues on distributed systems.\nKnowledge of software engineering practices and standard methodologies for the full software development lifecycle\nExperience with public cloud (AWS/GCP)\nHave created frameworks to deploy platforms in AWS/Azure/GCP.\nGood understanding of AI/ML stack - GPUs, MLFlow, LLM models is plus.\nExperience in building, tuning, scaling, and monitoring applications to process real-time, near-real-time and batch data\nUnderstanding of data modeling, data warehousing, and ETL concepts is a plus", "preferred_qualifications": "", "education_experience": "BS in Computer Science or related field or equivalent.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548831"}