{"title": "Senior Software Engineer, Endpoint Security", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Information Security (AIS) team is responsible for developing services to find and mitigate security risks faced by Apple. We are seeking an extraordinary Software Developer who is passionate about security, and can thrive in a fast- paced environment where both individual drive and team collaboration are the keys to success. As part of the AIS team, you'll be at the forefront of developing cutting-edge services to identify and mitigate security risks. This isn't just any technical role — it's an opportunity to make a significant impact on the global security landscape. You will perform hands-on work to identify issues, create a vision for resolving them, and collaborate with relevant business stakeholders to realize that vision.", "description": "We build and operate advanced telemetry, detection, and response software tools to secure and protect Apple’s networks. As part of the software team, you will Partner with teams across Apple to prioritize and build the product roadmap Advocate for your solutions and secure buy-in Continue to research, drive, and develop solutions Ensure accuracy and timeliness of telemetry, detection, and response actions", "key_qualifications": "", "preferred_qualifications": "Experience working on observability technology such as eBPF. Experience with open source endpoint security tools. Expertise with both building and using log aggregation and distributed monitoring tools (Splunk, Elastic Stack, etc.) Experience with application tracing, monitoring, analysis and visualizations through analytics dashboards. Excellent interpersonal skills, and the capability of working with cross-functional technical and business teams and varying levels of management. Experience using and releasing open-source software in corporate environments, with knowledge of licensing and legal review processes.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557440"}