{"title": "Build & Integration Engineering Manager", "summary": "At Apple, we create a unique blend of hardware and software to bring an industry leading customer experience to the world. The Software Build & Integration team is at core of how we create and iterate on this experience day to day at Apple.", "description": "- Drive operational excellence for daily production builds of Apple software\n- Develop team to respond to incidents, escalate issues, and run retrospectives\n- Monitor metrics, report trends, and innovate on operational workflows\n- Work cross functionally with teams across Apple on complex integration efforts\n- Hire, inspire, coach, train, and develop engineers to take on new responsibilities in integrating software systems\n- Lead discussions and drive efforts to enhance the reliability and scale of our production build operations\n- Work with project management teams to determine engineering priorities and resource engineering efforts\n- Engage partners in planning of compute, storage, and headcount for operational support\n- Foster an inclusive work environment that values diverse perspectives\n- Innovate and execute on our hiring and training processes", "key_qualifications": "Strong software development and testing experience\nStrong critical thinking and problem solving skills with a focus on providing hands on support to your team\nProven ability to inspire, coach, train, and develop team members to consistently provide exceptional customer service\nExperience adapting to challenges, providing support, and leading by example in a constantly changing environment\nProven track record leading cross-functional efforts around systems architecture, software development, operational processes, and product features\nExcellent written and verbal communication skills", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $164,200 and $285,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526172"}