{"title": "Secure Hardware System Engineer, Platform Architecture", "summary": "Are you a big-picture visionary who understands how each element affects all the others? At Apple, our Platform Architecture group is responsible for connecting our hardware, software, and servers into one unified system. You’ll join a team of architects who are dedicated to securing the world’s most advanced consumer devices. Our products are trusted for storing personal data, and our goal is to better safeguard our users. We're looking for talented and inspired individuals to help raise the bar on the security of Apple's products. In this role, you will develop threat models that define platform level security requirements for new products and drive adoption of platform level security architectures incorporating hardware, software, and server elements, ensuring that we continuously enhance the security of Apple products. Together, our work will be the reason millions of customers feel they can trust their devices every single day.", "description": "As a member of Platform Architecture, you will: Lead cross-functional teams throughout the product development cycle to resolve system-level issues without sacrificing product security or impacting world class product design. Develop threat models and associated security architectures for exciting new Apple products and technologies, derive system security requirements, and design balanced and novel mitigations in creative collaboration with iconic product and engineering teams. Develop detailed system-level specifications to guide product development, integration, and quality assurance teams in the creation of golden unit tests, reference data, and sample libraries to aid integration of our security technologies across team boundaries (e.g. client/server). Collaborate with other security engineers, architects, and researchers across Apple including software, hardware, silicon, server, and product groups on this high-visibility team. Drive security requirements and architecture into external vendor provided silicon. Use a wide range of interpersonal and technical skills to champion adoption of our industry leading security technologies across multiple product categories. Identify emerging threats, new attacks, and mitigation techniques as the external landscape evolves.", "key_qualifications": "Ability to effectively lead cross-functional initiatives\nInitiative to provide architectural guidance to teams lacking resident security expertise\nBreadth to work cross-functionally with Privacy, Safety, Service, Manufacturing, Software, and Product Development teams to resolve system-level security issues\nStrong written and oral communications skills across multiple levels\nAbility to critically analyze security properties of a system in order to build a comprehensive threat model (e.g. familiarity with common threat modeling methodologies such as STRIDE)\nKnowledge of basic cryptographic principles (e.g., symmetric vs asymmetric crypto, encryption vs authentication)\nFamiliarity with common programming languages and hardware block diagrams a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528309"}