{"title": "GBS R2R Senior Manager", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences. The people here at Apple don’t just build products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Apple’s Global Business Solutions (GBS) team partners with Apple’s business across Greater China, including Retail, Sales, Operations, R&D and Services. In addition to supporting transactional and financial reporting processes, GBS integrates resources and capabilities and anchors our operating model around the customer to deliver value and experiences beyond transactional services and financial activities for Apple. We look for individuals with not only solid technical skills but also the right balance of operational excellence, problem solving and critical thinking to support the growth of Apple in Greater China. We are looking for an exceptional, collaborative, commercially oriented, and customer-focused Senior Manager who embodies our culture and values to join the GC GBS R2R function. This role requires unwavering integrity, ownership, accountability, superior judgment, analytical acumen, and the ability to dive deep and operate at all levels. The R2R function’s objective is to reflect a company’s financial integrity based on timely, accurate, and complete information suitable for presentation and submission to internal and external stakeholders. R2R provides strategic, financial, and operational feedback on how a business performs, enabling management to base key decisions using credible information.", "description": "This individual will lead a team of finance professionals to develop strong business partnerships across Apple to maintain compliance with Apple Finance policies, generally accepted accounting principles and local regulatory requirements throughout the end-to-end financial and tax reporting process. The candidate will navigate the broader organization and collaborate with various functions within the region and across the global R2R organization. -  Lead various accounting activities to support the month-, quarter- and year-end close and ensure timely and accurate compliance with Apple policies, US GAAP and local GAAP requirements. -  Ensure attainment of service level agreements and make improvements to address any exceptions identified. -  Maintain compliance with SOX and internal controls governing assigned areas. -  Collaborate with external auditors and take ownership for achieving sign-off on accounts for the annual statutory audit. -  Collaborate with teams globally to enable more effective investment strategies and efficient risk management. Move fast while keeping attention to detail yet maintaining a big-picture perspective. -  Drive and/or participate in business transition and expansion projects. -  Make recommendations to support new business models or changes to existing business models in the region. -  Design scalable and repeatable processes to support new business expansion in China. -  Find opportunities for stream-lining and standardizing process and implement solutions to get results. -  Supervise, train and develop team members to ensure the team is performing at a high level and build opportunities for development and advancement within the team. -  Work closely with team members and other functional teams in implementing process changes and driving consistency and standardization across the team’s work.", "key_qualifications": "", "preferred_qualifications": "Learn on the fly. Open to lead various functions of the R2R organization based on business needs. Strong communication skills with a good command of English and Chinese in both written and spoken forms. Mature, responsible, self-driven and able to work independently Strong critical thinking and analytical skills with intellectual curiosity and a passion for business process excellence. Comprehension of Apple’s strategy and the ability to anticipate future trends. Ability to recognize issues within processes and organizations, while considering functional interdependencies. Experience collaborating in a matrix environment with capability to influence without necessarily having positional power. Ability to attract, retain and develop talent and ensure talent development plans are executed. Problem solving, project management and strong interpersonal-skills required. Experience with SAP is an advantage.", "education_experience": "", "additional_requirements": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559234"}