{"title": "Display Driver Engineer", "summary": "Display Driver team with Graphics, GPU and Display organization is an exciting team that delivers software for industry leading display technologies for Mac, iPad, Apple TV, Phone and Watch. We are looking for an outstanding, driven, and dedicated engineer to join the team. The successful candidate will be a high- energy problem solver with a passion for excellence and a track record for getting the job done. We are looking for people who are excellent standout colleagues and who also work well on individual assignments.", "description": "As a Display Technologies & Driver engineer, you will have responsibilities spanning all aspects of display driver including architecture, design, code development, debug and deployment\nOwn feature design, implementation, debug, and delivery of display technologies on Macs, iPad and Apple TV.\nParticipate in driving advances to display technologies, power-management, Color Management, HDR and other key Panel technologies.\nPartner with Internal teams including Display Silicon team and external vendor teams in developing architecture for next generation of display pipeline for Apple SOCs for Mac, iPad, Apple TV and other interesting products.\nLead and carry forward highly complex software and hardware debug efforts.\nImplement user facing critical features, perform complex troubleshooting of problems and defect resolution.", "key_qualifications": " ", "preferred_qualifications": "Experience with firmware development, and hardware simulators is a plus\nExperience implementing device drivers for display devices is a plus\nHW bring up and debugging is a plus\nHDR, Color Management, video formats, power management, backlight, or content- protection technologies are a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558216"}