{"title": "Senior Machine Learning Engineer- Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us. Apple's Vision Products Group (VPG) delivers algorithms that drive revolutionary Apple products, including Apple Vision Pro. In this role, you will work together with similar minds in a unique development team to build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience the world. This role is highly multi-functional and you will work very closely with various highly skilled hardware and software development / ML teams developing groundbreaking algorithms. As a member of a fast-paced prototyping team, you have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day.", "description": "The Algorithms organization in Apple’s Vision Products Group (VPG) is looking for a skilled senior ML Engineer with a strong background in machine learning and computer vision, and a passion to make world-class software. In this role, you will perform research and development work to design, implement, benchmark, and optimize algorithms for ambitious real-world problems. The successful candidate embraces working in a dynamic environment in more ways than one. You will be working in a highly collaborative, cross-functional group pushing the boundaries to develop the most capable algorithmic solutions. You will have ample opportunity to think broadly while considering tradeoffs during the research phases and to be deeply focused when meeting the performance targets.", "key_qualifications": "4+ years of industry experience in CV/ML or similar fields; Expert knowledge in machine learning and designing ML network architectures; Expertise in multi-modal sensor fusions frameworks and statistical modeling; Track record of designing and successfully building and shipping products; Publication record in CV/ML demonstrating innovative research; Strong proficiency in Python/C++, writing clean and well-structured code; Hands-on experience working with deep learning toolkits such as PyTorch; Self-motivated with proven ability to effectively prioritize and deliver tasks on schedule; Excellent problem-solving and analytical thinking skills; Excellent communication and experience working with cross-functional teams.", "preferred_qualifications": "", "education_experience": "MS or PhD in machine learning, computer vision, computer science/engineering and 4+ years of relevant industry experience with a track record of successful projects", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535848"}