{"title": "Advanced Manufacturing Engineer-iPhone", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. The diversity of those people and their ideas encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish.", "description": "-  Responsible for manufacturing research and development to seek complex problems that have a direct impact on the final product cost, quality, and delivery of Apple products. Under broad goals and objectives, exercises judgment within generally defined practices and policies in selecting methods and techniques for acquiring solutions to sophisticated problems. -  Sets standard practices and independently determines impact to design approaches and parameters to the final product. -  Applies extensive expertise in all facets of mechanical product design. -  We provide direction, mentorship, and resources to other engineering groups, project leaders, and factory technicians. Act as lead engineer on a variety of projects and participates in the project planning of major sub-projects. -  Keeps tabs on all relevant technical trends and developments and incorporates them in appropriate assignments. -  Performs assignments in several of the following manufacturing engineering functions: -  Design for Manufacturability - Provide early and ongoing manufacturing involvement to ensure new products are mechanically manufactured. -  Product Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering concerning technically sophisticated testing methods, procedures, and failure analysis. -  Process Engineering - Designs and develops technically sophisticated processes to improve quality and efficiency. -  Failure/Data Analysis - Plans, develops and implements technically sophisticated procedures for the testing and evaluation of soon-to-be-released products. Specifies tests to be performed, compiles data, and makes recommendations for product design changes and final assembly standards. This will include the use of Design of Experiments (DOE) and statistical analysis using Six Sigma principles.", "key_qualifications": "- Being in an engineering (automation) role with experience directing a team of engineers for new product introduction(NPI). - Being proficient in written and spoken Mandarin and English. -  Could communicate efficiently in a worldwide environment and cross-functional team. -  New product introduction and Manufacturing Operations experience desired. -  Proven track record of cost reduction, project management, and engineering design required. -  Required to understand and build tolerance stack-ups for assemblies and part level. -  A strong plus would be knowledge of optics principles as they relate to CCD cameras, 2D and 1D lasers, and their use for positioning and critical alignment fixtures. -  Basic understanding of adhesives and dispensing technology. -  Solid understanding of pneumatics, servo motors, PLC, and PC-based control systems a plus. -  JMP, Minitab & Six Sigma experience are a plus. -  Self-starter with innovation, integrity, and attention to detail.", "preferred_qualifications": "", "education_experience": "Bachelor or Master Degree in Mechanical Engineering or equivalent (MSME, MSIE desired)", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550328"}