{"title": "Apple GPU Compiler Backend Engineer", "summary": "As a member of the Pre-Silicon backend team you will design and implement significant parts of the compiler for future Apple GPUs. You will be a member of a small team with diverse talents and ample room for growth that works on every Apple Silicon GPU we ship in different devices including iPhone, iPad, Apple Watch, Apple TV and Macs.", "description": "In this role, you will be implementing LLVM-based compilers to generate optimized shader binary for future Apple Silicon GPUs that run graphics and compute workloads. You will be able to influence and work on new GPU architectures. You will design and implement new features added to future GPUs. You will architect and develop new compiler passes and optimizations to improve run-time performance while meeting the compile time requirements. You will also have the opportunity to work with LLVM open source community to add new features or optimizations to LLVM. You will work in a cross-functional environment and collaborate with GPU architecture, silicon design, device driver and Metal framework teams to develop the GPU Hardware and Software stack for Apple Silicon GPUs.", "key_qualifications": "Experience with modern C++ programming. Proven industry experience with strong background in compilers. Experience in low-level program behavior, including performance and memory model. Passionate about solving interesting problems related to the state-of-the-art Apple GPUs. Excellent written and verbal communication skills. Motivated to build constructive and effective relationships and solve problems collaboratively.", "preferred_qualifications": "", "education_experience": "BS with 5 years experience, MS or PhD in computer science or related field.", "additional_requirements": "You are not expected to know all of these. But knowing any of them is a plus. - LLVM, GCC, or other open source / commercial compilers. - Background in GPU programming models, such as Metal, Vulkan, DirectX, OpenGL, OpenCL, or CUDA. - Working knowledge of computer architecture, code optimization. If you believe you have transferable skills, not listed on this posting, that would make you a good candidate please feel free to share that information via a Cover Letter.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550415"}