{"title": "Sensing System HW Engineer", "summary": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter.", "description": "The Touch ID team develops sensors that are central to the security and convenience of Apple products. You will work on developing sensors to provide fingerprint biometrics to Apple’s products. This will include schematic capture, module and flex design, leading multi-functional integration discussions and coexistence assessments, and validation of the module design and feature at all nodes of the supply chain. You should be familiar with analog and digital circuit design, flexible and rigid PCB design, signal integrity and power integrity evaluation, lab validation and equipment, and electrical failure analysis. The ideal candidate will have direct experience with taking electrical designs into mass production. You will be collaborating with multi-functional teams to develop, characterize, validate, and integrate TouchID sensors into Apple products. Experience with high volume mass production is a plus. Up to 10% travel required.", "key_qualifications": "• Strong EE fundamentals, demonstrated experience in all phases of circuit design and development\n• Circuit design and layout experience (Cadence experience a plus)\n• Experience with test equipment (oscilloscope, meters, etc) and circuit simulation (SPICE)\n• Experience creating engineering design, requirement, and specification documents\n• Proficiency in MATLAB and Python scripting tools\n• Experience with statistical analysis of production data is a plus (JMP, Tableau)\n• Experience in FEA, simulation, modeling tools is a plus (Comsol, ANSYS, Maxwell)\n• Excellent written and verbal communication", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple... (truncated)", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518208"}