{"title": "CoreAnimation Engineer", "summary": "Core Animation is the graphics compositing engine behind every Apple device that renders to a display. Our team is looking for an extraordinary software engineer to work on the technologies behind the iPhone, iPad, Mac, Apple Watch, AppleTV, as well as secret \"black box\"projects. By working at the core graphics layers in Apple's operating systems, you will have the opportunity to have a major impact on the end user experience for all Apple customers.", "description": "As an engineer on the Core Animation team, you will work within a highly skilled engineering team in the design and implementation of critical rendering technologies.", "key_qualifications": " ", "preferred_qualifications": "You are upbeat, adaptable, and results oriented with a positive attitude\nYou have excellent judgment and integrity with the ability to make timely and sound decisions\nYou have an ability to stay focused and prioritize a heavy workload while achieving extraordinary quality", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560546"}