{"title": "Embedded Firmware Engineer", "summary": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. Deep dive into Apple’s main SoC which is integrated in all Apple products. Writing critical path embedded software that will be delivered to hundred millions of Apple’s products all over the world, enabling uncompromising performance and therefor market leading user experience. In this role you will be working in a cross functional teams environment and get high exposure to system integration of Apple products.", "description": "Design and implement software for storage subsystem components Work closely with hardware and system teams to accomplish software/hardware integration Actively participate in the bringup of new products, bringing up storage component for all new apple products, from pre-silicon phase to product release. Debug complex system-wide issues The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us if you want to help deliver the next amazing Apple product.", "key_qualifications": "3-5 years of embedded software design and implementation Experience and proficiency in C Significant experience in writing low-level drivers for hardware RTOS knowledge We’re looking for someone who is creative, critical thinking and has proven troubleshooting skills You should be highly professional, with the ability to deliver proven work on tight schedules, have excellent collaborative skills and the ability to work closely with Silicon design and HW design engineers", "preferred_qualifications": "", "education_experience": "Master’s (preferred) or Bachelor’s degree or equivalent experience in Computer Engineering or Computer Science or a related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547388"}