{"title": "Interior Services Manager", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and nimble group that manages Apple’s workplaces and workplace services. We develop and manage Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world. We are seeking an experienced, collaborative, and highly motivated facilities professional to join our team as an Interior Services manager.", "description": "The Interior Services manager reports to the Senior Manager of Facilities Building Management. This individual is responsible for the maintenance and upkeep of all Apple facilities throughout Silicon Valley (>200). This individual has direct oversight of all soft services provided through third party vendors, including but not limited to, janitorial services, window washing, interior plant services, waste services and pest control. Additional responsibilities include: Performance management of a small team of coordinators. Prepare and manage budgets, forecasts, and reports for vendors in the portfolio. Identify opportunities for increased efficiencies and cost savings. Stay updated with the latest industry trends and technologies for continuous improvement. Provide on-call support in case of emergencies or other off-hours issues. Communicate effectively and provide direction to contractors and vendors performing services for the company. Ensures vendors comply with Apple policies and procedures. Provide administrative support between vendors and business units as needed. Perform weekly building audits to ensure quality assurance of vendor performance. Collaborate and provide event support with various event teams within Apple. Partner directly with the Global Sustainability team to support initiatives. Work alongside RE&D partners such as Project Management, Real Estate, Commute, Security and Environmental, Health and Safety.", "key_qualifications": "", "preferred_qualifications": "Demonstrates success in employee development and mentoring including fostering collaboration, continuous performance feedback and motivating the team to develop and apply tools for more efficient operations, with a focus on continuously improving the customer experience. Excellent leadership, communication and supervisory skills, including experience working with all levels of an organization. Extensive knowledge of and experience with the upkeep and functions of buildings, including unique lab spaces. Comprehensive knowledge and experience with maintaining various materials such as flooring, fabric, wood and metal. Demonstrates ability to create, critique, and oversee preventative and scheduled maintenance programs. Adjusts quickly to changing priorities and conditions. Thrives in a complex and changing environment. Thinks critically and creatively about how to regularly improve process and operations. Extremely proactive, responsive, and upbeat with strong organizational, communication and presentation skills. Bachelor’s Degree or higher preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $146,800 and $220,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558091"}