{"title": "Software Engineer- Linux Driver and Kernel Developer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. As part of the silicon validation team, you will develop Linux device drivers and user-land tests for exercising and testing the various subsystems in sophisticated SoCs.", "description": "-  You will work closely with designers and architects to understand functional IP blocks and their use-cases\n-  You will focus on implementing BSP and doing software bringup on pre and post-silicon platforms\n-  You will be responsible for developing Linux device drivers and user-land tests for exercising and testing the various subsystems in sophisticated SoCs.\n-  You will debug and root-cause a variety of hardware and software issues", "key_qualifications": "We would prefer that you have the following skills:\n- Experienced in embedded Linux kernel development\n- Proven knowledge of Linux kernel internals (process scheduler, memory management, concurrency/synchronization, memory allocation, file systems) and profiling\n- Extensive device driver development and support (one or more of USB, graphics, video, storage, and power management)\n- Strong debugging skills in kernel context\n- Experience with exercising/validation of system from user space, and knowledge of user space API\n- Experience porting/maintaining Linux distribution for a platform\n- You are a skilled C programmer\n- Familiarity with ARM architecture is desired", "preferred_qualifications": "", "education_experience": "A minimum of a bachelor's degree and a minimum of 3 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517445"}