{"title": "Software Engineer, Apple Services Engineering", "summary": "Imagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. Apple is looking for an experienced Software Engineer to help develop the next generation of cloud services infrastructure. You will be working on key components of the Apple cloud platform and introducing new fundamental capabilities. Your work will help power entirely new applications and scale existing ones such as FaceTime, Push Notifications, iCloud Drive, Photos, and Backup. This is your chance to put a dent in the universe. You will work with world-class teams who have a real passion for engineering and delivering features that maintain strong privacy guarantees to end users.", "description": "We are a high-leverage team designing, building, and growing Apple’s foundational privacy-focused platform, which enables many of Apple’s signature apps and experiences. Our work impacts over a billion users and is essential to the success of Apple’s growth in services. As part of the Apple Services Engineering organization, you will: Partner with teams across Apple to develop features that enable new experiences in the Apple ecosystem Improve the scalability, availability, and performance of our services Evolve the platform’s design and architecture to support continued growth across multiple dimensions Partner with SRE to triage, investigate, and remediate production issues", "key_qualifications": "2+ years of experience developing software in Java, C, or C++ Experience working with distributed NoSQL and relational databases Experience with TCP/IP protocols and Unix / Unix-like operating systems Experience programming using multi-threaded synchronous or asynchronous I/O concepts Experience designing, developing, and operating large-scale distributed systems", "preferred_qualifications": "Bachelor’s Degree in an engineering-related field or equivalent related experience Experience with other programming languages such as Python or Go Experience using cloud providers (e.g., AWS or GCP) or cloud native technologies (e.g., Kubernetes) Experience with TLS, X.509 certificates, or similar security and cryptographic protocols Collaborative: Excel in a multi-functional environment through clear communication and relationship building Curious: Excellent problem-solving skills with the ability to independently learn a complex information mesh Customer Focused: Obsess about the user experience and data privacy Drive Results: Consistently achieve results, driving projects from ideation to production", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557006"}