{"title": "GPU Performance Efficiency Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you'll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)!", "description": "Join the team to play a pivotal role in Performance and Power projections of the GPU. As Apple expands on its GPU feature set, we rely on making accurate Efficiency curves for Performance per watt. You will have the opportunity to influence GPU Architecture choices and the feature set for the product. You will work with many teams including Architecture, Power, Performance, Silicon Validation, Thermals and Technology. In the highly collaborative GPU team, your main responsibilities are:\n-  Responsible to generate and analyze GPU Efficiency Projections – Performance per watt , for each generation of GPU over the full cycle of the project, from concept to Silicon.\n-  Drive the methodology of generating projections and Efficiency curves to improve accuracy and quality.\n-  Responsible for all System and Chip level Power team requests to the GPU for projections.\n-  Collaborate with architecture team to set power targets and determine the impact of the features on efficiency.\n-  Work with Technology, Power and Static timing teams to determine the Frequency-Voltage curves for the workloads.\n-  Work with Performance and Power teams to gather data for the Efficiency curves and analyze the impact.\n-  Work with the Silicon Validation team to improve projections based on Silicon data.", "key_qualifications": "We are looking for candidates with 10+ years of experience in the semiconductor industry, with background in areas of power, silicon technology or architecture. A successful candidate has:\n- Background in Performance or Power.\n- Experience in Power Projections or Performance Analysis.\n- Experience with GPU workloads.\n- Skills in Python, VBA or other coding skills.\n- Experience with Data Analysis and Excel.\n- Ability to work across teams.\n- Strong communication skills.\n- Good planning skills, self driven and detail oriented.", "preferred_qualifications": "", "education_experience": "We are looking for candidates with a minimum of BS + 10 years of experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505730"}