{"title": "UI Software Engineer Apple Services Engineering.", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like the stimulation and challenges of building a world-class, extraordinary scalable commerce platform? Then this is the opportunity for you at Apple! We strive to provide a flawless purchase and subscription experience for our for millions of customers and developers. The Apple Services Engineering Commerce team manages purchases from all iOS products, including Apps, Music, and Subscriptions. This scale is truly unprecedented and requires tremendous thinking to develop new initiatives and maintain existing systems.", "description": "The Apple Services Engineering UI team seeks a motivated engineer adept in modern web application technologies and associated tooling, frameworks, and libraries. Attention to detail and a commitment to delivering high-quality, stable outcomes are paramount. Successful candidates will exhibit self-starting abilities to tackle significant challenges by breaking them down into manageable tasks. Collaboration skills, systems thinking, and a focus on scalability and continuity are essential. Thriving on innovation and tackling complex problems, you'll find satisfaction in pushing boundaries and devising inventive solutions. If you're ready to join an elite engineering team, this position awaits your expertise.", "key_qualifications": "Minimum of 3 year’s experience in front-end development. Proficiency in HTML/CSS, JavaScript/TypeScript. Proven competence in at least one JavaScript framework like React, Vue.js, Angular.js, or similar technologies. Solid understanding of JavaScript fundamentals and adherence to SOLID design principles. Advanced skills in CSS, including familiarity with CSS extension languages like SASS, as well as CSS preprocessor tools. Hands-on experience in developing component libraries, particularly leveraging Stencil.js. Comprehensive knowledge of Node.js, NPM, Webpack, Babel, and other relevant toolchains. Proficiency in testing frameworks such as Jest, Cypress, QUnit, etc., accompanied by expertise in testing methodologies. General knowledge of networking protocols HTTP/1 & HTTP/2 (GET, POST), cookies and other HTTP headers Awareness of web development best practices concerning accessibility, performance optimization, and production monitoring. Exceptional interpersonal and written communication skills.[Optional] Exposure to iOS application development using Objective-C/Swift.", "preferred_qualifications": "", "education_experience": "BS in Computer Science or related discipline or equivalent experience.", "additional_requirements": "Exposure to iOS application development using Objective-C/Swift.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location...[More details available on the source website]", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550584"}