{"title": "Hardware Validation Engineer - Mac", "summary": "In this position, the candidate will be working for the Hardware Validation Engineering (HVE) team on post-Silicon hardware system validation of next generation Mac and iPad systems. Our Engineering Team is responsible for architecting new ways to test new system hardware to catch issues early in the hardware life cycle. You will be a key technical contributor and will use your in-depth system knowledge to target testing on new silicons or system architecture. Come join our team!", "description": "Reviewing Mac platform architecture and identifying key areas for HW validation Writing Test plan and execution strategy for Mac Platforms. Developing and optimizing the framework, tools and tests to build a controlled validation environment for small and large scale validation. Analyze large scale data with help of data analysis tools and drive data driven debug of issues cross-functionally with software, hardware and silicon design teams. Debugging failures from internal and cross-functional teams, across SW/FW/HW to arrive at root cause Analyzing large data sets to find trends and anomalies in system behavior. Summarize and represent validation progress and issues of concern in executive review meetings", "key_qualifications": "8+ years of experience as a post-Silicon Validation engineer. Previous experience in pre-silicon or post-silicon validation Strong System Architecture background with an in-depth experience defining validation methodologies for new hardware systems Experience working on validation of different system level features like power, performance, thermals etc. Proven track record with the ability to analyze data at scale and make meaningful insights and recommendations for any DOEs needed for debugging of issues/enablement of features with Cross-functional partners including Software/Firmware, System Hardware and Silicon teams Programming experience in Python, C, Shell scripting Understanding of object oriented programming, data structures, algorithms Outstanding communication and collaboration skills PREFERRED SKILLS: Test automation experience and large scale testing Protocol analyzers, oscilloscope Data analysis tools like Tableau, JMP and Splunk", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master's degree in Electrical Engineering, Computer Engineering or Computer Science", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543327"}