{"title": "Project Manager - Greater China R&D Office", "summary": "At Apple, we believe that in order to do our best work, we need to make a significant impact in the communities where we live and work. The Greater China R&D Office is looking for a dynamic Apple team member who is interested in ongoing management of strategic projects. This is an exciting opportunity for the right individual to help the team improve the positive impact in our R&D communities in Greater China.", "description": "Ongoing project management for key cross-functional projects, i.e. Digital Transformation, R&D Operations, R&D Comms and Events…etc. as the primary point of contact; Coordinate with both internal and external partners for project planning and smooth executions; Provide critical thinking and insights to influence and build strategies for external and internal engagement projects Provide regular updates and escalate critical risks to the leadership team; Conduct ongoing project reviews and provide analytical reports to the management team", "key_qualifications": "Empty", "preferred_qualifications": "Proven track record of successfully leading strategic projects combined with the ability to execute tactical project-level activities and tasks Ability to anticipate risks and issues before they intensify and actively drive toward a solution; Strong organizational and planning skills with a high level of holistic and strategic thinking, and attentions to details; Strong writing and interpersonal skills; Good at presentation and keynote design. Solid experiences in managing resources and preparing appropriate documentation, Comfortable with ambiguity and ability to bring structure and clarity where none exists; Willingness to adapt to rapidly changing environment and new challenges; Highly self-motivated and self-managing", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556633"}