{"title": "DFM Engineer-Flex Assembly / FPCA", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "-  Act as project leader and oversee a variety of projects, collaborate with factories and handle on technical and quality.\n-  Collaboration with upstream and downstream on design, process, quality, specifications and issues.\n-  Plans, develops and implements technical procedures for Flexible Printed Circuit Assembly (FPCA) manufacturing process and quality requirements.\n-  Provides early manufacturing involvement to ensure new products is manufacturable. Perform design, manufacturing process, quality review, identify design and manufacturing risks, provide design and process solutions during New Product Introduction (NPI) to mass production, and handle the implementations and qualification.\n-  Establish guidelines, Standard Operating Procedure & Best Known Method for manufacturing process & quality control.\n-  Handle NPI projects and build, improve quality and efficiency, to ensure seamless transition to mass production.", "key_qualifications": "Minimum 3 years process or quality engineering experience in electronic industry. SMT and assembly experience are preferred\nWilling to travel, to support project in different regions\nGood communication, problem solving skills and presentation skills.\nGood team-player and highly independent, able to work under fast pace and pressure environment. Highly committed and result orientated.\nAble to apply quality tool like: process capability, SPC, MSA, FMEA and etc.", "preferred_qualifications": "", "education_experience": "-  Minimum Bachelor Degree or equivalent experience In Engineering or Science fields.\n-  Master Degree or equivalent experience or MBA is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545698"}