{"title": "Software Engineer - Core Networking", "summary": "The Networking team creates foundational technologies that enable Apple products to communicate with each other and the rest of the world reliably, efficiently, securely, and privately.", "description": "The candidate needs to be able to work in a fast paced environment, operate gracefully under stress, handle multiple assignments in parallel, and be self driven to be effective in an environment with little overhead. The candidate also needs to show initiative, be able to take ownership of a problem area, and demonstrate an ability to understand the role of the group's technology in the larger context of the product and network environment. The position has cross-functional aspects and the candidate will need to show excellent interpersonal and communication skills.", "key_qualifications": "Commercial networking software and/or hardware products development experience, Strong software design and development skills, including C or C++ programming language experience, Up-to-date and thorough knowledge of: Link-layer technologies (e.g. Ethernet, Wi-Fi, Cellular, etc.), TCP/IP protocol suite, Networking stack implementations (e.g. BSD, Linux/Android, Solaris, etc.), System level and network troubleshooting skills, Excellent communication and interpersonal skills", "preferred_qualifications": "", "education_experience": "BS in Computer Science, Electrical Engineering or equivalent networking software development experience", "additional_requirements": "Preferred Experience: System level development experience on iOS or macOS Experience with user-space networking stack technologies and frameworks (e.g. netmap, DPDK, VPP, etc.) IP routing and NAT/Firewall Software switches API development experience Hardware offload experience Wireless networking technologies and standards (Wi-Fi and cellular) Network debugging tools (e.g. packet sniffers, protocol analyzers) System profiling and performance optimization experience.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547859"}