{"title": "AIML - Platform, Principal Machine Learning Engineer", "summary": "Do you have a passion for pushing the boundaries of AI and machine learning? Are you eager to tackle complex problems and develop innovative solutions that make a real impact? If so, we want to hear from you! We are seeking a highly motivated and very experienced principal machine learning engineer to join our Machine Learning Platform Technology (MLPT) team. In this role, you will play a key part in designing, developing, and deploying cutting-edge AI solutions that drive and deliver business value.", "description": "As a principal machine learning engineer in the machine learning platform team, you will collaborate with ML engineers, software engineers, and product managers to ensure the ML Platform can quickly adapt to the needs of evolving AIML landscape at Apple.Specifically you will have the following responsibilities: - Stay up-to-date on the latest advancements in AI and machine learning research, and explore their potential application within the company. - Work with Apple’s ML product and service teams to understand their machine learning journey and needs, help them use ML Platform features efficiently, and translate their needs into ML Platform features. - Help improve machine learning team improve training efficiency by Implementing and optimizing their workflow, algorithms, and techniques.", "key_qualifications": "5+ years of experience working on AI or machine learning areas, with strong engineering background Proven track record building and deploying end-to-end ML solutions in production environments Experience in instrumenting, measuring, and continuously improving the performance of ML applications Deep understanding of machine learning algorithms and techniques, and a keen interest in staying current with the latest advancements in AI technologies Excellent programming skills in Python (or a similar language) and familiarity with machine learning libraries (e.g.,TensorFlow, PyTorch, or JAX) Excellent communication and collaboration skills Bachelors degree in Computer Science, Engineering", "preferred_qualifications": "Solid software engineering foundation with experience in building scalable and maintainable systems Experience with data wrangling, pre-processing, and feature engineering Master's degree in Computer Science, Engineering, or equivalent experience in related fields", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $197,400 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554434"}