{"title": "Software Power Systems Engineer", "summary": "Are you excited to help shape Apple's future software features? Do you desire to understand the ins and outs of Apple’s operating systems and services? You will have that opportunity on the Software Power Systems team. We're looking for a passionate and hardworking person to join our amazing team, and we'd love to hear from you. You will be challenged to influence Apple’s latest features and technologies to ensure they ship with excellent battery life. You will dive into how different features and system services are designed, and work with cross-functional teams to improve the energy efficiency of their code. We constantly look to innovate on energy efficiency and find ways to safeguard our customer's battery life experience while providing 3rd party developers a rich platform to build impactful features. Every ounce of energy you save will impact millions of users and devices, resulting in a greener earth!", "description": "You’ll be working closely with many cross-functional teams to optimize battery usage of software features across all layers in the software stack on multiple platforms. You’ll have the opportunity to refine existing APIs or build new energy efficient APIs to help developers complete tasks more efficiently. You will also be able to develop software to help with triage of such issues, and work with analytics data to understand large scale trends and hot spots. To be successful in this role, we are looking for someone with great communication and cross- functional skills, strong OS and systems background, a good sense of software architecture, and strong debug/triage skills.", "key_qualifications": "N/A", "preferred_qualifications": "Ability to independently learn new technologies, prototype and design software solutions, Experience with development on embedded platforms", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556936"}