{"title": "AirPrint and AirPlay Certification Quality Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. The Connected Media Team is looking for a creative, organized and hardworking QA Engineer with experience working with consumer printers who can join the team responsible for certification of AirPrint, Apple’s AirPlay Video and AirPlay Audio technologies on 3rd-Party products. The ideal candidate will have experience verifying specification compliance, communication with 3rd-Party engineering teams, and demonstrated expertise isolating hard-to-diagnose bugs. Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something", "description": "This role will include creation and execution of quality test plans of 3rd-Party HW/SW solutions that integrate closely with Apple’s AirPrint technology, while occasionally assisting with some of the other technologies we support. Job responsibilities will include validation of vendor certification program results, OS updates, bug investigations, and the ongoing development of test tools. This role involves writing and supervising high-quality bug reports, reporting on project progress, documentation, and risk analysis. You will be able to adapt to changing tasks ranging from test-lab focused QA to configuration setup and hard-to-reproduce bug investigations. This position requires a self-motivated individual with strong analytical, problem-solving, testing, and interpersonal skills who can deliver in a fast-paced environment. You can work well in isolation and with teammates spread around the world.", "key_qualifications": "", "preferred_qualifications": "Experience with AirPlay video and audio devices, Proficiency in Objective-C and Swift programming languages, Experience with Xcode and XCUITests", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,731 and $204,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554675"}