{"title": "JP & KR Financial Analyst, Demand Forecasting & Analysis", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we create products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job… Just be prepared to dream big! Join Apple Sales finance in Tokyo for a role in Demand Forecasting and Analysis (DF&A) to support Japan and Korea reseller business. You will be key partner of a dynamic and agile Sales Finance organization. You will support executive team’s strategic decisions by providing financial insights based on in-depth analysis and highlighting risk & opportunities proactively. We need a bright and motivated individual who learns quickly, is curious, and can collaborate and challenge effectively. The successful candidate is an excellent professional with strong analytical skills and has experience in a multinational and dynamic environment.", "description": "As a DF&A financial analyst, you will own and be involved in the following activities; - Work close with Sales and other Sales Finance team to model the demand forecast for your assigned product and deliver written and verbal presentations to senior management and executives - Propose detailed revision to current quarter forecast on a weekly basis and explain internal and external drivers & financial impact - Understand the Japan & Korea Channel business and strategy and come with insightful analysis on the variability of business performance - Drive deep collaboration with Pacific Operation teams and Worldwide Sales Finance to enhance the business impact. - Be responsible for sharing insights and analyzing current business trends Key Interaction with: Sales Finance teams in Japan and Korea Sales Directors and Account Managers Sales Planning and Operations team Worldwide Sales Finance in Cupertino Pacific Operations team", "key_qualifications": "3+ years of forecast/planning experience or consulting/analytic type of roles High level of analytical skills with attention to details and the ability to influence with numbers Strong verbal and written communication skills with the ability to clearly articulate results to both leadership and cross-functional teams, representing Finance perspective to non-Finance business partners Self-starter with the ability to take care of ambiguity and work independently in a faced-paced environment & great teammate with a positive, dedicated, and open attitude Ability to prioritize workload and respond quickly to urgent requests. Flexible and adaptable Ability to work under tight deadlines and deal with ambiguity Extremely curious - not satisfied with easy or convenient answers; drives issues to root cause Excel Specialist and Keynote/presentation skills. Fluency in English and Japanese", "preferred_qualifications": "SQL/Tableau is a plus BA/BS degree or equivalent experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553417"}