{"title": "Product Designer (UX)", "summary": "Imagine what you could do here. Contribute your expertise to redefining the software that drives businesses around the world with Claris, an Apple company. The Claris Product Design Team is seeking a Product Designer with experience designing for complex, data heavy, enterprise solutions. Join us to design software for developers across web and native applications. Our work empowers customers to build solutions using the next generation of low code tools. We are taking on complex problems aimed at providing elegant solutions that surprise and delight our users.", "description": "From ideation to implementation, the Product Designer will work with cross-functional teams to drive results. Apply UX principles to solve problems and ship solutions. Envision and specify the expected behaviors of workflows. Use your understanding of common design patterns—but know when to break the rules. Invest attention into details where it is required. Keep the overall vision of product experience in mind as you evaluate features for enhancements. Extend into research or prototyping per your interests. Have an eye for the relative quality of visual interfaces. If you are a self-starter who is motivated to make great software, come make an impact at Claris!", "key_qualifications": "7+ years of professional experience in UX design. A strong portfolio showcasing the way you think and work. Projects that describe who motivated the design, what influenced decisions, and how you delivered the solution. Skills to iterate and move features forward with stakeholders, including engineering and product management. Ability to communicate UX concepts using low and high fidelity deliverables. Navigate an agile work environment and perform key tasks within sprints. Collaboration and communication within a design team and cross-functionally. A background of working on enterprise software is a bonus. Know the tools. Experience with Sketch is strongly preferred. Familiarity with Apple’s Human Interface Guidelines is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience (User Experience Design, Human-Computer Interaction, Information Science or similar degrees preferred).", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550203"}