{"title": "Senior Product Manager - Apple Cloud Infrastructure", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We are building out a multi-cloud platform that will power Apple's key services ranging from Music, TV+, Sports, and AI/ML offerings. Apple's Cloud infrastructure has core platform services and managed services required for public cloud development, deployment and wide-scale adoption. We are seeking experienced Product Managers to work closely with internal customer teams across Apple to understand product needs, and collaborate with engineering teams to drive the product roadmap for a secure, scalable, and automated cloud platform. The ideal candidate has a proven understanding of public cloud platforms with experience in one or more domains including cloud computing, AI/ML infrastructure, data platforms, storage, cloud security and networking concepts. The successful candidate should have experience working with public cloud technologies in a large enterprise environment.", "description": "We are building a multi-cloud platform that powers every service at Apple and enables us to delight consumers around the world. We are looking for technical product managers who understand cloud technologies and are passionate about working with engineering teams to build scalable cloud technologies and working closely with customers to co-develop solutions. We are looking for self-starters, go-getters, and strategic problem solvers!", "key_qualifications": "", "preferred_qualifications": "Strong technical understanding of infrastructure services and / or cloud technologies. Able to identify and explain challenges to both technical and non-technical personnel. Experience communicating engineering technical challenges that may affect business timelines. Strong verbal and written communicator with the ability to influence and build consensus in a collaborative way. Comfortable dealing with challenging priorities spread across multiple customers.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559037"}