{"title": "Account Manager, Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content in a brand-safe environment, while supporting publishers and journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with captivated audiences. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone.", "description": "We’re looking for an extraordinary Account Manager to lead the day to day management of advertising on Apple’s platform. This role’s focus will be on client and campaign management from pitch, to post-sale analysis. The Account Manager will partner internally with sales, production, operations, product, finance, legal, and marketing. The role will be responsible for leading efforts in areas like working closely with sales teams, campaign setup and execution, monitoring and reporting of campaign performance, creating and providing clients with campaign reporting, managing client relationships, and delivering superior customer service.", "key_qualifications": "Ad scheduling & campaign management experience\nExperience with Video Ads, Display, or the like\nHigh level of technology experience, with an understanding of the latest advertising technology\nStrong relationship building and diplomatic communication skills\nExcellent written and verbal communication skills\nDetail-oriented with exceptional organizational skills\nStrong analytical and problem-solving skills, and a solutions-oriented focus\nAbility to work independently and with a team in a fast-paced, rapidly-changing environment", "preferred_qualifications": "", "education_experience": "BA/BS or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $88,100 and $173,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefits, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551945"}