{"title": "SAP Engineering Manager, Enterprise Systems", "summary": "posted: 31 May 2024 Weekly Hours: 40 Role Number: 200547635", "description": "The SAP Global Systems team within IS&T runs the Operations and financial transactional platform that powers all of Apple functions such as Sales, Manufacturing, Distribution, Service and Financials. You should have in-depth knowledge of the latest SAP landscape, Customer Service module and its integration with other modules with end to end service flows. Ideally you should have gained hands-on experience during prior project implementations. You should be familiar with SAP S4 HANA and related new generation technologies. As SAP Service solutions manager, youʼll be working closely with our business and functional teams to provide systems solutions and craft program roadmaps while leading a group of motivated individuals. This is a management position that will support several business critical projects. While developing your team and leading their deliverables, you will have some similar projects of your own. You will be encouraged to effectively influence the team and consistently balance your and your teamʼs work for the best results. This role is an opportunity to do more than you ever thought possible, while making impact on globally recognized products and brand.", "key_qualifications": "12+ years of SAP experience in the service management domain (service notifications, service contracts, quotes, order generation and processing, pricing, contract management). 5+ years of experience in leading SAP functional teams of 5 or more Participated or led planning and implementation of companyʼs transition from ECC to S4 HANA especially in service management domain Validated ability to encourage, train and mentor team members in more than one SAP functional area Experience and understanding of hi-tech industry SM business processes areas such as warranty claims management, service repair models and service contract management along with cross module integration such as sales(SD), logistics(LE) and finance(FI) Exposure to SAP solution design and good understanding of industry trends and technologies such as Business Rules framework, Enterprise Portal, iOS, UI5, Fiori, Webdynpro Familiarity with optimization/solver algorithms and machine learning topics is a plus Experience with B2B systems integration with business partners outside of Apple such as 3rd party logistics partners, repair depots, authorized service providers and insurance partners.", "preferred_qualifications": "", "education_experience": "Masters/Bachelors Degree in Computer Science, Management Information Systems or equivalent. Masters in Business Administration (MBA) or Masters in Operations in Engineering is a plus 12+ years of SAP experience in the service management domain", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547635"}