{"title": "Partner Enablement Operations Program Manager", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.", "description": "In this role, you will: - Design and implement program operations strategy for the Apple Excellence Program that is fully standardized across all Apple Partners...", "key_qualifications": "", "preferred_qualifications": "Background working in a Channel, Retail, and/or Field Support environment is a plus, Expert organization skills and attention to detail; Ability to prioritize, manage, and advance multiple projects and deliver results in a fast-paced and ambiguous environment, Strong collaboration and relationship building skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners, Passion for the customer experience, self-motivation, and the ability to operate with a great sense of urgency, with autonomy and extremely tight timelines, Ability to cultivate teamwork, influence without authority, and take others on the journey, Forward-thinking mindset to see the big picture while deeply understanding the details; Ability to create solutions and make the complex simple, both in verbal communications and in developing and designing processes, Prior experience in SDLC project management and analysis including scoping / timeline management, documenting use cases, process flows/swim lane diagrams, requirements, user acceptance testing, and/or change management is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558204"}