{"title": "AIML - Sr Responsible AI Research Manager, Data & ML Innovation", "summary": "Join us as we build the best products for our customers! Apple's Data and ML Innovation team focuses on innovative technologies, methodologies, and research to enable fantastic user experiences and advance the frontier of machine learning. Our team is looking to hire a technical leader with a strong record in Applied Research passionate about ML and Human-Computer Interaction, mainly as applied to the responsibility, fairness, and safety of Generative AI. In this role, you will lead and build an organization accountable for researching and making ML technologies that enable breakthrough user experiences while upholding Apple's values and quality standards.", "description": "This role will be highly multifunctional. You will collaborate closely with highly skilled machine learning researchers and engineers, software engineers, and design teams to develop and deliver groundbreaking solutions for Apple products that uphold our values and quality standards. We believe that the most exciting problems in machine learning research arise at the intersection with real-world use cases and that this is also where the most critical breakthroughs come from. In this role, you will be both an internal leader and a leader in the external research community to translate applied research work into broader societal impact. AS A SENIOR RESEARCH MANAGER, YOU WILL: -  Lead teams of machine learning and research engineers to define and deliver responsible machine learning technologies -  Advocate for scientific and engineering excellence: You will contribute to the architecture and high-level structure of our AI-driven platform and features. -  Work cross-functionally on a diverse set of challenging problems and collaborate with extraordinary software and machine learning engineers and researchers to impact the future of Apple products. -  Work closely with product and partner teams to drive requirement definition, technical quality of deliverables, and execution. -  Build and grow inclusive, high-functioning, diverse teams.", "key_qualifications": "5+ years leading teams that have delivered sophisticated machine-learning systems and human-centered AI products; Strong research or product deployment record in areas related to responsible AI, with publications in top ML and HCI venues, e.g., ACL, CHI, CVPR, EMNLP, FAccT, ICML, Interspeech, NeurIPS, UIST, etc.; Strong in research fundamentals, machine learning principles, and development methodologies around LLMs, foundation models, and diffusion models; Strong in human-centered research and design fundamentals in Human-Centered AI, Responsible AI, Human-Computer Interaction, and related fields; Strong organizational and operational skills working with large, cross-functional, and diverse teams", "preferred_qualifications": "", "education_experience": "Ph.D. or equivalent experience in Computer Science, Machine Learning, and Human-Computer Interaction.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541208"}