{"title": "Supply Demand Management", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Apple is looking for a dynamic, highly motivated, Asia Operations Supply Demand Planner. \n\nOur China team will be the voice of Apple’s worldwide customers to the production and operations teams in China. As the liaison Apple’s headquarters and Apple’s Asia Operations team and OEM partners, this person will develop, communicate, and complete end-to- end product demand and supply plans across all channels of distribution in over 80 countries for a current or future product line. Product line assignments will be made at the time of hire in any of Apple’s multi-billion dollar businesses, including Mac, iPod, iPad, iPhone, Wearable and Accessories. \n\n-  Be the demand and supply representative in China for forecast, inventory, and multi-channel sell through analysis, able to bridge biz strategy to operational supply chain management.\n\n-  Be a member of the global process to define the launch strategy including launch target and execution plan of new product introductions and balancing the NPI E2E daily planning to ensure smooth product transitions.\n\n-  Drive the execution of the weekly and quarterly supply plans that meet Apple’s financial objectives. Evaluate risks. Plan and implement contingency plans to mitigate.\n\n-  Partner with Apple Operation team on OEM site strategy development and plan factory capacity requirements based on demand projections, call out the risks and provide prioritization during constraint.\n\n-  Partner with the material and global procurement teams to allocate constrained components, ensure Apple pack request and customer commits is able to be secured under an optimized allocation.\n\n-  Coordinate with OEM and Apple Operations / Logistics teams to ensure a detailed execution plan through Pick Pack and Ship to serve an outstanding customer experience.\n\n-  Lead product and biz review and recommended actions to Asia Procurement Operation executive management team on a weekly basis.\n\n-  Well-verse in Lean/Work Process Improvement methods such as Value Stream Mapping, Kaizen, Loss elimination analysis. Have experienced in leading supply & demand planning work process improvement projects and able to find opportunities for work process efficiency improvements.\n\n-  Define and measure OEM key performance measurement metrics and drive continuous improvements, such as forecast accuracy, fulfillment rate, etc.", "key_qualifications": "-  BA/BS required; MBA preferred, or equivalent work experience will be considered. APICS is a plus.\n-  Prior experience in Sales & Operation with supply and demand planning is strongly preferred.\n-  In this role, you will combine a working understanding of outstanding supply chain practices, strong problem solving capabilities, and business savvy.\n-  You are encouraged to exert thoughtful influence in a matrixed organization - should be a strong teammate and communicator. You should be confident to speak publicly to senior management.\n-  Broad knowledge of ERP and supply chain optimizations industry tools such as SAP. Six Sigma Black Belts is plus. Strong Excel skill.", "preferred_qualifications": "-  Strong understanding in heuristic and non-linear optimization methods. Have experiences in predictive and optimization modelling, Gurobi Solver is preferred.\n-  Ability to troubleshoot and root cause results from thousands of intersection data. Have experience in crafting and using applications such as Tableau is preferred.\n-  Apple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556651"}