{"title": "Software Engineering Manager - Intelligence Platform", "summary": "Have you ever received a phone call from someone you don’t know, but your phone does? Booked a flight, and the event was added to your calendar for you? Photos automatically recognizing the people in your photo library? We use privacy preserving techniques to build on-device intelligence which power experiences that touch the lives of millions of Apple users! We’re looking for an exceptional Software Engineering Manager to lead a team responsible for a crucial part of the core data and knowledge platform that powers a wide variety of intelligent, personalized experiences across Apple products. The ideal candidate wants to tackle big problems and cares about getting the little details right!", "description": "As an engineering manager in the Intelligence Platform team, you will be a strong technical leader across software engineering and machine learning, support the growth and well-being of your direct reports, create a strong team culture and shape the vision and roadmap of the team. The team is a great mix of strong systems software engineers and machine learning engineers, pushing the envelope of our on-device data and knowledge landscape. You will own, execute and deliver significant features and initiatives to enable new experiences. You will guide the architecture and technical direction for our systems, track project status and deliverables, communicate status and progress clearly to leadership and cross-functional partners and balance high quality product delivery under tight schedules while fostering long term innovation. You will communicate and drive decisions on various aspects such as user experience, technical design, privacy and security. You are a trustworthy and capable manager that can recruit great engineers to work on your team, develop them appropriately, and guide them to work together and deliver amazing products for our customers. You are dedicated to our shared goal of building a culturally diverse and pluralistic team that reflects the multicultural variety of our customers.", "key_qualifications": "3+ years experience hiring & leading a team of machine learning / software development engineers\nExperience developing production software\nA deep understanding of software development lifecycle, methodologies, and best practices\nHave experience in Knowledge Graphs (KG), RAG systems, integration of LLMs with external memories, Vector databases and related fields.\nAttention to detail and a strong passion for quality – experience architecting, designing and developing high quality customer-facing software\nAbility to lead various aspects of the software development process, including user experience, system architecture, APIs and project schedules\nA demonstrable commitment to continuous self-improvement - a leader by example.\nExperience working with and leading multi-functional technical teams is highly desirable\nWilling to take ownership and set direction, especially in gray areas\nExcellent collaborative skills including written and verbal communication", "preferred_qualifications": "Master’s degree/PhD in Computer Science or related field", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554619"}