{"title": "Battery Manufacturing Test Engineer", "summary": "Do you have a passion for invention and self-challenge? As part of our Battery Engineering group, craft creative battery solutions that deliver more energy in smaller spaces than ever before. We work across disciplines to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world! This is an opportunity to work on the forefront of Battery Management Systems where you will help to develop and manufacture future BMS technologies! Are you ready to work with a dedicated team of engineers in a collaborative and multi-functional environment? The ideal candidate has a background in high-volume manufacturing test development for consumer electronic assemblies. You will apply your test engineer skills to develop end to end test strategies, expand test coverage and improve test efficiency for our production.", "description": "The battery manufacturing test engineering group (BMTE) within the Battery Management Systems organization is a critical and highly collaborative team that creates existing and future manufacturing technologies and processes. We work with the new product introduction team where you will be helping to create and introduce new battery designs into high-volume manufacturing for Apple’s world-class devices. The ideal candidate should be able to do the following. • Develop end to end testing strategies and drive to continuously improve the world-class manufacturing test processes. • Design manufacturing test processes from SMT through systems integration at FATP. • Learn test best practices and drive development and implementation of test and tester. • Collaborate with contract test vendor to ensure manufacturing equipment meets the metrology requirements. • Develops world-class manufacturing sites at our vendors to manufacture and test battery pack components. This includes printed circuit boards, PCB assemblies, and battery packs. • Owns testing specifications for complete test coverage of design features using data-driven methods and accuracy analysis techniques. • Identifies manufacturing trends and needed future manufacturing capabilities. • Establishes strong, structured, and consistent FA processes at vendor sites providing analysis and data from ORT (ongoing reliability), NPI, and field returns. • Produced detailed and rigorous work emphasizing simple and elegant solutions for mass production.", "key_qualifications": "", "preferred_qualifications": "MS or higher degree in Electrical Engineering +5 years relevant proven experience preferred. An understanding of testing techniques needed to test mixed signal (analog and digital) modules such as battery packs. Self-starter with excellent time management skills and curious spirit. Strong documentation and communication skills. Proven track record working independently under high pressure and comfortable working in a dynamic environment. Experience with battery core technologies or battery management systems is a plus (hardware, software, and firmware).", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554329"}