{"title": "Production Finance ", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you'll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple's growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You'll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is critical to upholding our global dedication to excellence, and it is directly responsible for shaping the company's future. Join us, and you'll have a significant role in continuing Apple's legacy of efficiency and success. Apple’s Original Content seeks a professional with Production Finance expertise to support Apple’s original video content efforts. You will report to the UK Production Finance Manager and will assist in the financial oversight and management of Original Content productions.", "description": "-  Assist in the financial management of the budgeting, reporting, forecasting and daily production activity of scripted and unscripted television and film productions.\n-  Oversee timely cost reporting and analyze actuals vs budget cost reports to ensure accuracy and quickly resolve any issues.\n-  Collaborate with Creative, Business Affairs and Legal in the creation and vetting of production budgets and strategically resolve issues to ensure an efficient process.\n-  Identify Production Tax Incentive opportunities, oversee and track estimates, timing of receipts and required audits.\n-  Review production cash flow projections and funding requests for accuracy and compliance with contracts.\n-  Assist in the contract review and cost analysis process in conjunction with Production, Business Affairs and Legal.\n-  Ensure productions follow Production Finance policies and procedures.\n-  Lead the setup of production accounting payroll and systems software.\n-  Ad hoc financial analysis as needed.", "key_qualifications": "", "preferred_qualifications": "Bachelor degree preferred, Proactive thinker who can prioritize and handle multiple projects and meet deadlines, Detail oriented with strong organizational, collaboration, problem solving and communication skills, Fluency in French, German or Spanish is an advantage.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554380"}