{"title": "AMR Business Process Re-Engineering- System Configuration Analyst-TMS Specialist", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish! AMR BPR System Configurations Team,  is looking for an individual who desires to join a team to work as a liaison between business users and SAP. In this role, the candidate will have the opportunity for exposure to the diverse facets of Apple's order-to-cash process. The candidate will be expected to provide proactive communications to business teams in regards to system setup for scheduled events. Second, the successful candidate will be responsible for analyzing unexpected results, process mapping to understand the relationships between people, tools and systems. Using Continuous Improvement methodology, the successful candidate will be expected to work with cross functional teams to improve and create workflow processes across the order-to-cash cycle.", "description": "The Americas Business Process Reengineering TMS System Configuration Analyst will be responsible for maintaining day to day execution BRF+ decision tables in SAP TMS by converting the business POR to the system POR with the right checks and balances. A successful candidate in this role will think broadly, understand deeply, stitch across functions and be able to shape the new offerings and roadmaps within the function they support. A successful candidate is a self starter and able to work with limited supervision. They should have a willingness to work in small groups and demonstrate leadership characteristics. Excellent verbal and written communication skills is a must, including the ability to brief senior leadership of readiness status and risk assessments.", "key_qualifications": "A minimum of 3-5 yrs direct experience in a Supply Chain related function with direct experience within Operations. A minimum of 3-5 yrs BRF+ & SAP TMS Functional experience. A minimum of 3-5 yrs of logistics execution experience. At least 3-5 direct experience with SAP order management and execution (OM&E). An automation mindset with experience in advance spreadsheet tools in Excel and Numbers. Visual basic programing experience a plus. Proven track record leading strategic programs combined with ability to execute tactical, project-level activities and tasks. Supreme tactical execution cadence and staying on top of day to day tasks and responsibilities. Experience in change management, including process improvement, technical documentation, and test planning/end-user validation. Skilled in interacting with a wide range of teams, both technical and functional, and adjusting communication and messaging for intended audience/stakeholders. Demonstrates an unwavering ability to maintain poise and a positive attitude in a challenging and dynamic environment. Works in an ambiguous, fast-paced environment, senses direction where it may be unclear, and does so without a loss of performance. Possesses a passion for process improvement and problem solving with an approach that encourages innovation, elimination of waste, and efficiency improvements through automation. Demonstrates ability to understand and explain complex business processes, systems, and tools with a specific focus on upstream/downstream impact. understands the relationship between multiple functions and/or tools. Have a solid understanding of supply chain & logistics terms and of the interaction between internal and external partners.", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree in Supply Chain, Logistics, Business, Economics, Engineering, Computer Science or related field required.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548198"}