{"title": "Subject Matter Expert - Inks Coating", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Participate on a team tasked with developing and implementing processes that create cosmetic and protective finishes for Apple’s cutting edge enclosure designs. Investigate new materials and manufacturing methods used to coat a variety surfaces across multiple product lines. Engage coating and ink suppliers to lead investigations and identify improvements in manufacturing process and material selection. Lead cosmetic and functional characterization activities to define specifications with Product Design team. Lead development of ink and coating control plans and work instructions at supplier locations. Provide structured problem solving support, organize and prioritize investigations, and drive implementation; analyze failure root cause and implement closed-loop corrective actions to ensure timely closure of quality issues. Understand reliability testing requirements and drive production to meet specifications. Understand relationship between formulation, mixing, coating, curing processes and product performance. Leverage this understanding to troubleshoot production problems. Conduct yield gap studies and develop/implement plans to close. Optimize equipment and fixtures to drive process capability. Work with Global Supply Managers to develop measurement technologies feasibility and viability to mitigate commercial and ramp risk. Proactively support identification / selection / qualification of new coatings and ink suppliers globally to enhance supply and technical capability of our supply chain.", "key_qualifications": " ", "preferred_qualifications": "Experience or great knowledge in pre-treatment process, Materials development and curing process is a strong plus. Ability to program-manage across multiple projects, vendors and resources. Experience leading process development in a high volume manufacturing environment. Experience in massive data analysis, coding and machine learning would be a plus.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554738"}