{"title": "Associate, Corporate Development", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our customers and if you bring it to your job....there's no telling what we will accomplish. We are seeking an associate who will be a core member of our world class Corporate Development team. This small yet dynamic team is responsible for Apple’s acquisitions, investments and partnerships, as well as other complex strategic analysis for Apple senior leadership.", "description": "You will evaluate acquisition opportunities and lead cross-functional M&A deal teams including senior members of Apple’s engineering, operations, finance, marketing and legal teams. Be responsible for all aspects of M&A execution including negotiation, documentation, diligence and integration planning. Research and analyze industries, companies, technology segments and business models. Evaluate the merits of complex alternatives and present findings to Apple leadership. Analyze potential strategic investments and support existing investments.", "key_qualifications": "", "preferred_qualifications": "Innate curiosity as it relates to consumer technology and Apple\nProven ability to lead and drive complex projects/analyses\nExceptional analytical skills\nExcellent oral and written communication skills\nStrong financial modeling skills\nConfidence and poise in presenting to executive management\nExtraordinary focus on detail and producing accurate and quality work\nStrong understanding of accounting, corporate finance theory and valuation methodologies\nIntegrity and reliability with the ability to balance multiple projects/priorities", "education_experience": "Education: Bachelors Degree\nExperience: 1-3 years experience in investment banking, corporate development, private equity, venture capital, or management consulting\nOther: Proficiency in Excel", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,100 and $173,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555646"}