{"title": "Benefits Admin Specialist", "summary": "Imagine what you could do here at Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join the Apple GBS organization and make a positive impact, where you will share in a dedication to perfection by partnering with teammates, all with one unified vision—creating innovative products that delight customers. Finance is about “fueling innovation”. We do this by hiring quality individuals with integrity and personal accountability, who value collaboration and forward thinking. If you share these values and want to be part of something big, contact us today. Apple’s H2R Compensation Services Team is seeking an AMR Benefits Administration Specialist skilled at providing the highest quality support to our employees and business partners in a highly dynamic fast paced environment. The Benefit Admin Specialist will be working with internal and external partners to ensure proper closeout of employee cases. We’re looking for an individual who’s innovative, driven, collaborative, and trustworthy; someone that maintains a calm, polite and personal demeanor when communicating a sensitive or challenging message.", "description": "- Review and analyze various vendor reports to determine necessary updates required and/or work directly with vendors to ensure records are updated accordingly - Manage Benefit invoicing and enroll/un-enrollment process by working closely with internal/external partners - Maintain accurate and acceptable files on each employee, following company policy and procedure - Maintain the employee relationship as it related to the processing of the employee payroll. This includes responding to questions and resolving payroll issues Some of the key responsibilities include: - Action Benefit, Leave, Time Away, Survivor support & Reimbursement employee and vendor requests - Support inquiries and audits for US Fidelity 401k, Workers Comp, Sedgwick, WTW & Cigna, Desjardins - Support US Supplement Leave Process & Time Away Integration", "key_qualifications": "", "preferred_qualifications": "Obsess over the employee experience and view each and every inquiry as an opportunity to care and support others; able to create methods to keep an eye on quality without missing key deadlines Can navigate highly complex business needs without a clearly defined path and where you see a need, to bring a well-thought solution Find love in the details and are action-oriented; Use data to tell a compelling story of successes and opportunities; Creating action plans and driving improvements is something you enjoyDescription Perform weekly comparisons of large data sets for US, Canada, and Latin America pension and benefit reconciliations and payments. Bilingual Spanish a plus but not required Understanding of benefits and payroll administration, processes, and tools Proficient with Excel, SAP, Workday, and other communication, reporting, or database tools.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558497"}