{"title": "Global Regulatory Policy Lead", "summary": "Our ever-evolving suite of Heath and Wellness products for iPhone and Watch are helping our users live more active, healthier lives. Be ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same dedication to innovation also applies to our business practices -strengthening our commitment to leave the world better than we found it.  The  Health group is looking for a Global Regulatory Policy Lead to oversee advocacy efforts for Apple’s medical devices features, globally. If you are passionate about the health space and want to have an incredible impact here at Apple, this could be the role for you. We are an efficient organization who works closely together to establish relationships across multiple functional teams. We care deeply about getting amazing new products into our customers hands.", "description": "You will lead Apple’s global medical device policy in medical devices and represent the Health team on a diverse array of initiatives and programs, with the goal of marketing new technologies. You will work closely with partners across Health, including Regulatory, Clinical, Government Affairs and other organizations, to pave the way for innovative health features in new and existing geographies. You’ll oversee and lead Apple Health’s global policy goals as well as: Establish the vital coalitions and teams to advocate for expanding Apple’s presence in health, globally. Lead and support regulatory policy efforts internationally. Build, scale and develop international policy programs, including processes, resources and tools.", "key_qualifications": "", "preferred_qualifications": "Masters / PhD / post-secondary education preferred. Executive poise and presence, including a track record of positively influencing decisions and teams. Sophisticated knowledge of management techniques and practices including day-to-day management and establishing a team culture. Demonstrable background in being autonomous and being able to clearly work towards establish goals and initiatives with minimal oversight. Consistent track record in leading and scaling a policy team while delivering on individual goals. Shown competence in determination of appropriate global regulatory requirements and applicable policies for new products or product changes. Partnering with and across a broad swath of other Apple teams to identify horizontal policy areas and establish corresponding strategies to “look around corners” and anticipate business impact. Strong organizational and leadership skills. Excellent communication skills, both verbal and written.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,700 and $292,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559726"}