{"title": "Customer Service Advisor – French Speaking", "summary": "Every single day, people do amazing things at Apple. Here’s your opportunity to do significant work by providing extraordinary support to customers and to commit to making Apple an iconic technology company.  At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Are you a problem solver and who can build rapport easily with customers? You exceed their expectations with your mentorship, knowledge, and real passion for technology. You’re enamored by the way things operate, and be able determine how technology works when things go wrong. You have excellent verbal and written social skills, as well as the ability to effectively prioritize and manage your time. You can multitask across systems and applications, analyze, isolate and resolve a variety of complex technical issues, and comfortably navigate a technical environment. You effortlessly engage, explaining step by step solutions with patience and an approach tailored to each individual customer. You’re not only here to help fix technical issues, but also provide an incredible customer experience.", "description": "We expect everything from a Customer Care Advisor that our customers do and we want Apple to be a reflection of the world around us. As a Customer Care Advisor, you will be supporting many of our popular products, from iPhones to iPads to MacBooks to desktop Macs.  As our customers’ first point of contact, you are the friendly voice of Apple, providing outstanding customer service, troubleshooting, and technical support. We’ll rely on you to listen to our customers and use your technical knowledge, creativity, and passion to meet their needs — and remind them that behind our great products are amazing people. Because we believe our individual backgrounds, perspectives, and passions help us craft the ideas that move all of us forward. You'll be trained to reach your highest potential.  This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.", "key_qualifications": "", "preferred_qualifications": "Real passion for customer service and ownership of the customer experience, Comprehensive issue resolution, Able to effectively tailor communication and style to differing audiences, Handle own workload and work independently in a dynamic, constantly changing environment, Grows with a team where expertise is shared and feedback is inspired, Effective time management including ability to multi- task, organize and prioritize, Able to research and grasp technical information across multiple tools while talking with customers, Knowledge of one or more of the following is an advantage; iOS, Smartphone, Tablet, PC or Mac experience, Aptitude for acquiring skills in technical troubleshooting and an eagerness to learn and take on new challenges", "education_experience": "", "additional_requirements": "Available to attend approximately 3-4 weeks of required training on a fixed schedule that may include weekends, Flexible to work between the hours of 7:00 a.m. GMT and 8:30 p.m. GMT including weekends and holidays, with the possibility to flex up or down hours depending upon business needs, Successful completion of initial training", "pay_benefits": "This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, and employee discount.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549952"}