{"title": "Video Producer", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "Primary day-to-day responsibilities include but are not limited to: creating and owning effective production strategies for a variety of shoots, locations, and crew sizes. Manage end-to-end video production, executing flawlessly on time and within budget. Driving clear and consistent communication, helping everyone stay informed and keeping the team from getting overwhelmed. Act as a champion of the Apple's brand standards in all aspects of creative work. Serve as the bridge between the Creative and Brand teams and other business partners that have specific business or communication goals. Work to find creative ways to increase efficiency with production dollars and push suppliers/vendors to deliver exciting work in an even more efficient way. Compromise without impacting work the work. Ensure expenses are tracked, showing how costs have evolved and storytell as to why.", "key_qualifications": "7+ years experience in a producer role at an agency, commercial production company, in-house marketing communications or creative services department. Prior experience working upstream, anticipating and planning for change. Experience includes: TV commercial, digital, video/motion graphics production and post-production. Demonstrated project and budget management skills, with a proven track record of influencing creative output. Experience working with multiple stakeholders/collaborators with ability to negotiate agreements where varying opinions are the norm.", "preferred_qualifications": "Bachelor's Degree. Understanding and awareness of brand voice and aesthetic; ability to shape creative work that meets the organization’s expectations. A strong leader that can informally lead multidisciplinary teams with marketing communication expertise at both a strategic and executional level. A flexible problem solver who can tackle challenges successfully with a willingness to adapt and modify the approach as needed. Action oriented by taking on new opportunities and tough challenges with a sense of urgency, high energy, and enthusiasm. Exercise resiliency especially under stressful situations, maintaining a positive attitude and forward-thinking approach despite subpar circumstances or setbacks. Stellar communicator with a clear/concise approach. Deliver messages and actively listen to check for understanding. Ability to pivot communication style to meet the needs of diverse stakeholders.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $216,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555351"}