{"title": "Machine Learning Applied Scientist", "summary": "The VCV Science ML Experience Prototyping Team is seeking a highly skilled and motivated Applied ML Scientist with expertise in Computer Vision and Generative AI, who is passionate about inventing and building the future of user experiences powered by Machine Learning. We partner with teams across Apple, incubate ground breaking research ideas, push the boundaries of what’s possible, frequently demonstrate our work to executive leadership, and deliver key results as product features that will delight and inspire millions of people every day.", "description": "As an ML Applied Scientist on our team, you’ll be working with a team of computer vision and deep learning researchers and engineers to rapidly prototype ideas, test hypothesis, and investigate feasibility, with the eventual goal of shipping world-class algorithms and experiences that open up the boundaries of what’s possible. You will lead the design and development of generative AI solutions. Utilize established techniques and, when necessary, build custom algorithms to solve sophisticated challenges effectively. You will work cross-functionally to seamlessly integrate and deploy robust ML applications in a production environment. The role will enable you to stay at the forefront of artificial intelligence and machine learning advancements. Continuously exploring and evaluating new technologies and methodologies to enhance the technical capabilities of our team. Your insight will be instrumental in helping Apple to understand and shape upcoming products and technologies that will have significant impact on customers. Your work will be instrumental in helping Apple to understand and shape upcoming products and technologies that will have significant impact on customers.", "key_qualifications": "5+ years of industry or strong academic experience in CVML\nExperience with state-of-the-art Generative AI models, Multi-modal LLMs, contrastive learning, Foundation models, and/or Diffusion-based large vision models\nStrong understanding of Python, and proficiency using ML toolkits, e.g., PyTorch\nStrong software engineering skills to build scalable and robust infrastructure for deep learning data, modeling, and evaluation systems\nComfortable researching current ML literature and math including optimization methods and modeling techniques\nExperience in the transition of a prototype into a final product\nExcellent communication and collaboration skills in a cross functional setting.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550562"}