{"title": "Display Power Silicon Architect", "summary": "This is an excellent opportunity to work on the forefront of new power management technologies with the exemplary company consistently bringing innovations in the industry. In this position, you will be part of a team developing innovative concepts, and key mixed-signal ICs which are implemented in display products used by many millions of people. The position primarily involves advance power architecture development and key power ICs for Apple’s next generation products spanning watch, mobile phones, notebook computers, desktop computers and other line of products. This is a unique opportunity for “out of the box thinker” who can enable innovative technologies and superior integrations for next generation power management systems in Apple display products. This is a unique opportunity to work with the best display architects and system designers in Apple and shape its innovative products.", "description": "As a PMIC Architect, you will be driving innovative display power architecture / technology concepts and define PMICs from investigation, analysis and design through successful product level implementation. Core architecture and technologies investigation by arbitrating various options with technical rigor for key power metric performance optimization including but not limited to efficiency, power density, cost, reduced carbon foot print and scalability. Be a key member for Apple’s display silicon architecture team for new ideas and architecture definition. New power architecture concept definition for mobile devices/computers dc- dc voltage regulators...", "key_qualifications": "Candidate must have direct experience of power supply design and possess deep knowledge of DC-DC power conversion topologies including controls loop. Candidate must be intimately familiar with DC-DC IC architectures, magnetic design, PCB layout and state-of the art techniques for integration and efficiency optimizations. Strong analytical/problem solving skills and ability to guide critical decisions...", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545367"}