{"title": "Software Engineer - Travel & eApproval Engineering, Employee Experience & Productivity", "summary": "Want to build and manage the systems that provide Travel & Expense Reimbursements services to Apple? Want to help Apple work through an ever-evolving T&E landscape? If so, Apple T&E Engineering is looking for an exceptional Software Engineer who is passionate about delivering innovative solutions to meet Apple’s travel and expense reimbursement needs.", "description": "Your responsibilities will include all aspects of software development management, from design and analysis to development, implementation and maintenance. You must be a proactive and hardworking individual. As a Senior Software Engineer, you will be a contributing member of a team that implements new product features, improves existing product features, while adding performance and software quality metrics to our codebase. You will work closely with business partners, other engineering teams, quality assurance, management, as well as human interface and user experience designers. Your duties will include: Architect creative products, and innovate new technologies & solutions, play a hands-on development and design role, and deliver product in a rapid and multifaceted environment Design and develop highly scalable, reliable and secure Java applications Design and develop RESTFUL WebServices Collaborate with peers, including the iOS client team, on technical design, work estimation and implementation of new features Quickly build new ideas to get new user feedback Collaborate with other specialists on code reviews, internal infrastructure, and process enhancements Work with project managers and technical teams, in a cross-functional environment, to implement quality products that meet the business goals.", "key_qualifications": "5+ years software development experience; Very strong skills with Java (J2EE / J2SE) and related technologies: Spring Framework, JUnit; Application development and design experience using object-oriented methodologies; Hands on experience building and using REST APIs; Experience with Oracle, data replication, SQL and PL/SQL; Experience in building new micro-services platforms on cloud environments; Highly organized, someone who thrives working in a fast-paced environment, and loves learning new technologies; Excellent knowledge of data structures, algorithms, design patterns, enterprise architecture and software engineering principles; Poses excellent communication skills and can influence cross functionally", "preferred_qualifications": "", "education_experience": "BS degree in computer science or equivalent field with 5+ years or MS degree with 3+ years experience, or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525926"}