{"title": "Optical Process Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Panel, Process and Optics group, you’ll help ensure our products work beautifully through the successful design, fabrication, and implementation of components in Apple devices. Apple is seeking an enthusiastic engineer with great passion on next-generation display and optical sensing technologies. In this role, you will own the investigation on the nanoimprint process development for novel diffractive optical components for our outstanding displays and sensors. You will face new technical challenges and create ground breaking technologies to revolutionize the field of optics. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience.", "description": "We are seeking an optical process engineer with an expertise in nanoimprinting including process realization, materials section and optimization, and integration. You will innovate solutions for our optical components and collaborate with the best in the industry to craft the future of display technologies! RESPONSIBILITIES: -  Lead nanoimprint process development of optical components from conceptualization exploration to high-fidelity prototypes and consumer products delivery. -  Collaborate with teams to define and integrate manufacturable and cost-effective process solutions for sophisticated nano-patterning technologies. -  Lead the cross-functional interaction with Product Design, Engineering/Operations, and international suppliers to execute the nanoimprint lithography process tuning, realization, and optimization. -  Lead analysis and fixing for failures and component performance improvement. -  Give engaging presentations and reports to a range of partners.", "key_qualifications": "BS and a minimum of 10 years industry experience in Engineering Physics, Material Science, Physics, Chemistry or equivalent. Proficiency and hands-on experience in nanoimprint. Expertise on the types of nanoimprint MP-feasible equipment configurations, and process flow. Expertise in material property and selection, nanoimprint surface treatment, and the trade-off between performance metrics. Knowledgeable of nanoimprint mold fabrication, resin composition and formulation. Knowledgeable of other process building blocks including nanoimprint lithography (NIL), etching, thin-film deposition, and wet processing. Knowledgeable of nano-fabrication characterization methods (XPS, SEM, TEM, AFM, XRD, FT-IR, etc). Knowledgeable of optical device characterization (Interferometer, Spectrometer, Ellipsometry, etc). Efficient and confident communication with cross-functional teams and management. Experience in managing domestic and international suppliers, plus the willingness and ability to travel up to 20%. Creativity and out-of-box thinking in problem-solving and root cause analysis.", "preferred_qualifications": "Knowledgeable of diffractive optics or nano-photonics. Experience in high-volume manufacturing of nanostructure-based optical components/devices.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556382"}