{"title": "File Systems Engineer", "summary": "The people here at Apple don’t just build products — they craft the kind of wonder that revolutionises entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The File System team is looking for an engineer that will contribute to the design and implementation of Apple's file systems and services for our platforms (macOS, iOS, watchOS, tvOS). Filesystems and in particular our next generation filesystem APFS, are a core technology for all of our software platforms, and the base for our operating systems as a whole. Working on these technologies, you will have the opportunity to have a major impact on the design and implementation of Apple's consumer products. Our environment fosters product innovation, rapid software iteration, and a liberating amount of autonomy. The work will require close collaboration with other teams in the US.", "description": "Work with a highly skilled engineering team in the design and implementation of file systems technologies. Design and implement new product components that require research and analysis. Participation in all phases of a product development cycle: from product definition and design, through implementation, debugging and testing. Play a key role in system performance analysis and optimization. Perform functional, system, and load/stress analysis. Maintenance and enhancement of existing file systems. Work with cross-functional teams to support developer and product requirements. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request", "key_qualifications": "Excellent C/C++ coding skills.\nSolid understanding of file systems, data structures, operating systems.\nExceptional problem solving and debugging skills.\nIndependent, highly motivated, with good interpersonal skills.\nA strong commitment to developing for testability and reliability.\nExcellent spoken and written communication skills.\nExperience with Linux /Windows kernel programming - Advantage.\nExperience with development in OSX Kernel and iOS environments -Advantage.", "preferred_qualifications": "", "education_experience": "B.Sc. or higher degree in CS/CE", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539408"}