{"title": "PLM Software Engineer, Enterprise Technology Services", "summary": "The IS&T Product Engineering Systems group is seeking a PLM Engineer who has a proven track record in designing and developing high quality enterprise software solutions! Our group is responsible for Enterprise Product Lifecycle Management (PLM) transformation initiative to deliver next generation PLM/PIM Platform to drive Apple’s Product Innovation across hardware, software and services lines of business. We are looking for someone with experience building and delivering large scale solutions on Teamcenter PLM platform. This individual should have the sound technical knowledge and leadership skills!", "description": "Join the IS&T Product Engineering Systems group as PLM Engineer, where you will help build innovative enterprise software applications. Your responsibilities include working with the business partners to define the project requirements; developing architecture and detail design; implementation and maintenance. Ownership of all engineering and product feature work in release cycles. Design and develop solutions for scalability, extensibility, security, and performance. Must be able to communicate and work with multi-functional IS&T and Business groups. Must be self-motivated, creative, operates with minimal directions with on-time results. Strong multi-tasking skills are crucial. This is a software engineer role that will demonstrate your hands on coding skills and leadership skills with other developers and vendors to deliver the solution. You will also enjoy the benefits of working in a fast-growing business where you are encouraged to 'Think Different' and where your efforts play a key role in the success of Apple's product design and innovation.", "key_qualifications": "3+ years of experience in Siemens Teamcenter PLM developing custom solutions, including BMIDE data model configuration, AM Rule, Workflow, BOM configurations, ITK/C++ server-side customizations, and Active Workspace Client (AWC) customizations using Siemens Web Framework. Proficiency writing C/C++ code, as well as troubleshooting and fixing compilation, memory, and performance issues * Experience with large scale Teamcenter deployments which integrate with enterprise applications for authentication (e.g. SSO) and authorization, as well as ingestion and propagation of PLM data. Experience working with distributed teams using collaboration tools for software configuration management (e.g. Git / GitHub), agile project management (e.g. Jira), and knowledge repositories (e.g. Confluence / wikis). Effective interpersonal, analytical and communication skills.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524658"}