{"title": "Senior Machine Learning Engineer", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! Here on the Apple Store Online team, we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, to help us do extraordinary things.", "description": "In this role, you will conceptualize, design, and develop core algorithms that power our buy- flows and personalize the experience across the Apple Online Store. This includes developing production algorithms for search, recommendations and personalization, running offline experiments and building online A/B tests to run in production systems. In addition, you will lead and architect end-2-end complex systems in the field of Big data, Semantic search, Content management and Scalable Services with cross-functional impact. You will provide mentorship and leadership within division and influence beyond your own project to bring innovation and state-of-the art solutions. To be successful, you need a strong machine learning background, proven software development skills, a love of learning, and to collaborate well in multi-disciplinary teams. You will need to exhibit strong communication and leadership skills, an ability to set priorities, and an execution focus in a multifaceted environment. The team responsibilities include: model development and deployment on-device and web, developing back-end data pipelines, and producing automation processes for machine learning tasks. You will closely collaborate with other engineering teams (including Hardware, QA, Infrastructure) to ensure the solutions are meeting the highest quality standards. Contributes to an inclusive environment through respecting each others’ differences and having the curiosity to learn. Demonstrates Apple’s values of inclusion and diversity in daily activities.", "key_qualifications": "6+ years related experience, including experience in machine learning\nExperience in Recommendation Systems, Personalization, Search, Computational Advertising or Natural Language Processing\nStrong programming skills in Java, C/C++, Python, or similar language Experience developing enterprise production machine learning models\nExcellent problem solving and analytical skills\nStrong communication and collaboration skills\nPassion for delivering business impact\nExperience with Spark, TensorFlow, Keras, and PyTorch a plus\nExperience using Deep Learning, Bandits, Probabilistic Graphical Models, or Reinforcement Learning in real applications a plus\nSkilled in communication, problem solving, strategic thinking.", "preferred_qualifications": "", "education_experience": "Ph.D. or Masters in a quantitative field, such as Computer Science, Applied Mathematics, or Statistics, or equivalent professional experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541230"}