{"title": "Experienced Analog Mixed-Signal Architect & Design Engineer (f/m/d)", "summary": "At Apple, we work every day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually creative IC Architect We are looking for an analog mixed-signal architect with expert knowledge in high speed & precision measurement/ sensing IPs. As a member of our dynamic group, you will have the rare and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.", "description": "In this role, the key responsibilities are the following but not limited to: - Development of high speed & precision systems from system architecture down to circuit level architecture and design of key analog functions- Develop all relevant models and views from system level (matlab) down to its building blocks e.g. Verilog-A - Define the specification of the system and all its building blocks - Working with circuit designers to ensure feasibility and performance of the architecture and all building blocks- Drive all aspects of the IP performance validation Education- Proficiency in English language is required", "key_qualifications": "Expert in the architecture development of analog mixed-signal systems for high speed & precision measurement/ sensing IPs Expert in the architecture and circuit design of high precision and high speed ADCs (SAR, SD ADCs) & DACs Expert in systems modelling and top down-design using MATLAB (control systems toolbox, Simulink), Verilog-A, Verilog-AMS, SystemVerilog and optionally NumPy/SciPy Hands on experience with statistical methods, data fitting and interpolation, dynamic system identification Good insight into mathematical methods e.g. optimization methods, graph theory, network analysis Strong consistent track record of taking chips to production", "preferred_qualifications": "PhD/Masters Degree in Electric Engineering or extensive years of relevant experience Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556461"}