{"title": "PR Manager", "summary": "Apple's worldwide communications team informs the world about our innovative products and services, and the values that drive everything we do. The team includes professionals with backgrounds in public relations, journalism, social media, employee communications, writing and buzz marketing. We’re looking for trailblazing, collaborative professionals from a variety of creative fields. If that’s you, then your next home may be here. Come and do the best and most exciting work of your career at Apple! We are currently seeking a PR Manager for our Corporate PR team.", "description": "This PR Manager will be responsible for coordinating with PR teams in the US and internationally, helping devise and execute communications initiatives, and monitor and analyze developments in the news. The role will focus on several areas within corporate communications, including operations, finance, and legal. Responsibilities will include strategic planning and execution for corporate PR, identifying and managing issues and developing relationships with reporters and influencers in a fast-paced environment and continuous news cycle. The ideal candidate will be proactive, self-motivated and detail oriented with a passion for story telling.", "key_qualifications": "N/A", "preferred_qualifications": "The successful candidate will possess a positive team-player attitude and be passionate about consumer technology. You should be able to handle multiple projects and thrive in a very dynamic environment. You should have excellent organizational skills and attention to detail. A self-starter who is dedicated and demonstrates creative and critical thinking abilities. You have excellent written and verbal communications skills and detailed project management skills. Bachelor's degree preferred.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $216,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556140"}