{"title": "Modem Platform Software Engineer", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join the Wireless Technologies and Ecosystems organization and drive innovation that matters. As part of the Wireless team, we will be working on building solutions for Wireless technologies. We are looking for a reciprocal individual who can get results and innovation in a high-paced environment. Someone who can extract extraordinary value from a task otherwise seen as routine to others. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. You should join the Apple Wireless Performance Team if you want to help deliver the next amazing Apple product.", "description": "The Modem Platform Software Engineer is responsible for developing and delivering modem BSP software for iPhone/iPad. This involves developing state-of-the-art BSP/device drivers for modems, perform board bring-up and HW validation, review HW schematics and assist HW debugging. You will also support factory testing, resolve critical issues on-site, perform modem SW integration, and stabilize the baseline. Work closely with partners like HW, RF, Protocol, and QA as well.", "key_qualifications": "At least 3 years of experience in BSP/Device Driver development and debugging. Experience in multiple driver areas is preferred\nStrong programming skills in C and C++ and assembly programming skills is a plus\nDeep understanding of multi-core embedded HW system and RTOS Good at analyzing and triaging complicated modem issues\nHighly motivated and disciplined, self-starter\nA good team player with strong verbal and written interpersonal skills, fluent English communication is a must-have\nInvestigate, prototype, and deliver new and innovative system solutions", "preferred_qualifications": "", "education_experience": "Bachelor's or Master’s degree in Computer Science or Electronic Engineering or related degree.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549970"}