{"title": "Software Engineering Manager - Secure Enclave", "summary": "The Core OS software team is looking for an exceptional software engineering manager to lead the Secure Enclave team for Apple’s operating systems.", "description": "-  Leadership and management of a team of dedicated engineers in a fast-paced and demanding development environment\n-  Ownership of Secure Enclave coprocessor’s operating system, drivers, and core services\n-  Working with multi-functional teams to design, plan, and deliver high quality software and hardware features for our operating system\n-  Creating and promoting a development environment that encourages innovation and sets high standards for quality and productivity\n-  Identifying and mitigating risks in development activities\n-  Strengthening the team by hiring and retaining top engineering talent", "key_qualifications": "An authentic passion for security, Experience leading a kernel or low-level systems team, Experience with kernel or low-level systems software development, Deep understanding of operating system fundamentals and C programming language, Experience with UNIX systems, Proven track record of successful and timely product delivery with high quality, History of setting aggressive yet attainable goals, and motivating teams to achieve them, Evidence of driving technical innovation, Passion to dig in and lead the development of ground-breaking features and products, Strong communication skills, both inward and outward", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or equivalent experience", "additional_requirements": "-  Knowledge of hardware architecture and assembly language programming\n-  Understanding of system construction principles in the context of a microkernel-based environment.\n-  Experience with cryptography for platform security and implementation of secure software stacks and runtimes.\n-  Cross-platform project development experience\n-  Knowledge of Swift, Objective-C, or C++", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549084"}