{"title": "SAP Material Management MM Project Manager", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Imagine what you could do here.  At Apple, great ideas quickly have a way of becoming great products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish here. Our SAP Global Systems Team, part of the Information Systems & Technology (IS&T) organization, builds key business and technical infrastructure at Apple serving our Business, Partners and Consumers. Our solutions power all Apple’s functions such as Finance, Sales, Retail, Services and Operations. We drive and implement the next gen technologies and tools from SaaS solutions, through iOS apps, through groundbreaking custom applications using Artificial Intelligence (ML, NLP), IoT, BlockChain. Our SAP team builds and implements groundbreaking supply chain solutions using SAP Hana platform and SAP ECC/Hana applications that have helped keep Apple #1 in customer support for several years in a row! We are seeking a high-energy and dedicated SAP Project Lead who will play a central role in the design and development of supply chain execution solutions!  We now have an immediate opening for an SAP MM Functional Analyst and Project Manager who has the right mix of SAP techno-functional skills to successfully deliver complex projects in Apple's fast-paced environment.", "description": "As a SAP Lead you will be responsible to design, develop and implement SAP AppleCare supply chain projects at Apple. In this role, you will work with AppleCare business partners to:  - Define scope and gather business requirements.  - Formulate project roadmap and project plans, helping run the project teams to complete on time and within budget.  - Apply industry knowledge experience and standard methodologies to business processes globally in areas involving supply chain including procurement, repair and warehouse operations, forward and service repair logistics as well as reverse logistics;  - Apply SAP ECC/S4 Hana LE/MM/ME/EWM and SAP BTP to implement the end-to-end solution.", "key_qualifications": "7+ years of strong functional and configuration experience in SAP MM, EWM, ME and LE functional and project lead role; 2-4 years of S4/Hana implementation and working passion for SAP Cloud products; Expert knowledge in SAP S4/HANA and full lifecycle ERP Implementation experience; Experience in Web UI, Fiori / UI5, ALE /IDOCs, RFC and API Interfaces; Strong and outstanding written and verbal communication skills, including presentation skills to all levels of an organization; Ability to handle tasks with varying priorities and leading multiple, sophisticated projects with internal multi-functional team and external partners across several groups", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science, Management Information Systems or related field.", "additional_requirements": "DESIRED EXPERIENCE: - Prior experience with business processes global logistic, reverse logistic, service, repair logistics and procure-to-pay would be helpful.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509234"}