{"title": "Firmware Lab Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive with pushing the limits of what’s considered feasible? We are looking for a creative, practical, and collaborative person with the right abilities and experience to handle day-to-day activities in wireless test labs. As a Firmware Lab Engineer, you will be the center of the embedded firmware effort!", "description": "-  Assisting firmware verification engineers and multi-functional teams in lab setup and planning based on given space, power, and cooling capabilities.\n-  Set up, handle, and maintain test hardware including debugging setup-related issues.\n-  Working with IT to configure and debug network-related topics such as connectivity, through-put, firewalls, IP management, etc.\n-  Lead and maintain a sufficient inventory of key equipment including cables, connectors, and adapters.\n-  Monitor and report utilization of all test systems to ensure accurate allocation of capital resources.", "key_qualifications": "3+ years of hands-on experience in wireless verification including setting up and driving wireless hardware testing in an automated environment.\nExperience using shield boxes, attenuators, Buttler matrix, network analyzers, and other miscellaneous RF equipment/accessories like cables, splitters\nGood understanding of wireless technologies like WIFI/BT or any other.\nExperience with solving computer and network-related issues.\nAbility to read and understand electrical engineering drawings, including schematics, layouts, and other technical documents.\nStrong level of expertise with either Excel or Numbers.\nStrong interpersonal skills.\nUsing basic hand tools, a multimeter, and other electronic tools.\nFamiliar with MacOS and iOS.\nFamiliar with key networking concepts and configurations.\nExperience with Python scripting is a plus!", "preferred_qualifications": "", "education_experience": "Minimum BS in Electrical Engineering or Computer Science and 3+ years of equivalent technical experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200520574"}