{"title": "Finance Internship", "summary": "The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Now hiring a bright and motivated individual for a key role in financial support within Apple Japan.", "description": "*We will be looking for interns to support either the Demand Forecasting & Analysis team or routes-to-market (RTM) teams. Teams will be determined according to your skills and interview feedback.\n\n1. As a Japan/Korea Demand Forecasting & Analysis team intern, you will play a role in driving business growth by analyzing financial performance and providing insights. \n\nDuring the internship period, you will:\n- Analyze financial performance by highlighting trends and anomalies; partner with cross functional groups to run in-depth analysis and identify growth opportunities\n- Support business operations such as performance reporting, partner payments and provide recommendations to streamline or improve the operational process\n- Conduct special project related to initiatives such as new and advanced analytical techniques to improve demand forecast accuracy and efficiency  \n\n2. As a routes-to-market (RTM) team intern, you will play role in driving Apple Japan’s business growth by analyzing financial performance and providing insights.\n\nDuring the internship period, you will:\n- Analyze financial performance by highlighting trends and anomalies; partner with cross functional groups to run in-depth analysis and identify growth opportunities across multiple product lines.\n- Support business operations such as performance reporting, partner payments and provide recommendations to streamline or improve the operational process\n- Conduct special project related to growth initiatives such as offers and pricing, sales programs, competitor analysis, or partner investments\n\n\nFor both teams there will be key interaction with:\n- Japan/Korea Sales Finance team\n- Sales Managers and their respective sales teams\n- Sales Operations team\n- Worldwide Sales Finance in Cupertino\n- Global Business Solutions in Singapore", "key_qualifications": "Undergraduate student in Junior/Senior years, or Graduate student who is willing to participate in the Internship program for 6 months to 1 year (available for part-time)*Must be enrolled during time of internship\nAbility to think analytically with attention to details\nStrong team player and self starter with positive, dedicated and open attitude\nExcellent verbal and written communication skills in English, business level Japanese\nFlexibility and comfort working in a constantly evolving environment.", "preferred_qualifications": "", "education_experience": "Undergraduate student in Junior/Senior years, or Graduate student *Must be enrolled at time of internship", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512819"}