{"title": "SAP Test Management PM, WW Ops BPR", "summary": "Our team is looking for a Test Management PM to join our Business Process Re-engineering (BPR) group to support planning, scheduling, coordinating, and executing tests for projects in WW SOS Operations organization.", "description": "Drive successful release of system enhancements / new functionalities from Development to Production through effective testing. Primary focus is projects related to S/4 Hana supply chain transformation...", "key_qualifications": "Minimum 7 years  in lead position during SAP implementations in the areas of Logistics execution, supply chain and order to cash processes. S4HANA experience is very desirable. Minimum 7 years for managing and executing system integration testing or user acceptance testing for complex, highly integrated projects...", "preferred_qualifications": "", "education_experience": "Bachelors degree required: 7-10 years experience in managing large global technical projects Bachelor’s degree or equivalent PMI/PMP certification preferred Certified Scrum Master preferred Preferred certifications in SAP ECC and S/4 Hana. Preferred certifications in Worksoft or other test automation tools.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526264"}