{"title": "iPad Product Design Engineer", "summary": "Imaging what you could do here. At Apple, creative ideas have a way of becoming wonderful products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. iPad Product Design Team works in a dynamic startup-like environment with all of the tools, resources, and support of the world’s most innovative company. We are a close-knit group of engineers who work with a singular focus…to surprise and delight our customers with truly great products. At Apple, you will work alongside the most talented engineers & technology experts at the top of their fields. We have a firm dedication to fairness and diversity, recognizing that each employee contributes a wealth of perspectives to our culture; we seek to tap into this extraordinary resource and incorporate it into how we do business. Come join us and be empowered to generate the best and most impactful work of your life.", "description": "In this highly visible role, you will utilize your mechanical design engineering skills to bring products to the market. This includes the following:\n\nNegotiating and collaborating cross functionally with various departments, such as Industrial Design, Product Integrity, EE, Manufacturing, SW, and technology groups to refine and execute the vision for the product\n\nDeveloping deep technical knowledge in areas outside your realm of expertise to understand other teams’ design constraints and craft creative solutions to technical problems\n\nCollaborating with outside vendors and internal manufacturing experts to optimize designs for function, aesthetic, and manufacturability\n\n Utilizing 2D and 3D CAD to communicate design intent and inspection requirements\n\n Insuring fit, form, and function throughout the life of the product through stress and tolerance analysis, DFMEA, prototyping, testing, and failure analysis", "key_qualifications": "High degree of motivation, curiosity, passion, creativity\nProficient in English communication skills\nEngineering fundamentals: statics, strength of materials, material science, statistics\nComputer aided design (CAD) skills: 3D CAD experience required (NX preferred)\nDesign intelligence: mechanical intuition, creative problem solving, spatial reasoning, diligence in finding the best solution for each design challenge, attention to detail\nBasic design skills: tolerances analysis, design for assembly (DFA), design for manufacturing (DFM), simple fixture design, understanding of Statistical Process Controls (SPC), understanding of metrology (basic knowledge of measurement systems)\nInterested in traveling up to 25% throughout a year", "preferred_qualifications": "", "education_experience": "BS in mechanical engineering related fields (MS preferred)", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200502313"}