{"title": "Engineering Project Manager, Ai & Data Platforms", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nThe Global Business Intelligence (GBI) org manages Apple’s enterprise data warehouse with petabytes of data, processes billions of rows of data to provide insights and enable informed business decisions. The GBI team provides data analytics, ML and data science solutions to various Apple business groups. We leverage diverse technology stacks such as Snowflake, HANA, SingleStore, along with multiple processing and analytics tools and technologies. Designing, innovating and delivering solutions with these big data technologies is a core part of our daily job!\n\nWe are looking for an experienced Engineering Project Manager (EPM) to drive delivery of projects. Are you a project manager that thrives on working on new technologies and fast-paced application and product development? Do you like to lead a multidisciplinary team working on the future of enterprise data analytics? Then we want to hear from you!", "description": "In this role, you will drive project management - including large, cross-functional ones - to deliver for important business initiatives. This requires leading all aspects of SDLC (software development life cycle) efforts: you will define, schedule, prioritize, track, measure and communicate status. You will lead efforts across teams representing multiple layers of the technology stack as well as other cross-functional partners and business groups. Facilitating requirements brainstorming and design review sessions with internal and external partners, while understanding functionalities and features implemented are essential. Identifying and mitigating risks, removing road blocks and facilitating communication between teams are critical aspects to the role. \n\nAdditionally, you’ll assist in other EPM responsibilities including but not limited to maintaining roadmap, providing oversight on resource capacity and funding at portfolio level, rolling out project framework and governance, etc. We value your ability to lead and develop new processes and ideas when it makes sense to re-evaluate, which at Apple is always!", "key_qualifications": "3+ years of hands-on engineering project management experience in Business Intelligence/Data Engineering/Analytics areas\nExperience in various project methodologies and processes, including Waterfall, Change Management and Agile/Scrum\nAptitude to understand new technologies and dive into details\nSelf-motivated, collaborative, curious, proactive with demonstrated critical thinking capability\nGood listening/comprehension, verbal and written communication skills, ability to distill and present information for the right audience\nExceptional attention to detail and organization\nDemonstrate resilience and adaptability, in the midst of ambiguity and uncertainty, to promote transparency and inclusion, and ultimately drive business impacting change", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent work experience preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548826"}