{"title": "Apple Music Marketing Manager, Japan", "summary": "Imagine what you could do here? At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. If you bring passion and dedication to your job and customers all over in Japan, there's no telling what you could accomplish! We're looking for a dynamic and experienced Marketing Manager who can manage 360 marketing (Strategic Planning, Project Management, Execution, Marketing Partnerships/Collaboration internally and externally) and strongly contribute to the business growth and customer engagements. We seek a marketing professional with music, entertainment, service platform, tech or consumer subscription background to join our Marketing team in Japan to lead Marketing for Apple Music!", "description": "As the Apple Music Marketing Manager, you will be responsible for leading the strategy, development and execution of high-impact consumer marketing campaigns and project basis campaign. You will collaborate with international and global marketing teams on design and deliver marketing initiatives. You will work with business management, editors, production, international marketing team to build Japan local campaign plans and executions. You will lead and work with agency to own paid marketing campaigns. You will build innovative and compelling executions that break into culture and earn attention. Your success will be measured by the ability and result of acquisition, conversion, and engagement through marketing campaigns across Apple owned and paid media platforms.", "key_qualifications": "Accomplished in leading strategy planning as well as quality execution that meets the objective of the initiative. Define and develop scope of the projects, manage both acquisition and engagement marketing. Experienced in leading large scale marketing campaigns across owned, non-paid, and paid channels including partnership marketing. Strong marketing analytical skills with consumer insights, business acumen, social trends, with broad and deep understanding of Japanese market and customers. Deep knowledge on digital performance marketing, digital awareness marketing, social strategies, with ability to lead campaigns from concept to execution. Can initiate unconventional ideas under non-budget marketing. Project management skills to track multiple projects simultaneously. Ability to work towards tight deadlines, with proven experience in complex, large-scale, timing-critical projects. Self Starter, Drive projects, Creativity, and Effective Marketer with hands-on attitude and excellent attention to the details. Smooth and respectful communicator with excellent communication skills in both English and Japanese (written and verbal), able to deliver compelling presentations and the ability to build strong ties both internally and externally.", "preferred_qualifications": "", "education_experience": "Candidates from all education backgrounds are encouraged to apply.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551350"}