{"title": "Test Automation Engineer, Business Process Re-engineering - Bangalore", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Our team is looking for a Test automation Engineer to join our Business Process Re-engineering (BPR) group to support Test Automation Strategizing, planning, creating, scheduling and executing tests for projects in WW SOS Operations organization. As a Test Automation Engineer, you will be tasked with working along side project PMs, Business SME’s and development teams to fanatically ensure highest quality test automation for our business and stakeholders while reducing manual test efforts.", "description": "We are looking for a self-motivated, driven individual who is comfortable working in a global, matrix’ed, fast-paced environment, can multi-task and has experience with agile method of working. We look forward to your ability to analyze and synthesize business requirements across multiple regions and ensure full coverage of test scenario automation. You will be responsible for designing, developing & implementing test automation frameworks for large integrated systems cutting across multiple tech stacks. Drive the QA vision for Test Automation for key platforms and applications Communication and co-ordination with globally distributed teams Work closely with internal organizations, project teams and Stakeholders to develop schedules, execute on plans and deliver high quality products Enhance Quality Assurance processes, environments, tools and frameworks Act as a strong advocate for quality in the product development process for software engineering Champion Apple’s dedication to providing extraordinary user experience and drives the team to work towards this shared goal. Uphold Apple’s ethical and moral standards while working with internal and external partners. - Form the team on the foundation of excellence, professional growth, inclusivity and respect.", "key_qualifications": "8-14 years hands on test automation experience, Solid understanding of QA principals, models, types of testing etc and have an engineering mindset to solve the complex QA problems, Experience in architecting approaches and solutions, frameworks and plugin for QA in the DevOps pipeline, Proficient working with one or more programming languages such as Java, Python or Javascript, Proficient working with frameworks like Selenium, TestNG, WebDriverIO, Robot, Rest-Assured, Cucumber, Proficient working with build tools like Maven or Gradle, Proficient working with Docker and Kubernetes, Should have interest in applying machine learning in QA and build models to do predictive analytics, Have sound experience implementing code coverage and code quality tools, Experienced in developing test strategies, refactor, write modular code and build infrastructure, Should be tool & tech agnostic and should be able to write code in different languages, Should have worked on implementing strategy to perform automation of end to end business process involving various systems written in different tech, Continuously improve testing best practices and methods., Influence teams to make right decisions on Go/No go exit criteria based on Test cycle performance and risk mitigation, Preferred certifications test automation tools and frameworks", "preferred_qualifications": "", "education_experience": "BE / BTech in Computer Science or information management from a premier school", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200506968"}