{"title": "Senior Computer Vision and Machine Learning Engineer - Apple Vision Pro", "summary": "Posted: 8 Feb 2024\nRole Number: 200526813", "description": "You’ll be working in a team of computer vision and machine learning researchers and engineers to prototype and ship world class algorithms that pushes the state of the art. Your job responsibilities will include:\n-Inventing and implementing state of the art computer vision and computational photography algorithms to solve cutting edge problems\n-Designing such algorithms to work reliably and efficiently on mobile devices\n-Collaborating with other teams in software and hardware to ensure the full pipeline runs efficiently and utilizes Apple hardware effectively\n-Cooperating with your team members to prepare presentations, papers, and talks to explain your inventions", "key_qualifications": "5+ years of industry experience in CVML or similar fields\nTrack record of successfully building and shipping products\nStrong experience in mobile machine learning and pipelining\nStrong experience in computational photography or computer vision\nExcellent coding skills\nExcellent communication and collaboration skills\nExcellent problem solving and analytical thinking skills\nCreativity and curiosity for solving highly complex problems\nExperience in C, Objective C, and Swift is preferable\nExperience in 3D graphics, lighting, and rendering is a plus\nExperience with human factors, especially eye tracking and human input interaction, is a plus\nExperience in multi-modal sensor fusion is a plus\nUnderstanding of camera hardware and camera optics is a plus", "preferred_qualifications": "", "education_experience": "MS or PhD in computer vision, machine learning, computer science, computer engineering or relevant industry experience with a track record of successful projects", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526813"}