{"title": "Assistant Development Manager", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and forward- thinking group that manages and provides services to Apple’s Retail stores and workplaces. We develop and manage Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world!", "description": "The Assistant Development manager is responsible for the execution of refreshes, MEP replacement projects, programs, etc. from concept to close out. They also assist Development Managers with NSOs and complex retrofit projects. • Ensure that projects are set up accurately and with best practice processes and systems to ensure the teams can operate efficiently and effectively using the business workflow process and Apple Standards of quality and design. • Directly manage project’s schedule, budget, quality, safety, and facilities turnover. • Drive functional and operational excellence of all projects and programs by providing consistent and prescript feedback to all cross functional teams including real estate, design, innovation, standards, merchandising, direct sourcing, security, IS&T, etc. • Assist with the creation off project Proforma, budget and schedule at relevant and key stages within the workflow process (Gate1, Gate2, Schematic Design Review, GC Contract signing). • Management of commissioning agents and design consultants. • Management of the closeout process, warranty, construction defects and design errors and omissions, as well as turnover of the project or program to the facilities team. • Review of all proposals, and change order requests from the consultants, general contractors, suppliers and subcontracts. Prepare and present comparative analysis.", "key_qualifications": "", "preferred_qualifications": "Proven ability to collaborate with internal and external stakeholders to meet deadlines as required to meet project schedule. Ability to balance the trade-offs between operational risk and investment, constantly seeking the highest quality and design at the best value. Experience building and maintaining relationships with facility operation teams architectural & design firms, and general contracting firms. Industry experience in the technology, consumer retail space. Education background in Mechanical, Electrical, Industrial, or Construction Management preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525114"}