{"title": "Test Automation Lab Manager", "summary": "Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "We are looking for a talented individual who will manage device labs equipped with current and next-generation Apple hardware, continuously running automated testing for the cutting-edge features in development for our Creativity applications. Successful candidate will have opportunity to develop critically important infrastructure and services that directly impact the quality of our products.", "key_qualifications": "Strong working knowledge of macOS and iOS hardware and software. Experience testing applications and triaging issues on iOS and macOS. Experience managing test automation across numerous physical hardware devices. Strong software and hardware debugging skills. Proficient in Python, Golang or similar languages. Experience with Xcode/XCTest and Swift. Experience working on Unix/Linux based platforms. Computer Science fundamentals (object-oriented design, data structures, algorithm design, and complexity analysis). Strong analytical and problem solving skills. Excellent written and oral communication skills and ability to work with large development teams. Experience working collaboratively to define, develop, and deploy test automation across multiple applications. Bachelor’s degree in Computer Engineering or similar", "preferred_qualifications": "Experience scaling macOS and/or iOS lab infrastructure. Understanding of performance testing methodologies and strategies. Experience with software development processes such as building, unit testing, code analysis, release process, and code coverage. Experience with Apple's Video applications (FCP, Motion, Compressor, iMovie). Experience with OS virtualization - experience working with hardware cluster focused on scaling virtualized OS deployment. Experience with CI/CD process and adjacent tools e.g. Jenkins. Experience with DevOps tech stack/tools such as Ansible, Docker, Kubernetes. Experience with infra monitoring", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554942"}