{"title": "Sales - Commercial (Enterprise & Education) Account Manager (Indonesia)", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple’s Sales Organization generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. A unique opportunity exists for an extraordinary individual to contribute to the account management for Apple partners in Indonesia. Through a deep understanding of the country’s channel, product and customer landscapes, the Commercial (Enterprise & Education) Account Manager will lead the development of enterprise and education channels in Indonesia and implement initiatives to improve capabilities and performance of assigned distributor partners.", "description": "In this role, you will be expected to:\n\n-  Be the subject matter expert of Indonesian customers, especially in enterprise and education\n-  Analyze and identify issues and opportunities to develop locally relevant solutions\n-  Deliver weekly, quarterly and yearly business plans\n-  Lead and execute local business development projects, including enterprise and education channel programs\n-  Develop close working relationships with relevant extended Apple team and collaborate with them to deliver for Apple’s customers and partners\n-  Develop close working relationships with the senior representatives of assigned partners and inspire them to collaborate\n-  Ensure that assigned partners align with Apple’s guidelines and policies\n-  Hold regular performance and planning reviews with assigned partners", "key_qualifications": "8+ years of proven commercial/B2B strategy, marketing and or sales experience in Indonesia, preferably in mid to senior management capacity with background from IT Software/Services/Hardware\nSuccessful experience in managing complex business partnerships environment and building tailor made solutions\nDemonstrated outstanding communication, relationship building, influencing, preferably in both English and Bahasa Indonesia\nProven ability to work through ambiguity with integrity", "preferred_qualifications": "", "education_experience": "Bachelor’s degree, preferably with Master’s degree or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526362"}