{"title": "Analog Mixed-Signal Lab Systems Manager", "summary": "In this role, you will actively work within Analog-Mixed/Signal design team and participate in bring-up of embedded circuits; collaborating with many fields to enable the world’s premiere products. You will closely work with a dedicated group of engineers working diligently to deliver hard IPs to Apple’s products while exceeding the highest expectations of quality, innovation and efficiency. We are searching for an innovative and expert individual to tackle the role of Analog Mixed-Signal (AMS) Lab System Manager in Cupertino, CA. This meaningful position involves leading our HW and SW infrastructure team, supervising the development and maintenance of lab hardware, lab network, software tools, and interfaces. This manager will work closely with validation teams to improve efficiency, enhance automation, standardize test flows, and improve data pipeline and analytics across AMS labs. This is an opportunity to work in a dynamic environment with endless learning opportunities at Apple. As a member of our team, you will have the rare and exciting opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day. This role involves working closely with different multi-functional teams within Apple as well as vendors. Occasional travels maybe needed.", "description": "Be responsible for the design and deployment of hardware test systems, including automation and network hardware. Lead the development and management of software environments and interfaces that support the validation. Implement best practices for tool integration, version control, continuous integration, and perform QA on hardware platform. Develop and maintain data pipeline and database for both post silicon and pre-silicon data. Build and maintain visualization tools tailored to nee ds of IP validation team, and implement iterative features for effective data exploration and analysis Launch data analytics framework and identify key performance indicators by collaborating with various design and validation teams. Follow security measures to safeguard sensitive data and ensure compliance Identify opportunities for modularization and standardization to improve the validation pipeline. Collaborate with cross-functional teams to develop and implement software interfaces to seamlessly transition pre-silicon verification flows to post silicon. Champion collaborative and innovative work culture within the team as well as when working with cross-functional teams.", "key_qualifications": "THE IDEAL CANDIDATE SHOULD HAVE FOLLOWING QUALIFICATIONS: 8+ years of experience in managing and developing lab hardware and software systems to support the validation of AMS or SOC IPs. Strong programming and scripting skills (e.g., Python, TCL, Java etc.) for automation, tool integration, and visualization. Knowledge of continuous integration, version control, and software development best practices. Solid understanding of data structure and algorithm for efficient data processing Experience with relevant visualization library and tools (Matplotlib, Tableau, etc) Expertise in initiating and implementing data analytics processes Knowledge of semiconductor technologies, IC design architectures and principals, as well as familiarity with industry EDA tools and simulation setups. Understanding of machine learning techniques and their application to data analytics for silicon validation is a plus. Strong leadership, effective communication, and collaboration skills. Excellent problem solving and analytical skills. Meticulous organizational skills.", "preferred_qualifications": "", "education_experience": "BSEE/MSEE/PHD with 8+ years of proven experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543280"}