{"title": "Worldwide Reseller Operations Planner", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! The Worldwide Reseller Operations (WW RO) team is the global route-to-market leader for National Retail, Apple Premium Reseller, Telco, Distribution, Enterprise & Education channels. We are responsible for influencing global allocation & New Product Introduction (NPI) strategy by representing the voice of our Resellers in Operations. WW RO also owns the development of global tools and processes needed to ensure our products are in the right places at the right time, supporting sales & our partners globally to achieve Apple’s financial goals. WW RO is looking for an experienced and dynamic team member to influence key partners and drive efficient Reseller strategies. This individual will develop a deep understanding of the Reseller landscape to promote positive relationships with partners - from driving the right actions to improve NPI & sustaining business, to devising a program portfolio strategy that scales with the business and the needs of our partners.", "description": "Develop a deep understanding of how Apple manages partner relationships and the nuances that exist across markets and partners. Leverage data, anecdotal feedback, and strategic context to build a comprehensive story of channel health and partner behavior. Provide timely updates cross-functionally and across levels on Reseller critical metrics, clearly articulating business status, risks, and key actions. Proactively discern opportunities to optimize the Reseller business and drive partner groups to appropriate action. Influence decisions through collaboration, leadership and a customer-focused approach. Partner with a variety of cross-functional teams including Region RO, Supply Demand Management, Readiness, Business Process Re-engineering, Sales & Finance, Marketing. Identify and develop new tools and processes that enable more accurate and efficient ways to assess Reseller channel health, partner behavior, and NPI readiness. Manage global projects to meet business initiatives. Define adoption and engagement strategy, and track success important metrics, critical milestones, and opportunities for scale. Deliver results under tight and visible timelines, driving through ambiguity.", "key_qualifications": "Excellent analytical and problem solving capabilities; Ability to connect details with broader business context to identify requisite actions; Ability to build positive relationships globally and cross-functionally, and to exercise tactful influence in a matrix organization; Clear and concise communicator with ability to synthesize information and adapt messaging to various audiences across functions and levels; Experience in breaking down ambiguous and complex problems and stitching through cross-functional teams to drive solutions; Proficient at coordinating global projects and initiatives independently, partnering with team members to define and manage business process and technology roadmaps in support of long-term strategies", "preferred_qualifications": "", "education_experience": "Bachelors degree, or 7 years of work experience in related field MBA with a focus in supply chain or finance a plus Project management experience a plus Inventory Management or Merchandising experience a plus", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $111,400 and $167,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547302"}