{"title": "Fitness+ Experiences - Social Media Marketing Manager", "summary": "Imagine what you could do at Apple. Join the Apple Fitness+ team and create experiences that bring about impactful change on a global scale, helping our users live a better day and a healthier life. The Fitness Technologies team is seeking a tenured Social Media Manager with a consistent track record driving highly effective and comprehensive social media efforts, developing and leading strategic frameworks and guidelines for Apple Fitness+ and Fitness+ trainer handles, and driving process and execution with cross-functional partners, with a focus on results and growth.", "description": "The Social Media Marketing Manager is accomplished at leading and driving social media efforts across a dynamic organization and has a rich background in social media efforts — from crafting a social media plan and producing projects to managing the personalities behind the handles. The ideal candidate operates with a sense of urgency, keeping with the pace of social media and our fast-paced, deadline-oriented production environment. The ideal candidate is a creative problem-solver, is innovative yet pragmatic, can build work from the ground up, can navigate through ambiguous situations, communicates clearly, and manages vision and purpose throughout editorial changes. The ideal candidate will forge positive relationships, working cross-functionally with teams within Fitness+ and across Apple including Production, Post-Production, Trainers, Product Marketing, PR, Marcom, Business Affairs, Legal and more. The role will also liaise with external partners, including business partners and creative agencies. Success is defined as owning the social media content strategy, both for Fitness+ and the Fitness+ trainers, and influencing the development of our social media approach end-to-end as well as managing the execution of highly engaging and informative content that grows customer awareness and engagement. The role is responsible for ensuring that the latest social media trends and interests are reflected in the strategy for Fitness+, and monitoring and analyzing performance of all social content and campaigns to measure impact and recommend new strategies to increase effectiveness.", "key_qualifications": "10+ years of demonstrated ability leading and driving successful cross-functional projects with multiple collaborators, Strong subject matter expertise in social media and associated metrics and analytics, Deep understanding of social media, what works and what doesn’t, and how it fits into a larger editorial and business plan focused on engagement and acquisition, A successful track record of crafting impactful social media campaigns, Ability to partner with cross-functional teams to build results-driven social media campaigns, The ultimate teammate — relates well to all types of people and possess the ability to manage up executives, across to peers, and through others outside of Fitness+; builds constructive and effective relationships; uses diplomacy and tact; and diffuses high-tension situations comfortably, Stellar project management, collaboration, presentation, and communication skills, Strong organizational skills with an ability to structure, streamline, and delegate various work streams while maintaining attention to detail, Ability to communicate effectively and distill complex information — excels at establishing clear direction, lays out work in a well-planned and organized manner, and maintains two-way dialogue with others on work and results, Strong sense of initiative, follow-through, and acute attention to detail, Passionate about fitness, sports, wellness, staying active, culture, and social media", "preferred_qualifications": "A bachelor's degree is preferred. Experience managing direct reports is preferred. Experience with social media success metrics and analytics — analyzing and synthesizing the information for recommendations and improvements, In-depth knowledge of various social media platforms, standard methodologies, and analytics tools, Ability to stay up-to-date with the latest trends and technologies in social media space, Ability to handle the nuance between Apple marketing standards and the authentic content expected for digital fitness and trainers’ social media, Comfort with ambiguity and passion to explore and develop innovative ideas across all directives, including editorial, marketing, business, and resourcing, Ability to build systems and processes that are scalable across teams and within different organizations to improve efficiencies, Ability to be accountable for results without direct control — orchestrating across teams, yours and others, to build and lead sophisticated social media efforts that align with editorial and business strategies and influence all levels of leadership, Passion for establishing team culture and weaving in inclusion and diversity standard processes in your day-to-day work, Loves connecting the dots and finding opportunities to integrate and amplify initiatives, Background working in a production studio environment, on fitness products, or on collaborating with talent is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $191,300 and $287,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556563"}