{"title": "AIML - Sr. Software Development Engineer in Test, ML Systems Evaluation Engineering", "summary": "Does the opportunity to play a part in building groundbreaking technology for large-scale systems, natural language and artificial intelligence excite you? Do you want to expand the experience of Siri and other AIML products to new products that will help millions get things done, across the globe? Join the ML Systems Evaluation Engineering (MLSEE) team at Apple and contribute to a highly accomplished team that evaluates AIML products, that will delight and inspire millions of people!\n\nWe are seeking an engineer to lead the quality of AIML products on new platforms and collaborate with the most innovative product development teams in the world. This team crafts and builds evaluation tools, automation frameworks and methodologies that enable product teams across Apple to develop machine-learning solutions that power amazingly intelligent user experiences. You will engage with innovative new-product teams around Apple, bringing your expertise and passion for innovation to solving technical problems for our next-generation products.", "description": "This role as a Software Development Engineer in Test will own the qualification of Siri and AIML future technologies and customer facing product features by developing automation and test methodologies. This role will be responsible for Quality Planning and Test creation, build automation to simulate and evaluate user experiences of Siri and ML-based products. In this role, your responsibilities include defining and leading all aspects of user impact and success metrics. Innovative solutions and strategies that allow the team to expand the coverage of the features we ultimately deliver to our customers are a must.", "key_qualifications": "", "preferred_qualifications": "5+ years of experience in software development, Test Automation with Java, Python, Swift or Objective-C\nExperienced in multiple design patterns.\nShown problem solving and debugging skills: analyze and investigate test failures, errors, and build issues, able to properly drive issues to completion and support issues with data.\nExtensive experience working and leveraging cross-functional partnerships\nUnderstanding of an ML-based product lifecycle\nExperience with CI/CD Technologies\nExpertise to investigate, debug and triage difficult problems both independently and collaboratively\nExperience with on-device development and testing", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556915"}