{"title": "RFIC Design Engineer", "summary": "The Wireless SoC Radio Team architects, designs and delivers state-of-art CMOS radios, from RF-to-bits. As an RFIC design engineer, you will be at the center of this wireless SoC design group.", "description": "As a RF IC design engineer, you will be a key member of an RFIC team, researching, designing and bringing the next-generation of wireless technologies into high-volume production in advanced CMOS technology nodes. Responsibilities include: - Design of analog, mixed-signal and/or RFIC blocks. - Overseeing the layout and verifying the design to ensure a successful tape-out. - Overseeing the test and characterization of the design, and debugging issues that may arise from early development stages through productization. - Working with the technology team to understand the capabilities and limits of the technology node to achieve the optimum performance.", "key_qualifications": "", "preferred_qualifications": "MSEE and PhD is preferred. RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, ADC/DAC, TIA or other baseband analog blocks in deep sub-micron CMOS technology. Deep understanding of analog design concepts. Familiarity with various RF transceiver architectures and their trade-offs. Familiarity with various CAD tools. Experience in Si characterization and debug.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600. Apple also offers benefits like comprehensive medical and dental coverage, retirement benefits, discounted products and free services, reimbursement for educational expenses, and more. Note: Apple benefits, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558251"}