{"title": "Test Operation Technician (m/f/d)", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power management ICs (PMIC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!", "description": "- Set up semiconductor test equipment (ATE), prober, and handling systems\n- Execute device tests including probing, handling and manual testing\n- Prepare and set up extended test configurations and temperature test set ups using oscilloscopes, logic analyzers, spectrum analyzers, thermostreamers etc. \n- Plan and execute regular maintenance on test equipment \n- Plan, inspect, and repair prober and handling systems in collaboration with test equipment vendors \n- Service as a service provider for Test and Product Engineering teams \n- Manage the material warehouse and oversee the shipment process for wafers, devices, and test equipment spare parts\n- Work closely with the hardware development team to align on test system-specific constraints\n- Perform incoming and outgoing inspections of test equipment and samples\n- Follow and implement work procedures to guarantee adherence to quality guidelines", "key_qualifications": "", "preferred_qualifications": "Basic understanding of electrical circuits and schematics.\nKnowledge of handling in ESD environments.\nCompetency in the manual handling of fine-pitch ICs.\nIn-depth knowledge of operating automated test equipment, preferably Teradyne UFlex.\nHands-on experience with the setup and handling of prober and handler systems.\nExperience in a semiconductor production test environment.\nStrong skills in operating computer-controlled production equipment.\nAbility and interest in working with microscopes.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553103"}