{"title": "Display Image Processing Algorithms Engineer - Platform Architecture", "summary": "Do you love working on state-of-the-art technologies? Are you forward-thinking, and love solving technological and architectural challenges? At Apple, our Platform Architecture team features a collaborative and hands-on environment that cultivates engineering perfection, creativity, and innovation! In this highly visible role, you will work with display and SoC architects, SoC design, and verification teams, display technology and software teams to support the development of SoC display architectures across various Apple products. Join this team and you will collaborate with engineers across Apple to develop algorithms and architectures that help build the seamless experiences we are known for worldwide. In this role, you will be developing state-of-the-art algorithms for image and video processing and will be collaborating with architecture, design and software to enable features and algorithms on our products.", "description": "As a Display Image Processing Algorithms Engineer being responsible for the design of algorithms, you will have responsibilities spanning various aspects of the design of related IP including: - Develop and evaluate best-in-class image and video processing algorithms - Setup and maintain lab equipment as well as image and video test suites to perform subjective and objective quality evaluations - Work with chip architecture, silicon design/verification, display engineering and software teams to map algorithms into well-defined architectures that may be implemented in software and/or hardware - Generate architecture test vectors for hardware/software validation - Develop tools that may be useful for image and video quality assessment", "key_qualifications": "BS and 3+ years of relevant experience. Electrical Engineering or Computer Science preferred. You should be a good problem solver and show willingness to learn new concepts and develop skills in hardware architecture and modeling. The ideal candidate is expected to be proficient in the following: Ability to abstract various image and video processing problems mathematically and develop new algorithms that are competitive with the state-of-the-art Ability to prototype algorithms in Matlab, Python, or C/C++ Knowledge of digital signal processing and its applications to image and video processing Effective interpersonal skills and ability to work across groups", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant experience. Electrical Engineering or Computer Science preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200521798"}