{"title": "Senior Software Engineer, Apple Online Store", "summary": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Apple Online Store is looking for a highly motivated senior software engineer to join the Apple Online Store Engineering team. You will deliver projects sought at improving the hugely successful Apple Online Store's e-commerce experience and features - www.apple.com/shop. We are looking for someone who has a proven track record in crafting and developing high quality enterprise software solutions. This position requires a hands-on person, who is passionate about understanding the details of a problem, can think about different solutions and can direct a team by example when the time to execute comes. You will work with a meaningful set of technologies and concepts such as Java, Scala, Microservices, AWS, Event Driven Architectures, Oracle, No-SQL DB etc. This is an exciting role, demanding a strong technology background and collaboration skills to be able to support software that meets high standards from a functional standpoint and demands operational excellence in both production and non-production environments.", "description": "We are looking for a self-starting, upbeat individual with excellent written and communication skills, who is a great teammate, but not afraid to question assumptions and take initiative. As part of the AOS Application Engineering team, your responsibilities include building high throughput, dedication, reliable, server-side web services and features, working closely with other application and service engineering teams, and interacting with product, design, content, QA and many other groups to lead and deliver extraordinary e-commerce experience from merchandising to checkout on all platforms (Web, MOW and Native iOS) in an exciting fast-paced environment. We're looking for a hardworking and hard-working person to join this amazing team, if you feel this is you, we'd love to hear from you. At Apple, code and functional quality is always at the forefront and one of the key measures of Success.", "key_qualifications": "7+ years of overall experience in Software engineering & development in a professional setting. Programming in Java, Scala, or any other object-oriented programming language with a deep understanding of object-oriented concepts. Expert knowledge of computer science, with an in-depth understanding of data structures, algorithms, and Service Oriented Architectures. Expert in developing multi-tier scalable, high-volume performing, multi-threaded and reliable web services. Excellent knowledge of web technologies such as HTTP, cookies, AJAX, etc. Good written and verbal communication skills. Experience with EKS, Containerization, Serverless Technologies, SNS/SQS, ElastiCache, S3, and Kubernetes is a plus. Experience in Spring or other DI frameworks is a plus. Experience integrating with SAP is a plus. Experience working with a large scale consumer-facing websites is a plus. Experience in SpringMVC, No-SQL DB like Cassandra, DynamoDB, Couchbase etc is desirable. Experience scaling distributed systems to handle millions of concurrent requests is desirable. Experience integrating with Content Management Systems is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor's/Master's degree in Computer Science or Electrical/Electronics Engineering. Minimum of 7+ years in Software development", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535949"}