{"title": "Cellular Systems Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking radio access networks. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop wireless technology for next generation radio access networks across different layers (PHY, MAC, CP, DP) We are looking for an industry seasoned expert and with a deep understanding of state of the art wireless technology. In this role you will lead a cutting-edge research group responsible for creating next generation disruptive radio access technologies over the next decade and a 3GPP standards team responsible for Physical Layer and RF RAN groups. You will work on defining system level concepts, proposing and researching innovative ideas & algorithms, performing complex system simulations, defining rapid prototyping platforms to help prove your ideas and specifying RAN protocols and for next generation (6G) cellular systems.", "description": "• Contribute to link-level and system simulator modeling and framework design.  \n• Take a top-down approach towards system design starting from a use case of relevance to Apple products, defining a problem statement and arriving at groundbreaking innovative solutions  \n• Assess the benefit of different proposals to solving a problem  \n• Define and provide necessary systems engineering support towards rapid prototyping platform development in the form of system requirements and system design documents", "key_qualifications": "Deep knowledge of communication system theory and wireless systems\nStrong knowledge of physical layer waveform design, channel coding and PHY/MAC procedures\nStrong knowledge of multi-antenna techniques and procedures such as Massive MIMO, mmWave Beamforming and Beam Acquisition, mmWave mesh networks\nStrong knowledge of current cellular or Wi-Fi communication standards: eg. 5G (NR), 4G (LTE), IEEE 802.11ax, IEEE 802.11ax/ay/az/be\nDemonstrate clarity of thought and strong analytical and problem-solving skills (probability, digital signal processing, linear algebra, random processes, detection and estimation,).\nProven track-record of innovation in the area of wireless system design\nExperience in object-oriented programming and wireless system simulator design and implementation\nStrong exposure to wireless system design and channel sounder design in very high frequencies (GHz, THz).\nFamiliarity with L2/L3 user plane and control plane protocol stacks\nFamiliarity with low power design for smartphones and wearables\nFamiliarity with wireless system optimization for augmented reality, virtual reality and automotive applications\nFamiliarity with positioning and ranging based services and solutions.\nFamiliarity with sensing technologies such as FMCW radar\nStrong foundation of machine learning concepts and ability to apply them towards solving problems in sensing and radio access networks\nExperience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.\nUnderstanding of mmWave antenna array design and RF system design of state-of-the-art mmWave transceivers is a huge plus\nAbility to work well both independently and within a team", "preferred_qualifications": "", "education_experience": "BS with 10+ years of relevant experiences.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547202"}