{"title": "Penetration Tester, Retail Engineering", "summary": "In a fast-evolving digital world, our team seeks a Security Penetration Tester to take on emerging cyber threats. With us, you'll play a pivotal role in safeguarding Apple's Online Store, Apple Store App, flagship Retail locations, and vital backend customer and payment systems. You'll get to dive into ground breaking technologies, collaborate with industry experts, and safeguard critical digital assets. Join us to turn your skills in code analysis, penetration testing, and security research into impactful results. If this sounds like a role for you, we would love to meet you!", "description": "As a penetration tester, you can expect to do the following:\n\n-  Conduct manual penetration testing against web applications, APIs, cloud environments, infrastructure, mobile applications and custom technologies.\n\n-  Communicate these findings in high-quality reports and presentations\n\n-  Provide security advice and partnership to engineering teams and non-technical partners\n\n-  Develop scripts and tooling to augment penetration testing activities or demonstrate proof of concepts\n\n-  Source code review of large sophisticated applications\n\n-  Become a domain expert for colleagues in an area of security and penetration testing, shape security requirements, technical documentation and testing methodology. Guide others and share expertise.", "key_qualifications": "", "preferred_qualifications": "OSCP or OSWE certification (preferred)\nExperience with CTFs or hacking labs\nProficiency in MacOS and other Unix based systems\nAbility to grasp large sophisticated systems and context-switch when needed\nProgramming/scripting skills (Python, JavaScript, Go, etc)\nKnowledge of cloud architecture and security\nPublications, security research, bug bounties or CVEs are highly regarded\nBachelor's in Computer Science or equivalent", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558385"}