{"title": "Senior Program Manager, WW Supply Chain", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! WW Supply Chain is looking for an experienced, Senior Program Manager to join their team in leading and driving global transformational initiatives that increase logistics scale, technical/engineering capabilities, value added services and reduce cost within Apple’s supply chain.", "description": "The ideal candidate will be able to demonstrate a deep understanding of multi-function operational processes within Logistics, Operations, Analytics, FATP, and Reverse Logistics. A strategic thinker who can ‘connect the dots’ of the bigger picture, as well as being comfortable in the details of the deliverables. Self-motivated, driven individual who is comfortable working in a global, fast-paced, often ambiguous environment with the ability of working with multiple cross functional teams. KEY RESPONSIBILITIES: Analyzing and evaluating current business trends and processes to identify opportunities to improve, develop a strategy, and then own and globally lead cross functional programs across logistics, engineering and data foundation program(s). Present comprehensive proposals to leadership based on investigations and analysis. A bias for action: a proven track record for delivering on key initiatives Ability to maintain and develop relationships within a project and team.", "key_qualifications": "Strong analytical, data, modeling and program management capabilities. Technical person with the ability to quickly understand business processes and drivers. Ability to lead and manage complex projects without a direct reporting structure across multiple logistics and engineering domains. A desire to operate hands on in the role and have excellent verbal, analytical, written, organizational and interpersonal skills. Comfort and ability to operate and drive efforts without solid line responsibly. Demonstrated ability to work autonomously. Strong work ethic with a high degree of flexibility. 6+ years professional experience in data, analysis, modeling and program management. Bachelor’s degree", "preferred_qualifications": "Direct logistics experience helpful but not a pre-requisite. Broad experience across supply chain, engineering and/or operations. EPM, Product Ops or Ops Finance experience a plus. Graduate degree", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $139,200 and $209,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553408"}