{"title": "Camera Process Engineer", "summary": "Do you love taking on big challenges that require exceptionally creative solutions? Do you deeply understand how an incredible camera experience should work? As part of our Camera Technologies group, you’ll help design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems, from sensor to lens. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras. An extraordinary opportunity to be part of our Camera Process/Packaging Engineering group, we are responsible to develop assembly processes, equipment and materials for cutting edge optical modules. Working closely in highly collaborated environment with different teams. New challenges arise every day that require the sharp problem-solving skills of individuals! The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk!", "description": "-  Work as the key camera process/packaging engineer supporting complex, high volume manufacturing process development -  Provide design guidelines for manufacturability -  Develop new assembly process/equipment/material for Camera module -  Participate in external vendor assessment and selection. -  Responsible for DOE planning, statistical process analysis, process specification, and D/PFMEA -  Work collaboratively with global based in-region process team. Work as process lead to address manufacturing related issues with x-function and provide communication to senior management team. -  Travel internationally to vendor site to support product manufacturing", "key_qualifications": "", "preferred_qualifications": "Knowledge of assembly manufacturing processes, high volume manufacturing, and production ramp experience Strong collaboration skill to work with diversified x-function team Demonstrated ability to perform DOE, data analysis, and process capability control Demonstrated failure mode analysis, root cause investigation, and problem solving for product yield and quality issue Experience working with subcontract manufacturing partners", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554826"}