{"title": "Screens Senior Art Director, Design Team", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.", "description": "Design, review, collaborate, and guide work to bring Apple’s key elements of design to life. Possess an eye for aesthetic and create a powerful story through the work. Contribute to the successful creation and production of screen content assets, following creative direction, product briefs, and driving long-term screen content strategies that move the Apple brand forward. Work as a senior member of the team towards excellent design in accordance with project constraints and parameters. Create persuasive presentations to executive staff members and partner closely and cross-functionally with Human Interface Design, Interactive, Brand and Production teams. Build content that reflects Apple's values, and that is culturally relevant.", "key_qualifications": "", "preferred_qualifications": "8-10+ years of design, art direction and motion graphics experience. You are naturally curious and have an awareness toward the evolving landscape of available tools, technologies, resources, and trends. You are well apt in traditional graphic design, branding, photography, CGI and art direction as it pertains to print, digital, and motion. Excellent design and conceptual skills accompanied by the ability to guide and evaluate, and if necessary, redirect creative development. Strong communicator who is able to articulate ideas in a clear manner, encourage healthy debate, and accept directional feedback. Exhibits sound organizational skills that promote collaboration and have in-depth knowledge of the creative development process. Knowledgeable about the latest Apple OS systems, Apple Software programs, and UI elements, along with the apps and other inspiration to keep content fresh. 3D Design Software is also preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556572"}