{"title": "Computer Vision ML Engineer", "summary": "Ever wanted to ship magical experiences in Apple products? Be part of the engineering team that uses computer vision and deep learning to produce the next generation of human interfaces! The ideal candidate is a highly skilled individual, who will flourish working on technically meaningful problems at the frontier of deep learning, with self-motivation, curiosity, and initiative to achieve ambitious goals. Your work will redefine the experience for billions of users.", "description": "For this role we are looking for someone to join our algorithm team. Your main focus will be developing innovative solutions by interpreting and adapting cutting edge state of the art algorithms. By joining our team, you will get the chance to work with senior, talented Apple engineers and researchers while collaborating with other product teams internally. To succeed in this role, you need to be a deep learning engineer who also possesses solid programming skills. You should have productized ML solutions in the past and can iterate on ML models to improve quality metrics. You should enjoy staying up to day and learning the new advances in the field. We highly value testing, clear and scalable software design, proper documentation, and collaborative experience.", "key_qualifications": "Demosntrated expertise in deep learning with publication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, CVPR) or a track record in applying deep learning techniques to products, in at least one of following topics: vision foundation models, model interpretability, representation learning, geometric computer vision, or generative models. Deep knowledge and experience with software, covering relevant programming languages (e.g., Python), frameworks (e.g., PyTorch or TensorFlow) and best practices. Outstanding interpersonal and communication skills. Bachelors degree and a minimum of 3 years relevant industry experience.", "preferred_qualifications": "We would appreciate additional experience with managing the delivery of complex solutions in embedded systems and/or human input interfaces.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557448"}