{"title": "Vulnerability Research Manager", "summary": "Apple engineers have always focused on one person when they build software — the person who will use it. Working in our Software Group (SWE) you’ll see why every Apple product and service feels intuitive and simple, and why every aspect of this group’s work is built around a respect for the customer’s needs. Apple's Security Engineering & Architecture team (SEAR) focus on security needs. Passionate about safeguarding, we believe the best defense is a good offense. When it comes to securing more than a billion devices running the world's most sophisticated operating systems, that means finding vulnerabilities first. Can you make a difference on this scale? Join our extraordinary team of security researchers and discover Apple products' vulnerabilities before they ship.", "description": "We are looking for a manager with experience in dealing with complex systems and bringing ideas to the level of products. Our team focuses on securing low-level technologies such as the iOS and OS X kernel, boot ROMs, firmware and hardware. Working alongside a wide variety of teams and vendors, your influence will be felt throughout Apple's extraordinary products, such as the iPhone, iPad, Mac and Apple TV. Tasked with identifying threats in advance as well as being directly involved in Apple's response to critical issues as they arise. This includes reverse engineering an exploit, providing insightful analysis, creating innovative tools, consulting with other teams on both hardware and software, auditing code and reviewing designs, the job is as diverse as it is essential. This position requires someone with strong technical strengths and a passionate desire to secure systems by showing how they can be broken. Knowledge designing embedded and µ-architecture systems with security in mind on macOS and iOS with some exposure to the kernel is helpful. If this is you, we'd love to hear from you.", "key_qualifications": "Demonstrated experience in implementation and architecture\nStrong security knowledge of advanced OS\nManagement experience\nStrong understanding of principles of building and deploying software, process, and monitoring (software lifecycle)\nDemonstrated creative, critical and independent thinking capabilities and troubleshooting skills\nEnthusiasm for new technologies and growth\nExperience with kernel and operating systems internals\nA genuine passion for creating effective and pragmatic security technologies", "preferred_qualifications": "", "education_experience": "Degree in Computer Science / Computer Electronics (or equivalent experience)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $208,300 and $360,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540303"}