{"title": "Innovative Instructional Designer - Code", "summary": "Apple WW Education is seeking an experienced coding instructional designer to join our Education Content team. This team is made up of creative and coding educators who develop and build curricula content and teacher resources for use in schools and institutions all around the world. The team’s curriculum content and teacher resources support Apple Teacher, Swift Playgrounds, Xcode, and Everyone Can Create. All our content is designed to build engaging teaching and learning experiences with iPad and Mac in K-12, higher education institutions, and direct to learners worldwide.", "description": "The ideal candidate should be passionate about developing impactful learning experiences and identifying new approaches to teaching code and building apps that are simple, elegant, and made better with Apple technology – all designed and delivered with an eye toward improving student engagement and outcomes. A strong background in building and delivering technology-based instructional materials, curricula, or professional learning programs for students and educators is required.\n\nOur team is made up of musicians, photographers, filmmakers, developers, and teachers, so the ideal candidate needs to bring a unique mix of coding expertise, inspiration, and education experience. This individual will work closely with product marketing, education marketing, operations, software engineering, and various sales teams to bring phenomenal content to learners and institutions around the world.", "key_qualifications": "7 or more years of experience in building professional learning and educational content\nProficient in Swift and Xcode", "preferred_qualifications": "Develop and design coding tutorials, articles, blog posts, and other educational resources\nCreate engaging coding exercises, projects, and problem sets for Swift and SwiftUI a varying levels\nProduce video content, including screencasts and instructional videos, to supplement written materials\nRepresent the work in a compelling way with experts and creators internally and in the field\nMonitor and analyze the effectiveness of content through user feedback, engagement metrics, and other performance indicators\nTranslate complex technical concepts into accessible content for a broad audience\nExcellent writing, editing, and proofreading skills with a keen eye for detail\nDesign experience preferred\nRobust knowledge of developer technologies to enhance learning and PL experience\nCurrent topics include XCode, SwiftUI, Swift, data modeling and spatial computing\nInterest and base level understanding of ML and spatial computing\nProficient in GitHub\nMaintain version control and update content regularly to reflect new developments and feedback\nWork closely with instructional designers to align content with learning objectives and pedagogical strategies\nCollaborate with marketing teams to promote content through various channels, including social media, online forums, email campaigns, and websites\nEngage with the coding community to understand their needs, gather feedback, and incorporate suggestions into content development\nExperience collaborating with cross-functional internal and external teams\nAble to manage multiple projects at once\nAbility to work with multiple teams to ensure success and meeting deadlines\nBachelor’s degree or equivalent in Computer Science, Information Technology, Technical Writing, Education, or a related field\nExperience in educational technology or e-learning preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,900 and $216,900, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553581"}