{"title": "AIML - Sr. ML Architect, Siri and Information Intelligence", "summary": "We're looking for a world-class engineer and architect with a talent for working across diverse teams to play a key leadership role in building out the future of Siri. As a key leader, you will advance and apply the latest ML techniques to Siri, drive collaboration across cross functional engineering teams throughout Apple, and bring together teams to deliver progress. The technical decisions you drive will bring category-defining capabilities to Siri, delighting users of Apple devices around the world every day.", "description": "This position will form part of the leadership team incubating and delivering the future of Siri in Apple. You will operate within a large, multi-functional ecosystem spanning partners in Siri, AIML technology and infrastructure teams, data, research, and software engineering, and also work with teams in hardware products and silicon. You will lead core areas of the product, partner with numerous directors and director-level engineers, report on progress directly to executives, and be given considerable latitude to determine where to focus your energy. You will balance between developing portions of the product yourself where there is high uncertainty or risk, and guiding teams of engineers where you have made the path more clear. You will become a mentor to large numbers of more junior engineers, and help set the standard for engineering practices.", "key_qualifications": "", "preferred_qualifications": "5+ years as tech lead or architect for a business-critical, user-facing product, 5+ years experience delivering ML capabilities into great products, Strong coding and software engineering skills in a mainstream programming language, such as Python, Java, C/C++., Ability to quickly prototype ideas / solutions, perform critical analysis, and use creative approaches for solving complex problems., Attention to detail and excellent communication skills., Demonstrated capability to deliver and bring clarity in fast-paced, ambiguous environments, Demonstrated ability to craft technical strategy for great products, Track record of working with Director-level peers daily, and developing positive relationships with executives in multiple business units, Proficiency with build systems for large, complex software projects, Solid understanding of ML fundamentals is essential", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557945"}