{"title": "AIML - ML Engineer (NLP/Speech), Siri and Information Intelligence", "summary": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, natural language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri Text-to-Speech (TTS) Engineer team at Apple. The AI/ML - Siri Text-to-Speech (TTS) team is looking for exceptional Machine Learning Engineers passionate about delivering delightful customer experiences with Siri voices. The opportunities include developing a cutting edge run-time system, pushing the envelope on machine learning based natural language processing in TTS and deploying AI/ML models to benefit millions of users.", "description": "You will be a part of a cross-functional team that has ambitious goals of enabling our customers to use Siri voices in several languages. You will be responsible for a wide variety of research and development activities in natural language processing, text-to-speech including rapid prototyping, optimizing inference on current and future Apple platforms and building large-scale, distributed systems. We are looking for ML engineers who can envision end-to-end solutions and collaborate with designers, ML researchers and system engineers to bring research ideas to production. To succeed in this role, you should be an excellent programmer and a creative problem solver, who enjoys learning new things, improving existing processes, and contributing to overall system design. You should also be a phenomenal teammate who thrives in a dynamic environment with rapidly changing priorities.", "key_qualifications": "4+ years industry experience\nStrong expertise in C++ and Python\nExperience in natural language processing/machine translation/text-to-speech\nExperience in deploying user-facing machine learning systems in production\nExperience in Machine Learning algorithms and hands-on experience with ML toolkits like TensorFlow or PyTorch is a plus\nOutstanding spoken and written communication skills\nHighly-motivated, creative, organized and a strong problem solver", "preferred_qualifications": "", "education_experience": "M.S. or PhD in natural language processing/machine learning/speech or Computer Science related field or equivalent work experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $204,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200524506"}