{"title": "Manufacturing Design Engineer (MDE) - iPhone", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Apple iPhone Manufacturing Design Engineer (MDE) is accountable for driving the development of key mechanical manufacturing processes across Apple’s worldwide supply base. In this highly visible, hands-on role as the expert technical member of the Manufacturing Design Team you will have direct frequent communication and collaboration with Apple Industrial Design, Product Design, Manufacturing Design partners and worldwide suppliers.", "description": "Apple MDE’s are extraordinary engineers that provide end to end manufacturing and process solutions for key design features. This includes manufacturing process development and capability (includes incorporating all aspects of equipment, consumables, key parameters, process setup, and qualification), selection and/or design of manufacturing equipment, automation, and strategic R&D.  • Define best-in-class processes to meet all Apple design and operational requirements  • Develop and document processes including all parameters, consumables and secondary operation requirements to meet defined specifications  • Work with Global Supply Managers to define and establish supply chain requirements utilizing selected equipment and manufacturing suppliers  • Provide leadership at manufacturing sites during development and product production ramp, and drive engineering issues to resolution  • Use data to drive process decisions, basic data analysis, DOEs, SPC, etc.  • Identify, research, develop, and qualify premier equipment manufacturers and suppliers  • Define part tolerance and specifications by demonstrating process capability to Product Designers and Industrial Designers  Lead process development/have expertise in one of the process development areas listed below:  • CNC machining - Develop all CNC milling and turning processes. Scope appropriate CNC equipment to be used, develop CNC fixtures, implement touch probing, lead the reduction of cycle time, development of advanced cutters and coatings, High Speed Machining implementation, support the programming and optimization of all CNC-related activities at contract manufacturers worldwide. Own yield improvement actions and process change decisions based on statistical process control (SPC) data analysis.  • Surface Finishing - Develop new processes in the area of blasting, tumbling, polishing, wet sanding, lapping, anodizing, and PVD. Ensure that quality and yield requirements are met.  • Glass Processing - Develop all processes for glass scribe/break, grinding, lapping, polishing, chemical strengthening, decoration and functional coatings (with inks, and other thin film deposition techniques etc). Ensure that quality and yield requirements are met.  • Assembly - Develop all assembly processes. Includes incorporating welding, gluing/adhesives, and mechanical fit based processes. Support qualification of equipment at suppliers, including detailed documentation of process parameters. Own yield improvement actions and process change decisions based on statistical process control (SPC) data analysis. Identify automation opportunities and justify automation projects based on automation line efficiency metrics.  • Painting - Develop all paint processes to achieve cosmetic and surface durability requirements. Scope and specify paint equipment, environmental clean room requirements, evaluate and select most appropriate paints and painting parameters to ensure quality and yield requirements are met.", "key_qualifications": "", "preferred_qualifications": "BS, MS or PhD in mechanical, manufacturing or industrial engineering preferred. Demonstrate hands-on mechanical ability. Demonstrate excellent written and verbal interpersonal skills. Experience with highly cosmetic parts a plus as is experience in a manufacturing environment of consumer electronics or consumer plastic / sheet metal products. Be a self-starter by defining all engineering tasks to meet project objectives and have the ability to quickly learn about new processes with very little information provided", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558028"}