{"title": "AIML - Senior Manager, ML Product Evaluation Engineering", "summary": "Would you like to play a part in shipping groundbreaking technology for large-scale systems, natural language, and artificial intelligence? Join the Siri ML Systems Evaluation Engineering (MLSEE) team at Apple! We interact with various engineering teams to identify issues and test requirements, drive the quality of Siri features, and create frameworks that support evaluation and qualification. You will work with the people who craft the intelligent assistant that helps millions of people get things done — just by asking!", "description": "We are seeking an expert senior engineering manager to lead Siri's intelligent services and platforms (iPhone, HomePod, CarPlay, Apple Watch, iPad, MacBook) evaluation and qualification. You will be responsible for partnerships with product engineering that will drive the test and evaluation strategy, frameworks, performance testing framework, and solutions that can scale. You will work alongside SW and ML engineering product teams as a critical partner. You will need to drive efficiency through the adoption of LLMs for testing and evaluation, including evaluators, auto-triage of issues, and auto-error-attribution.", "key_qualifications": " ", "preferred_qualifications": "Passion for product and customer experience, Strong experience leading a breadth of product areas simultaneously, Extensive experience delivering large-scale products or platforms, leveraging cross-functional partnerships to drive outcomes across multiple organizations, Excellent understanding of an ML-based product lifecycle, Demonstrated depth of knowledge and application of statistics-based evaluation methodologies or user success metrics, Strong experience with systems engineering; in-depth understanding of interdependencies of ML and SW components, Strong history of delivering innovation, Experience managing a team of expert engineers, Ability to develop a long-term vision and execute strategies at scale while maintaining a grasp of technical details for better decision-making, Experience with VP-level presentations and reporting", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $252,400 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556905"}