{"title": "SoC Power Model Engineer", "summary": "Do you want to utilize your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? Do you have a passion for crafting entirely new solutions? Do you love building without precedent?\n\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality. You and your team will apply engineering fundamentals and start from scratch if needed, bringing visionary ideas to the real world. Your efforts will be groundbreaking, often literally. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. \n\nWe have an extraordinary opportunity for Power Modeling Engineers.In this highly visible role, you will be responsible for SOC power simulation and power modeling, SOC use case power analysis, and drive the future SOC power optimization.", "description": "Imagine yourself at the center of our SOC design effort, collaborating with all disciplines, playing a strategic role of getting functional products to millions of customers quickly. You will have the opportunity to integrate and come-up with new ideas, as well as work with a team of talented engineers. \n\nThe main responsibility of this role is to drive the SOC power modeling and optimization for very power efficient products. \n•\tWorking with architects to determine the interesting use-cases to simulate; providing power projection for the future projects based on analysis.\n•\tCreating test cases within the design verification team’s environment. Working with design teams to determine the correct functionality or enhance functionality for power reduction.\n•\tDevelop IP power model on new architecture design, providing power data for performance/power/area tradeoffs. \n•\tWork cross functional teams, including architecture, RTL and physical design teams, on improving the power efficiency and power efficiency.\n•\tUnderstand interactions of the product at the software and system level that impact power.", "key_qualifications": "• Electrical Engineering background is preferred.\n• Familiarity with ASIC power analysis and optimization\n• Familiarity with Verilog and System Verilog.\n• Proficient with Python scripting*\n• Familiarity computer architecture, logic and circuits design\n• Familiarity signal processing is a plus.\n• Familiarity with SOC design flow and methodology is a plus.\n• Silicon power measurement experience is a plus.\n• Strong communication skills are a pre-requisite as the candidate will interface with cross-functional groups.", "preferred_qualifications": "", "education_experience": "Minimum requirement of a BS degree and a minimum of 3 years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200506374"}