{"title": "AIML - Sr Engineering Program Manager, Machine Learning FM", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nAre you passionate about overseeing evaluating ML models and validating AI applications? We are looking for an engineering program manager to lead the development of the next phase of our ML international locales expansion. The successful candidate will have a proven track record of conceptualizing and delivering technically complex platform projects. They will have a solid understanding of the mechanics of developing ML systems and what it takes to scale and ship them to billions of users worldwide. They will be managing and coordinating projects with vendors, annotation platform teams, legal, finance, and partner data scientists & engineers to create data assets which are used to power and evaluate ground breaking machine learned experiences.", "description": "Specific Responsibilities Include:\n-  Lead high profile Foundation Model programs, responsible for roadmapping, establishing goals with DRIs and reporting statuses to executives regularly and succinctly\n-  Drive consensus across multiple groups with varying opinions & needs. Influence entire teams around a common purpose and drive conference on the plan of execution\n-  Create and manage project schedules with clear dependencies, critical path and systematic methodology to communicate status\n-  Proactively identify and manage risks, close gaps with the ability to switch gears on projects in an agile manner\n-  Keep teams on critical path with efforts to minimize distractions\n-  Provide clear, timely and objective communication, including regular program status updates and one-off reviews as needed to executive team\n-  Keep an eye on any potential gaps across dependency teams and proactively promote regular communications on common source of truth\n-  Proactive and regular insurance of alignments across all stakeholder teams when new factors arise\n-  Plan yearly and quarterly budgets for data acquisition\n-  Maintain awareness of the Privacy and Legal aspects of data management and regional regulations, ensuring the team is meeting company-wide requirements", "key_qualifications": "N/A", "preferred_qualifications": "Prior PM or engineering experience in search, speech recognition, natural language understanding, data pipelines is a plus; Experience with international locales experience", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556765"}