{"title": "Health Sensing - Software Development Engineer in Test", "summary": "Be part of the engineering team crafting health features on Apple Watch. The Health Sensing team has a catalogue of health features we ship to customers every year. We’re looking for a Software Development Engineer in Test (SDET) who has strong experience with leading multi-functional testing effort, developing tests, and building up testing infrastructure in a fast paced team. If you are a highly motivated engineer with aspirations to build such automation, nurture learning, and lead these efforts across teams at Apple, we want to talk to you!", "description": "This position requires someone with a passion for Quality Engineering and DevOps in support of delivering high quality products to Apple Customers, as well as being a phenomenal partner with the Health Sensing Engineering teams. You possess the right set of skills to design and develop automation frameworks with a focus on scalability and reliability of the tests, while promoting coding best practices. As an automation expert, you will be defining requirements and providing solutions to automate the testing workflow with a strong sense of ownership. Participate in deep technical discussions with the engineering team, understand software workflows and use cases, and ensure testability of the system. The candidate should have strong experience in developing unit, integration, and end-to-end tests to validate system functionality and performance Implement continuous integration and deployment pipelines to streamline the testing process and identify ways to improve on the efficiency of the end-to-end workflow Design and recommend logging telemetry to improve failure triaging efficiency and gather quality metrics Participate and/or drive post mortem discussions to think strategically about how to prevent similar issues in the future", "key_qualifications": "3+ years of proven experience working as a Software Automation Engineer; Knowledge of software development and release lifecycle, including software updates; Experience diagnosing and debugging complex systems; Proficiency in scripting language such as Python and Shell; Solid background in testing methodologies (e.g. unit testing, integration testing, performance testing, functional testing, etc), tools, frameworks, and pipelines; Hands-on experience with CI/CD automation and deployment tools such as Jenkins, Docker, Kubernetes, and GitHub; Outstanding collaborative skills including networking, negotiating, documentation, and presentation skills; Experience identifying automation requirements and crafting solutions to address test execution challenges; Ability to think analytically and creatively, solve sophisticated problems, and innovate; Self-motivated, proactive, enthusiastic about user-focused design & high-quality products; Excellent written and verbal communication skills to facilitate close interaction with development teams, management, and other organizations with Apple", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "Experience with managing a device lab; Experience with Objective C, XCTest, XCode; Experience with configuration management platform such as Ansible; Familiarity with health-regulated software testing and documentation process; Familiarity with digital signal processing", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545001"}