{"title": "Touch HW EE Validation Engineer", "summary": "The touch technology team develops pioneering touch solutions and technologies that are central to Apple’s products, including iPhones, iPads, Apple Watch, and more. Bring devices to life and enable them to interact with users and the environment in ways never imagined before. The key goal of the touch technology team is to design the world’s best multi-touch user-experience. Join us in developing solutions for next-gen touch technologies. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. An engineer in this role develops strategies and solutions to ensure that Apple products meet the exact touch performance standards in terms of hardware and user experience.", "description": "The role involves development and execution of validation and characterization methodologies for Apple’s touch solutions, from proof-of-concept to mass production. The engineer acting as a Direct Responsible Individual will be responsible for: - Leading the development and execution of engineering validation and characterization methodologies for Apple’s touch solutions across different products - Driving strategies with multi-functional teams, including test, firmware, software, mechanical design and reliability engineering to deliver groundbreaking touch solutions - Designing metrics and figures-of-merit to guide touch design and performance tracking - Architecting and designing HW & SW infrastructure with pioneering robotics for innovative test solutions - Managing vendors to implement validation tools, plans and infrastructure at vendor sites - Performing failure mode analysis with advanced analysis tools to drive root cause diagnosis and system-level problem solving - Authoring reports and communications pertaining to key results and checkpoints - Business travel (Primarily within China. To a lesser extent USA)", "key_qualifications": "Strong electrical engineering background in analog/mixed-signal testing methodologies with prior proven experience in owning validation/test efforts on products Proficient in high-level programming languages for test automation. Experience with Python is a major advantage Experience in Design of Experiments (DoE), FA/CA (Failure Analysis / Corrective Action) Proficient in data visualization and statistical analysis tools such as Tableau, SpotFire, JMP, Python or Matlab or similar Excellent project management skills, written/verbal communication skills and solid people skills Experience with touch technology is a plus", "preferred_qualifications": "", "education_experience": "PhD/MS/BS in Electrical Engineering with 3 years of industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533685"}