{"title": "UAT Project Manager", "summary": "Imagine what you could do here! The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. Join Apple, and help us leave the world better than we found it! Here on the Apple Store Online team (ASO), we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a User Acceptance Testing (UAT) Project Manager to help us do extraordinary things. Our (UAT) Project Management team ensures that our Online offerings work as designed, and deliver the magical experiences that we intend. This team understands our systems deeply, creates a test plan to evaluate our new offerings, and provides final quality sign-off before they go live. As a UAT Project Manager, you will direct and drive medium to large-sized, global cross-functional UAT and have a direct impact on one of the world’s largest e-commerce sites. We believe this role will place you in a highly energised environment with some of the most hardworking, creative individuals in the industry. You will be inspired to share and continue building on your years of experience while providing extraordinary support to an amazing team!", "description": "The UAT Project Manager is responsible for project managing simultaneous medium-to-large multi-functional UAT projects worldwide, and delivering them in line with major release events. You'll develop deep subject matter expertise of E2E customer journeys, business processes, and impacted systems, and have the ability to innovate creative solutions. You will dynamically develop and drive comprehensive cross-functional UAT strategies. You lead and collaborate with multiple UAT partner teams to connect the dots and stitch across them to drive success. You will develop and sustain strong and trusted relationships with all cross-functional partners. You will manage, plan, and organise activities and tasks throughout UAT planning and execution. You lead, take forward thinking action, and provide goal-oriented direction in the face of ambiguity. You will keep the extended team informed, and ensure accountability to the resolution of key issues. You lead test resources required for successful execution of projects and provide input to and craft the UAT management processes in-line with industry best practices. You contribute to an inclusive environment through respecting each others’ differences and having the curiosity to learn and demonstrate Apple’s values of inclusion and diversity in daily activities.", "key_qualifications": "", "preferred_qualifications": "Proficient in using the following applications: Radar, Keynote, Numbers, Excel, Quip, Box\nExhibit a genuine passion for innovation shown through creative strategies and continuous process improvement\nAgile to fully comprehend current issues, and see around corners to understand downstream impacts", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554989"}