{"title": "Business Operations - Apple Pay, Japan & Korea (12 month contract)", "summary": "Imagine what you could do here! ... Join us and help us leave the world better than we found it!", "description": "-  Support and drive execution of business operations in Japan and Korea, such as launch readiness planning, testing, reporting, billing, as well as fraud risk management\n-  Track and report on key performance metrics and current business trends, and use these results and analysis to support business development and initiatives\n-  Propose and implement areas of improvements for operational excellence to keep up with evolving and diversified business requirements\n-  Collaborate with partners on technical and operational issue resolution to support partner onboarding and maintain quality customer experience post-launch\n-  Contribute to building deliverables for critical business meetings including periodic / ad-hoc business reviews", "key_qualifications": "Strong analytical problem solver with the attention to detail to be able to drive issues to root cause and operate seamlessly between highly detailed technical concepts and broader strategic business needs\nAbility to see the big picture and comfortable with ambiguity; flexibility to adapt to change and respond quickly to emerging priorities\nExceptional interpersonal skills; thrives in highly collaborative projects, effective at building consensus, and comfortable engaging across internal and external partners\nCuriosity and creativity in analyzing processes and identifying improvements to accommodate business needs\nProficiency in using sophisticated data and information to provide commercial insights that empower the team to drive business", "preferred_qualifications": "", "education_experience": "BA/BS degree or equivalent qualification in a relevant field", "additional_requirements": "-  Proficient oral and written communication skills in both Japanese and English (and preferably Korean)\n-  Passion for new technology and innovation; experience in payments industry and/or relevant ecosystems is a plus\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548165"}