{"title": "Analog IC Product Engineer (m/f/d)", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game?\n\nAs a member of our Productization team at our office in Munich or close to Stuttgart, you will have the great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day!\n\nWe are looking for an Analog IC Product Engineer who is driving and coordinating New Product Introduction (NPI) activity for Analog IC devices. You will work with cross-functional teams to debug, characterize and root cause diverse failure mechanisms.\n\nThe candidate can either work from Nabern or Munich Apple office.", "description": "- Coordinate New Product Introduction activities for Analog IC devices\n- Define ATE characterization test plans and generate characterization reports.\n- Finalize test limits and define proper guard-bands based on ATE-bench correlations, GRR and PVT characterization results. \n- Work with cross-functional teams to debug, root cause and implement corrective actions on diverse failure mechanisms.\n- Work with Design and TE to identify potential TTR and yield improvement plans prior to mass production release. \n- Support QA and Reliability with diverse Product Qualification requirements (HTOL board design, BI shift analysis, reliability guard-band, etc.) \n- Drive GRR analysis and coordinate cross-platform correlation activities. \n- Perform statistical data analysis on mass production data sets.\n- Work with internal teams to support mass production ramp as needed.\n- Support Test Engineering with test program release activities.\n- Define milestones and communicate product development schedule on regular basis.", "key_qualifications": " ", "preferred_qualifications": "Ideally several years of experience in product engineering\nIn-depth knowledge of semiconductor manufacturing process. Exposure to different Analog package technologies is considered a plus.\nSolid understanding of Analog, DC and Power fundamentals. Exposure to Analog test methodologies a plus.\nExperience working with multi-functional teams to define ATE characterization test plans, coordinating data collection and performing data analysis across PVT.\nDirect experience with yield management in high volume manufacturing.\nGood understanding of GRR analysis, ATE-Bench correlations, guard-banding methodologies and statistics associated with test limit definition.\nFamiliar with Product and Package Qualification requirements (HTOL, ESD, LU, etc.)\nAbility to setup DOE to drive root cause of diverse failure mechanisms\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559404"}