{"title": "iPad Hardware System Design Engineer - Austin, TX", "summary": "The iPad hardware team in Austin, TX is looking for engineers who are motivated by the opportunity to take on big challenges. Use your skills in electrical engineering, system integration, and collaboration with cross-functional teams to make design decisions that will benefit millions of iPad users worldwide! We are a team of system electrical engineers that own entire products from concept to ship. We sit at the center of Apple’s wider engineering team, working cross-functionally with mechanical engineering, software, silicon engineering and other module teams such as wireless, battery, camera, sensing, display, and factory test.", "description": "This is a unique hardware design position that starts at product concept and continues all the way through to mass production. You will be at the center of iPad product development with a critical impact on overall design. Day to day tasks involve: electrical design, simulation, bringup, debug, and validation for iPads. Routine responsibilities also include factory build support, and working with multi-functional technology teams in a fast-paced environment. There will be opportunities for international travel.", "key_qualifications": " ", "preferred_qualifications": "Hands-on experience in prototyping, bring-up, debug and validation\nSchematic capture and rigid/flexible PCB layout\nAbility to analyze solutions and make system design trade-offs\nLow voltage power regulation and delivery\nDemonstrated ability to understand technology and debug problems at varying levels of abstraction, from the system-level down to the silicon/transistor level\nSolid understanding of design and validation requirements for common interfaces (e.g. I2C, SPI, JTAG, I2S) and preferably high-speed interfaces (e.g. USB, MIPI, PCIe, HDMI, DP, Thunderbolt, DDR Memory, Ethernet)\nUnderstanding of computer architecture and design tradeoffs\nExposure to numerical modeling, simulation, and analysis tools such as Spice, 2d/3d field solvers, power &amp; signal integrity\nUse of scripting languages to assist with hardware development, and data analysis\nBeyond technical capability, we prize curiosity, creativity, integrity, leadership, collaboration, and a passion for learning", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556564"}