{"title": "Display Electrical Engineer", "summary": "At Apple, we don't just create products - we create innovation that transforms entire industries. Our team is made up of diverse individuals who bring a range of ideas and perspectives to the table. This is what drives the innovation that runs through everything we do, from ground-breaking technology to industry-leading sustainability initiatives. Join us to make world a better place. We are looking for talents to explore the next generation display technologies. The candidate must be an out-of-box problem solver and eager to explore creative solutions to solve challenging problems. In this outstanding position, the candidate will work with the Apple Display Engineering team in Santa Clara Valley to develop new methods to improve display performance, validate system integration, support mass production, and eventually being responsible for the front-of- screen experience of every Apple device with a small display.", "description": "As a Display Electrical Engineer, your key responsibilities will be:\n-  Characterize display performance through hands on measurements\n-  Data analysis to evaluate electrical and optical performance\n-  Work with team to understand fundamentals of display technology and existing workflows\n-  Rethink existing workflows to devise creative ways to automate tasks\n-  Bring up of prototype hardware and software\n-  Assist team members in fixing failures to root cause", "key_qualifications": "", "preferred_qualifications": "Working experience of display technologies: TFT, LCD, OLED, optical fundamentals, display driving system, calibration and compensation technologies\nHands-on experience in high volume mass production consumer electronics display related system.\nExperience in working closely with multi-functional teams, as well as with overseas suppliers.\nStrong problem-solving skills and the ability to analyze sophisticated technical issues.\nAbility and willingness to travel overseas.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555507"}