{"title": "Battery Test Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "-  Develop and implement test protocols to measure and characterize cell properties and electro-chemical performance\n-  Develop and implement process flows for the effective implementation of the protocols\n-  Develop, implement, and document validation methods to ensure the integrity of the lab data\n-  Coordinate characterization data collection\n-  Coordinate the acquisition or in-house design and manufacture of small tools for lab use\n-  Resolve need for and schedule/perform routine maintenance of test equipment and meters\n-  Collect and analyze test data, write-up reports as necessary\n-  Maintain standard operating procedure database\n-  Collaborate with team on necessary deviations in test, detail any procedure changes\n-  Communicate results to engineering team\n-  Refine/Update test procedures and documents\n-  Train and mentor technicians in the operation and upkeep of test equipment and tools", "key_qualifications": "NA", "preferred_qualifications": "Data management and statistical analysis experience helpful\nDatabase experience desired\nBachelor’s Degree in Electrical/Chemical Engineering subject area", "education_experience": "NA", "additional_requirements": "NA", "pay_benefits": "NA", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544755"}