{"title": "Product Manager, Retail Technology", "summary": "We’re a diverse collective of thinkers and doers, continuously reimagining our products and practices to help people do what they love in new ways. That innovation is inspired by a shared commitment to great work — and to each other. Retail Operations creates the tools and programs that empower our teams to provide, a one of a kind, only at Apple experience. We do this by obsessing over the employee and customer experience, and driving a global strategy that sets the bar. We believe inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. The Retail Technology Product Team is responsible for the systems that Apple customers interact with and employees engage to create the Apple experiences in our retail stores! As a Product Manager on our team, you’ll be a part of diverse, and supportive team that ensures our technology fulfills Apple’s vision of enabling employees to deliver the best Retail experience in the world. Partnering with Engineering, Merchandising, Operations, Online, and Marketing teams to deliver technology solutions that enhance the customer experience and optimize business processes in our stores.", "description": "-  Design solutions supporting large cross-functional business initiatives that impact many systems. -  Represent interests of business and technology through the design, development, and deployment of new technology and systems. -  Ensure coordination of funding, release schedules, communicate status, issue resolution, resource alignment, and quality standards are met. -  Collaborates with business partners and engineering teams to identify, mobilize, and execute solutions leading design reviews, feature prioritization, and negotiating features to meet release schedules. -  Establish product roadmaps for systems or a portfolio of systems supporting a business operation. -  Clearly articulate and clarify detailed requirements that are intended for engineering and UI design teams to build new software. -  Up to 15% travel (domestic and international)", "key_qualifications": "", "preferred_qualifications": "Experience planning, managing, and leading sophisticated technology projects in a high-paced, constantly evolving work environment, leading the team through issue resolution throughout the entire development lifecycle. Experience using Agile development methodologies and familiarity using JIRA/Confluence to document business requirements. Prioritizing work into Epics, User Stories, and writing Acceptance Criteria is a plus Expertise writing detailed business requirements intended for software engineering, UI/UX design, and track record of working with engineering/design partners to build technology solutions Experience delivering global enterprise level employee and consumer facing mobile and web applications, familiarity with user experience and interactive design success methodologies Demonstrate an ability to work with partners to clarify business problems, identify process/user experience improvement opportunities, and represent business interests during the design and development of technology solutions Success collaborating with software engineering partners to reduce technical debt, introduce new technologies, and migrate to new architectures Experience planning and leading software release cycles. Specific success prioritizing features, coordinating schedules across platforms, coordinating user testing, and communication with partners on roadmaps, delivery status, and change management details Excellent meeting facilitation, written, verbal, and presentation abilities Demonstrate Apple's values of inclusion and diversity in daily activities", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559164"}