{"title": "Sales Support Operations-Education Analyst", "summary": "The Sales Support Operations team at Apple is looking for a dynamic and motivated candidate for the role of Education Analyst. This position partners with Supply/Demand Planning, Sales, and Finance teams to drive Education channel health including forecast alignment, quote attainment, and peak event planning to drive execution excellence. This role requires an ambitious self-starter with a strong work ethic, proven analytical capabilities, ability to influence, and excellent communication / collaboration skills.", "description": "Develop complex statistical/forecast models (utilizing price elasticity, seasonality, cannibalization, etc.) to drive critical business decisions and insights. Present, defend, and influence product line business plans to senior executive leadership both internal/external to Apple and cross-functional stakeholders on a weekly basis. Influence and triangulate cross-functional alignment within a matrixed organization. Evaluate supply chain risks and implement contingency plans to mitigate consumer impact, including ad-hoc problem solving during unprecedented events. Manage Collaboration, Planning, Forecasting, and Replenishment (CPFR) with multiple Fortune 100 channel partners, strengthening business relationships with our customers. Drive, influence, and develop long-term strategic initiatives that shape the future of Apple’s supply chain and omnichannel roadmap. Plan, drive, and execute New Product Introduction operational activities, ensuring world-class customer experience across all of Apple’s routes to market. Identify process improvement opportunities (tools, workstreams, systems) and drive solutions from conception through implementation. Responsible for supply allocation and distribution of hundreds of millions of units between channels and reseller partners to maximize financial results and customer experience. Influence and manage operations across 50 global OEMs lifting out of 10+ origin locations. Drive innovation opportunities within our supply chain aimed towards achieving Apple’s Sustainability and eco-friendly goals of Carbon Neutrality throughout our supply chain by 2030.", "key_qualifications": "", "preferred_qualifications": "Self-starter with outstanding analytical capabilities, demonstrated experience with data preparation and visualization. Solution oriented and self-motivated; able to function effectively when working independently or in a team. Ability to both think strategically and execute tactically, with high attention to detail. Expert with Excel with the ability to assemble reports on on a recurring and ad-hoc basis. SAP/Tableau experience a plus. Prioritizes workload, managing multiple and often competing tasks, and meets deadlines for a variety of deliverables. Cuts through ambiguity and can rapidly understand complex business processes and details. Recognizes patterns and root cause analysis and provides recommendations on how to improve. Excellent verbal and written communicator with the ability to tailor the message to the audience. MBA, Masters Degree in a related field, or equivalent work experience, is desired", "education_experience": "Bachelors degree in Supply Chain Operations, Business, Mathematics, Engineering or equivalent experience, 8+ years of related work experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558368"}