{"title": "SoC - Systems Lead Architect", "summary": "We’re a unique team of innovative, diverse individuals who have come together from multiple backgrounds to create advanced Cellular Architectures. The people who work here are generalists in nature, and together we complement each other. It is the passion of exploring uncharted territory that makes us thrive.\n\nOur team is seeking a highly motivated and experienced Modem SoC Lead Architect to help drive strategic 5G Cellular Modem technology, analyze key architectural trade-offs in coordination with cross-functional domain experts. In this role, you will define next generation architectures and solutions for next generation SOCs.", "description": "This role involves interaction with many cross-functional and multi-disciplinary teams including hardware, software and system engineers. Being able to work through ambiguities and in a collaborative manner with all these teams is essential.\n• Work with cross-functional teams on new systems and technologies.\n• Explore new approaches aligned with emerging technologies, competitive performance requirements, and critical system constraints.\n• Perform feasibility analysis including SoC area, performance and power estimates.\n• Guide an efficient system/hardware/software architecture to meet product requirements.\n• Assess and guide system integration feasibility, feature and implementation trade-offs of new technologies.\n• Review, challenge and influence roadmaps, and set technology intercept targets for future SoCs.\n• Recognize and understand technology trends.\n• Specification ownership/authoring for the High-level architecture spec or key SoC features.", "key_qualifications": "Demonstrated expertise in SoC hardware architecture in the area of consumer electronics. Experience in the areas of Wireless and Cellular technologies such as LTE/5G NR is a plus.\nMust have outstanding SoC and system architecture fundamentals backed with substantial experience. This means a good understanding of power and performance tradeoffs, transient and steady-state performance states, idle and dynamic power states, as well as how SoC data and control flows interact.\nSound understanding of Microprocessor Subsystems, Memory Controllers and Communication Fabrics.\nGood understanding the Digital ASIC Flow and Debug methodology.\nSolid understanding of electrical and thermal considerations at the chip, package and system levels.\nGood understanding of hardware-software interfaces.\nExcellent communication skills across organizations and at the executive level.\nExcellent documentation and written skills for clear and concise reporting.\nExcellent organization skills to prioritize conflicting requirements in a multi-disciplinary setup.\nStrong cross-site teamwork skills with the willingness to work independently.", "preferred_qualifications": "", "education_experience": "BS and 10 + years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200543753"}