{"title": "Software Engineer - Full Stack UI, Employee Experience & Productivity", "summary": "Imagine what you could do here… At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. What inspires you? Creating something new and finding solutions to complex problems? Bring passion and dedication to your job and there's no telling what you could accomplish. IS&T Corporate Systems team is looking for a creative and motivated Software Engineer with excellent problem-solving and interpersonal skills. The work we do here has a large impact on Apple, from enabling our internal businesses to do their best work, to providing rich, highly usable experiences to our customers and partners. Our teams foster a collaborative environment with creative, smart & fun people using state of the art technologies. Engineering excellence is expected. Come join us for this once in a lifetime opportunity in building solutions for Apple that has a worldwide impact.", "description": "As a Full Stack Engineer you will be responsible for building the next generation of user experiences for Apple’s Recruiting Platform. You will work with project managers and technical teams in a multi-functional environment to implement quality products that meet the business goals. The ideal candidate will be self-motivated, proactive, and solution-oriented. Attention to detail and dedication to providing a high-quality, stable delivery are essential. You will be challenged to find creative solutions to technical problems, feel comfortable working with complex systems and large data sets, collaborating in a team environment. We promote innovation to improve our product performance and stay deeply focused on delighting our users.", "key_qualifications": "", "preferred_qualifications": "Experience designing and building complex, highly available, large scale web applications. Frontend development using HTML5, CSS3, JS & one or more JavaScript frameworks like NextJS, React, Angular or equivalent. Excellent knowledge of server-side programming languages & frameworks like Node.js, Express, Java & Spring. Experience with RESTful API usage and development. Understanding of security best practices for web applications. Experience in web analytics, accessibility, standards, and SEO techniques. Ability to learn and apply new technologies quickly. Strong understanding of TypeScript and the latest ECMAScript standards. Experience with non-relational, NoSQL databases and various data-storage systems. Experience with micro-services architecture and containerization (e.g., Docker, Kubernetes). Familiarity with messaging platforms like Kafka. Familiarity with CI/CD pipelines and automated testing frameworks. Strong problem-solving skills, with the ability to work in a dynamic and agile environment. Ability to collaborate effectively with teams located in different locations.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558868"}