{"title": "Software Engineering Project Manager - Health", "summary": "The Health Group conceives of and proves out exciting new technologies for Apple’s future health and wellness products and features. We are seeking a Software Engineering Project Manager to lead efforts in data analysis, tools and infrastructure/process development for health related projects. Our team works in a highly dynamic environment with to make the best products possible. If this sounds like you, read on!", "description": "In this role, you will be responsible for driving the design, implementation, testing and enhancements of analytics systems that identify trends in the compliance and usability of health data. You will need a clear understanding of the algorithm development lifecycle — from feasibility definition and data collection through data analysis. You will need to create reports based on data mining, analysis, and leveraging visualization and will be responsible for developing and maintaining protocols for handling, processing, and cleaning data. Your ability to assess internal processes for efficiency, problems, and identify solutions will be essential. You will interact with software developers, data analysis experts, and additional project management teams. An ambitious approach to problem solving and exceptional leadership skills built on a rock solid foundation of planning and risk management are essential. The successful candidate will be someone who can respond to changes swiftly, energetically, and enthusiastically while contributing to enhancing the health of our customers!", "key_qualifications": "", "preferred_qualifications": "Shown analytics skills with experience in building dashboard for visualization; Foundational understanding of system software fundamentals and strong curiosity about improving process; Consistent track record of timely project delivery and leading entire project life cycle; Ability to influence teams to adopt standard methodologies; Self-motivated and proactive with critical thinking and resourcefulness to drive the project to success, making an impact in health technologies", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534269"}