{"title": "Reliability Engineer", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Apple seeks an individual with the skills to strategically identify and drive corrective actions for the top issues affecting the Apple products. Through deep investigation and strong collaboration with engineering, product development, operations, and the component manufacturers, we strive to provide customers an experience of enduring quality through these products so integral to our lives. This is a key role to drive operations reliability testing and failure analysis during new product development and mass production. Good presentation and problem solving skills are critical. - Lead operations reliability testing and failure analysis in the development and sustaining stage - Drive and manage standard methodologies and findings across data sets to improve ORT and Failure analysis efficiency - Research and strategically implement iPhone system, module reliability testing to continuously improve system quality and field product usage model during mass production stage - Drive alignment and transition of reliability testing from NPI to MP - Working with commodity managers and supplier quality engineers to ensure component quality & reliability - Making recommendations to improve design, process and test - Strategic identification and prioritization of issues identified in ORT - Lead failure analysis of issues identified in ORT and coordinate cross functions to drive corrective actions through deep FA - Succinctly communicating technical updates to the executive team", "key_qualifications": "", "preferred_qualifications": "Has experience of functional verification/debug of modular components (any of Battery, MLB, Flex, camera, VCM, lens, semiconductor, vibrator, etc.) are preferred. Knowledgeable in data analysis and interpretation, familiar with JMP and Tableau/Python data analysis is plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555917"}