{"title": "Mac System EE", "summary": "At Apple, we don't just create products - we create innovation that transforms entire industries. Our team is made up of diverse individuals who bring a range of ideas and perspectives to the table. This is what drives the innovation that runs through everything we do, from ground-breaking technology to industry-leading sustainability initiatives. Join us to make world a better place. This is a System EE team role for Mac products, will be based in Shenzhen China. We're looking for committed and driven individuals to join our team to provide design, test, validation, failure analysis and manufacturing support to our products. The candidate will play an important role in the development of Apple products, collaborating with mechanical engineering, software, testing engineering and other cross function teams.", "description": "- You will participate in design and development of next generation high performance Mac product from concept to mass production.\n- Day to day tasks involved in electrical design, bringup, debug, and validation for products.\n- You are the technical contact at OEM site to support various engineering builds. Represent the EE team in a multi-functional team environment. Helping factory with EE related issues and driving post ramp quality issues.\n- You are able to identify and prioritize EE related issues. Drive resolution of multi-functional issues including those related to architecture (performance, power consumption, thermal behavior), production (quality, failure analysis, manufacturing), and development (schematic design, PCB layout, and overall system integration). Good ability for issue summary and reporting.\n- You are able to manage vendor EE resources for better technical support.", "key_qualifications": " ", "preferred_qualifications": "Familiarity with the architecture of high power and high performance computing systems, for example, X86/ARM servers, GPU/NPU/TPU servers etc, and very familiar with the HW and SW technologies used in these systems\nSolid experience on HW design for the server systems, including motherboard design, interconnection design and power system design etc.\nGood understanding and knowledge on SW/FW for servers, for example, boot-loader, EFI BIOS or BMC FW. Good at scripting languages like Python, Lua and Tcl etc is a plus", "education_experience": "BSEE required, MSEE preferred. ", "additional_requirements": "10+ years overall experience is preferred", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550327"}