{"title": "CPU Implementation Feasibility Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products! Apple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation.", "description": "As a CPU Implementation Feasibility Engineer you will work extensively with micro architects to help define the CPU and memory subsystem and performing feasibility experiments. Responsibilities also include but are not limited to: Making area/frequency/performance/power trade-offs, Driving RTL-to-GDS flow through synthesis/place-and-route with ambitious goals for power, performance, and area, Working with multi-functional engineering team to implement and validate physical design on the aspects of timing, area, power, testability, and reliability, Performing different floor planning experiments to understand the micro architectural feasibility for achieving high targets for performance, power and area, Performing different feasibility experiments for RTL innovations and improvements that drive the next generation high-performance and low power chips", "key_qualifications": "Minimum BS and 3+ years of relevant industry experience, The ideal candidate will have implementation experience on high performance CPU designs, Working knowledge of CPU microarchitecture including common critical loops for timing and understanding of low power microarchitecture and implementation techniques for CPUs, Understanding of static timing and critical path closure techniques, Experience with Logical Equivalence checking (LEC) tools, Experience with Power analysis tools, Basic understanding of power, performance and area tradeoffs", "preferred_qualifications": "", "education_experience": "Minimum BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552348"}