{"title": "DevOps Engineer", "summary": "The people here at Apple don't just create products - they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple is seeking an exceptional DevOps Engineer to join our worldwide sales team, Data Solutions & Initiatives (DSI). DSI is a product strategy and engineering team that works closely with business development and sales finance.  In this position, you will join a team of DevOps engineers focused on automating solutions, securing data and infrastructures, and owning all aspects of our infrastructure to achieve high availability, scalability and reliability.", "description": "We are seeking a skilled DevOps Engineer who is passionate about operational excellence through automation and engineering processes.  As a DevOps Engineer, you will play a crucial role in ensuring the seamless integration of development and operations processes, to deliver best in class and highly available systems. You will work with the application development teams to understand infrastructure requirements, while promoting efficiency, scalability, security, and reliability throughout the software lifecycle. Your expertise in cloud platforms, automation, and infrastructure management will be crucial to the success of our projects. The main responsibilities for this position include: Design and implement engineering processes to maximize the effectiveness of development teams by simplifying the process of building, deploying, and operating software. Assess current application security to develop threat models and assessments. Provide guidance to the engineering organization on navigating security and compliance requirements.", "key_qualifications": "5+ years proven experience as a DevOps Engineer or in a similar role. Proven experience as a software engineer or architect. Proficiency with containerization and orchestration technologies such as Docker, Kubernetes or equivalent. Proficiency with programming and scripting languages such as Ruby, Python, Node or Bash. Experience with configuration management tools (e.g. Ansible, Terraform). Proficiency in CI/CD using Jenkins, GitHub Actions or similar systems. Proficiency with logging and observability technologies such as Prometheus, Grafana, Splunk or similar. Experience with large-scale distributed data systems such as Hadoop, Redshift, Hive, Spark, etc... Experience integrating security practices into all stages of the software development lifecycle. Experience with preparing and executing PCI, SOC2, SOX, or other compliance audits Continuously work with the engineering teams to improve reliability, implementing actionable monitoring framework and be part of production on-call. Analytical & problem solving skills, ability to communicate ideas clearly. Excellent communication and collaboration abilities, with a strong focus on teamwork.", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science or equivalent in Engineering", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533570"}