{"title": "Mechanicals GSM, Beats", "summary": "Imagine what you could do here… At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! The MD GSM, Mechanicals will be part of Apple’s Beats Org and will work closely with cross-functional teams to help launch innovative yet cost-efficient products on compressed timelines. Mechanical components define the look, feel and expression of Beats’ unique brand within Apple; they are also integral to product performance and reliability. This role will be directly responsible for working with engineering to guide design for manufacturability and cost, defining sustainable sourcing strategy by factoring in cross-functional inputs, and developing robust working relationships with internal (cross-functional) and external (supplier) partners towards helping execute for cost, quality, capacity, and supply.", "description": "Successful MD GSMs thrive in a rapidly changing environment and constantly drive excellence across their own responsibilities as well as that of team members and partners. They frequently use strategic internal relationships to effectively collaborate with engineering, operations and other Apple teams. They are able to make smart decisions with the information available, think and stay focused under pressure, and communicate concisely and effectively with senior management as well as peers -  Engage with engineering teams during early product development phases to drive overall architecture towards the right cost by providing quick feedback on baseline architecture, challenging teams on underlying assumptions, and helping identify and evaluate alternatives -  Investigate and propose alternative manufacturing processes, materials, designs, and suppliers that optimize cost for our x-functional engineering partners -  Own overall mechanicals cost BOM, and influence cross-functional teams to validate and implement creative alternatives needed to meet cost target -  Identify the right supplier partners to work with to secure product quality, supply, and long-term cost-competitiveness, all on a compressed timeline -  Develop supplier relationships to “train” vendor mind-sets to align with strategic organizational needs and initiatives -  Identify and drive “special projects” related to costs, and develop into scalable cost solutions that can be applied across various Apple products over time -  Liaise between operational teams and operations-focused GSM teammates as needed, to support quality, capacity, and supply", "key_qualifications": "N/A", "preferred_qualifications": "Factory experience, particularly related to forming and finishing processes related to plastics, composites and metal - Ability to identify, manage, and drive Opportunities and Risks - Experience working across functions (Industrial design, Product design, Manufacturing design, Operations), and with suppliers… ability to influence across multi-functional teams", "education_experience": "BSME or BSIE, or equivalent. MBA a plus.", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552261"}