{"title": "Module Process and Equipment Engineer", "summary": "Apple is looking for a Module Process and Equipment (EQ) Engineer to join our Panel Process and Optics (PPO) Engineering team. PPO Engineers are responsible for developing new, innovative manufacturing process technologies and EQ to tackle complex design challenges that directly enable future Apple Displays and other Modules. The individual in this role will be a focal point in developing sophisticated key process modules and EQ from the concept/architecture stage through product engineering validation builds, with a focus on back-end display module integration and/or Laser processing. We work at a fast pace and require everyone to be highly self-motivated. A successful candidate needs to be a flexible problem solver and be able to determine solutions outside of their core technical expertise areas.", "description": "-  New process architecture investigation - keep tabs on relevant industrial process, equipment, and material manufacturing technical trends and apply novel solutions to the integration processes of display and other modules\n-  Process Development - Leads design and development of technically sophisticated manufacturing processes including material selection, equipment design, parameter optimization, and metrology bring-up to enable new products designs & functional requirements\n-  EQ Development - Drive EQ development from concept to MP through concurrent efforts of internal EQ design & testing and synchronized engagement with external EQ suppliers to meet process requirements \n-  EQ DFMEA - lead EQ DFM review efforts to develop reliable, high-performance manufacturing process equipment\n-  Conduct detailed process and equipment data collection for design validation and process technology feasibility studies through modeling and/or practical engineering methods, including hands-on experiment in labs\n-  Develop Process for Manufacturability - Provide early and ongoing manufacturing leadership to ensure new process is scalable for mass production\n-  Lead PFMEA and equipment DFMEA generation for new module technologies\n-  Failure Analysis - Lead root cause analysis and metrology development for issues related to new process technology\n-  Multi-functional interaction with Product Design, Display and Optical Engineering, technical operations, and international vendors\n-  Drive EQ, component or integration vendors on technology development and implementation, failure or issue resolution, and cost- efficient scale up for massEd production.", "key_qualifications": "", "preferred_qualifications": "Hands-on development of module processes such as lamination, bonding, thermal-forming, dispensing, etc.\nFamiliarity and expertise in Laser process and EQ development such as in Laser trimming, Laser drilling, etc.\nSolid understanding of materials such as conductive inks, adhesives, encapsulation materials, ACF, etc. and how to do material characterization\nSound understanding and experience in EQ automation and production line integration", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554927"}