{"title": "SAP Project Manager (FICO Support Delivery Lead),  Enterprise Systems", "summary": "Apple is a place where extraordinary people gather to do their best work! If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in ensuring Apple business keeps running, this might be the dream job! Apple’s Information Systems & Technology (IS&T) organization manages key business and technical infrastructure at Apple that influences how online orders are placed, overall customer experience with order, AppleCare service offering, Financial book closure and much more. We are looking for a SAP Finance support delivery lead who loves to get hands-on while driving day to day operational excellence and offering the highest service levels to our business partners. Be part of a team that prides itself in keeping Apple business running, be part of our S/4 HANA journey, and have significant opportunities to make a difference.", "description": "As SAP Finance Support lead,  you will need to  have a strong aptitude to tackle support issues in finance domain. You will need to have experience in design and configuration of the SAP FICO module. Responsibilities include: Work on support issues - troubleshoot and resolve them (including design, configuration, testing). Manage multiple support issues simultaneously with changing priorities and drive them to closure. Establish relationship with various business stakeholders and also ensure smooth month end / quarter end close. Drive system / process initiatives that could potentially improve efficiency / productivity. Monitor and identify trends for issues and implement solutions by performing root cause analysis.", "key_qualifications": "5+ years of SAP experience with expertise in SAP FICO, preferably in support space. Strong aptitude to do hands-on to troubleshoot production support issues. Excellent problem-solving skills and the ability to drive issue resolution across teams. Experience in partnering with vendor teams both onsite and offshore. Self-motivated, detail-oriented, and sensitive to established schedules and scopes. Ability to establish & maintain relationship with various business stakeholders. Excellent verbal and written communication skills across all levels of the organization. Ability to understand ABAP code to aid troubleshooting would be a significant advantage. Integration experience with tax applications, and other SAP modules like FICA, RAR, IS-Retail etc. preferred. Hands on experience on S/4 HANA will be a significant plus.", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science, Management Information Systems or equivalent work experience is preferred. Project Management degree or certification is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551991"}