{"title": "Sr. Technical Recruiter", "summary": "Do you have a passion for helping others succeed? Do you genuinely believe that talent is the greatest asset of any company? Apple’s Recruiting team searches the world for the extraordinary talent it takes to make extraordinary products. We believe it’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. We are looking for a Recruiter to join our Recruiting team, based in Israel. If you are results driven, a self-starter, and ready to “Think Different,” come join us and help us hiring best-in-class talent.", "description": "Lead the full cycle recruitment process from the kick-off discussion to direct sourcing, assessment and closing. You partner proactively with business leaders to assess and anticipate their future recruiting needs. As the recruitment subject matter expert, you are someone who continually demonstrates creative sourcing strategies and ensures an outstanding candidate experience. You are able to navigate ambiguity and proactively identify roadblocks in the hiring process. Gain in-depth understanding of the business functions and provide proactive solutions to ensure recruiting goals and deadlines are met. Build and maintain networks both internally and externally in the organization to identify key talent and handle ongoing pipelines. Ability to build strong partnerships with cross-functional teams, manage the offer generation and approval process. Maintain responsibility for integrity of data using Apple’s internal systems. Communicate tactfully, professionally, diplomatically and confidentially at all times, providing detailed updates regularly.", "key_qualifications": "8+ years experience developed in a mix of agency and in-house recruiting. Experience with engineering recruiting for any or all of the following: Hardware, Software, Firmware, Test, AI/ML. Expertise in all aspects of recruiting including, but not limited to: sourcing, networking, screening, assessing, handling relationships with hiring teams and business partners, coaching, driving processes, offer negotiation, awareness of employment laws and employment market trends. Excellent communication skills, driving great cross-functional relationships and establishing credibility within and outside of the organization. Advocates, educates and influences their business to embrace Apple’s recruitment strategies, processes and philosophy Attention to detail. Highly organized and able to prioritize and drive efficiencies in the recruiting process. Uses data and metrics to influence overall sourcing strategy Proficient in English.", "preferred_qualifications": "Demonstrated track record of driving successful inclusion and diversity strategies and tactics across the recruiting process lifecycle. BS/BA degree", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558473"}