{"title": "Apple Advertising Platforms - Campaign Execution Specialist", "summary": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.", "description": "Support the end-to-end process for digital campaigns which includes content review, campaign, asset trafficking and QA. Collaborate with both Business, Sales and Operation teams to optimize and streamline workflows to increase team efficiencies and elevate service to clients and advertisers. Assist with collecting performance reporting to ensure accurate delivery of outlined campaigns. Oversee policy enforcement for an assigned platform to ensure compliance processes and procedures are integrated and aligned with business processes. Identify and report issues, patterns, and trends on the platform. Ability to quickly learn and use various internal tools to review and moderate content on the platform. Communicate and collaborate effectively with global stakeholders and cross-functional teams. Develop innovative solutions to maximize content moderation efforts.", "key_qualifications": "Detailed comprehension and experience in trafficking display and other interactive formats. Experience with an advertising ad server and OMS system(FreeWheel, Operative, GAM etc.). Firm understanding of the advertising marketplace, vendors, and third-party technologies. Detailed orientated and the ability to prioritize tasks in a dynamic marketplace and work environment. Solid experience of delivering insights and optimizations based on reporting. Strong verbal, writing communication, organization and time management skills required. Familiarity with Apple products and services, especially MacOS, iOS. Incredible attention to details and ability to navigate ambiguity effectively.", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master’s degree. 3-5 years of trafficking experience within the digital marketplace", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,278 and $195,200 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552005"}