{"title": "Apple Data Platform - Engineering Manager, Data Solution Platform", "summary": "The Apple Data Platform team powers data analytics, exploration, and feature engineering to power Siri, Search, Music, iCloud and many other products we all love in our Apple ecosystem. The mission of the Data Platform org is to provide our engineers and data scientists with an innovative, reliable, secured, and easy-to-use infrastructure for ingesting, storing, processing, and interacting with data and ultimately help the teams that build data-intensive applications be successful. You will work with many cross-functional teams and own the planning, execution, and success of technical projects with the ultimate purpose of improving the product experience for Apple customers. We are looking for an Engineering Manager for the Data Solution Platform team that scales, manages, and optimizes the acceleration solutions for large-scale data processing. Come join us and be part of the Data Platform journey.", "description": "Join Apple's Data Platform team as an Engineering Manager to deliver the best experiences across a multitude of Apple products from Siri, Spotlight, Music, TV and Safari. You will be responsible for defining and driving the roadmap to build data acceleration solutions for Data Processing and Analytics for our data platform, offering the best infrastructure across our stack at Apple scale. You will collaborate with cross-functional teams of innovative software engineers, product managers, and engineering managers to continually improve our efficiency and performance. We embrace the use of open-source technologies, including Kubernetes, Spark, Flink, Trino, and Iceberg.\n\nRESPONSIBILITIES INCLUDE: \n- Define and drive technical vision, roadmap, and strategy for our platform \n- Guide the design and development of new data solutions that accelerate the use of data across Apple \n- Participate in product design reviews to ensure efficient and secure use of data in Apple \n- Collaborate with stakeholders and cross-functional leaders in engineering, product, and operations across Apple to ensure the correct adoption of our Data Platform \n- Lead and mentor new hires or junior engineers \n- Provide guidance and establish processes to ensure engineering excellence, efficiency, and operational sustainability of our platform \n- Foster a healthy, inclusive, collaborative, and technology-driven culture", "key_qualifications": "8+ years of software development experience\n3+ years managing engineering teams for Data Processing or similar area\nExperience with commercial and/or open-source large-scale data processing, storage frameworks, and platforms such as Apache Spark, Apache Flink, etc\nExperience with programming languages such as Python, Java, Scala, Rust\nExperience in managing and optimizing data platforms and infrastructure\nStrong organizational skills and experience working on large multi-functional teams\nExperience in influencing and driving key product innovations and opportunities across diverse collaborators\nPassionate about operational excellence through proper automation and engineering processes\nStrong distributed systems and engineering background\nSuperb problem-solving skills and the ability to thrive in a fast-paced and dynamic environment.", "preferred_qualifications": "", "education_experience": "B.S or M.S. Degree in Computer Science/Engineering, or equivalent work experience", "additional_requirements": "Bonus if you have experience in the following areas:\n- Working with streaming data processing frameworks such as Apache Flink, Kafka Streams, Spark Streaming\n- Working with data visualization tools such as Apache Superset, Grafana\n- Working with interactive computing platforms such as Jupyter Notebook\n- Developing and optimizing algorithms that run efficiently on resource-constrained platforms", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546818"}