{"title": "Apple Support College Program At Home Advisor - California State University Sacramento", "summary": "At Apple, we believe that dedication, a fun environment, creativity and innovation fuel the ultimate customer experience. We believe each customer interaction is an opportunity to delight, engage, and inspire. By focusing on the smallest of details, we can make a huge impact with our customers. Building this environment starts with you! If you're a problem solver who easily connects with others, helps friends and family troubleshoot issues and are curious about why things work the way they do, you could be the next Apple Support College Advisor. Our Advisors thoughtfully engage with customers, explaining step-by-step solutions with patience and an approach tailored to each individual customer. They help fix technical issues while providing an incredible customer experience!", "description": "At Apple, we believe our diverse backgrounds, perspectives, and passions help us create the ideas that move all of us forward. As an Apple Support College Advisor, your voice is essential in supporting many of our popular products, including iPhones, iPads, MacBooks, iMacs, and more. As our customers’ first point of contact, you’ll be the friendly voice of Apple, providing world-class customer service, troubleshooting, and technical support. We’ll rely on you to listen to our customers and use your technical expertise, creativity, passion, and our documented troubleshooting flow to meet their needs — and remind them that behind our great products are amazing people. We’ll train you to be the best. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development. We’re committed to helping employees explore their potential. Inclusion is a shared responsibility, and we hold ourselves and one another accountable for fostering a culture where everyone feels seen, heard and inspired to do their best work.", "key_qualifications": "Enrolled through December of 2026 or later in at least one class at a university in the U.S. pursuing a bachelor’s degree or higher, A quiet home workspace, ergonomic chair, desk, A hard-wired internet connection directly from an internet service provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency, Available for nine weeks of part-time paid training on a set schedule totaling 24 hours a week: four, four-hour shifts during the week and one 8-hour shift on Saturdays, Post training, available to work 20 weekly hours, similar to the training schedule, Able to flex up or down in weekly hours when school is not in session, based on business needs, Able to meet a minimum typing speed of 40 WPM while talking with customers, Successful completion of a pre-employment assessment, background check, and initial training, 2.7 GPA", "preferred_qualifications": "Business, Communications, Computer Science, Engineering or any other tech-related major, Passion for customer service and ownership of the customer experience, including comprehensive issue resolution, Approach opportunities flexibly and with good judgment, Model high standards and demonstrate quality, honesty and accountability, Able to navigate difficult conversations and display resilience after challenging situations, Potential to effectively tailor communication and style to differing audiences, Able to self-manage and work independently in a fast-paced, constantly changing environment, Thrive on a team where expertise is shared and feedback is welcome, Effective time management, including ability to multitask, organize and prioritize, Able to research and grasp technical information across multiple tools while respecting customer privacy, Potential to acquire skills in technical troubleshooting and an eagerness to learn and take on new challenges, Makes space to listen, learn, and amplify diverse perspectives and experience, Actively seeks out opportunities to champion and celebrate inclusion and diversity", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $23.00 and $27.50/hr, and most new hires start at $23.00. Your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557246"}