{"title": "Interconnect Product Design Engineer", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! As a member of a multi-functional design team at Apple, you will help to build the next generation of the world's finest mobile devices. You will conceive, design, and bring into production products that will re-define the mobile experience. You will work closely with many different multi-functional teams including Industrial Design, Hardware Engineering, Antenna, Reliability, Packaging, Safety and Marketing. We are looking for significant prior experience in Unigraphics and/or Pro-E. Someone well organized and able to balance numerous program needs simultaneously. Your excellent communication and interpersonal skills will help you to quickly grasp issues and drive the appropriate developments to resolution. This role affords you the opportunity to interface significantly with other departments within Apple and external partners. We do work in a multifaceted environment and which will require you to quickly find creative, multifaceted solutions.", "description": "Overall mechanical component and system design from concept to shipment. Developing design and analysis capability in-house. Documenting and presenting designs, trade-offs, and status updates. Developing test and validation plans. Knowledge in the following areas: - Switch design - Connectors, cables design - Keyboard and/or Mouse design - Mechanism design, especially small-scale - PCB design and manufacturing principles - EMI, ESD and signal integrity - Materials: Polymers, Ceramics, Glass, Metals, Meta-Materials - High volume manufacturing/processes - Geometric Dimensioning and Tolerancing", "key_qualifications": "Experience in mechanical design (preferably internships or working experience in consumer electronics). Proven ability in plastic and metal part design. Handheld/portable device experience. Experience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing. Experience with component modules (LCD, batteries, camera modules, etc.) and interconnects (FPC design and ACF bonding), a huge plus Integration of wireless antenna (GSM, GPS, Wifi) into mechanical enclosures, a huge plus Integration of electrical subsystems (LCD, microphone, speaker, receiver, camera) Unigraphics proficiency desirable. Strong failure analysis, FEA experience and problem-solving skills Experience working with overseas manufacturers, a huge plus The ability to travel internationally (20%+).", "preferred_qualifications": "", "education_experience": "Bachelors in Mechanical Engineering required; Masters or PhD or equivalent experience preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548915"}