{"title": "Product Manager, Identity (Wallet, Payments &Commerce)", "summary": "Apple is a place where extraordinary people gather to do their best work! Together craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. The Apple Pay and Wallet team is looking for a Product professional with a proven track record and experience in digital identity to join us on the journey of replacing the physical wallet. You will partner directly with business; engineering; and other functional teams across Apple. You should have significant consumer product management experience and a track record launching of at-scale product launches. You possess a strong technical background and the ability to methodically assess, prioritize and solve complex problems in the physical and digital identity space. You demonstrate attention to detail and focus on excellent customer-centric solutions. Ability to tackle an independent work stream and drive progress is key!", "description": "We are looking for an individual with a proven background in developing and delivering Digital Identity products. We seek a self starter and energetic person with strong leadership capabilities. You will partner directly with the Wallet, Payments, and Commerce business teams, engineering teams and other functional teams across Apple as well as working with external partners to enable new consumer experiences. The selected candidate will challenge assumptions and design solutions first and foremost with Apple’s customers in mind despite the complexity that is often behind the scenes in identity management and trust provisioning. Travel will be required.", "key_qualifications": "", "preferred_qualifications": "Proven Product Management success in digital identity services, In-depth knowledge of verification techniques and assurance levels for online identity proofing and presentment, Outstanding communication and presentation skills (written and verbal) at all levels of an organization, Ability to lead and influence different cross-functional teams and external partnerships to drive decisions and outcomes, Knowledge of the advancements in biometrics and their use for authentication, Proficiency with Apple products and applications, MS Degree in CS/EE and/or an MBA preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557604"}