{"title": "Technical Project Manager - Apple Retail IS&T", "summary": "At Apple, we rely on our employees’ diverse backgrounds and perspectives to foster innovation through great ideas to surprise and delight our customers. And great ideas can come from anywhere. Will that next great idea come from you? At Apple retail PM team, we are responsible for managing projects for wider retail apps and technologies including but not limited to our global eCommerce platforms that serve millions of customers around the world. We are a team of highly skilled Project Managers, Software Engineering Managers, Engineers, Product Owners and Analysts based in Cupertino, London, Singapore and India The retail PM team in Cork (Ireland) is looking for an exceptional Technical Project Manager with substantial experience of delivering complex software development / engineering projects using Waterfall, Agile or Iterative software development methodologies. The successful candidate will need to be an experienced, proactive, results-oriented project manager with a track record of success in managing cross functional transactional application development. A substantial part of the role will require close engagement with Project Management, Engineering and Product Management teams based in US, London and Ireland.", "description": "The ideal candidate in the role is expected to establish and drive assigned projects, either as outright owner of the project or an assigned subproject on a larger programme. They will take ownership for the success of the project deliverables, both in terms of project delivery and business outcomes, including: Establishing a close working relationship with business owners and stakeholders, understanding their immediate requirements as well as future programme roadmaps. Creating project documentation in accordance with the appropriate methodology for technical and business audiences. Managing IT teams, offshore development teams and third parties to deliver cross functional software features and enhancements against the schedule and budget. Becoming a valuable part of the global retail Project Management team. Working closely with the team members to ensure that the team have a clear view of project progress and resource usage across the portfolio. Managing expectations of key stakeholders – taking a clear interest in the success of the project outcomes, not just the technical delivery. Being an active member of the EMEIA retail PM Team, supporting colleagues and peers to help achieve Apple’s overall goals and those of the team. Play effective roles in hiring and one boarding new team members.", "key_qualifications": "Background in eCommerce, with a strong understanding of the processes, functions and challenges of the end to end customer journey including payments, logistics and delivery. Demonstrable experience in working with projects in an international organisation within a technical environment with globally dispersed business and IT stakeholders. Understanding of different project management methodologies, internet-based application development and software development terminology and project life-cycles. Excellent communication, presentation, organisational and writing skills. Experience of working successfully with a mix of permanent, contract and offshore resources. A structured approach to stakeholder engagement and planning communications. A meticulous attention to detail and a focus on excellence. An outward looking project management style, having worked closely with business owners, IT functions, vendors and suppliers. An inclination for the relentless pursuit of project unknowns, closure of issues and clarification of assumptions. Experience of working closely with business and technology functions to develop accurate resource estimates, plans and monitor them during the project lifecycle. Flexible attitude and willing to take on new challenges. CAPM, PMP or Prince2 Certification desirable.", "preferred_qualifications": "Bachelors degree in a related field.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555396"}