{"title": "Engineering Manager, iOS & macOS Contacts", "summary": "Apple devices allow people to connect and share content seamlessly. Native platform experiences and robust APIs bring rich interactions while preserving user privacy and ability to focus on their tasks. Here lies the Contacts team mission. Help us make the Contacts experience delightful and bring the people dimension to every device. Work with a high-paced applications team, talented engineers, and world-class designers to deliver the best system experiences on the planet!", "description": "Contacts are the center of people interactions on Apple Devices. We're looking for a team leader to drive our feature set across user experiences, frameworks, and data sync. ... By assuming these roles, you will play a pivotal role in delivering an exceptional user experience for our customers.", "key_qualifications": "Successful experience of team management: hiring and growing individuals, making the right staffing decisions. Work with designers and organization leaders on developing delightful user features with schedule and quality in mind. Proven ability to manage team commitments and work cross-functionally. Fast learner and proficient context switcher. Attention to detail, thorough thinking on the entire implications of existing and new features. Sense of prioritization, ability to question the status quo, and focus on what matters. High integrity leader who makes the team success a priority.", "preferred_qualifications": "Bachelor of Computer Science or equivalent skills and work experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554469"}