{"title": "Computer Vision Research Engineer - Apple Maps 3D Vision Team", "summary": "We at the 3D Vision team at Apple Maps are looking for the very best talent to join our team of computer vision and machine learning experts. With us, you will be working on ground breaking technology by researching and developing new methods and algorithms deployed on a global scale. As part of this team you would be working on extremely large data sets of different modalities, collected by various moving platforms, including aerial, satellite, and ground. You need to have a strong curiosity about tackling and solving new real-world problems. You would join a team of fast paced and pragmatic problem solvers that are tackling the toughest problems in the field by developing new innovative technology.", "description": "You will be a part of a small team with the goal of crafting accurate and hyper-realistic 3D experiences at a global scale. To achieve this, you will help developing novel groundbreaking methods within differentiable rendering (NeRF, Gaussian Splatting, etc.), generative models, and many other areas of computer vision and machine learning.", "key_qualifications": " ", "preferred_qualifications": "Published papers in top-tier CV/ML conferences (CVPR, ICCV, ECCV, NeurIPS, ICLR, Siggraph, etc.).\nSolid experience with deep learning frameworks and infrastructure.\nExperience with modern differentiable rendering methods, such as NeRF, Gaussian Splatting etc., is appreciated.\nExperience with diffusion models or similar is appreciated.\nKnowledge of computer graphics fundamentals is appreciated.\nSolid Python skills.\nSome experience with C/C++.\nSome experience with GPU/graphics languages, such as CUDA, OpenGL or Metal, is a plus.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559372"}