{"title": "Product Manager - Audio & Home", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We believe that if you bring passion and dedication to your job, there's no telling what you could accomplish! As a member of our Worldwide Product Management team, you’ll represent the customer and business throughout from concept through development, launch, and in-market. You’ll develop and apply insights to help infuse innovative features into our product-development process. Together with our team, you’ll work to craft groundbreaking ideas into tangible products that excite the world. At Apple, we combine product management/development and product marketing responsibilities into a single, cross functional Product Management role that collaborates with design, engineering, finance, legal, marketing communications, public relations, market research, sales and support for maximum impact across the organization. We are passionate about the future of Audio & Home at Apple, and we are looking for a highly motivated Product Manager. You will have a seat at the table to help define and drive products and software while being responsible for how new and existing products and experiences are launched and marketed.", "description": "In this role, you will be deeply involved in the definition of the Audio & Home roadmap, development, and launch of experiences and products. You will play an instrumental role on the team that includes writing product and marketing requirements documents, collaborating with engineering to investigate new technologies, and being the voice of the market to Apple during the development phase. Leading up to launch, you will craft product messaging briefs, guide marketing communications on the creation of product launch materials, and act as a product spokesperson in press briefings and public events. You are comfortable with complex and ambiguous problems and situations, and adept at identifying a project’s risks. You love using your creative and critical thinking to craft solutions for resolving them quickly. Working with multiple internal and external partners, you are adept at quickly gaining their respect and support, and consistently demonstrate extraordinary marketing expertise, attention to detail, objectivity, and accountability.", "key_qualifications": "6+ years Product Management/Product Marketing experience having led the entire product hardware or software lifecycle from concept to introduction. Experience working closely with cross-functional teams to lead and define product strategy and roadmap. Strong analytical abilities and an uncompromising attention to detail. Can operate seamlessly between highly detailed and technical situations as well as strategic business situations. The ability to think clearly to see the big picture and innovate down to the details. Exceptional interpersonal skills; thrives in highly collaborative projects, effective at building consensus, handles high stakes decisions with ease cutting through ambiguity. Proven oral and written communication skills; ability to become fluent in technical concepts and explain to non-technical partners. A track record in formulating product messaging and creating outbound marketing through world-class storytelling.", "preferred_qualifications": "", "education_experience": "BS degree preferred, MS/MBA preferred. Or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538847"}