{"title": "Sr. Software Engineer - Traffic (ASE)", "summary": "Apple services depend upon performant and reliable networking primitives. Our mission is to connect all services in secure, scalable and transparent matter. This includes implementing networking and traffic primitives for resilient service to service communication. These capabilities are packaged into ingress, egress, and mesh proxies at Apple scale.", "description": "As a Traffic Engineer you will orchestrate the design and development of cutting-edge traffic proxies that power Apple services at an unprecedented scale, serving hundreds of millions of users globally. As a key player in our tech ecosystem, you will take the lead in enhancing our network stack for improved ingress, egress, and mesh functionality. This role is not just about coding; it's about making contributions architecting the backbone of Apple, pushing the boundaries of what's possible in the realm of software development. If you're passionate about tackling challenges at an extraordinary scale, innovating in the traffic management space, and influencing the direction of an industry giant, this is your opportunity to shine! ...", "key_qualifications": "Extensive professional expertise in Traffic/Edge Engineering or Cloud Networking. Proven expertise with Linux network stack. Highly skilled with one or more advanced programming language such as C, C++, Java or Go. Hands-on experience with Infrastructure-as-Code (e.g., Terraform, Chef, Puppet). Experience with automating operations (e.g., software deployments, config changes) at scale. Understanding of performance analysis and optimizations. Passionate about enabling internal partner teams. Full product lifecycle ownership mindset (design → implementation → production). Passionate about contributing to open source projects such as Envoy and working across a large organization to meet Apple’s dynamic traffic needs. Experience with core production engineering best practices (e.g., designing for operability and scalability, adopting SLOs, eliminating toil)", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539810"}