{"title": "Swift Software Engineer - Security", "summary": "The SPEAR team in Apple’s Security Engineering & Architecture organization is hiring a collaborative software engineer with a drive to deploy Swift in operating system software to improve the security of end user devices. SPEAR is a dedicated team of software engineers with a passion for user security. We work hands-on with teams across Apple to improve the security of their operating system components. We focus on high impact projects ranging from surgical adoptions of memory safety technologies to wholesale refactors that reorient key system components to protect the security of our users’ devices. Our work results in major improvements to the security of Apple’s apps and services without compromising the polished user experience over a billion users rely on every day. As an Swift Software Engineer in SPEAR, you will work with teams across Apple’s software stack to implement key operating system components in Swift. You will deliver well-designed, robust, and maintainable frameworks and applications that meaningfully improve end user security. Your work will help set the standard for cross-functional collaboration, thorough testing, and clear documentation.", "description": "Each project will involve solving unique challenges while handling the following core responsibilities: Efficiently gain familiarity with the design and implementation of existing codebases. Contribute to the design of application, framework, or daemon security hardening projects by implementing new or existing components in Swift. Design maintainable libraries that use the Swift type system to present safe interfaces while working within the performance constraints required of OS software. Adopt or update isolated unit testing to thoroughly exercise changes; collaborate with QA engineers on functional testing. Document changes and new architectural elements, creating training materials required for partner team to maintain changes going forward. Communicate collaboratively and effectively during all project phases. ", "key_qualifications": "* Bachelors degree in Computer Science/Computer Engineering, or equivalent experience\n* 3+ years of experience designing software in Swift\n* Deep understanding of the Swift programming language including the type system, standard library, and interaction with the runtime\n* Familiarity with system concepts including multi-threaded processing, synchronization, and interprocess communication\n* Ability to reason about the security or robustness of application software\n* Ability to communicate clearly and effectively about technical topics (verbal and written)\n* Enthusiastic, empathetic, and collaborative approach to multi-functional projects\n* Ability to quickly get up to speed on new codebases and adjust your approach to meet the needs of diverse projects and requirements", "preferred_qualifications": "EDUCATION & EXPERIENCE\nBachelors or Masters/PhD in Computer Science or Engineering with an emphasis in Computer Security or a related field, or equivalent experience. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552935"}