{"title": "Swift Platform Experience - UIKit Framework Engineer", "summary": "Join the UIKit team and help define the future of APIs and components used in millions of applications across all of Apple's operating systems and platforms. The UIKit team is looking for a creative, detail-oriented software engineer to help push our user experiences forward. Come work with an energetic, hardworking team of engineers, multi-functional teams, and world-class designers to deliver the best user interfaces on the planet.", "description": "The UIKit framework provides a wide range of functionality and is used in every single iPhone and iPad application. It is the basis for a wide range of functionality: application lifecycle, touch and event handling, text editing and layout, animations, views, windows, controls, and higher-level components such as UIGestureRecognizer and UICollectionView. As a software engineer on the UIKit team, your responsibilities will range from designing and implementing new features and interfaces, to organizing and iterating on performance and infrastructure efforts. You should have a strong understanding of object-oriented software design, and an eagerness to tackle tough problems and learn from amazing teammates.", "key_qualifications": " ", "preferred_qualifications": "Exceptional problem-solving, critical thinking, and communication skills\nOpen-minded, strong collaboration skills\nA genuine excitement for solving sophisticated problems\nUnderstanding of optimization and performance issues across OS software layers", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555275"}