{"title": "Health Sensing PD - Mechanical Engineer", "summary": "The Health Sensing Product Design team is seeking a hardworking mechanical engineer to build great experiences and bring Apple products to life. We develop sensors that change the way people interact with their technology. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. At the end of the extraordinary team effort, your work will be in the hands of millions of people making a visible difference in their daily lives.", "description": "You will lead the end-to-end design, development, and validation of health sensing technology into Apple’s portfolio of products. You will work with a talented multifunctional team to generate and validate design concepts, and as the mechanical expert you will be responsible for engineering analysis and documentation for your piece of the project: \u2028 - Managing multinational vendors across projects designated for the team, which will span the lifecycle of a new product from initial design and concept validation of new hardware through detailed execution and implementation at our system integration partner sites (35%); \u2028 - Driving the detailed development of our component/module/system integration vendors to deliver scalable solutions to successfully support Apple mass production (35%); \u2028 - Creating, reviewing and providing feedback on design documentation and system reviews (e.g. drawings, test/ cosmetic specifications), performing detailed tolerance analysis tools and translating assembly variation into hardware performance impacts, supporting root cause/failure analysis and process development (15%); \u2028 - Collaborating with optical, electrical, quality, and test engineers that will be utilizing the health sensing feature, as well as writing design and architecture documents (15%);", "key_qualifications": "4+ years of hands-on experience designing for a production environment. High volume, consumer electronics, or health/optical sensing experience is a plus. Experienced in vendor engagement and technical project management. 3D CAD experience and proficiency in GD&T and tolerance analyses required. Practical experience with optical modules, health sensors, packaging techniques, and optoelectronic components. Excellent written and verbal communication skills. Able to craft clear engineering documentation (2D drawings, standard operating procedures, ECOs). Able to effectively collaborate with diverse team members and external vendors to define and achieve project goals. Experience with JMP, MATLAB, scripting and data analysis are a plus. Interest, curiosity and motivation to learn and apply new engineering concepts.", "preferred_qualifications": "", "education_experience": "BSME required, MSME, PhD preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200510620"}