{"title": "Electronics Lab Technician", "summary": "We‘re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the iPhone, Apple Watch, iPad, and Mac. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. You will be a part of the display and touch engineering team and will help Lab management work in bring-up of prototypes and hands-on measurements at bench stations. You will also be responsible for maintaining part of the electronic lab with required equipment and supplies. We are looking for an experienced EE technician with excellent Lab management skill, test instrument calibration coordination with vendors, hands-on tool and bench setup assembly, board rework, and facility maintenance.", "description": "-  Assist engineers for high volume (hundreds of units) of test instrument calibration with vendors\n-  Assist engineers in shipping and receiving packages locally and internationally.\n-  Support DUT replacement at test setup for screening or characterization.\n-  Assembly thermal tool for thermal head and chambers.\n-  Bench setup and tear down\n-  Board rework (i.e. attach/remove compoents, and add fly-wire for routing by solder.)\n-  New incouming / outgoing board screening with software and test instruments\n-  Fire extinguisher inspection coordination\n-  Lab organization\n-  Escorting for lab cleaning (6 lab rooms)\n-  File facility tickets to fix misc. lab issues (broken doors, light, desk, char, etc.)\n-  EHS inspection and HazMat bin collection\n-  Plan and maintain lab facilities for optimal efficiency.\n-  Champion safety, security and quality.\n-  Be able to work across multiple teams to get things done.", "key_qualifications": "5+ years of related experience in small engineering labs.\nExcellent debugging, optimization and problem solving skills.\nHW testing and validation for silicon IPs is a plus.\nHW testing and validation with oscilloscope and power measurement equipment is a plus.\nBasic understanding of analog/digital circuits.\nAbility to work with schematics, and PCB layouts is a plus.\nComfortable with working on OSX based Apple computers.\nFamiliarity with scripting languages like Python/C-code is a plus.\nPassion, diligence, integrity, and exceptional aptitude.\nTeam player with excellent conversational and written communication, and negotiation skills.", "preferred_qualifications": "", "education_experience": "Associates degree in Electrical Engineering or related field, or relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $31.20 and $56.65/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552042"}