{"title": "Merchant Business Development and Partner Solutions, Senior Manager –Apple Pay", "summary": "We are seeking an expert Business Development leader to join the Wallet, Payments & Commerce (WPC) Merchant Business Development and Partnerships team to structure partnerships and strategic alliances with merchants, developers, payment processing and FinTech partners in the Americas. Partnerships will be oriented towards securing acceptance of Apple Pay platform features across merchants’ Apps and eCommerce sites. The Partner Solutions Manager will be responsible for the end to end business development including screening strategic partners, developing a product strategy to optimize customer experiences, launching new products and programs, and crafting tools and documentation to scale partner onboarding. Additional responsibilities include supporting the technical evaluation of digital wallet and payment providers for Apple’s services. This role will lead multiple Partner Solution Managers responsible for enabling existing and emerging Wallet features. Candidates should have a consistent record of building and sustaining strong, successful relationships across traditional consumer verticals, eCommerce platforms, consumer internet companies, FinTech partners and emerging start ups. Extensive experience and knowledge of end to end contactless payment processing including POS, mPOS, terminal hardware and related POS software; application development/modern payment API and emerging mobile payments. The candidate will work closely with Apple Pay BD, Worldwide Developer Relations, product, engineering and PMO teams to jointly identify partnership strategies and launch programs that impact core business metrics.", "description": "Develop and implement strategy with Business Development, Issuer and Network Partner Management teams to scale Apple Pay features across leading Wallet partners. Directly manage a team of Partner Solution Managers who will lead and partner with cross-functional teams through all aspects of partner development, product requirements, UX, integration and end to end testing. Develop documentation in collaboration with engineering and product teams to help build scalable tools and processes for partners to leverage. Work with Apple product and engineering teams to influence product roadmap, provide partner feedback and advise solution architecture. Provide regular communications to senior management on partnership strategy, project status and results. Full time position based in Cupertino, CA. Travel required, as needed.", "key_qualifications": " ", "preferred_qualifications": "Experience working in Latam and Central America on digital payments and proficiency in written and conversational Spanish and/or Portuguese. Applicable experience developing and scaling new business programs within digital payments preferred. Outstanding communication and interpersonal skills and ability to influence without authority and develop strong working relationships inside and outside of Apple.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $200,400 and $358,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554795"}