{"title": "Sales Enablement Manager, South Asia", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple’s sales organisation generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is in many ways, the face of Apple to our largest customers. We have an amazing opportunity with the Integrated Channel Experience (ICE) team. We're here to educate, engage and enable channel partners and their salespeople at Apple Authorised Resellers and Distributors in South Asia (including carriers, retailers, consumer electronics, enterprise and education resellers). This role will lead a team of program managers in planning, executing and measuring high-quality sales enablement activities that empower and inspire channel partners and their salespeople to deliver great Apple customer experience. You work closely with sales, marketing and broader ICE teams to enable channel partners and their salespeople on how to drive consideration and advocacy of our Apple products and services. Do you enjoy a fast-paced and dynamic environment with passionate colleagues, where your creativity and solution based thinking skills can shine? If so, we want you!", "description": "Responsible for partnering with Sales leadership to define sales enablement strategy, drive execution, and communicate business impact Measure sales enablement programs, its impact, effectiveness, and utility Lead and develop a team of program managers across South Asia countries, providing guidance, support and mentorship Foster culture of best-practice sharing among program managers and country teams, and in selected cases, building playbooks to be shared among WW & regional teams Manage program budget for sales enablement initiatives across the region Collaborate with sales teams and channel partners on sales enablement programs and activities, while ensuring strategic alignment with sales objectives Act as a liaison between Regional and WW teams to facilitate communication and knowledge sharing Partner extensively with Regional Partner Channel Marketing & Communications (Marcom) to find opportunities that ensure integrated customer experience Oversee the creation and execution of channel sales enablement programs that include but are not limited to advocacy programs, channel communications, experiential programs, in-store activities, channel insights and digital CX Connect sales enablement strategy and operation to broader Integrated Channel Experience (ICE) initiatives", "key_qualifications": "", "preferred_qualifications": "Superior knowledge of sales strategies, with a strong background in advocacy, marketing and communications pertaining to channel partners Outstanding presentation skills, story-telling skills, written and verbal communication, engagement and interpersonal skills. Ability to work cross functionally, influence and form close partnerships with a variety of teams regionally and globally Strong project management and organisational skills, with the ability to manage multiple priorities and deadlines.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557732"}