{"title": "Sales Finance Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! By joining Apple, one of the most influential technology leaders and brands in the industry, you’ll share in a dedication to excellence by partnering with extraordinary managers, all with one unified vision of crafting innovative products and services that delight our customers. You and your team will support Apple’s growth, both top and bottom line and apply the same innovative approach towards financial matters as we do towards our services and products. Apple’s Canadian Sales Finance team has an exciting opportunity for an experienced, highly analytical, and commercial savvy Sales Finance Manager. In addition to leading a small team of analysts, you will be a vital partner for Apple Canada’s Sales, Finance, Marketing, and Operations teams and serve as an outstanding cross-functional bridge builder. This position will also entail influential partnership with Worldwide and Geo Sales Finance teams across the rest of Apple. Join Apple, and help us leave the world better than we found it!", "description": "Lead Apple Canada’s revenue forecast to drive corresponding business planning and initiatives; assess how product and market dynamics impact units, channel inventory, and ASP performance. Successfully conduct insight-rich review meetings with geo leadership to drive desired business outcomes. Lead the quarterly and annual planning cadence for revenue, as well as sales and marketing budgets. Evolve the systems and tools that drive insight quality and streamline the team’s reporting and workflow. Lead and manage a team of Finance analysts across a range of experience and knowledge.", "key_qualifications": "", "preferred_qualifications": "10+ years of meaningful experience motivating and developing analysts in a high-performance, fast-paced organization\nPassion and thought leadership for innovating on process and optimization, whilst understanding the importance of key financial controls\nAdept at creative problem solving and recommending judgement in potentially ambiguous situations\nHigh intellectual curiosity and learning agility, with the passion to delve deeper into data to produce an enriched level of understanding\nExtensive experience developing and presenting written reports and business proposals to internal partners and executive leadership\nMBA or other relevant advanced business degree", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553060"}