{"title": "Database Engineer - Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content in a brand-safe environment, while supporting publishers and journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with captivated audiences. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone. The Database Solutions team under Ad Platforms at Apple is drives database technologies selection, standards, patterns, and optimization to ensure the reliability, availability, performance, and efficiency of databases at scale. The team partners closely with Ads engineering and other SRE and infrastructure teams to enable delivering product objectives via design, configuration, and maintenance of a fleet of databases that supports the Ad Platforms applications. We are looking for Database Engineer candidates who will contribute to architecture and design solutions for multiple database technologies including Oracle, Postgres, and MySQL —both on-premises and in AWS, and will provide exceptional support for fast-paced, sophisticated distributed database production and non-production environments supporting OLTP and OLAP systems.", "description": "Take ownership of fast-paced, complex, and distributed database environments (200+ Oracle, Aurora Postgres, and Aurora MySQL databases) supporting OLTP and OLAP systems across on-premises and AWS. Design, build, and continuously maintain high performance and highly available database and change data capture infrastructure. Migrate mission-critical database applications leveraging on-prem Oracle to using AWS Aurora Postgres. Work closely with development engineering teams in advancing their strategic initiatives, operational readiness, engineering standards, designs, and performance. Support various database maintenance activities like database upgrades, patch management, user management, and backup and recovery. Setup and maintain Oracle GoldenGate Active-Active environments for databases and Big Data. Configure Oracle Data Guard and RAC for high availability and implement zero data loss solutions. Implement infrastructure automation and scripting using tools like Shell, Python and Terraform. Troubleshoot and resolve database performance issues and tune SQL queries proficiently. Database on-call for production and non-production during US hours as part of a 12x7 rotation.", "key_qualifications": " ", "preferred_qualifications": "Graduate degree in Computer Science or equivalent field, Ad-Tech work experience, Experience with NOSQL technologies, Current AWS certifications", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548379"}