{"title": "Developer Engagement Workflow Product Manager", "summary": "At Apple, we build products that enrich people’s lives. The Tools and Frameworks group enables developers inside and outside of Apple to build amazing products and platforms using Xcode, Xcode Cloud and more! The Developer Engagement team’s Workflow Product Managers are responsible for understanding how developers complete their work daily using a variety of products. The Developer Engagement Workflow Manager focuses specifically on testing workflows and looks to improve the ability for engineers and QA to test their code.", "description": "-  Ownership of the end-to-end testing workflow product\n-  Understand, influence, and coordinate the roadmaps for all products that support the testing workflow product at Apple\n-  Deeply understand the way Apple engineers test their code and what problems they encounter when testing, including the use of devices\n-  Stay current with the latest testing and general software development techniques and methodologies from outside of Apple\n-  Build collaborative relationships with the product owners, designers, engineers, and stakeholders developing our testing tools and frameworks\n-  Collect and synthesize feedback from all channels including Research, Metrics, Support, Field Engineering, Account Managers, and direct interaction with users.\n-  Collaborate with Researchers to discover and document the testing workflows of engineers at Apple\n-  Establish and supervise key metrics related to the test workflows and the use of testing tools and frameworks across Apple\n-  Regularly present testing feedback, insights, and strategy to Apple leadership", "key_qualifications": "10+ years in software development with 5+ in Product Management.\nExpertise in modern Product Management methodologies\nStrong metrics and data analysis skills\nExperience influencing partners and roadmaps without direct authority\nCollaborative working relationship with engineers, designers, and account managers\nExcellent writing and presentation skills", "preferred_qualifications": "", "education_experience": "BA/BS or MA/MS in related field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517270"}