{"title": "NPI Operations Program Manager - iPad", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries...", "description": "-Leads Apple and Original Equipment Manufacturer (OEM) operations team in planning and executing development builds and new product ramps. -Drives Ramp readiness with Engineering, Operations and OEM teams. -Communicates requirements and schedules to facilitate technical readiness with supply chain teams. -Influences product manufacturability, testability, and supply chain responsiveness in pursuit of low cost and flexibility while stewarding quality. -Manages communications, upward and downward through the organization; raising key issues and options for resolution with executive teams.", "key_qualifications": "", "preferred_qualifications": "Results oriented with a bias for action and a strong attention to detail. Strong interpersonal skills and ability to present to management. Ability to travel up to 25-30%. Technical expertise and prior OEM management experience. Masters or MBA are considered a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559316"}