{"title": "Salesforce Platform Administrator, Partner Solutions and Tech", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We are implementing a world class Sales CRM system based on Salesforce. Apple’s Partner Solution & Technology group is looking for an experienced Platform Administrator to champion innovation and leverage deep and cutting-edge Salesforce expertise. You will be operationalizing global Salesforce ecosystem that will transform and catapult our Sales organization into the 21st century. You will work with amazing colleagues who have real passion for our products and our customers; and, through this program, you will be running enterprise scale Salesforce platform that enables our Sales teams to bring our world-class products, directly and indirectly, to our customers.", "description": "Be ready to make something great when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. You will work in a highly collaborative team environment with Release Manager, Technical Architects, DevOps Lead and other Salesforce Business Admins to serve as the primary system administrator for the day-to-day support, maintenance and improvement of Salesforce environments.  The role requires a combination of program management, deep technical administration background, and ability to build reciprocal relationships across various teams. Of course, strong operational fundamentals and burning desire to learn and excel are expected, but you have more: Be the main point of contact for the Salesforce Customer Success team. Establish, monitor and drive action planning and execution for production org performance and health metrics Lead the security in production and full sandboxes to align with organization’s security and compliance requirements. This includes enabling and monitoring SSO and BYOK, access reviews, security settings and implement additional security measures if necessary. Explore and test new platform specific features as part of Salesforce product release upgrades Manage installation of the AppExchange apps in Production and on full SandBoxes Handle storage, system clean up and data archiving  Build and maintain the technical guidelines and documentation at the platform level including metadata dictionary Assist in analysis of Salesforce license usage and cost optimization Assist DevOps in establishing business continuity planning and help in implementing system backup and recovery processes Assist DevOps in release deployment process and sandbox management Assist in troubleshooting issues related to Salesforce platform in the areas of security, performance, access and user administration especially the ones with elevated access Coordinate with the Admins and Developers and grow the Salesforce skills across the organization. Integrity is everything to you. You handle risk and manage trade-offs openly and transparently.", "key_qualifications": "2+ years of experience in administering or supporting Salesforce cloud environments Demonstrate knowledge in Salesforce platform-specific administration, security, metadata management, and exposure to Salesforce DX and equivalent tools Salesforce Administrator, App Builder or Platform Developer Certification is a plus Continually stay up to date with new Salesforce technology and related operational processes Positive relationship and facilitation skills both within diverse engineering and global cross-functional organizations Highly driven, results-focused achiever with creative problem solving and critical thinking abilities who can encourage action and collaboration Highly organized with a laser focus on even the smallest details Demonstrate ability to communicate effectively verbally and in writing with all levels of organization.", "preferred_qualifications": "", "education_experience": "BA/BS Degree plus 2+ years relevant experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528181"}