{"title": "Information Systems and Technology Internship Program", "summary": "The Information Systems & Technology (IS&T) organization produces key business and technical infrastructure at Apple handling orders from the online store, building applications that improve the retail store experience, providing network bandwidth for our services around the world, processing every transaction in iTunes, and closing the books. We do it all. If you are a born problem solver who enjoys collaborating on the next big thing, we may just have your dream job. From Apple ID to the Apple website to our data centers around the globe, IS&T manages the massive systems and services that so many rely on. They also build the custom tools that empower our employees to tackle problems on their own. And that means these engineers are free to do what engineers do best—explore all of technology’s possibilities.", "description": "The internship provides opportunities across many different teams, ranging from special projects for new business initiatives to operations in a rapidly growing and dynamic setting. Interns benefit from a combination of training and on-the-job work experience. A FEW OF THE POSITIONS AVAILABLE TO YOU: - A range of Software Engineering positions such as application development, front-end, back-end, and full-stack - Engineering Project Management - UX Designer A sampling of the teams you could work on are: Software engineering positions developing consumer and/or enterprise facing applications using various modern tools, platforms, and approaches, covering front-end, back-end, and full-stack. Teams include: Cloud, Retail Engineering, New Technologies, HCI & User Experience, Machine Learning, Mobile Apps, Infrastructure Engineering, Retail Engineering, Sales and Marketing Systems, Business Analytics EARLY CAREER ROTATIONAL PROGRAM High-performing interns will be eligible for full-time offers into IS&T’s Early Career Rotational Program (ECRP). ECRP is an 18-month rotational program that offers recent college graduates the skills, knowledge, and experience needed to succeed in their early careers. Upon completion of the program, you will join one of your rotational teams full time to continue your development journey.", "key_qualifications": "Excellent quantitative and interpersonal skills, Programming experience in at least one of the following areas: application development (Objective-C, Swift), Web development (JavaScript, HTML, CSS3), Server-side development (Java, Python), Basic programming knowledge developing for devices running on Apple’s operating system and/or cloud native solutions for consumer and/or enterprise facing applications (Python, Go), Leadership experience, Related internship experience, Graduating in year 2025", "preferred_qualifications": "", "education_experience": "Pursuing an undergraduate or graduate degree in computer science, electrical engineering, computer engineering, data science, design, and other related fields of study.", "additional_requirements": "We promote innovation and new technology to further improve our creative output. Dynamic, smart people and inspiring, innovative technologies are the norm here. You will be part of building an extraordinary search team. We're looking for a talented and hard-working person to join this amazing team, if you feel this is you, we'd love to hear from you. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200506072"}