{"title": "Silicon Validation Engineer - RF mmW Test", "summary": "Would you like to join Apple’s growing mmW and cellular wireless design team? Our team is responsible for all aspects of mmW and cellular silicon development with a particular emphasis on highly integrated and efficient designs and technologies that transform the user experience at the product level! As an RF/mmW test engineer, you will be at the center of the wireless system characterization effort within a team responsible for crafting and productizing state-of-the-art wireless communication devices! In this role, you will be involved in the bringup and characterization of the RF and cellular SoC. You will build and implement test plans to meet project schedule and metric requirements, including coverage metrics.", "description": "Conduct bench test, debug, and characterization of RF SoC IPs, including transmitters, receivers, PLL, and power amplifiers. Perform and collaborate on bring up, system integration, and optimization of wireless SoCs and RF evaluation boards and interfaces. Perform conducted and radiated RF measurements of devices and systems. Work with design engineers to develop test plans, analyze and review test data, and generate test and specification compliance reports. Research and develop sophisticated calibration and measurement techniques. Evaluate test equipment, and develop and calibrate test fixtures and setups. Automate repetitive measurements using standard scripting languages. Generate test logs and scripts for ATE test programs, and develop DC and RF trim procedures for ATE and bench. Perform bench, ATE, and simulation data correlation.", "key_qualifications": "The ideal candidate will have 3+ years of RF and/or mmW characterization experience in communication system on chips, transceivers, and RF front-end ICs. Strong RF background and familiarity with RF systems fundamentals. Hands-on experience with RF test equipment (vector network analyzer, vector signal analyzer, vector signal generator, signal source analyzer, oscilloscope, etc). Experience in end-to-end RF measurements (i.e. Noise Figure, Linearity, EVM, Phase Noise, etc.) and block-level debugging. Bench automation experience and proficiency with automation tools and scripting languages, such as Python. Good understanding of radio system flows of RX AGC, TX power control, PLL lock tracking, trim and calibration procedures etc. Good understanding of board schematic and layout, experience in defining board requirements. Prior experience supporting ATE engineers and facilitating mass production will be a plus. Excellent ability to collaborate with different teams (IC design, RF systems, test and production engineering etc.). Good written and verbal communication.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years of relevant industry experience is required. MSEE or Ph.D. in Electrical Engineering or equivalent would be a plus.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549166"}