{"title": "CPU Physical Electrical Analysis Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! As a CPU Physical Electrical Analysis Engineer, you will be driving the block and top level analysis of high-performance processor projects in the EMIR/SIGEM/Reliability spheres.", "description": "-  Drive block and top-level EMIR/electrical verification closure\n-  Work on power grid design, construction, and implementation using existing infrastructures and where necessary, creating custom solutions in PNR tool environment\n-  Work multi-functionally with CAD/EDA vendors to ensure fidelity of analysis results; with methodology teams to cover unique use cases; with implementation teams to drive design and sign-off closure, and with the SOC level teams to meet IP delivery quality and schedule", "key_qualifications": "", "preferred_qualifications": "Knowledge of industry standard concepts related to silicon level power delivery, electromigration, and IR drop analysis\nAcademic training in electrical and computer engineering and ability to understand design and architecture of high performance, low power designs and digital circuits as well as strong scripting and programming skills\nProduce impactful design fixes and automate wherever possible, spanning multiple tool domains in physical construction and analysis\nUnderstanding of general VLSI design concepts related to PNR implementation, layout tools, verification, and STA\nStrong communication and presentation skills to regularly summarize the state of the design and drive design convergence across multiple blocks and teams in a timely fashion", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560641"}