{"title": "International Compliance Lead, Apple TV App", "summary": "The people who work at Apple have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. And more recently have launched truly innovative services with Apple News+, Apple Arcade and Apple TV+. We are deeply passionate about apps, music, movies, TV shows, and books. It’s a force that drives and inspires every one of us every single day. The passion for innovation that goes into our products applies to our practices as well, strengthening our dedication to leave the world better than we found it. \n\nCome and join the Global Video team who is responsible for the Apple TV app including Apple TV+, transactional movies and TV, native channels and federated video apps. We are paving the way for the future of entertainment and have set new standards in streaming with Apple TV+. Our team is responsible for Apple’s video business, driving overall revenue as well as subscriber growth for Apple TV+, curating and managing the app experience, programming and editorialising while striving to acquire engage and retain subscribers for Apple TV+ and our partners.\n\nApple is looking for a Business Compliance Lead to manage video compliance activities across international markets, ensuring that Apple anticipates and meets all relevant financial and content obligations for TV App.", "description": "- Initiate and lead cross-functional discussions with leaders and teams across Apple to drive compliance projects, secure alignment on needs and ensure legal obligations are met.\n- Collaborate closely with Legal, Government Affairs and Business to understand ever-changing compliance landscape and anticipate requirements.\n- Ensure Apple meets all financial requirements, through tracking revenue forecasts and investments, partnering with legal and business affairs to ensure deals are structured appropriately.\n- Evaluate options for meeting quota and investment obligations and use creative approaches to devise innovative and fit for purpose solutions.\n- Prepare materials for engagement with relevant regulatory bodies, such as Coimisiún na Meán.\n- Partner with operations team in order to receive appropriate reporting and data, ensuring we have the right tools to provide required reporting and the right level of visibility. \n- Build a sustainable and scalable model for ongoing compliance with standard methodologies and reporting obligations, and helps drive adoption of them internally.\n- Facilitate provision of timely and accurate reporting to regulatory bodies, managing certification process where required.", "key_qualifications": "", "preferred_qualifications": "Significant professional experience of working in the media entertainment industry\nWorking knowledge of AVMS and other international video regulatory requirements\nSpoken French and/or another European language is ideal\nKnowledge of Apple tools: Numbers, Keynote and Pages", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556675"}