{"title": "Software Engineer (UI) - Applications & Tools, Ai & Data Platforms", "summary": "Imagine what you could do here. At Apple, we believe new insights have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Developer Experience Platform team is looking for an extraordinary Software engineer to join our team. You will help design, implement various developer front end tools to build our next gen developer experience platform and accelerate app development inside Apple.", "description": "Our Developer Experience Platform team provides frameworks, services and developer tools to internal engineering teams in Apple to accelerate their SDLC. We are working on a Generative AI based developer experience platform for internal use and assist our app development team. You will collaborate with Machine Learning engineers, Software engineers, and other data scientists to deliver an end to end AI enabled solution for this platform. This is a hands-on role for developing and supporting new and existing features. This role requires partnering with cross-functional teams to effectively coordinate the complex interdependencies inherent in application development. A successful candidate has strong technical skills and is eager to create intuitive user experiences; they have a keen eye for the details that surprise and delight our customers.", "key_qualifications": "No information available", "preferred_qualifications": "Familiarity with Retrieval-Augmented Generation (RAG), Vector Datastores, Large Language Models (LLMs), and LangChain or Llama-index. BS or MS in Computer Science or relevant proven experience is preferred. Additional programming language experience such as Java, Node.js Python is a bonus", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554100"}