{"title": "Product Design Engineering Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. The Vision Product Group (VPG) is actively seeking for new team members of in-region Product Design Engineering Program Management (PD EPM). As a key player in our team, you will embrace challenges, work across multiple programs, and contribute to the exciting new product development happening at Apple You will collaborate closely with both in-region and US-based EPM/PDs, as well as with EE, RF, reliability, operations, contract manufacturing, and vendor partners. Your primary focus will be on overseeing PD-related activities, issues, and risks throughout our engineering development cycles to ensure the delivery of exceptional Apple products.", "description": "-  Collaborate closely with Product Design (PD) to drive Design of Experiments (DOEs) in the factory. Utilize CM's PD expertise to develop detailed DOE plans and coordinate all cross-functional teams for seamless DOE execution. Collect DOE data, perform initial level analyses, and communicate findings promptly\n-  Act as a liaison between Apple and vendor PDs, addressing online issues during the build process. Implement corrective actions in the factory to prevent further problems\n-  Closely monitor the New Product Introduction (NPI) build status and coordinate urgent changes with PD, EPM, and the factory\n-  In partnership with US counterpart, maintain build matrix and oversee daily build activities for critical enclosure parts\n-  Additionally, assist in PD lab management and maintain essential procurement process", "key_qualifications": "", "preferred_qualifications": "Deep experience in consumable electrical products, with a track record of success\nProven expertise in OEM/ODM vendor management, with the ability to foster strong partnerships and drive schedule, quality, cost optimization\nProficiency in mechanical-related failure analysis, enabling effective root cause identification and corrective actions", "education_experience": "Bachelor’s degree in Mechanical Engineering or three years of equivalent experience\nProficiency in both Mandarin and English\nWillingness to travel up to 50% domestically and 10% internationally", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559409"}