{"title": "Experience Strategy Director, Marcom Interactive", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. The Experience Strategy Director partners with group leaders for Production and Technology. They lead an extraordinary team of Experience Strategist and Experience Designers as they craft digital activations across online and in-store environments.", "description": "Just as each detail of an Apple product is deeply considered, the Experience Strategy Director obsesses over every word, design detail, and connection point to improve and upgrade the customer experience on Apple owned and partner digital platforms. They collaborate with the world’s best creative and strategic minds across multiple Marcom teams to deliver products that live up to Apple standards. As a member of the Interactive Experiences Leadership team, they partner closely with key Apple leaders and stakeholders on the strategy that guides products for this year and for years to come. - Work with key partners and disciplines to develop a comprehensive understanding of the target audience, market trends, and business goals to shape the experience strategy and create cohesion throughout the strategy and design process. - Partner with data, research and business teams to conduct user research, gather insights, and translate them into actionable design strategies, measuring effectiveness and iterating accordingly - Evaluate concepts, provide creative direction and strategic partnership to product teams, and pitch in to help with work when needed. - Evolve internal processes and practices to lead towards more efficient, effective and innovative work across teams - Mentor and develop team members, providing guidance on best practices and professional growth. - Foster a culture of continuous learning and improvement within the team. - Lead with passion, integrity, and a commitment to excellence in all aspects of work.", "key_qualifications": "Must have a creative portfolio or work samples. At least 15 years of digital product industry experience within a creative-focused digital agency, in-house product team or a product development company. At least 5 years of management experience leading a diverse team of creative and strategic talent", "preferred_qualifications": "A diverse portfolio of integrated digital product work, with a focus or in-depth experience in digital commerce and retail environments. Expertise driving strategic alignment, prioritization and requirement gathering with a diverse range of business partners. Has led teams through the development of personas, journey maps, and other key artifacts to help shape and guide product development. Ability to craft compelling narratives and presentations to engage stakeholders and drive alignment. Ability to shape and drive organizational change across teams. Inquisitive in pursuit of excellence with a passion for learning.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $255,400 and $408,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558021"}