{"title": "SoC Engineering Program Manager", "summary": "At Apple, we strive to deliver amazing audio experiences that enhance the use of our products...", "description": "In this role, you will be part of the Software Engineering organization program office, but be focussed on the day-to-day activities associated with the pre-silicon development process...", "key_qualifications": "Excellent technical leadership and project management skills. Proven exposure to and familiarity with silicon chip technology. Familiarity with or a passion for digital and analog audio technology and products. Strong written and verbal communication skills. Ability to multi-task and context switch with ease in a fast-paced engineering environment. Comfortable scaling from in-the-moment technical details to multi-year long-term planning. Able to establish and grow quality, trust-based relationships with your engineering partners, software developers, and EPM colleagues. Ability to lead projects and teams with confidence and ease. Experienced in presentations ranging from weekly Team meetings to Executive-level reviews. An innate desire to grow, learn, and continually improve processes, methodologies, and adopt new tools and techniques to further Apple’s quest to deliver superior audio features to market.", "preferred_qualifications": "", "education_experience": "BS/MS (EE/CS/CE a plus)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519569"}