{"title": "Channel Insights Manager (12 months contract)", "summary": "Apple ignited the personal computer revolution in the 1970s with the Apple II and reinvented the personal computer in the 1980s with the Macintosh. Today, Apple continues to lead the industry in innovation with its award-winning computers, operating systems, smart phones, and tablet computers. This is made possible because we value the “Think Different” philosophy. Make a difference.  The Pacific Reseller Operations (PAC RO) is the key operations liaison with Apple’s Reseller Partners and works with our partners to ensure that the supply chain run as efficiently as possible, in order to maximise sell through across the fastest growing region globally. Join us as we blaze new grounds and grow our footprint.", "description": "This role is a senior individual contributor position for a driven individual to utilise their business insight, enhance process knowledge, and apply analytical skills to deliver creative, valuable solutions to the PAC RO team.    YOU WILL:  - Become the business analytics expert for the RO team  - Play a leadership role in the standardisation of account deliverables and ensuring adherence to commitments  - Create a performance management system to integrate with the organisational scorecard  - Support the daily/weekly/monthly/quarterly business cadence  - Provide data driven models to support the decision making process  - Gather and disseminate information to internal customers needed to make decisions and drive the business  - Identify process improvement opportunities supported by trend analysis  - Gain agreement from partners to implement process and capability improvements  - Participate in cross-functional teams to address business or systems issues  - Partner closely across all reseller channels on key initiatives and analysis requirements", "key_qualifications": "Excellent data and statistical analysis skills, Superb listening, verbal, and written communication skills (including presentations), Comfort with ambiguity, Ability to deliver quality work to tight deadlines, Advanced Excel skills including use of macros, Aptitude for blending quantitative and qualitative data, Shown process improvement skills with natural curiosity and desire to understand how things work, Adept at comprehending and working with large quantities of data from a variety of sources, Detail oriented and self-motivated individual able to function effectively when working independently or in a team, Ability to maintain poise and a positive attitude in a challenging, dynamic, rapidly changing environment, Ability to build effective links in a cross-functional team environment, Ability to change the thinking of, or gain acceptance of, others in sensitive situations, Extensive experience in data mining and ad hoc analysis, Working experience in either Supply Demand Planning, Logistics or Inventory Management is preferred", "preferred_qualifications": "Experience with Business Objects, SAP or mySQL is preferred, Bachelor Degree's in related field, MBA is preferred, Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554870"}