{"title": "Cellular Data-Plane System Modeling Engineer (m/f/d)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. The Wireless Communication group at Apple is a rapidly growing, high energy, results-oriented team. We are looking for highly motivated and committed engineers to join our exciting team of innovators. In this role, you will be a key member of the cellular system engineering team, working on data-plane development and modeling.", "description": "In this role, you'll participate in data plane architecture design and modeling.  •You'll be responsible for end-to-end modeling, including HW components, FW, real-time constraints, and networking aspects. •You'll define coverage metrics and write test cases for both FW validation and HW verification. •You'll write automation, conversion, and code generation scripts.", "key_qualifications": "", "preferred_qualifications": "Ability to understand and supply to sophisticated simulation environments. Experience in low level Firmware and Firmware-Hardware interactions. Positive relationship spirit, respectful of diverse viewpoints, open to adapting ideas based on technical debates, sharing credit, passionate about getting the best out of collective thoughts for achieving common goals. Excellent written and verbal interpersonal skills. BS/MS in CS, EE, or related field and relevant validated experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560081"}