{"title": "Core Technologies Operations Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Operations Program Managers are pivotal to the dynamic development and launch of Apple’s products. A successful Operations Program Manager is a leader and facilitator, is driven, organised and detail oriented, excels in program/project management & communicates with ease at all levels. In this role, you will be responsible for operationalizing and scaling new products. Lead Apple's new product introduction efforts during ramp within the operations sphere. Specific goals include team leadership in driving issue resolution, supply chain design, schedule, cost, quality and availability. Engage with manufacturing partners to develop, ramp, and introduce products. Develop rapport with partners and detailed knowledge of \"how the factory works,\" its capabilities and limitations. Engage with vendor partners at all levels to lead issue resolution and operational readiness. Lead matrix team members from across all operations functions in Asia to develop new product plans and execute on operational scaling. Communicate project status updates to various project partners, including team members and executives within Apple. Synthesize a multitude of issues into a clear, concise, and focused message. Present with confidence and brevity. Always push the leading edge of innovation and excellence in Apple products and program management practices. Support coverage for other products in the region. Travel to another location on other products on an as-needed basis to drive issue resolution and/or support build/ramp activities.", "key_qualifications": "5+ years of program management experience Exceptional ability to build relationships, build cross-functional teams and exert effective influence in a matrix organization Operate in an ambiguous environment, taking charge, and having an attention to detail without becoming lost in the details Track record achieving significant results on sophisticated projects in an often ambiguous and always constantly evolving environment Experience in working with teams across geographies and cultures. Outstanding communication & interpersonal skills Incredible drive, motivation, and energy to completing any challenge given Ability to travel up to ~50% to various domestic / international destinations", "preferred_qualifications": "5+ years of experience in dealing with high volume manufacturing, either as a customer or manufacturer Ability to think strategically, while driving tactical program execution An Engineering Degree along with an MBA from a premier institute Apple is an equal opportunity employer that is committed to inclusion and diversity, and thus we treat all applicants fairly and equally. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554756"}