{"title": "SoC Silicon Reliability Engineer", "summary": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). Joining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product!", "description": "-  Drive SoC product, process and package qualification and reliability tests\n-  Drive Failure analysis during product or package qualification\n-  Experience applying JEDEC quality related standards, ISO and the science behind them.\n-  Must know reliability fail modes of silicon / packaging technologies and fail mechanisms with respect to reliability.\n-  Experience with reliability HW and Stress Pattern setups and equipment for life, environmental, ESD, Latch-Up testing\n-  Support PCN or ECN activities\n-  Implement on-going quality improvement processes working with the suppliers", "key_qualifications": "", "preferred_qualifications": "BS and a minimum of 10+ years of relevant industry experience\nDevice Reliability FA experience\nDriving foundries for process reliability issue", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555485"}