{"title": "Wireless Systems Validation Engineer – GNSS", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Our RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of Global Navigation Satellite System (GNSS) technology into Apple’s wireless products.", "description": "You will be responsible for validating & characterizing GNSS system performance towards industry conformance, carrier & use case requirements. Examples of activities you may be involved in are: - Carrying out validation and characterization GNSS test plans to meet industry, emissions and performance requirements - Bringing-up device-under-test, help define test requirements and implement test systems setups for validation preparedness - Tracking validation status; analyze results; communicate issues & insights from data - Performing failure analysis to understand low margin or failing behaviors making use of experimental SW/FW & modified development hardware and drive issues to closure - Collaborating with vendors, technology suppliers and cross-functional staff to optimize RF parametric performance - Supporting manufacturing tests of Apple products - Certification of Apple products", "key_qualifications": "Practical knowledge of GNSS Radio Frequency (RF) validation, Practical knowledge of GNSS standards like 3GPP & Carrier performance requirements, compliance requirements, and required testing methodologies, Knowledge of system level RF parametric and its sources in RF component characteristics and behavior, Hands-on experience with bench-level GNSS testing, debug at the module, reference board or system-level, Experience using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.), Experience in conducted-level debug of GNSS systems is a plus, Strong written and verbal communication skills", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509704"}