{"title": "Cloud Engineering Architect, Employee Experience & Productivity", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. A passion for product ownership and track record will prove critical to success on our team. Be ready to make something extraordinary when here. Multifaceted, encouraging people and innovative, industry-defining technologies are the norm at Apple.", "description": "We are seeking a skilled Cloud Engineering Architect to join the Apple TV+ Production Technology group. This role involves leading the design and implementation of cloud-based projects and systems, catering to the dynamic needs of our production clients and internal business units. The ideal candidate will thrive in a fast-paced environment, delivering robust architecture solutions while maintaining a strong focus on infrastructure reliability and scalability. Excellent communication skills are essential as you will collaborate with diverse teams and stakeholders across the organization.", "key_qualifications": "3+ years of experience in cloud infrastructure engineering, with a strong focus on GCP and AWS.\n3+ years designing, building, and maintaining complex cloud infrastructure solutions.\n2+ years of experience with containerization technologies such as Docker and Kubernetes.\nEducation: Associates’s degree in a related field or equivalent industry experience.", "preferred_qualifications": "Lead the architecture design and implementation of cloud-based projects using GCP and AWS, with a preference for experience in post-production environments.\nDesign, build, and maintain complex cloud infrastructure solutions, ensuring high availability, security, and scalability.\nCollaborate closely with production clients, internal business units, and executive stakeholders to understand requirements and deliver effective solutions.\nUtilize infrastructure-as-code tools such as Terraform, CloudFormation, and Deployment Manager to automate provisioning and deployment processes.\nImplement and manage containerization technologies including Docker and Kubernetes to support microservices architecture.\nEnsure network configurations and troubleshooting of network services are performed effectively, maintaining optimal performance and reliability.\nImplement security best practices and utilize security tools such as IAM, Security Groups, and VPCs to secure cloud environments.\nStay updated with industry trends and advancements in cloud technologies to drive innovation and efficiency within the organization.\nExperience with infrastructure-as-code tools such as Terraform, CloudFormation, and Deployment Manager.\nStrong understanding of networking concepts and experience with configuring and troubleshooting network services.\nFamiliarity with security best practices and experience with security tools such as IAM, Security Groups, and VPCs.\nExcellent written and verbal communication skills, with the ability to interact effectively with technical teams and executive stakeholders.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,100 and $178,600, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558242"}