{"title": "Digital Human Look Development Artist", "summary": "Apple's Synthetic Data Group provides content for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We are looking for a world-class character look development artist to help us achieve the highest levels of photorealism in our digital human content. The ideal candidate will flourish in a fast-paced, dynamic research environment while continually improving quality and reusability. Contribute to generation of synthetic data used to develop software solutions which will enable Apple’s next generation products.", "description": "Leverage your experience in character look development to model, groom, create shaders and materials that will generalize to a diverse range of photorealistic digital human content. You will work in a cross-functional team providing synthetic data to develop innovative computer vision and machine learning algorithms.", "key_qualifications": "7+ years experience working with techniques and technologies for CG rendering and character look development in feature film, VFX, and/or games\nExcellent ability to discern and manipulate light, shade, color, and intricate details to create physically-based, photorealistic material models\nExtensive knowledge and experience on creating photorealistic digital humans, including modeling, look dev, body and facial rigging, cloth, and hair\nExpertise in Maya with crafting advanced shading networks for the creation of photorealistic, physically-based materials\nHighly proficient in painting 2d textures in Photoshop, and 3D texture painting in Mari, Substance 3D painter, and/or ZBrush\nSolid understanding working with V-Ray or other ray trace renderers\nAbility to scale work to large numbers of diverse digital content while maintaining quality\nExcellent communication and collaboration skills", "preferred_qualifications": "", "education_experience": "BA/BFA in Digital Media/Visual Effects/Animation or equivalent industry experience", "additional_requirements": "Please Provide portfolio of your work.\nDeveloping synthetic data content for machine learning, and computer vision is a big bonus\nPython scripting is beneficial\nFamiliarity with photogrammetry\nSelf managed, self motivated, and able to learn new pipeline and procedures\nExperience working with external art teams and outsource vendors\nStrong leadership and mentoring abilities and interpersonal skills\nAbility to find creative solutions for technically challenging tasks\nExposure to Agile development methodologies", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538655"}