{"title": "Software Development Engineer in Test - IS&T", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. The people here at Apple don't just craft products - they build the kind of wonder that's revolutionised entire industries!. It's the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s IS&T team is looking for a passionate Software Quality Engineer to contribute to design, analysis and certification of our applications. We are looking for someone who is equally passionate about quality and using lightweight processes to consistently achieve it. The role would also involve interacting with multi-functional engineering and product teams to test features, perform root cause analysis, and drive the quality of customer's experience.", "description": "In this role, you will be involved in quality engineering for critical customer facing applications , work in a fast-paced, dynamic environment and be directly responsible for: - The quality of Apple’s products, including consistent functionality, performance, and stability. - Understanding new and existing feature implementations in order to craft informed, robust testing charters. - Authoring test scenarios, scripts, and plans. - Executing functional, performance, and stability testing. - Write and review automation test scripts. - Identifying and reporting defects, inclusive of first-level root cause analysis and consistent steps to reproduce. - Championing quality efforts beyond test execution, including collaborating with test automation engineering teams, product management teams, and engineering program teams.", "key_qualifications": "1 to 8 years experience in software quality assurance testing. Good knowledge of automation framework architecture, design and development. Strong hands-on engineering Experience working with Java, Python, Swift or any other OO languages. Expertise in QE processes, tools and metrics. Experience in testing API/Web Service, Web and iOS native applications. Hands-on experience on Core Java, Karate, RestAssured, Playwright/Selenium, Appium/XCUI. Experience in Maven/Gradle and Git repositories is required. Experience working in Agile development environment. Solid understanding of software build tools, CI/CD integrations, deployment process and code quality checking tools. Understands logs scanning to identify the errors and root cause. Proven track record to deliver high-quality work on tight schedules. Ability to work in a fast-paced environment with frequent context switching. Hunger to learn and explore new technologies which will optimise the existing technologies. Self-motivated, independent and proactive. Outstanding collaboration and organisational skills. Excellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science or equivalent experience", "additional_requirements": "-  Hands on experience with Load, Resiliency & Performance testing. Exposure to Jmeter/Gatling/Locust performance testing framework. -  Experience with Testing of AI/ML applications, security and accessibility testing is good to have. -  Experience in cloud technologies such as AWS/GCP and containerisation technologies such as Docker is good to have. -  Experience with automation for iPhone/Mac platform is a plus", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539849"}