{"title": "NPI Test Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. With the explosive growth of iPhone business we are creating new opportunities for individuals to work on the most exciting new products at Apple. We are seeking an individual with strong Test Engineering skills. You will be based in India and will have an active engagement with the hardware and Software Design and Operations teams in Apple.", "description": "We expect the qualified candidate to perform assignments in several of the following manufacturing engineering functions: - Design for Testability - Provide early and on going manufacturing involvement to ensure new products are being tested in a logical and cost-effective manner incorporating FMEA, product design targets using the Engineering Requirements Specification (ERS). - Product Life Cycle Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering with respect to technically complex testing methods, procedures and failure analysis. - Test Process Engineering - Designs and develops technically test processes to improve quality and efficiency. Apply statistical tools (such as GR&R, SPC and Cp/pCk) to ensure processes/fixtures are scalable and are continuing to perform properly once qualified leveraging integration with factory data systems and shop floor systems - Failure/Data Analysis - Plans, develops and implements procedures for the testing and evaluation of soon to be released products. Specifies test to be performed, compiles data, and makes recommendations for test or tester design changes. This will include the use of Design of Experiments (DOE) - Develop new and or improved processes through the application of theoretical and practical engineering - Stays on top of all relevant technical trends and developments and incorporates them in appropriate assignments - Provide direction and mentorship to third party vendors/automation suppliers and/or CM’s; be the technical leader and driver on owned projects; serve as a technical resource to other engineering groups and project leaders - Drive failure analysis and machine issue resolution when working with tester suppliers and contract manufacturers - Prepare and present concise Test Engineering program status updates to the Exec team on a weekly basis.", "key_qualifications": "We are looking for someone with the following qualifications: 4+ years of work experience in any of assembly, inspection, test station design, test development, maintenance, and / or automation equipment. Required to understand, plan development builds and mass production with factories worldwide. Experienced in working with multi-functional teams such as hardware design, system teams, capital equipment, quality, and process engineering. Knowledgeable in crafting tester qualification requirements including calibration, correlation, capability, repeatability and reproducibility, design of experiments, and failure analysis. Able to communicate effectively in a worldwide environment.", "preferred_qualifications": "", "education_experience": "BSc in Electronics/Electrical, Computer Science - Engineering, or Physics, MSc/Phd preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509719"}