{"title": "Hardware Comms Lead, Global Channel Cross-Functional Marketing Communications", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. The Channel Cross-Functional Communications team within Marcom is responsible for comms going into Apple’s indirect routes to market in support of Apple’s channel business unit, including: new product introductions (NPI), always-on comms across audience types, and geo-origination work for Apple’s hardware and services. The team defines go-to-market strategies, ensures alignment with key partners, oversees the cross-functional creation and delivery of the work, and learns, innovates and evolves the work and how we make it. The Hardware Comms Lead, Channel Cross-Functional Marketing Communications role is responsible for supporting all hardware communications, leading an incredible team responsible for individual products.", "description": "Define Channel marketing roadmap and go-to-market strategy across hardware products. Translate marketing, business, and partner objectives into strategic plans across the entire customer journey and audiences through annual and quarterly planning, deliverable prioritization, creative brief development, and ongoing plan of record documentation and updates for each product. Serve as central point of contact for all Channel-related communications. Closely collaborate with an extraordinary team of strategists, brand managers, producers, creatives, production, partner communications, marketing ops, sales, product marketing, and other partners to plan, create, and deliver exceptional work that drives the business. Act as a Channel evangelists and subject matter expert. Remove barriers and help teams to build outstanding and effective work by providing channel context and insights throughout the creative process. Oversee the flawless execution of amazing creative. Support the creation of marketing guidelines and documentation, brief and ready relevant teams and develop positive relationships with our geo teams to bring the work to life for customers globally. Lead a hard-working team. Develop and mentor talent. Build a culture of collaboration on the team and with other teams at WW and across the world in the geos. Be known as strategic, collaborative, inspiring, and reliable. Identify and champion new work and ways of working. As you’ll work across a breadth of products and creative functions you’ll be well positioned to help Marcom evolve what we make, and how we make it, partnering with functional experts to move things forward as the product roadmap, channel/partner landscape, marketing strategies, and business needs evolve.", "key_qualifications": " ", "preferred_qualifications": "A well-rounded marketer with the ability to see the big pictures and be hands on in the details. Use good judgement to prioritize and make effective decisions based on the goals of the organization, but you can also get into the weeds and prove out your ideas through decks and other internal communications you make on your own. A strong team leader. With a track record of building successful teams, developing talent to meet both their career goals and the organization’s goals, and optimizing how the team works, so they are effective, efficient, and scale to meet the needs of the business. Strong communication, collaboration, and interpersonal skills. Encourage, inspire, and influence others to work together to move things forward, giving a voice to the best ideas and ensuring others focus on what matters. You can adapt your communications to convey a clear understanding of the unique needs of different audiences, from junior producers to senior executives. Related background and experiences. Including working with large, global brands across a range of marketing touchpoints, a bachelor’s degree or equivalent experience in a related field, and 10-20+ years of relevant marketing and communications experience at a global brand and/or creative agency.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $185,800 and $334,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555484"}