{"title": "SE-Specialist", "summary": "I din roll som specialist bidrar du till att skapa passion och intresse för våra produkter genom att erbjuda kunderna rätt lösningar och sätta produkterna i deras händer. Du förstår att Apple Store strävar efter att ge besökarna en unik kundupplevelse. Du börjar med att ta reda på kundernas behov, för att sedan tillsammans med dina medarbetare presentera de produkter som matchar behoven. Varje dag har du chansen att omvandla någon av besökarna i butiken till en stamkund. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa.\n\nDet finns både heltids- och deltidsjobb.", "description": "Som Specialist har du fantastisk förmåga att upptäcka kundernas behov och hitta de bästa lösningarna. Du är inte bara den första personen kunderna möter i butiken – du är också den som vägleder dem, säljer produkter och tjänster och hjälper dem att komma igång med sina nya produkter. Du utför också andra uppgifter i butiken, som att underhålla visuellt marknadsföringsmaterial och hjälpa dina kollegor. Du är nyfiken, har koll på de senaste nyheterna om olika produkter och initiativ och är redo att omsätta dina kunskaper i praktiken i dina möten med kunderna. Din framgång mäts i dina prestationer, såväl enskilda som i samarbete med andra, samt utifrån butikens övergripande resultat. Du är stolt över att få vara Apples ansikte utåt och tycker om att hjälpa kunderna att utveckla långvariga relationer till Apple.", "key_qualifications": "", "preferred_qualifications": "Förmåga att erbjuda en fantastisk kundupplevelse i en väldigt aktiv miljö och att stimuleras av mötet med kunderna.\nStort teknikintresse, särskilt i fråga om Apples produkter, och förmåga att snabbt ta in ny kunskap om produkter och funktioner.\nGod kommunikationsförmåga – du pratar ledigt och avslappnat både med enskilda kunder och inför mindre grupper.\nBidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra.\nFörverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet.\nDu brinner för Apple och vill gärna dela med dig av din passion till andra.\nDu är redo att lära dig allt om och erbjuda Apples unika kundservice.\nDu har stor social förmåga, är tillmötesgående, förstående och bra på att lyssna.\nDu talar det lokala språket flytande.\nDu kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535024"}