{"title": "Lead - Apple Retail", "summary": "The Lead helps prepare the team to deliver exceptional customer experiences. They assist the leadership team with day-to-day responsibilities and ensure operational readiness and sustainability. This position is a great opportunity to learn the fundamentals of operating an Apple Store.", "description": "Lead and encourage customer engagement, drive sales and awareness of Apple’s value proposition for business, and build loyalty. Maintain efficient and positive customer journey through identifying obstacles, making strategic adjustments, and anticipating potential process changes. Develop strategies with the Shopping Experience Manager to increase access to customers, reduce customer wait times, and meet customer demand. Review and assess store reporting and customer feedback daily and share with the leadership team to make adjustments, recognize successes and find opportunities for improvement in key areas in the Shopping Experience. Be a resource to identify training opportunities for team members and partner with Shopping Experience Manager to suggest plans for skill improvement. Be an early adopter and change agent for new products and services, our ecosystem, and company initiatives in-store and online. Be a role model and mentor others in the Shopping Experience by driving sales, maintaining up-to-date product & service knowledge, purchasing options - including financing and carrier offers through the Apple Steps of Service. Energize, inform, and align store employees around store performance goals and communications. Address time-sensitive employee feedback, questions, and concerns and escalate to store leadership as appropriate. Recommend daily staffing and scheduling to the store leadership team to align with changing customer and/or employee needs and traffic patterns. Address the operational needs of the store, including, but not limited to, opening/closing procedures, cash management, overrides, visual standards, urgent maintenance issues, and Loss Prevention partnership. Fulfill the responsibilities of the Support role in alignment with Apple’s policies and procedures. Perform other duties as assigned.", "key_qualifications": "", "preferred_qualifications": "Experience motivating others to achieve positive results. Track record of influencing and gaining the support of others. Relates well to diverse groups of people and offers support as appropriate. Experience de-escalating conflict among peers and colleagues. Can make quality and timely decisions to adjust for changing business needs. Able to effectively solve problems and make key decisions using analytics, experience, and judgment. Has excellent attention to detail and a willingness to take initiative. Able to work autonomously and without close supervision. Demonstrated organizational skills and experience. Contribute to an inclusive environment through respecting each other’s differences and having the curiosity to learn. Demonstrate Apple’s values of inclusion and diversity in daily activities. You can establish rapport with employees and customers. You can effectively communicate the Retail vision and priorities to deliver an incredible customer experience. You are capable of delegating and collaborating. You act in the best interest of the team and business. You execute all tasks needed for opening and closing the store, including cash handling. You protect company assets and maintain Apple standards at all times.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551375"}