{"title": "iOS Engineer - Apple TV", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Home Platforms Software Team creates solutions for the home, from building incredible movie experiences to building the ecosystem to allow Apple devices to work better together. We make software for Apple TV, HomePod, and iPhone that allows our users to have a transformative listening experience anywhere in their house, to enjoy watching their favorite shows with stunning Dolby Vision quality and Atmos surround, and to play the newest hit from Apple Arcade. Our engineers employ their talent and tools to write the code that makes these experiences possible. They work cross-functionally with teams across Apple to make a seamless experience. Join the team to see what else is possible!", "description": "The tvOS Platform team is responsible for the underlying systems that enable the ATV experience. We are looking for extraordinary software engineers to help us build the future of our product. If you’re passionate about writing code, and want to work with world-class engineering teams tvOS Platform team is the place for you. You are a self-directed iOS Engineer who is prepared to take on system-level problems and drive full-product solutions, involving extended team members where needed.You are a strong programmer, creative problem solver who thrives in changing environments, excited by working across teams and organizations. Significant experience in one or more of the following highly preferred: Object Oriented Design and Development experience Digital Media application or framework development Mac OS X, iOS, or Unix/Linux/BSD development experience Familiarity with drivers, networking, performance testing, thermal testing.", "key_qualifications": "5+ years experience in commercial grade software development Ability to write clear and high-performance code in Objective-C and/or Swift Ability to analyze large features and implement practical solutions Passion for quality and close attention to details Strong communication and interpersonal skills Ability to deliver solid work on tight schedules Aptitude to independently learn new technologies", "preferred_qualifications": "", "education_experience": "BS CS/CE/EE or equivalent experience", "additional_requirements": "-  Significant experience in one or more of the following highly preferred: -  Object Oriented Design and Development experience -  Digital Media application or framework development -  Mac OS X, iOS, or Unix/Linux/BSD development experience -  Familiarity with drivers, networking, performance testing, thermal testing", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547899"}