{"title": "SWE - OS Build Quality Engineer - iOS", "summary": "The OS Build Quality Engineering team is seeking an OS Build Quality Engineer. We are responsible for the quality and stability of our daily builds for macOS, iOS and watchOS, with a special focus on upcoming products. We're looking for organized, critical thinkers who would like to play a key role in driving the testing and coordination of quality efforts across software engineering. As a member of our fast-paced group, you will have the unique and rewarding opportunity to shape and improve the software that allows our products to delight and inspire millions of Apple’s customers every day.", "description": "We are looking for a self-motivated individual with strong technical and communication skills, and a deep interest in Software Quality. You will be responsible for functional testing (manual and automated) of first-party applications on a range of Operating Systems. You will design and implement test plans, test cases, risk analysis, and integration testing across Apple platforms. You will need to identify, escalate, and communicate key build quality issues, and work towards resolutions on the critical issues affecting the build quality. Other responsibilities include end-to-end testing of small and large scale software features across multiple platforms, designing and reviewing tests and coverage plans in alignment with different Quality Engineering teams. Occasional weekend work will be required.", "key_qualifications": "- A keen eye for quality\n- Professional experience working in Software development and testing\n- Creative thinker and strong problem solver with meticulous attention to detail\n- Ability to investigate, debug and triage difficult problems and independently work towards results\n- At ease and adaptable in a dynamic environment\n- Excellent written and verbal communication skills are needed to facilitate close interaction with peers, management, development teams, and other organizations within Apple\n- Highly organized, creative, and passionate about achieving results\n- Passion for user-focused design & high-quality technology\n- Ability to work a flexible schedule", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or Engineering, or equivalent technical degree or experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200507612"}