{"title": "Senior Solutions Architect e-Commerce", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work. Join Apple, and help us leave the world better than we found it. Here on the Apple Store Online team (ASO), we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a Senior Solutions Architect to help us do extraordinary things. The ASO Platform Product management team is responsible for the infrastructure and tooling that builds our e-commerce experience. The Senior Solutions Architect will be a key member of the leadership team helping drive the roadmaps and development of systems that will enable us to deliver innovative experiences.", "description": "In this role, you will be responsible for helping define and drive the Apple Online Store technical architecture and roadmap. Working together with key cross functional partners, such as Product, Program, Product Marketing, Merchandising, Digital Content Management, Engineering, Operations, and more, you will help chart a course for us to modernize our architecture. Your role is to challenge old assumptions, and bring the flexibility and dynamism that our business teams need to take us into the future — all while keeping our existing multi-billion dollar business running flawlessly. Your experience building complex, scalable systems, will help inform our architecture choices and encourage us to explore new technologies. Beyond strategy and roadmaps, you’ll dive into the details and help drive projects to implement upgrades to our tools and processes.", "key_qualifications": "Empty", "preferred_qualifications": "8+ years of proven experience in Technical Project Management, Technical Product Management, Technical Program Management, and/or Engineering Management; Self-directed, highly agile with outstanding organizational skills, able to work in high-pressure environment; Experience working with globally distributed teams, in a multi-lingual/cultural environment; Strong analytical skills, comfort working in an ambiguous environment, and ability to use data and metrics to back up assumptions; Excellent communication and presentation skills with a focus on storytelling and an ability to craft the narrative to influence team members; Skilled at resource balancing and conflict management, constantly driving what matters and cutting through ambiguity; Deep understanding and experience designing and building complex, large scale, multi-tenant systems; expertise in designing for scale; Experience collaborating with business partners on large operational projects from ideation to execution; Experience planning, running, and delivering large multi-year projects; Demonstrated ability to assess business needs and prioritize accordingly; Contributes to an inclusive environment through respecting each others' differences and having the curiosity to learn; BS/MS in Computer Science or other technical field or equivalent experience", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558885"}