{"title": "Country Marcom Manager, France", "summary": "The role you’re looking at is part of the Marketing Communications (Marcom) group at Apple. Our team works to ensure that the company’s strategic products are conveyed in the most compelling way to a wide array of audiences in multiple markets and languages across Europe.", "description": "Strategic Insight gathering: Working with the strategy and data team in country and regional HQ, ensure a deep, current and sustained knowledge of the market. Keep leadership updated with this knowledge and facilitate ways to keep the broader team immersed in the market. Proactive strategic recommendations: Identify key opportunities with business, brand or consumer experience benefits. Leverage touch points including (but not limited to channel, bespoke partner plans, advertising, media, social, .com, owner comm). Driving our consumer experience across digital touchpoints will be a key focus, and the role will be expected to drive digital adoption and lead an innovation agenda in this space. Marketing/Marcom/Channel Plan: Own and drive a plan which outlines in aggregate and with long term ambition, key consumer insights, market challenges, goals and priorities that we share with Sales. Proactively identify and deliver upon opportunities to drive forward the overall agenda in the market, across brand, channel and retail. Working with creative resources in regional HQ/agency partners and the European LT, lead these strategic initiatives from conception to implementation to meet these objectives. Stakeholder management: Drive integration between business owners (Partners, Sales, AppleStore, ASO Services, education, business, telco) for day to day communication but particularly during campaigns. Stay closely connected to the London based leadership team. Be a strategic guide and the glue to the functions. Day to day taking lead from brand and channel directors and be a part of those teams. Product knowledge and connection to Regional & Global HQ: It’s imperative to maintain a close connection to and understanding of our products. And to have a true understanding of what launching our products entails. Inevitably the most important moments in your market will be when we launch new products and so having a keen understanding of this process will be absolutely fundamental to your success in driving better outcomes in your market.", "key_qualifications": "Significant experience of integrated marketing, from insights to strategy, execution, measurement and beyond. Excellent analytical and strategic skills, with the ability to craft and deliver persuasive arguments around business opportunities. Proven experience of leading cross functional teams to deliver integrated through the line campaigns at scale. Strong understanding of the digital landscape and digital marketing best practice. Fluency in both French and English is critical", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548247"}