{"title": "Software Engineer, Ad Platforms", "summary": "At Apple, we work every day to build products that enrich people’s lives! Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.", "description": "At Ad Platforms, we are building the next generation of privacy-focused advertising capabilities. As a part of the data organization, we work at the cutting edge of data engineering, machine learning, and privacy at Apple's scale. We are constantly developing data products to provide amazing user experiences and to drive value for developers and publishers. We are looking for a Senior Software Engineer to design and develop real-time stream processing systems and to transform how advertising works with data. You will be a leading voice in our technology strategy and its delivery as well as serve as a mentor to our junior members of the team. As a part of this team, you will: Engineer secure and scalable data processing systems across different execution contexts such as real-time, near real-time, and batch using Spark, Hadoop, Kafka, Cassandra and beyond. Collaborate with a team of world-class data infrastructure engineers and product managers to apply innovative techniques and technologies that process petabytes of realtime streaming events. Join a group of talented data infrastructure engineers and help align the technical direction across the entire Ad Platforms data organization. You will join and contribute to a culture that emphasizes reliability, resiliency, extensibility, scalability, and productivity. We are one team, nurturing each other’s growth and supporting each other in delivering for our customers and Apple.", "key_qualifications": "", "preferred_qualifications": "Strong computer science and data engineering fundamentals, Proficiency with modern programming languages (e.g. Java/Scala/C++) and ease with picking up new technologies independently, Expertise in NoSQL datastores (e.g. Cassandra, Keyspaces, ElastiCache) and data modeling, Proficiency in distributed systems and data processing technologies (e.g. Spark, Kafka, Flink), Experience building and scaling systems on premise and in the cloud, Strong technical skills with proven experience developing, architecting, and supporting scalable data infrastructure, Passion for data quality, code elegance, clear documentation, cost saving and operational excellence and effective communication with cross-functional teams", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558211"}