{"title": "Software Engineer- SoC Level Validation Engineer", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. Join us to help deliver the next groundbreaking Apple product. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles.\n\nWhat happens when you run almost everything on an SoC all at once while powering down blocks, hammering new features, and running a complex suite of algorithms? You find bugs. That’s exactly what we do. We break Apple Silicon with our bare metal system level SW suite that runs mostly post-silicon, leverages pre-silicon and finds corner-case hardware bugs. Join our team to uphold the high quality of Apple Silicon.", "description": "In this role, you will:\nWrite SoC and CPU directed and random tests\nDebug issues pre-silicon or post-silicon\nDevelop and maintain system-level SW platform\nLead SW development and execution plans of SoC projects\nWork with designers and architects to accomplish validation goals\nEngaging with other teams at Apple to develop validation strategies based on product needs", "key_qualifications": "SOC and CPU knowledge; consider the following:\n- Micro-architecture\n- Memory hierarchy\n- Interrupt and DMA\n- Clock and Power Gating.\n- System level understanding.\n- Experience with SoC bringup\n- Experienced C/C++ and Assembly language programmer\n- Expertise in Embedded programming with an understanding of hardware-software interfaces\n- Knowledge of Hardware and Software debug tools and methods\n- Experience with scopes is a plus", "preferred_qualifications": "", "education_experience": "A minimum of a BS degree and a minimum of 10 years of relevant industry experience in silicon validation software engineering or related field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537051"}