{"title": "Sr Software Engineer (Data Solutions), IS&T Ai & Data Platforms", "summary": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers. Together, you and your team will help everyone at Apple do what they do best: explore every possibility. At Apple, extraordinary ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day-to-day basis? If so, Apple's Global Business Intelligence (GBI) team is seeking an experienced Software Engineer to build high quality, scalable and resilient distributed systems that power Apple's analytics platforms and data pipelines. Apple's Enterprise Data Warehouse landscape caters to a wide variety of real-time, near real-time and batch analytical solutions. These solutions are an integral part of business functions like Sales, Operations, Finance, AppleCare, Marketing and Internet Services, enabling business drivers to make critical decisions. We utilize proprietary and open source technologies, Kafka, Spark, Iceberg, Airflow, Presto, etc. If you are looking to solve infrastructure problems at scale, both on-prem or in cloud, focusing on ease of use, ease of maintenance and most importantly implement solutions that are scalable, you will have fun in GBI! If you enjoy learning new technologies, solving challenges with little mentorship, and are comfortable proposing and implementing solutions, demonstrating Software Engineering standard methodologies, you will find it rewarding to work in GBI! The ideal candidate for this position will be able to think outside of the box and should have passion for building engineering solutions to enable business in making time sensitive and critical decisions.", "description": "We engineer high-quality, scalable and resilient distributed systems on cloud that power data exploration, analytics, reporting and production models. Our core systems are diverse and come with an unusual intersection of high data volumes with systems distributed across cloud and on-premise infrastructure. On our team you will build solutions that integrate open source software with Apple’s internal ecosystem. You will drive development of new components and features from concept to release: design, build, test, and ship at a regular cadence. You will work closely with internal customers to understand their requirements and workflows, and propose new features and ecosystem changes to streamline their experience of using the solutions on our platform. This is a hard-core software engineering role, where a large part of an engineer's time is spent in writing code and designing/developing applications on cloud, with the remainder being spent on tuning and debugging codebase, supporting production applications and supporting our application end users. This role requires in-depth knowledge of cutting-edge technologies and cloud data platform with an aptitude to independently learn new technologies and contribute to the success of various initiatives. We are looking for a hardworking and passionate person to join this amazing team. If you feel this is you, we'd love to hear from you.", "key_qualifications": "7+ years experience building enterprise level applications on large-scale distributed systems\nDeep knowledge of BI concepts and implementation experience on Cloud with databases like SnowFlake, Big Query, Cloudera\nIn-depth understanding of fundamentals of object-oriented design, data structures, algorithm design, and problem solving\nExpertise in programming and developing high quality software. Proficiency in SQL and multiple programming languages for building data pipelines including Python, Scala, Spark, and Java.\nExperience in multi-threaded, concurrent programming and synchronization\nCloud technology experience on platforms like AWS, Microsoft Azure, Google Cloud\nExperience developing Big Data applications using java, Spark, Kafka is a huge plus!\nHands-on knowledge of Spark cluster-computing framework & Kubernetes or similar containerization technologies.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent experience", "additional_requirements": "Experience in Enterprise-ready Cloud Data-Warehousing platforms like Snowflake and AWS is highly valued.\nStrong hands-on experience in designing and development of cloud-based applications that include large scale compute services, database services, APIs to design RESTful services, ETL, queues and notification services.\nDemonstrate knowledge and experience in Software Engineering processes, including test driven development\nSecure and skilled at working in tandem with a team of engineers, or alone as required.\nAbility to see the bigger picture impact of decisions", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547782"}