{"title": "Site Reliability Engineer", "summary": "The Apple Information Apps Engineering teams power some of the most widely used Apple applications, such as Apple News, Stocks, Weather, and Books. We meet our high expectations through dedication to best practices, which enables us to deliver a vast array of information that people worldwide use daily in over 150 countries. We are seeking an experienced and dynamic Site Reliability Engineer (SRE) Operator to join our team in maintaining the reliability, availability, and performance of our systems. The ideal candidate will have a strong background in production monitoring, a deep understanding of development and operations, and a proven track record in managing large-scale production environments.", "description": "Our team is highly collaborative, working closely with partner teams to deliver the best results for Apple. Good ideas are valued and rewarded. As a Site Reliability Engineer (SRE) at Apple, you will operate, monitor, and triage all aspects of the production and non-production environments. You will pioneer and implement the next generation telemetry system for Apple News, Stocks, Weather, and Books. You will prepare alert handling procedures, runbooks, and collaborate with the off-shore SRE team. You will actively participate in capacity planning, disaster recovery exercises, interact with and support partner teams, and automate deployment and orchestration of services into the cloud environment as well as other routine processes. You will also cultivate and maintain relationships with internal and external third-party vendors.", "key_qualifications": "At least 3 years of prior demonstrated experience in a Site Reliability Engineering, DevOps, or an Infrastructure-focused role. Linux expertise. Support of internet-facing production services and distributed systems via deployments, onCall, and Incident Management. Proficiency in implementing and coordinating telemetry using monitoring and observability tools like Splunk, Grafana, and Prometheus, or similar. Experience in solving and resolving issues in Kubernetes from both an operating system and application perspective. Hands-on scripting with Python. Building and operating container orchestrating systems like Kubernetes or EKS. Designing, building, and maintaining infrastructure with a cloud provider such as AWS. Automation advocate - prior history of removing operational toil via software. Both a strong sense of ownership as well as team comradery with clear and transparent communication abilities. Self-motivated, inquisitive and always looking to learn more. Nice to have: Networking, TCP/IP network fundamentals, and basic troubleshooting. Disaster recovery and capacity planning. Deployment automation via Terraform or CloudFormation. Systems built upon open source storage and search technologies including Cassandra, Kafka, Solr, Postgres, and Redis.", "preferred_qualifications": "", "education_experience": "Bachelor of Science in Computer Science or other related discipline.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545408"}