{"title": "Wireless System Automation and Test Engineer", "summary": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.", "description": "You will be part of the dynamic and innovative Wireless/PHY System DVT team! The team is responsible for ensuring the Wireless/PHY system meets the design specification and functions correctly. The design specifications and functionalities include EVM, Sensitivity, Desense, RF/Baseband Performance, MIMO, Beamforming, and Coexistence. You will be responsible for automation development and verification of the Wireless/PHY Systems. You will also develop the test and test infrastructure for the validation and regression at the center of a silicon design group on the radio and PHY. You will work with PHY/MAC/RF design engineers and system integration/test engine", "key_qualifications": "Knowledge in wireless communication systems: WiFi and/or Cellular Technologies Understanding of key performance indicators and impairments of RF and Baseband signals\nExperience testing wireless silicon in a lab\nExperience using and understanding lab equipment: signal analyzer, signal generator, spectrum analyzer Experience with Python, Shell scripting, and/or C/C++/C#\nExperience developing test automation, including equipment drivers, debug tools, automation scripts, interfaces Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI/CD, database, reporting tools)", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Electrical Engineering or Computer Engineering +3 years of relevant experience. Masters preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519836"}