{"title": "Ad Platforms - LATAM, Strategic Accounts, Platform Specialist", "summary": "At Apple, we work every day to create products that enrich people’s lives. Our Ad Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in the App Store, Apple News, and Apple TV. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. Launched in 2016, Apple Advertising is an easy, efficient and fast-growing platform for app discovery. Apple Ads is becoming the app promotion platform of choice for iOS developers. Apple is a place where extraordinary people gravitate in order to do their best work! If you are excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job! Apple is redefining advertising on mobile devices while reaching hundreds of millions of iPhone and iPad users around the world. Through Apple Advertising, developers & advertisers get access to the most engaged consumers in the market. We’re looking for a Platform Specialist with demonstrated success to join the Strategic Accounts team in our Ad Platforms business.", "description": "The Platform Specialist team is essential to the business success, combining their abilities of analyzing data, optimizing accounts and articulating this in clear and simple terms with clients directly. With a focus on driving client growth and delivering best-in-class customer service, you'll have a hands-on, client-facing account management role with direct and agency customers across the LATAM region. The Platform Specialist is responsible and accountable for owning, growing and developing our key, strategic accounts in-person, over video conference, and over-the-phone. You will own and grow a book of business through making recommendations to clients on how to best optimize their campaigns to hit their business goals, while also forging long-term partnerships both in person with travel and virtually. You will work closely with Client Partners who act as our frontline business sales team. You will also partner closely with cross functional teams such as marketing and product, delivering back market sentiment on our products. You will be part of an inclusive and open team culture, with results focused behaviors that ensure the business hits its revenue and customer satisfaction targets.", "key_qualifications": "Fluent in Spanish and Portuguese. 5-7+ years experience in performance advertising campaign management with 3 years experience using a self-serve type platform preferred. Ability to think strategically about complex issues and develop recommendations and action plans. Strong understanding of performance advertising, the mobile and app market and a passion for the ever-changing digital space. Excellent communication and presentation skills - in-person with travel, on video conference, and over-the-phone. Ability to listen effectively, socialize ideas across functions and articulate business visions both internally and externally. Identify and develop data analysis and recommendations that align with customer goals. Quantify high-impact opportunities with clear recommendations to pitch and upsell to customers. Demonstrable analytical skills are critical for this role, including an in-depth knowledge of Excel. Educate clients on Apple’s solutions and provide consultative support on their media, measurement, and creative strategy to grow existing partnerships. Ability to focus on details and trends, combined with the skills to react fast and ensure delivery of best-in-class customer service for advertisers. Extremely professional, maintains a positive attitude and is passionate about working across teams, driving a culture of collaboration and shared success.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546948"}