{"title": "AIML - ML Research Engineer, Forecasting Foundation Models", "summary": "We are a group of innovative researchers and engineers dedicated to fundamentally increase Apple’s business success across Finance, Sales, and Operations with Deep Learning technologies and innovations. We build foundation models to forecast critical business and financial metrics that drive optimization for top line as well as bottom line growth. Are you a Research Engineer who is passionate about building algorithms and systems to advance Multi-horizon Demand Forecasting, Generative Sales Strategies, Generative Supply Planning, and Holistic Optimization to the next level? As part of the team, you'll play a pivotal role in redefining Apple’s product lifecycle and business decision-making through novel Deep Learning research pursuits. This role presents outstanding opportunities to innovate in Forecasting Foundation Models, Multi-modal Learning, Sequential Recommendation Learning, Explainable ML and Reinforcement Learning. Through working with extraordinary domain experts from Finance, Sales, Operations, and Operations Research engineers you'll make significant impacts on Apple's core businesses.", "description": "Your contributions will have extensive and direct monetary impact on Apple by transplanting groundbreaking deep learning models into explainable and tangible business solutions. You will closely work with outstanding engineers and researchers to solve some of the most ambitious problems: AI-Generated Financial Optionality, Foundation Models for demand forecasting, Reinforcement Learning with knowledge distillation, and Explainable Deep Learning.", "key_qualifications": " ", "preferred_qualifications": "PhD or equivalent experience in Computer Science, Machine Learning, Mathematics is helpful", "education_experience": " ", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200527401"}