{"title": "DevOps Engineer", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nAre you a passionate operations engineer who wants to work on solving large scale problems? Join us in building best in class solutions and implementing sophisticated software applications across IS&T. At Apple, we support both open source and home-grown technologies to provide internal Apple developers with the best possible CI/CD solutions. In this role you will have the unique opportunity to own and improve tooling for best of the class large-scale platform solutions to help build modern software systems!\n\nThis role is primarily responsible for building and managing tools that enable software releases in a fast paced enterprise environment We operate with on-prem, private, and public cloud platforms. A Senior DevOps Engineer would be partnering closely with global software development teams and infrastructure teams.", "description": "As a virtue of being part of this team you would be exposed to a variety of challenges supporting and building highly available systems, working closely with U.S. and India based teams and have the opportunity to expand the capabilities the team has to offer to the wider organization. This may include: \n\n-  Designing and implementing new solutions to streamline manual operations.\n\n-  Triaging security and production issues along with other operational team members. Conduct root cause analysis of critical issues.\n\n-  Expand the capacity and performance of current operational systems.\n\nThe ideal candidate will be a self-motivated, hands-on, dynamic and detail oriented individual with a strong technical background.", "key_qualifications": "4+ years proven experience in DevOps/SRE, systems engineering, build/release/deployment automation, etc.\nGood understanding of distributed systems, APIs, and cloud computing.\nExperience with hosted services in a high-volume enterprise environment.\nImplementing applications in private/public cloud infrastructure and container technologies, like Kubernetes and Docker.\nExperience with develop software tooling to deliver programmable infrastructure & environments and building CI/CD pipeline with tools like Terraform, CloudFormation, Ansible, and Kubernetes toolset (e.g, kubectl, kustomize).\nAbility to program in a high-level programming languages or scripting, such Java, Python, Shell, Golang, etc.\nExperience with logging infrastructure and using tools like Splunk, Logstash, or Kibana and networking load balancers such as Ngnix, Netscaler, HAProxy.\nOperational experience with AWS, GCP or similar platforms through migrations, scaling operations etc.\nBackground building distributed, server-based infrastructure supporting a high traffic in a critically important environment.\nExperience with Kafka, MongoDB, Cassandra and Oracle.\nIn-Depth knowledge on AWS services including VPC, IAM, EC2, EKS, CloudWatch, S3, RDS, Route53. Experience in similar services for GCP is preferred.\nWorking experience with Spinnaker is a plus.\nAWS Cloud Architect and/or Certified Kubernetes Administrator (CKA) certifications are highly desired.", "preferred_qualifications": "", "education_experience": "Bachelor’s in Computer Science or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536800"}