{"title": "Product Design Engineering Program Manager", "summary": "As a Product Design Engineering Program Manager you will be responsible for the technical management of the development and implementation process for the mechanical components of one of our Home Products product development teams. In this role you will drive the day-to-day activities to meet the overall program objectives focusing on engineering, development planning and validation cycles. This involves engaging with large cross functional teams to balance several competing objectives and meet aggressive deliverable timelines.", "description": "Support product definition and drive closure of architecture and technical opens in early stages of a project. Establish and manage program feature baseline, scheduling, budget, critical paths, and technology risk areas for execution through final delivery of the product Identify and highlight technical risk areas and mitigation strategies in partnership with impacted teams to help drive them to closure Enable the development effort by creating and monitoring an efficient, streamlined process Drive drawing releases and tooling kickoff with PD Engineering and the vendors to meet aggressive schedules Plan and execute prototype builds by directing OEM partners Lead cross functional communication between project teams and external vendors Drive day-to-day activities to meet overall project objectives including calling and running meetings among engineering stakeholders Offer multiple levels of status across a wide spectrum of individual contributors to executive management via written and verbal communication", "key_qualifications": " ", "preferred_qualifications": "Prior experience (ideally 3+ years) leading program management or mechanical engineering design of product development\nExcellent communication, organizational, presentation and leadership skills\nSelf motivated and proactive with demonstrated creative and critical thinking capabilities\nUnderstands and deals well with rapid development cycles; remains flexible when faced with uncertainty and changes in direction\nKnowledge of product development processes as well as an understanding of manufacturing processes, mechanical engineering fundamentals; prior experience with metal stamping, forging, machining (CNC), die casting, plastic injection and metal injection molding (MIM) is highly desirable\nStrong attention to detail and ability to effectively manage complex design strategies\nParticipated in delivering products comprised of multiple materials and high esthetic quality\nExperience interfacing with cross functional teams including Mechanical Engineering and Design, Systems Engineering, Reliability, Operations, and Marketing.", "education_experience": "", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559639"}