{"title": "Financial Analyst, Retail Real Estate Strategy and Analytics", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future. Join us, and you’ll have a meaningful role in continuing Apple’s legacy of efficiency and success. As a Real Estate Strategic Finance analyst, you play an integral and diverse role in supporting Apple’s retail store growth. You will partner with global teams identifying incremental growth from recent and upcoming real estate investment decisions. Finally, this position works closely with Retail R&D and Real Estate leadership driving new store initiatives and building business cases on new go-to-market strategies and store formats", "description": "- Partner with market analysis and other business functions across Apple to build a holistic business case of entering new markets with physical and/or online Retail presence. - Drive key performance and operational insights of new stores and significant replacement investments, influencing remedial actions and future strategy. - Partner with Market Analysis and WW Sales Finance to understand current point-of-sale coverage and size incremental opportunity in new and existing markets. - Develop analytics on retail’s existing fleet identifying performance and profitability trends. - Build polished reporting and presentations that are frequently seen by Retail Leadership, the CFO, and CEO.", "key_qualifications": "", "preferred_qualifications": "4+ years of experience in roles covering project management, financial analytics, presenting succinctly to all levels of leadership, and optimally influencing business partners; Able to analyze large amounts of data summarizing key takeaways and insights; Strong verbal and written communication skills across all levels of the organization; Focused project management skills and detailing business requirements; Ability to present to multiple partners in a concise impactful way; Robust interpersonal skills and focus on driving towards rigid deadlines; Highly accurate with close attention to detail; Experience prioritizing day to day business needs while driving long range projects; Strong business partnership, with ability to work with teams across different time zones", "education_experience": "Bachelor’s Degree or equivalent experience, MBA a plus", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545619"}