{"title": "Power System Design and Integration Engineer (HWEE) – Wireless Power Division", "summary": "We believe the future is powered by Wireless! The mission of the Wireless Power Technology team - Create the world’s best Wireless Charging user- experience by inventing state-of-the-art technologies. We develop effortless and safe Wireless Charging designs that are central to Apple’s products - the iPad, iPhone, Apple Watch and AirPods! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for the challenges? Our team features a collaborative and hands-on environment that furthers engineering excellence, creativity & innovation. We design, develop & launch next-generation Wireless Power Technologies in Apple products. We are looking for a power design engineer that leads the integration of the inductive technology into products in the partnership with multiple discipline teams including but not limited to architecture, FW, system EE, silicon, noise and vibration, safety, thermal, reliability, operations , regulatory teams and more.", "description": "You will be developing and designing wireless power systems. You will be expected to meet a high standard for analysis, and manufacturing discipline, and work with cross functional teams to pass all specifications and requirements necessary to ship a product. - Write requirements, specifications, and test plans for both hardware and FW - Define factory tests, test limits, and work with factory and peers to perform failure analysis and corrective actions - Guide the team in the development of necessary algorithms, state-transition diagrams/flowcharts and analysis for each regime of operation - Experience with high volume mass production is a plus - Up to 20% travel is required", "key_qualifications": "Solid EE fundamentals in both analog and digital design and comfortable with tackling new challenges with the critical thinking and problem solving skills. Circuit level simulation experience in EE simulation platforms like Cadence/ADS/LTspice etc. Familiar with various communication protocols (USB, SPMI, SPI, I2C and UART) and low power embedded systems, e.g. ARM Core Processors", "preferred_qualifications": "", "education_experience": "- Bachelors in relevant EE field, Masters/PhD preferred - Relevant industry work experience preferred", "additional_requirements": "- For graduating students/fresh graduates applying to this position, please list your overall GPA in your CV.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540576"}