{"title": "Embedded SoC Driver Engineer", "summary": "Imagine what you could do at Apple! Every day, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. Audio & Media Technologies (AMT) provides the audio foundation across all of Apple's innovative products, including iPhone, Vision Pro, iPad, Apple TV, Apple Watch, HomePod and Macs. AMT’s Audio team provides the audio foundation for various high-profile features like Game Audio, Siri, FaceTime, media capture, playback and APIs for third-party developers to enrich our platforms. The team is looking for talented engineers who are passionate about building audio features and products for millions of customers and care about overall user experience. You will revolutionize the audio experience for the game and future audio", "description": "Apple’s AMT Audio group is seeking an experienced software engineer with strong low-level development skills who can bridge the gap between hardware and software. This position will work with the Audio Design, Silicon Engineering, and Silicon Validation Teams, prototyping hardware sequences, designing and developing drivers for audio hardware peripherals, and expanding internal tools to facilitate bring-up for new SoC and hardware designs. Responsibilities will span pre-silicon development and all aspects of project-based audio driver design and software development. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, visionOS, macOS, watchOS, and tvOS.", "key_qualifications": "Experience in embedded device driver development. Experience in silicon and pre-silicon bring-up. Excellent programming (C/C++/Assembly) and scripting skills (Python). Excellent profiling skills with proficiency in debugging large, complex system software. Background in low-level software development and system integration. Ability to translate hardware data sheets into software. Good understanding of multi-core embedded HW Systems and RTOS. Highly motivated and self-directed, quick learner.", "preferred_qualifications": "", "education_experience": " BE/ME, BS/MS in Computer Science, or Equivalent.", "additional_requirements": "-  Good understanding of uboot and Jtag a plus Knowledge power management, ARM, X86 architectures a plus. An interest in audio and improving audio on Mac and iOS platforms a plus Translation of HW specifications into bring-up/run/tear-down sequences in software. Experience in profiling and optimizing power and performance of software/hardware. Experience in participating in hardware and software design reviews. Ability to review hardware engineering schematics nice to have.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550452"}