{"title": "Software Engineer, Analytics & Data Engineering", "summary": "The role is in Apple Services Engineering (ASE) in London. ASE is the team behind high-profile services such as the App Store, Apple iCloud, Apple Music, Apple TV+, Apple Arcade and more. Our Analytics and Data Engineering team is looking for a world-class Software Engineer to develop large-scale systems that will power the next generation of ASE data features and power products used by millions of customers everyday. Do you love crafting elegant solutions to large scale challenges? Are you able to manage the complexity and focus on delivering reliable, scaleable solutions for our customers? Join this team, and you will collaborate with engineers across Apple to build and deploy data pipelines and systems that contribute to the development of our world renowned service business.", "description": "The ASE Analytics & Data Engineering team is responsible for building analytics platforms, datasets and processes required by Apple for analysing and powering customer experiences. This means we build computation platforms and datasets to empower our product, marketing, feature, analytic and data science teams. Given the size and complexity of our datasets, this is not a trivial task. We are looking for an outstanding Software Engineer who can effectively collaborate with our partner teams to deliver data engineering solutions to improve and power the next generation of Apple features. You will be working on cross-functional projects with other engineering teams, product leads and analytics leaders to build insights, metrics and data pipelines. The projects you will be working on will be truly impactful. You will have the freedom to innovate as you work closely with our partners to drive meaningful change and build elegant systems to deliver the results. The ideal candidate will have a strong quality focus and be motivated by taking early production systems and developing them into services which can be run reliably at scale. Our systems are large scale and highly distributed in nature and you will be able to reason about complex failure modes which could occur. Attention to detail and a perseverance to deliver a high-quality, well tested and maintainable code, is a must.", "key_qualifications": "Experience shipping high quality, performant and reliable data products and features. Proficiency in Scala or Java, with an understanding of recent language features and frameworks. We believe great engineers are capable of learning new technologies, but experience in the above will be beneficial. Solid understanding of distributed data processing concepts. Experience with scalable data storage technologies. Examples include but not limited to, NoSQL stores such as Cassandra and distributed filesystems such as S3 and HDFS. Sophisticated analysis, problem solving, and troubleshooting skills. Ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Software Engineering, Computer Science, or 2yrs + of equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546247"}