{"title": "Functional Integration Engineer (Middleware)", "summary": "At Apple, we rely on our employees diverse set of backgrounds and perspectives to champion innovation through extraordinary ideas to surprise and delight our customers. These ideas can come from anywhere. Will that next phenomenal idea come from you? The global eBusiness team is responsible for delivering system connectivity both internally and externally using industry standard solutions and in-house developed systems and platforms. We are seeking an extraordinary Senior Integration Engineer to implement integration solutions for critical business processes across our partner ecosystem.", "description": "In this position you’ll be working on programs that will directly impact Apple and its products and services. You will be responsible to design, develop and implement large scale integration solutions working with a team of engineers in Singapore and around the world. You will also be the face of Apple to our partners from a technical integration perspective, working with them to implement solutions and address problems. You will bring creativity and innovation to your day to day work and thrive in uncertainty striving to bring clarity and focus in a fast paced environment. Success in this role means that you are hands on, in the details, and personally accountable for the success of your projects. You will play a key role in the strategic direction of our global organization by delivering these key strategic projects and programs.", "key_qualifications": "8+ years of Software Engineering experience, including 3+ years of experience in middleware or integration technologies. 5+ years of demonstrable experience building and maintaining large-scale, distributed integration solutions. Knowledge in middleware technologies like Software AG webMethods or Mulesoft. Strong expertise in Supply Chain domain with hands on experience designing and implementing large projects.", "preferred_qualifications": "Hands on experience in working with industry standards like EDI X12, XML, JSON and API’s. Experience in handling sensitive customer data like PII, SSN and other sensitive PCI and SOX data. Deep understanding of different partner types in the Supply chain domain and their business processes. Architect large scale solutions that enable business processes using middleware technologies or Java based apps. Proven ability to manage projects with on-time delivery. Demonstrated capability to look beyond the curve and add value to business teams. Familiarity and implementation knowledge of cloud technologies. Insight & creativity to see around corners and to design systems in order to mitigate future risk. Results-oriented and demonstrates the high degree of ownership and accountability. AI / ML implementation experience is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555354"}