{"title": "Software Engineer", "summary": "Be a significant part of the Hardware Test Engineering Core Infrastructure team that is at the center of the Apple Factory’s Development Process. This team is responsible for application development to improve delivery, management, and scalability of factory test platforms to factories located worldwide. We are looking for a curious, hardworking, self-motivated software developer to work on several key systems as a member of our collaborative team.", "description": "We are currently seeking an individual with strong backend software skills and a willingness to work with both C++ and Swift. \nYou will work with a team of extraordinary engineers to develop and deploy mass-production friendly solutions for all Apple products. This would include architecting, developing, deploying and triaging software used in the factory during manufacture of new products. Responsibilities would include triaging and diagnosing issues with cross-functional teams from diverse engineering backgrounds during new product bringup, as well as working with external vendors on defining better solutions and processes.", "key_qualifications": "Backend software development experience\nExtensive expertise with Objective-C, C++, or Swift\nProficient with UNIX/Linux or macOS\nExperience with scripting languages (Bash, Python, Perl)\nExcellent knowledge of software testing methodologies & practices\nExcellent knowledge of source code management concepts and systems (Git)\nEffective communication and an ability to collaborate with those around them", "preferred_qualifications": "4+ years of backend software development experience in Unix or Linux environment with expertise in C++\nBS degree in Computer Science, Computer Engineering or equivalent practical experience.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556628"}