{"title": "Testing Development Software Engineer", "summary": "Are you an innovative person? Do you like working in a fast-paced environment, developing interesting testing scenarios with informative reports? Apple is looking for people like you. As part of the Apple’s Wireless Connectivity group you will be working on Apple’s latest products both shipped and pre-released HW, developing tests to validate the PHY FW releases. You’ll be joining a dynamic and growing team of Firmware developers. You’ll work collaboratively with other engineering team members to develop and improve our coverage. This position’s primary focus will be creating scalable and robust test systems to support the delivery of new and existing features for a variety of Apple devices.", "description": "We are looking for a candidate who can take our tests and testing environment to the next level. In this role, you will be working closely with the Wireless Connectivity Firmware engineers, providing a secure, high quality and robust regression supporting the development of firmware solutions. Targeted to increase the performance and stability of the different Wireless solutions. You should have a strong background in tests and testing environment development, and a good knowledge and experience in Python. Advanced problem solving and debugging skills should be a given.", "key_qualifications": "5+ years of experience of testing/verification/QA development, Strong, proven skills in Python and OOP, Strong understanding of software test and validation methodologies, Able to support engineering team with triage, debugging and validation of software issues, Familiarity operating Unix-like operating systems and working in the shell - highly preferred, Experience with databases and data analytic tools (such as Splunk, or Tableau) - highly preferred, Experience in working in DevOps (CI / CD systems, lab management) - preferred, Knowledge in C language - preferred", "preferred_qualifications": "", "education_experience": "B.Sc in Computer Science, or related discipline.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200511863"}