{"title": "Software Engineer (Framework), Ai & Data Platforms", "summary": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nThe people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Global Business Intelligence team provides data services, analytics, reporting, and data science solutions to Apple’s business groups, including Retail, iTunes, Marketing, AppleCare, Operations, Finance, and Sales. These solutions are built on top of a phenomenal data platform and leverage multiple frameworks. This position is an extraordinary opportunity for a competent, expert, and results-oriented Framework Software Engineer to define and build some of the best-in-class data platforms and products.", "description": "As a Framework Software Engineer, you will be responsible for building various tools and features for Data and ML platforms, including data processing, insights portal, data observability, data lineage, model hub and data visualization. You will either work on building custom solutions ground up or take open source products and customize the same for Apple’s need. We're looking for an individual who loves to take challenges, tackles problems with imaginative solutions, works well in collaborative teams, and can produce high-quality software under tight deadlines and constraints. This role involves building innovative tools and frameworks that can extend the functionality of 3rd party BI tools using APIs.", "key_qualifications": "3+ years of hands on experience with Java and or Python\nExperience designing and developing scalable micro services and Rest APIs\nExperience with SQL and NoSQL data stores\nExperience of building and deploying cloud native applications/products\nWorking experience with Big data technologies and data platforms\nPrior experience in the areas of AI/ML/Data Sciences will be a strong plus\nExperience with Business intelligence (BI) platforms like Tableau, Thought-Spot and Business Objects is a plus\nGood communication and personal skills, ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownership", "preferred_qualifications": "", "education_experience": "BS in Computer Science or related field or equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530236"}