{"title": "Software Development Engineer in Test - Apple Online Store", "summary": "Apple’s Worldwide Retail & Online Stores (R&OS) team is looking for outstanding individuals with a strong commitment to work with similarly skilled engineers to deliver software quickly and efficiently, with increasing quality. To be successful, you must be proficient at thoroughly testing applications and services, and helping improve team velocity through automation. We are looking for highly motivated individuals, who can continually research and apply the newest technologies to test engineering code changes, independently tackle issues and influence the teams to adopt the best test practices. Successful candidates will be deeply engaged with the engineering teams through all phases of development.", "description": "In this role, you will be involved in Quality Engineering for critical customer facing applications. Work on functional and integration quality assurance testing in a hands-on approach using the latest technologies in automation. Build effective test plans and cases, analyse automation suites and target reduction of regression test cycles thereby taking the Quality function to the next level. Work closely with cross-functional organisations, project teams and clients to develop test plans, execute test strategy to deliver high quality products. Self-motivated, able to grasp issues quickly and make educated, critical judgment in the absence of complete requirements.", "key_qualifications": "Good understanding of SDLC (Software Development Lifecycle) and software testing processes, with hands-on experience in either white box or black box testing. Demonstrable experience in UI automation and test automation frameworks such as Selenium, Appium, Playwright or equivalent. Knowledge of backend system testing including testing Web Services, databases and batch processes. Exposure to CI/CD tools like Jenkins, GitLab or similar. Excellent collaboration, organisational and communication skills, with ability to deliver in fast-paced environments. Experience in cloud technologies such as AWS/GCP and containerisation technologies such as Docker would be a plus.", "preferred_qualifications": "Bachelor’s degree in Computer Science or equivalent field.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555211"}