{"title": "APAC Pre-construction Manager", "summary": "In RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers! Our team is a diverse and nimble group that manages and provides services to Apple’s Retail stores and workplaces. We develop and run Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world! We are seeking an experienced, collaborative, and highly motivated senior Pre-Construction professional to join our team and execute pre-construction activities for various types of Apple retail stores projects in APAC.", "description": "The Pre-construction Manager should have proven experience in construction project design, procurement, execution with a demonstrated focus in cost modeling and schedule creation/analysis for a variety of projects construction projects and programs. This role will be responsible for Pre-Construction services for Apple retail stores in AMR. Drive cost savings through leveraging a cost estimating software to prepare detailed cost estimates. Develop market specific labor & material cost impact studies to support WW portfolio of projects. Be the subject matter expertise to influence current and future digital solutions that allow Development to accurately execute pre-construction activities for various projects. Develop and recommend new cost modeling for future store designs. Ensure pre-construction deliverables are thorough and incorporate the most accurate cost, schedule, and design standards. Drive standardization of templates used by Precon for estimates, schedules, reports, and studies across pre-construction tools. Responsible for developing schedules for purposes such as planning, lease negotiations, and budgets. Create schedule risk register and participate in discussions on impact, probability, and mitigation for large complex projects. Assist Development Director in evaluating General Contractor schedules and critical path activities. Prepare project analyses, keynotes, and reports as a normal cadence and for ad hoc requests. Advise/consult on vendor contracts, design responsibility matrices, GC and DS scope matrices. Creates formal network involving coordination amongst teams while also being able to operate independently. Liaise with internal systems team to ensure P6 schedule information is accurately reflected in leadership reports.", "key_qualifications": "12+ years retail/commercial construction or pre-construction services throughout APAC. Experience performing creating detailed project build schedules, risk analyses, construct sequencing & logistics, and critical path assessments for complex retail, corporate, data center, hospitality, or museum buildings. Microsoft Project proficiency required; Primavera (P6) Software proficiency preferred. Understanding risk registers and results from Monte-Carlo Simulations. Expertise in cost management software such as PMWeb, eBuilder, Procor, or equivalent. Experience estimating innovative systems such as facades, glazing, vertical transportation, MEPF and luxury interiors. Manages Complexity - Makes sense of complex, high quantity, and sometimes contradictory information to effectively solve problems. Minimum 25% travel required.", "preferred_qualifications": "", "education_experience": "Bachelor’s Engineering degree in Mechanical, Electrical, Industrial, or Construction Management preferred.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200525123"}