{"title": "Display Mechanical Engineer", "summary": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We want outstanding engineers to bring passion and dedication to our team! Apple’s Display Technologies group is looking for Mechanical Engineers to design and develop innovative display modules for future products. Here you will create next-generation technologies, processes, and components, and own the integration of them into groundbreaking, mechanically robust display designs with amazing performance.", "description": "Our team wants colleagues with a strong curiosity and understanding of the design and development of consumer electronics or mechanical design fields! - Investigate state-of-the-art mechanical designs and technologies, innovate ways to further improve Apple display performance, and enable strong and compact system designs. - Define the module mechanical architecture based on optical, electrical, mechanical, and other cross-functional requirements. Work with the system team to define the interface to the product including fit, assembly features, and tolerance analyses. Deliver any needed specifications including 3D/2D. - Achieve system goals through mechanical design optimization, prototyping, new material qualification, and manufacturing processes. Audit factories to review the manufacturing and assembly at each step to ensure high yield and high quality. - Define & implement validation plans for ME characteristics of the display modules using scientific & analytical approaches. Drive thorough failure analyses for any issues to reach robust corrective actions. Ensure the specifications are met throughout the supply chain. Communicate validation results to peers and leadership. - Act as a focal point among multiple world-class cross-functional teams and suppliers to identify open issues, drive them to closure, and deliver mechanically robust displays. Support the product throughout the architecture, engineering development, mass-production ramp-up, and launch.", "key_qualifications": "High energy personality with a real passion for learning and attention to detail. Excellent prioritization, cross-functional collaboration, and written & verbal communication. Solid understanding of mechanical engineering fundamentals including properties of materials, solid mechanics, beam statics, Newtonian physics, and thermodynamics. The ability to perform mechanical design & validation, including the development of component or material evaluation tests, and failure analysis. 3D/2D software expertise: 3D modeling (Pro/E, NX, CATIA, or Solidworks), engineering drawings, Geometric Dimensioning and Tolerancing (GD&T). Exposure to diverse manufacturing techniques such as injection-molding, sheet-metal stamping, 3D printing, and materials such as polymers, glass, and metals. Good understanding of DFA/DFM, and statistical tolerance analysis. Applied Design of Experiments (DOE) and scientific method to address engineering issues. Willingness and ability to travel internationally (~15%, primarily Asia).", "preferred_qualifications": "Experience with simulation and analysis such as Finite Element Analysis (FEA) for structural and thermal, Computational Fluid Dynamics (CFD) is ideal. Familiarity with Six Sigma methodology, process capability, and capable of large data set analysis using JMP, MATLAB, or Minitab is ideal. Electro-mechanical design and/or manufacturing for high-volume products with an emphasis on reliability is ideal.", "education_experience": "BS in Mechanical Engineering or equivalent with a minimum of three years of experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540641"}