{"title": "Benefits Analyst", "summary": "Apple is a place where extraordinary people gather to do their best work. At Apple, we craft products and experiences people once couldn't have envisioned, and now can't imagine living without. If you’re excited by the idea of making a real impact, a career with Apple might be your ideal job. Just be prepared to dream big! We believe that collaboration is one of our key strengths, and every day we will connect you with your peers and colleagues, at one of the most diverse companies in the world. As an individual, you'll be a key player within the function. This position will be part of the Global Benefits team in the Global Total Reward function at Apple. The Benefits Analyst role is responsible for the management and development of outstanding programs for Apple employees in a designated set of countries in the EMEIA region. The role requires partnership with team members from Compensation, Finance, Payroll and Compensation Services, Procurement, Systems teams and other People team functions to deliver effective and innovative programs in alignment with Apple’s Global Total Reward philosophy.", "description": "As part of the Global Benefits team, you will have the chance to put your talents to the test in a constantly changing environment and dynamic landscape. You will be responsible for the operation and improvement of a range of different benefit programs across multiple EMEIA countries. Ensuring efficient and effective delivery and providing valuable SME experience to regional and local partners. You will be responsible for managing multiple vendor relationships and upholding excellent service levels across the countries you support. Employee experience is at the forefront of what we do on the Benefits team. In this role, you will need to be a person of high integrity and good judgment, who can communicate and inspire and connect our unique culture with the work you do every day. You will have an independent drive to succeed and deliver and a dedication to the central philosophy and strategy of the Total Reward team. The ideal candidate will have a love for the impact that well defined and thoughtful benefit programs can have on our employees and their families lives!", "key_qualifications": "No information available", "preferred_qualifications": "Partnering on approaches to collective bargaining and labour relations strategies, Support of mergers & acquisitions, Experience of new country expansion, Management of programs in the High Tech and Retail sectors, Experience of managing the operational aspects of time away systems support, Project management skills, Fluency in another language", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "No information available", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553091"}