{"title": "Sales - Account Manager (Thailand)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish! Apple Thailand is looking for an energetic and highly motivated individual, ready take on the challenges of an Account Executive role. This position is responsible for supporting the Account Manager in implementing business development opportunities and building strong Consumer Electronics channel (CE) including offline and online stores to grow Apple’s business across all lines of business including iPhone, iPad, Apple Watch, Accessories and Apple Services. This position will also play a meaningful role in driving positive relationships with Partner’s channel teams including store operations, planning, marketing, merchandising & training. The ideal candidate has the ability to identify, create, forecast and drive opportunity throughout the entire sales cycle, as well as, has excellent communication skills. Equally important, the candidate is a phenomenal teammate, efficient adaptable, and thrives in a dynamic, changing environment.", "description": "The scope of overall responsibilities will cover and focus on: - Develops deep understanding of CE market i.e. business strategy, channel opportunities and competitive positioning that benefit to partner channel plan. - Build and establish close working relationships & teamwork with partner’s team (all levels) for comprehensive improvement plan aligning sales objectives and initiative priorities. - Work closely with partner cross-functional teams to maintain a consistent Apple ecosystem narrative at the store level, creating exceptional customer experiences within the CE channel applying branded fixture, channel technology, sale process and Apple advocacy programs. - Leverage on accurate market insights, demand gen funding and Apple products strategies to offer the best consumer affordability programs. - Effectively conduct Business Reviews with Store/Area/Regional sales team to focus the performance on monthly basis. Collaborate with internal cross functional Apple team for business building blocks to support partner’s growth. - Responsible to essential administrative tasks including relevant sales reporting, inventory reporting, maintaining files, information, and forms. - Supports Account Manager in building comprehensive account plans from lens of CE expertise.", "key_qualifications": "Possess strong CE channel background, takes keen interest in exploring new opportunities in the market and ready to go beyond the industry norm Strong project management experience to drive cross-functional sales initiatives by giving firm direction and providing data analysis to support Go-To Market plans. Demonstrates ability to think creatively in solving problems, comfortable in dealing with ambiguity and able to adapt quickly to changing environment. Experienced with good track record in managing revenue and sales target bottom up from store tiers to high level outlook. Possess exceptional interpersonal skills with a phenomenal persuasive approach to build strong relationship based on trust and collaboration with cross functional teams and customers at all levels. Possess excellent communications and presentation skills", "preferred_qualifications": "", "education_experience": "- Ideally has a Bachelor’s degree in business management or equivalent education. - Minimum 5 years professional experience in channel management or bring experience as an Account Executive or Field Sales from international company with good interpersonal skills.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544754"}