{"title": "Communications Engagement Strategist, Retail Customer Care", "summary": "As Steve Jobs said in 1997 when introducing the Apple Store Online, “We make amazing products. We should have an amazing purchasing experience!” Twenty-five years on, the Apple Store Online is one of the world’s biggest and most successful e-commerce sites. Our global mission is to bring a seamless, high-quality, digital retail experience to all of our customers. In Retail Customer Care, our team is able to bring this experience to life! We are looking for someone to help us tell this story. Someone to inspire our team members and help us continuously improve their experience. Inclusion is a shared responsibility, and we hold ourselves and one another accountable for bringing everybody in. You build authentic and best in class communications. You have a background in mobilizing people through advocacy, community engagement, journalism or politics. You know how to speak to hearts and minds and have the wins to prove it. You are motivated by hard work, problem solving, and collaboration with others. You think and execute with acute accuracy. You love it when an idea takes hold and starts a movement. As a strategist, you live and breathe the audience and customer — from behavioral insights to ways of connecting. You know every communication has a goal and desired outcome. You are the master of crafting the strategic approach, not just tactics. Framing the problem and fueling teams to get to the solution. You synthesize large amounts of information into key insights that are compelling. You cut through clutter with plans that put the right information in the right place at the right time for the right person.", "description": "The Retail Customer Care Quality team is looking for a motivated communications strategist to develop and lead the communications strategy, with the clarity on what needs to be communicated to whom, when, and how. You will help upgrade our communications playbook, so we have the right programs, tactics, and infrastructure in place to meet the wide-range of communication needs. This role will collaborate with cross-functional partners globally, balancing the needs of collaborators, executive leadership, and team members to craft messaging for each across a variety of communication vehicles. This is a holistic role, that depends on strategy, messaging, programming, and execution. You will develop a complete communication program and use the full breadth of tactics - posts, events, roundtables, employee stories, videos, and presentations to help drive employee engagement daily in a way that is consumable and valuable for our teams.", "key_qualifications": "Experienced internal communications and engagement specialist. 5+ years experience in developing employee facing content, strategies and programs, including daily, unplanned, crisis, and operational communications. Deep expertise with employee sentiment strategies. Thought-leadership on the models, infrastructure, and management systems required for a modern communications operation. A proven innovator in storytelling and messaging, with clear hands-on expertise as a creator, not just a manager of communications. Track record working collaboratively with cross-functional partners and collaborators, especially creative/design, marketing, corporate communication, and people and legal teams. Experience working with international peers to define global communication strategies. Extraordinary ability to grow internal relationships, work effectively within cross-functional teams, and lead through ambiguity. Strong organizational skills, attention to detail, and the ability to lead multiple projects and thrive in a dynamic environment. Able to remain composed and balance high pressure situations to successfully operate in a real-time, fast-paced environment. Excellent writing and editing skills. Makes space to listen, learn, and amplify diverse perspectives and experiences. Actively seeks out opportunities to champion and celebrate inclusion and diversity.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552794"}