{"title": "Software Engineer", "summary": "AI represents a huge opportunity to elevate Apple’s products and experiences for billions of people globally. Apple is looking for Machine-Learning engineers with a background in Machine Learning, Conversational and Generative AI! You will be leveraging innovative models to build applications on top of Apple’s most advanced technologies. As a Software Engineer focused on rapid prototyping of ML models, you will be responsible for designing and implementing innovative AI models and algorithms. You will work closely with other researchers and engineers to prototype and test new ideas, and collaborate with cross-functional teams to bring your research to life. This role will play a critical part in helping Apple change the way humans learn about learning. You will have the opportunity to work on cutting-edge technologies that are designed to enhance human learning experiences. You will be working with a team of passionate and talented engineers and researchers who are dedicated to making a positive impact on the world through education and technology.", "description": "Are you passionate about building AI/ML products? Are you passionate about solving hard problems? As a machine learning engineer on our team, you will design and implement ML algorithms that process data in different Apple products. The primary responsibilities associated with this position range from algorithm design and implementation, ability to integrate research into production frameworks, and collaborating closely with product teams before and after feature launch. You will work closely with other cross-functional teams to align research, messaging, contribute to roadmaps and contribute software back into different repositories for proper integration with core systems. You will write clean, maintainable and production code with appropriate documentation and tests. You will contribute to architecture decisions, design reviews and peer code reviews. We provide the right balance between research and product to deliver Apple quality state-of-the-art experiences on various Apple devices!", "key_qualifications": "Strong experience with deep learning and natural language processing, Proficiency in programming languages such as Swift, Python, and C++, Proficiency in using ML toolkits such as PyTorch, TensorFlow, etc., Deep understanding of Prompt Engineering and Build Prompt fine-tuning, Familiarity with rankers and algorithms used for personalization, Excellent communication and collaboration skills, General understanding of generative AI", "preferred_qualifications": "", "education_experience": "Ph.D./M.S in computer vision, natural language processing, machine learning, computer graphics, computer science or 5+ years of equivalent industry experience", "additional_requirements": "- Experience with conversational AI technologies and frameworks, - Familiarity with Apple's research and products", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518445"}