{"title": "Software Engineering Manager, Enterprise Technology Services", "summary": "Do you love working on challenges that no one has solved yet? Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join our team, we work in a startup-like environment and you will be part of every stage of development working multi-functionally with user interface designers, business, development engineers, architects, and operations from the concept phase to deployment. The team is focused...", "description": "We are looking to hire extraordinary individuals with a strong focus on core application development, great communication and interpersonal skills, and the ability to work effectively across multiple business and technical teams. As a part of this team, you will build groundbreaking software services using innovative technology, one that is continually innovating and is proud of making a difference. In this role, you will manage a team of engineers but make decisions affecting many cross-functional partners. You will remain close to the code and are...", "key_qualifications": " ", "preferred_qualifications": "Hands-on experience in designing and architecting large projects including performance, scalability, robustness, and resiliency. Experience in frameworks like ReactJS, and Angular for building dynamic and interactive web interfaces. Proven ability to manage projects with on-time delivery and working experience in Agile development methodology. Results-oriented and demonstrates the high degree of ownership and accountability. Communicate quickly and effectively; vertically and horizontally throughout the organization. Possess excellent problem-solving & analytical skills.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557438"}