{"title": "Database Engineer - NoSQL and Cloud, Apple Pay", "summary": "Are you interested in building high-performance, highly scalable and available database systems that support Apple’s current and future growth? Are you seeking an environment where you can drive innovation? If so, please read ahead! Apple Pay Engineering is looking for a passionate NoSQL and relational Database Engineer to help lead and grow our large scale environments in Cloud and Apple Data centers. This team is responsible for providing new architectures and scalability solutions for our ever growing business and data processing needs. As an engineer here, you will work on building data services (Relational, NOSQL, Kafka, Redis, ElasticSearch etc) that operate at a massive scale and are responsible for routing large amounts of financial data.", "description": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. This position requires a highly motivated individual who likes large-scale challenges in a fast-paced environment. This role requires the ability to work independently on live production systems while collaborating with multiple teams. Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "Experience working with the databases in the public cloud, specifically AWS and Google Cloud. Ability to Install, Configure and tune Cassandra, ElasticSearch, Redis, Kafka and Zookeeper clusters using Automation tools(Chef, Ansible, Terraform). Work with Application teams on database design, debugging, and performance. Collaborate in the evaluation, selection and platform design of emerging database technologies with concentration in the NoSQL and cloud spaces. Experience in database automation using Python, Chef, Ansible. Additional optional requirements. Experience implementing HA/DR/Maintenance/Backup strategies in complex systems. Strong skills with Linux operating systems running in production.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552225"}