{"title": "Circuit Design Engineer - Library", "summary": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly.", "description": "Imagine yourself at the center of our cutting-edge processor design in deep submicron technologies, and on standard cell library designs. You will drive concepts of transistor level circuit design, modeling and performance analysis, collaborating with all fields, playing a strategic role of getting functional products to millions of customers quickly. You will have the opportunity to integrate and come-up with new ideas, as well as work with a team of hardworking engineers. As a Circuit Design Engineer for the custom circuits team, you will perform the following: • Drive library architecture discussion & optimization effort to improve overall Library PPA. • Drive layout optimization effort by identifying & reducing parasitics to push circuit PPA. • Work on Library PPA for different technology, architecture, PDK releases. • Develop standard cell circuits that push design PPA. • Engage with CPU, SOC and GPU teams on physical design requirements.", "key_qualifications": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits. Strong understanding of CMOS device characteristics and design rules. Knowledge of deep submicron process issues & Finfet Technologies is a plus. Strong understanding of Digital circuits & optimization for better PPA. Good layout design knowledge & parasitic optimization in various types of layouts. Hands-on experience running SPICE simulations and high sigma variation analysis. Understanding of Timing characterization & modeling of Standard cell circuits. Strong proficiency in scripting languages like Perl, Python, and Tcl. Great teammate with good communication and analytical skills.", "preferred_qualifications": "", "education_experience": "Minimum requirement of a BS degree.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $56.65 and $85.52/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552732"}