{"title": "Audio Triage Engineer", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something!", "description": "This is a high visibility job that involves a deep understanding of what everyone on the team is working on. You combine a love of Apple software, hardware, and audio with a strong dedication to product quality and reliability. The ideal candidate is a self-starter with excellent communication skills and attention to detail. You are a desirable teammate, but also able to work effectively on your own.  In this role, you will:- Read, triage, and route audio bugs to Audio engineering and audio-adjacent teams- Use debugging and analysis tools to perform initial analysis of bug reports- Detect repetitive manual routines and aid the conversion of them into automated tools for team use- Identify potential trends in incoming bugs and escalate to program management- Work directly with engineering and cross-functional, audio-adjacent screening and triage teams in order to solve complex problems", "key_qualifications": "", "preferred_qualifications": "A foundational understanding of electronics, audio technology, and recording studios,Analysis capabilities related to CPU performance and memory debugging,Experience and familiarity with Python, JavaScript, or other scripting languages,CoreAudio API experience is a plus,AI/ML experience is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn moreabout Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559456"}