{"title": "Sr. Software Engineer", "summary": "Are you ready to make a significant impact in Apple Services? At Apple, amazing products and experiences are part of our DNA and making the services that are behind those products enables us to build the next great experience and make today’s experiences even better. Apple's iCloud Efficiency team is looking for an experienced Software Engineer to help us make our software and services more efficient and sustainable. You will be involved in driving key initiatives to improve of Apple Services through Service Architecture Optimization and building tools to bring visibility to the efficiency aspect to the fore. You will work with extraordinary teams around the world who have a real passion for engineering and delivering features which delight users while maintaining strong privacy guarantees.", "description": "We are looking for a Software Engineer with experience in building and supporting large scale infrastructures, tools and framework with an eye on efficiency. They should have been involved in evolving the architecture of services over time with minimal downtime and impact to other delivery. You will actively engage with our development partners and product teams regularly so the services are well aligned with business needs. If you love designing and running systems and infrastructure that will delight millions of customers this team is for you. Responsibilities will include: Provide frameworks and services for deploying large scale services, provide visibility into resource efficiency. Evolve the architecture of services for resource optimization. Collaborate with other engineers on code, infrastructure, and design reviews, and process enhancements. We are a high impact team crafting, building, and driving Apple’s platform. This enables many of Apple’s signature apps and experiences. Our work is crucial to the success of Apple’s growth in services, enabling new features which will change the world. This role will take you beyond the systems and services you will find elsewhere. The ideal candidate will have a strong quality focus and be motivated by taking early production systems and developing them into services which can be run reliably at scale. Our systems are distributed in nature and you will be able to reason about complex failure modes which could occur. You will be comfortable working with our multi-functional partner teams to deliver the best outcomes. The product development can be fast paced and requirements can change during the rapid innovation cycles. You will have the opportunity to take ambiguity and refine it into valuable outcomes, taking risks where justified by the reward.", "key_qualifications": " ", "preferred_qualifications": "Non crucial but helpful skills: Language - Deep knowledge of a high-level programming language including diagnosing system level problems. Cloud - Knowledge of Kubernetes or other methods of automating and scaling cloud deployments. Systems - Understanding of Linux or Apple OS fundamentals. Security - Background understanding of cryptography and security. Efficiency - Experience with improving services for resource optimization Bachelor's degree in an engineering-related field, or equivalent experience", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559452"}