{"title": "Cell Development Technology Engineering Program Manager", "summary": "As an Engineering Program Manager within Apple's HW Technology organization, you will be responsible for development of battery solutions for a wide range of Apple products! We are looking for an energetic Engineering Project Manager to support exciting projects where you are expected to use your engineering background to enable x-functional teams to deliver sophisticated solutions. The ideal candidate will understand lithium based rechargeable cells, and have a passion for upending conventional wisdom of material, packaging, and analytics development to push industry boundaries and deliver better Batteries. The candidate should have a working understanding of battery cell design and manufacturing to drive and implement a plan from concept development to build management to product integration. Successful candidates will have a consistent track record of enabling larger multi-functional teams to deliver complex systems efficiently and with high quality, with ability to bridge gaps between different engineering teams, while driving and qualifying suppliers to Apple Battery specifications.", "description": "The Battery Technology EPM leads a multi-functional team of battery, chemical, system, and manufacturing engineers, using a strong technical background to identify, assess and communicate project risks and issues. They facilitate good communication and offer multiple levels of status across a wide spectrum of individual contributors to executive management. In addition, they drive day-to-day program activities to meet overall program objectives.\n-  Develop project plans, manage, track and report progress to plan and drive solutions to address any/all identified gaps.\n-  Identify and prioritize project tasks and risks, drive engineering discussions and decisions on critical system parameters\n-  Drive day-to-day activities, including build management, to meet overall project objectives\n-  Identify and engage multi-functional collaborators for project definition decisions\n-  Communicate status and big picture to the project team and executive management", "key_qualifications": "", "preferred_qualifications": "Experience with emphasis on lithium ion or lithium polymer battery cells a plus\nExperience in lithium-based battery\nKnowledge of current innovative production process applicable to lithium rechargeable cells\nExperience in working with suppliers to develop and qualify battery\nExperienced in setting up project plans, anticipate potential roadblocks and react proactively to mitigate against risks or impacts.\nExperience with modeling and simulation work\nDemonstrated competence in working in a fast-paced, multi-functional environment; engaged and eager to learn\nExcellent communication, organizational and leadership skills as well as the ability to filter and distill relevant information for the right audience.\nUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguity. Highly adept in multi-tasking of both short-term and long-term activities\nAbility to comprehend, communicate and manage complex design tradeoffs", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558545"}