{"title": "Touch & Force Sensing Engineering Program Manager", "summary": "In this critical, highly visible role, you will manage projects involving the design, integration and launch of innovative touch and sensing technologies for world-renowned Apple products including iPad, iPhone, Apple Watch, and MacBook. You will play a key part in providing Apple customers with the best user-experience in the industry by driving the development and deployment of next-generation touch and sensing technologies! The Touch & Sensing Technology team features a collaborative environment with creative, smart people and groundbreaking technologies. Engineering excellence is expected and encouraged. Come, join us in crafting solutions the world doesn’t know of yet!", "description": "In this role you will: - Lead program execution directly with internal and external partners - Manage schedules, engineering builds, and development budgets - Optimally and consistently communicate overall program status internally and externally - Deliver executive communication/presentations and drive the decision-making process - Ensure tight inter-team coordination and communication - Read situations and step up to resolve conflicts - Improve the system: look for patterns, offer standard methodologies and implement change", "key_qualifications": "", "preferred_qualifications": "Experience leading multi-functional teams including Electrical, Algorithms, Process and Test Engineering to deliver pioneering sensing solutions Advanced engineering degree Self-motivated and proactive with demonstrated creative and critical thinking capabilities Excellent communication, organizational and leadership skills Confident in delivering technical data with ability to filter and distill relevant information for the right audience Ability to fit in well with a team, understand others’ capabilities and priorities while fostering a collaborative environment, and inspire team members Understands and deals well with rapid development cycles; remains flexible and calm in the face of uncertainty", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558704"}