{"title": "Software Build Engineer", "summary": "The Software Build & Integration team at Apple is at the core of the Apple software development process. We are responsible for delivering the state-of-the-art operating systems and applications to Apple customers. The role empowers build engineers to influence new feature integration into Apple software, by collaborating with engineers from Software, Hardware, Localization, QA, and Project Management teams. Software Build Engineers will have the opportunity to utilize and implement solutions using distributed computing, cloud services, and virtualization technologies to deliver Apple software to customers. This involves engineering innovative solutions for Apple's production build system in support of macOS, iOS, watchOS, tvOS, Xcode, and more!", "description": "Job Responsibilities\nSpecific responsibilities include:\n* Performing daily software builds of macOS, iOS, and its related application products\n* Working cross functionally with teams across Apple to ship new features or products\n* Collaborating with Apple development teams to configure project code bases\n* Troubleshooting and resolving complex software integration issues\n* Developing tools and processes to improve and automate workflows\n* Enhancing and maintaining automation tools and web services\n* Filing actionable bugs and resolving bugs efficiently\n\nJob Expectations\nA successful build engineer will be expected to:\n* Have excellent verbal and written communication skills\n* Exercise critical thinking skills, anticipating the needs of others\n* Be an independent learner, insatiably curious, and know when to ask for help\n* Demonstrate willingness to ask for clarification and context to understand the big picture\n* Find multiple solutions to a problem, evaluate tradeoffs, and decide the best approach\n* Have strong coding ability and testing mindset, e.g. CI/CD, high code coverage, chaos engineering\n* Understand, retain, and perform complex procedures\n* Be proficient with git or other version control\n* Develop strong UNIX debugging skills\n* Communicate status frequently to product teams and engineering program managers\n* Document new processes or update an existing wiki pages", "key_qualifications": "macOS, iOS, or UNIX development experience.\nUNIX administration and strong software debugging skills.\nKnowledge of operating system, network, and compiler concepts.", "preferred_qualifications": "", "education_experience": "* Bachelors, Masters, or equivalent experience in Computer Science.", "additional_requirements": "Optional Experience:\nWillingness to learn and master these areas:\n* Programming in Python, JavaScript, Objective-C, or Swift\n* Familiarity with version control systems such as git or subversion\n* Proficiency with advanced text editors (Sublime, vim, emacs)\n* Authoring complex regular expressions\n* Experience with Xcode and/or Makefiles\n* Web systems development or web application development experience\n* Comfortable reading backtraces and stack traces", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552023"}