{"title": "System Analyst - Material Data & System Readiness", "summary": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Material Data & Systems Readiness is an integral part of the America’s (AMR) Operations Team. We are looking for an exceptional analyst with a record of successful influence, collaboration and execution. You should have strategic thinking skills and experience, with a solid background in operations, supply chain, systems, and/or project management. In this position, you will collaborate with our cross-functional counterparts and project teams to help shape our material data and systems plan of execution that will be used to enable our go-to-market strategy. This candidate will manage data setup in SAP and stage testing of all e-commerce applications across all lines of business, for the full lifecycle of our products: buy-ability go live, new product introduction, through end of life.", "description": "The AMR Operations Material Data & Systems Readiness Analyst should be a driven, flexible, comfortable with ambiguity, and articulate problem solver who can multi-task under dynamic timelines to meet product launch objectives, delivering timely solutions for custom requirements across a broad range of capabilities and customized offerings. Collaboration with multiple groups incl: AMR Operations cross-functional organizations, incl: Supply Demand Management/Execution, Reseller Operations, Logistics, Retail, AOS, Business Process Re-Engineering, Corporate Compliance, Product Ops, Product Marketing, Pricing, Legal, and others that are critical to build and deliver solutions to meet the needs of evolving business opportunities.", "key_qualifications": "3+ year’s experience leading execution in the areas of operations, supply chain, data management, program and/or project\nmanagement\nConsistent record of leading diverse and complex projects, combined with the ability to execute tactical activities and tasks\nExcellent communication skills, both written and verbal\nStrong organizational and collaboration abilities\nConfidence in managing and navigating ambiguity successfully\nDemonstrated ability in business process re-engineering with an acute attention to detail and continuous innovation\nExcellent forward thinking capabilities, able to see beyond the current state, proactively identifying risks/opportunities\nProven experience working optimally in a matrixed and global organization", "preferred_qualifications": "", "education_experience": "Bachelor of Science in Supply Chain, Business, Finance, Economics, Marketing, Engineering, or relevant field required. MBA or Advanced Degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552360"}