{"title": "Associate Creative Director, Copywriter", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. In the role of Associate Creative Director, Copywriter you work alongside a team of talented designers and other writers to create work across all mediums for products, services and campaigns. You are passionate about Apple products and the brand and your work will influence customers worldwide.", "description": "Collaborates with ACD/Art Directors/other team members to concept ideas and co-direct teams to produce quality work. Guides up and coming writers seeking to craft meaningful and inspiring work. Writes, reviews, and empowers campaigns for the Apple brand and products. Presents work to senior creative staff, product marketing managers, and Apple executives. Works across subject areas to integrated strategies and messaging for online, retail, channel, events, advertising and new mediums of communication. Works with project managers and creative directors to ensure that schedules are accurate and realistic, and that deadlines are met. Support the CD of writing with creative oversight and direction around new product launches, ensuring work in multiple European languages maintains Apple writing standards. Review and give feedback of work in back-translation (no knowledge of other languages is required).", "key_qualifications": " ", "preferred_qualifications": "Your work is grounded in big, bold, original ideas, executed with impeccable craft and meticulous attention to detail. You have produced work in the varied mediums of advertising, social media, conceptual campaigns, product launches, branding, photography, film and video. You are passionate about excellent writing that is thoughtful, meaningful, provocative at times, clear and inspiring. You are used to working proactively in a creative and dynamic environment. You have an eye for great writing and the ability to create a powerful story through the work. A brilliant, multi-skilled English writer — you love coming up with a clever, concise headline as much as you enjoy crafting a well-honed paragraph of body copy or a script for a social animation. Localise US headlines for a UK audience as needed, ensuring the original messaging and intent are maintained.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552501"}