{"title": "Apple Support College Program At Home Advisor - University of Texas Arlington", "summary": "At Apple, we believe each customer interaction is an opportunity to delight, engage, and inspire.", "description": "At Apple, we believe our diverse backgrounds, perspectives, and passions help us create the ideas that move all of us forward. As an Apple Support College Advisor, your voice is essential in supporting many of our popular products, including iPhones, iPads, MacBooks, iMacs, and more. As our customers’ first point of contact, you’ll be the friendly voice of Apple, providing world-class customer service, troubleshooting, and technical support. We’ll rely on you to listen to our customers and use your technical expertise, creativity, passion, and our documented troubleshooting flow to meet their needs — and remind them that behind our great products are amazing people. We’ll train you to be the best.  This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development. We’re committed to helping employees explore their potential. Inclusion is a shared responsibility, and we hold ourselves and one another accountable for fostering a culture where everyone feels seen, heard and inspired to do their best work.", "key_qualifications": "null", "preferred_qualifications": "Business, Communications, Computer Science, Engineering or any other tech related major, Passion for customer service and ownership of the customer experience, including comprehensive issue resolution, Approach opportunities flexibly and with good judgment, Model high standards and demonstrate quality, honesty and accountability, Able to navigate difficult conversations and display resilience after challenging situations, Potential to effectively tailor communication and style to differing audiences, Able to self-manage and work independently in a fast-paced, constantly changing environment, Thrive on a team where expertise is shared and feedback is welcome, Effective time management, including ability to multitask, organize and prioritize, Able to research and grasp technical information across multiple tools while respecting customer privacy, Potential to acquire skills in technical troubleshooting and an eagerness to learn and take on new challenges, Makes space to listen, learn, and amplify diverse perspectives and experience, Actively seeks out opportunities to champion and celebrate inclusion and diversity", "education_experience": "", "additional_requirements": "", "pay_benefits": "This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557362"}