{"title": "Senior Optomechanical Engineer", "summary": "Imagine what you could do here at Apple. You can help create the next generation of the world’s finest devices. Great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you can accomplish. Instrumentation Product Design team with Hardware Test Engineering is responsible for designing optomechanical instruments, fixture and tooling for test and calibration of optical components and products. As such, you will utilize your Optomechanical engineering skills to conceive, specify and help design optomechanical instruments to enable the next generation of cutting-edge optical modules.", "description": "Responsibilities include the following: Designing and detailing complex optomechanical instruments, covering everything from component design to the development of motion systems, precision lens positioning, active and passive alignment, design for manufacturability (DFM), design for manufacturing and assembly (DFMA), reliability, and shipping, etc. Effectively communicating with and guiding vendors and third-party manufacturing partners, clearly conveying critical information to cross-functional teams, mentoring junior engineers, establishing best practices from hardware test engineering (HWTE) in Munich, and developing new competencies to facilitate continuous improvement. Design and develop test fixtures, jigs, mounting brackets, alignments systems, etc. Prepare production drawing and effectively communicate with potential manufacturing vendor. Driving design reviews, participate in design validation and characterization during product design, prototyping and deployment. Drive failure analysis and design of experiments (DOEs) to reach design solutions and corrective actions.", "key_qualifications": "", "preferred_qualifications": "MSME preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559245"}