{"title": "Financial Analyst, Finance Development Program", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Join the Apple Finance organization and make a positive impact on one of the most influential technology leaders in the industry. At Apple, you’ll share in a commitment to excellence by partnering with teams who are building innovative products that delight customers. We hire quality individuals with integrity, personal accountability, teamwork, excellence, and can-do thinking. Apple has multiple opportunities within the Finance Development Program. The FDP is a 2-year rotational program providing an opportunity to gain breadth through typically 4 to 6 diverse experiences in Apple Finance. FDPs are trained by Apple Finance employees throughout the organization. In the program, FDPs learn about financial analysis, forecasting, budgeting, creating financial databases, automating reporting, and much more. Upon completion of the program, FDPs move into non-rotating Financial Analyst roles within Apple.", "description": "Opportunities within the FDP can include the following areas of Finance: AppleCare, Financial Services, Internet Software & Services, Marketing, Operations, R&D, Retail, Sales, Worldwide Finance Planning & Analysis, and more. In these rotations, FDPs will learn to: - Monitor financial performance, highlight trends, and analyze anomalies - Streamline reporting through the use of databases such as Tableau or with Excel macros - Partner with cross functional groups and business partners to analyze the business - Provide insights and recommendations for process improvements and innovations - Assist with quarter-end and month-end close procedures - Build reports to help predict and analyze data - Submit commentary on actuals versus forecast - Develop future-state business scenarios for financial planning - Present key findings to upper management and executives", "key_qualifications": " ", "preferred_qualifications": "Bachelors degree in Business Administration, Finance, Accounting, Economics, Math or related field. To express interest in any of our Finance teams, please provide a copy of your resume, cover letter and unofficial transcript.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560295"}