{"title": "Marcom - Strategy Lead, South East Asia (SEA)", "summary": "At Apple, ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. We are looking for a Strategy Lead role is to spearhead Marcom and cross-marketing initiatives by working closely with the SEA Marcom Leadership, Product Marketing, PR, retail, and sales team to identify and address Apple’s critical challenges and opportunities in the region. You will partner with the worldwide strategy team based in Cupertino to provide market insights, knowledge, and inspiration to some of the best creative talent in the world and champion the best multichannel work that only Apple can and should deliver!", "description": "This position requires a self-motivated, flexible individual with very strong analytical, strategic, communication skills and great leadership who will: Draw on different sources of data & knowledge (PM, PR, Sales, Channel, Interactive, Brand, WW Strategy Team) to build tangible insights & briefs to address business challenges or opportunities. Collaborate with cross-functional teams to connect the dots and develop insights-driven marketing briefings that inspire the best work. Collaborate across different functions to build and deliver the most resonating messaging for each touch point. Drive new strategic initiatives across product, e-commerce, social, and data science that are locally relevant. Consolidate opportunities and priorities into Country-specific Marketing Plans annually and quarterly. Work to understand the cultural nuances and contexts that might affect our products' adoption across all SEA region markets. Share with SEA Marketing and global teams with regular communication-based insights, competitive reviews, and market snapshots that could impact briefs and subsequent creative work. Provide critical thinking and insights to select global projects/initiatives; work closely with our agencies for business and strategic directions.", "key_qualifications": "A track record of strategic delivery in a marketing capacity, whether in creative development, brand building, or business consulting, for 15+ years. A track record of leading strategic conversations with creatives, agency partners, and people from various internal disciplines. Clear storyteller; ability to synthesize, reduce, and communicate complex information. Digital-fluent: the ability to aggregate and spot patterns within multiple sources of data, from sales and business data to behavioral and media data. Equipped with the knowledge of SEA's digital social and commerce landscape. Proven track record to build engagement and influence key stakeholders among different functions. Great collaboration: including perspectives of others in pursuit of the best approach to the idea. Leadership skills: able to defend and shepherd the right strategy through a large XF organization. Strong commercial instincts and proven experience in research/business problem identification and resolution. Strong knowledge of the Channel environment, a key area of focus for Apple. Phenomenal writing, visual story-telling, and presentation skills are required. Fluent in English. Spent considerable number of years living and working in SEA will be beneficial.", "preferred_qualifications": "", "education_experience": "We anticipate you will have a Bachelor’s degree or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548886"}