{"title": "HW/SW Power Management Engineering Program Manager", "summary": "At Apple, we craft the future of technology and make the impossible happen. From iPhones, to Macs, to the all new Apple Vision Pro; it all starts with a vision made possible through Apple Silicon. The groundbreaking A17, M4, and R1 SoCs are the result of planning and execution that were many years in the making. Come join us to do your life’s best work in this rare opportunity to help define the next big thing that will surprise and delight the world! Apple has an extraordinary opportunity for an Engineering Program Manager (EPM) within the Hardware Technologies team to drive power, performance and thermal feature integration across Hardware (HW) and Software (SW), to optimize customer experience for the best power efficiency and performance within each product limit. This position works at the intersection of SoC, System-level SW and HW.", "description": "This role covers HW/SW Power control feature integration, validation, and product mass-production support for Apple’s next generation products. Focused tracking, organizing, and reporting of program risks and timelines. Ability to influence large teams; develop and communicate the bigger picture. Ability to extract executive summaries and effectively communicate resolution options on sophisticated, multi-functional and complex issues. Drive feature workflows to guarantee high quality execution and product release. Proven creative and critical thinking, collaboration, conflict resolution and timely issue resolution.", "key_qualifications": "", "preferred_qualifications": "Technical Program Management or Engineering Management experience. Technical knowledge of Power Management and Control Systems. Drive SW/HW feature workflows to guarantee high quality execution and product release. Strong understanding of SW release cycle and SW feature development tracking. Ability to develop in-depth understanding of technical issues quickly, and optimally triage and drive HW/SW/Platform integration issue resolution across multi-functional teams. Focused tracking, organizing, and reporting of program risks and timelines. Ability to influence large teams; develop and communicate the bigger picture. Proven creative and critical thinking, collaboration, conflict resolution and timely issue resolution. Ability to optimally lead and communicate at executive-level cross-functional technical reviews and discussions. Proficient in core engineering program management principles.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558489"}