{"title": "SWE - Localisation QA Engineer - Swedish - L&RE", "summary": "The European Localisation Quality team is seeking a highly motivated software quality engineer to help us ship world-class products to our international customers. We are looking for highly-versatile, energetic individuals to play a key role in shipping outstanding, best-in-class products! Our team works in a fast-paced environment interacting with translators, software engineers and project managers. We are responsible for qualifying a variety of software products through manual and automated testing. If you are passionate about Apple software and want to help us ensure a high-quality customer experience, we would like to hear from you!", "description": "Perform manual localisation testing on software, print documents, help and hardware while identifying linguistic and international functionality issues. Report issues found, provide pertinent information and follow solutions to their conclusion. Identify areas of improvement in existing tools and processes and address those issues with innovative solutions. Work cross-functionally with international software quality centers, engineering teams, translators and project managers in an effort to ensure delivery of world-class products to our international customers. Successful candidates will be proactive, able to work independently and collaborate with a large amount of stakeholders on numerous concurrent projects.", "key_qualifications": "", "preferred_qualifications": "Ability to thrive under pressure and function effectively in a fast-paced environment. The ideal candidate will enjoy breaking our software in order to improve it. Experience in software localisation. Strong analytical, communication and interpersonal skills. Self-driven, with the flexibility to work on multiple projects with tight deadlines. Excellent team player with a meticulous attitude and attention to details. Ideal candidate would have some real-world quality automation or software development experience. Ideal candidate would have some linguistics experience. Enthusiasm for user-focused design, high-quality technology and products.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200530486"}