{"title": "Global Supply Management - Senior Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. We are seeking a candidate to develop and lead a team that will expand Apple’s Manufacturing Design organization in India. The successful candidate will have broad influence while leading and growing a team responsible for ensuring that Apple's manufacturing partners deliver high quality mechanical enclosures for Apple’s products. This person will be an expert in their field and have a strong track record of working with factories in India / globally that produce complex, sophisticated mechanically engineered products.", "description": "Lead & grow a talented team of Global Supply Managers that have experience leading manufacturing operations in a rapidly expanding and dynamic landscape, while seamlessly collaborating with technical teams. Build credibility as a world-class operational leader with technical acumen and working relationship / trust with senior executives, cross-functional manufacturing peers, engineering teams, and factory partners. Strong focus on training, functional expertise development, and overall leadership. Ensure factory readiness so that product enclosures are of high quality and able to be produced in high volume on schedule. Hands-on leadership based in India with the ability to interface and work closely with the manufacturing leadership team in Cupertino and other Apple locations.", "key_qualifications": "Strong international manufacturing experience of mechanically sophisticated products. Deep reasoning ability, both analytic and strategic. Track record of creativity and solving unusually hard problems. Clear & persuasive communicator (both spoken and written) and presenter. Ability to manage cross functionally and influence/indirectly manage other teams within Apple. Significant experience in the relevant industry. Willingness to travel domestically and internationally up to 30%", "preferred_qualifications": "", "education_experience": "Technical Bachelor's degree preferred, Masters Degree or PhD in a related field would be desirable. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542569"}