{"title": "Camera Tuning Engineer", "summary": "iPhone is the most popular camera in the world. The seamless integration of hardware and software has led to features like Memories and Portrait Mode which deliver experiences that are truly magical. The Camera & Photos team focuses on user-experience by applying computer vision and image processing through machine learning. We’re looking for someone with a real passion for photography, and gets a kick out of shipping amazing products experiences to millions of people. The Camera tuning team is searching for highly skilled and innovative engineer who will play a key role in tuning and defining still image quality as well as user behavior for iOS camera products.", "description": "Our products have a considerable complexity and rich feature set that push our hardware and software to the edge. We are looking for a great teammate who will be responsible for the image quality tuning of iOS cameras algorithms. This role requires an understanding of different ISP and framework components and their impact on image quality, a clear vision of what constitutes a phenomenal camera, and a strong dedication to drive features into better camera user experience. You will contribute directly to a variety of cutting edging technologies, such as Deep fusion, HDR, Portrait mode, and various algorithm development. You will participate in quality evaluations for new features and algorithms through experimental studies, provide direct feedback to the engineering teams. In this role you’ll be a critical part of a fast-paced, collaborative team and who thrive in a high energy, time-constrained, multitasking environment.", "key_qualifications": "Minimum of 2 years experience as an image quality testing, tuning or image processing algorithms engineer, Understanding and hands-on experience of ISP 3A, de-noising, fusion, tone-mapping algorithms, Some understanding of machine learning and image processing technologies, Excellent sense of photography, videography, cinematography, Experience in research, design and develop automation and tools, metrics and methodologies to improve camera tuning process, Experience in at least one of the following: C, C++, Objective-C, Swift, Python or shell programming, Excellent written and verbal communication skills. Experience in cross-functional collaboration", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, Color Science or equivalent experience", "additional_requirements": "Experience with software and hardware on consumer devices and cell phone cameras is a plus, Experience with iOS / macOS app development is a plus, Working knowledge or research of human vision and psychophysics is a plus, Strong track record in cross-functional collaboration and communications", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540446"}