{"title": "Channel Sales - Beats, AppleCare & Accessories", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. Join Apple, and help us leave the world better than we found it. Apple is looking for a highly motivated individual to join the Beats, AppleCare & Accessories worldwide channel development team.", "description": "Drive and influence Apple attach business, with a focus on Beats international growth and new category expansion including Apple-branded accessories, AppleCare, AirPods, and Beats products. Provide actionable insights to introduce new ways to increase key category growth in attach rates. Identify sales opportunities through detailed analysis and strategic insights, develop financial models to prove the business case for new initiatives.", "key_qualifications": "8+ years of related experience in channel sales, analytics, and business development. Excellent communicator able to influence people and teams without direct management responsibilities. 3+ years of experience in Consumer Electronics hardware pricing and pricing management, including pricing related promotions and elasticity. 3+ years of experience in account management responsibilities including external retailer facing role and buyer negotiations. Outstanding project management and organizational skills. Intelligent quick learner with an analytical orientation, strategic vision, and consensus building skills. Analytical thinker with a can-do attitude and flexibility to accommodate evolving business needs. Independent and able to thrive in an environment of autonomy and ambiguity with a positive can-do attitude. Track record of successfully designing and leading business projects to completion, adapting to new business topics and learnings. Proficient on MacOS (specifically applied to Microsoft Excel and Keynote). Comfortable leading and developing solutions to complex, ambiguous and high visibility business issues. Strong quantitative and problem solving skills with ability to synthesize and distill large amounts of information/data into clear action plans.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree required. Master's degree preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $120,500 and $181,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200532853"}