{"title": "Sr. Android Engineer-Apple Music", "summary": "This team is more than a group of engineers — it’s a group of music lovers. That passion has made Apple Music the world’s most complete music experience, with over 60 million songs, thousands of playlists, and daily selections from music experts for 115 countries. The team’s data-driven engineers focus relentlessly on the customer experience by running worldwide experiments and analyzing usage and latency, while collaborating with Apple’s product groups. As a result, someone can use the Shazam app to identify an intriguing song in a café in the morning, add it to their playlist from Apple Watch, listen to it through their AirPods on their commute, and share it with their family on HomePod at dinnertime. And there’s more where that came from, because personalization powered by machine learning and music science helps listeners discover more of what they love. Apple Music is a big part of Apple’s business because it’s a big part of people’s lives.", "description": "As an engineer on our team, you will design, architect and maintain the CORE components of the Apple Music android application. You will interact with other Apple members in cross-platform features, overseeing the work of less experienced developers, and create systems to be used by third party developers. You will be debugging real time media streaming systems, working in large code bases, debugging and fixing problems in open source libraries, creating tools and frameworks, working in multiple projects and debugging stack traces. With your strong attention to detail you will help us to find the best solutions to important problems, always having the user in mind. If you like working within a small, but effective engineering team, come and join our team!", "key_qualifications": "5+ years of experience as an android developer or as developer of client applications, Advanced Android development and architecture experience, Expertise developing at least one of these: Java, Kotlin or C++, Experience with Android NDK integration, Familiarity with unit testing, High level understanding of end to end systems, Ability to collaborate with multi-functional teams, Strong problem solving and critical thinking skills, Passion for quality and attention to detail, Ability to work with incomplete requirements and to juggle multiple priorities, Aptitude to independently learn new technologies, Strong written and oral communication skills", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in computer science or related field, or equivalent work experience", "additional_requirements": "Good to have: Experience with Android Media APIs (MediaCodec, AudioTrack), Experience with ExoPlayer internal components, Experience with FFMpeg, Experience with low level profiling tools like ASAN, Familiarity with TensorFlow", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551441"}