{"title": "Mac System Engineering Program Manager", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. The in-region Engineering Project Manager (EPM) will lead a cross-functional team of skilled Electrical and Mechanical engineers, utilizing a solid EE/CE/ME background to recognize, assess and communicate cross functional issues and risks. This will include planning, release and delivery of HW sub-systems to system build events through a product development life cycle. We are looking for a high-energy in-region EPM to lead the hardware product development and support build events in CM.", "description": "Mac in-region EPM will be responsible for leading development builds of Mac system or key modules (keyboard, trackpad). Your goal is to ensure all deliverables are met, shipped according to the given timeline, and collect all critical engineering data to support development activities. Support multi-functional teams with resource to meet build goals. Be the primary point of contact with cross-region EPM and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectives. Drive and lead the cross-functional teams to resolve crucial and blocker issues in the build. - Manage and build CM engineering teams to provide qualified engineering project management. - Planning and execution of build events, including material planning and factory readiness. - Lead cross-functional communications between Apple Internal project teams and external vendors. - Work with internal and Vendors to define build plan track communicate and escalate as appropriate. - Enable the development efforts by creating and monitoring an efficient streamlined process between Apple teams and external vendors. - Provide timely issue resolution and critical path/risk assessment management. - Facilitate good communication and offer multiple levels of status across a wide spectrum of individual contributors to executive management. - Drive day-to-day Engineering build activities at vendor’s factory to meet overall program objectives. - Manage and execute complex DOEs requested from Engineering team.", "key_qualifications": "", "preferred_qualifications": "Mechanical/Electrical/Electronics/Process Manufacturing background or equivalent. With Apple related NPI or Ops experience is a plus. Flexible to travel to US and Asia Pacific to support engineering project. Self-motivated and proactive, who can demonstrate creativities and critical thinking capabilities. Able to collaborate with multi-functional team to achieve project goals. Excellent consolidation, communication and organizational skills. Capable to cope in Fast and Stressful environment to meet tight schedule.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558314"}