{"title": "Data Center Operations Site Manager", "summary": "At Apple, we embrace diversity, continuously strive for excellence, and thrive in an environment of innovation and collaboration. We are actively seeking a Data Center Operations (DCO) Site Manager who will excel among a team of problem solvers and doers, committed to working in a high-demand environment that values continuous improvement, adopts change!  Apple’s DCO team thrives with individuals like you that take pride of ownership for the services provided in our critical environments. Individuals who excel at actively leading and maintaining systems that expand our customer support capabilities, and assist the world with their daily lives!", "description": "As the Data Center Site Manager you will have the opportunity to be responsible for the operations and management of the site and provide stable and efficient hosting services for Apple’s internal and external “High-demand” services. This individual will be required to set and maintain an environment of high operational difficulty throughout all teams, lead high priority problems, handle critical issues and have reliable communication to executive management. You will ensure effective collaboration, communication and partnership within the site’s operations.", "key_qualifications": "Typically 5-8 years in senior working experience in Data center (DC) Electrical & Mechanical areas. Sound experience on tracking data center daily operational tasks and delivering projects. Proactively explore continuously operation improvement opportunities and drive the initiatives to results. Excellent diplomatic skills on balancing multiple/complex relationship with various stakeholders. Data Center and Systems Management experience with standard methodologies in the area of DCO, Infrastructure monitoring, Problem Management, and Configuration Management. Able to validate IT procurement practices and contract negotiations. Detailed management of site material shipping & receiving, inventory management in support of DCO teams. Develop and implement site critical metrics and publication of weekly, monthly and quarterly site operational reports. Capital expenditure, operational expense, and site headcount planning, forecasting, management and control. Implement a health and safety first culture is followed to ensure a safe working environment. Responsible for Security and Compliance policies, including significant areas of SOX and PCI process compliance. Partner with peer DC managers to develop, implement and maintain standard processes covering all areas of DC Site Operations that include readiness of Disaster Recovery planning. Proficient in English with good presentation skills.", "preferred_qualifications": "", "education_experience": "Preferred BS or BA and 5-8 years of related experience with an irrefutable record of dynamically growing responsibilities.", "additional_requirements": "This Site Manager will be a dedicated role basing out Guiyang. Typically work 8-hour shifts with the potential to work weekends or holidays along with extended hours as necessary.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551739"}