{"title": "Sr. Software Engineer - Sports", "summary": "Are you interested in building products used by more than a billion people? What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented. In the TV App Services Teams at Apple, we work every day to create products that enrich people’s lives. Meet the re-inventors: The Apple TV Services teams built and manage the Apple TV app as well as tvOS, which redefined and refined the way people watch sports, and so much more. Today, these teams also handle one exciting realm at Apple: They bring viewers the sport experience to access NBA, NFL, MLB and many more games. To deliver Apple-level quality on a global scale, these engineers employ talent and tools to efficiently ingest, process and display sports data. They also integrate at the OS level to build the best user experiences with the Siri ecosystem. This group is seeking a highly skilled Back End Engineer to help design, develop, and deliver new experiences for our customers. Join the team to see what else is possible!", "description": "Apple Sports team is looking for an experienced backend software engineer with a passion for technology and modern software engineering practices to join the team. \n\nThe ideal candidate for this role is results-driven, agile, a fast learner, able to work independently, and has a consistent record of delivering highly available real-time data services. In this role, you will identify opportunities to improve the performance, and reliability of the service, set and lead the execution of the roadmap, and provide technical direction to engineers on the team. Effective communication and collaboration skills are a must-have!", "key_qualifications": "8+ years experience building highly scalable distributed systems.\nStrong Programming experience in Java including Object-Oriented and Functional programming techniques\nSolid understanding of concurrency control, data structures, algorithms\nExperience with data stores such as Cassandra and Redis.\nExperience in stream processing and data processing tools and best-practices\nExperience with CI/CD and Cloud Environments\nFamiliarity with the GraphQL framework\nSelf driven, collaborative, communicative, and fun to work with.\nSports enthusiast!", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or a related technical field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549423"}