{"title": "Solution Architect, Advisor Solutions, Customer Systems", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Does an exciting, multifaceted, fast paced and pressure-filled environment catch your attention? Do you like puzzles and resolving solutions that are not obvious? Terrific we do to! Consider joining us! Join Apple's Customer Systems team within the Information Systems and Technology organization as a Software Engineer. This team builds leading edge custom applications that serve Apple customers and partners. These applications have helped Apple be #1 in customer support for thirteen years in a row. The candidate must possess strong technology background, excellent leadership skills, be a pro-active solution-oriented individual with strong written and verbal communication skills.", "description": "Institutionalize best practices for applications development to ensure consistent delivery of quality architecture, solutions with high performance and scalability Keep up-to date on latest technology solutions in market to generate innovative ideas to solve business challenges Take technical ownership of multiple system platforms, setting technology roadmap with measurable objectives, monitoring and reporting on results Partner with business to ensure their expectations are met and managed", "key_qualifications": "empty", "preferred_qualifications": "Experience with Spark, Kafka, Hadoop is a big plus Experience in Python and Machine Learning algorithms is a big plus Must be able to brainstorm and communicate technology ideas and issues with peers and IT management Proven ability to innovate solid hands on development experience in recent years.", "education_experience": "Bachelor's degree in Computer Science, Business or Information Management and 10+ years of related experience", "additional_requirements": "empty", "pay_benefits": "empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534089"}