{"title": "Supply Demand Management Planner", "summary": "Apple is a place where extraordinary people gather to do their best work. Just be ready to dream big!", "description": "•    Be the demand and supply representative in India for forecast, inventory, and multi-channel sell through analysis, able to bridge business strategy to operational supply chain management. •    Be a member of the global process to define the launch strategy, including launch target and execution plan of new product introductions and balancing the new product introduction end to end daily planning to ensure smooth product transitions. •    Drive the execution of the weekly and quarterly supply plans that meet Apple’s financial objectives. Evaluate risks. Plan and implement contingency plans to mitigate. •    Partner with Apple Operation team on OEM site strategy development and plan factory capacity requirements based on demand projections, call out the risks and provide prioritization during constraint. •    Partner with the material and global procurement teams to allocate constrained components, ensure Apple pack request and customer commits are able to be secured under an optimized allocation. •    Coordinate with OEM and Apple Operations / Logistics teams to ensure a detailed execution plan through Pick Pack and Ship to deliver an outstanding customer experience. •    Well-versed in Lean/Work Process Improvement methods such as Value Stream Mapping, Kaizen, and Loss Elimination Analysis. Have experience in leading supply and demand planning work process improvement projects and able to find opportunities for work process efficiency improvements. •    Define and measure OEM key performance metrics and drive continuous improvements, such as forecast accuracy, fulfillment rate, etc.", "key_qualifications": "6-8 years of prior experience in Sales & Operation with supply and demand planning is strongly preferred. In this role, you will combine a working understanding of outstanding supply chain practices, strong problem-solving capabilities, and business savvy. You are encouraged to exert thoughtful influence in a matrixed organization - should be a strong teammate and communicator. You should be confident to speak publicly to senior management. Broad knowledge of ERP and supply chain optimization industry tools such as SAP. Six Sigma Black Belts is plus. Strong Excel skills. Ability to troubleshoot and root cause results from thousands of intersections of data. Experience in crafting and using applications such as Tableau is preferred.", "preferred_qualifications": "", "education_experience": "Bachelors Degree from a reputed school; MBA preferred, APICS is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542478"}