{"title": "SE-Operations Specialist", "summary": "Som Operations Specialist skapar du ett smidigt produktflöde i butiken genom att se till att det alltid finns tillräckligt med produkter och genom att utföra arbetsuppgifter på lagret. Du har en entusiasm och expertis som bidrar till att öka försäljningen och förbättra kundupplevelsen – samtidigt som du hjälper andra medarbetare att förstå hur deras beteende påverkar lagerhanteringen.", "description": "Hanterar lagermottagning, inventering, returer och löpande uppgifter enligt gällande Retail Inventory-processer. Kommunicerar proaktivt med kollegor kring statusen på tilldelade lageruppgifter. Främjar förståelse för och medvetenhet om lagerprestanda hos alla medarbetare i butiken. Håller sig uppdaterad om ändringar i lagerprocessen genom att använda kommunikations- och utbildningsverktyg. Svarar på frågor om lagerrapportering. Anpassar arbetet efter Apples visuella standarder. Följer arbetsmiljöbestämmelser. Dokumenterar och genomför andra arbetsuppgifter som ledningsteamet tilldelar. Hanterar och arkiverar myndighetsrelaterad dokumentation i länder där detta krävs.", "key_qualifications": "", "preferred_qualifications": "Processinriktad med sinne för detaljer. Har fokus på kundservice med betoning på både interna och externa kunder. Kan anpassa sig till förändringar och samtidig vara konsekvent. Du är duktig på problemlösning och analys. Du har god social kompetens och samarbetsförmåga. Du kan planera tiden på ett effektivt sätt och är bra på att arbeta inom tidsramar. Du har god kommunikationsförmåga. Du arbetar effektivt utan direkt vägledning. Du kan vid behov själv flytta produkter till butikens lager.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535029"}