{"title": "Software Engineer - Apple TV Camera", "summary": "Apple TV has redefined how we interact with our TVs. Powered by tvOS and built on the same foundations as iOS, tvOS is evolving continually by building technologies for the living room experience. We are looking for a passionate and experienced engineer to join the team. In this role, you will contribute to tvOS’ camera experiences by building new and innovative ways to use a camera and microphone in the living room. The role gives you the opportunity to frequently collaborate with a wide variety of teams at Apple such as Camera, Audio, Vision, FaceTime, Music, UIKit, SwiftUI, AVKit, SharePlay among many others and grow Apple’s software ecosystem.", "description": "The tvOS camera team is responsible for Continuity Camera experiences on Apple TV. If you’re passionate about leading a strong team to deliver on big ideas and working with world-class, cross-functional engineering teams, come work with us. As an engineer working in an ecosystem-heavy organization you will take on complex problems and full-product solutions requiring a focus on high quality and attention to details. You will be working extensively with teams across Apple to bring Apple to tvOS and vice versa. You will be thinking in the long and short term to build products that build on each other and create magical experiences across Apple devices old and new. The team has worked closely together for 6+ years and has a strong collaborative, inclusive and performance-driven culture. As a member of this team you will represent a very well respected team within the company as you help each other grow in your careers.", "key_qualifications": "4+ years experience in commercial-grade software. Significant experience in iOS, tvOS, watchOS or macOS development. Sound knowledge of system software design. Ability to lead large cross-functional efforts. Ability to analyze complex features and drive practical solutions. Passion for quality and close attention to details. Strong communication and interpersonal skills. Ability to deliver solid work on tight schedules. Aptitude to independently learn new technologies.", "preferred_qualifications": "BS CS/CE/EE or equivalent experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547037"}