{"title": "Software Engineer - Data Centre Tools - Apple Private Cloud", "summary": "We are looking for an experienced and motivated Software Engineer to join the Apple Services Engineering team! We build and seamlessly integrate technologies that enrich people’s lives. You will join a diverse team of people who are passionate about developing new technologies and services for our customers. You will be collaborating with many different teams within Apple to further improve the quality of our products. In this role you will be responsible for helping build and run tools for Apple’s Private Cloud Compute. This includes architecting solutions, partnering with application teams, and building automation and monitoring tools.", "description": "You will work cross-functionally to capture requirements, build infrastructure and tooling to support application needs. You will be a conduit for technical expertise in liaising with application development partners providing technical guidance, fixing expertise and architectural insight to development and quality teams. Focusing on solving complex problems using both open-source and in-house tooling to support security and business initiatives while building applications and tools to reduce barriers, decrease friction and speed up delivery. In this role you will make use of existing frameworks and tools, customizing and building from scratch where necessary and scaling existing technologies (or promoting new technologies) to accommodate growth projections and evangelise next generation cloud and DevOps products and processes", "key_qualifications": " ", "preferred_qualifications": "Cloud-native DevOps/SRE experience, Experience with orchestration tools such as Docker, Nomad, Kubernetes, Experience developing infrastructure software and tools, Ability to work on multi-faceted, multi-functional projects", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558325"}