{"title": "Strategic System Engineer", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Our sales team, is in many ways, the face of Apple to our largest customers. Our enterprise customers need to know that with their significant investments in our technologies, everything’s going to work as promised. We are the ones who make believers out of them. We solve technical and business problems to ensure success for both Apple and its customers. We provide both technical sales consulting and support with a goal of transforming the way people work. This is a home-based role.", "description": "We are trusted advisors on the Apple ecosystem, business transformation and Apple platform adoption. We deeply understand our customers’ business and technical ambitions. We help remove technical barriers and friction points, and enhance customer readiness for our platform. We create new standard methodologies and share them. We work multi-functionally across Apple, our Major Accounts’ organizations, channel and other strategic solution partners to change the way people work. Apple doesn’t cut corners, in products or in business. You bring the highest level of integrity, honesty, and accountability in all that you do, every single day. You are a trusted advisor who does what you say you’ll do – and always does what’s best for Apple.", "key_qualifications": "Experience advising on technical business transformation solutions for large enterprises or at least 6 years of experience in a consultative sales engineering role. Bring IT knowledge and have experience in the areas of enterprise messaging, collaboration, Wi-Fi, client management solutions, and enterprise security technologies for iOS, macOS, and competing platforms. Adeptly articulate the benefits of modern deployment methods to your customers and describe the nuances of deploying and managing the Apple platform in large organizations. You are familiar with the features and capabilities of top 3rd party management vendors and are able to demonstrate recommended deployment workflows using MDM and ABM for device enrollment, configuration and app distribution. Comprehend and explain the way Apple devices communicate using common network protocols, wireless standards, modern authentication and APNS. You use that knowledge to promote networking standard methodologies with your customers and align them with resources to remedy networking issues. Understanding of Apple’s security resources and can articulate clearly Apple’s dedication to Security and Privacy. Expertly describe how our layered approach to security lowers risk to users while maintaining the integrity of both personal and corporate data. Given a customer’s security requirements, you can architect a strategy to meet them on our platform. A multifaceted presenter who can effectively convey product and technical information in a relatable way to executive and technical audiences alike. Whether you use slides, whiteboard, or do a live demo - engage the audience and are able to tie the message into real world scenarios.", "preferred_qualifications": "Ability to see the world through the eyes of the customer by deeply understanding their business needs, challenges, and concerns. You know the customer’s current Apple initiatives and can effectively identify technical blockers. Work with account team to include well-defined and measurable steps in your plan to remove blockers and increase technical readiness. Ability to work independently. Familiarity with Apple’s App development tools and the advantages they bring to large organizations demonstrating mobility for business transformation. Confidently explain the advantages of deploying platform specific apps for business and can appropriately guide customers through the best route to development (build/buy/partner) for a given use case.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $149,400 and $224,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553317"}