{"title": "Accessories Quality Engineer", "summary": "Are you passionate about consumer electronics and the technologies that bring them to life? Do you have an eye for the big picture and understand how hardware and software interact to deliver a seamless experience? Does the opportunity to shape product quality for millions of users sound exciting to you? We are the Product Systems Quality team, and we’re seeking a highly motivated and creative engineer with excellent problem solving and communication skills. You’ll join a dynamic team of engineers responsible for driving the quality of Apple’s first-party Lightning, USB-C, and inductive charging accessories. You’ll use your technical expertise to solve difficult problems while collaborating closely with cross-functional partners to drive customer facing issues to resolution. You’ll assist with enabling accessory testing at our vendor sites as well as lead large cross-functional accessory programs. You’ll leverage your technical expertise to identify and solve problems at the intersection of Hardware and Software. This position also requires leading large scale cross-functional accessory projects from test plan creation, firmware architecture knowledge, organizing meetings, reporting on results and highlighting risks. Come join our team!", "description": "- Design comprehensive test plans to validate Apple accessories features and experience across common and corner customer scenarios. - Automating repetitive tasks, reporting results from multiple test site locations. - Debug with vendor engineers on site or in real time. - Collaborate with cross-functional teams to drive test design, coverage reviews, execution and reporting. - Support automation deployment at test sites (shipping, logistics, troubleshooting, data sharing). - Be the champion for customer-facing quality in every phase of the development process.", "key_qualifications": "", "preferred_qualifications": "Expertise in QA methodologies and processes. Experience leading or managing quality teams/projects. Knowledge of USB and Inductive charging, applications and test methodologies.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553076"}