{"title": "Camera Image Sensor Analog Design Engineer", "summary": "Are you a leader and want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? The Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, iPod, and AppleTV. We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies.", "description": "As a Sensor Analog Designer owning the specification and verification of sensor analog performance and many aspects of sensor interfaces, you will be: Collaborating with global sensor suppliers to develop and evaluate new sensors Collaborate with sensor designers in analyzing analog readouts and support blocks Detailing and presenting your results to both internal and external engineering teams Working with the internal customer teams to evaluate the contribution of the sensor to system performance Working with collaborators to assure that sufficient and accurate verification/testing is implemented at all stages to guarantee performance", "key_qualifications": "10+ years of analog design in the context of electro optical sensors Proven understanding of device physics Ability to use industry standard design tools Hands on experience with characterization of sensors Experience in crafting digital systems at the RTL level Multi-disciplinary understanding of EE, CE, and Physics principles is a plus Experience with image sensor technologies is preferred Ability to work closely with others in a very multi-functional team environment Proven ability to drive, influence and lead technical engagements Ability to detail and present your results across collaborators", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10+ years of relevant industry experience is required. MSEE or PhD is preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519240"}