{"title": "Data Engineer, Apple Services Engineering", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire world. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Are you ready to be part of a team that turns innovative ideas into extraordinary products and experiences? The Apple Services Engineering - Experimentation data engineering team provides insights through data that drive decision-making for our engineering and product teams. We are looking for a Data Pipeline Engineer who can automate and build data pipelines for our search and recommendations features. Imagine what you could do here. At Apple, creative ideas have a way of becoming wonderful products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!", "description": "This team designs, executes and builds tools for online experiments (A/B tests) and offline experiments (human relevance judgement) that help us improve and fine tune our data-driven features. Your primary focus will be to automate the delivery of various datasets by working with Data Scientists on the team to understand critical metrics/KPIs and how they are derived. You will write and maintain the code that ingests, computes and organizes various data sets.", "key_qualifications": "", "preferred_qualifications": "Proficiency in using query languages like SQL, Hive and SparkSQL. Experience with entity-relationship modeling and understanding of normalization. Experience with sessionization of clickstream and time-series data is a plus. Familiar with the concepts of dimensional modeling. Experience with Continuous Integration, Version Control such as git. Experience with data visualization tools, such as GGplot, etc. Deep understanding of data structures and common methods in data transformation. Keep up-to-date with the newest technology trends. Working with software engineering teams to improve data collection procedures. Processing, cleansing, and validating the integrity of data used for analysis. Engineer code that is durable and reliable. Performance tune and optimize code as data grows and needs change. Generate reports (that can be automated) to present key insights to internal partners and leaders across engineering and product teams. Showcase real passion for visualizing and making sense of data analysis.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559793"}