{"title": "Software Localization Project Manager", "summary": "Are you looking for a great opportunity to work on a dynamic team passionate about delivering world-class localized software on some of the world’s most creative consumer electronic products? Do you love the challenge of solving complex problems that can have a direct impact on the success of the company? Software Localization Project Management team is looking for a highly motivated, energetic, and experienced Software Engineering Project Manager to research, define, and drive software localization strategy and software improvements that are outstanding to particular regions of the world.", "description": "You’ll collaborate with other teams to define and drive improvements across software engineering. You’ll also coordinate with engineering, QA, and international teams to resolve software problems. Further, you’ll be working multi-functionally to review and prioritize future software development. Other responsibilities include developing tools to make localization workflows more efficient and automate tasks to improve efficiency and quality; integrating localized software content with core software product deliverables by developing schedules for software localization projects; helping investigate the root causes of international issues that are found in localized software; and evangelizing international engineering issues.", "key_qualifications": "5 years of experience with each of the following skills is required: Good communicational skills, Project management experience and skills, Ability to collaborate with international multi-functional software projects involving engineering, quality assurance, and international and marketing teams, Deliver processes and tools to support product specific for regional markets, Basic knowledge in Unix, Shell Scripting, Python and other computer languages", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science, Electrical Engineering, Electronic Engineering, Languages Translation/Interpretation, Localization or foreign equivalent.", "additional_requirements": "Preferred requirements are a Bachelor’s degree or foreign equivalent in Computer Science, Electrical Engineering, Electronic Engineering, Languages Translation/ Interpretation, Localization or related field and 5 years of experience in the job offered or related occupation. Alternatively, a Bachelor’s degree in Computer Science, Electrical Engineering, Electronic Engineering, Languages Translation/Interpretation, Localization or foreign equivalent and 5 years of progressive, post-baccalaureate experience in the job offered or related occupation.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,278 and $195,200 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540340"}