{"title": "Cloud Engineer - Ad Platforms", "summary": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.", "description": "Create frameworks that enable developers to interact with Apple Cloud Infrastructure to test their code. Design our next-generation container platforms to run Ad Platforms services. Create tooling to enhance the observability of Ad Platforms systems. Develop expertise in Apple Infrastructure and standard methodologies, applying them to run world-class distributed systems. Design and develop tools to improve infrastructure reliability. Improve areas such as capacity planning, configuration management, and monitoring. Collaborate with engineering teams to improve on-call efficiencies, drive incident management, and conduct post-mortem analyses. Design and improve new and existing system architectures based on reliability and high availability principles, integrating extensive logging and observability. Establish robust deployment and delivery pipelines.", "key_qualifications": "6+ years of extensive experience supporting internet-facing production services and distributed systems. Expertise in Infrastructure as Code (IaC) tools like Terraform. Expertise in operating Linux-based systems, with a solid understanding of its internals. Experience in container platforms like Kubernetes and Nomad. Proficiency in operating infrastructures on AWS. Strong programming skills in Python (required) or Go (nice-to-have). Demonstrated problem-solving ability with a creative and innovative approach. Strong sense of ownership, customer service, and integrity with a desire to communicate and collaborate with teams. Experience in mentoring and developing more junior engineers. Self-motivated and eager to learn and grow.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or equivalent industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548616"}