{"title": "Technical Project Manager - Apple Online Store", "summary": "At the Apple Online Store (AOS), its Engineering team is responsible for the global eCommerce platform that serves millions of customers around the world. We are a team highly skilled Project Managers, Software Engineering Managers, Engineers, Product Owners and Analysts based in Cupertino, London and Singapore. The Apple Online Store team in London is looking for an exceptional Technical Project Manager with substantial experience of delivering complex software development / engineering projects using Waterfall, Agile or Iterative software development methodologies. The successful candidate will need to be an experienced, proactive, results-oriented project manager with a track record of success in managing web based, transactional application development. A substantial part of the role will require close engagement with Project Management, Engineering and Product Management teams based in Cupertino.", "description": "The ideal candidate in the role is expected to establish and drive assigned projects, either as outright owner of the project or an assigned subproject on a larger programme with a view to manage a number of PMs in demand generation PM team. They will take ownership for the success of the project deliverables, both in terms of project delivery and business outcomes, including: Establishing a close working relationship with business owners and stakeholders, understanding their immediate requirements as well as future programme roadmaps. Creating project documentation in accordance with the appropriate methodology for technical and business audiences. Managing IT teams, offshore development teams and third parties to deliver cross functional software features and enhancements against the schedule and budget. Becoming a valuable part of the global AOS Project Management team. Working closely with the team members to ensure that the team have a clear view of project progress and resource usage across the portfolio. Managing expectations of key stakeholders – taking a clear interest in the success of the project outcomes, not just the technical delivery. Being an active member of the EMEIA AOS Team, supporting colleagues and peers to help achieve Apple’s overall goals and those of the team. Play effective roles in hiring and one boarding new team members.", "key_qualifications": "", "preferred_qualifications": "Bachelors degree in a related field.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555410"}