{"title": "New Product Tech Project Manager (Korea)", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here! We are looking for a New Product Tech (NPT) Project Manager for Korea. As an NPT Project Manager in the New Technology organization, you will be responsible to ensure timely deliveries of incoming materials and out-going modules. Your goals are to resolve all logistics and material issues along the supply chain in order to secure program schedule, and communicate logistics topics with program teams. We believe this is an excellent opportunity to work on New Technological programs in an outstanding company that consistently brings innovations to the world. Join the team and help us leave the world better than we found it!", "description": "-  Track point-to-point deliveries of engineering BOM (bill of materials) -  Drive day-to-day delivery readiness to meet overall program objectives -  Establish and optimize logistics process across worldwide supply chains -  Raise and resolve all shipping logistics related issues (custom delay, flight disruption, material shortage, etc) -  Analyze and ensure production material Clear-to-Build", "key_qualifications": "At least 3-year experience in supply chain or program management field, Outstanding oral and written communication skill in English and Korean, Excellent analytical skill and problem-solving skill, Detailed orientated and can-do attitude, Strong work ethic with a high degree of flexibility, Proven ability to collaborate with multi-functional teams to achieve project goals", "preferred_qualifications": "", "education_experience": "Diploma/Degree in Engineering or Supply Chain management field, or equivalent.", "additional_requirements": "-  Concept of international trading or customs operation is preferred -  Experience in the technology industry, electronic manufacturing, or new product program management is preferred -  Mandarin is a plus -  20~50% traveling is required on demand", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547420"}