{"title": "Operations Product Development Manager", "summary": "Imagine what you could do here. At Apple, we believe great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. A successful Operations Product Development Manager has very strong interpersonal skills and relationship building skills with the ability to effectively influence peers and management. These roles require a deep understanding of consumer electronics components, supply chains, and manufacturing cost structures as well as DFMA knowledge. Are you a self-starter with a strong sense of ownership and a creative problem solver? Can you quickly switch between minute details and the big picture while working multiple projects with contending priorities? If yes, we hope you will consider joining our Apple team.", "description": "Early Engagement: • Understand key mobile technologies (Multitouch, LCD, Wireless Si, Flex circuits, Mechanical enclosures, etc) from a cost, supply chain, and technical perspective • Identify cost trade-offs that stretch design limits • Challenge generally accepted supply chain, design, and feature rules • Present tradeoff recommendations to cross functional and executive teams • Serve as a “one stop shop” to advise the development teams on operational, cost, and supply chain issues • Influence the product roadmap from the business perspective as the advocate for the operations teams • Drive the Procurement and Operations teams to prepare for the coming product roadmaps; identify and address gaps Cost Management: • Manage product cost based on a corporate margin target • Assist Procurement managers (GSMs) in deriving accurate and bold should-costs • Set individual cost targets for each component/module as needed • Drive GSMs to meet these targets and/or should-costs • Identify cost opportunities within the design envelope; work towards cross-functional implementation • Optimize capital equipment budgets Supply Chain: • Develop the Supplier Plan of Record (SPOR) for each new product • Facilitate discussions between Engineering, Operations, Procurement, and Quality team members for each key component • Focus on strategic supplier selection from a procurement standpoint • Metrics on unexpected supply disruptions, unplanned post-ramp qualifications • Present SPOR for approval by executive team", "key_qualifications": "", "preferred_qualifications": "MBA, MS a plus Experience in Supply Chain, Operations or a related field", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551678"}