{"title": "Machine Learning and Generative AI Manager - SIML, ISE", "summary": "Are you interested in leading a team to build products that utilize machine learning, generative AI, and computer vision technologies? Are you looking to produce highly-visible features and magical user experiences? We are the Core Recognition group that is responsible for building best-in-class technologies that fuel innovation and user experiences across all Apple Platforms. We are an R&D team that pushes the limit of hardware and software to produce foundational machine learning technologies that enable amazing features like Math Notes, Smart Script, Scribble, and Live Text. We are seeking an outstanding machine learning manager to help provide engineering expertise and innovative thought leadership, as we develop our next generation of recognition solutions that will enrich the everyday lives of millions of people.", "description": "As a manager within the Core Recognition group, you will lead a growing team to innovate and deliver high-impact features through the design and development of platform-wide experiences and core technologies, including handwriting and text recognition, handwriting synthesis, and document understanding. This role will have the following responsibilities: - Drive experience and product improvements for interactive text and handwriting solutions for Scribble and Live Text users. - Manage, mentor, and grow expert teams of software engineers. - Architect and advance the development of document understanding and generative products and features. - Drive technical and multi-functional projects and provide leadership in an innovative and fast-paced environment", "key_qualifications": "Not available", "preferred_qualifications": "Experience productizing text or handwriting recognition solutions, Experience prototyping or productizing generative systems, Development experience with CoreML, Torch, TensorFlow, or related technologies, Familiarity with iOS, macOS, or Unix development, Familiarity with performance analysis tools and system optimization, Track record of delivering user-facing products", "education_experience": "Not available", "additional_requirements": "Not available", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $286,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557688"}