{"title": "Software Engineer/Programmer - 3D Animation (Apple Vision Pro)", "summary": "Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us.", "description": "Apple makes the newest technologies accessible to build delightful experiences. As part of our team you will have the opportunity to design, architect and develop start-of-the-art solutions to make character animation development accessible on our platforms. You are comfortable working in a dynamic, creative and fast paced environments. Engineers on our team will work quickly and smartly to determine viability of ideas and technologies. You will need keen understanding of 3D animation development and an ambition to explore unknown territories. In this position, you will work with our team of engineers, artists and designers and work closely with organization across Apple to develop these animation technologies.", "key_qualifications": "Solid knowledge and experience with C++, Experience with real-time skeletal character animation techniques, Experience with game engines, Good understanding and comfort with 3D maths (linear algebra), Detail-oriented approach to planning, execution, and maintenance, Excellent communication skills; ability to collaborate successfully with peers from diverse experiences and backgrounds, Ability to drive results in a fast-paced and agile organization.", "preferred_qualifications": "", "education_experience": "BS / MS in Computer Science OR equivalent degree and at least 6 years of experience.", "additional_requirements": "Familiarity with any of the following technologies: ARKit, RealityKit, SceneKit, Proficiency in macOS, iOS, or Unix development practices, Experience in 3D Animation, 3D Math, or Motion Capture technologies, Experience building AR/VR apps either professionally or personally, An interest and passion for AR/VR Technologies.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539458"}