{"title": "Security Software Engineer, Systems Security", "summary": "We are a dedicated team of software engineers that work on security hardening across all of Apple’s operating systems. We focus on projects ranging from systems security and compliance automation to building next generation of security tooling. As a Software Engineer in Systems Security, you will gain hands-on experience securing a variety of low-level OS software. Your career development will be guided by training and mentorship in secure software development principles, security mitigation concepts, and cross-functional project execution. Your work will have a significant impact on the security of all of our users’ devices. As a result of the collective effort of dedicated engineers like yourself, Apple’s products are the most secure consumer devices on the market. Our mission is to continue to advance the state of the art of end user security. Our goal isn’t simply to be the most secure: we’re working to ensure the safety of every user’s digital life, even against the most malicious and well-resourced adversaries. Our ideal candidate is able excel in a highly creative, self-motivated, and diversified, fast-paced environment.", "description": "Each project will involve solving unique challenges while handling the following core responsibilities: - Design and develop core security and compliance automation solutions to allow Apple to grow in a secure fashion. These are automation tools and services that will: - Anticipate and prevent failures - Reduce signal to noise in alerts, monitoring, and tracking - Track, monitor, mitigate, and report - Contribute to the design of software security hardening projects - Implement project tests to cover relevant security properties, creating unit tests and collaborating with teams as necessary - Contribute to documentation and training materials required for partner teams to maintain security properties going forward. Communicate empathetically and effectively during all project phases. Interpersonal skills are key to this role, as your work will frequently involve other organizations as our representative", "key_qualifications": "", "preferred_qualifications": "Superior organizational and communications skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555464"}