{"title": "Senior Software Developer - Java - Customer Engagement for Apple iCloud, Apple Music and more", "summary": "Apple Services Engineering is the team behind high profile services such as Apple iCloud, Apple Music, Apple TV+, Apple Arcade and more. We are looking for a world-class software engineer to design and build the software for our customer engagement platform, used within Apple Services for customer message delivery.", "description": "The ASE Customer Engagement engineering team is responsible for building the platform that enables communicating with millions of customers every day, across services such as Apple iCloud, Apple Music, Apple TV+, Apple Arcade, Apple News+, Apple Fitness+, Apple Wallet and more. In this team, you would be responsible for designing, building, improving and maintaining server-side apps that process requests at phenomenal scale, with low latency and high availability, supporting customer messaging features for our Apple Services. These services orchestrate customer messaging built by operations teams using our self-service platform.", "key_qualifications": "Experience in designing and building production APIs using micro-services written in Java is required. Skilled at writing clean and high-performant code in Java. Skilled at using test driven development to empower CI/CD workflows. Using data structures, concurrency and design patterns. Designing and building loosely coupled and eventually consistent distributed systems. Technically leading software development projects across teams. Owning critical architectural decisions that have long-term impact on success. Communicating effectively, both written and verbal, with technical and non-technical cross-functional teams.", "preferred_qualifications": "", "education_experience": "Undergraduate degree related to computing or equivalent experience. Experience in Java core programming is required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is between $143,100 and $264,200 and will depend on skills, qualifications, experience, and location. Apple employees have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount. Comprehensive medical and dental coverage, retirement benefits, range of discounted products, free services, reimbursement for certain educational expenses, discretionary bonuses, commission payments, and relocation are included. Learn more about Apple Benefits.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540848"}