{"title": "Senior Software Developer - Security Solutions", "summary": "Apple is seeking an outstanding Senior Developer to support our team in building and deploying highly scalable and efficient security solutions that will help secure Apple through identifying and reporting security risks. If you have a passion for building security products this role will enable you to apply your skills to solve new and exciting problems.", "description": "The ideal candidate will be involved in helping to deliver and improve on our in-house security solutions, taking care of solutions that need to scale up across all of Apple responding to the latest events within the security landscape. It will be a mix of hands-on development, provide design and architecture guidance, and mentoring and technical support to other members of your team. Apple is an equal-opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "key_qualifications": "Over 5 year of proven track record in software development and architecture in Golang; Solid grasp of Linux operating systems; Solid grasp of, and familiarity with, networking concepts (socket programming, etc); Experience with AWS; Experience with infrastructure as code (Pulumi, Terraform, etc); Experience with metrics and analytics tools for monitoring and observability (Prometheus, Grafana); Experience with query languages for database management (ideally PostgreSQL) and operations", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "-  Experience with Python; -  Experience with GRPC; -  Experience developing security auditing products; -  Experience in vulnerability research", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529092"}