{"title": "App Store Business Lead - India", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The App Store is the world's largest and most innovative software store, serving hundreds of millions of iPhone, iPad, Apple TV, Apple Watch, iMessage and Mac customers! We are looking out for a multifaceted and passionate leader to join us and lead App Store business relationships with developers based in India. We are looking for someone with real passion for technology and experience in handling relationships. We are seeking a highly qualified business leader to lead the App Store Business for India. A key member of Services leadership in India, you will be driving the vision for growth for App Store and corresponding developer businesses in the country.", "description": "-  Build and lead relationships with developers and partners. -  Work closely with multi-functional groups within Apple to help developers be successful. -  Use metrics and methodologies to develop deep expertise in the App Store’s business and functionality to provide well-informed guidance to developers. -  Help developers to define new usage, user experience and business models. -  Identify new market trends, business opportunities, and key potential relationships. Use developer feedback and analysis to recommend improvements. -  Encourage the editorial team to craft the best editorial experience possible, and help our customers to find the greatest apps and games!", "key_qualifications": "15+ years of proven ability across consumer tech, management consulting, and corporate strategy roles delivering business growth in the digital world. Strong understanding of consumer tech landscape, and subscription economics in the region with a deep passion for mobile technology. Relevant proven experience in business development, partnership management, product management, management consulting, or business analysis. In-depth knowledge of the mobile app landscape, third-party products, and industry trends would be a plus. Excellent leadership and interpersonal skills, ability to influence leaders through storytelling. Strong analytical focus and use of metrics to make informed decisions. Ability to work both independently and as a team. You should have a track record of developing outstanding presentations and delivering them to both large and small groups, including to senior leaders. Excellent organisational skills and the ability to manage multiple priorities at a time. Passion for and understanding of Apple brand and products.", "preferred_qualifications": "", "education_experience": "Bachelors degree or equivalent experience in Business or related field. MBA or equivalent experience degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547234"}