{"title": "Analog Mixed Signal IC Design Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented Analog Mixed-Signal IC Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day\n\nApple Silicon Engineering is seeking qualified circuit designers to work on the next generation analog & mixed-signal (AMS) circuits for Apple’s world-leading systems-on-chip (SOCs)! Apple’s Ax SOCs are the brain of every iPhone and iPad. Several types of AMS circuits are used to connect them to the physical world as well as enable optimizing their performance. You will be part of a growing AMS team involved in design and productization on leading-edge CMOS process technology nodes!", "description": "The team member will have a strong knowledge of mixed-signal design techniques and understanding design trade-offs. A deep understanding of transistor operation and device physics as applied to analog and digital IC design. Possess strong circuit analysis skills (e.g., AC/DC circuit analysis, small signal circuit analysis, feedback loop theory, statistics, etc). A good knowledge of basic analog circuit building blocks (e.g., band-gaps, bias circuits, op-amps, switched-cap circuits, regulators, etc.) digital building blocks (e.g., latches, flip-flops, logic gates, etc.), and feedback/compensation techniques. Strong knowledge in digital circuit clocking, design, verification and analysis. You will know how to use of Cadence schematic and layout entry tool (Virtuoso). Spice simulation tools (e.g., HSpice, Spectre). Knowledge and/or experience in any of the following areas: High-speed circuits, Low power and low noise design techniques. High precision techniques in presence of device mismatch. Also, knowledge of C/Matlab/VerilogA modeling of AMS blocks. Know scripting languages (e.g., Perl, Python). Use of spectrum analyzers, oscilloscopes, signal generators, etc. Static timing analysis.", "key_qualifications": "Perform transistor-level feasibility study and modeling for various analog/mixed-signal circuit blocks\nDesigning blocks and documenting design simulation and verification towards formal design reviews\nDrive mask design to implement layout views of designs and drive layout reviews\nPost-layout and top-level simulations to validate top-level integration\nRun design verification flows (e.g., electro-migration, IR drop, LEC, timing, etc) to verify design is ready for tape-out\nParticipating in production and bench-level test plans\nTaking lab measurements to validate performance compliance with the spec\nParticipating in reviewing yield/lab test results to drive bug fixes", "preferred_qualifications": "", "education_experience": "BSEE with minimum 3+ years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529626"}