{"title": "K-12 Education Account Executive", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Apple Education team helps institutions transform their teaching and learning environments while growing top-line revenue for Apple. To realize this goal, we gain a deep understanding of the education sectors we engage with—at all levels from strategic to tactical. We create a vision that inspires educators to transform their classrooms using Apple products. We collaborate closely with internal and external partners to create plans for solutions and new use cases, and then we help drive execution of the solution. As a K-12 Education Account Executive, you will lead and enhance sales engagement for K-12 Education institutions in an assigned territory. Through our direct sales approach, you will be responsible for demand generation and uncovering new business in a targeted customer base while supporting and managing relationships with existing customers.  This is a home office, field sales role based in the posting location and requires up to 40% domestic travel.", "description": "In this role, you will: - Understand the organizational structure, decision-making process, and political considerations in the Education Sector. Call and influence at all levels across accounts. Understand the needs and issues facing Apple’s Education customers. Craft sales opportunities and projects to increase sales and establish a dominant share position in Apple’s Education accounts, and presenting and selling 1:1 initiatives into the Education marketplace. Effectively articulate and present Apple’s education leadership messages. Apply Apple’s complex sales methodology to find opportunities across accounts. Establish collaborative relationships with our RTM partners to increase sales coverage and growth", "key_qualifications": "", "preferred_qualifications": "Deep understanding of the Education market is a plus. Ability to build rapport with new customers across all levels of an Education organization. Ability to articulate Apple Education Products strategy as well as Apple Value proposition. Relevant sales experience, depending on the nature of that experience, with technology based products. Excellent verbal and written communication skills. Strong time management and organizational skills, along with the ability to work independently", "education_experience": "Bachelor’s degree or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541342"}