{"title": "SoC Memory Performance Engineer, Platform Architecture", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! In this role, you will be a member of the Platform Architecture team, working with hardware and software engineering groups to shape the architecture of Apple's future System-on-Chips (SoC). We are seeking an energetic and highly motivated SoC performance engineer to drive development of our memory controllers and system caches for the next-generation of AR/VR and Cellular/5G applications. The position calls for independent performance modeling and simulation, documentation, and collaboration with design/software teams. We are looking for SoC architects with a passion to innovate new hardware concepts and model them in C++/Python to demonstrate their value and impact.", "description": "You will have responsibilities for developing the SoC hardware solutions that drive the architecture of Apple’s future System-on-Chips. Your work will be highly visible and critical to delivering the best performance and power efficiency in Apple’s future products. You will be expected to collaborate with all the hardware and software teams that are part of Apple’s SoC development: - C++ performance modeling of proposed architectural solutions and features. - Writing architectural specification documents in collaboration with engineers across different fields. - Gathering, analyzing, and validating measured and simulated results to compare architectural design alternatives. - Work with the multi-functional teams to develop architectural solutions. - Improve Apple’s modeling platform by developing APIs, tools, and optimal standard examples that can be used throughout the company. - Carefully analyze and present results to enable data specific architecture/design. - Measure and analyze existing SoC and workloads. - Some international travel is required for this position.", "key_qualifications": "Solid knowledge of cache management and memory controller for DRAM technologies. Prior experience on writing a cache and memory simulator using C++ is a big plus. Excellent C/C++/scripting coding, debug, and testing skills. Papers published in top computer architecture conferences/journals and filed patents related to computer architecture, demonstrating the ability to design and evaluate different cache and memory performance techniques. Prior work on analyzing the memory access patterns and bandwidth/latency requirements of CPU, GPU, Video, Camera, Machine Learning hardware accelerators, or similar areas. Expertise in cooperative code development using a revision control system such as GIT. Strong communication and documentation skills.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200500405"}