{"title": "iPhone Hardware Senior System Design Engineer", "summary": "Do you have a feeling of deep satisfaction when a design decision that YOU were responsible for is showcased in a newly released product? Do you just beam at the thought of “I made that!” Would you like to have that same feeling again, and again? The iPhone team is looking for experienced Hardware Design Engineers who are motivated by the opportunity to make design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!", "description": "This is a unique hardware design position that starts at product concept and continues all the way through to mass production. You will be at the center of iPhone product development with a critical impact on overall design. Lead designs that continually push the boundaries of technology and ultimately improve the iPhone user experience. Design and integration of custom hardware into constrained systems. Work daily with multi-functional technology teams in a fast-paced environment. There will be opportunities for international travel.", "key_qualifications": " ", "preferred_qualifications": "MS Electrical/Computer Engineering or equivalent, Strong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitude, Exposure to solving unwanted coupling and interference between subsystems, Proven track record of leading dynamic multi-functional teams, Familiarity with the challenges of taking a product from early architecture through to production, Hands on experience with lab test equipment to debug difficult/intermittent hardware issues, Schematic capture and rigid/flexible PCB layout, Fundamentals of Signal and Power Integrity, Low voltage power regulation and delivery, Prototype design and validation with custom silicon, Use of scripting languages to assist with hw development", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557810"}