{"title": "Senior Software Engineer Frontend, Ad Platforms", "summary": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed to empower people, including our advertising platform. We deliver ads in a way that benefits both customers and advertisers — helping people discover content, supporting creators, and protecting and respecting everyone’s privacy.", "description": "Advertiser Experience team is a diverse, global, agile engineering team that builds best-in-class UI experience for our Advertisers. The team works with numerous cross functional partners to deliver revenue impacting features, and to build design systems and foundations for UIs across Apple Ads. The team moves smart and fast by consuming and optimizing readily-available technology, collaborating to improve and scale capabilities across businesses and use cases, and sharing our own innovative solutions so everyone can benefit. You Will: * Build the foundational pieces of the next generation of Apple’s Ad Platforms * Collaborate with product management and UX teams to define experiences for consumers. * Design and implement performant orchestration layers, scalable web components and libraries.", "key_qualifications": "Strong industry experience building scalable and highly performant consumer facing web applications. Demonstrated excellence of analytical and problem solving skills. Proficiency with modern web technologies like HTML5, CSS, Javascript. Experience with at least one popular JavaScript framework such as Angular, React, Backbone, Ember, Vue, Svelte. Deep Knowledge of Node.js and framework such as Express, Fastify. Experience creating NodeJS custom middleware to handle authentication, routing, error handling, and application-level functionality. Experience interfacing with and building REST APIs and GraphQL endpoints. Strong understanding of UX and UI design principle. Familiarity with the complete web stack, including protocols and web performance optimization techniques. Experience working in cloud based environment. Demonstrated excellence in written and verbal communication. Desire to work in a fast-paced and challenging work environment. Exposure to TypeScript, RxJS and other ES6 constructs is highly desirable. Understanding of testing strategies and methodologies, exposure to test harnesses like Karma or Jest is a plus. A creative eye, passion for visual design and a penchant for seeking pixel perfection in the finer details of UI and UX. Familiarity with Advertising Technology is a plus.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547806"}