{"title": "Health Sensing HW - Electrical Engineer", "summary": "The Health Sensing team design, develop, and launch next-generation Sensor Technologies in Apple products. The key goal of the Health Sensing team is to enable the world’s best user- experience. New challenges arise everyday that require the sharp problem-solving skills of dedicated and hard-working individuals. The team features a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation. The people on the team don’t just build products. They deliver inspiring technology and information to users on the most critical area of their lives - their health. Dynamic, experienced people and inspiring, innovative technologies are the norm here, not to mention stories of how these features helped improve or save people’s lives.", "description": "-  Conducting system, board level design, and the projects designated for the team, which will span the lifecycle of a new product from initial design and functional specification of new hardware features and architecture design all the way to supporting and validating these features (35%); -  Reviewing and commenting on schematics and system reviews, developing analysis tools for hardware performance, performing sophisticated system level tests, resolving issues in existing products, and performing unit testing and integration testing (25%); -  Driving the development of component/module vendors and tester/evaluation plan bring-up to deliver scalable solution to support Apple mass production in a high quality way (25%); -  Collaborating with hardware, system, operations, and test engineers that will be applying the health sensing feature, as well as writing design and architecture documents (15%); and -  up to 15% travel required.", "key_qualifications": "3+ years of hands-on experience and consistent track record in electrical or system hardware engineering. Strong electrical engineering background on analog, mixed signal and failure analysis with mass production experience. Proficiency in SPICE, Matlab, Python, LabView or similar scripting and simulation tools. Excellent written and verbal communication skills, as well as proven partnership and leadership skills. Knowledge of system and firmware development is a huge plus. Experience in optical module development and quality management is a plus. Experience in working overseas manufacturers and vendors is a plus.", "preferred_qualifications": "", "education_experience": "-  BS and a minimum of 3 years relevant proven experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540289"}