{"title": "Compiler CPU Performance Manager", "summary": "Apple’s developer tools organization is looking for an outstanding manager to lead our CPU performance compiler team in Israel. You will be leading engineers who develop compiler optimizations, code generation, and tools targeted at getting the best performance for Apple silicon. Our team works across many different organizations on state-of-the art, industry impacting technology that improves the user experience for all Apple customers with better run-time performance, battery life, code size and enhanced security. We closely collaborate with numerous software and hardware teams at Apple and actively participate in the LLVM open source project. We are looking for a leader with strong engineering background who can work closely with software and hardware partners and help advance our compiler technology.", "description": "Would you like to join an organization of highly motivated engineers and managers who are passionate about performance and interested in advancing compiler technology to the next level? As part of the Apple compiler team you will be leading efforts on developing optimizations and code generation technologies. You will be coming up with and reviewing technical feature proposals, providing engineering guidance through code reviews, assisting with issue debugging and triage, and contributing to implementation of compiler features. You will be working closely with hardware teams on software-hardware co-design ensuring the compiler maximizes capabilities of Apple silicon. You will be actively participating in setting up goals and infrastructure for performance measurement. You will define and drive roadmaps and execution plans for performance analysis, optimization strategies, and report on progress to management and partners. You will be managing, mentoring, and hiring software engineers, foster collaborations within Apple and in open source, and represent Apple’s interests in the LLVM open source project. In this environment you will continuously grow your expertise, learn new technologies, and engage in projects spanning hardware and software teams. Your work will impact applications used by everyday users, countless customers, and give raise to new applications and technologies. Picture this: next time you pick up an Apple device the software running on it will be using your work. If you believe you have additional skills not listed here that would make you a good candidate for this position, please feel free to include a cover letter describing those skills and their applicability to the position. If this sounds of interest to you, we'd love to hear from you!", "key_qualifications": "5+ years of experience in managing a team of engineers or serving as a technical lead\nExtensive experience in compiler optimizations and performance tuning technologies.\nExcellent software design, problem solving, debugging, and performance analysis ability. Strong C and C++ programming expertise and knowledge of common data structures.\nKnowledge of CPU architectures and micro-architectures, their capabilities and performance characteristics.\nExperience in a range of compilers and programming languages is a plus.\nExperience in open source software development (ex:, with the LLVM project) is a plus.\nExcellent organizational skills and adaptive approach to problem solving.\nTrack record of building collaborative working relationships across large organizations.\nPassion for mentoring engineers and helping grow their careers as well as experience in hiring.\nDrive to build a diverse, balanced and dynamic team environment.", "preferred_qualifications": "", "education_experience": "BSc in Computer Science/Computer Engineering/Electrical Engineering or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537351"}