{"title": "Central Team Demand Analyst", "summary": "Apple is a place where extraordinary people gather to do their best work. If you’re excited by the idea of making a real impact, a career with Apple might be your ideal job. Just be prepared to dream big! Collaboration is key at Apple, and every day we'll connect you with your peers and colleagues at one of the most diverse and inclusive companies in the world.", "description": "Work with Reseller Operations Customer Support Account Managers to maximise orders and drive partners to the optimal in-stocks. Develop early alert mechanisms through analytical insights in our data sets to monitor key metrics/ business performance and define assignable actions. Drive a management system to support forecast, order book insights and demand planning. Undertake meaningful qualitative feedback on performance and velocity. Challenge, influence and negotiate with operational partners across the organization. Manage the validation and publication of weekly shipment plans.", "key_qualifications": "Extraordinary data analytical skills, including the ability to model, interpret and provide meaningful insights to customers. Excellent attention to detail. Ability to present complex analytics to an executive audience. A fast learner who can quickly apply and adapt knowledge in varying complex situations. Proven record of working cross-functionally with a variety of partners including sales, finance, logistics, and supply chain teams. A propensity to unlock the potential of every relationship, through getting to know people, soliciting input and feedback from a wide variety of people.", "preferred_qualifications": "A relevant 3rd level degree e.g. Engineering, Maths, Economics, Supply Chain, Statistics or Data Science & Analytics would be an advantage. Relevant operations experience, preferably in a high tech or computer related industry. Proficient in Excel and or other data visualisation tools. Presentation skills and program / project management experience, a distinct advantage.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555370"}