{"title": "Embedded Software Engineer", "summary": "The System Firmware and Diagnostics team is looking for an enthusiastic embedded software engineer to join our team. This is an individual contributor role to design and develop the software that gets used by various teams. You’ll have the opportunity to work on core technologies to make a major impact in the way that Apple develops, test and manufactures its products. Our environment encourages product innovation, rapid product iteration, collaboration and a liberating amount of autonomy.", "description": "- In this role you will implement software and drivers for common firmware interfaces, chipsets, communications protocols and various SoC IPs.\n- You will also implement features to support hardware testing and diagnosis of Apple's handheld devices.\n- This is a highly cross functional role and you'll work closely with various teams, like EE, Systems Engineering, Software Engineering, Hardware Testing, QA, Factory, Manufacturing and Operations.\n- The environment is dynamic, fast-paced and requires a go-getter demeanor. The domestic/international travel requirement is 10-20% (flexible and product dependent).", "key_qualifications": "Proficiency in C/C++, some embedded software experience is preferred.\nUnderstanding and experience with ARM platform and architecture/instruction set.\nExperience with SoC bringup\nExperience developing low level drivers\nExperience with debuggers such as gdb, lldb, etc.\nAble to comprehend hardware specs and schematics.\nFamiliarity with scopes and logic analyzers.\nFamiliarity with standard hardware protocols (USB, UART, SPI, I2C, PCIe, MIPI, HDMI, DDR).\nFamiliarity with some form of scripting (lua, python).\nShould be a phenomenal standout colleague.\nExcellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "- BE or MS in Computer Engineering, Computer Science, Electrical Engineering or equivalent. 5+ years of proven experience in a similar role.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528287"}