{"title": "Senior Counsel, Apple TV Original Content - London", "summary": "Apple’s Original Content Legal group seeks an outstanding development and production attorney based in London to provide legal support for the development, production and licensing of Apple’s original productions with a particular focus on local language productions.", "description": "At Apple, our Original Content team is responsible for the full range of legal work for the acquisition, production, and distribution of television and films. Joining us, you'll work closely with the senior legal counsel and business affairs partners on Apple’s Original Content team to structure, negotiate and draft agreements needed to develop, produce and/or license Apple’s original content, from development through exhibition. Developing and encouraging relationships with counterparts within the production community. Counseling and advising partners on legal decisions. You'll be a diligent and dedicated negotiator drafter, an energetic team member on the ground, and a counselor who can translate business objectives into agreements, giving concise, practical legal advice under tight deadlines.", "key_qualifications": " ", "preferred_qualifications": "You will have a mix of law firm and on-point, in-house legal experience with a focus on development and day-to-day production matters for long-form streaming content across the EU\nConcise, clear communication skills with a great track record of influencing business partners\nExperience reviewing chain of title\nDrafting and negotiating agreements to acquire source material\nExperience with applicable collective bargaining agreements\nFamiliarity with production incentives and investment requirements in the UK and EU\nFamiliarity with UK clearance practices and IP laws affecting entertainment content\nEstablished, positive relationships within the entertainment industry\nExcellent written and oral communication skills\nAbility to work collaboratively on cross-functional teams, think practically with a focus on solutions\nStrong analytical capabilities and judgment\nAbility to work proactively, independently and reliably under tight timeframes in a fast-paced environment\nWillingness to tackle matters outside area of expertise", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558958"}