{"title": "CAD Gate-level 3DIC EM/IR Engineer", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple. The people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it! As a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to develop, define and refine the methodologies and flows for gate-level, as well as transistor-level designs. Major tasks will include functional static/dynamic IR analysis, scan mode IVD analysis, package and interposer model handling, 3DIC and multi-die analysis, power EM analysis, SigEM, power switch modeling, design abstract and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more. Are you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?", "description": "In this highly visible role, your primary responsibilities will include: - Development of custom EM/IR solutions that scale with accuracy and capacity challenges. - Streamline and automate EM/IR flow with ownership of the entire flow. - Support and collaborate with design groups (Physical design and integration, circuit design / Power / Package & System / Technology) on their EM/IR requirements for various post-layout flows. - Work with EDA vendors and foundries for tool qualification, debugging, and enhancement.", "key_qualifications": "", "preferred_qualifications": "Ability to coordinate and drive initiatives with little to no oversight. Excellent communication and presentation skills. Hands-on knowledge of industry-leading EMIR tools e.g. Voltus, VoltusFi, RedHawk-SC, Totem. Experience in the development of large-scale software in multi-user, multi-site environments. Hands-on experience in analyzing, optimizing, and debugging IR/IVD/Electromigration issues on high-performance, large-scale designs. Expertise in physical verification, simulations, timing and noise analysis. Experience in package designs and package models. Knowledge in hierarchical EMIR analysis. Transistor-level EMIR analysis methodologies. Experience in ESD analysis.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558373"}