{"title": "Manager, Digital Merchandising, Upstream Shopping Pages", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! Here on the Apple Store Online team, we are responsible for Apple’s largest store. Our main goal is to deliver a magical, personal digital experience where customers can shop, buy and learn everything Apple, wherever they are. Each customer should feel like they are our only customer and our job is to set the bar for the experience they receive. To run such an extraordinary store, it takes extraordinary people, and we are looking for a Digital Merchandising Manager to help us do extraordinary things.", "description": "-  Oversee merchandising story telling and content prioritization for upstream shopping pages for Consumer and Segment Stores across MOW, Desktop and ASA.\n-  Develop and implement comprehensive online merchandising strategies to drive product discovery, generate value proposition awareness, increase customer confidence, and improve conversion rates.\n-  Collaborate with WW NPI Merchandising, Regional Merchandising teams, Product Marketing, Commercial teams, Retail Engagement Marketing, AppleCare, Education Marketing, Marcom Brand, and publishing team in support of commercial and brand priorities.\n-  Ensure regular reporting and insights to communicate page performance, merchandising trends, and actionable recommendations to stakeholders and senior leaders.\n-  Ensure Online merchandising requirements and business insights are incorporated into Retail Campaign and Seasonal briefs.\n-  Oversee the development and execution of seasonal campaigns, promotions, and sales events across /Store, Shop LOBs and ASA pages.\n-  Attend design reviews and provide feedback on merchandising asset designs and content, ensuring they are achieving the requirements of the brief.\n-  Monitor NPI, campaign performance, analyze results, and iterate on strategies to optimize ROI and drive revenue during peak and seasonal periods.\n-  Foster a collaborative and results-driven culture within the team, promoting knowledge sharing and best practices across functions.\n-  Cultivate a culture of innovation, creativity, and continuous improvement within the team, encouraging experimentation and exploration of new ideas and strategies.", "key_qualifications": "8+ years digital merchandising or equivalent experience.\n3+ years of people management experience desired.\nValidated experience establishing vision and goals and developing strategic and tactical plans.\nDeep knowledge of the retail industry and digital commerce trends.\nExperience working closely with creative teams to build customer experiences and define shopping journeys.\nExperience building internal and cross functional processes to support new work streams.\nProven experience translating business priorities into impactful merchandising stories.\nStrong knowledge of merchandising tools and operational implementation.\nExcellent project management skills, including work prioritization and planning.\nSuperior verbal and written communications skills including at the executive level.\nOutstanding ability to problem solve, develop creative solutions, and demonstrate resourcefulness.\nOutstanding analytical and numerical aptitude; proficient in site analytics tools and comfortable working with data sets and making decisions based on data.\nHighly skilled at building effective presentations and storytelling including at the executive level.\nProven ability to influence across teams to drive innovation and results.\nHas the ability to establish a robust team that drives detailed execution with accountability for results.\nDemonstrated people manager who builds capabilities of individuals and teams through effective employee development, involvement, communication, and guidance.\nRole models inclusive leadership behaviors and builds, develops and retains diverse teams.\nContributes to an inclusive environment through respecting each others' differences and having the curiosity to learn.\nDemonstrates Apple's values of inclusion and diversity in daily activities\nTakes action to ensure a safe, respectful, and inclusive environment for all team members.", "preferred_qualifications": "", "education_experience": "BA/BS or equivalent experience, MBA a plus.", "additional_requirements": "Regular meetings with peers in Asia and Europe during overlapping business hours.\nFlexibility for occasional evening or weekend work during critical time periods.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $149,500 and $279,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548258"}