{"title": "Apple Services Engineering - Content Support Engineer", "summary": "Digital Supply Chain Content Support Engineering is the intersection of content (Apps, Video, Books, Music, Podcast), processing, CMS tools and support process. We are the grease and the glue within engineering team that creates the largest media store in the world.", "description": "You'll join an integral support and operations team inside the Apple Services Engineering (ASE) engineering org, working closely with our engineering teams to support multiple projects and features across the ASE ecosystem. You'll also work cross-functionally with our internal business and operations teams in testing, monitoring and production support across these projects and features. Utilizing both technical and interpersonal skills will be essential to succeed in this role.• Serving as the primary point of contact for all technical groups and customers to address support issues and requests• Conducting technical analysis of incidents, performing root cause investigation and review with Engineering teams• Reporting, monitoring and troubleshooting the apps pipeline and performing workarounds as needed• Working with Engineering teams and SRE's to develop, implement and improve Incident Management and Problem Management• Working with Project Managers and Operations on new projects and developer communications• Analyzing workflows, filing detailed bug reports and following through until the issue is resolved", "key_qualifications": "Experience diagnosing technical issues, Experience with SQL, JSON, Knowledge of process management, metrics and KPIs, Enjoy technical challenges and have the ability to work with various teams, Excellent interpersonal skills, especially the ability to filter and distill meaningful information to the right audience., Self starter with a strong sense of personal responsibility and a technical orientation., Customer focussed", "preferred_qualifications": "", "education_experience": "Minimum BS in computer science, engineering or related experience.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535866"}