{"title": "Wireless System Engineering Manager", "summary": "Would you like to join Apple’s growing wireless silicon development team? Our organization is responsible for all aspects of wireless silicon development, dealing with challenges from the complex usages, more demanding performances and reliabilities to enable emerging wireless applications and products. Our goals are to come up with novel architectures, protocols, integrated systems and algorithms with employing the advanced technologies to introduce innovative products, providing evolutions to our lives with the best user experiences.", "description": "This role is combined with leadership capabilities, as well as strong hands-on work. In this role you will have the opportunity to lead and work on designing and innovating the architectures, protocols, integrated systems, and algorithms, and have a significant impact on the quality of our SoC products, provided to millions of Apple customers. Core Responsibilities: •Determining the architectures and core features of the innovative wireless communication systems to enable emerging applications and wireless system products. •Designing and simulating of wireless communication system for demanding performances, such as very high data rate, low latency, high reliabilities, low power consumptions. •Implementing system models, investigating innovative algorithms for performance enhancements, designing and validating them to allow performance sign-off and enable RTL development.  •Implementing system models for the wireless communication system and RF/circuits impairments and designing methodology/algorithm to alleviate those impairments by calibration, pre-equalization, canceller, and/or pre-distortion techniques.  •Defining the control procedures of the physical layer hardware modules to achieve robust and optimal performance of the Modem in congested medium environment with Co-Existing wireless communication systems. Lead and work on bring up, characterizations, validations and optimizing real silicon performances in lab to assure robust and reliable world class performances, achieving the targeted performances with production qualities. Coordinate with digital designers to realize these methods with power and area efficient digital implementations.  Coordinate with firmware designers to realize these methods with high efficiency software implementation, and possibly with hardware acceleration.", "key_qualifications": "Extensive managerial and leadership record, working on wireless communications systems architecture, protocols, integrations and algorithm designs. Proven track record in leading or coordinating cross-functional teams and excellent inter-personal capabilities. Experience in designing and developing the physical layer core algorithms (such as MIMO signal estimation and detection, channel estimation, equalization, coding theory, beamforming, timing recovery, frequency synchronization, automatic gain control, etc.). Deep knowledge of communication theory, information theory and signal processing related algorithms design. Strong analytical capability to develop best-in-class solution in terms of performance, power, and areas for the challenging issues of physical layer design. Deep understanding of radio/analog components/modules composited of wireless communication systems, the possible impairments from those components and the corresponding calibration and impairment reduction methods/algorithms, digital predistortion, PAPR reduction algorithms, Tx power control, etc. Strong coding/debugging skills - C/C++ and Matlab for algorithm development, modeling, and simulation of physical layer. Experience in modem architecture, protocol designs, microprocessor architecture, system integrations, hardware and software partitioning and controls. Knowledge in existing protocols: 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant experience required. MSEE/PhD preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534140"}