{"title": "Software Engineer: AI/ML-Based Tool Development", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!", "description": "You will develop tools based on AI/ML technology to process complex data in a software environment. Developing AI/ML tools to process complex data, including but not limited to failure analysis, document searching, summarization and sample code generation. Working with silicon validation teams to understand use cases, which lead to opportunities of using AI/ML to solve problems, optimize processes and detect anomalies. Working with corporate AI/ML infrastructure team to explore HW/SW resources available to implement AI/ML-based solutions", "key_qualifications": "", "preferred_qualifications": "Experience with tool development using AI/ML technology. Proficiency in Python programming is a must. Familiar with modern database and cloud technologies. Familiar with open source AI/ML models and packages. Familiar with open source data analysis, processing, and graphing packages. In-depth and solid understanding of general AI/ML concepts and algorithms. Experience in training deep-learning models using GPU. Basic Understanding of digital design and computer architecture and communication protocols. Silicon Validation experience is a plus. Experience with assembly languages and C/C++ languages a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559454"}