{"title": "SAP Functional Analyst/Project Manager (MM/LE), Enterprise Systems", "summary": "Our team builds and implements groundbreaking supply chain solutions using SAP Hana platform and SAP ECC/Hana applications that have helped keep Apple #1 in customer support for multiple years in a row. We are seeking a high-energy and dedicated SAP MM/LE Functional Analyst/Project Lead who will play a central role in the design and development of supply chain execution solutions!", "description": "As a SAP MM/LE Functional Analyst/Project Lead is to direct a team, design, develop and implement SAP AppleCare supply chain execution projects at Apple. In this role, you will work with AppleCare business partners to define scope and gather business requirements. Apply industry knowledge experience and standard methodologies to business processes globally in areas of supply chain execution including procurement, repair and warehouse operations, forward and service repair logistics as well as reverse logistics. And, to architect the best design, performing vital SAP configurations applying functionalities in SAP ECC/S4 Hana MM/LE, writing functional specifications for configuration and development of custom programs, integration with other modules such as SD/FI/TMS/EWM, cross-functional testing and implementing the efficient end-to-end solution!", "key_qualifications": "4-8 years of strong functional, design and configuration experience in SAP MM/LE and project lead role\nKnowledge and experience of SAP project implementation with at 2-3 full lifecycle of implementation experience\nImplementation experience with knowledge of business processes in developing global service repair logistics, reverse logistic, warehouse operation and procure-to-pay applying SAP MM, LE, EWM, S/4 Hana, etc\nExperience to define and improve system interfaces of various types to integrate with supplier and logistics partners using IDOC/RFC/EDI/XML/API\nKnowledge and experience in one or more SAP technologies such as BTP, Fiori / UI5, BRF+, Enterprise Portal, Work Zone\nExperience leading distributed organizations taking care of resources from different time zones\nStrong and outstanding written and verbal communication skills, including presentation skills to all levels of an organization", "preferred_qualifications": "", "education_experience": "-  Bachelors Degree or equivalent experience in Computer Science, Management Information Systems.\n-  Project Management certification is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537399"}