{"title": "Tooling Operations Finance Analyst (12 month contract)", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us enrich lives and leave the world in a better place than we found it!", "description": "Approve Tooling Spend across Apples Global Tooling landscape\nMaintain Tooling budgets to prevent overspend\nReview requests to sell or dispose Apple’s manufacturing assets\nProvision of KPIs & Management metrics to help the business understand key cost drivers. \nLead Quarterly Business Reviews with Senior Operations and Finance personnel.\nPartner cross-regionally with peers and senior finance managers in APAC and WW to develop and implement global initiatives.\nMaintenance of Tooling SOX controls\nProvide ad-hoc support to the EMEIA Operations Finance management team", "key_qualifications": "", "preferred_qualifications": "excellent analytical and problem solving skills\nstrong technical skills with an ability to deal with large volumes of data, develop reporting efficiencies & summarise key aspects\nstrong communication and interpersonal skills with the ability to connect with people\nshould be able to deliver in a fast-paced work environment & to strive for excellence\npositive energy & attitude with a desire to drive constant improvement & change\nability to cut through ambiguity, to listen, challenge & innovate\npossess candour and resilience that allows them to succeed in a challenging environment\nThe successful candidate must be analytical, self-motivated, curious & flexible, a self-starter who works well both individually and in teams.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557346"}