{"title": "Customer Success Manager - AppleCare", "summary": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Imagine what you could do here! Apple is hiring a Customer Success Manager to ensure our customers have an extraordinary experience. The CSM focuses on B2B customers and helps the customer understand and use all entitled features and services. The CSM engages with customers from pre-sales through post-sales. The CSM focuses on helping to build long lasting customer relationships through onboarding, mentorship, and advocacy. CSMs facilitate deep usage of Apple’s Enterprise Platform, Products, and subscribed services. By focusing on customer satisfaction and retention, the CSM helps grow the business. The CSM shows commitment to customers throughout the customer journey and will focus on an assigned customer segment. Segments covered by the team range from Small Business to large multi-national customers. Assignments and responsibilities will include a selection of Apple’s service subscription customers.", "description": "■ We are looking for 5+ years of demonstrated ability in a customer facing role at an Enterprise Technology company with a portfolio that includes hardware, software and services ■ Have 2 or more years of previous experience in a hands-on services role (pre-sales, professional services, consulting or support) working with B2B Customers in the following areas: - Apple Enterprise Services - Mobile Device Management - Networking Infrastructure - Directory Services - Mixed Proficiency with various operating systems including Mac OS and iOS - Desktop Applications ■ Passionate about collaboration and building strong relationships, both with customers and internal teams. ■ Can clearly communicate technical subjects to technical and non-technical audiences. You are able to influence at the CIO level as well as with individual technical contacts. ■ You sweat the details - you notice when things are even slightly off and you hold others to high standards as well. ■ we need people with a consistent record working in driving customer adoption and retention. You have experience handling renewal discussions as well as discovering and remediating signs of potential customer churn. You anticipate dissatisfaction, proactively seek to solve or avoid it, and when feedback is provided you onboard it squarely with the intent to address it. ■ Have excellent problem-solving skills - including crisis management, communication, issue tracking, triaging, and contributing based recommendations. In fact, encountering a difficult challenge energizes you and makes you want to re-double your efforts until the problem is solved. ■ Preferred to have a proven expert level proficiency in IT Services Management or IT Mobile Strategy. ■ Preferred to have a background and/or proficiency in a specific vertical: Telecommunications; Transportation; Financial Services; Health Services; etc…", "key_qualifications": "Curates the customer’s service experience and assumes responsibility for ensuring customers' overall satisfaction and continued adoption. Enable consistent footprint expansion and consumption growth of the overall product portfolio. Represents Apple’s Enterprise platform features with deep expertise. Capable of building customer relationships with high levels of trust, satisfaction, and reference-ability.", "preferred_qualifications": "", "education_experience": "Required to have a Bachelor's degree or equivalent experience, or equivalent industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550610"}