{"title": "Motion/Location Sensing Engineering Program Manager", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here.", "description": "Lead and align multi-functional teams including electrical, mechanical, process, reliability, software and firmware engineering to deliver powerful sensing solutions and integrate them into new platforms. Act as a liaison between multi-functional teams and ensure tight inter-team coordination and communication Define the program plan/schedule and manage program execution...", "key_qualifications": "Product development or engineering experience shipping semi-conductor, sensing, MEMS or other related hardware. Experience in physics, mechanical, electrical, or material science engineering. Experience with interfacing micro-controllers with analog and digital sensors, embedded programming or signal processing. Experience with data collection, data analysis, and statistical analysis tools (e.g. Matlab, Python or JMP). Ability and willingness to travel internationally is required.", "preferred_qualifications": "Technical background (e.g. hardware development) with knowledge of sensing technologies and/or system sensor integration. Excellent written and verbal communication. Ability to filter and distill relevant information for the right audience. Ability to navigate in ambiguity and uncertainty and see around the corner. Self motivated and proactive with proven creative and critical thinking capabilities. Solid problem solving, failure analysis and debugging skills. Solid collaboration: the candidate must be able to fit in well with a team, understand capabilities and priorities while fostering a collaborative environment. Great organizational and leadership skills, and ability to inspire and align team members.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558715"}