{"title": "LiveOn Product Quality Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. We are looking for someone to join the iPhone LiveOn team...", "description": "In this role, you will be involved in shaping future products at Apple. The LiveOn Engineering team works across the development process and interacts with development teams, technology teams and a multitude of passionate employees testing and reporting issues with unreleased prototype hardware and software...", "key_qualifications": "", "preferred_qualifications": "Quick learner of new technical concepts, with an understanding of fundamental engineering principles from hardware, software, services and the customer experience across all three. Exceptional at building relationships and working collaboratively across diverse technologies and cross-functional teams in a dynamic, hands-on environment. Ability to partner with Engineering and Manufacturing teams. Superb organizational and time-management skills with the ability to work on multiple projects and issues concurrently. Excellent communication skills, with ability to clearly convey a message, present findings and suggest recommendations to all levels of stakeholders, including executive management...", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $151,200 and $227,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547919"}