{"title": "AIML - Senior Team Lead", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job… Just be prepared to dream big!", "description": "In this role, you will be leading day-to-day operations to ensure organizational delivery of quality results. You’ll assist in the development of tools and reports to analyze and run the business, including workflow optimizations, workforce management, and volume predictions. You will help determine staffing requirements and participate in interviewing and hiring. You will effectively lead team performance with a focus on developing managers through one-on-ones, team meetings, coaching sessions and setting expectations. This position comes with competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "key_qualifications": "Minimum 8 to 10 years experience in people management, leading teams focused on consumer-facing applications, content or service. Ability to empower and drive the team’s performance and be accountable for business priorities. Self-starter with an analytical orientation, strategic vision, and strong executional track record. Experience defining and analyzing KPI’s, with the ability to identify trends and opportunities for innovation and improvement. Proven track record of collaborating cross-functionally to drive operational improvements. Experience scaling operations in a fast-paced and dynamic environment. Management experience in a global organization is preferred. Excellent verbal and written communication skills and the ability to influence and communicate across all levels of the organization.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience preferred", "additional_requirements": "Ability to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needs. Successful completion of a pre-employment assessment and background check. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "Competitive pay, great benefits, eligibility to participate in our company stock plan, time off, an employee discount, and dedicated resources to support your ongoing growth and career development.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519063"}