{"title": "Full Stack Java Engineer, Enterprise Technology Services", "summary": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers. Together, you and your team will help everyone at Apple do what they do best: explore every possibility.\n\nDo you love working on challenges that no one has solved yet? Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join our team, we work in a startup-like environment and you will be part of every stage of development working multi-functionally with user interface designers, business, development engineers, architects, and operations from the concept phase to deployment. The team is focused on rapid application development, research, innovation, and creating new products and solutions.\n\nApple’s global ETS eBusiness team seeks an outstanding senior full-stack Java Engineer to implement innovative and scalable solutions. This is an excellent opportunity for a very enthusiastic, hardworking, who focuses on results to provide integration solutions using various technology stacks and platforms. Enjoy the benefits of working in a fast-growing business where you are encouraged to \"Think Different\" and where your efforts play a key role in the success of Apple's business.", "description": "Imagine yourself at the center of our engineering team. You will be a key player in developing critical enterprise solutions for our users and B2B Partners. From brainstorming through implementation, you will be part of a ground-up innovation team who are passionate about building distributed computing applications, data-intensive enterprise architectures, human-centric design approaches, and innovative solutions. You will have the opportunity to innovate and come up with new solutions using the latest ground breaking and AI/ML technologies. Join our team, and experience how Apple operates, empowering our employees to do what they do best: crafting magnificent experiences for our customers.", "key_qualifications": "", "preferred_qualifications": "Hands-on experience in designing and developing user interfaces ensuring responsiveness, accessibility, and a user-friendly experience.\nWorking experience in Agile development methodology.\nResults-oriented and demonstrates ownership and accountability.\nCommunicate quickly and clearly, and collaborate with other team members.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555281"}