{"title": "Senior Compositor", "summary": "Apple’s Human Interface VFX team designs product experiences, from early ideation all the way through to the shipping product. To ensure high-quality results, we work closely with other HI design teams, software teams, graphics engineers and product marketing. We are in search of a Senior Compositor with extensive live-action and CG integration experience that has a meticulous eye for detail.", "description": "The ideal candidate will help visualize future ideas and concepts through traditional compositing of live-action plates, CG environments, characters, FX elements, and motion graphics. They will also: - Thrive in a collaborative team environment - Explore the limits of next-generation technology - Proactively find innovative solutions to push visuals forward - Guide the aesthetics of spatial experiences developed with engineering partners", "key_qualifications": "10+ years of production experience specializing in visual design for feature films or advertising; Demonstrated eye for color and composition, and the ability to recognize what may be missing from a shot to take it to completion; Proficiency in working with Nuke, Photoshop, PTgui, Lightroom, or equivalent software packages; Comprehensive knowledge of a VFX pipeline, from capture to final; Working understanding of photographic processes and techniques; Self-motivated and curious, with an enthusiasm to learn new tools and workflows; Excellent communication skills and the capability of leading collaborative efforts across departments; Ability to find creative solutions for technically challenging tasks", "preferred_qualifications": "Prior leadership/supervision roles; General understanding of other DCC tools across VFX disciplines (Cinema 4D, Houdini, etc); Experience working with external art teams and outsource partners; Python scripting skills a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553958"}