{"title": "Security Software Engineering Manager - Systems & Kernel", "summary": "Posted: 22 Jul 2024Role Number: 200560148", "description": "As a software engineering manager in SPEAR, you will: Lead and manage a team of collaborative software engineers improving the security of critical low-level operating system software. Grow the team by hiring and developing top engineering talent at all experience levels. Manage ambitious software security projects through their entire lifecycle including concept, design, implementation, testing, and handoff phases. Foster a collaborative team culture, leading by example to approach every challenge as an opportunity to deepen mutual understanding and respect through creative problem solving. Drive continuous improvement within the team, analyzing every project for improvement opportunities and following through to ensure they are implemented. Partner with other security engineering leaders to develop your team’s roadmap and respond to emerging threats.", "key_qualifications": "empty", "preferred_qualifications": "Bachelor of Computer Science or equivalent skills and work experience", "education_experience": "empty", "additional_requirements": "empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $190,700 and $329,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560148"}