{"title": "iOS Home Video Engineer", "summary": "The iOS Home app is the center for an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and crafting experiences that revolutionize the way people interact with their homes. The team is seeking an expert engineer to help build the integrated Home experience on the iOS platform. This role is specifically focused on supporting HomeKit security cameras and video processing.", "description": "As an engineer on our team your responsibilities will range from high-level user interfaces, to writing background processing and networking code, to developing frameworks used by other teams at Apple. You'll be tasked with maintaining and improving existing features and implementing new and innovative ideas for the future. You will also be responsible for delivering the best possible application performance including fast live video start and quick access to recorded video clips. We work closely with the other iOS engineering teams, human interface designers, privacy, security and other groups across Apple and our partners at other companies. Our goals are simple but the task is large - build the most amazing home security video experience in the world that our customers will love.", "key_qualifications": "Preferred experience with HomeKit security cameras and video processing\nStrong programming skills, preferably with Swift and Objective-C\n5+ years iOS programming experience\nExcellent understanding of optimization and performance issues across OS software layers\nExcellent communication and collaborative skills\nObsessively passionate and inquisitive, and seek to tackle everyday problems in innovative ways\nLaser-focused on the smallest details that are important to our customers", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Engineering, Computer Science or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518831"}