{"title": "Software development Engineer, Swift Platform Experience", "summary": "Our small, unique team in Apple’s Software Engineering division is chartered to help framework teams throughout the company ensure the Apple developer experience is just as carefully crafted as Apple's end-user hardware and software products. As a member of our team, you’ll have an outstanding opportunity to help craft the technologies that encourage developers around the world and empower them to realize their dreams.", "description": "This role offers an outstanding chance to work on ambitious problems, collaborate with hard-working engineers, and contribute to the innovation that defines Apple. Your primary responsibility will be to design, develop, and deliver high-quality software applications and supporting tools and infrastructure for our teams processes. You will have the opportunity to think with a product mindset and work cross-functionally to identify opportunities to improve our processes around API Design and quality. A successful candidate will be a flexible and proactive engineer who thrives in a fast-paced and varied environment. You will : - Work with multiple technology stacks at the same time and deliver high-quality software. - Work with web application databases, backend, and front-end UI technologies. - Be familiar with web deployment technologies such as Rio, Docker, and Kubernetes. - Be proficient in other areas of product delivery will also be highly valued. - Be passionate about Swift and its various applications as we help craft the future of swift.", "key_qualifications": "Experience with full-stack web development technologies (Django, React, etc). Experience with microservices and modern cloud architecture (Kubernetes, Docker, etc). Experience with SQL and relational database systems (Postgres). Excellent debugging, analytical, problem-solving, and interpersonal skills. Knowledge of Swift language is preferred.", "preferred_qualifications": "", "education_experience": "BS in Computer Science. MS preferred or equivalent work experience preferred.", "additional_requirements": "At least 5 years of professional software engineering experience preferred.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549169"}