{"title": "Software Developer, API Integration", "summary": "Do you like developing apps that use new Apple APIs? Do you look forward to using the latest version of Xcode and the SDKs? If so, we want you to be part of the team that builds internal apps using new APIs that are yet to be released to external developers. The API Integration Team designs and develops internal apps used to qualify many flagship developer features like SwiftUI, WidgetKit, and Live Activities. Join us and help shape the developer experience for future versions of Apple SDKs!", "description": "As an API Integration Apps Engineer, you will need to have the right balance of app development skills, testing abilities, and computer science fundamentals. We design, develop, and maintain apps that are used to validate new APIs in the public SDKs for iOS, iPadOS, tvOS, watchOS, and Catalyst. You will be embedded with software development teams to ensure Apple's SDKs provide the intended functionality and experience for the thousands of developers who build apps for our platforms.  You will work closely with other Developers, Quality Assurance Engineers, and Automation Engineers across Apple to ensure we have adequate test coverage for new APIs. We also occasionally develop accompanying web services and tools needed to ensure new APIs work. \n\nTo be successful in this role, we are looking for a self-motivated engineer that can thrive in an autonomous environment. You will need to have strong technical, problem solving, and communication skills to work on our fast-paced projects.", "key_qualifications": "Strong development skills in Swift, Objective-C, C++ or similar languages\nSolid computer science fundamentals\nProven ability to ramp up quickly on new technologies\nExperience debugging software issues\nSelf-driven and the ability to work autonomously\nCreative thinker and strong problem solver that thrives in an environment that focuses on customer experience and attention to detail\nExcellent written and verbal communication skills", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science or equivalent technical degree and experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550642"}