{"title": "Sales - Area Sales Manager (Christchurch or Wellington)", "summary": "The people here at Apple don’t just create products — they make the wonder revolutionising entire industries. Diversity of ideas encourages innovation that runs through everything we do, from unique technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Based in the field, you are accountable for extraordinary business results, improving Apple brand awareness through delivering a customer experience and advocacy across a territory. You collaborate with multiple partner teams, spending quality time inspiring with your forward-thinking style and love for technology. You will have a deep understanding of the market, demographics, and behaviour of consumers; regularly conducting product demonstrations to customers, and through your deep knowledge and connection with customers, you provide insights to leadership. You are an effective leader who is passionate about Apple and builds positive relationships, and influences the partner to drive sales opportunities and elevate customer experience the Apple way, where the customer is surprised and delighted in all interactions.", "description": "-  You influence store and regional leadership across multiple points of sale in a defined territory to build plans, achieve regional partner sales targets, and grow the business in a positive relationship. -  While analyzing and reviewing regional data, store revenue, and market intelligence and trends, you generate innovative ideas to improve performance and provide insights and inspiration on growing the mind and market share of Apple products. -  Through collaboration and training with the reseller teams on our products, services, and merchandising guidelines, and encourage them to deliver an outstanding customer experience while developing brand advocates. -  Educate and encourage the store teams to stay knowledgeable on the latest Apple product and services portfolio. -  You will meet customers and promote the Apple ecosystem by communicating the benefits and values of the products through product demonstrations and consultations, either individually or in groups.", "key_qualifications": "You see the world in the eyes of the customers and partners by deeply understanding their business needs, challenges, and concerns. You believe that communication is critical to success. You actively listen and discuss the possibilities with customers and teammates alike. Quick on your feet and connect and influence the right people inside and outside of Apple; you are trusted and comfortable in challenging situations. We are only as strong as the people around us, so you know how to contribute to your team; you enjoy a collaborative environment with open dialogue and debate. You empower your teammates to do their life’s best work. Apple does not cut corners in products or business. You bring the highest integrity, honesty, and accountability in all you do daily. Open to feedback and relate well to all kinds of people. When faced with an exciting opportunity, you know whom to connect with and when. People know you as a true collaborator who knows what it takes to win. You empower others to learn, be curious, and ultimately share your passion for the Apple Story. You strive for excellence in everything you do. You have a don’t give up attitude and finish, especially in the face of resistance or setbacks.", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree is beneficial.", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533121"}