{"title": "Software Development Engineer in Test, Retail Engineering", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nApple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job.\n\nFinancing and Retail Systems team is looking for an experienced Software Engineer In Test. In this position, you will perform continuous quality analysis and provide internal tools to help ensure that quality of the products we ship to customers are of the highest standard.", "description": "This position calls for a self-motivated individual with strong technical prowess, communication skills, and a deep interest in Software Quality.\nAs part of this team you will design and develop the testing infrastructure i.e. tools, frameworks, reporting mechanisms to test software and services. You will Integrate the test suites and infrastructure with the CI/CD systems to ensure all the tools and services developed meet the quality goals. You will write different types of tests namely unit, integration, smoke, performance tests for existing and new projects so as to ensure a bug free and high quality software is delivered to customers. You will stay knowledgeable of new testing tools and strategies and evaluate the technologies to incorporate into the projects. You will work collaboratively with other manual and automation team members to develop effective testing strategies as well as quality metrics for new and existing features.", "key_qualifications": " ", "preferred_qualifications": "Understanding of DevOps and CI/CD processes, experience with tools like Jenkins, Github, or similar.\nUnderstanding of cloud solutions, notably AWS and GCP.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $214,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556948"}