{"title": "Senior Software Engineering Manager, MultiCloud Networking Platform", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have envisioned — and now can’t imagine living without! If you’re thrilled by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job! Apple Cloud Networking team builds and operates Software-defined network platforms that work at scale to deliver a multi-Cloud network and security with global footprint. We are a fast moving team at forefront of crafting Apple’s hybrid cloud network infrastructure that fuels Apple’s services such as iCloud, iTunes, Siri, and Maps. We are looking to hire senior software engineering manager who is passionate about building and operating a highly scalable, fault-tolerant and robust systems to support one of the largest infrastructures. In this role you will leading a team focussing on Multi cloud networking platform. As a part of this role, you will be responsible for providing technical and leadership expertise to deliver products. You will also be managing a team of software engineers in providing leadership guidance on product development strategy, software architecture, design and code optimization.", "description": "-  Develop a team of software engineers who are building software defined networking stack\n-  Individual hands-on contribution into development effort\n-  Drive the best design principles/rationals and ensure craftsmanship in the development process\n-  Drive and establish standard methodologies for process and tools\n-  Drive the projects from architectural concepts to development to production\n-  Lead collaboration with Network architects, Ops/Engineering and the Application teams", "key_qualifications": "Minimum 10 years of experience in hands-on development of systems\nMinimum 4 years of experience in leading team of engineers\nStrong experience in building highly scalable, fault-tolerant distributed systems\nBroad experience in REST APIs and micro-service architectures\nStrong organizational and communication skills\nStrong ability to prioritize, push aggressive deadlines and drive closures\nHands-on experience with one or more languages (C/Go/Rust)\nAbility to collaborate with multi-functional teams\nExtensive understanding of network security and routing", "preferred_qualifications": "", "education_experience": "BS/MS/PhD in Computer science or related field", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200531464"}