{"title": "Senior Real Estate Transactions Manager", "summary": "In Real Estate & Development, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and forward-thinking group that manages Apple’s workplaces and site services. We develop and run Apple’s global real estate portfolio, lead all capital construction projects, provide outstanding facilities & site services, develop & lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs. We do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world. We are seeking an experienced, collaborative, and highly motivated Senior Real Estate Transactions Manager to join our team!", "description": "Skilled in the leadership, management and coordination of domestic and international real estate property acquisition and disposal activities composed of multiple projects in various stages of planning, investigation, negotiation, execution through implementation. Prepare financial and sensitivity analysis for all transactions and projects. Develop business justification and recommendations for presentation to user groups and executive management team for approval. Partner with a wide variety of corporate wide functions to assist in the development of short and long range real estate requirements. Assist with the strategic planning for the acquisition and disposition of Apple owned facilities properties, including financial analysis, market information, offering terms and conditions, marketing materials, contract review, and negotiations. Review and update real estate best practices, forms and documents and improvements to the real estate database that will improve the quality of real estate delivery. Develop benchmarking standards, and key metrics and update periodically. Collaborate with the project and construction management team to oversee conformance to lease requirements such as acquiring landlord consent, negotiating restoration requirements and collection of Tenant Improvement dollars. Coordinate and collaborate with facility maintenance program and services for field sites. Manage current real estate assets by taking a proactive approach by anticipating lease renewals and terminations and all critical dates, lowering and auditing operating expenses, handling subleases and collecting sublease rents, coordinating landlord approval of alterations, completing estoppel certificates, paying rents and property taxes on a timely basis, and assisting in property tax appeals. Maintain excellent relationships with internal customers, senior management, legal, tax, risk management, landlords, vendors, consultants.", "key_qualifications": "Minimum of 10-15+ years of transaction experience in commercial or corporate real estate with familiarity of construction practices as well as managing internal and external teams. Strong abilities in the following areas: negotiations, written and verbal communication, financial modeling, budgeting and management. Strong financial and analytical skills required. Ability to travel internationally. International commercial real estate experience a plus. Energetic and flexible; motivated and able to work in an incredibly fast and fluid organization. Can work independently and as part of a team.", "preferred_qualifications": "", "education_experience": "BA/BS degree from an accredited institution; MRED preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540193"}