{"title": "Health Sensing HW - Electrical Engineer", "summary": "The Health Sensing Hardware team develops ground breaking health sensors that are central to helping our customers live a healthier lifestyle. We are looking for a highly-motivated engineer to work with research scientists and engineers on the next generation of health sensors. You will assist with conceiving, modeling, and prototyping new sensor solutions. This role requires engineering excellence, creativity, and the ability to work in multi-functional teams.", "description": "Our team develops new health sensors. We are responsible for aspects related to electrical engineering. In particular, you will participate in sensor technology investigations. We work together to contribute to the development and characterization of prototypes and proof-of-concept hardware. You will be in charge of circuit, PCB design, and component and system characterization. You will define specifications and other documentation. You will analyze and supervise vendor data as well as data from engineering builds. You will perform failure analysis, identify root causes, and propose corrective actions. You will give clear technical updates to the broader team and management. You will collaborate with multi-functional teams on activities such as - Mechanical design - PCB design - Algorithm development - Sensor calibration and reliability testing - User study design and analysis", "key_qualifications": "Deep understanding of EE, ME, and Physics fundamentals, Experience modeling, building and testing sophisticated systems, Proficiency in Python or MATLAB, Excellent communication and collaboration skills, Experience with Health sensor design, Temperature sensing or thermal design, Prototyping including mechanical assembly, firmware, device characterization and test, and HW bring-up", "preferred_qualifications": "", "education_experience": "-  BS and a minimum of 3 years relevant shown experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549439"}