{"title": "NPI Product Quality Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.  Quality at Apple is what turns experiments into reality. The new product introduction (NPI) product quality team supports upcoming iPhone products by identifying, quantifying and driving solutions for issues identified in development; in collaboration with large cross-functional engineering teams across multiple countries.", "description": "The NPI Product Quality Manager is responsible for driving quality improvement actions for future iPhone products. You will also be expected to succinctly communicate the overall status of quality issues to cross-functional teams and executive leadership. As an integral part of the quality team, you will: \n\n• Manage and drive quality issues to closure by working closely with cross functional teams to identify root cause with an ability to influence how Apple designs, assembles and tests future iPhones \n• Conduct data analysis to quantify field impact of user facing issues \n• Summarize product issues, identify highlights and present them to Apple executives \n• Innovate, develop, and implement key tools and processes as part of iPhone Quality's push into Smart Quality\n• Perform hands on failure reproduction, triage and tear down of iPhones in order to get to root cause", "key_qualifications": "Highly technical problem solving skills, driven to understand true root cause and validate corrective actions\nUnderstanding of quality methodology, Design of Experiments (DOEs), statistical process control, quality statistical sampling, reliability methods and theory\nStrong communication skills, with ability to effectively present to cross-functional teams and executive leadership\nData driven and results oriented approach to problem solving\nInclination to be hands on, performing device tear downs, collecting diagnostics information and data gathering using instrumentation", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518977"}