{"title": "CMM Inspector", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we create products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, Apple is the place for you! We are a diverse group of Model Makers who support all the hardware engineering groups within the company. This group specializes in manufacturing models, prototypes, and offers manufacturing/design solutions. We are looking for an experienced and motivated metrology technician to join our small but growing lab.", "description": "In this role you will work directly with our team of Model Makers and the Product Design engineers we support to develop and implement test and inspection plans for a wide array of parts and fabricated prototypes. You will also play a key role in researching and selecting the metrology tools and equipment that best meet the diverse needs of our growing team. Key deliverables include validating and measuring prototype parts, communicating the results to your customers and collecting and presenting metrics to colleagues and management. The lab requires a logical problem solver who is comfortable around technical equipment and data. The ideal candidate would be self motivated, have prior experience in a high paced shop environment, and be able to work with minimal supervision if necessary.", "key_qualifications": "Able to apply and advise on GD&T principles, Experience programming and operating a variety of metrology equipment (Optical comparator, Keyence, OMM, CMM, Laser Scanning, CT Scan), Ability to assess and improving issues related to prototype parts, Able to identify critical to function components and confirm both cosmetic and technical features, Able to qualify and troubleshoot inspection equipment, including bring-up activities, Must be data-driven and detail focused, Excellent written and verbal communication skills, ability to interact with management, team members, and external vendors", "preferred_qualifications": "", "education_experience": "3+ years of relevant experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $49.25 and $85.52/hr, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200544287"}