{"title": "Foundry Interface Engineer – Analog / Display / Power Technologies", "summary": "Can you influence, connect, get results and communicate effectively? As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and figure out how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. You will work at an exciting silicon design group that is responsible for crafting state-of-the-art ASICs! We have an extraordinary opportunity for Foundry Interface Engineers.", "description": "Imagine yourself in our processor design effort, collaborating with design teams and providing technology support, with a critical impact on getting functional products to millions of customers quickly. In this highly visible role, you will be at the center of process technology problem solving, providing design enablement for key analog, display and PMIC products. The primary focus of this position is collaborating with internal design teams and semiconductor foundries. This is a hands-on, dynamic role requiring limited travel to foundries and development sites. -  Manage technical process collaboration with foundries. -  Provide support for product development, tape out and debug. -  Work closely with foundries on silicon process and product issues. -  Manage & evaluate foundry deliverables (PDK documentation, LVS, DRM/DRC, Spice models and tech files) and drive improvements with foundry. -  Participate in technology development, device engineering for PMIC / analog next generation process technologies. -  Support new product introduction from design concept through production release. Key tasks are supporting activities, handling tape outs, debugging silicon issues. -  Assess device usage cases to ensure product reliability (safe-operating-area evaluation). -  Manage and mitigate technology risks for multiple projects in parallel. -  Build crucial internal and external connections at suppliers and within Apple.", "key_qualifications": "We are looking for applicants with at least 10 years of experience in semiconductor process technology and manufacturing. Direct experience in PMIC or analog technology development programs is desired* Deep knowledge of CMOS and BCDMOS technologies, particularly in the field of Analog design. Experience leading engineering teams is a plus Experience supporting designs with significant digital content is desired. Experience working with PDKs and collateral, such as Spice models, DRM/DRC, LVS, RC tech files, is critical.", "preferred_qualifications": "", "education_experience": "Bachelor's degree and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548672"}