{"title": "Product Design Engineer - Accessories", "summary": "The Accessories Product Design team at Apple is seeking a hardworking team member to help us create the next generation of the world's finest accessory devices! You will conceive, design, and bring into production products that will re-define the Apple ecosystem experience. You will work closely with many different cross functional teams including Industrial Design, Packaging, Safety, Hardware Engineering, EMC, and Marketing.", "description": "The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple TV, as well as the first three generations of Apple Watch. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. You should join us to help deliver the next groundbreaking Apple product!", "key_qualifications": "BSME required\nDemonstrated ability in plastic and sheet metal part design.\n3D CAD skills\nExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.\nStrong analytical/problem solving skills and ability to use statistical tools and techniques.\nWorking knowledge of finite element analysis theory and general mechanical engineering analysis.\nFlexibility and comfort working in a constantly evolving environment.\nAble to travel internationally (up to 10%)", "preferred_qualifications": "5+ years experience in product design (preferably consumer electronic products).\nExperience with component modules (Connectors, batteries, electronics packaging, PCBAs)\nExperience with cable harness/assembly design preferred.\nExperience working with overseas manufacturers.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554179"}