{"title": "Software Support Engineer", "summary": "As part of Apple’s Battery organization, you will help develop new generations of batteries and deliver more energy in smaller spaces than ever before. By collaborating with product development groups across Apple, you will push the industry boundaries of what batteries can do and improve the product experience for our customers around the world.", "description": "The Battery Data Systems group is looking for an individual who will:\n\n-  Support software users in battery qualification labs\n-  Process help tickets and troubleshoot issues reported by users\n-  Model equipment, products, process steps, and other objects in the manufacturing execution system (MES)\n-  Test newly developed features, validate bug fixes, and guide users through user acceptance testing (UAT)\n-  Be the Data Systems point of contact for lab users", "key_qualifications": "3-8 years of experience supporting or deploying software for internal or external customers\nExperience configuring and maintaining enterprise software (e.g. MES, ERP, LIMS)\nExperience providing first level software support to end users and issue triage\nExperience testing newly developed features and driving user acceptance\nDemonstrated problem solving and troubleshooting/debugging skills\nComfortable with modern IT tech-stack concepts\nComfortable navigating Linux/Unix environment\nComfortable training small and large groups\nAbility to write and implement basic SQL queries\nAbility to quickly learn new software applications\nMust be self-directed, analytical, and curious\nMust work well in a team environment\nMust be a strong advocate for improving processes and a clear communicator of new ideas\nMust have strong written and verbal communication skills\nMust be highly organized and possess the ability to balance multiple priorities simultaneously", "preferred_qualifications": "Experience with Tableau or similar data visualization tool\nUnderstanding of HTTP and AMQP (or similar messaging protocols, e.g. JSON/XML)\nExperience with collecting data from hardware & bench-top tools, e.g. cyclers, PPG", "education_experience": "BS in Information Technology, Computer Science, or related engineering", "additional_requirements": "Preferred Qualifications:\n- Experience with Tableau or similar data visualization tool\n- Understanding of HTTP and AMQP (or similar messaging protocols, e.g. JSON/XML)\n- Experience with collecting data from hardware & bench-top tools, e.g. cyclers, PPG", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200512188"}