{"title": "Data Center Architecture Engineering Program Manager (EPM)", "summary": "Come join a dedicated team of Data Center Engineering Program Managers! As an Architecture EPM, you will be responsible for driving new features and technologies across Data Center products, and enabling large cross-functional teams to deliver high quality roadmap decisions.", "description": "Our team is responsible for leading projects from initial highly ambiguous ideas to converged requirements and stable system architecture. The EPM documents and tracks product definition baseline, opens/risk, and convergence plan. This requires identifying criteria, dependencies, alternatives, risks, and timeline associated with all product decisions. These high quality decisions are enabled by collaborating with cross-functional organizations at all levels. In addition, the EPM engages technology partners in order to explore new technologies, and determine readiness for product intercept.", "key_qualifications": "", "preferred_qualifications": "Strong technical background with knowledge of product development and manufacturing processes; solid knowledge of computer architecture\nLeadership skills and ability to build strong relationships across various product development teams and technologies and to inspire team members\nExcellent communication, presentation, and organizational skills and ability to navigate problem solving cross-functionally until full resolution is achieved\nSelf-motivated and proactive with demonstrated creative and critical thinking capabilities with the ability to drive the team forward\nUnderstands and deals well with rapid development cycles and constant change and remains flexible and calm in the face of uncertainty while fostering a collaborative team environment\nAble to generate clear and accurate visualizations of quantitative data\nEqually comfortable in big-picture strategy and deep technical discussions\nAble to comprehend, communicate, and manage complex design tradeoff decisions, with superior attention to detail", "education_experience": "Bachelor’s degree in Engineering required (Mechanical or Electrical preferred)\nIndustry experience in hardware engineering or program management", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553590"}