{"title": "SE-Genius", "summary": "Du vårdar kundernas förtroende för Apple genom att hjälpa dem med kompetent felsökning och reparation av produkter i Apple Store. Du använder din förmåga att felsöka och din sociala kompetens för att snabbt lösa kundernas tekniska problem i Genius Bar. Du utbildar också dina medarbetare om produkter samtidigt som du ser till att hålla dig à jour med den senaste tekniken. Du är förstående och har ett utmärkt kundbemötanden när du dagligen erbjuder rådgivning och support. Du samarbetar med andra för att främja en kultur där alla känner tillhörighet och inspireras att göra sitt allra bästa. Det finns både heltids- och deltidsjobb.", "description": "Som Genius-medarbetare erbjuder du Apples kunder goda råd och praktisk, teknisk support. Du ställer snabba feldiagnoser och förklarar tålmodigt och vänligt. Du avgör om produkten kan repareras eller behöver ersättas och erbjuder lösningar som hjälper användarna att snabbt komma igång igen. Även om du har hand om flera fall samtidigt ser du till att använda både kundernas och din egen tid på bästa sätt. Du levererar Apples service snabbt, skickligt och med hög kvalitet. Du bygger förtroende hos såväl kunder som medarbetare genom att erbjuda dem vägledning, kunskap och även tips och undervisning.", "key_qualifications": "", "preferred_qualifications": "Stor social kompetens och talang för problemlösning. Förmåga att vara kundfokuserad och personlig i ditt bemötande samtidigt som du felsöker och löser tekniska problem. Förmåga att följa ett schema med kundmöten. Bidrar till en inkluderande miljö genom att respektera allas olikheter och vara öppen för att lära av varandra. Förverkligar Apples värderingar om inkludering och mångfald i det dagliga arbetet. Du är nyfiken och har lätt för att lära dig nya reparationstekniker. Du är skicklig på att planera din tid på bästa sätt och att fatta snabba beslut. Du talar det lokala språket flytande. Du kan jobba med ett flexibelt schema. Dina arbetstider baseras på affärsbehoven.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535565"}