{"title": "AIML - Sr Engineering Program Manager, Responsible AI", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? We’re looking for people like you! The AIML team is crafting groundbreaking technology, and we are looking for candidates with experience, passion and a track record in shipping responsible technology and inclusive products. This role will be responsible for supporting and implementing AIML’s strategy to ensure the ethical and safe deployment of machine learning models. Applying your expertise in these areas, you will collaborate with cross-functional teams to develop and implement policies, standards and processes that align with Apple’s values to implement a plan for the safety lifecycle of machine learning models. As the program manager in this space, you will play a key role in building a culture of technology responsibility, encouraging transparency, and mitigating risks associated with the development of machine learning models. The ideal candidate for this role will have extraordinary program management skills with shipping ML products and the ability to influence across all levels of the organization.", "description": "You will coordinate and drive early engagements on product architecture, feature definition and program execution. This includes collaborating with all partner organizations relevant for a project, You will: -  Communicate: Provide clear, timely and objective communication, including regular program status updates and critical issues as needed to executive team -  Coordinate: Coordinate discussions and break down complex issues into discussion topics to drive engineering and design alignment with support from project team, maintaining an orientation toward teamwork and collaboration -  Plan: Create and manage project timelines with clear dependencies, critical path and systematic methodology to communicate status. Manage risks and mitigations, and re- plan as events warrant. Drive alignment across the organization and between teams -  Execute: Drive on time delivery and deployment, identifying development and feasibility needs, establishing achievements for checkpoints and status updates -  Problem solve: Proactively identify issues and solutions, and marshal resources vital to attack and resolve. Coordinate with teams to identify issues, prioritize tasks and track risks to schedule and product quality, including cross-functional dependencies", "key_qualifications": "8+ years of experience in project or program management shipping products driven by machine-learned systems to worldwide users. Have personally orchestrated the delivery of multiple significant client/server software products requiring large organizations (100+) to accomplish. Excellent project management skills including project structuring and managing multiple work streams interdependently. Detailed understanding of testing, build and release processes for sophisticated software. Demonstrated skill of negotiating and distilling complex technical requirements from multiple partners into a coherent long term platform roadmap. Demonstrated data-driven decision-making skills, including experience leading metrics-driven projects or programs. Superior group facilitation, interviewing and influence skills. Ability to communicate abstract ideas clearly, and independently manage complex project objectives. Strong verbal and written communication skills, including negotiation, presentation and influence. Ability to independently draft and present deliverables, recommendations, timelines and communication strategies.", "preferred_qualifications": "BS, MS or PHD in computer science or engineering or other technical area, or experience in related field", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $157,000 and $278,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555149"}