{"title": "SoC DFT DV Engineer", "summary": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next phenomenal Apple product. Do you enjoy working on challenges that no one has solved yet? As a member of our multifaceted group, you will get the outstanding and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join a team redefining hardware technology? We are searching for a hard-working engineer to join our exciting team of problem solvers.", "description": "In this highly transparent and interactive role, your primary responsibilities will include: -  Reviewing Architecture and Design Specifications. -  Extracting design features and developing attributes and verification plans. -  Working with designers to verify DFT implementation and run various checks. -  Implementing test benches, generating advised/constrained random tests. -  Debugging failures, running gate level simulations, supervising bugs, and closing coverage. -  Handling schedules and supporting multi-functional engineering effort. -  Assisting in verification flows, automation scripts and regressions. -  Working with test engineers to bring up test patterns on silicon.", "key_qualifications": "Proven experience in large processors and/or SOC designs. Hands-on experience in directed or random verification, coverage analysis and assertions. Proficient in scripting languages such as Perl, Python or TCL Excellent skills in problem solving, communication and desire to seek new challenges. Good knowledge of general logic design, and exposure to DFT is a plus.", "preferred_qualifications": "", "education_experience": "Bachelors Degree + 0 Years of Experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200503152"}