{"title": "Senior Geospatial Data Engineer", "summary": "Apple Maps is seeking a Senior Geospatial Data Engineer to join our Data Evaluation team. The ideal candidate will possess substantial professional experience in spatial data analysis, quality assurance/control, data engineering, and experience working with large-scale, scalable data solutions. Join a team that is focused on spatial data evaluation, automation, and data quality measurement, comprised of diverse skills and backgrounds, all with the same goal: helping to build the world’s best map.", "description": "Our Data Evaluation team collaborates with various groups within Apple Maps to enhance the efficiency and accuracy of Maps data evaluation and analysis. You will be working with us to help automate the measurement of data quality and change over time, working in coordination with our Evaluation Engineering and Data Engineering teams. Ongoing projects necessitate the design and implementation of novel automated systems that seamlessly integrate with the Maps data production processes, enabling continuous evaluations and the extraction of valuable insights. The successful candidate will closely collaborate with other data engineers, software engineers, data scientists, evaluation and SRE teams to deliver business objectives associated with this project, ensuring alignment to budget and time constraints. Designing and implementing geospatial databases, data models, and ETL processes using tools like Postgres/PostGIS, and working with serialized data formats such as protobuf/avro.", "key_qualifications": "", "preferred_qualifications": "Strong proficiency in Python, Scala, SQL, and shell scripting for data manipulation and ETL processes. Work closely with multiple multi-functional teams to successfully coordinate and handle user expectations. Excellent communication skills", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559127"}