{"title": "Wireless Systems Validation Engineer – WLAN, BT, UWB, Thread", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Our RF System Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB), and Thread technologies into Apple’s wireless products.", "description": "You will be responsible for validating & characterizing conducted level wireless system performance across wireless technologies towards industry conformance, regulatory compliance, carrier and use case requirements. Examples of activities you may be involved in are:\n\n-  Carrying out validation and characterization test plans to meet industry, emissions and performance requirements \n\n-  Bringing-up device-under-test, help define test requirements and implement test systems setups for validation preparedness \n\n-  Tracking validation status; analyze results; communicate issues & insights from data \n\n-  Performing failure analysis to understand low margin or failing behaviors making use of experimental SW/FW and modified development hardware, and drive issues to closure \n\n-  Collaborating with vendors, technology suppliers and cross-functional staff to optimize RF parametric performance \n\n-  Supporting manufacturing tests for Apple products\n\n-  Certification of Apple products", "key_qualifications": "Practical knowledge of at least one Connectivity Wireless technology including WLAN, BT, UWB or Thread\nPractical knowledge of at least one connectivity industry standards including 802.11, Bluetooth SIG, 802.15 requirements, compliance requirements and required testing methodologies\nKnowledge of system level RF parametrics and its sources in RF component characteristics and behavior\nHands-on experience with bench-level wireless testing, debug at the module, reference board or system-level\nExperience with using RF lab test equipment\nDebug-level experience on connectivity radio systems at the conducted level is a plus\nStrong written and verbal communication skills", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509703"}