{"title": "Computer Vision Algorithms Engineer (m/f/d)", "summary": "The Video Computer Vision team in Video Engineering is working on exciting technologies for future Apple products. We're looking for a computer vision algorithm engineer to join the team that ships the gaze tracking feature for Vision Pro as well as developing solutions for Apple’s next generation products. Our work covers all parts of Apple products, including hardware definition, algorithm development in 3D computer vision and deep learning methods, and on-device performance optimization. We are looking for an outstanding algorithm engineer with broad skills to join us to take part in our high-impact projects", "description": "The team works on sophisticated problems in computer vision that require robust, efficient, well tested, and clean solutions. The ideal candidate will possess the self-motivation, curiosity, and initiative to achieve those goals. Analogously, the candidate is a lifelong learner who passionately seeks to improve themselves and the quality of their work. You will work together with similar minds in a unique development team where your skills and expertise can be used to influence future user experiences and hardware that will be used by millions", "key_qualifications": "", "preferred_qualifications": "Desirable are skills in: camera calibration, linear algebra, numerical optimization, factor graph representations, statistical estimation theory and data analysis. Knowledge and experience in failure analysis methodologies such as FMEA is a plus. Proactive, analytical thinking, excellent problem-solving and interpersonal skills. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559772"}