{"title": "iOS Framework Engineer", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies.", "description": "As a member of the NFC team you will help develop NFC software to enable extraordinary NFC experiences such as CoreNFC, ApplePay, and GymKit. In this role you will develop system services for NFC including SDKs and APIs, support new hardware, participate in feature design, and define specifications.", "key_qualifications": "4+ years of experience in mobile application or firmware development. Strong programming experience in iOS, Swift, and Objective C. Experience with SDK development and API design. System programming including daemons, libraries, multithreading, and IPC. Familiarity with NFC, Global Platform, and payment systems is a plus. Additional desired skills that would be a plus: OSX programming experience, Low-level communication protocols such as UART and I2C. Hardware validation and bringup, including scoping and tracing UART/I2C. Experience with NFC protocols (ISO14443, ISO15693, ISO7816).", "preferred_qualifications": "", "education_experience": "BS Computer Science or Equivalent", "additional_requirements": "OSX programming experience, Low-level communication protocols such as UART and I2C, Hardware validation and bringup, including scoping and tracing UART/I2C, Experience with NFC protocols (ISO14443, ISO15693, ISO7816).", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551684"}