{"title": "Financial Analyst, Retail Engineering", "summary": "Imagine what you could do here! At Apple, we deliver products, technologies, and services to inspire creativity and enrich lives. Apple has become one of the most recognized and trusted brands in the world. As such, we hold ourselves to the highest standards to deliver the best Retail experience second to no one! The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Retail Engineering Finance organization is chartered to provide sound financial governance and oversight across our Engineering teams to ensure Apple Retail implements the right-sized projects (dollars and people resources) to keep Apple Retail on the cutting edge of customer service. We are looking for someone who can support the financial “nuts and bolts” behind these projects. This individual will partner with key engineering stakeholders, as well as those throughout our IS&T and Finance team.", "description": "As an analyst on the team, you will play a crucial role in the finance strategy for the Retail Engineering organization. In collaboration with stakeholders, this individual will be a key financial leader in analyzing the financial health across the organization and driving initiatives. Success in this role includes building trust and partnerships, having a hunger to continuously learn, demonstrate a sense of ownership, and being motivated to improve and innovate (especially in the face of ambiguity). Primary Responsibilities Include: -  Financial ownership and operations of a capital expenditures portfolio including execution of project funding, cash flow and budget management, and forecasting -  Leadership and execution of the Procure-to-Pay (P2P) process through milestone planning, vendor management, purchase requisition creation, and invoice approval oversight -  Collaborating with Engineering teams to analyze resource activities, ensure proper allocation, and support capacity planning -  Conduct critical financial processes and analyses, such as the Fixed Asset Audit, along with other ad hoc projects -  Driving efficiencies and deeper analyses of current processes and activities", "key_qualifications": "", "preferred_qualifications": "Strong Microsoft Excel and data analysis skills, Experience with enterprise software systems and/or Apple internal applications (e.g. eApproval, SAP, Tableau, Process Director) a plus, Demonstrated success in managing multiple activities/projects, priorities, and people in a dynamic environment, Analytical and problem-solving skills with attention to detail, Strong organizational and process/project management skills, Ability to partner across different organizations and at all levels, Solid verbal and written communication skills, Should be able to act independently and be self-motivated, Desire to learn, improve, and innovate", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556965"}