{"title": "ML - Data Scientist", "summary": "Do you have a passion for computer vision and deep learning? The Video Engineering Data Analytics and Quality (DAQ) group is looking for a data scientist with a strong ability to identify and communicate patterns in data and model behavior. In this role, you will collaborate with multiple teams (machine learning, quality assurance, cloud infrastructure support, user studies) to improve algorithm quality and guide feature development with a data driven approach in order to deliver amazing computer vision experiences.", "description": "Video Engineering DAQ team is seeking a self-motivated, detail-oriented data scientist to research and develop evaluation methods to drive the continuous improvement for Apple’s wide variety of computer vision projects. You will gain a deep understanding of various Apple algorithms and be tasked with performing deep-dive failure analysis on data from telemetry (on-device logging data) to large scale user studies to find potential root causes of unexpected algorithm performance, and you will routinely present your results to leadership and cross-functional teams. Moreover, a strong coding background will be required as you will also be tasked with developing and maintaining automation pipelines to analyze and visualize data.", "key_qualifications": "Empty", "preferred_qualifications": "Solid background in data science, machine learning, Computer vision and statistical data analysis\nDemonstrated experience in in-depth analysis of machine learning model failures\nExperience crafting, conducting, analyzing, and interpreting experiments and investigations\nProven expertise in data wrangling and developing data visualizations & reporting with toolings such as Tableau, Superset, AWS etc.\nDetail-oriented to keep track of and understand the workings of complex algorithms\nSelf-motivated and curious with creative and critical thinking capabilities to improve data quality evaluation methods for diverse and complex data annotation programs\nOutstanding verbal and written communication skills, along with strong collaborative abilities\nExperience presenting data to stakeholders\nFamiliar with machine learning interpretability methods is a big plus", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554894"}