{"title": "Creative Director Brand, Art", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences.  We are looking for a Creative Director to join our Marcom advertising and creative team who will empower a team of hardworking writers, art directors, and ACD’s to build concepts across all mediums for products, product launches and campaigns. This Creative Director will share our deep love of Apple and Apple products and your work will be seen by Apple customers the world over.", "description": "Own the creative process and direct creative teams across Marcom to create, review, and empower campaigns for the Apple brand and products. Collaborate with CD partner to lead teams through concept development and execution of advertising and film deliverables for both broadcast and digital advertising spaces—as well as keynote event films and other projects with global reach. Present work to senior creative staff, product marketing managers and Apple executives. Provide feedback, listen to perspectives, and resolve conflicts within your team as well as across Marcom, ensuring all voices are heard and considered.", "key_qualifications": "", "preferred_qualifications": "Ability to execute both film, digital and other media with a high level of craft and attention to detail. Clear demonstration of creative work and content that is thoughtful, clear, inspiring, and which ranges from single executions to both short and long form storytelling. Experience crafting work in the mediums of advertising, social media, product launches, branding, photography, film and video. Passion for the Apple brand and Apple products, and strong drive to create clear work that feels uniquely Apple. The ability to approach problem solving with tenacity and flexibility. See both the bigger picture and stay hyper-focused on getting the details right. Passion in guiding emerging talent and ACD’s as well as working in the creative process.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $222,600 and $334,900, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558086"}