{"title": "Auditor", "summary": "Apple is currently recruiting a Business Assurance & Compliance staff position to audit, conduct business process reviews, support business initiatives, conduct investigations and support Sarbanes-Oxley compliance in an integrated systems environment. This position provides the successful candidate with an ideal opportunity to contribute to the organizations’ control environment and learn business processes in a period of unprecedented growth. Apple Business Assurance & Compliance staff gain a broad perspective across the Company through varied short-term assignments that can range from unique special projects for new and existing businesses to supporting audit engagements in a dynamic setting.", "description": "Primarily responsible for the following: - Conduct financial and operational audits as well as business process reviews throughout Apple’s global operations. - Diagnose operational risks and process improvement opportunities. - Develop close but independent working relationships with management in all areas of the business. - Develop recommendations to improve financial and operational controls. - Ensure that transactions are accounted for in accordance with established company policies and in accordance with Generally Accepted Accounting Principles. - Work closely with Business Assurance & Compliance team and other business groups on diversified projects. - Develop reports and presentations on project findings and recommendations to senior management. - Support and/or lead special projects, including litigation support. - Develop, implement, and monitor process and policy changes throughout an organization. - Provide a review of financial processes and procedures in order to evaluate best practices, efficiency and compliance with the requirements of the Sarbanes-Oxley Act. - Coordinate with process and control owners for SOX quarterly certifications; coordinate with process owners for annual process document updates; coordinate with external auditors on audit issues around compliance. - Conduct internal investigations of company violations and other legal matters. - Other duties as assigned", "key_qualifications": "Minimum of 2-4 years of experience in a \"Big 4\" accounting/consulting environment and/or experience in conducting financial and operational audits in a multi-national company. Experience in conducting contract audits of vendors, contractors and other business partners that support the company. Capable of performing risk assessments and identifying key controllable business and financial risks. Demonstrated ability to develop, design, and execute financial and operational audit plans and programs Familiarity with auditing in an integrated systems environment (SAP) Experienced in conducting internal financial audits of public and/or private companies; SOX experience is a must. Demonstrated project management skills. Must posses good problem identification and analytical skills. Ability to develop and write meaningful reports and presentations. Motivated self-starter who works well individually and in teams. Excellent written and verbal English skills required. Good presentation skills with proficiency in presentation, spreadsheet, word processing and database programs. Good organization skills required. Possess an understanding of auditing business processes in an integrated systems environment.", "preferred_qualifications": "", "education_experience": "Bachelor's in Finance, Accounting or other related degree", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541670"}