{"title": "Senior Software Development Engineer - Ad Platforms", "summary": "At Apple, we work daily to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote their work. Today, our technology and services power advertising in Search Ads in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.", "description": "-  Work closely with Architects and other stakeholders to design capabilities that improve overall engineering efficiency. \n-  Work on capacity planning and scaling aspects of the solutions.\n-  Deliver smart solutions that help reduce the time to market\n-  Develop expertise in Apple infrastructure and best practices, applying them to run world-class distributed systems\n-  Design and develop capabilities to improve services provisioning\n-  Design and improve new and existing system architectures based on reliability and high availability principles, integrating extensive logging and observability.\n-  Establish robust deployment and delivery pipelines.", "key_qualifications": "8+ years of overall experience in working on leading one or more large-scale solutions.\nExperience in building shared capabilities and/or components that are composable to higher-order capabilities\nExpertise in Infrastructure as Code (IaC) tools like Terraform\nExpertise in operating Linux-based systems, with a solid understanding of its internals\nProficiency in operating infrastructures on AWS\nStrong programming skills in Java and desired skills in Python\nDemonstrated problem-solving ability with a creative and innovative mindset\nStrong sense of ownership, customer service, and integrity with a desire to communicate and collaborate with teams\nExperience in mentoring and developing more junior engineers\nSelf-motivated and eager to learn and grow", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science or equivalent industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546214"}