{"title": "Software Development Engineer - Test", "summary": "Building a modern GPU Compiler requires a lot of complicated supporting systems and processes to ensure the quality and performance of each release is better than that before. As such we are seeking highly motivated, innovative, and confident individuals to join the LLVM AGX Experience team; You will be responsible developing new tools and systems as well as maintaining our existing infrastructure to amplify the performance of the team by tackling some of the big challenges we face as create compilers for all the GPU’s in our current and future products across iOS, watchOS, tvOS, macOS, and the new visionOS.", "description": "In this role you will:\n- Support and improve our Pull Request and CI system\n- Maintain and support our test fleet, using a combination of cloud-based test systems and physical hardware\n- Aid engineers in bringing up new hardware and integrating it into our development and testing processes.\n- Create and maintain internal tools and systems such as Ansible-based configuration systems to enhance the productivity of the AGX GPU Compiler team", "key_qualifications": "N/A", "preferred_qualifications": "Familiarity with cloud services and tools, such as docker, AWS, Kubernetes", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557244"}