{"title": "Systems Software Engineer, Platform Architecture", "summary": "Imagine what you can do here. At Apple, new ideas have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job, and there’s no telling what we can accomplish together.  Do you love crafting elegant solutions to highly complex challenges? Can you intrinsically see the importance in every detail? At Apple, our Platform Architecture group is responsible for connecting our hardware and software into one unified system. Join this team, and you’ll collaborate with engineers across Apple to build and deploy forward-looking prototype systems that contribute to the development of our world renowned hardware and software architecture.  You and your team will confirm that every product we make performs exactly as intended. Together, our work will be the reason millions of customers feel they can trust their devices every single day.", "description": "Apple’s Platform Architecture group is seeking a systems engineer to build high performance functional models of advanced SoC designs and to help bridge the gap between Software and Hardware, influencing performance improvements, power efficiency, security, and the programming ease of Apple products.   - Prototype and analyze architecture and operating system proposals.  - Interface kernels and drivers with processor & SoC models.  - Work closely with cross-functional teams across product groups.  - Promote new opportunities and techniques with other groups.", "key_qualifications": "Background in low-level software, operating systems, or compilers. Excellent programming (C++/C) and scripting skills (Python). Assembly experience a plus. Proficiency with debugging large, complex system software. Experience with kernel, driver and firmware development a plus. Experience with modeling and simulation a plus. Knowledge of ARM and/or X86 architectures a plus.", "preferred_qualifications": "", "education_experience": "BS with 10+ years experience. Degree in Computer Science or Computer Engineering preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540001"}