{"title": "Chip Architect", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple's customers every single day.", "description": "This role involves interaction with many cross-functional and multi-disciplinary teams including hardware, software and system engineers. Being able to work in a collaborative manner with cross-functional teams is essential. - Architecture and Micro-architecture specification definition for upcoming SOCs - Work with cross-functional teams to set SOC requirements - Explore new approaches aligned with emerging technologies, competitive performance requirements, and critical system constraints - Perform feasibility analysis including SoC area, performance and power estimates - Guide an efficient system/hardware/software architecture to meet product requirements - Assess and guide system integration feasibility, feature and implementation trade-offs", "key_qualifications": "BS and 20+ years of relevant industry experience. Experience in the areas of Wireless technologies such as WiFi and BT architecture and implementation experience is highly desirable. Must have a thorough understanding of SoC, WiFi PHY, WiFi MAC and system architecture fundamentals, backed with substantial experience. This includes the following fields: Power and performance trade-offs, system states definition including idle and dynamic power states, Microprocessor Subsystems, Memory Controllers, Interconnect protocols and topologies, External interfaces topologies and trade-offs, the Hardware-software partitioning considerations, SoC data and control flows definition, Digital ASIC flows and Debug methodologies, Excellent communication skills across organizations and at the executive level, Excellent written skills for clear and concise reporting, Experience in Digital ASIC design or verification is an advantage", "preferred_qualifications": "", "education_experience": "BS and 20+ years of relevant industry experience.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You'll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200545369"}