{"title": "Design Verification Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and exceptionally talented design verification engineer. As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.", "description": "In this role, you will be responsible for ensuring a bug-free first silicon for part of the SoC / IP and are encouraged to: Develop detailed test and coverage plans based on the micro-architecture. Develop verification methodology suitable for the IP, ensuring a scalable and portable environment. Develop verification environment, including all the respective components such as stimulus, checkers, assertions, trackers, coverage. Develop verification plans for all features under your care. Implement verification plans, including design bring-up, Design Verification environment bring-up, regression enabling for all features under your care, de-bug of the test failures. Develop block, IP and SoC level test-benches Track and report Design Verification progress using a variety of metrics, including bugs and coverage. Develop mixed-signal simulation environment, and work closely with analog team to ensure overall bug-free mixed-signal design.", "key_qualifications": "Deep knowledge of SystemVerilog test-bench language and UVM Experience developing scalable and portable test-benches. Experience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulations. Experience with serial protocols such as PCIe or USB Experience with mixed signal verification methodology for IPs such as PHYs, PLLs etc. In lieu of UVM knowledge, C/C++ level knowledge. Deep knowledge of one of the scripting languages: Python, Perl, TCL. Deep knowledge of formal verification methodology.", "preferred_qualifications": "", "education_experience": "BS degree in technical discipline with minimum 10 years of relevant experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529614"}