{"title": "Advertising Producer, India", "summary": "Apple is a detail-obsessed company that always puts customer experience first. It shows in the products we make, and also in the communications we create to help people understand and get the most out of those products. Like the team who designs the products, we share the goal of making everything we touch, feel beautiful and elegantly simple. The role of the Marketing Communications group at Apple in India is to develop unique creative marketing solutions that will support Apple’s business growth without compromising the need for flawless development and execution of world-class communications. As Marcom's Advertising Producer, you will be responsible for the creative development, production, and deployment of our advertising campaigns. You’ll collaborate with our creative and internal teams to source and manage all production, editing, and post production needs, as well as manage the full lifecycle for the production of ad film to work powerfully for our geo markets. This position requires a self-motivated, flexible individual with well-developed communication skills. You should be a strong thinker and negotiator, capable of seeing the bigger picture and orchestrating projects from brief to completion. Inclusion is a shared responsibility and we work together to foster a culture where everyone belongs and is inspired to do their best work. Come and do the best and most exciting work of your career at Apple!", "description": "-  Lead the creative implementation of advertising creative, working with our creative and product agency team and Apple internal team.\n-  Coordinate creative validation with the local Creative team.\n-  Understand and be able to lead day-to-day considerations of a shoot, and be able to communicate all details from creative to financial to logistical.\n-  Evaluate production estimates and regularly challenge the agency on cost leverage. \n-  Organise and lead weekly agency production status meetings.", "key_qualifications": "Experience of working in the Indian advertising space\nExperience of working within a global client and agency structure.\nStrong production knowledge (broadcast, outdoor, print and digital).\nAbility to source production and post-production agencies, as well as other freelance needs.\nAbility to understand Apple’s tone of voice and guidelines will enable you to give constructive creative feedback to the agencies.\nExceptional project management skills and can lead project management discussions.\nHands-on, 'can-do' approach helps you to solve problems.\nDemonstrate acute attention to detail.\nAbility to learn new processes and technology quickly.\nAgile at work to prioritise and to work quickly and efficiently within very tight time frames.\nAbility to collaborate effectively and build long lasting working relationship across stakeholders\nYou have a deep passion for the Apple brand.", "preferred_qualifications": "", "education_experience": "Bachelor or above degrees in Communication, Marketing, etc.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548156"}