{"title": "Business Affairs Manager - AppleCare", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don't just craft products - they build the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. AppleCare Digital creates alluring digital content and experiences to help people get the most out of their Apple products. We make it easy for everyone to learn about, use, and maintain Apple software and hardware. We're looking for an experienced Business Affairs Manager to lead our cross-channel video business affairs within AppleCare Digital. In this role, you'll clear assets and review content from a business affairs perspective for Apple's social media and on-domain channels. You'll partner closely with producers, creatives, legal and marcom business affairs to ensure that video content is cleared for use while maintaining creative integrity. The ideal candidate pays close attention to detail, is organized and self-motivated, and can prioritize multiple projects on a tight timeline. You can influence without control, speak clearly to business affairs, and advocate while maintaining positive relationships. You're passionate about Apple, our customers, and offering a best-in-class support experience.", "description": "In this role, you'll oversee business affairs for AppleCare Digital content for @AppleSupport social handles and on-domain content. You'll partner closely with internal and external teams and ensure that video content, third-party assets, and photography are cleared for use and reviewed for cultural sensitivities. Additional responsibilities will include the following: Maintain weekly communication with team leads to ensure information flows accurately, action items are clear, and issues are escalated at the right time and to the right people. Work with multiple teams and provide legal perspective and counseling on various matters, including trademarks and copyrights. Assess, handle and communicate risks; advise team leads concerning risk exposure, and provide asset options. Maintain business affairs process decks, releases, and trackers for projects, and lead and update third-party content and review processes. Collaborate with internal and external producers on productions and manage NDAs, casting documentation, music, and talent agreements. Responsible for reviewing vendor agreements from a business affairs perspective and managing overall risk for the company. Partner with your teammates and other AppleCare partners to build roadmaps and requirements for tool and system development.", "key_qualifications": "", "preferred_qualifications": "Ability to navigate the creative process and communicate asset needs across multiple regions. Ability to thrive in high-pressure environments and adapt to ever-changing deadlines. Experience working with various internal and external partners across a large organization. Self-starter with a demonstrated ability to prioritize and manage multiple projects.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555011"}