{"title": "Materials Program Manager", "summary": "As a Materials Program Manager, you will play a crucial role in handling materials that have critical impact on the organization. Responsibilities will encompass materials planning (Clear to build), inventory control, Excess & Obsolete (E&O) analysis and projections, New Product Material readiness, logistics readiness from Suppliers to Contract Manufacturer’s. Develop the strategic direction, goals, objectives and key measurement systems to ensure the business goals are met.", "description": "CLEAR TO BUILD\n- Handle the CTB process, ensure the process is working smoothly and we have clear visibility on materials over a 26-week horizon. Partner with the CM’s and the GSMs (Global Supply Managers) on all identified material issues (including sub-tier supply chain) until issues are closed/resolved.\n\nLOGISTICS\n- Ensure the smooth flow of materials necessary to meet the production schedules, inventory control requirements, and on-going production line support. Make sure that we clearly understand the logistics requirements by commodity to enable an uninterrupted flow of materials.\n\nEXCESS & OBSOLETE\n- Lead phase-out of obsolete parts and the transition to new production materials.\n- Identify and mitigate E&O in advance to ensure we make the correct company decisions regarding build plan changes, cut-in vs. roll-in requirements, post ramp qualification opportunities, etc.\n- Highlight parts with liability and propose solutions to management.\n- Upon Engineering Change Notice (ECN) or End of Production (EOP) events, track & audit E&O claims, report to Finance for financial reserves, and ensure timely resolution and closure of such claims/reserves.\n\nNEW PRODUCT MATERIALS READINESS\n- During New Product Introduction (NPI) phase, lead material readiness meetings with the GSMs to ensure that we understand the supply base and related challenges (i.e. supplier location and logistics, sole sourced modules, component lead-time, supplier share of business, order lead time and order cancellation window).\n- Identify critical engineering release breakthroughs; assess necessity for risk ramp and associated liabilities, to ensure material supply for product ramp is protected.\n- Identify issues early in the NPI phase and monitor/drive these to resolution prior to ramp.\n- Identify supply chain on modules and components to ensure that we understand any new challenges associated with the new product.\n\nALLOCATIONS\n- Play a meaningful role in the allocation of components that are in short supply.\n- Provide an aggregated view of supply versus demand as the baseline for program and site-allocation decisions. - Collaborate with the Supply Demand Management (SDM) team and GSMs to make sure we allocate parts to improve revenue. Communicate the allocation plans with the significant parties.\n\nEXECUTIVE MANAGEMENT REPORTING\n- Build and maintain reports and summaries on a regular (weekly/daily) basis to support the business growth. Ensure data is accurate and on time.", "key_qualifications": "", "preferred_qualifications": "-  “Advanced User” of Excel and a deep understanding of Excel Modeling techniques is a plus. Highly analytical and detail oriented.\n-  Show strong written and oral interpersonal skills with the ability to present to Executive teams.\n-  Technical expertise and prior OEM materials management experience is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553604"}