{"title": "Cross-functional Project Manager, Apple Services", "summary": "The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. We know our ability to create the world's most innovative products depends on people who represent the variety of the human experience and inspire us with great thinking. Join Apple and help us leave the world better than we found it! The Services Growth Marketing team is seeking an expert Project Manager to focus on defining, developing and launching systems and processes that support the ongoing growth and enjoyment of Appleʼs media services, including Music, TV+, Arcade, News, Fitness+ and Apple One. Core to this role is a keen understanding of subscription media services, marketing campaigns, product development lifecycles, and flexible, real-time collaboration platforms. The ideal candidate will work in quick and rapid iterative cycles, with creativity and humility to formulate new ideas using data and structured thinking to inform the approach. This position requires working closely with global and cross-functional teams such as Engineering, Product, Operations, Business and Marketing.", "description": "This position will work with internal Marketing leads and a cross-functional team of marketing managers, engineers, product owners, and business leads to:-  Develop and launch projects, features and programs for the ongoing evolution of Appleʼs services business and the associated customer experience.-  Participate in the development and evolution of the collaboration platforms used within the team and by our partners to track and prioritize projects and programs including recommending and driving feature enhancements, contributing to business requirements, and driving the implementation into Growth Marketing.-  Report and drive project and program status across the various businesses and lifecycles.", "key_qualifications": "N/A", "preferred_qualifications": "Excellent oral and written communication skills with the ability to communicate with and present to partners at all levels of the organization. Demonstrated expertise working effectively and autonomously across multiple teams in situations of ambiguity, with only high-level direction. Ability to build and maintain strong partner relationships and demonstrate strong interpersonal skills. Passion for partnering with Product, Engineering, Analytics, and Marketing teams to prioritize and create implementation plans for new features, programs and capabilities.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557823"}