{"title": "Asia IC Packaging Engineer", "summary": "At Apple, we believe our products begin with our people. By hiring a team with varied strengths, we drive creative thought. By giving that team everything they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?", "description": "-  Explore and evaluate packaging technologies as our own packaging tool box. Define new package characteristics and specification based on unique module and system level performance, cost, and footprint. -  Work with leading foundry & assembly suppliers on advanced organic and silicon interposer interconnect package development from design, new material, new equipment selection and establish robust process/process flow. Perform initial proof of concept sample build, process of record, package and process qualification, reliability test, yield analysis and continuous improvement. -  Interface and coordinate with other packaging team members to comply with product development/ramp schedule. Deliver package/packaging milestones on time. -  Define packaging roadmap based on long term packaged product requirements. Work closely and manage suppliers’ R&D activities. -  At least 5~10% travel to domestic and international locations.", "key_qualifications": " ", "preferred_qualifications": "Good understanding to WoW, Silicon photonics, HBM integration. Knowledge in silicon node BEOL and device physics or component/board level reliability testing are plus. Proven track record to drive issue resolution with good understanding to root cause and physics, motivate and mobilize all levels within supplier to accomplish any given task. Able to perform independent research and development work with minimal supervision. Good written and verbal communication skills. Able to present ideas, design concepts, data and plan with high confidence at internal or external meetings.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555182"}