{"title": "Senior Full-Stack Software Engineer", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation...", "description": "In this role, you will:\n\n- Partner closely day-to-day with other engineers, users, and business leaders to plan, design, prototype and ship world class applications that push the state of the art\n- Build breakthrough experiences to transform the sales experience\n- Actively engage in all aspects of development, from ideation and experimentation to deployment\n- Contribute to overall architecture and help set the technical direction of the team\n- Design and implement REST API’s and architect inter-service communication and data flows\n- Research and developing new technologies and develop proofs of concept\n- Provide help and guidance to less experienced team members\n- Write high quality code and review the work of your peers", "key_qualifications": "Typically requires 8+ years of related experience\nAdvanced programming skills in C++, Java, Python, SQL, Golang\nStrong proficiency in front-end frameworks such as React, Angular, or Vue.js.\nDeep functional expertise in API’s and strong understanding of HTTP(S) and REST architecture\nBachelor's degree in Software Engineering/Computer Science/Information Science/Engineering or equivalent experience in computer programming", "preferred_qualifications": "Background as a Full-Stack Developer focused on both front-end and back-end technologies is highly preferred\nSolid understanding of database systems (SQL, NoSQL) and cloud services and deployment (AWS, Azure, Google Cloud) is a plus\nExperience with large-scale distributed systems or machine learning batch inference systems\nUnderstanding of accessibility best practices is a plus\nAbility to create solutions, navigate ambiguity, and bring clarity to early-stage product ideas\nExcellent communication and collaboration skills\nOutstanding problem-solving, critical thinking, and analytical skills\nProven relationship building skills and ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners\nAbility to navigate ambiguity and work effectively in a fast-paced, multi-functional environment\nMaster’s Degree is a plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $264,200...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557523"}