{"title": "Vendor Manager, Retail Customer Care", "summary": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what can be accomplished! The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. This position is responsible for operational performance of RCC’s(Retail Customer Care) OSV(outsource vendor) contact center partners in the Greater China. The Vendor Manager is to manage day to day business execution, lead with strategic directions to gain OSV commitment, callout risk and drive solutions, and develop initiatives to improve operational performance aligned to the customer experience. You must be a strong team player, a great communicator, and a business savvy individual who has an excellent understanding of the needs and challenges facing today’s outsourcing partners and how they fit with Apple's unique customer focus and passion for excellence. Candidate must be self motivated with strong analytical, management and coordination skills to handle a variety of activities and complexities spanning across the organization. Candidate must be an effective negotiator and skilled at resource balancing and conflict management. Candidate must be able to act as a liaison between the business and outsource partners. A critical key to success is the ability to gain alignment by proactive partnering with all levels across the organization.", "description": "-  Drive outsourced vendor operational excellence and service delivery by Apple standard\n-  Align with Apple internal support groups and provide feedback as appropriate on processes, procedures, call drivers, staffing etc\n-  Facilitate and review daily, weekly, monthly and quarterly performance metrics and trending to ensure alignment with business expectations, develop action plans, as required\n-  Drive initiatives/projects to uplift network performance, either by fixing problems or optimizing to the next level\n-  All-round ramp plan implementation based on headcount forecast", "key_qualifications": "", "preferred_qualifications": "COPC Registered Coordination Certification preferred\nTableau Analytical Skill is a plus\nBA/BS Degree in Business or related filed\nFlexible to trave", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554061"}