{"title": "Senior Software Engineer", "summary": "At Apple, we work every day to build products that enrich people’s lives! Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.", "description": "At Ad Platforms, we are building the next generation of privacy-focused advertising capabilities. As a part of the data organization, we work at the cutting edge of data engineering, machine learning, and privacy at Apple's scale. We are constantly developing data products to provide amazing user experiences and to drive value for developers and publishers. We are looking for a Senior Software Engineer to design and develop real-time stream processing systems and to transform how advertising works with data. You will be a leading voice in our technology strategy and its delivery as well as serve as a mentor to our junior members of the team. As a part of this team, you will -\n\n-  Engineer secure and scalable data processing systems across different execution contexts such as real-time, near real-time, and batch using Spark, Hadoop, Kafka, Cassandra and beyond.\n\n-  Collaborate with a team of world-class data infrastructure engineers and product managers to apply innovative techniques and technologies that process petabytes of realtime streaming events.\n\n-  Lead a group of talented data infrastructure engineers and help align the technical direction across the entire Ad Platforms data organization. You will join and contribute to a culture that emphasizes reliability, resiliency, extensibility, scalability, and productivity. We are one team, nurturing each other’s growth and supporting each other in delivering for our customers and Apple.", "key_qualifications": "8+ years of software engineering experience, ideally within the ads or media space, building distributed, scalable data pipelines and data platforms\nStrong computer science and data engineering fundamentals\nProficiency with modern programming languages (e.g. Java/Scala/C++) and ease with picking up new technologies independently\nExpertise in NoSQL datastores (e.g. Cassandra, Keyspaces, ElastiCache) and data modeling\nProficiency in distributed systems and data processing technologies (e.g. Spark, Kafka, Flink)\nExperience building and scaling systems on premise and in the cloud\nStrong technical skills with proven experience developing, architecting, and supporting scalable data infrastructure\nPassion for data quality, code elegance, clear documentation, cost saving and operational excellence and effective communication with cross-functional teams", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science, Distributed Systems, Software Engineering, or related field.", "additional_requirements": "-  Comfortable working in a rapidly changing environment with ambiguous requirements\n-  Comfortable with rotating on-call for mission-critical applications\n-  Rust or other non Java/C programming languages is a nice to have\n-  Prior experience in advertising industry is a huge plus!\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \u2028\u2028Apple benefits programs vary by country and are subject to eligibility requirements.\u2028\u2028Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546699"}