{"title": "AIML - Natural Language Platform Engineer, Siri and Information Intelligence", "summary": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri Natural Language team at Apple.", "description": "The goal of the Siri Natural Language team is to take Siri to the next level of intelligence and accuracy in natural language understanding. You will design and implement low latency Siri NLU on-device. You should be passionate about taking machine learning model inference algorithms into production. Excellent communication skills will be required to coordinate work across multiple teams to resolve issues", "key_qualifications": "Experience developing in C++ and/or Python\nExperience building model release or validation pipelines is a plus\nExperience with on-device development in Obj-C / Swift is a plus\nStrong understanding of algorithms and software design\nExperience working on CI/CD pipelines using job scheduling tools such as TeamCity or Jenkins\nStrong communication skills to work well with cross-functional engineering teams\nAbility to work in a fast-paced environment with rapidly changing priorities\nExperience with NLP or search engine is a plus", "preferred_qualifications": "", "education_experience": "Master’s degree in Computer Science or Bachelor's degree with 3+ years experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,731 and $204,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549823"}