{"title": "ASIC Logic Design Engineer for Wireless SoC Group", "summary": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance of every detail? Come join Apple’s growing wireless silicon development team! As part of our Silicon Technologies group, you’ll help design our next-generation, power-efficient, system-on-chip (SoC). Our wireless SoC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. If you enjoy a fast-paced and challenging environment, and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply.", "description": "Responsibility of block and/or sub-system micro-architecture and design implementation. Work with architects and system teams to define the right solution for the product requirements. Implement block and/or sub-system design, analyze performance and power and support verification teams. Responsibility of FE flows such as synthesis, CDC, RDC and Lint to ensure high quality production worthy design.", "key_qualifications": "5+ years of hands-on experience in ASIC design flow\nSolid background in design micro-architecture\nExperience in ASIC design front end flows, such as Lint, CDC, RDC\nExperience in bus-fabrics and low power design is a plus\nSelf-starter, highly motivated, highly organized, and schedule-driven", "preferred_qualifications": "", "education_experience": "BSc or MSC in Electrical Engineering or Computer Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528463"}