{"title": "CPU Pre-Silicon Engineering Program Manager", "summary": "Come and join the team that delivers the CPUs in the M1/M2 Mac, iPhone, iPad and Apple Watch! At Apple, we focus on innovative design and principled execution to build the most efficient CPUs that scale across our full range of products and deliver industry-leading power and performance. We partner across hardware, software and systems teams to build truly optimized products and amazing user experiences. To accomplish this, we need technical excellence combined with the expertise to work across the organization and to put each decision in the right context.", "description": "In this role, you will be embedded directly with the CPU design team and will drive the day-to-day project activities, as well as the longer-term initiatives. You will collaborate closely with the technical leads and be the main point of contact with other teams. You will be an integral part of the team and project success.\n\nTYPICAL RESPONSIBILITIES WILL INCLUDE:\n-  Developing and negotiating project schedules and deliverables\n-  Driving regular project meetings to focus the team on upcoming landmarks and to identify and resolve technical issues, pulling in the relevant experts and multi-functional stakeholders when necessary\n-  Leading key interfaces with SoC, system, software and CAD\n-  Asking probing questions and working with the functional leads to shape project and product-level decisions and priorities.\n-  Identifying risks and dependencies, generating mitigation plans, and ensuring appropriate steps are taken to resolve\n-  Collecting, analyzing, and communicating project data to give an accurate picture of program status and areas that need attention\n-  Communicating program status and blocking issues to multi-functional teams and different levels of management, as appropriate\n-  Tracking and following up on action items\n-  Defining and driving the process and tools to ensure high-quality project execution, minimal design escapes, and robust milestone completion (design freeze, tapeout etc.) Collecting and integrating takeaways and improvements.", "key_qualifications": "Proven CPU design experience, Established technical leadership and/or project management experience, Strong communication and executive presentation skills, Strong time and task leadership skills with consistent attention to detail, Technical depth in one or more areas (architecture, logic, verification, physical design) and sufficient knowledge of others to understand tradeoffs and challenge the team, Equally comfortable in big-picture strategy and deep technical discussions, Able to build trust and lead through influence, Decisive in navigating tough situations, balancing priorities and handling constraints while running sophisticated, fast-paced programs, Driven to continuously improve processes, methodologies, and tools", "preferred_qualifications": "", "education_experience": "BS + 10 years of relevant experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200506446"}