{"title": "Site Reliability Engineer (SRE) Manager - Apple Cloud Services", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join the Apple Service Engineering team as a Site Reliability Engineering (SRE) Manager to help support and scale cloud services for thousands of development and operations engineers. This is a hands-on role to establish SRE practices for a private cloud service to accelerate our ability to reliably and consistently deliver thousands of applications.", "description": "As a Site Reliability Engineering manager, you will be leading a team responsible for providing the platform for mission-critical cloud systems to maintain constant uptime, scale seamlessly, and allow for new applications and services to flourish. The successful candidate will be highly self-motivated with a passion for excellence, quality and detail. The SRE Manager will not only support operations but also collaborate with the developers and architects within the team to aid in the design and assist with the implementation to improve stability, security and scalability.", "key_qualifications": "Skilled at working cross-functionally to achieve project success\nDesire to build, grow, and mentor a team\nPassion for automation and reluctance for manual implementation\nStrong philosophy of continuous improvement\nStrong sense of ownership wanting to understand how things work and resolve root causes\nAbility to encourage and foster a culture of visibility and transparency across teams\nExperience managing enterprise services in a large-scale nix environment\nExperience with Cloud Computing technologies (particularly Kubernetes)\nExperience with Puppet, Chef or Ansible\nAble to troubleshoot issues across the entire software stack\nExperience operating large-scale multi-tenant infrastructure as a managed service\nStrong verbal and written communication skills", "preferred_qualifications": "", "education_experience": "Technical (Engineering or Computer Science) BS/MS degree or equivalent work experience", "additional_requirements": "Automation advocate - you truly believe in removing operational load via software.\nA strong sense of ownership. At the same time, you're a great teammate who communicates clearly and transparently - Self-motivated, inquisitive, and always looking to learn more.\nExperience managing, scaling, and troubleshooting Java and GoLang applications.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200547846"}