{"title": "Worldwide Supply Demand Product Planner", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Apple is looking for dynamic, highly motivated Supply Demand Planners for our Worldwide Operations group. World-Class operational excellence is a cornerstone of Apple's ability to consistently surprise and delight our customers. The WW Supply Demand Planner plays a critical role in ensuring operational and financial success for the organization. You will be a member of the Supply Demand Management team, a highly influential group within Apple, challenged to scale at the pace of the company’s overall growth. The Supply Demand Planner will develop, communicate, and execute end-to-end product demand and supply plans across all channels of distribution in over 80 countries for a current or future product line. Product line assignments will be made at the time of hire in any of Apple’s multi-billion dollar businesses, including Mac, Watch, iPad, iPhone and Accessories.", "description": "Forecast demand, inventory, and multi-channel sell through. Generate weekly and quarterly supply plans that meet Apple’s financial objectives. Evaluate risks. Plan and implement contingency plans to mitigate. Analyze product sales on a daily basis. Find opportunities and drive partner groups to appropriate action. Coordinate closely with regional product planning teams to ensure supply plans meet sales requirements. Coordinate with Marketing and New Product Operations teams to set launch quantities of new product introductions and to ensure smooth product transitions. Partner with the global procurement teams to allocate constrained components, ensure raw material inventory targets are met, and minimize material obsolescence during product transition. Present product updates and recommended actions to Operations executive management team on a weekly basis. Identify improvement opportunities in the product planning process, marshal resources, and drive projects to completion.", "key_qualifications": "You combine exceptional analytical capabilities, business savvy and leadership skills. You are able to exert tactful influence in a matrixed organization, be a strong team player and communicator. You should be comfortable presenting to executive management.", "preferred_qualifications": "", "education_experience": "MBA, Masters Degree in a related field, or equivalent work experience, is desired. Prior experience in fields that demand complex quantitative analysis such as finance or consulting is desired. Prior experience in product planning, production control, inventory management, or production/manufacturing operations is a plus.", "additional_requirements": "Ability to think strategically and execute tactically, a persistent attention to detail, and a high level of comfort in working with numbers.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $122,300 and $184,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200517568"}