{"title": "Touch ASIC Architect (Digital)", "summary": "Design, develop, and launch next-generation Touch Technologies in Apple products!", "description": "You will be architecting Touch sensing systems and the ASICs required to realize them. You will also be expected to take high level user requirements and create a realizable system that meets these goals. This will include high level modeling of proposed solutions, along with creating detailed specifications of the requirements. This is a highly cross-functional role, and you will work collaboratively to identify critical aspects of how the design will interact with the overall product. Responsibilities include: Creating Touch sensor digital system architecture, Developing high performance, low power signal processing architectures and sensing algorithms to achieve the best touch solutions, Authoring detailed specifications, analyses, and characterization plans for touch system ASICs based on these architectures, Defining System-level and IC micro-architecture of complex digital and mixed-signal ASICs, including requirements for: ARM processing, memory, bus, DSP sub-systems, Power Management, clocking, I/O interfaces, and peripherals, Defining common Digital platform architecture framework, including design methodology and best practices to be used as a reference for the Architecture team, Optimizing designs across multiple disciplines, including Hardware/Firmware design partitioning, trade-off assessments, design checking and tolerance analysis, Contributing technical assessments to strategic decision-making relating to technology and investments, Performing defect root cause analysis and resolution, including diligent bug database tracking, Communicating program status, technical issues, risks, and mitigations plans, clearly and concisely, Minimal business travel as needed to support product development", "key_qualifications": "Experience leading chip architecture and/or digital design is desirable, preferably in touch or communications, Experience developing and launching high volume IC designs, Strong electrical engineering background in embedded system design, including: ASIC microarchitecture, computer architecture, SoC architecture, and custom or standard DSP or hardware accelerator microarchitecture, Experience in FPGA emulation system design preferred, including leading pre-silicon system validation, prototype bring-up, debug, validation, characterization, and module integration support, Excellent written and verbal communication skills and solid teamwork and leadership skills, Experience with IC bring-up and debug, Proficiency in MATLAB, Verilog, or similar simulation, design & modeling tools, Experience with DSP and/or algorithm development is a plus, Direct experience with touch technology and/or flat panel display technology is beneficial", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534546"}