{"title": "Hardware Technology Internships", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet?\r\n\r\nAs a member of our dynamic group, you will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.", "description": "Our Hardware Technology team is responsible for Apple’s breakthrough custom silicon and hardware technologies including battery, applications processors, storage controllers, sensors silicon, display silicon and other chipsets across Apple’s entire product line. In this internship, you will have the opportunity to work among the best engineers in the world on our Silicon Engineering team. Major areas of SOC design, include, but not limited to CPU, GPU, SoC and AMS.\r\nPositions are open in but not limited to:\r\n...\r\nYou will receive technical mentorship and guidance that allows you to learn new things every day, gain practical skills, build real world experience, develop a greater understanding of our industry, and form valuable connections. You will join an extraordinary team, including world-class engineers who are all passionate about applying groundbreaking technologies.\r\n\r\nInterns collaborate with researchers, engineers, and program/project managers to tackle innovative challenges.\r\n\r\nYou will learn new technologies quickly and should possess excellent interpersonal and communication skills!\r\n\r\nTogether, you and your team will partner to design and implement an innovative solution for a problem that is meaningful.\r\n\r\nIf you have a strong technical foundation and can learn new technologies quickly then this could be the team for you!", "key_qualifications": "", "preferred_qualifications": "It’s helpful if you meet one or more of the following qualifications, but it isn’t a requirement\r\n- Previous demonstrated internship or project work in computer architecture, VLSI, design, logic design, or circuit design\r\n- Understanding of formal methods or verification\r\n- Strong teamwork skills with the ability to collaborate with multiple functional teams across a variety of disciplines\r\n- Experience with C/C++, Verilog, VHDL, Python, Perl, Spice is beneficial\r\n- Experience with Timing, Synthesis, Ansys, COMSOL\r\n- Prior internship(s), group or personal project exposure, TA and/or work experience", "education_experience": "Pursuing an undergraduate or graduate degree in Electrical Engineering, Computer Engineering, Electrical and Computer Engineering, Computer Science, Electrical Engineering and Computer Sciences, or related field of study.\r\n- At the end of the internship, you must return to school to continue your education or the internship must be the last requirement for you to graduate.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554360"}