{"title": "Security Engineer, Retail Engineering", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish. As a security engineer in Retail Engineering, you'll be responsible for securing the Apple Online Store and flagship retail stores, through to business-critical backend customer and payment systems. Along the way you'll be expected to grasp the security implications of emerging technologies such as machine learning and cloud.", "description": "-  Perform threat models and architecture reviews of complex projects\n-  Conduct penetration testing against a wide variety of technologies. Ability to communicate these findings in high-quality reports and presentations\n-  Provide guidance and education to partnering teams\n-  Build relationships, influence and improve security culture via various initiatives (presentations, training, etc)\n-  Participate in, or lead Red Team operations against large organizations within Apple\n-  Support partnering blue teams in responding to threats and enhancing detections\n-  Develop tooling to support primary responsibilities\n-  Deliver security campaigns and initiatives to improve the security posture of the organization", "key_qualifications": "", "preferred_qualifications": "BSc in Computer Science or equivalent\nOSCP or OSWE certification\nExperience with CTFs or hacking labs\nExperience securing and pentesting mobile applications\nExperience participating in or leading red teams or similar offensive security engagements\nPublications, security research, bug bounties or CVEs are highly regarded\nExperience presenting to technical and non-technical audiences\nPassion for information security\nAbility and motivation to learn new skills, concepts, and technologies\nExcellent written and verbal communication skills\nAbility to take ownership of security problems and drive remediation to competition\nSelf-motivated, able to work individually and as part of a global team\nAbility to grasp large sophisticated systems and context-switch when needed\nAbility and willingness to work both from the office and from home\nSome international travel may be required", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558613"}