{"title": "AppleCare Vendor Manager", "summary": "The Asia Pacific Vendor Management are looking for a Vendor Manager in the Philippines.", "description": "The role will create and lead business relationships with our vendor partners to implement support solutions for our customers. The success of our partner performance against defined metrics across multiple sites in the Philippines will be in your scope...", "key_qualifications": "5-10 years of work experience in a contact centre environment including technical support management and customer service management with phone, email and chat solutions in a large inbound contact centre. Experience in the management of outsourced suppliers delivering customer facing support for at least 3 years - either on the customer or partner side. Understanding of COPC concepts essential with COPC Coordinator certification preferred. Familiar with the quality and consistency of OEM technical support, with an understanding of the interdependencies of those dimensions. Experience working as part of a virtual team that is geographically dispersed. Proven ability to collaborate with regional partners.", "preferred_qualifications": "", "education_experience": "-  BA/BS degree in Business or related field\n-  Six Sigma process training and COPC certified preferred", "additional_requirements": "-  Proven experience and knowledge of vendor contracts and negotiation principles.\n-  Solid understanding of cost and financial accounting principles with the ability to interpret complex analysis, budgeting data and business information. Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541702"}