{"title": "Software Integrity QA Engineer", "summary": "Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Creativity Apps team is looking for a software Image Quality Integrity Engineer with photos, video editing background to contribute to the production of innovative tools for creative professionals, video makers and visual storytellers. It requires a highly proactive individual with strong creative, technical and analytic skills and passion for new technologies related to computer vision/on device machine learning.", "description": "In this role, you will be responsible for planning, designing, maintaining and executing test cases with minimal direction. Your ability to free test, without scripts and tools, will be paramount. Report bugs with outstanding isolation and regression techniques will be the key to your success. This role requires balancing a wide variety of deliverables that will rely on your talent for managing priorities and communicating progress and risks effectively and systematically. Your ongoing curiosity and dedication to self-education in photos and video technologies as well as new testing techniques is what will set you apart. You will be working closely with other team members to help coordinate multi-functional test efforts. You will be in continual dialogue with Engineering and Design as products evolve and you will need to have compassion for users so you can effectively advocate on their behalf. The ability to streamline processes for data collection and systematically parse large data sets will be a huge plus.", "key_qualifications": "", "preferred_qualifications": "Experience with digital photography, video, and in-depth knowledge of image editing software\nActive user of photo/video as communication in a classroom setting and/or social media\nHave some understanding of computational photography and machine learning\nUnderstanding of subjective/objective image quality evaluation, and color science concepts is a strong plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $114,800 and $205,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple Inc.’s discretionary employee stock programs. Employees are eligible for discretionary restricted stock unit award recommendations, and can purchase Apple Inc. stock at a discount if voluntarily participating in Apple Inc.’s Employee Stock Purchase Plan. Participation in Apple Inc.’s discretionary stock programs is governed by Apple Inc.’s stock plans and agreements and are not part of local employment contracts or compensation. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit and compensation programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560165"}