{"title": "iPhone & Core Technology Operations Reliability Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! Are you searing for an exciting new role where you’ll have the opportunity to bring new products to life with the level of reliability that delights our customers and defines what we do at Apple? This role may be for you!", "description": "iPhone and Core Technologies Operations Reliability Engineers are responsible for guiding development and operations teams toward generating reliable designs for Apple's new technology components, modules, and overall products. We achieve this objective by identifying high risk failure modes early in the design life cycle and by using our engineering knowledge to help find the best path towards mitigation before ramp. Some responsibilities include: Core Technologies OpsRel: - Work with NPI Reliability teams and lead / participate FMEA sessions to identify high risk failure modes early in the design and process life cycle - Deliver test plans, procedures to third-party vendors, and ensure execution to Apple/Industry standards  - Analyze test correlation between different assembly nodes, align test pass/fail criteria and metrology systems, cosmetics requirements, etc. - Summarize Reliability results and share findings with cross-functional partners and senior management Manage alignment and transition of reliability testing from NPI to MP - Develop capable suppliers that can be both technology and volume scaling partners iPhone System: - Collaborate with the Apple module and system reliability engineering teams to lead the operational readiness activities to allow smooth ramp from validated prototypes to full scale production. - Facilitate problem resolution by driving cross functional focus on identified reliability issues and partnering with Failure Analysis engineers to assure true root cause is identified and addressed through validated corrective actions. - Become the gatekeeper of reliability risk during product ramp and full production, making data driven recommendations on how to effectively address reliability excursions and newly identified failure modes. - Lead Ongoing Reliability Testing (ORT) in order to enable scaling of validated prototype designs into full production, accounting for the effects of material, process, design robustness, supply chain and final assembly on the product. - Partner with the sustaining and AppleCare teams to identify areas where the reliability experience can be further enhanced and drive improvements back to better factory detection and improved Ongoing Reliability Tests. Collaborate with the reliability and design teams to incorporate the lessons learned into future designs. Invent new ways of testing to improve efficiency and increase detection rates. Investigate ways to utilize big data and machine learning to enhance reliability testing and create new early warning systems.", "key_qualifications": " - A degree in an engineering discipline, such as Mechanical, Electrical, Materials - Deep understanding of reliability engineering concepts, such as Weibull analysis - Proficient with problem solving methodologies (5 why, fishbone, 8D) and experience with FMEAs - Certified as CRE, CQE or Six Sigma Green/Black Belt is a plus - Data analysis and reporting experience", "preferred_qualifications": "", "education_experience": "Bachelors / Masters in Mechanical or Electrical Engineering / Reliability Engineering", "additional_requirements": "- Experience in an engineering role which involved hands-on work. Consumer electronics and / or other cutting-edge technology engineering/ quality experience is helpful (ie basic display design / process technology and operation principles for TFT, LC, OLED, sensors, lasers, cameras, etc) - This position can require upto 30% domestic and international travel Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200519065"}