{"title": "Equipment Engineer", "summary": "We have a great opportunity for an Equipment Engineer to drive tool improvements and increase equipment availability. In this role you will work with a world class, staff to advance groundbreaking technology with the Hardware Technology Team.", "description": "An Equipment Engineer can apply their skill and experience to improve production up time as well as provide electrical, mechanical, vacuum, and software repairs across multiple tool systems. The ideal candidate should be able to do the following: • Perform equipment upgrades to increase tool reliability and throughput. • Use key tool failure metrics like MTBF and MTTR to analyze and improve periodic maintenance programs. • Develop and improve current periodic maintenance documentation. • Work with vendors, engineers, and technicians to identify critical spare parts and implement programs to keep inventories at optimal levels. • Work with EH&S staff to identify safety issues with Tooling and Labs and implement corrective action. • Provide key input during the tool selection process by providing an equipment maintenance perspective. • Apply previous experience to negotiate spare parts and field service contracts with Vendors.", "key_qualifications": " ", "preferred_qualifications": "BSEE or BSME with proven experience. Knowledge of key vacuum diagnostic systems such as Residual Gas Analyzers and Helium Leak Detectors. Clear understanding of facilities requirements for individual tooling such Power, Exhaust, Gas, PCW, CDA, and seismic tie downs. Be able to collaborate with tool owners on critically important tools to optimize vacuum, electrical, and software reliability. Report status of tool improvement projects and key tool metrics in detailed presentations to upper management. Experience with industrial standards and practices in appropriate technologies. Work experience with high-volume manufacturing strongly preferred. Worked with vendors to provide resources such as Field Service and Labor support.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555482"}