{"title": "SAP Business Security Liaison", "summary": "The SAP Business Governance team is seeking an SAP Security Professional with business process knowledge. The candidate selected for this role will be responsible for SAP Security infrastructure and user management across multiple SAP applications.", "description": "- Design and implement SAP Security and provisioning solutions by working closely with business users, functional teams, and technical teams\n- Develop security solutions through role design, source code analysis, business process analysis, and custom authorizations\n- Engage with key stakeholders across IS&T and business teams, using experience and judgement to lead and define both standard and custom approaches to SAP Security\nDesign, implement, and maintain SAP solutions with an emphasis on managing risk, applying industry standards, and best practices\n- Work with stakeholders to manage and mitigate Segregation of Duty conflicts\n- Work with business teams daily to analyze security concerns, troubleshoot, and resolve access issues\n- Coordinate and manage SAP Security aspects of assigned projects:\n- Communicate and translate technical/business SAP Security requirements to all stakeholders\n- Perform and present analysis on a global scale as needed by the project\n- Create and meet deliverables per project plan based on technical and business requirements\n- Define and communicate clear goals and expectations with all the stakeholders\n- Deliver timely solutions for project issues\n- Adapt to changing technology and apply it to evolving business needs\n- Support daily user access requests for SAP applications\n- Provide efficient and effective production support for internal and external partners", "key_qualifications": "BA/BS with a minimum of 5 years hands on experience\nPreference for candidates with 1-2 SAP S/4HANA implementations or migrations\nExperience in SAP Ariba, SAP BTP, SAP Build Work Zone, SAP HANA XSA, and/or other new SAP technologies is a plus\nStrong comprehension of SAP Security concepts\nAbility to troubleshoot SAP Security issues\nUnderstanding of business processes and the ability to discern complex business processes to apply best practice security methodologies\nAbility and flexibility to effectively collaborate across multiple lines of business and geographies\nExcellent communication and collaborative skills\nAbility to independently manage a diverse workload in a complex and fast-paced environment", "preferred_qualifications": "", "education_experience": "BS degree in Management of Information Systems (or equivalent experience)", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $120,500 and $181,100, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200508677"}