{"title": "Optical Integration Engineer", "summary": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Display Technologies group, you’ll help ensure our products’ displays work beautifully through the successful design, fabrication, and implementation of components in Apple devices. From initial concept to mass production, you’ll develop highly innovative displays for the full line of Apple products, including Apple Watch, iPhone, iPad, and Mac. Through touch and sight, these displays are how millions of Apple customers connect with our products every single day. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience to see and touch.", "description": "We are seeking a hardworking engineer to support the design and integration of Apple’s products by owning the investigation of sophisticated optical and electro-optical components inside camera, display and sensing modules. You will work with both suppliers and cross-functional teams at Apple to craft the technologies that go into our outstanding products. Responsibilities: • Identifying areas where optical components can improve display, camera, sensor performance and customer experience • Identifying and defining equipment for high-volume manufacturing and process (including deposition, patterning and etch) solutions for technically complex nano-fabricated optical components to enable new designs and functional requirements • Leading the multi-functional interaction with Product Design, Engineering/Operations, and drive international suppliers to deliver optics components/modules • Leading root cause analysis and trouble-shooting for failures and component performance improvement • Defining Engineering Requirement Specification (ERS) for the optical components IQC, OQC, and IPQC • Providing meticulous presentations and reports to a broad range of collaborators, including management, peers, and suppliers", "key_qualifications": "Empty", "preferred_qualifications": "Hands-on experience and proven track record in areas relating to optics, optical coating or advanced semiconductor process technology development; Experience with diffraction optics, metasurface optics or nanophotonics; Experience with simulation software for optical, FEA or Multiphysics , such as COMSOL", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553234"}