{"title": "Head of Digital Forensic Incident Response", "summary": "Apple is seeking an exceptional leader to lead our extraordinary Digital Forensic Incident Response team. You’ll be working with partners across Apple to protect systems and services. The successful candidate will drive the growth, development, and daily operations of the distributed team that provides digital forensic analysis of security events.", "description": "This is a hands-on role in a dynamic and fast paced environment. In this role you will lead the global team in a follow-the-sun support model responsible for providing digital forensic incident response analysis. You and your team will help develop capabilities to protect Apple today and tomorrow. An ideal candidate is an experienced, highly motivated leader who embraces the opportunity to influence and evangelize security across the company.\n\nIf this is you, apply today!", "key_qualifications": "Team oriented with a dedicated passion to invest in your team’s culture, skills, and wellness\nExperience building and leading globally distributed technical teams\nAbility to collaborate with partners across multiple business teams to create efficiency and innovation\nProven ability to lead technical and business risk discussions with business partners\n7+ years of demonstrated experience in Cybersecurity Incident Response\nExperience with industry standard Digital Forensic methodologies, including evidence handling, chain of custody procedures, and commonly used forensics toolsets\nFamiliarity with cyber adversary tactics and frameworks\nUnderstanding of root cause analysis principles, methodologies, and unbiased reporting\nExperience with automation in high scale diverse environments", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science, Engineering, equivalent degree, or relevant work experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541873"}