{"title": "R2R Tax Compliance Accountant", "summary": "Do your life’s best work here now. With the whole world watching. Apple’s Global Business Solutions (GBS) team partners with Apple’s business across Greater China, including Retail, Sales, Operations, R&D and Services. In addition to supporting transactional and financial reporting processes, GBS’ access to data across customers and functions provides a strategic platform to uncover trends and patterns to enhance financial controls and compliance, operational efficiency and business insights and performance. We look for individuals with not only solid technical skills but also the right balance of operational excellence, problem solving and strategic thinking to support the growth of Apple in Greater China. We are now seeking a high-caliber Tax Compliance Accountant to join our Shanghai-based team to play a pivotal role in building an extraordinary Global Business Solutions center focused on developing a compliance governance framework to support Apple’s businesses in Greater China.", "description": "This individual will be responsible for all tax, statutory and statistical filings for assigned areas and will partner with the business to maintain Apple’s compliance with external reporting requirements. The tax compliance accountant will also act as the first point of contact on external escalations relating to China tax enquiries. This role will report to the Tax Compliance Manager. Serves as key coordination point with company auditors and tax agents to drive the resolution of any queries or issues Identifies challenges presented by changes to the business operations and the impact on taxation Ensures deliverables meet key performance metrics and service level agreements (SLAs), aligned with stakeholder expectations Drives continuous innovation through process improvements and challenges the status quo to build best-in-class systems and processes", "key_qualifications": "The ideal candidate will possess the following qualifications / experiences: A minimum of 5 years of related commercial work experience; a combination of public accounting and industry experience preferred Deep understanding of China statutory and tax filing requirements Excellent communication skills with a good command of English and Chinese in both written and spoken forms Problem solver who can critically analyze complex information and extract insights to drive business decisions and solutions Ability to break down business decisions into a detailed action plan and follow-through to deliver results Strong communicator who can build cross-functional partnerships and drive collaboration to influence appropriate outcomes “Roll up your sleeves” attitude with a willingness to dive into the details to lead change with minimal supervision Self starter with innovation, integrity and attention to details", "preferred_qualifications": "", "education_experience": "Degree in Accounting or Taxation Excellent written, verbal, and presentation skills in both English and Chinese", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528841"}