{"title": "Touch/Force Hardware - Sensor System Architect", "summary": "Come join the Sensor Technology Team! We are a multi-disciplinary, problem-solving team developing state-of-the-art sensor modules and technologies that enable the world’s best user experience on Apple’s products, including iPhone, iPad, Apple Watch, AirPods, and more. As a Sensor System Architect, you will play an integral role in conceiving, modeling and prototyping new sensor solutions. You will have an opportunity to participate in all aspects of the development process from proof-of-concept to product launch. New technical challenges arise every day, so bring your engineering excellence, creativity and innovation to this dynamic, hands-on environment.", "description": "Conceive novel sensing architectures to meet system constraints on power, size and cost • Identify figures of merit critical to user experience and author requirements specifications • Assess and negotiate design tradeoffs Develop comprehensive models to guarantee performance in high volume production Build proof of concept hardware Analyze and reconcile build data with model predictions Perform failure analysis, identify root causes and propose corrective actions • Provide clear technical updates to the broader team and executives Manage external vendors and travel to support builds (approx. once/quarter) You will work with a cross-functional team on: Schematic capture and PCB/FPC layout Materials, methods and machines for a robust, high-yield assembly process • Calibration and test strategy Algorithms for sensor data conditioning and fusion FMEA and reliability testing", "key_qualifications": "Deep understanding of EE, ME, and Physics fundamentals Experience in modeling, building and testing complex, multi-physics systems Proficiency in MATLAB and COMSOL or equivalent packages Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams Excellent communication, teamwork, and leadership skills", "preferred_qualifications": "Experience with the following is a plus: Tolerance analysis and statistical process control Schematic capture, PCB/FPC layout, circuit simulation, EE/ME lab equipment • Software best practices, data structures and algorithms 3D CAD and rapid prototyping AI/ML techniques for sensor design or signal conditioning", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540814"}