{"title": "App Store Growth Planning Manager", "summary": "The people here at Apple don’t just create products — they build the kind of wonder that’s revolutionized entire industries. Join Apple and help us leave the world better than we found it! Apple’s App Store is the world’s largest and most innovative mobile application store, serving more than half a billion customers every week. Join us as a Growth Planning Manager.", "description": "The Growth Planning Manager spearheads the sustainable growth of the world’s best app ecosystem, partners’ business, and internal operational excellence. By creating and implementing locally relevant plans and frameworks, you will be crucial in driving short-term and long-term growth through proactive initiatives involving new business programs, campaigns, partner alliances, and other projects.", "key_qualifications": "Extensive experience in free-to-play mobile gaming and subscription product management and/ or business performance. Deep knowledge of in-app monetization economics and design mechanics for free-to-play games and subscriptions including innovation in the space, as well as the games industry more broadly. A self-starter with a hands-on demeanor, who is dedicated and demonstrates critical thinking abilities. Strong quantitative analytics skills, with expertise in Excel/Numbers. Proven ability to synthesize actionable insights from data and industry sources, and package those insights into persuasive, impactful proposals to influence new strategies. Excellent presentation, communication and interpersonal skills, with strong attention to detail. Outstanding relationship management skills and ability to foster strong internal and external relationships at all levels. Excellent project management skills, with ability to juggle multiple tasks, prioritize workloads, and adhere to tight deadlines. Proven ability to work both independently and in a team environment. Analytical problem-solving skills to track record of business-related progress and key performance indicators to develop and optimize actions that drive partner engagement and customer value. Proficiency in using data to craft compelling narratives for communication with internal collaborators and external partners. Enthusiasm and deep curiosity about the games and app ecosystem with fluency in standard business models and a thorough understanding of the local landscape.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546917"}