{"title": "Software Data Engineer - App Store", "summary": "Apple’s App Store is the world’s largest and most innovative app marketplace, home to over 1.5 million apps and serving more than half a billion customers every week across all the Apple devices. Seeking a hands-on senior data engineer to join the App Store Analytics engineering team focused on Advertising solutions to help drive app discoverability.", "description": "In this role, you will be part of a team that will collaboratively ideate to solve novel problems in the area of ads measurement. You will independently bring data-driven technical solutions to the team. You will communicate the solution in a way that synthesizes user, product, and privacy impacts clearly. You will cut through ambiguity, understand end-to-end requirements, and implement engineering solutions that are privacy-enhancing, scalable, and reliable. You will implement the designs to a scalable, high quality, and observable set of pipelines and services. You will lean into and pick up new technologies as driven by needs of the project. You will partner with program teams to plan and execute sprint goals. The ideal candidate will share industry knowledge and contribute to building the team’s knowledge and expertise. We are a collaborative encouraging team that embrace challenges and values humility, integrity, and dedication to each others’ growth.", "key_qualifications": "3+ years of programming experience in Scala (preferred) or Java. Hands-on experience building distributed data processing applications using Spark or Flink, Kafka, Iceberg, Kubernetes & Cassandra or similar technologies. Deep understanding of SQL, data analysis and visualization to drive insights for product and engineering decisions. Proven record in implementing and launching complex, resilient, reliable, and scalable technical solutions. Understand the Data Lifecycle and concepts such as lineage, governance, privacy, retention, and anonymity. Ability to communicate data-driven designs clearly to diverse audiences including leadership updates. Demonstrated passion for understanding business context, focus, and product quality. Demonstrated ability to be a fast learner and collaborative problem solver. Experience in ads or related domain preferred.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science, Math, Statistics, or a similar field. Master's preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549000"}