{"title": "Technical Program Manager, Audio|Home", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don't just build products — they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, you will help us leave the world better than we found it!", "description": "-Engagement in new product engineering builds, assist in reviewing production process and fixtures from manufacturing perspectives, capable of fixing hot issues is a plus. -Executes and implements the strategic direction, goals, objectives and key measurement systems to ensure the business goals are met. Primary metrics include - process and yield goals, monitor and audit product quality across all yield and audit points, ensure adequate controls and product integrity are set in place. -Develops, implements, and maintains policies, procedures and control systems for each functional area. -Acts as a bridge for technical issues when required between Apple engineering team and the vendors. -Provides input into global process, test, quality, BOM Management as systems are enhanced or upgraded.", "key_qualifications": " ", "preferred_qualifications": "With understanding and strong passion on other precise assembly processes, such as electrically conductive adhesive or glue applications are welcomed. Familiar with mobile devices' knowledge is preferable. Action-oriented and handle complex situations - Excellent problem solver, using structured problem-solving methodology to assign root cause, plus develop and implement corrective and preventative actions. Self-starter with innovation, integrity, and attention to detail. Approach problems with flexibility. Excellent interpersonal and communication skills with the capability to work independently and under pressure. Experience in massive data analysis, coding and machine learning would be a plus. Excellent spoken and written English with proficient Mandarin", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558948"}