{"title": "Wireless Software Manager", "summary": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join \"Wireless Technology and Eco-system (WTE)” organization, be part of a world-class team of engineers; working with cross functional teams to drive innovation and develop products used by millions worldwide. Apple’s Wireless Software Architecture team is seeking talented, highly motivated and self-directed engineers to work across layers on cutting edge wireless technologies. The position involves developing core wireless technologies that solves everyday problems for customers using iPhone, iPad, Watch and other wireless product lines.", "description": "Apple’s Wireless Software team is seeking dedicated, highly motivated and self-driven manager to work on groundbreaking wireless technologies! This position involves managing a core wireless technologies team that solves everyday problems for customers using Apple wireless products around IEEE 802.15.4 and Thread Mesh technology development in the space of Home Automation. This team takes pride in not just coming up with proven software designs but also in disrupting traditional models of the wireless ecosystem. We do whatever it takes to bring user experience to the next level. Our teams enjoy the flexibility to work on all aspects of wireless Protocol software - Radio, Protocol, Frameworks and APIs, to come up with the best possible solution for any given problem.", "key_qualifications": "A successful track-record or demonstrated aptitude as a software engineering manager. Minimum 5~10 years hands on experience in wireless development/system engineering. Strong skills as a key contributor to highly productive teams. Passion for diving into hard problems and guiding others to build novel solutions. Directly collaborate and offer informative direction, feedback on technical architecture design while defining the long term technical strategy. Actively coached and inspired your team with timely and actionable feedback. Passion to recruit, hire and build high-performance engineering teams. Strong Software Engineering skills including design, programming (C or C++). Working experience with Open source Software is a plus. Experience in developing frameworks and APIs is a plus. Good knowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus. Proven track record of project deliverables from concept to commercialization. Excellent communication and documentation skills", "preferred_qualifications": "", "education_experience": "Bachelor or Master’s degree in Computer Engineering, or equivalent majors.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $272,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505391"}