{"title": "Senior Real Estate Manager", "summary": "We’re a diverse collective of thinkers and doers, continuously reimagining our products and practices to help people do what they love in new ways. That innovation is inspired by a shared commitment to great work and to each other. Learning from our people here means we're learning from the best! The RDM team create and care for Apple Stores that look, feel, and function as beautifully as our products. We do this by obsessing over the employee and customer experience, and driving a Global Real Estate strategy that sets the bar. Apple is looking for a Senior Real Estate Manager who is experienced in all areas of retail leasing, portfolio and property management. This role is essential in delivering the Five-Year Plan as well as deliverables needed to maintain and manage the existing portfolio of stores in the fleet. At Apple, inclusion is a shared responsibility, and we work together to foster a culture where everyone belongs and is inspired to do their best work.", "description": "Responsibilities include strategic site selection, portfolio management including negotiating multi-million dollar retail leases, renewals, property valuations, P&L optimizations, property assessments, Landlord lease obligation issue resolution, and supporting retail store team needs with mall/property management. Skilled in planning, tracking, evaluating and reporting on work and deliverables. *Skilled in the leadership and management to develop, negotiate and implement complex real estate transactions, negotiate new and existing lease agreements, as well as secure internal approvals by working cross-functionally to solve and bring closure to complex issues within capital plan. *Proven experience to source opportunities, analyze locations and market information, build business models with financial sensitivities, provide feasibility options and business justifications, and can recommend the best options for optimal market performance and brand impact. *Drive project life cycle through lease execution and landlord delivery. Responsible to align and collaborate cross functionally with a diverse group of partners and present projects to leadership. *Work with and represent Apple for external city/ heritage/ authority/ official partners to ensure compliance and approval by all governing bodies, works councils and relevant parties. *Proactively manage real estate portfolio by tracking and reporting on upcoming lease events, critical project milestone dates and other initiatives that require real estate involvement to deliver. *Resolve landlord lease issues with cross-functional partners and ensures compliance by Landlord. *Completes Store Audits to evaluate location environment and ensures lease compliance. *Foster and maintain excellent relationships with landlords, developers, and other retailers. *Responsible for in depth market trips for senior leadership, as required. *Manage external broker network as required. *Contributes to an inclusive environment through respecting each others’ differences and having the curiosity to learn", "key_qualifications": " ", "preferred_qualifications": "15+ years of experience in retail real estate or development work, Comfort negotiating with C-Suite representatives of Landlords and other partners, Energetic and flexible; motivated and able to work in fast and dynamic organization, Can work independently and as part of a team", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559478"}