{"title": "Technical Translation Manager", "summary": "LRE’s Language Team is looking for a hands-on leader with proven experience managing translation deliverables and leading cross-functional initiatives. Exceptional communication and the ability to influence are a must for this role as it requires collaboration across many different in-house and vendor translation teams as well as cross-functional quality and engineering teams. Strong communication and collaboration skills, attention to detail, and proven ability to manage priorities are essential. Candidates should have excellent problem solving abilities and the right mix of technical, creative, organizational and communication skills to provide strong leadership to their team! In this role you will build a team of experienced technical translators to support Apple Software and Documentation localization. The environment is fast paced, requiring the ability to manage workload with aggressive delivery schedules while at the same time training and nurturing your team to the expected competency of an in-house translator. In addition to project work, other responsibilities include contributing to improving the tools to make software localization workflows more efficient; helping to investigate the root causes of international issues that are found in localized software; evangelizing best practices for localization content; defining and driving improvements in our localized content. This position is highly suited to current technical translators with project management experience.", "description": "-  Proven experience coordinating translation deliverables\n-  Ability to project manage high quality work on aggressive schedules\n-  Exceptional cross-functional communication and influence skills\n-  Strong written and verbal communication skills\n-  Passion for process and tools innovation\n-  Highly motivated, self-starting individual that takes the initiative\n-  Prior localization team management or project management experience\n-  Experience with localization and internationalization\n-  Experience in managing language specific style guides and glossaries\n-  Experience in translation of UI for high-end software products\n-  Excellent overall writing skills\n-  Excellent teamwork and interpersonal communication skills\n-  Knowledgeable in, and sensitive to, multilingual and multicultural issues", "key_qualifications": "5+ years experience in Localization. Solid understanding of internationalization, localization and translation management systems\nLeadership and management to build a team of talented technical translators in a fast-paced and demanding environment\nOwning the overall translation quality of the team languages and acting as a champion for localizability.\nWorking with vendor management to ensure a seamless language quality experience for our users\nDefining goals, setting priorities, and challenging experienced project managers and translators to do their best work\nCross-functional coordination to ensure that future tools and processes meet the needs of the language team\nDefining and driving localization process and tools improvements that will improve quality, improve turnaround times, and reduce costs\nCommunicating risks and priorities in order to deliver quality localized deliverables on time\nWorking with internal and vendor translators to identify resource needs for support of future projects", "preferred_qualifications": "", "education_experience": "Degree in Applied Linguistics, Translation and/or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529117"}