{"title": "AirPods Analog Engineer - General Analog", "summary": "The AirPods Division is seeking a hardworking System Electrical Engineer. You will be working in a creative and upbeat engineering team developing AirPods products with responsibilities for the design, implementation and integration of variety of function blocks and subsystems including power, audio, battery management, and sensors. This is an excellent opportunity to be at the focal point of many multi-functional interactions with Apple internal HW/SW teams, Contract Manufacturer teams, and IC vendor teams throughout different development stages. We expect you to be familiar with the design of portable low-power products, preferably with experience in a consumer electronics environment looking after high-volume and high-quality products. Are you ready for a challenge?", "description": "System level design including participation in datasheet drafting and reviews for variety of ICs Follow through IC design cycle, including design review, bring up, bench characterization, and bug tracking Work with multi-functional team for function block system integration, including schematic and layout reviews, production test support, manufacturing support, system validation, solving and perform hardware prototyping and demonstration.", "key_qualifications": "-  Strong analog/mixed-signal fundamentals (noise, linearity, signal-integrity in mixed-signal systems).\n-  Deep understanding of mixed-signal building blocks (op-amps, filters, ADCs, DACs, output drivers, audio, sensors, PMIC)\n-  Familiarity with low-power electronics/sensors/sensor-interface circuits.\n-  Experience in prototyping, characterization and debugging of mixed-signal hardware.\n-  Excellent interpersonal skills with both verbal and written communications", "preferred_qualifications": "", "education_experience": "BS/MS EE Required", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200507039"}