{"title": "Software Developer in Test, Creativity Apps", "summary": "Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. The Creativity Applications team is looking for a full-stack Software Developer in Test that has experience in testing iOS/macOS apps, cloud based frameworks and APIs. Ideally we are looking for someone with a passion and/or background in video editing to contribute to the production of innovative tools for creative professionals, video makers and visual storytellers.", "description": "In this role, you will be responsible for planning, designing, writing, maintaining and executing test cases manually and through automation using Swift, Python. You will drive all aspects of quality and process improvements to help the team ensure that our features are rock-solid and ready to be released to our customers. Report bugs with outstanding isolation and regression techniques will be the key to your success. This role requires balancing a wide variety of deliverables that will rely on your talent for managing priorities and communicating progress and risks effectively and systematically. Your ongoing curiosity and dedication to self-education in video/photo technologies as well as new testing techniques is what will set you apart. You will be working closely with other team members to help coordinate multi-functional test efforts.", "key_qualifications": "5+ years experience in QA/QE\nMinimum of 1+ years experience as a Software Engineer in Test, programming in Python and/or Swift to prototype features, and create and test with internal tools\nProficiency in Testing mobile/desktop apps, cloud based frameworks, and backend/APIs\nStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processes", "preferred_qualifications": "", "education_experience": "Bachelor's Degree in Computer Science or an equivalent of 5 plus years relevant experience required.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549193"}