{"title": "Electrical Instrumentation Program Lead", "summary": "Apple is where you go to do your life’s best work. Behind every Apple product is a deep bench of very hardworking multi-functional teams, where the attention to detail defines success versus failure. This organization focuses on custom electronics solutions for various areas of Apple, including our critical areas of factory, lab and regression environments. The team takes on a multitude of technologies, with some cornerstone execution in the high speed IO, display, camera and factory interconnect realms. We are looking for an expert, highly technical embedded electronics professional to join the team driving definition and development of EE instrumentation solutions. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), a strong product/customer focus, experience guiding sophisticated programs through the development process, and the ability to distill tradeoffs down to key factors and drive critical product decisions we’d love to hear from you.", "description": "As an embedded custom electronics program lead, you will work closely with mechanical, electrical, algorithm, and software teams across all lines of business and across the company to define and develop highly optimized hardware products. You will be responsible for: Driving the development of system requirements based on experience targets and technology constraints. Identifying the most critical questions and coordinating teams to find efficient ways to get answers. Understanding the link between technical decisions for the system and customer experience and presenting impacts clearly and concisely. This is a very hands-on program management oriented role, where orchestration of crucial team members spanning the global will be essential. The ideal candidate would be encouraged to use their EE development oriented past to help provide transparency and expectations to a highly technical oriented vertically coordinated custom electronics organization.", "key_qualifications": " ", "preferred_qualifications": "Understanding of various electronics system architectures, Extensive intimate experience with the hardware development flow (concept, schematic, layout, bringup, validation and deployment), Deep understanding and experience with how to build and validate through key vendors and manufacturers, Proven ability to work through system-level development tradeoffs, Developed skills for planning and driving development in sophisticated consumer electronics products - both prototype build events and overall product planning, Strong technical background in Electrical, Mechanical, or Software Engineering, Experience with a wide array of technologies, especially in the areas of power delivery, camera systems, display and optics technologies., Flex cable design and manufacturing experience., Experience as primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and mentorship to meet the program and build objectives, Experience driving a highly diverse set of multi-functional team members and perspectives and yielding the best possible product solution", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559033"}