{"title": "Strategic Design Engineering Program Manager (Electrical)", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! The Strategic Design Engineering (SDE) will partner with cross-functional product teams across Apple to develop and introduce new products that are both innovative and cost advantaged. Our objective is to support premium & high quality products, but to also drive Design to Cost and Design to Value to support cost sensitive products (CSP).", "description": "The team collaborates with Hardware Engineering, Product Design, Marketing, EPM, NPI/NPO, GSM, and OPD to develop CSP structural cost targets in support of business pricing and margin targets. Key engagements will be with both the system and module teams. Develop and implement cost strategies and roadmap from the early architecture and proof of concept stages through the engineering builds to product ramp. Drive detailed trade-off analyses. Push to understand why something costs what it costs, challenge the status quo, develop innovative solutions and ideas that will improve the cost. Dive into the details of the design and the supply chain in order to offer alternatives. Drive sourcing and development model decision with cross-functional partners in BizOps and GSM. Own off-AVL discussions and initial supplier bring-up. Drive product cost optimization and industry/supply chain intelligence through competitive product tear down activities and bottoms up cost estimation.", "key_qualifications": "Experience in EE commodities and technologies including should costing and sourcing. Preferably including Display, Flex, PCB, Battery, Power and other EE components. Ability to own should costing and investigation of alternate components that meet design requirements. Ability to challenge the EE design team on requirements, specifications and suggest alternate designs. Self starter with proven program management skills, attention to detail, ability to influence cross-functional teams. Fundamental understanding of Design for Cost/Value", "preferred_qualifications": "", "education_experience": "BS degree in engineering (EE, ME/IE, CS) with 10+ yrs of experience or Master's degree with 8+ yrs of experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $140,700 and $280,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542981"}