{"title": "AIML - Research Engineer - AI Interpretability & Safety", "summary": "Apple’s AIML team is looking for a talented Research Engineer to advance the state of the art in evaluation and development of modern machine learning models with a focus on real-world use of artificial intelligence. The candidate will use their expertise to develop interactive systems and strategies that make our AI systems more safe, transparent, and understandable. Join us in Pittsburgh, PA, Seattle, WA, or Boston, MA to design and build interactive systems that help Apple ship more robust and safe AI experiences. We encourage applications from both junior and senior-level candidates.", "description": "As a member of this team, you will use your background in ML and HCI to: - Define and implement research directions at the forefront of interpretable machine learning. - Design and implement new tools and visualizations to make designing, building, and deploying machine-learning based products faster and easier. - Investigate innovative machine learning, and artificial intelligence algorithms. - Contribute to a variety of projects around Apple, and transfer your ideas into solutions for some of the most ambitious technical problems in the next generation of Apple products.", "key_qualifications": "Proficiency with modern AI technologies and building interactive data visualizations. Experience shipping products that use machine learning or tools for machine learning interpretability. Substantial contributions to research or practitioner communities, such as by publishing papers at top-conferences or contributing to open source projects. Proven history of turning ideas into tools, guidelines, or products. Excellent verbal and written communication and presentation skills.", "preferred_qualifications": "", "education_experience": "PhD or MS or equivalent experience in Computer Science, Machine Learning, or related fields", "additional_requirements": "Strong web-development background.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536741"}