{"title": "Embedded Software Engineer", "summary": "Apple's System Firmware and Diagnostics team is looking for an enthusiastic embedded software engineer to join our team. This is an individual contributor role to design and develop the software that gets used by various teams. You’ll have the opportunity to work on core technologies to make a major impact in the way that Apple develops, test and manufactures its products. Our environment encourages product innovation, rapid product iteration, collaboration and a liberating amount of autonomy.", "description": "In this role you will implement software and drivers for common firmware interfaces, chipsets, communications protocols and various SoC IPs. You will also implement features to support hardware testing and diagnosis of Apple's handheld devices. This is a highly cross functional role and you'll work closely with various teams, like EE, Systems Engineering, Software Engineering, Hardware Testing, QA, Factory, Manufacturing and Operations. The environment is dynamic, fast-paced and requires a go-getter attitude. The international travel requirement is 10-20% (flexible and product dependent).", "key_qualifications": "3+ years of relevant experience, Proficiency in C/C++, some embedded software experience is preferred. Understanding and experience with ARM platform and architecture/instruction set. Experience developing low level drivers Experience with debuggers such as gdb, lid, etc. Familiarity with scopes and logic analyzers. Able to comprehend hardware specs and schematics. Familiarity with standard hardware protocols (USB, UART, SPI, I2C, PCIe, MIPI, HDMI, DDR) Knowledge of real-time audio is preferred (sample rates, buffering, I2S, PCM, drivers) Familiarity with some form of scripting (lua, python). Should be a great team player. Excellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "BS or MS in Computer Engineering, Computer Science, Electrical Engineering or equivalent. 3+ years of industry experience in a similar role.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552060"}