{"title": "SoC Security Architect, Platform Architecture", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it.", "description": "As part of the Platform Architecture organization, the Security Architecture team has a mission to provide rock-solid security foundation to Apple’s products. We evaluate security threats, define security features, architect security solutions. We collaborate with the software teams to ensure seamless security systems. We work together with different silicon teams throughout the entire design flow to guarantee state-of-the-art security goes into various in-house and out-sourced silicon chips.\n\nThis position will be a key role to help us fulfill our mission with the following core responsibilities:\n- Analysis of Hardware and Software attack vectors\n- Definition of Hardware and Software security related features\n- Architecture of security solutions in HW and SW\n- Development of evaluation plans for both HW and SW\n- Communication with multi-functional teams", "key_qualifications": "Solid background of applied cryptography\nWorking experience in definition of secure systems\nExperience in threat modeling and weaknesses analysis\nKnowledge of SoC architecture, microprocessor architecture a plus\nExposure to OS security\nExcellent interpersonal skills\nAbility to independently pursue new ideas and innovations\nGood knowledge of Verilog/VHDL\nExperience in C/C++ and interpretive language such as Perl/Python", "preferred_qualifications": "", "education_experience": "BS and a minimum of 20 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528408"}