{"title": "Home Networking Engineer", "summary": "Apple is looking for a talented and energetic software engineer for the Core Networking team to participate in the architecture and development of the next generation of networking technology.", "description": "The candidate will work in a fast paced environment, operate gracefully under stress, handle multiple assignments in parallel, and be self driven to be effective in an environment with little overhead.", "key_qualifications": "Experience developing commercial networking software and/or hardware products\nStrong software design and development skills including C, C++ or Objective-C programming language experience\nDetailed knowledge of the TCP/IP suite of protocols (including IPv6)\nBSD/Linux Kernel network stack\nNetwork troubleshooting skills\nExcellent communication and interpersonal skills\nWiFi router concepts, OpenWRT experience a plus\nUnderstanding of IP routing concepts and protocols", "preferred_qualifications": "", "education_experience": "MS or equivalent experience in Computer Science", "additional_requirements": "Mac OS and iOS development experience\nAPI development experience\nWireless networking technologies and standards (Wi-Fi and cellular)\nNetwork debugging tools (e.g. packet sniffers, protocol analyzers)\nThread Mesh Network technology", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200526722"}