{"title": "AIML - Software Development Engineer, MLPT", "summary": "Do you want to shape the platform that enables the next generation of intelligent experiences on Apple products and services? Do you want to shape the next generation of ML developer experience? In Apple’s Machine Learning Platform Technology & Infra team we have built the platform that Apple uses for developing LLM, vision and other machine learning applications. As a software engineer on our team, you will be responsible for designing & building services and functionalities for the model training software systems that are part of this platform! Our platform is built using a variety of systems and services, from databases, to web services, to search engines, data- lakes and graph engines hosted on the cloud. We use existing systems when possible, but do not shy away from rolling components ourselves. As a team, we have a variety of technical backgrounds, from machine learning engineers to builders of large-scale production systems. We exemplify a team of inclusive, hard-working, pragmatic, proficient, product-focused engineers. Come join us!", "description": "As a software engineer on the Training Platform team, you have the following responsibilities:\n\n-  Contribute to the architecture, design, development, and operations of large-scale systems designed for machine learning. These may include, but not limited to: data management systems, data engineering workflow systems, distributed compute systems, and their web portal & web service components.\n\n-  Partner with data scientists and machine learning engineers across different Apple organizations to define high impact product features and deliver them with quality.\n\n-  You will help build the platform upon which other teams will develop data pipelines and machine learning applications.\n\n-  Collaborate with a group of engineers to deliver high quality products/services.\n\n-  Be able to learn and stay on top of current technologies and apply them in the job.\n\n-  Contribute to the services (ML Training & Eval Metrics, Lineage, Query & Search) that power the ML lifecycle at Apple.", "key_qualifications": "", "preferred_qualifications": "A passion for data engineering, search and information retrieval\nExperience with BigData ecosystem Spark, Flink or equivalent is desired\nExperience with Solr, Lucene or OpenSearch is desired\nExperience with delivering analytics backend services is a huge plus, where exposure to query engines like Trino or equivalent is desired", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553867"}