{"title": "International Go-to-Market Planning Lead, Apple TV+", "summary": "The people who work at Apple have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. And more recently have launched truly innovative services with Apple News+, Apple Arcade and Apple TV+. We are deeply passionate about apps, music, movies, TV shows, and books. It’s a force that drives and inspires every one of us every single day. The passion for innovation that goes into our products applies to our practices as well, strengthening our dedication to leave the world better than we found it. Come and join the Global Video team, responsible for the Apple TV app, including Apple TV+, transactional movies and TV, native channels and federated video apps. We are paving the way for the future of entertainment and have set new standards in streaming with Apple TV+. Our team is responsible for Apple’s video business, driving overall revenue as well as subscriber growth for Apple TV+, curating and managing the app experience, programming and editorialising while striving to acquire engage and retain subscribers for Apple TV+ and our partners.", "description": "We are looking for a senior entertainment marketer to join the team. This role will drive holistic service marketing strategies and go-to-market planning for Apple TV+ in International. Key responsibilities include:\n-  Devising the strategy and plans to maximise Apple TV+ performance in international markets, aligning marketing, partnerships and in some cases content releases\n-  Develop localised versions of the global service value proposition using both data as well as your creative nous in order to ensure a strategic approach in how Apple TV+ is being marketed and communicated \n-  Guide local teams to tailor winning service-level marketing strategies and tactics, ensuring Apple TV+ resonates with international audiences \n-  Summarise and input into creative needs required for maximum impact in key markets\n-  Brief performance marketing team on service approach and priorities aligning on focus markets and common objectives, understanding and iterating on what works best \n-  Drive alignment of all key internal collaborators to deliver successful local strategies\n-   Lead all aspects of service-level campaigns in top geos when required\n-   Orchestrate production of high profile trade events and materials to best communicate the Apple TV+ value proposition to international partners \n-  Management of budgets for projects and campaigns", "key_qualifications": "N/A", "preferred_qualifications": "Fluency in another language a plus\nYou have a curiosity for and knowledge of countries and cultures other than your own\nYou are deeply passionate about TV and movies and a voracious consumer of content across streamers and other means\nInternational travel will be required as part of the role (Approximately 15%)\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557733"}