{"title": "AIML - ML Engineer, Machine Learning Platform & Infra", "summary": "Do you feel you think differently, you are eager to break status quo, are bold and ambitious, aren’t afraid to take risks and are passionate to build the best of class technology. If yes, what better place to be at and do this than Apple? At Apple, “we think different, we push the boundaries of computing and intelligence. We build products that bring smile to people’s face”.", "description": "Work along side Foundation Model Research team to optimize inference for cutting edge model architectures. Work closely with product teams to build Production grade solutions to launch models serving millions of customers in real time. Build tools to understand bottlenecks in Inference for different hardwares and use cases. Mentor and guide engineers in the organization.", "key_qualifications": " ", "preferred_qualifications": "Proficient in building and maintaining systems written in modern languages (eg: Golang, python), Familiar with fundamental Deep Learning architectures such as Transformers, Encoder/Decoder models, Familiarity with Nvidia TensorRT-LLM, vLLLM, DeepSpeed, Nvidia Triton Server etc., Experience writing custom CUDA kernels using CUDA or OpenAI Triton.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556947"}