{"title": "Sr. Manager, Engineering Program Management - Apple Services Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The Apple Services Engineering team exemplifies Apple’s long-held passion for combining art and technology.", "description": "We seek strong fundamentals, but require more. You foster strong relationships, build trust, and influence without direct authority. You communicate openly and clearly, collaborate enthusiastically, and value a culture of healthy debate. You thrive in uncertainty and strive to bring clarity and focus in a fast paced environment. You have a curious mind, always seeking to learn how things work.", "key_qualifications": "10+ years of technical program/project management for software or software/hardware products, 5+ years managing a team of technical program/project managers responsible for taking features through the complete software development life cycle, Has personally orchestrated the delivery of multiple significant client/server software products, under demanding timelines, managing multiple work streams cross functionally across a large organization, Excels in relationship building and has proven success in influencing without direct authority, Develops effective teams, comprised of early career and experienced employees, Cuts through ambiguity by establishing priorities, developing plans, and anticipating risks, Is self-motivated and enthusiastic, enjoys solving problems with teammates, and has demonstrated creative and critical thinking capabilities, Has best-in-class communication and presentation skills (written & verbal) to all levels of an organization, Demonstrates attention to detail and enjoys both hands-on work and high-level strategic thinking", "preferred_qualifications": "In depth understanding of Apple’s processes for building OS software and/or hardware.", "education_experience": "Bachelors Degree in Computer Science / Engineering or deep relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $200,400 and $358,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200532663"}