{"title": "Production Support Engineer, Retail Engineering, Early Career", "summary": "There is an excellent opportunity for a dedicated support engineer to join a distributed team supporting the Apple Online Store, a multi-channel world-class eCommerce platform.\n\nThe role, technical in nature, requires the individual to gain deep technical knowledge and understanding of the eCommerce platform to provide technical support to our business and core engineering teams.\n\nStrong people skills with excellent written and verbal communication skills, with the ability to tackle sophisticated technical topics and distill them in easy to understand layperson terminology, will round out the core responsibilities of the role.", "description": "As a member of the support engineering team, you will take an active role in the definition and evolution of standard practices and procedures.\n\n-  Work non-standard hours to support your teams with ongoing incident mitigation, which may occur at any time/day of the week.\n\n-  Share on-call rotation with other team members to support apps and services in scope.\n\n-  Take knowledge transition from engineering teams for changes being rolled out in production. Assess the need for production monitoring and alert setup.\n\n-  Triage and prioritize incidents based on the impact, devise and implement mitigation steps to unblock the business.\n\n-  Conduct RCA, log defects and partner with engineering teams for prioritization.\n\n-  Automation, maintain support documentation and debug sophisticated production issues.", "key_qualifications": "", "preferred_qualifications": "Excellent follow through, organizational ability, and flexibility in a dynamic, demanding environment.\n\nWorking experience on cloud infra, like AWS, is a plus.\n\nExperience with Splunk, monitoring tools, APM & observability.\n\nSupport experience with eCommerce platform.\n\nExposure to Incident and Problem Management processes.\n\nStrong collaboration and interpersonal skills.\n\nStrong communication skills and ability to coordinate with multiple teams.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558376"}