{"title": "Advanced Manufacturing Engineer", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology", "description": "Responsible for designing precision assembly and measurement processes for Apple products. Perform the research and development on new technologies necessary to tackle complex assembly and automation problems that have direct impact to the quality and delivery of Apple products. Design, implement and successfully scale automated and semi-automated solutions based upon sound engineering principles and the technologies developed for a specific application.\n• Develop new and or improved processes through the application of theoretical and practical engineering\n• Keeps abreast of all meaningful technical trends and developments and incorporates them in appropriate assignments\n\n• Provide direction and mentorship to third party machine/automation suppliers and/ or CM’s; be the technical leader and driver on owned projects; serve as a technical resource to other engineering groups and project leaders\n• Organize cross-functional reviews of the machine requirements, design, qualification and capability\n• Ability to travel internationally up to 40%\n• Create Request for Quotation/Proposal (RFQ/RFPs) that documents the design\nrequirements of the automated equipment, delivery schedule, required documentation and qualification for acceptance at machine supplier facility and contract manufacturer’s factory\n• Engage machine suppliers for automated equipment design reviews and proposals\n• Travel to the machine supplier and contract manufacturer for equipment bring-up,\nqualification, acceptance testing and support during build events\n• Drive machine qualification including correlation, process capability (CP/CPK) and Gage Repeatability / Reproducibility (GR&R)\n• Drive failure analysis and machine issue resolution when working with machine suppliers and contract manufacturers\n• Run equipment experiments to bound the capability of the machine\n• Responsible for data analysis reports to communicate machine capability to the multi-functional teams\nPerforms assignments in several of the following manufacturing engineering functions:\n• Design for Manufacturability - Provide early and on going manufacturing involvement to ensure new products are mechanically manufacturable.\n• Product Engineering - Works all phases of a product from concept to repeat manufacturing to end of life. Provides production support engineering with respect to technically complex testing methods, procedures and failure analysis.\n• Process Engineering - Designs and develops technically complex processes to improve quality and efficiency. Utilize statistical tools (such as GR&R, SPC, and Cp/pCk) to ensure processes/Fixtures are scalable and are continuing to perform properly once qualified.\n• Failure/Data Analysis - Plans, develops, and implements technically complex procedures for the testing and evaluation of soon-to-be-released products. Specifies test to be performed, compiles data and makes recommendations for product design changes and Final assembly standards. This will include the use of Design of Experiments (DOE) and statistical analysis using Six Sigma principles.", "key_qualifications": "Strong work experience in precision assembly, inspection, and automation equipment\nRequired to understand and build tolerance analysis for parts and assemblies\nKnowledgeable in crafting machine qualification requirements, design of experiments, and failure analysis\nUnderstands machine qualification including calibration, correlation, capability, repeatability and reproducibility\nAble to communicate effectively in a worldwide environment\nNew product introduction and Manufacturing Operations experience desired\nProven track record of cost reduction, project management, and engineering design required\nWorking knowledge of GD&T principles favorable\nNX, SolidWorks CAD, or ProE experiences a plus\nKnowledge of optics principles as they relate to CCD cameras, 2D and 1D lasers, and their use for positioning and critical alignment machines\nBasic understanding of liquid adhesives, PSA’s and VHB’s a plus\nWorking knowledge of robotics (6-axis and/or SCARA), pneumatics, servo motors, motion controllers, PLC and PC-based control systems\nJMP, Minitab & Six Sigma experience preferred", "preferred_qualifications": "", "education_experience": "BSME or equivalent (MSME desired), with 5 plus years in an engineering role with experience in automation equipment used for alignment, assembly and/or measurement of components.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200518970"}