{"title": "Business Systems Analyst, Employee Experience & Productivity", "summary": "The Apple TV+ IS&T Team is responsible for partnering with Apple TV+ line of business to ensure IT systems effectively support current and future needs. The Business Systems Analyst role maintains a strong awareness of the processes and systems utilized by TV+ Finance, with an emphasis on SAP ECC, SAP HANA, Workday Adaptive, Tableau and various Reporting systems and tools. This role is responsible for collaborating with Finance and business stakeholders and partners to understand needs, evaluate options, and facilitate the selection, planning, and delivery of solutions. A blend of business and technical acumen coupled with project management discipline is critical to success in this role.", "description": "Facilitate process and technology discussions across functionally and regionally disparate groups. Coordinate the delivery of new systems and extensions of existing systems capabilities. Evaluate options against a variety of factors and recommend long and short term strategies. Lead and/or participate in the development of functional requirements and technical specifications. Develop and maintain a working knowledge of trends and best practices within Apple. Collaborate with business partners to identify technology needs and ensure documentation is submitted.", "key_qualifications": "", "preferred_qualifications": "Understanding of global corporate business processes and their relationship to technology. Hands-on experience defining and documenting process flows. Hands-on experience managing small, medium, and large scale technology projects. Excellent problem solving abilities. Effectively coordinates work and communication across disparate groups of individuals. Thrives in a dynamic, fast-paced environment. Establishes milestones and meets commitments on deadlines. Communicates effectively with personnel at all levels from staff to executives. Able to quickly adapt to new technical and functional concepts. Proven working experience in project management. Excellent client-facing and internal communication skills. Media and Entertainment experience preferred. Degree in Accounting or Finance a plus. Experience in Workday Adaptive a plus. 5-7 years relevant experience PMP or other project management certification a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $96,200 and $145,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558090"}