{"title": "Cross Functional Test Lead, Retail Engineering", "summary": "Imagine what you could do here! At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The IS&T Retail Engineering Programs team is looking for a Cross Functional Test Lead to join our group. We are looking for someone who can be responsible for planning, coordination, execution, and continuous improvement of processes for end to end integration testing.", "description": "We are looking for a self-motivated individual with strong technical and interpersonal skills who can contribute in a team environment. This candidate must be able to create and present risks and mitigations to Senior Management. Day to day work involves the following: We are looking for someone who can lead testing efforts for multiple cross functional retail projects with concurrent timelines. This person will establish QA standards, guidelines, technologies, and approaches for the projects and for the testing team. Other day to day work involves managing and coordinating onsite and offshore testing team activities, actively participating in development and execution of test processes, strategies, and plans, working with Automation Lead to reduce regression test cycles with goal of 100% automation, and working with the business, technical project development teams, and project managers to establish project development schedules implement test plans to deliver high quality product releases.", "key_qualifications": "5+ years of proven experience leading a team as QA Lead, Strong experience developing and implementing test plans, QA processes and methodologies, Strong experience performing manual and automation testing, Experience with automation framework and tools, Strong experience in test data and environment setup for end to end testing, Strong capabilities in software testing in both Agile and Waterfall methodologies, Bachelors Degree in Computer Science or equivalent work experience", "preferred_qualifications": "Able to quickly identify and understand issues, Outstanding team player with excellent interpersonal skills and ability to work cross functionally, Excellent written, verbal communication and presentation skills, Able to collaborate with business partners, developers, and various support teams to troubleshoot and resolve defects and issues", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556944"}