{"title": "Senior Machine Learning Engineer - Ad Platforms, Predictions/Personalization", "summary": "At Apple, we work every single day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and visionary content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.", "description": "You will have the opportunity to work on Machine Learning models for an Advertising Platform with extreme scale requirements. You should have experience designing, developing and implementing algorithms combining expertise in machine learning, statistics, optimization, personalization or information retrieval and in analyzing impact on marketplace dynamics, preferably within an ad network. You have an excellent understanding of scalable architectures including operational concerns. Your ability to be a great teammate under tight deadline constraints is key to success.", "key_qualifications": "N/A", "preferred_qualifications": "Familiarity with AI models such as LLMs and ML techniques like such as explore/exploit, that can prove useful in cold-starting engagement (tap, conversion-rate) models", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559162"}