{"title": "Test Design Lead", "summary": "Apple’s System Test Design Lead (TDL) is a terrific position for someone passionate about and willing to lead exciting projects. Our organization plays a key role in keeping up the product standards at Apple and making sure that our customers are surprised and delighted with the experience of the products that they use. Employees of this organization enjoy having a chance to lead the design of a complete and custom system that is instrumental to the quality of those products. We are looking for a natural leader who can drive the development of our instrumentation in parallel to that of the product; someone who thrives in a dynamic and fast-paced environment. You will have a deep understanding of software and hardware fundamentals and a background in the design of complex systems. You will apply your excellent communication skills and passion to lead multi-functional teams to develop ground-breaking products. Your contributions will make a pronounced difference to future products that we take great pride in.", "description": "-  Working closely with the development teams, early in the product development lifecycle, to define functional and performance tests. Be the key person concerning calibration, test stations and diagnostics to ensure the product performs at the highest level\n\n-  Responsible for leading all the ongoing factory tests being conducted in the Mobile Group, for new product introduction from prototype to mass production. \n\n-  Responsible for the development of test procedures, test plans and test reports. Developing/executing project plans.\n\n-  Specifying/implementing test process control and data collection, detailing all the ongoing tests.\n\n-  Be the key liaison between our organization and our Contract Manufacturers\n\n-  Interact with internal groups at Apple to ensure that tests are being performed adequately and on time.\n\n-  Responsible for communicating to executives, upper management and technical staff on the progress of our product development and calibration/ test maturity. \n\n-  This position requires ability to deal with dynamic and fast-paced environment requiring decision-making with ambiguous information.", "key_qualifications": "", "preferred_qualifications": "Prior experience with one or more of the following technologies: Acoustics, Display, Touch, Imaging Sensors, Motion Sensors, Automation control, PCB (e.g SoC, Memory), Power or Battery\nUp to 20% business travel annually", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555514"}