{"title": "Test Chip Engineering Program Manager", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! As a Test Chip Engineering Program Manager within the Hardware Technologies Engineering organization, you will be responsible to drive end-to-end silicon schedules and resolving technical issues to enable timely Test Chip silicon for custom Analog and Digital Hard IP development and validation. This is an individual contributor role, helping handle the development process for test chips that support Hard IPs used in our next-generation Apple products. The focus of this role is on the specification and design of Test Chips and post-silicon validation of the IPs before the target SOC tapeout. Strong technical background in Digital and/or Analog IP development will allow you to succeed in this role.", "description": "• Work on a Program Management team responsible for driving technical issue resolution to deliver timely silicon to meet daring Test Chip schedules.\n• Drive internal program processes to guarantee high-quality silicon definition and design execution.\n• Support high-level milestone execution in a fast-paced design team.\n• Interface and drive issues within multi-functional teams: Design, Verification, DFT, Validation, Technology, Digital IP and Analog IP.\n• Focus design teams on meeting near-term achievements and unblocking technical issues by pulling together the right technical specialists to resolve the issues with data-driven decision-making.\n• Manage dependencies across various programs, functional teams, and sites.\n• Focused issue reporting, bug tracking, and communication of program risks and status.\n• Identify risks, develop mitigation strategies, and facilitate conflict resolution.", "key_qualifications": "Proven ability in SoC/VLSI Chip Design, ASIC Chip Design, Technology process development or Analog/Digital IP design.\nTechnical Program or Project Management, or Functional Management experience.\nGood knowledge of the Analog/Digital IP development process, tools/flows and methodologies, and the life-cycle in a Test Chip.\nPhenomenal leadership and communication skills across all levels of the organization, including Executive communication.\nExperience working in a multifaceted engineering environment, strong at multitasking and real-time crisis management.\nExpertise owning and driving project development using well-defined metrics.\nProgramming language experience (Javascript, Python, Perl).\nFamiliarity with project management tools (Confluence, JIRA).", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537261"}