{"title": "Privacy QA Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The User Privacy team seeks an engineer with a passion for test development to help us ensure that the strong privacy protections in Apple's platforms remain that way in every release and every build. Every Apple product and feature contains privacy functionality — from Siri to Maps to App Store to UIKit — and your focus will be to work with teams all across the company and at all levels of the stack to ensure there is an automated test plan for their features' privacy functionality. This work will impact software features touching millions of our customers and developers worldwide.", "description": "This position requires a self-motivated individual with strong technical and communication skills to handle responsibilities including: collaborating with other teams on their automated test plans for iOS, watchOS, macOS, and tvOS; designing, implementing, and handing off automated tests to teams as necessary; integrating with server-side components as appropriate.Additional responsibilities will include risk analysis and integration testing across Apple platforms.", "key_qualifications": "", "preferred_qualifications": "Experience developing for iOS, iPadOS, macOS, watchOS and/or tvOS with XCTest and Xcode", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $165,500 and $293,800, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558711"}