{"title": "DevOps Engineer", "summary": "Apple’s Applied Machine Learning team is looking for a talented and dedicated senior engineer to join their team to bring passion for infrastructure and distributed systems to build world-class data platforms/products at a very large scale across cloud environments.", "description": "You like to automate anything which you do and you document it for the benefit of others. You are an independent problem-solver who is self-directed and capable of exhibiting deftness to handle multiple simultaneous competing priorities and deliver solutions in a timely manner. Provide incident resolution for all technical production issues. Create and maintain accurate, up-to-date documentation reflecting configuration, and responsible for writing justifications, training users in complex topics, writing status reports, documenting procedures, and interacting with other Apple staff and management. Provide guidance to improve the stability, security, efficiency, and scalability of systems. Determine future needs for capacity and investigate new products and/or features. Strong troubleshooting ability will be used daily; will take steps on their own to isolate issues and resolve root causes through investigative analysis in environments where the candidate has little knowledge/experience/documentation. Administer and ensure the proper execution of the backup systems. Provide 24x7 on-call support to handle urgent critical issues.", "key_qualifications": "Experience operating and developing infrastructure and services in public cloud environments (AWS, or GCP). Experience with containers and container orchestration platforms such as Docker, Kubernetes or equivalent. Strong proficiency with Helm and Kustomize for managing Kubernetes applications and configurations through GitOps practices. Experience with configuration management or Infrastructure as Code (IaC) tools such as Ansible, Terraform, and Crossplane is desired. Passionate about operational excellence through proper automation and engineering processes using programming languages such as Go, Python, Java, or other JVM languages. Proficient in working with Linux or other POSIX operating systems, shell scripting, and networking technologies.", "preferred_qualifications": "", "education_experience": "BS in computer science with 5-7 years or MS plus 3-5 years experience or related experience.", "additional_requirements": "• Should be highly proactive with a keen focus on improving the uptime availability of our mission-critical services. • Excellent verbal and written communication skills, able to collaborate cross-functionally with program managers and engineering partners. • Comfortable working in a fast-paced environment while continuously evaluating emerging technologies. • Familiarity with logging and observability technologies such as Splunk and Prometheus or similar. • Validated software engineering experience and field in design, testing, source code management, and CI/CD practices.• Position yourself as a go-to consultative resource and solution expert for Data Engineers and analysts. • Adaptable to prioritizing multiple issues in a high-pressure environment. • Bonus: Design, implementation, and benchmarking of ML/deep learning algorithms", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546982"}