{"title": "Cellular RF Transmitter Systems Engineer – Efficiency Improvement and Linearization of Power Amplifiers", "summary": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? Do you like changing the game? We invite you to join our dynamic group, for the unique and rewarding opportunity to contribute to upcoming products that will delight and inspire millions of Apple’s customers every day.\n\nApple's RF systems engineering team is looking for a passionate, independent engineer with a proven track record in the field of cellular RF transmitter systems engineering, envelope tracking, and digital predistortion. Our world-class team shapes the mobile market with innovative concepts while being fully accountable for execution and commitments on timeline and quality.\n\nJoin our team of leading experts in cellular RF industry and deliver differentiating transmit architectures and solutions for Apple’s cellular products that create amazing benefits for our customers!", "description": "In this role, you will be part of a best-in-class cellular systems engineering team. You will work closely with other teams like RX teams, PLL teams, architecture teams and RF design teams. You will define the architecture and implementation of future digital predistortion and PA efficiency improvement solutions with focus on leading-edge performance under real-life conditions and clear differentiation from other solutions.\n\n• Direct responsibility for specification and development of advanced Envelope Tracking and/or Digital Predistortion Concepts.\n• Derive and document specifications for RF Front-End components like PA or ET modules.\n• Provide specifications and reference algorithms for SW development.\n• Modelling of PA characteristics for subsequent system simulation.\n• Analysis of measurement reports with respect to ET and DPD performance and functionality.\n• Identify and analyze critical requirements and provide deep dive assessments with respect to critical metric impact, timeline, and risks.", "key_qualifications": "We would like you to have proven expertise and first-hand experience in architectures and concepts for digital predistortion (DPD) and envelope tracking (ET). Your technical profile shall cover several of the following areas of knowledge and experience:\n\n- Extensive experience in DPD algorithm development.\n- Solid understanding of PA technologies and architectures and their non-linear characteristics.\n- Deep understanding of system requirements and implementation of PA efficiency techniques like envelope tracking.\n- Deep understanding of cellular signals characteristics and TX performance metrics.\n- Solid understanding of calibration concepts to meet requirements in high-volume production, including TX, ET, and DPD calibration.\n- Knowledge of 3GPP Standards (LTE, 5G NR) and cellular procedures including RF aspects and implication on transmit system specifications.\n- Excellent written and verbal communication skills.\n- BS and a minimum of 10 years of relevant industry experience.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years of relevant industry experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533525"}