{"title": "iOS macOS Software Engineer - Audio/Music Engineering", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Audio & Music Apps group is looking for a Software Engineer to work on building Apple’s Core Music and Audio Creation Apps. We are the Engineering team that works on GarageBand, Logic Remote, Logic, MainStage, and Voice Memos which is the software used by Artists, Musicians and Producers around the world.", "description": "Our team practices fast-paced development that relies heavily on a tight relationship between engineering, QA and product design. Responsibilities will include working on new features for macOS and/or iOS applications, developing new audio and music related technologies and applications, and supporting the existing features of our apps.", "key_qualifications": "", "preferred_qualifications": "Music, audio production skills, understanding musical concepts\nPlaying an instrument is a big plus", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556144"}