{"title": "EHS Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe EHS team at Apple is growing, and we need upbeat, dedicated and flexible professionals to join a diverse team committed to protecting the environment, health, and safety of our employees, customers and the global communities where we operate, while supporting our stakeholders in their mission to develop amazing products.\n\nApple is looking for a skilled Environmental Health and Safety Professional to join the EHS team. This role assists in the development, implementation and management of Apple’s EHS programs.", "description": "This position will help develop and implement EHS programs to ensure environmental, health and safety compliance are maintained at Apple facilities. Major areas of responsibility include: facility EHS compliance, risk assessments, industrial hygiene exposure assessment, R&D equipment review, facility construction design review, EHS training, and emergency response support.", "key_qualifications": "15 or more years' experience in the development, implementation and operation of:\n- Hazardous energy voltage test systems/electrical safety\n- EHS risk assessments, exposure assessment and hazard control practices\n- Lithium ion battery safety\n- Facility construction EHS Design review\n- New equipment safety review and facility integration\n- Equipment or tool safety program\n- Laser safety\n- Proven understanding of fire and gas life safety systems\n- Strong understanding of ISO/ANSI Standards, CalOSHA Standards, NFPA, California Fire Code is a plus\n- POSSES THE SKILLS AND ABILITY TO:\n- Maintain and monitor EHS permitting and regulatory compliance\n- Conduct and track workplace safety and compliance inspections\n- Manage computer-based EHS training (Learning Management Systems LMS) development and delivery\n- Accurately assess physical and health hazards and the selection of appropriate personal protective equipment (PPE)", "preferred_qualifications": "", "education_experience": "BA or BS program in a relevant EHS subject area", "additional_requirements": "Additional skills and experience in the following areas are desirable\n-  Establishing positive relationships with Federal, State, and Local regulatory agencies\n-  Establishing relationships with peers, partners and Apple internal customers", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536372"}