{"title": "Commerce Localization Project Manager", "summary": "The people here at Apple don’t just build products — they create the kind of wonder that has revolutionized entire industries! The diversity of those people and their ideas encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.  The Services UI Localization team delivers high quality features to our customers worldwide, across Apple Media Products (App Store, Music, Video, Books, Podcasts, Fitness+, News), iCloud, Maps, Enterprise and Education, and Identity Management Services. Server engineering schedule is fast-paced, and our extensive scope provides self-motivated individuals with plenty of opportunities to work on highly visible projects to deliver an outstanding user experience across all platforms and markets.  Commerce UI Localization Project Managers (LPMs) lead a wide variety of localization projects on iOS, iPadOS, macOS, tvOS, watchOS, visionOS, 3rd party platforms, and Web. They closely collaborate with cross-functional partners across Engineering, QA, Design, Product, Marketing, Legal, and more. Linguistic, technical, and interpersonal skills are key to successfully lead localization and QA efforts in 40+ languages simultaneously.", "description": "End-to-end planning and management of localization projects to ensure timely deliveries of UI features with the highest quality. This process includes adhering to stringent security and confidentiality requirements while collaborating with both external and internal partners.  Overseeing translation and QA tasks prioritization, responsible for creating detailed localization requirement documents such as mapping docs and test plans. Implementing first-hand before handing off to our lab testers to execute at scale.  Collaborating across localization teams to create and maintain glossaries and reference materials to ensure consistency across our ecosystem (software, marketing, support…).  Partnering with cross-functional teams across multiple time zones to identify the best localization strategies around new and current brands.  Contributing to project kick-offs and quality analysis meetings by communicating project timelines, resources and risk management, content needs for validation, on-device testing, and localization sign-off across multiple platforms.  Tracking, addressing, and escalating issues while proactively managing risk and effectively communicating status throughout the development cycles.  Acting as the primary point of escalation for queries from translators, testers, and localization peers. Providing them with ongoing localization QA support and feedback.  Identifying gaps or inefficiencies in tools and processes in order to drive continuous improvements.  Implementing and fostering globalization/internationalization/localization standard processes.", "key_qualifications": "", "preferred_qualifications": "Strong familiarity with Apple ecosystem (hardware, software, and services). Native-level proficiency in another language besides English and inclusive knowledge of other cultural norms. Familiarity with QA automation scripts and protocols. Familiarity with internationalization standards such as Unicode and CLDR. Experience developing in Swift and Python or other programming languages such as JavaScript, C++, Swift, or Xcode.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559629"}