{"title": "Director, Marcom Packaging", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. An important way that our customers first experience Apple products is through packaging. The Marcom Packaging team partners across the company to create the best possible packaging for every new Apple product. Marcom is seeking an experienced strategic leader to help drive the planning and execution of packaging for Apple. In this senior role, you will lead the Marcom packaging team that develops world-class packaging and proactively advocates for industry-leading innovations. This requires an appreciation for quality, an ability to navigate a complex organization, clear communication, and patience for the process—both design and engineering. You will represent Marcom as a primary partner with key executives across the company, and you will collaborate internally with cross-functional leaders of design, engineering, and operations and externally with global vendors and suppliers.", "description": "You will lead two teams within Marcom Packaging: a team of producers responsible for working cross-functionally to produce amazing packaging for every new Apple product, and an R&D team that works closely with internal Apple teams and with suppliers globally to develop new printing techniques and packaging materials. The R&D team includes a team in China that executes both design and R&D projects. You set the tone for your team and bring an inventive, enthusiastic approach to problem solving for your growing organization. You thrive in a creative environment, learn quickly and can accommodate rapid change. You are an expert at building relationships with and influencing teams in Marcom, across all of Apple and with outside suppliers and vendors to achieve exceptional results.", "key_qualifications": "", "preferred_qualifications": "- 15-20+ years relevant experience working and leading teams in a creative environment.\n- Packaging evangelist, deeply passionate about Apple products and our approach to packaging.\n- Lead and drive your team to achieve excellence. You create a positive team culture and you are a strong ally and coach for your global management team.\n- Appreciation for quality and expertise in engineering and design process.\n- Work with suppliers to develop packaging concepts, validate manufacturability, and drive innovative solutions.\n- Knowledge of materials, inks, adhesives, print decoration, finishing techniques and manufacturing processes.\n- Strong attention to details, ability to manage multiple projects at once and keep track of milestones and deliverables. Ability to prioritize and work on multiple highly detailed projects at the same time.\n- Strong organizational, interpersonal, and communication skills to work with cross-functional teams and a worldwide supply base.\n- You have great creative problem-solving skills are adaptable, flexible and resourceful as you manage product changes, time constraints, regulatory changes, operational challenges, etc.\n- You are available for both domestic and international travel.\n- Bachelor’s degree preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $255,400 and $408,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555915"}