{"title": "Channel Communications Executive, Nordics", "summary": "The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionised entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s Sales organisation generates the revenue needed to fuel our ongoing development of products and services. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, in many ways, is the face of Apple to our largest customers. In this role, you will be in a key position to fully take advantage of our products and the huge interest for Apple in the local market to drive our sales to the next level. We are looking for an extraordinary individual to work as a Channel Communication Executive in our Nordic region, reporting to the Channel Communications Manager. The role will be responsible for the Telecom Route to Market as well as supporting our Apple Premium Resellers (Apple Monobrand). Sitting within Apple’s Channel Sales organisation, the Channel Communications Executive plays a highly collaborative role, interacting with stakeholders in various country teams, partners and Apple’s central Western Europe organisation. It is a highly visible role with opportunity to develop a broad network within Apple and with partners at many levels. It requires a strong commercial mindset and the ability to negotiate with stakeholders in all organisational levels.", "description": "The person will handle 1-2-1 relationships with key partners across the North region and be responsible for the management and execution of channel marketing activities in collaboration with sales and the central team. Develop and maintain relationships with partners, working closely to establish C-level alignment on long term and quarterly marketing plans. Work to constantly improve partners marketing efforts with a data-driven analytical approach considering ROI analysis, A/B testing, base management, transactional CRM and guide partners to build online capabilities that improve omni-channel experience and drive sales. Manage the quarterly investment process from budget and execution to ROI analysis in close collaboration with finance and the sales team. Educate partners on Apple's marketing assets, guidelines and product launch communication guidelines. Present marketing activities to C-level audiences - at partners, internally to leadership or finance to pitch for budget allocation or evaluate results. Build annual marketing plans with key partners, ensuring all marketing and communications plans are aligned with overall sales strategies and key focus areas.", "key_qualifications": "", "preferred_qualifications": "Apple doesn’t cut corners, in products or in business. You bring the highest level of integrity, honesty, and accountability in all that you do, every single day. You are a trusted advisor who does what you say you’ll do — and always does what’s best for Apple. Customer and partner needs can often be unique — but, you’re quick on your feet and connect and influence the right people both inside and outside of Apple. As a go-to person you are trusted and comfortable in tough situations. You can settle disputes, negotiations and be responsible for difficult decisions with minimal noise. You step up to conflicts and see them as opportunities to shine. You know yourself — you have strengths, weaknesses and opportunities — but you also know the people around you and are open to their feedback. You relate well to all kinds of people – up, down, and sideways, inside and outside the organisation. When faced with a challenging opportunity, you know who to connect with and when. People know you as a true collaborator who knows what it takes to win. You think clearly. You simplify complex problems and distill big decisions down to their core. Sometimes decisions require you to make tough calls, even after considerable energy has been invested — but you own it! You stand by your deep analysis, wisdom and experience to make quality and timely decisions. You strive for quality in everything you do! Due to changing priorities, urgent customer needs, or a final push to meet a quarterly forecast, you face the daily challenge of where to focus your time and energy. You have a don’t give up attitude, and finish, especially in the face of resistance or setbacks. You seize every opportunity and empower others to reach their goals along the way. You preferably have a business degree. But it is not a requirement. Most important is you are naturally curious and continuously seek out opportunities to grow and learn.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200560597"}