{"title": "WW Investment Specialist", "summary": "Marcom is the creatively-led global team that oversees Apple’s consumer facing marketing. We ensure the flawless development and execution of world-class communications across all medias and platforms. Every day, hundreds of millions of Apple customers around the world interact with our products. We drive the strategy and creative work that provide both new and existing customers with simple, engaging and inspiring marketing experiences. As our WW Media Investment Specialist, you will lead our media efficiency's vision! You will be responsible for committing a large portfolio of media investment dollars and ensuring goals were met. Our ideal candidate will have an interest in global markets and the impact on both local and global media. Success in this role calls for close collaboration with our media strategists, WW finance and our agency partners. Cross-checking and reviewing these intricate details in parallel with creating a vision for the future is crucial for achievement in this position. We strive to build on any learnings for a clearer path forward.", "description": "Primary day-to-day responsibilities include but are not limited to: designing and operating a business cadence for the organization that includes setting budget priorities, tracking outcomes, and adapting/adjusting strategy or plans based on learnings or changing assumptions. Building robust capabilities that can address the global, complex portfolio of businesses and category needs resulting in actionable plans that drive highly efficient media campaigns Presenting Quarterly Business Reviews (QBRs) to stakeholders on fund and commitment consumptions, audits and share-of-voice analysis Modernizing practices that hold agency partners accountable for channel-level proof of running and deliverables Influential in the media space, getting collaborators on board with ideas and expertly leading this unique function within a lean media team", "key_qualifications": "N/A", "preferred_qualifications": "Keen understanding of the various media channels, campaign KPIs and buying documentation. Global media experience. Persuasive approach and a record of strong collaboration with cross-functional partners. Well-adept ability to present a POV to advertising and media leadership with an entrepreneurial spirit. Strategic thinker with strong analytical skills. Ability to act swiftly amidst ambiguity, while putting audit and QBR findings into action. Anticipate and balance the needs of multiple stakeholders through future casting. Ensure accountability by assuming responsibility for the outcomes of others, promoting a sense of urgency, and working with partners to establish explicit performance standards. Ability to influence without direct authority, i.e. vendor management.", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $179,000 and $269,100, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555366"}