{"title": "AI/ML Wireless Systems Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking AI/ML based wireless solutions. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will work on defining system level concepts, proposing, and researching innovative ideas & algorithms, performing sophisticated system simulations, defining and working on rapid prototyping platforms to help prove your ideas for current and next generation (5G/6G) cellular systems with strong AI/ML foundation.", "description": "- Participate in cutting edge research in machine intelligence and machine learning applications. Contribute to AI/ML framework design. Take a top-down approach towards system design starting from a use case of relevance to Apple products, defining a problem statement and arriving at groundbreaking innovative solutions. Setup large-scale tests and deploy promising ideas quickly and broadly. From creating experiments and prototyping implementations to designing new architectures, developing solutions for real world, large scale problems.", "key_qualifications": "Direct experience on solving interdisciplinary problems via machine learning (ML). Publications in top machine learning conferences/journals such as JMLR, ICLR, NeurIPS, ICML, ACL, CVPR. Knowledge in Algorithms, Optimization, Probability, Statistics and Information Theory Working experience in one or more of the following research directions in Neural Networks: Deep Reinforcement Learning, Federated Learning, Transformer, Transfer Learning, Online Learning, Generative Neural Network, Graph Neural Network, CNN, RNN etc. Shown track-record of innovation in AI/ML Programming experience in Python, MATLAB. Demonstrate clarity of thought and strong analytical and problem-solving skills. Ability to work well both independently and within a team. Excellent communication and presentation skills. Familiarity with efficient implementation of AI/ML in hardware. Good coding style and code management abilities.", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200535084"}