{"title": "Machine Learning Architect, Creativity Apps", "summary": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly! The Creativity Apps team needs your help shaping the next generation of creative editing tools by working on pioneering technologies to surprise and delight creative pros and enthusiasts alike. You’ll be working with the world-class teams behind Final Cut Pro, Logic Pro, iMovie, and GarageBand to create next-generation tools for creators. You’ll have the opportunity to work with our world class creatives, designers, and engineers to help innovate in the creative space in ways that only Apple can. This is a highly visible, highly impactful opportunity!", "description": "Are you ready to be one of the founding members of a new engineering team focused on building state-of-the-art creative editing tools? You will take ownership around identifying the technical direction and innovation in key product areas. You will be responsible for identifying our technical investments to power the next-generation tools for creators. This is a highly collaborative role with the opportunity to evolve in many directions.", "key_qualifications": "Experience in identifying and delivering state-of-the-art solutions for creatives, Ability to inspire and align efforts across the company towards delivering on creative needs, Recognized innovator in the creative space, Extensive knowledge in machine learning and deep learning techniques, Experience delivering products in Computer Vision, Computational Photography, multimodal-LLMs/Foundation models, Generative AI, Machine Learning (ML), or related areas, Experience in building end-to-end ML pipelines from data ingestion to feature engineering to model training to deploying and scaling the model in production, Experience in model training, model optimization, ML system architecture design, and scalable ML model deployment, Experience delivering high quality software at scale, Experience as a technical lead; demonstrating strong communication, collaboration, and project management skills, Willing to take responsibility and ownership of features and drive key architectural decisions, Committed to encouraging an open and inclusive work environment, Ability to communicate effectively, collaborate, and build long-term relationships across the organization, Ability and desire to mentor others in achieving engineering excellence and to be a catalyst on the team.", "preferred_qualifications": "", "education_experience": "PhD in computer vision, machine learning, computational photography or related areas; alternatively a comparable industry career, with significant experiences on delivering products using state-of-the-art computer vision and machine learning technologies.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $252,400 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550570"}