{"title": "WW Sales - Tech Data Analyst (Singapore)", "summary": "The people here at Apple don't just create products - they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Apple is seeking an experienced, detail-minded “Tech data analyst” to join our worldwide business development and strategy team. If you are someone who looks forward to solving complex business problems and is excited about this opportunity, please reach out to us.", "description": "You will architect, develop, and test large scale data solutions, to provide efficient analytical and reporting capabilities across Apple’s global and regional sales and finance teams. You will maintain and/or develop highly scalable data pipelines to load data from various source systems, use Apache Airflow to orchestrate, schedule and monitor the workflows. Build generic and reusable solutions that can scale and utilize various technologies and frameworks to solve our complex business requirements. You will be required to understand existing solutions, fine-tune them and support them as needed. Data quality is our goal and we expect you to meet our high standards on data and software quality. We are a rapidly growing team with plenty of interesting technical and business challenges to solve. We seek a self-starter, who is willing to learn fast, adapt well to changing requirements and work with cross functional teams.", "key_qualifications": "6+ years of hands-on data engineering support experience with excellent oral and written communication skills. Work with the technical team, BSA’s and QA to ensure the stability and reliability of the Business Systems supporting critical business processes. Follow up on daily operations for the Business Systems including monitoring performance, dataloads, provisioning and network traffic. Operate tools for monitoring and security. Analytical and mathematical mind, capable of evaluating/analyzing and solving various complex problems. Troubleshoot problems with malfunctioning software applications and able to recommend and take corrective action. Be able to perform peer code review and provide feedback. Perform root cause analysis during failures and document scenarios for future use. Find and report on failure trends to identify long-term solutions. Respond to customer product inquiries in email or chat sessions. Document customer issues and recurring technical issues to support product quality programs and product development. Ability to learn and adapt to new tools and technologies. Ability to work individually or as part of a team. Ability to learn quickly in a fast-paced environment. Understanding of dimensional modeling and data warehousing. Understanding of Database design and development experience with relational or MPP databases such as Postgres / Oracle / Teradata / Vertica. Experience in development of custom ETL pipelines using SQL and scripting languages (Python/Shell/ Golang). Experience with Java, Scala and Python. Proficiency in advanced SQL, performance tuning. Preferred experience with Big-Data platforms like Spark, Dremio, Hadoop, MapReduce, Hive etc. Experience with cloud computing platforms like AWS, GoogleCloud. Experience working with APIs. Familiarity with version control systems (GIT and others), CI/CD practices, testing and migration tools for database and software. Familiarity with real-time data processing using Apache Kafka or Spark Streaming.", "preferred_qualifications": "", "education_experience": "BS or MS in Engineering/Computer Science", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200533370"}