{"title": "Machine Learning Engineer - Strategic Data Solutions", "summary": "Do you love the challenge of solving complex problems that can have a direct and meaningful impact on the company? Do you want to be part of a supportive team that’s constantly learning and having fun while solving tough business problems?", "description": "• Engage with stakeholders to translate ambiguous business problems into technical solutions, including finding opportunities, breaking them into solvable segments, defining requirements, assessing level of effort, etc\n• Work cooperatively to design data science-driven solutions, balancing the utility of tried-and-true techniques and the benefits of custom solutions\n• Collaborate with technical partners to implement robust real-time and batch decisioning in production\n• Create reporting and monitor decisioning quality to maintain operational and business metric health\n• Investigate trends, assess threat impact, and respond with agile logic changes\n• Communicate with stakeholders with varying technical backgrounds and business priorities about your work\n• Share what you're learning about novel technologies and methods (in data science, machine learning, data engineering, and software engineering, etc) to improve your team's overall technical capabilities", "key_qualifications": "Practical experience (acquired through work, independent projects, or academic research) in deploying machine learning solutions to answer real-world questions\nPractical experience with implementing data science-related applications in a programming language such as Python, Scala, or Java\nTheoretical understanding of machine learning algorithms and their relative strengths and weaknesses\nAbility to use a querying language such as SQL to extract insights from data\nDemonstrate ability to think holistically about system structures and interactions in order to anticipate technical, business, and customer impact\nEffective communication skills to translate complex concepts and analysis into concise, business-focused solutions\nTeam-oriented skills and values to facilitate effective collaboration with business and technical partners", "preferred_qualifications": "", "education_experience": "• Graduate degree with research/work experience utilizing data science techniques (including but not limited to Computer Science, Statistics, Political Science, Biology, etc)\n• Or Bachelor’s degree with equivalent experience", "additional_requirements": "To learn more about opportunities at Apple, visit http://www.apple.com/jobs/us/\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501582"}