{"title": "SWE - Software Localization Project Manager - L&RE", "summary": "Are you looking for a great opportunity to work on a dynamic team passionate about delivering world-class localized software on some of the world’s most creative consumer electronic products? Do you love the challenge of solving complex problems that can have a direct impact on the success of the company? Software Localization Project Management team is looking for a highly motivated, energetic, and experienced Software Engineering Project Manager to research, define, and drive software localization strategy and software improvements that are outstanding to particular regions of the world!", "description": "You’ll collaborate with other teams to define and drive improvements across software engineering. You’ll also coordinate with engineering, QA, and international teams to resolve software problems. Further, you’ll be working multi-functionally to review and prioritize future software development. Other responsibilities include developing tools to make localization workflows more efficient and automate tasks to improve efficiency and quality; integrating localized software content with core software product deliverables by developing schedules for software localization projects; helping investigate the root causes of international issues that are found in localized software; and evangelizing international engineering issues.", "key_qualifications": "Good communicational skills, Project management experience and skills, Ability to collaborate with international multi-functional software projects involving engineering, quality assurance, and international and marketing teams, Deliver processes and tools to support product specific for regional markets, Basic knowledge in Unix, Shell Scripting, Python and other computer languages", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Computer Science, Electrical Engineering, Electronic Engineering, Languages Translation/Interpretation, Localization or foreign equivalent.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200509783"}