{"title": "SWE - Cellular Verification Engineer (Pre-Silicon), WTE", "summary": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. In this role we're looking for a talented engineer with programming and test knowledge in C/C++ with a good understanding of LTE or 5G. You'll work across the protocol layers on groundbreaking technologies in a pre-silicon environment.", "description": "This role involves designing verification strategies, develop test suites and maintaining regression test systems to ensure Apple wireless products conform to 3GPP protocols and offer a best-in-class user experience. If you're passionate about cellular technologies and have the dream to work on groundbreaking cellular technologies this is a wonderful opportunity. As part of this team, you will play a crucial role in delivering the next-generation iPhone user experience worldwide.", "key_qualifications": "Good understanding of LTE or NR and related 3GPP/ETSI standards. Knowledge in cellular protocols (e.g. PHY, MAC, RLC, RRC, NAS, etc.) in LTE/NR domain. Software development and debugging skills including design & programming (C/C++). Experience in test case scripting, and conforming to relevant ETSI/3GPP protocol technical specifications is important. Proficient with test automation and scripting (e.g. Python). Comprehensive log analysis, fixing, analytical and problem-solving skills. Highly motivated and proactive, fast learner, a good great teammate", "preferred_qualifications": "", "education_experience": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent with significant industry experience working in Cellular Protocol S/W development or Test.", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal-opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539470"}