{"title": "Financial Analyst - Subscriptions", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. This team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future. Join us, and you’ll have a meaningful role in continuing Apple’s legacy of efficiency and success.", "description": "As part of the Apple Services and Infrastructure Finance team, you will be an integral member of the team responsible for forecasting, monitoring, and influencing the financial impacts of investments supporting App Store, MUSIC, Arcade, iCloud, AI/ML, tv+ and more. You will develop an understanding of existing businesses to identify emerging trends impacting future expectations. You will evaluate and shape new business models across our services portfolio. You’ll partner closely with senior finance and business leaders to articulate your analysis and recommendations. Responsibilities: - Partner with Decision Support and Analytics team to develop and manage roadmap for automated forecast models that standardizes how we manage subscription services - Develop and harvest key relationships with business partners to review and improve new business model process - Partner with Analytics and LOB partners on evaluating BD performance of key strategic deals to help maximize ROI of our promotional investments - Partner with WW BD Operations team to establish and maintain guidelines on promotional offerings on subscriptions services. - Ad-hoc analysis and business support monitoring subscriber acquisition, conversion, and churn", "key_qualifications": "", "preferred_qualifications": "Hands-on experience performing modeling, forecasting and reporting\nAbility to quickly build effective working relationships and influence cross-functional teams at all levels of the organization.\nProactive problem solver, expected to present problems and solutions simultaneously\nSelf-motivated and independent. Ability to deliver compelling solutions in a fast-paced environment with frequent interruptions and competing priorities.\nStrong verbal and written communication skills with the ability to articulate results of analysis in easy to understand business terms. Presents data in simple and intuitive formats.\nExcellent analytical and problem-solving skills with flawless attention to detail\nHigh degree of proficiency in Excel required. Experience with Tableau, FileMaker and SAP, BPC, Essbase enterprise systems preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554787"}