{"title": "Device Services Senior Manager", "summary": "Are you looking for a great opportunity to work in a team passionate about delivering large-scale and world-class services within Apple? As a Device Services Senior Manager, you’ll be leading two Ops teams in different locations, as well as an Engineering team. Apple’s Software Engineering group is renowned for its work in user experience, integration, functionality and lifestyle. It's a critical component of Apple's ecosystem and one that continues to break new ground every day! This kind of success has been the result of very skilled people working in an environment which fosters creativity, cooperation and the solving of old problems in new ways. If that sounds like the kind of place that you find intriguing, then this may be the place for you!", "description": "The team you’ll lead provides critical, large-scale, and complex services for Apple. You will be responsible for reliably and efficiently deploying and supporting these services. You will work closely with cross-functional partners and customers to ensure we deliver the best-in-class services. You’ll provide direction to your team, help define roadmap across functional disciplines, and collaborate with key partners to offer robust and reliable services for Software Engineering within Apple. Passion for operational and engineering excellence is required. Additionally, a candidate must also have:\n- Ability to help grow and develop a team\n- Proven track record of consistent execution \n- Strong sense of ownership and accountability \n- Proactive, having a can-do attitude, and going above and beyond to solve problems\n- Data driven decision making\n- Experience of leading first-level managers", "key_qualifications": "", "preferred_qualifications": "Emphasis on SRE as an engineering discipline with a focus on reliably scaling and deploying distributed systems\nExperience in supporting infrastructure and services\nDemonstrate ability to set measurable goals and KPIs\nAbility to work and influence across teams and organizations", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $200,400 and $358,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555978"}