{"title": "Browser Security Researcher", "summary": "Apple's Security Engineering & Architecture organization is responsible for the security of all Apple products. Passionate about safeguarding our users, we believe that the best defense requires a great offense. When it comes to securing more than a billion devices running the world's most sophisticated operating systems, that means finding vulnerabilities first. Can you make a difference on this scale? Join our extraordinary team of security researchers and help protect all Apple users.", "description": "Our team focuses on securing Apple products, from microarchitecture to applications such as Safari, Mail, and Messages. Evaluating the security of iOS and macOS kernels, boot ROMs, firmware and hardware are all included in the scope of the team. Working alongside a wide variety of teams and vendors, your influence will be felt throughout Apple's products such as the iPhone, iPad, Mac, and Apple TV. As a member of the team, one of your principal responsibilities will be to conduct vulnerability research on Apple browser applications and their underlying software components (WebKit, JavaScriptCore, etc). Analyzing and exploiting vulnerabilities is also a key element of the role. This position requires someone with strong technical skill, who is creative and has a desire to secure systems by showing how they can be broken. If this is you, we'd love to hear from you.", "key_qualifications": "Experience in and a passion for vulnerability research and exploitation, targeting web browsers and technologies. Strong familiarity with vulnerability classes such as stack and heap based buffer overflows, object lifecycle issues, and logic errors along with practical experience with exploitation techniques applied to browser security. Knowledge of the security architecture of web browsers, for example sandboxing mechanisms, inter-process communication, and JavaScript JIT compilation vulnerabilities. Experience auditing and exploiting large modern C++ code bases. Familiarity with tool development, using programming languages such as C, C++, Python, Swift, Objective-C. Proven problem-solving and analytical skills. Excellent written and verbal communication skills.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537628"}