{"title": "Engineering Program Manager, SWE Privacy", "summary": "Privacy is a fundamental human right and one of Apple’s core values. We are committed to delivering great features and great privacy to our customers. The Software Engineering Program Office is looking for an Engineering Project Manager to support the User Privacy Team. As an EPM, you will play a key role in shipping high-quality user experiences to billions of customers, all designed with privacy in mind.", "description": "EPMs are responsible for developing processes, managing and communicating project definitions, engineering achievements and schedules, and project status for new and ongoing projects. EPMs are catalysts for the teams they support, bringing clarity by creating plans, driving the team to execute on those plans, setting goals and expectations, and removing roadblocks.   As an EPM, you will have the opportunity to influence and build relationships with team members in all functional areas and levels of the organization— engineering, legal, marketing, design, and leadership. You will ensure that all products, services, and projects are designed with privacy by ensuring the privacy team’s work is tracked, accounted for, and delivered on time.", "key_qualifications": "Experience developing project plans and managing complex, cross functional projects\nAbility to navigate through, find clarity in, and lead teams through ambiguity\nAbility to track and manage numerous, unrelated parallel activities\nAbility to mobilize, encourage, influence, advocate for, and lead teams without direct authority\nSuperior collaboration, communication, and organizational skills\nAbility to create, drive, and document repeatable processes and resources\nFlexible, self-motivated, curious\nPassion for privacy", "preferred_qualifications": "", "education_experience": "BS/MS", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $129,600 and $236,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540436"}