{"title": "Software Engineer (Cloud and Automation),  Retail Engineering", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work! Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "The Cloud and Automation team manages a large fleet of infrastructure that spans across Global Data Centers owned by Apple and Third party Cloud vendors including AWS and GCP, with the goal of providing stability to users of our apps at Apple stores across the world. You will work closely with product owners and app owners to establish SLOs and identify areas of improvement across the app suite and support the roll out of new features across multiple regions and Geos. Manage offshore and onsite support team in handling queries and problems reported by users from Apple stores. The candidate will also be involved in building robust monitoring and alerting systems for our suite of apps and build tools to automate troubleshooting processes thereby reducing the downtime of our critical apps.", "key_qualifications": "4+ years experience in cloud vendors like AWS, GCP and AliCloud, 4+ years work in Kubernetes landscape from Packaging, Deployment, CI/CD, Security, Governance, Scalability, Fault tolerance, Canary Deployments etc and implement solutions to run Production Applications in Kubernetes, Proficient in navigating Linux based applications and networking protocols, Proficient in using logging tools like Splunk, Kibana to do analysis and create reports, Experience in automation scripting using Python and Shell, BS in Computer Science or equivalent work experience", "preferred_qualifications": "Experience in programming languages like Java/ Go/ NodeJS/ Python, Experience in Kafka, Cassandra, Couchbase/Elastic search, Redis and other no sql databases, Experience in Observability frameworks like Prometheus, Grafana, Jaeger, Thanos, Cortex, Experience in troubleshooting Java applications in a production environment and presenting deep insights around JVM vitals is strongly desired., MS in computer science or equivalent work experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555700"}