{"title": "Financial Analyst - WW Channel Terms", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future. Join us, and you’ll have a significant role in continuing Apple’s legacy of efficiency and success.", "description": "Worldwide Sales Finance is looking for an analyst to support the WW Channel Terms. This person will be responsible for driving Channel partner margin strategy. This role combines strong business acumen, strategic analysis, and relationship management skills. You will be responsible for managing worldwide channel margin structures, liaising with Geo Finance and WW Product Marketing Finance to develop, execute, and monitor global channel incentives programs. You will have the opportunity to work on high-impact sales strategies and be an integral part of re-defining global Channel Terms. You will be responsible for finance-related activities including strategy, metrics, investment criteria, and reporting relating to Channel Terms & Initiatives. Responsibilities include: Cross-team collaboration Geo Sales Finance and Sales, developing complex models, tools, and analytics to support channel program forecast and analysis, serve as a liaison to WW Product Marketing Finance and, manage Channel Terms governance process valued at billions of dollars annually, presenting and reporting to senior management on financials and strategy related to Channel Terms. You should possess a high level of motivation and initiative, effective communication skills, and the ability to work as a great teammate with all levels of the organization. Extensive experience in Excel modeling and experience in a sales environment are highly desirable.", "key_qualifications": " ", "preferred_qualifications": "Deep understanding of the P&L and FP&A, Demonstrated ability to conduct complex, data-driven analysis and present to senior leadership, Strong verbal and written communication skills with the ability to clearly articulate analysis, business cases, and ideas to senior leadership, Ability to create successful partnerships cross-functionally within a large organization, Must be able to think strategically on critical business issues, while simultaneously possessing the ability to act tactically to execute against them, Positive personality with demonstrated success in challenging and improving the status-quo, Strong Excel spreadsheet and modeling skills, Self-starter, with the ability to work independently but also as part of a team, Working knowledge of Tableau and experience developing dashboards preferred", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553662"}