{"title": "Force Hardware - Sensor Design & Integration Engineer", "summary": "Come join the Sensor Technology Team! We're a multi-disciplinary, problem-solving team developing state-of-the-art sensing solutions and technologies that are central to Appleʼs products, including the iPhone, iPad, Apple Watch, AirPods, and more. As part of this team, you'll have an opportunity to participate in development from proof-of-concept all the way through end-product launch. The key goal of the Sensor Technology Team is to enable the worldʼs best user experience. New challenges arise every day that require the sharp analytical skills of talented and smart individuals. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation.", "description": "• Lead development of sensing solutions from conception through product release.\n• Propose, design, build, and measure prototype sensing solutions that demonstrate architecture feasibility.\n• Analyze design trade-offs and provide final design recommendations.\n• Design schematics and provide layout constraints for PCBs/FPCs.\n• Define calibration, test, and reliability requirements across the sensing-system supply chain.\n• Develop test and characterization software and scripts for verification.\n• Analyze engineering build data and assess process capability.\n• Perform failure mode analysis, root-cause diagnosis, and technical problem-solving.\n• Characterize, test, and verify sensing solutions.\n• Author clear and comprehensive hardware specifications and engineering build documentation.\n• Engage and collaborate with internal cross-functional teams to deliver state-of-the-art sensing solutions.\n• Manage external partners and suppliers, including providing engineering guidance on failure analysis and corrective actions.\n• Author executive communications pertaining to key development checkpoints.\n• Travel internationally to support product development.", "key_qualifications": "", "preferred_qualifications": "Strong background in board-level analog and mixed-signal circuits and/or embedded systems; hands-on experience in module-level design.\nProficiency in simulation tools (such as COMSOL/SPICE), scripting languages (such as Python/MATLAB), and statistical analysis software (such as JMP).\nAbility to independently drive technical issues to resolution, including coordinating efforts across teams.\nExcellent critical analysis, statistical analysis, and logic/reasoning skills. Excellent written/verbal communication, teamwork, and leadership skills. Direct experience with sensor design and integration.\nCross-functional experience in a high-volume production environment. Background and experience with automation for test and characterization.\nBS and a minimum of 3 years relevant industry experience", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557215"}