{"title": "Enterprise Account Executive, Major Accounts", "summary": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it! The US Enterprise team is responsible for building a balanced and scalable business that deliver tangible benefits to the end-customers. We believe the outstanding combination of portability, user experience, and data privacy and security, made possible through Apple’s coordinated hardware and software platform deliver the best solutions for our customers. We are here to help enterprise businesses transform the way people work while growing top-line revenue for Apple. To realize this goal, we gain deep understandings of the businesses we manage at all levels from tactical to strategic. We build a vision that can encourage customers to transform using Apple products. We collaborate closely with internal and external partners to build plans for solutions and new use cases, and then we help drive execution of the solution! This is a home-based role.", "description": "In this role you will: Deeply understand your assigned account’s business models by researching and exploring an ever expanding group of contacts. You will develop account plans aligned with our customers’ strategies, assess their progress and guide them on the journey of transformation to mobility, and growing adoption of the Apple ecosystem. Effectively execute on plans by cross-functionally partnering with Systems Engineers, industry specialists, as well as reseller and strategic partners. You’ll build demand generation activities, identify new opportunities, accurately forecast, and coordinate fulfillment logistics.", "key_qualifications": "Proven consultative selling experience in business transformation solutions for large enterprises that balanced delivering on short-term goals, while crafting sustainable value for customers, and demand for the future. Proven experience as an Account Executive selling to large Enterprises. Experience in cultivating C-level executive relationships at Fortune 500 companies. Comfortable challenging the status quo. Can demonstrate previous success with executive interaction. Strengths in relationship development/management, teaming across functions, deal making and negotiations. A strong self-starter who is able to work independently to develop new areas with ability to work in a dynamic, sometimes ambiguous environment. No matter the audience, you are very good at presenting. And, you’re cool under pressure. You make the complex simple and you command an audience by bringing them along for the journey. You support others to learn, to be curious and ultimately, share your passion for the Apple story. When challenged with complex questions, you share your deep knowledge of how our hardware, software and services integrate. You understand there are many moving parts in an organization. Navigating the interdependencies within Apple is needed for success. Understanding how business financials work, and strategies for sustaining profitable growth, are key to staying ahead of the competition. You analyze the market and think beyond the short-term. Apple doesn’t cut corners, in products or in business. You bring the highest level of integrity, honesty, and accountability in all that you do, every single day. You are a trusted advisor who does what you say you’ll do – and always does what’s best for Apple. You see the world through the eyes of the customer by deeply understanding their business needs, challenges, and concerns. At Apple, we obsess over how people experience our products and services. You not only meet our customers’ expectations, but you exceed them.", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "50% domestic travel", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200541151"}