{"title": "Site Technical Manager, iPad and iPad Accessories", "summary": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts! Imagine what you could do here!", "description": "Act as the dedicated technical program manager for a product and manufacturing site. Provide a link from manufacturing sites and internal partners for factory and product issues for the entire product life-cycle, from new product introduction to the product life, including supply continuity and refurbishment activities. Expedite closure of technical operational issues related to SMT, Final Assembly, Test and Pack to ensure consistent execution of the factories’ quality and production plans. Performs and implements the strategic direction, goals, objectives and key measurement systems to ensure the business goals are met.", "key_qualifications": "Demonstrated technical skills and experience, preferably wearable device, smartphone, personal computer, consumer electronics, networking or other technology-based industry sector, including a detailed understanding of final assembly, test, pack and SMT processes. Understanding of both ME and EE including RF/wireless technology of the product, able to deeply discuss technical issues with engineering teams like IE, ME, EE, TE, AME, etc. Dedicated in using process-driven and analytical approaches to problem-solving like Six Sigma, 8D, FMEA, etc. Bottom-line project management experience including planning, cost management and delivery. Proven strong communication skills, with the ability to drive closure to issues in a dynamic environment. Excellent problem solver, using structured problem-solving methodology to assign root cause, plus develop and implement corrective and preventative actions. Creates formal networks involving coordination among groups. Good spoken and written English with proficient Mandarin. Direct experience of working with product design, ME/AME design team a plus. Experience in RF & wireless technology in a factory environment is desired. Overseas working experience a plus.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience in Mechanical, Electrical, Electronics, Computer, Industrial or Manufacturing Engineering", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542136"}