{"title": "Senior Machine Learning Manager - Predictions", "summary": "At Apple, we work every single day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access new content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. We are looking for an ambitious individual who can thrive in an Agile environment. You will drive strategic outcomes through substantial innovation programs across multiple fields by leading the development and application of advanced techniques and algorithms to improve our ad network. You have, or will develop a deep understanding of the ad network behavior, and will work with business and engineering leadership to develop and prioritize an innovation roadmap across multiple technical domains. You will lead the function that conceives of, develops, and delivers state of the art capabilities that differentiate our products and are core to our business. We are looking for an exceptional hands-on machine learning (ML) manager who can thrive in a fast-paced environment. In this role you will oversee the strategy and development of our inference models to predict user interaction with our Ads. You will work closely with Product Management partners to build a roadmap and lead teams to propose, design and analyze new algorithms; detect meaningful data patterns and signals while adhering to our strict privacy policies; measuring user, campaign and app performance; and finally analyzing the results of extremely large-scale experiments. Your ability to be a great teammate under tight deadline constraints is key to success.", "description": "- You'll lead our prediction teams where you will be responsible for creating models to understand our user responses to ads - You'll work across several Engineering and Business teams to scale your deliverables and bring an improved user experience and monetization potential to our platform - You'll have the opportunity to work on a platform with extreme scale requirements - You should have experience developing and implementing ad algorithms, yield optimization solutions and marketplace data analyses within an ad network - You have excellent understanding of scalable architectures including operational concerns", "key_qualifications": "10+ years applying and leading teams that apply advanced statistical/ML methods and work with large, complex data sets, You can actively participate in investigations into multiple streams of ads quality data, and draw conclusions from data, recommend actions, You have experience in some of the following domains: Algorithms, Architecture, Artificial Intelligence, Database Systems, Data Mining, Distributed Systems, Machine Learning, Networking, Statistics, Game Theory, Auction Design, or other experience with rigorous Quantitative Analysis or Systems Software implementation, Practical understanding of the mathematics behind modern machine learning, linear algebra and statistics, You have experience developing and leading teams who develop in Python or Java, You are familiar with databases, SQL, and scripting languages, Proven ability to take requirements from design through to implementation both independently and with larger teams, You enjoy working closely with operational teams on deployment, monitoring, and management concerns, You actively manage performance of the team reporting to you and take responsibility to drive its outcome", "preferred_qualifications": "", "education_experience": "MS/PhD in AI/ML/Mathematics/CS or related field", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546433"}