{"title": "Product Manager - App Ads Signals, Ad Platforms", "summary": "At Apple, we work every day to create products that enrich people's lives. The App Store is a safe and trusted place to discover and download apps. We offer an innovative destination bring consumers amazing experiences that ensure the apps we offer are held to the highest standards for privacy, security, and content. Our technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content in a brand-safe environment, while supporting publishers and journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with captivated audiences. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone.", "description": "The Ad Platforms team builds privacy-first advertising products available globally, that delivers unparalleled experiences and value to consumers and app developers. We’re looking for a curious, analytical & collaborative technical Product Manager to form a deep understanding of Apple's privacy values and advertising objectives of app developers. Who can use those goals and values to inform their product strategy, and innovating on what powers Ad Platforms and our ML systems.\n\n- Product owner for signals, features, and transforms that power our prediction, relevance & retrieval models, and machine learning systems. Produce the insights and intelligence that fuels Ad Platforms\n- Define product features/enhancements and communicate requirements to engineering teams via clearly written requirements documents, diagrams, and concise verbal communication\n- Work closely with engineers to enable them to identify the critical path, prioritize and deliver upon requirements\n- Synthesize insights from research, customer meetings, platform engagement, and sales feedback to prioritize improvements and new feature ideas that'll deliver business goals and customer benefits\n- Collaborate with partner product managers and go-to-market teams on the relevant feature delivery strategy and plans", "key_qualifications": "3+ years of technical product management experience with at least one entire product development cycle from concept to launch\nExperience with Machine Learning systems and Prediction Modeling\nStrong technical and analytical abilities, including proficiency with SQL\nOutstanding written and verbal communication skills; ability to clearly articulate product's vision, product strategy and requirements to engineers and internal business partners\nExperience working closely with cross-functional teams and product stakeholders, to define and drive product strategy and roadmap\nAbility to build durable relationships, influence without authority, sell concepts internally, and actively drive decision-making across organizations\nSelf-motivated, thrives in a fast-paced environment with a high degree of ownership and accountability, and able to work efficiently to make continued progress on multiple priorities\nBachelors in Applied Mathematics, Economics, Computer or similar fields", "preferred_qualifications": "Experience with Machine Learning systems and Prediction Modeling on an advertising platform\nPrior work experience in Ad-Tech\nGraduate degree in Applied Mathematics, Economics, Computer or similar fields", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558563"}