{"title": "EMEIA Business Operations Analyst - 11months contract", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have envisioned - and now can’t imagine living without. Are you excited by the idea of making a real impact? Are you prepared to dream big? Then a career with Apple might be your dream job. We would love to hear from you! In this role, you will support our Business Operations function in collaboration with IS&T and all Operations Business Functions to triage and project managing all P1 systems issues. You will also drive RCA and Preventative measures (ensuring a 360 degree close the loop process) to further harden our systems, ensuring that we drive to our ambitious goal of Zero P1’s incidents. You will bring a strong customer service ethos, as well as superb communication and computing skills.", "description": "• Partner with our IS&T team to drive for a best in class Business Operations Systems support model.\n• Ability to learn how to triage and ‘go deep’ on systems issues, with a strong ability to uplevel, explain and communicate these complex issues to Senior Leadership.\n• Collaborate with IS&T to Implement an ambitious zero P1 goal.\n• Ensure all priority systems tickets are captured and triaged with key stakeholders in a timely and effective manner.\n• Manage each issue from creation through to resolution (followed by full root cause analysis and future preventative agreements with IS&T Partners).\n• Strong analytics skills, allowing for the analysis of P1 systems issues and trending. Strong follow through to drive for both Process and Systems change in these area’s.\n• Establish and maintain professional and open relations with wide ranging stakeholders.\n• Understand business needs and approach problems with creativity and new ideas", "key_qualifications": "No information available", "preferred_qualifications": "Experience in delivering supply chain technologies, a plus\nDegree in any of the following areas, Humanities, Business/Commerce, Project Management, Business Information Systems Information Technology, Computer Science, Math/Engineering or other relevant fields", "education_experience": "No information available", "additional_requirements": "No information available", "pay_benefits": "No information available", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553451"}