{"title": "Quality Assurance Engineer, Security Engineering & Architecture", "summary": "The Security Engineering and Architecture QA team is seeking a QA engineer with the ability to work in a fast paced environment, strong experience with developing tests and technical acumen. In this role you will work with other QA and Software Engineers, on and outside the team, to test various security projects.", "description": "The work will involve designing and implementing test plans for Security features. You will need to show abilities in communicating with both developers, Engineering Program Managers, other QA Engineers to build solid test plans, execute & report results. This role requires strong analytical skills, excellent problem-solving and interpersonal skills, and a passion to make the best products possible. Some of the key responsibilities in this role will include: Communicate frequently with managers and engineers across the organization. Create and get consensus on project plans and project concepts. Develop detailed and methodical tests. Work with engineering teams to deeply understand their technology and develop test plans around it. Debug and report issues encountered during testing. Help triage the team's daily automation results.", "key_qualifications": " ", "preferred_qualifications": "Additional Requirements\nTest Framework development experience a plus\nEXPERIENCE WITH OBJECTIVE-C AND/OR SWIFT A PLUS\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan. You'll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses - including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554531"}