{"title": "Apple Shop Leader (based in a retail partner store) - Istanbul", "summary": "Imagine, what you could do here? At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish.", "description": "We connect customers to Apple's solutions, and ensure delivery of outstanding Apple customer experiences within your store through close engagement and partnership across all levels of the Reseller store team. Educate and encourage Reseller store teams to stay knowledgeable on the latest Apple product and services portfolio. Run and grow the business in your store to achieve targets by analyzing results and sharing insights. Ensure Apple’s distinct dedication to merchandising perfection is delivered throughout your store.", "key_qualifications": "You are passionate, approachable and know how to connect with customers to deliver outstanding customer experience. You understand that to be effective, you discuss customers needs and values and how they intend to use Apple's products and services. You align all of this information and recognise that each customer is different. Apple does not cut corners, in products or in business. You bring the highest level of integrity, honesty, and accountability in all that you do, every single day. You know yourself, open to their feedback and relate well to all kinds of people. When faced with a challenging opportunity, you know who to connect with and when. People know you as a true collaborator who knows what it takes to win. You believe that communication is key to success. You actively listen and discuss the possibilities with customers and teammates alike. You know how to build advocacy with store staff and key partners within the store through communication, collaboration and training. You create excitement and support for the brand with partner staff. There are many moving parts in an organization and navigating the interdependencies within Apple is needed for success. Understanding how business financials work, and strategies for sustaining profitable growth, are key to staying ahead of the competition.", "preferred_qualifications": "", "education_experience": "University degree essential. Turkish Language required. Excellent English language skills preferred.", "additional_requirements": "Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529158"}