{"title": "Financial Analyst: Legal Finance", "summary": "Join the Apple Finance organization and make a positive impact on a company that is known for its impressive lineup of products and services. At Apple, we share in a commitment to excellence, all with one unified vision – creating innovative products that delight customers. Finance is about “fueling innovation”. We do this by hiring quality individuals with integrity, accountability, partnership, excellence, and analytical thinking. Apple’s Legal Finance team is looking for a highly motivated contributor who doesn’t shy away from asking the hard questions and making impactful changes. You will be responsible for the Financial Planning & Analysis (FP&A) covering a wide range of Apple’s Legal and Security teams which has a high degree of ownership over internal processes and unique exposure in working directly with Apple’s core leaders in those business units.", "description": "• Serve as FP&A lead for certain of Apple’s internal corporate legal and security business units. • Develop strong relationships and work directly with key attorneys and legal leadership to establish and manage monthly, quarterly, and annual budgets & forecasts. • Manage, build, and maintain complex models for quarterly close accruals, ensuring adherence to SOX requirements. • Develop analytics and other ad hoc reporting that provide meaningful insights associated with spend on legal activities and projects. • Monitor and review actuals to ensure correct accounting treatment and requesting journal entries when necessary. • Refine existing processes and modeling to drive more efficient and accurate expense monitoring, forecasting, and other reporting deliverables. • Maintain finance administrative hierarchies for budget and management reporting purposes. • Drive continued innovation across all aspects of the role by leveraging financial tools, systems, and collaborative working environments across different finance teams.", "key_qualifications": "", "preferred_qualifications": "Thorough understanding of accounting standards and financial analysis, with a strong analytical / problem solving background. Excellent verbal and written communication skills including the ability to articulate complex financial concepts and describe data in simple business terms. Strong data management skills, using both spreadsheets and databases. Experience with complex spreadsheets required. Ability to take ownership of processes, including introducing automation and other workflow improvements. Proficient in working with cross-functional teams across different levels of management. Strong prioritization skills with a proven track record of successfully and simultaneously managing multiple complex projects while under pressure and meeting critical deadlines. Familiarity with common financial and related systems, such as SAP, Business Objects, Workday Adaptive Planning, and Tableau. Familiarity with legal functions such as compliance, regulation, privacy, employment, etc. as well as security is a plus.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunities to progress as you grow and develop within a role. The base pay range for this role is between $107,300 and $161,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553671"}