{"title": "Spatial FaceTime Engineer - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "The Vision Pro Spatial FaceTime team is focused on building the Spatial FaceTime system experience on Apple's new visionOS platform. This team works on deeply integrating FaceTime & SharePlay on visionOS, as well as delivering the Spatial Personas experience that fosters real-time spatial collaboration and communication. As a member of our team you will help us in crafting future experiences that will delight, inspire and empower millions of people. We work mostly in Swift, RealityKit and SwiftUI to build both the 3D and 2D user interfaces and experiences for FaceTime on visionOS. Successful engineers will be prepared to work from the UI down to the networking, protocols and system integration layers.", "key_qualifications": "3-6 years experience in software development. Track record of building and shipping complex and delightful applications or user-facing systems on consumer platforms (mobile/gaming/etc.). Experience in modern software engineering practices (Object-oriented programming, functional programming, declarative user interfaces, test driven-development, etc). Excellent communication skills; ability to collaborate successfully with peers from diverse experiences and backgrounds. Experience using Apple frameworks and technologies (such as UIKit, Swift, SwiftUI, RealityKit, Core Animation, AVFoundation). Ability to work and partner with cross functional teams/ stakeholders.", "preferred_qualifications": "Interest or proficiency in augmented reality, and/or virtual reality. Interest or proficiency in spatial design, UI/UX design, and UX for AR/VR experiences. Experience with 3D math/linear algebra, 3D graphics, game engines. Rendering performance optimization experience. Experience with Unix development, daemons, cross-process communication, etc. Experience developing Unity/VR/AR applications and building 3D user interfaces.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553467"}