{"title": "AIML - Sr Data Scientist, AIML Data", "summary": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? The vision for the AIML Data organization is to improve products by using data as the voice of our customers. Within this organization the mission of the Search Analytics team is to inform product evolution through measurement, evaluation, and analysis of the user experience. You will partner with Search engineering teams to improve search quality and guide feature development with data, to deliver amazing search experiences across iPhone, iPad, HomePod, Mac, Watch, tv, across dozens of languages.", "description": "Research and develop evaluation methods to improve the quality of Apple user facing products, such as Siri and Search. Work with evaluation/experimentation engineering teams to get your methodological developments translated into technologies that product engineering will use every day. Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct analysis that includes data collection and quality control, requirements specification, processing and presentations. Build and prototype analysis pipelines iteratively to provide insights at scale. Develop comprehensive knowledge of product data structures and metrics, advocating for changes where needed for product development. Partner closely with product engineering teams on core machine learning algorithms and user experience evaluations. You should be passionate about building outstanding products. This position involves a wide variety of skills and innovation.", "key_qualifications": "Proficiency in data science, machine learning, and analytics, including statistical data analysis, A/B testing, prompt engineering and fine-tune foundational models for specific tasks. Experience crafting, conducting, analyzing, and interpreting experiments and investigations. Experience articulating and translating business questions and using statistical techniques to arrive at an answer using available data. Capable of driving projects of varying sizes and scopes - some will take months and some weeks — and you will need to know when to dive deep. Strong communication skills and the ability to naturally explain difficult technical topics (especially causal topics) to everyone from data scientists to engineers to business partners. Strong programming skills, including data-querying skills (SQL and/or Spark, etc.) and experience with a scripting language for data processing and development (e.g., Python, R, or Scala). 5 years of relevant work experience.", "preferred_qualifications": "", "education_experience": "Advanced degree in a quantitative field such as Statistics, Operational Research, Bioinformatics, Economics, Psychology, Computer Science, Sociology, Mathematics, Physics, or similar quantitative field.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200529784"}