{"title": "Learning & Development Facilitator  - Operations", "summary": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact and joining a team where we pride ourselves in shaping the future of our products with our learning solutions, a career with Apple might be your dream job… Just be prepared to dream big! The WW Sales Operations Support Learning and Development team is a fast paced, dynamic environment. We are looking for an experience L&D facilitator, can design, development and facilitate learning classes.", "description": "The L&D Facilitator is responsible for managing end-to-end learning solutions for the WW Sales Operations Teams, while driving and evangelizing innovative and effective approaches to learning. You will interact with various teams to gather requirements, develop project plans, create content and facilitate delivery to support the learning needs and opportunities across operations.  You will make a substantial impact by developing learner-centric experiences and aligning them to our business priorities. -Partner closely with x-functional teams: Supply Demand Management, Retail Fulfillment Operations, Reseller Operations, Product Launch Readiness, Logistics, Business Process Re-engineering and Strategic Data Solutions to develop and deliver best in class learning solutions that influence positive / behavioral change, align with strategic business objectives, and enhance individual and organizational capability. - Manage learning projects from needs analysis to deployment, considering the complexities of a diverse audience - Drive innovative approaches to L&D and guide policy/process improvements Measure, understand, and communicate the overall impact learning content has on business operations to the leadership of your assigned line-of-business - Support overall organization readiness and training programs for the roll-out of new tools, processes, and people development initiatives. - Lead the development and improvement of L&D Content/Processes and execute with exception quality, timeliness and attention to detail - High level of enthusiasm for working in cross-functional teams as well as autonomously", "key_qualifications": "Experienced facilitator that can move between soft skills and technical skills training\nSharp analytical skills with experience interpreting complex data for informed decision making.\nExceptional communication/facilitation skills, incl. interpersonal and influencing skills, with the ability to partner with key stakeholders, global counterparts, and executives in a matrixed environment.\nAbility to preserve and adapt under pressure, with positive and professional “customer-focused” attitude.\nProfessional project management experience, which includes end-to-end project/program management experience: conception and initiation, planning, execution, performance/monitoring, and project close.\nDemonstrated experience in creating highly technical training in a variety of application such as eLearning, on-demand, video-instructor-led-training (VILT), instructor-led-training (ILT), blended learning, job aides, etc.\nStrong ability to think strategically, execute tactically in a fast-changing environment.\nAbility to facilitate coaching sessions to multiple levels (teams members and managers.)", "preferred_qualifications": "", "education_experience": "A minimum of 3-5 years experience facilitating and designing training\nBachelor’s degree or equivalent experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.  Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551404"}