{"title": "Senior System Product Design Engineer - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something! Apple Vision Pro is a revolutionary spatial computer that seamlessly blends digital content with your physical space. It will allow us to do the things we love in ways never before possible — all while staying connected to the people around us.", "description": "Do you thrive on building solutions? Are you ready to explore a new domain with a talented team? We are the hands-on technical team that carries the design of Apple products through the entire process, from early prototyping to mass production! Our goal is to ensure the highest quality product for our customers. As a Product Designer on this team, you will be given ownership over the mechanical design of specific parts or modules within the product and will be responsible for the analysis, assembly, and reliability of these parts. In this role you will engage in frequent multi-disciplinary collaboration with teams like Industrial Design, Project Management, Materials, Manufacturing, EE, Display, Camera, Antenna, Battery, and more. You will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day.", "key_qualifications": " ", "preferred_qualifications": "History in leading teams, Experience driving technical discussions with ID and/or cross-functional partners, Experience in designing for ergonomics and comfort, Experience with light-weighting designs, Proficiency in NX", "education_experience": " ", "additional_requirements": " ", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation, and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554928"}