{"title": " iPhone PD Engineering Program Specialist ", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products!\n\niPhone Engineering Program Management is a collaborative team looking for a resourceful, energetic Engineering Project Specialist (EPS) to handle program logistics, materials, finances, and security. Have an understanding of complex Bills of Materials and documentation experience. Enclosure EPS must be able to prioritize issues and track the details, be a strong organizer, be a self-motived driver, ready to work with the Engineering Project Management and engineering cross-functional teams to take care of the risks associated with each engineering program build.", "description": "-  Work closely with product designers (PD), and engineering project manager (EPM) to create, structure and release Bill of Materials (BOM) for development builds, including part numbers, engineering change orders, and related technical drawings, and documents\n\n-  Manage material drive with upstream and downstream vendors to ensure materials arrive on time; including daily communication on changes\n\n-  Manage Purchase-to-Pay activities including the creation of purchase requisitions, maintain invoice tracking, create/maintain purchase order log/tracker, and provide approval for general receipts for small parts\n\n-  Partner with PD EPM to manage small parts budget and maintain budget accuracy\n\n-  Work on multiple projects simultaneously and manage competing priorities\n\n-  May require international travel!", "key_qualifications": "", "preferred_qualifications": "Knowledge of configuration management and experience in BOM structuring (preferably for hardware products)\nExperience with PLM tools\nAbility to influence, effectively communicate and drive deadlines with vendors (either CM or part vendors)\nAble to quickly learn new software, and stay up-to-date with internal tools\nAbility to react to re-set and changes in a very dynamic and time-sensitive environment\nStrong analytical and problem solving skills with excellent interpersonal and multitasking skills\nCombination of organizational, time/task management, and detail-oriented skills when working on multiple projects\nStrong and effective communication (written and verbal); able to work in a dynamic, large cross-functional team environment and embraces ambiguous situations and drives closure", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $112,900 and $234,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558254"}