{"title": "Senior Machine Learning Research Engineer", "summary": "The AI/ML - Machine Translation team is looking for exceptional researchers/scientists to develop the next generation of core MT technology to allow our users to communicate across language barriers. We have opportunities for both engineering and senior researcher roles.", "description": "Machine Translation is a critical technology that enables connecting people across language barriers. The Apple MT organization is responsible for the R&D of state-of-the-art approaches to MT as well as applications of this technology (e.g., Translate app, Safari web page translation and System-wide translation).\n\nWe are looking for research scientists and engineers passionate about applied research in the space of MT, investigating novel modeling and learning approaches and evaluation methods. As a member of the core modeling team, you will have the opportunity to work with a wide variety of language technologies and advance the edge of the MT technology to tackle real world problems. \n\nThe successful candidate should have excellent oral and written communication skills and a team player. Track record of impactful contributions to the field of MT or related fields preferred for senior researchers.", "key_qualifications": "", "preferred_qualifications": "Expertise in key language technologies including machine translation, large language model and natural language processing.\nProven background in machine learning and deep learning including neural machine translation, language modeling, sequence-to-sequence models, etc.\nHands-on experience with deep learning toolkits including JAX, PyTorch, Tensorflow, etc.\nAbility to formulate a research problem, design, experiment and implement solutions in C/C++/Java, Python, bash scripting, etc.\nExperience working with standard MT/NLP toolkits preferred, e.g. FairSeq, Marian, Sockeye, OpenNMT, etc.\nDesign and deployment of real-world, large-scale, user-facing MT or LLM systems preferred.\nExcellent spoken and written communication skills.", "education_experience": "Master (Ph.D preferred) in Machine Learning, Computer Science or related fields, preferably with a specialization in MT or Language Modeling.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557213"}