{"title": "Spatial and Fixture Designer", "summary": "Apple’s Industrial Design team is looking for a Spatial and Fixture Designer with experience in both architecture and industrial design. This role will focus on two areas: Fixtures, involving how our products are displayed in all Apple stores and third party partners, and secondly Spatial, overseeing design of new construction and modifications of design studios.", "description": "Our ID team designs all of our products and is heavily involved in manufacturing, packaging, and retail representation in stores as well. The Retail Designer will work with design leads on presentation and fixtures used to display our product on store tables, window displays and at launch events. They will drive the collaboration with Product Marketing, Visual Merchandising, Retail engineering, and Marcom teams for these projects. This unique position is critical to ensure that our products are represented in the best possible way in our stores and at launch events.\n\nThe Architecture aspect of this role manages the design of our studio locations. These are highly creative spaces, often with unique finishes and bespoke elements, facilitating the team to achieve their best work. This role helps ensure those unique needs are met by working closely with Apple’s Real Estate and Development team to drive complex construction projects, space redesigns, and the design of custom furniture while maintaining aesthetic continuity.", "key_qualifications": "Developing initial product, architecture, and new technology concept investigations through sketching, model building or renderings\nAbility to read architectural plans\nExperience and interest in working with designers and creative visionaries\nComfort with ambiguity and strong ability to self-direct", "preferred_qualifications": "", "education_experience": "Degree in Industrial Design or equivalent degree\n5+ years relevant experience", "additional_requirements": "Portfolio PDF required. Please send to designrecruiting@apple.com with “Spatial and Fixture Designer” in the subject line.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200542836"}