{"title": "CPU Physical Design and  Integration Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, thoughtful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! In this highly visible role, you will be at the center of a processor design effort interfacing with all disciplines, with a critical impact on getting functional products to millions of customers quickly.", "description": "As a CPU Physical Design and Integration Engineer, you will be participating in the physical design, integration, and verification of high performance, low power processor development. -  Full chip floorplan, area optimizations, block partitioning and pin placements -  Own chip level place and route (PnR), final CPU layout database construction and verification (PDV) -  Develop and validate Power Grid, including routability analysis -  Drive custom layout integration -  Work with the implementation/CAD teams during the entire chip design cycle to drive signoff closure for tapeout -  Work with SOC team to meet IP technical and delivery requirements -  Participate in establishing CAD and physical design methodologies -  Participate in flow development for chip integration and analysis -  Scripting to automate tasks and improve debug efficiency", "key_qualifications": "BS and 3+ years of relevant industry experience Experience with physical design, integration, and verification (PDV) experience on large processor and/or SoC designs Knowledge of industrial standards and practices in physical design, including floorplanning, partitioning, budgeting, place and route and physical verification Will be responsible for CPU floorplan, area optimizations, block partitioning and pin placements. Experience using synthesis & place-route tools Knowledge of low power design, physical construction, integration, PDV, DRC/LVS verification. Solid understanding of scripting languages, such as Perl/Tcl Solid understanding of CMOS circuit design. Layout design background is a plus Working knowledge of extraction, STA , EMIR methodology, and tools Ability to work well in a team, being an excellent problem solver, and self-motivated", "preferred_qualifications": "", "education_experience": "BS and 3+ years of relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200505003"}