{"title": "Senior Software Engineer - Apple Services Engineering", "summary": "Do you love solving complex challenges? Are you an inventive self-starter who takes pride in making ideas come to life on a global scale? Are you passionate about developing data platforms using creative algorithms to process petabytes of data with very low latency? If so, join the Apple Services Engineering Data Platform team to design and build a scalable data platform services that is used across Apple. As part of Apple Services Engineering, you will have a meaningful role in designing, developing, and deploying high-performance systems that handle billions of transactions daily. This enormous scale brings challenges that require extraordinarily creative problem-solving. We are looking for Engineers and Architects passionate about crafting data products. This role requires deep understanding of developing products that are highly scalable, highly available and fully fault tolerant.", "description": "We are building and supporting critical infrastructural systems and frameworks that provide and support services like structured and unstructured storage, caching, queueing, searching, querying, and much more. We are looking for a strong, enthusiastic developer to join as a member of this group. This person will have a tremendous amount of individual responsibility and influence over the direction of many critical Apple internet services for years to come. You are someone with ideas and a real passion for software delivered as a service to improve reuse, efficiency, and simplicity. This engineer’s work will affect the success of some of the most visible current and future Apple features.", "key_qualifications": "Coding experience in Java/Scala/Go, preferably with critical, large-scale distributed systems\nAbility to design large-scale, complex applications with excellent run-time characteristics such as low latency, fault-tolerance, and availability\n3+ years experience in data processing ecosystems\nUnderstands different data storage solutions with hands-on experience with working on fast OLAP database engines like Druid, Pinot, Clickhouse, Kylin, etc.\nUnderstands MPP Query Engines like Trino, Starrocks, etc.\nBachelor’s degree or Masters in Computer Science, Computer Engineering, or equivalent", "preferred_qualifications": "Experience with contribution to Open Source projects is a plus\nExperience in cluster management/orchestration software like Kubernetes, Spinnaker, Helm charts, Docker is a plus\nA learning attitude to continuously improve the self, team, and the organization\nDeeply concerned about excellence and quality\nLoves fast-paced environment and learning new technologies", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555331"}