{"title": "Systems Software Developer", "summary": "At Apple we tackle large scale engineering challenges to provide breathtaking, intuitive products to our users. To build, maintain, and extend the necessary architecture for these tasks, Apple is looking for an excellent Systems Software Developer like you. Algorithms, infrastructure, quality assurance, and reporting are tightly integrated, so you can expect to interact consistently with senior engineers and researchers. We are able to make reliable progress and deliver best-in-class products because we are committed to code quality, testability, and maintainability. We are looking for talented people like you to bring your knowledge and your passion to the team and share our pride with you", "description": "As a Systems Software Developer, you will work closely with cross functional teams to understand the project goals and develop automated solutions to achieve those goals. This would include building pipelines and tools to run tests or large scale ML model evaluations. You will be responsible for crafting and maintaining automation frameworks, debugging failures, and supporting our infrastructure.", "key_qualifications": "3-5 years experience in software development or related areas\nStrong practical knowledge of Python and shell is preferred\nFamiliar with source control management systems such as GIT\nExperience with designing, building and maintaining applications and systems with well defined APIs.\nExperience with frameworks like React / Redux / TypeScript, Node.js\nExperience with relational databases such as PostgreSQL or Redis\nStrong knowledge of software development lifecycle\nExcellent written and verbal communication skills\nAbility to manage multiple tasks and prioritize work accordingly\nAbility to work with other teams and groups\nExperience with AWS, Kubernetes, Docker is a bonus\nExperience with Swift Programming language is a bonus\nExperience with continuous integration (CI) tools such as Jenkins or travis is a bonus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551094"}