{"title": "Manager, Security Engineering Programs - ASE", "summary": "Apple Services Engineering (ASE) team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. This role involves leading a team of Security Engineering Program Managers to drive the development and hardening of the services and infrastructure that power Apple’s internal and external products.", "description": "We are looking for a Manager to lead a talented team of Security Engineering Program Managers that are helping secure the future of Apple’s cloud platforms and services. In this position, you’ll build a company-wide vision for how Apple secures its services and infrastructure, including hardening existing infrastructure, collaborating on new security initiatives, and designing new and secure system deployment.", "key_qualifications": "1. Strong security engineering capabilities and interests\n2. Experience managing a team of technical program/project managers responsible for security services and internal offerings.\n3. High-level of technical competency and hands-on experience collaborating with highly technical teams\n4. Proven track record in delivering programs and defining new strategic security initiatives across an organization\n5. Experience in modern cloud platforms and technologies\n6. Able to identify risks and drive execution to remediate them\n7. Strong relationship management skills\n8. Self-driven and results-oriented problem solver\n9. Outstanding presentation skills\n10. Highly driven to deliver secure services at Apple", "preferred_qualifications": "", "education_experience": "Bachelor's/Master's degree or equivalent work experience in project management or security engineering", "additional_requirements": "", "pay_benefits": "At Apple, base pay for this role is between $164,200 and $285,900. Apple employees are eligible for stock programs, comprehensive medical and dental coverage, retirement benefits, discounted products and free services, tuition reimbursement, discretionary bonuses, relocation, and more. Learn more about Apple's benefits at [this link](https://www.apple.com/careers/us/benefits.html).", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550728"}