{"title": "Global Security Specialist - Executive Protection", "summary": "This candidate will be responsible for performing all aspects of protective operations domestically and outside the United States. This person must be able to operate within a small team environment and will be responsible for ensuring the safety and security of designated individuals and assets. The ideal candidate will have a proven track record of providing discrete protective services, success working in a small team environment, maintaining strict confidentiality, and must possess strong communication skills. Position will require domestic and international travel.", "description": "-  Coordinate security related duties including, but not not limited to executive protection, secure transportation, safety/emergency planning, risk assessments, special event planning, etc.\n-  Prioritizes strategies through a holistic approach to security to anticipate, identify, and mitigate risk.\n-  Assist with planning, organizing, and executing discrete executive protection services.\n-  Skilled in being able to quickly collect, analyze, and disseminate information in a timely manner.\n-  Ability to work under stressful conditions and often times in ambiguous environments. Calm under pressure.\n-  Coordinate regularly with cross-functional team members, internal business units, and various service providers and agencies.\n-  Travel frequently, often on short notice, including globally.\n-  Regularly conducts advance operations and develops, implements, and audits internally/externally developed security p", "key_qualifications": "", "preferred_qualifications": "Bachelors degree with 5+ years experience in a corporate executive protection role preferred. Must understand and have demonstrated experience in protection concepts to include protective intelligence, secure transportation, contingency planning, counter surveillance, and have experience in international and domestic travel. Must possess strong written and verbal communication skills, collaborative abilities, and attention to detail. Working knowledge of physical security systems to include, but not limited to intrusion detection systems, CCTV, and other security related software/hardware. Technologically savvy. Should have strong computer skills and be proficient in the development of Keynote presentations. Must be self-motivated, able to work without direct supervision, and understand security concepts and theories. Adept at identifying and managing vendors for concurrent projects globally. As well as exceptional organizational, time management, and problem solving skills. Must be in good physical condition and capable of sitting, standing, and walking for extended periods of time. As well as capable of hiking/backpacking for several miles at a time in austere environments. Basic medical training preferred.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develope within a role. The base pay range for this role is between $170,200 and $255,400, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557965"}