{"title": "Digital Integration & Timing Engineer", "summary": "Come and join Apple’s growing wireless silicon development team. Our Wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. This is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We encourage you to apply if you enjoy a fast-paced and exciting environment, collaborating with people across different functional areas, and thrive during critical times.", "description": "As a Digital Integration & Timing Engineer, you will work in a team developing Wireless SoCs with custom hardware accelerators and multiple ARM-based sub-systems. You will have the opportunity to work closely with SoC architects and IP developers to develop SoCs that meet Apple devices' power, performance, and area goals. You will help define the processes, methods, and tools for designing and implementing these large, complex SoCs. Collaboration with multi-disciplinary groups will be needed to make sure designs are delivered on time and with the highest quality by incorporating accurate checks at every stage of the design process. In this highly visible role, you will be at the center of the ASIC creation effort, interfacing with all disciplines, with a critical impact on getting leading-edge products out to delight millions of customers.", "key_qualifications": "BS required.\nKnowledge of the entire ASIC design flow from RTL integration through synthesis, static timing analysis, scripting, P&R to tapeout.\nExpertise in STA tools and flow.\nUPF usage for power and voltage islands.\nHands-on experience in timing/SDC constraints generation and management.\nKnowledge of timing corners, operating modes, process variations, and signal integrity-related issues.\nProficient in scripting languages (TCL and PERL).\nLogic synthesis execution for efficient PPA using physically aware techniques in single-digit process nodes using Design Compiler, Fusion Compiler &/or Genus.\nProficient in the closure of end-to-end logic equivalence (FV, LEC) with functional ECOs in the mix.\nFamiliarity with DFT and backend related methodologies and tools.\nProficient with RTL Verilog/VHDL.\nKnowledge of digital top integration flows/methodology/checks.\nExperience with script-based tool automation, APIs and scripting languages for EDA tools, such as; Design Compiler, Genus, PrimeTime, etc.", "preferred_qualifications": "", "education_experience": "BS required.", "additional_requirements": "Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $58.61 and $88.29/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549020"}