{"title": "Manager, Administrative Services, Apple Services Engineering", "summary": "The Apple Services Engineering team builds products and services for our customers, and helps the rest of Apple do that too. We’re looking for an extraordinary Admin Manager to lead a team including Admin Leads, Admin Assistants, and Site Admins in global offices.", "description": "Managing a team of Admins across multiple offices, ensuring the team is meeting organizational needs and employees are supported in their growth & development Providing Executive Support including calendar management, scheduling travel, budget management and event coordination Driving adoption and measuring the impact of standard Admin process across the organization Managing office space, including floor plans, supplies, facilities & maintenance requests Enabling effective communication across the organization Building partnerships with other Admin leaders, to develop consistent standards and best practices for the organization Establishing good relationships with partner teams in Business Operations, Space Planning, Finance and Facilities", "key_qualifications": "5 years experience supporting executive or director-level teams, preferably as part of a technical organization 5 years direct people management experience A self-starter, able to utilize good judgment to make appropriate decisions The ability to multitask, remain calm and confident during stressful situations Curious, flexible and a dedicated problem solver Able to build collaborative partnerships across multiple job functions and levels, be a strong team player Phenomenal attention to detail, accuracy, and timeliness Strong sense of professionalism; able to work autonomously on assignments and handle sensitive and confidential information with integrity and discretion Proficiency with iCal, Keynote, Mail, eApproval, Quip, Box, Confluence, and other OSX based office systems a plus", "preferred_qualifications": "", "education_experience": "3 years experience. AA/AS degree is required. A BA/BS degree is preferred.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $125,400 and $188,000. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. Apple also provides benefits such as comprehensive medical and dental coverage, retirement benefits, discounted products and free services, reimbursement for certain educational expenses, discretionary bonuses or commission payments, and relocation assistance.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548302"}