{"title": "Architect - Ad Platforms", "summary": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that encourage the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.! At Apple, we work daily to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote their work. Today, our technology and services power advertising in Search Ads in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy. We are seeking an experienced software architect/senior engineer who is passionate about creating high-performing, scalable, well-designed capabilities/services that are the foundation for critical internal and customer-facing platforms at Apple. As a technical lead, you will take ownership of a solution from beginning to end and deliver great software to help accelerate the delivery within the App Store, Apple News, and other platforms. The Engineering Services team designs and builds best-of-breed capabilities for taking care of our complex and ever-growing product needs. The team is responsible for capabilities that are used by thousands of advertisers, publishers and developers and has high transparency in the mobile advertising space.", "description": "Engineering Services team is a diverse, global, agile engineering team that moves inquisitive and fast by consuming and optimising readily available technology, collaborating to improve and scale capabilities across businesses and use cases, and sharing our innovative solutions so everyone can benefit. We are not constrained by organisation structure and offer flexibility to work on a variety of backend systems, and we have fun doing it! We are looking for someone who will: - Build & own shared capabilities like Reporting, Audit, Workflow engine(s) etc to support internal and external partners across multiple products - Collaborate with product to build new features & capabilities that have extreme scale and performance requirements - Design and develop secure and scalable back-end systems that deliver key business data to ad servers and big data pipelines - Engineer secure and scalable distributed data processing systems that generate data required for online content-serving systems.", "key_qualifications": "14 or more years of industry experience building scalable microservices or platforms, Strong computer science fundamentals, Strong experience with Java or equivalent, Experience crafting scalable microservices, Experience in Cloud technologies (e.g AWS), Proficiency in distributed systems and architecture, Demonstrated ability to work on sophisticated problems and systems, Strong problem-solving and debugging skills, It is good to have DevOps tools knowledge i.e Kubernetes / Terraform, Have the ability to communicate optimally, both written and verbal, with technical and non-technical multi-functional teams across multiple geos, A desire to work in a fast-paced and challenging work environment, Experience in the Ads domain is a plus", "preferred_qualifications": "", "education_experience": "Bachelor’s or Master's degree in Computer Science, Computer Engineering or related technical field will be preferred", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539973"}