{"title": "SAP FICO Project Manager, Enterprise Systems", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!  Apple's SAP Global Systems organization has an immediate opening for a senior SAP BRIM or FICO functional project manager who has the right mix of SAP functional, technical and project management skills to enthusiastically deliver global & complex projects in Apple's fast-paced environment.", "description": "As the SAP Project Manager, you will need to have extensive experience in running mid to large sized SAP projects in the subscriptions and finance domains. You will have experience in design and configuration of the SAP FICO or FICA or BRIM modules as a member of Global Organization. Responsibilities include: Working with the business users to define scope and acquire business requirements Developing conceptual and detailed designs to meet business needs and that can scale to handle Apple future needs Performing vital SAP configurations, writing detail specifications for development of custom programs, interfaces Support testing of the solution and enable implementing the automated testing solutions. Prepare technical project cutover plan highlighting cross-system object dependencies. Incorporate performance engineering concepts to optimize response time, throughput and scale with peak volume tests. Leading SAP projects, prioritizing work and coordinate multiple projects in parallel Overseeing the project timelines, budgets, resource prioritization, scope and definition", "key_qualifications": "SAP Project Manager with extensive experience in managing mid to large sized SAP projects. 5+ years of SAP FICO or FICA or BRIM experience including: Multiple SAP FICO or SAP FICA or BRIM full life cycle implementations experience Proven track record of successfully delivering finance projects on time, working with various internal and external teams Past consulting and or professional services experience is preferred Experience in directly managing a global and diverse team Ability to drive the project forward with a sense of urgency Finance business process integration experience Digital Media / subscriptions process experience is highly desired Strong written communication skills including business and functional requirements, management level presentations and proposals presentation Excellent verbal communication and negotiation skills, in addition to the ability to deal effectively with ambiguity and drive consensus with key constituents Responsibilities include working with the business users to define scope and gather business requirements, providing conceptual and detailed designs to meet business needs, performing necessary SAP configurations, writing detail specifications for development of custom programs, testing and implementing the automated solutions Leading SAP projects, prioritizing work and coordinate multiple projects in parallel", "preferred_qualifications": "", "education_experience": "Bachelors Degree in Computer Science, Management Information Systems or equivalent work experience is preferred. Project Management degree or certification is a plus.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550702"}