{"title": "Pedagogy Project Manager", "summary": "Seeking a passionate educator who loves to innovate and inspire! The Apple Developer Academy and Foundation Program are innovative learning programs designed to support learners to become proficient in all aspects of App Development: UI/UX, Business and Presentation Skills, Coding, Analysis, Testing and more.", "description": "Manage the Apple Developer Academy and Foundation Program and project plan on behalf of Apple by ensuring timely execution and quality of the teaching and learning experience. Provide coding/design/professional skills advice to educators learning about the apps development cycle on the Apple ecosystem. Provide guidance and consultation on curriculum design, Challenge Based Learning framework and other key pedagogical concepts of the Apple Foundation Program learning experience. Collect, track and monitor evidences of learning, pedagogical data, student stories and program impressions of both programs. Contribute to the ongoing development of the curriculum, and cross-pollinate promising practices amongst both the Foundations and Academies. Be the regional curriculum lead for both Academies and Foundation—in particular coding and design skills. Identify learning needs on all aspects of the software development cycle; enroll and liaise with Apple or external experts to address such learning needs. Support local project managers by providing tech and design guidance on administrative projects related to both the foundation and the academy.", "key_qualifications": "Expertise in either Coding, Design, or professional skills in the context of Apps development on the Apple Ecosystem. Knowledge and practice of Swift and iOS frameworks a plus. Solid background in developing and delivering training and curriculums on subjects related to apps development and creativity. Demonstrated success in curriculum consultation and instructional design support. Experience in team motivation, conflict facilitation, and individual mentoring. Experience in Challenge based learning or other enquiry based learning framework a plus. Strong collaboration and interpersonal skills—works well across teams internationally. Proficiency in English is required (read/write/verbal); frequent communication with International partners is required. Excellent communication and presentation skills both externally and internally. Ability to analyze data, documentation, and communicate key findings to different stakeholders. Willingness to travel for business (up to 40%) as needed to complete the above requirements. Self-starter mentality who can work individually without direct supervision, and is comfortable with remote management. Consultation fluency in English and Bahasa Indonesia", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552874"}