{"title": "AIML - Sr Machine Learning Engineer, Data & Machine Learning Innovation", "summary": "As part of Apple's AI and Machine Learning org, we inspire and create groundbreaking technology for large-scale ML systems, computer vision, natural language processing, and multi-modal understanding. The Data and Machine Learning Innovation (DMLI) team is looking for a passionate Machine Learning Engineer to explore new methods, challenge existing metrics or protocols, and develop new insightful practices that will change how we understand data and overcome real-world ML challenges.", "description": "As a Machine Learning (ML) Engineer, you will be entrusted with the critical role of innovating and applying state-of-the-art research in ML to tackle sophisticated data problems. The solutions you develop will significantly impact future Apple products and the broader ML development ecosystem. You will work with a multidisciplinary team to actively participate in the data-model co-design and co-development practice. Your responsibilities will extend to the design and development of a comprehensive data generation and curation framework for foundation models at Apple. You will also be responsible to create robust model evaluation pipelines, integral to the continuous improvement and assessment of foundation models. Additionally, this will entail an in-depth analysis of multi-modal data to underscore its influence on model performance. You will have the opportunity to showcase your groundbreaking research work by publishing and presenting at premier academic venues.", "key_qualifications": "5+ years of demonstrated experience with developing and evaluating ML applications, and in understanding and improving data quality. Expertise in natural language processing, search and recommendation, and machine learning with a passion for data-centric machine learning. Solid understanding in large language model domain. Staying on top of emerging trends in generative AI and multi-modal LLM. Strong programming skills and hands-on experience using the following languages or deep learning frameworks: Python, PyTorch, or Jax. Strong problem-solving and communication skills", "preferred_qualifications": "", "education_experience": "Ph.D/MS degree in Machine Learning, Natural Language Processing, Computer Vision, Data Science, Statistics, related field; or equivalent experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $175,800 and $312,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540664"}