{"title": "Health Sensing ML Engineer", "summary": "The Health Sensing team builds outstanding technologies to support our users in living their healthiest, happiest lives by providing them with objective, accurate, and timely information about their health and well-being. As part of the larger Sensor SW & Prototyping team, we develop algorithms for a variety of health sensors, including PPG, accelerometer, ECG.", "description": "In this role, you will be at the forefront of developing ML algorithms for health sensing applications and ensuring the efficient evaluation of these models to be in production at scale. You will be interacting closely with ML engineers, clinicians, software and hardware engineers. You will be delivering solutions on time and with high quality standing up to the standards considering a customer facing product.", "key_qualifications": "Proven experience in developing machine learning and deep learning models, preferably in the health domain\nStrong proficiency in Python and ML frameworks e.g. PyTorch, Tensorflow\nExperience with health data analysis, including time-series data, sensor data, and biomedical signal processing\nSolid understanding of data preprocessing, feature extraction, and model evaluation techniques\nFamiliar with software development standard methods/collaborations\nSufficient SW skills to run large ML training jobs efficiently on a distributed backend with large volume of data\nExcellent interpersonal skills; comfortable in a collaborative and ground breaking research environments", "preferred_qualifications": "Responsibilities:\nDevelop and implement machine learning and deep learning models using health sensing data\nAnalyze large-scale health data from wearable sensors to extract meaningful insights\nWork across the entire ML development cycle, from setting up data pipelines to model evaluation\nAnalyze model behavior and finding weaknesses; drive design decisions with in-depth failure analysis\nBuild end-to-end pipelines that prioritize rapid iterations in support for reliability of a complex multi-year project\nWork cross-functionally to bring algorithms to real-world applications; this can span a wide range of teamworks with clinical authorities and engineering specialists across HW and SW\nMS or PhD with 3+ years industry experience", "education_experience": "BS and a minimum of 3 years relevant industry experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200546473"}