{"title": "Software Engineer", "summary": "At Apple, extraordinary ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple's Global Business Intelligence (GBI) team is seeking an experienced Software Engineer to build high quality, scalable and resilient distributed systems that power Apple's analytics platforms and data pipelines. The ideal candidate for this position will be able to think outside of the box and should have passion for building engineering solutions to enable business in making time sensitive and critical decisions. If you feel this is you, we'd love to hear from you!", "description": "We engineer high-quality, scalable and resilient distributed systems on cloud that power data exploration, analytics, reporting and production models. On our team you will build solutions that integrate open source software with Apple's internal ecosystem. You will drive development of new components and features from concept to release: design, build, test, and ship at a regular cadence. You will work closely with internal customers to understand their requirements and workflows, and propose new features and ecosystem changes to streamline their experience of using the solutions on our platform. This is a true software engineering role, where a large part of an engineer's time is spent in writing code and designing/developing applications on cloud, with the remainder being spent on tuning and debugging codebase, supporting production applications, and supporting our application end-users. This role requires in-depth knowledge of brand-new technologies and cloud data platforms with the skills to independently learn new technologies and contribute to the success of various initiatives.", "key_qualifications": "Knowledge of BI concepts and implementation experience on Cloud with databases like SnowFlake, Big Query, Cloudera. Understanding of fundamentals of object-oriented design, data structures, algorithm design, and problem solving. Programming experience in building high quality software. Proficiency in at least one of the following programming languages - Python, Scala or Java. Experience in multi-threaded, concurrent programming and synchronization. Cloud technology experience on platforms like AWS, Microsoft Azure, Google Cloud. Experience developing Big Data applications using Java, Spark, Kafka is a huge plus! Hands-on knowledge of Spark cluster-computing framework & Kubernetes or similar containerization technologies. Experience in Enterprise-ready Cloud Data-Warehousing platforms like Snowflake is highly valued. Strong hands-on experience in designing and development of cloud-based applications that include large scale compute services, database services, APIs to design RESTful services, ETL, queues and notification services. Demonstrate knowledge and experience in Software Engineering processes, including test-driven development. Excitement for Agile methodologies and continuous delivery of software. Secure and skilled at working in tandem with a team of engineers, or alone as required. Ability to see the bigger picture impact of decisions.", "preferred_qualifications": "", "education_experience": "Bachelor's degree in Computer Science or equivalent experience", "additional_requirements": "Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200539726"}