{"title": "Digital Consumer Experience Producer - Beats", "summary": "At Beats by Dre, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish. We're growing and urge you to apply. We believe the role would place you in a highly-energized environment with some of the most hardworking creative individuals in the industry where you would be inspired to share your years of experience along with providing extraordinary support for the team.", "description": "This person will lead digital content innovation & production efforts to fuel the growth of Beats Digital Commerce worldwide. Lead Digital Commerce CX planning for both Direct (beatsbydre.com) and Channel (Amazon, Target, etc.) Manage the optimization of existing digital experiences such as PDPs (product detail pages), category pages, home pages, brand stores. Lead design explorations as we look to enhance the buying experience on beatsbydre.com and apple.com to drive the D2C business. Works closely with business and strategic leads to develop content used as part of our digital test & learn program...", "key_qualifications": " ", "preferred_qualifications": "A keen eye for design (although this role will not be directly designing), A high degree of accuracy, attention to detail and the ability to process information quickly and in a manner that is consistent with existing procedures. Ability to work well under pressure with tight and changing deadlines. Positive attitude, self- motivated, self-starter confident to take the initiative and carry out duties with minimal supervision but still adhere to process...", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $137,100 and $206,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs...", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554264"}