{"title": "Wireless Radio Digital Verification Lead", "summary": "Apple's growing wireless silicon development team is responsible for developing the next generation of wireless silicon! In this role you will be responsible for ASIC pre-silicon verification of extremely complex high performance Wireless Radio digital controllers, Radio sub-systems and Radio integration. You will develop leading edge testbenches, enhance advanced methodologies, develop verification plans, debug functional tests, and utilize coverage analytics. You will be in the center of the organization impacting and influencing many cross-functional teams.", "description": "In this role you will lead critical verification of the Radio digital sub-system including radio controllers, radio system scenarios and radio integration activities. You will lead, architect, and develop new testbenches, environments, and scenarios for next-gen wireless technology. You will collaborate with many cross-functional teams including Design, RF, Systems and more to review specifications and architecture, extract features, and define verification plans. You'll drive coverage analysis and closure, and collaborate with / support digital + mixed-signal co-simulations using SystemVerilog analog behavioral models.", "key_qualifications": "", "preferred_qualifications": "Knowledge of ASIC verification flows with SystemVerilog / UVM\nExperience developing testbenches from scratch, bringing up designs, constrained randomization, coverage closure, and scripting\nExperience with integrating and debugging failures involving digital mixed signal models is necessary. Exposure to DSP / cmodels a plus\nExcellent communication skills and ability to work / align with many cross-functional teams including design, radio, systems, phy, modeling\nExposure to wireless protocols such as WiFi / 802.11, BT, Cellular, etc a plus.", "education_experience": "BS with 10+ years relevant experience required. MS preferred\nExperience in technically leading a cross-functional team across multiple generations of ASICs\nExperience in working with complex Digital<->Analog interfaces and protocols is a must. Experience in PLLs, DACs, ADCs is nice to have", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $207,800 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556659"}