{"title": "Device Services - Lab Engineer", "summary": "The Device Services (DS) Infrastructure team is seeking a results driven and meticulously organized lab engineer. We manage a fleet of thousands of Apple devices used in a centralized, automated test system which is a critical tool used by engineers developing for iOS, watchOS, tvOS, and macOS. This position will provide the opportunity to work with the latest Apple hardware and software and be part of a rapidly growing organization. In this position, you will be responsible for supporting lab automation used by Software Engineering testing code changes to components.", "description": "We are looking for a motivated and service oriented individual, who loves working on infrastructure. You must enjoy working on multiple concurrent projects in a fast-paced environment that fosters growth, teamwork and innovation. Some of your day to day actives will include: - Maintaining a fleet of thousands of iOS/macOS devices and peripherals across multiple labs- Ensure devices and systems are up and available for testing- Provisioning and deployment of released/unreleased hardware- Debugging and trouble shooting device hardware/software failures- Developing scripts and automation for managing machine configuration and software deployment- Provide support to engineering in debugging systems", "key_qualifications": "5+ years experience administrating software services in Unix environment and automated provisioning of systems, Experience with shell scripting or Python, Knowledge of Puppet, Ansible or other configuration management tools, Familiarity with Git or other source control systems, Excellent communication skills are a requirement due to the high level of interaction with engineering teams, management, and other organizations within Apple, Creative thinker and strong problem solver with meticulous attention to detail", "preferred_qualifications": "Experience working in fast paced engineering environments, Experience working with RESTful services, Core understanding of LAN network infrastructure, Experience with common data center infrastructure (HVAC, power distribution, copper and fiber cabling, rack types and capacities etc…), Experience with using/administrating macOS, iOS", "education_experience": "BS degree in technical field, such as Computer Science or Engineering or equivalent work experience", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $248,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200557492"}