{"title": "Integration Manager, Enterprise Technology Services", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.", "description": "Apple eBusiness Services team is looking for an exceptional software engineering leader to guide the development of innovative and scalable integration solutions using various integration technology stacks. This is an opportunity to help a team of bright engineers to build solutions and participate in shaping our platform roadmap. This team expects and encourages engineering excellence. Come join us in crafting solutions that will delight our customers. As manager of the team you’ll have the opportunity to work with experts in their field to build integration solutions for Apple business teams. This position requires a self-motivated individual with strong technical, communication, and project management skills to handle responsibilities including:", "key_qualifications": "Empty", "preferred_qualifications": "Deep understanding of different partner types in the Supply chain domain and their business processes; Hands on experience in working with industry standards like EDI X12, XML, JSON and API’s; Architect solutions that enable business processes and simplify integration between Apple and our partners using middleware technologies or Java based apps; Experience in handling sensitive customer data like PII, SSN and other sensitive PCI data; Define and grow a diverse and world class engineering team; Outstanding communication skills and Proven ability to manage projects with on-time delivery and working experience in Agile development methodology; Demonstrated capability in partnering with businesses to conceptualize ideas and solutions to solve business problems; Knowledge in middleware technologies like Software AG Web-Methods, Mulesoft; AI / ML implementation experience is a plus; Results-oriented and demonstrates the high degree of ownership and accountability; Creative problem solver and consummate collaborator, who thrives in a fast-paced, innovative environment; Handle ambiguity and solve problems despite uncertainties; Track record demonstrating the ability to build a diverse and strong team – attracting, hiring, retaining, motivating the best talent", "education_experience": "Empty", "additional_requirements": "Empty", "pay_benefits": "Empty", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554054"}