{"title": "Advanced Manufacturing Engineer - iPad", "summary": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people here at Apple we don’t just create products — we create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.", "description": "Responsible for designing precision assembly and measurement processes for Apple products. Perform the research and development on new technologies vital to tackle complex assembly and automation problems that have direct impact to the quality and delivery of Apple products. Design, implement and successfully scale automated and semi- automated solutions based upon sound engineering principles and the technologies developed for a specific application. ...\n{Detailed Description Continued}", "key_qualifications": "Strong work experience in precision assembly, inspection and automation equipment\nRequired to understand and build tolerance analysis for parts and assemblies....", "preferred_qualifications": "", "education_experience": "SME or equivalent. 3 plus years in an engineering role with experience in automation equipment used for alignment, assembly and/or measurement of components.", "additional_requirements": "-  New product introduction and Manufacturing Operations experience desired\n-  Proven track record of cost reduction, project management and engineering design required\n- Strong understanding of GD&T principles favorable. NX, SolidWorks CAD or ProE experiences a plus. JMP, Minitab & Six Sigma experience preferred\n-  Knowledge of optics principles as they relate to CCD cameras, 2D and 1D lasers, and their use for positioning and critical alignment machines\n{Continued Additional Requirements}", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551016"}