{"title": "Retail Support Specialist - Retail Customer Care", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. At Apple, you’ll share in a commitment to excellence by delivering best in class customer service. We value integrity, personal accountability, teamwork, excellence, and innovation. Join Apple, and help us leave the world better than we found it!", "description": "You will provide post-sales support for Apple's ever changing line of products and services including new ways to buy and new types of products. To do this, you will receive a variety of tasks related to customer queries and orders. These tasks evolve with time and require the use of a variety of systems and tools. Examples of tasks include: - create and maintain orders, credits, debits, returns - resolve billing blocks and payment related issues - resolve VAT and tax related issues - initiate and support shipping related investigations and issues - create and maintain accounts and custom stores for small and medium businesses - perform customer outreach and outreach to business sales teams in retail stores during issue investigation and resolution", "key_qualifications": "Passionate about creating best in class customer experience\nExcellent communication skills, both written and verbal\nMaintains a critical attention to detail\nDemonstrates resourcefulness, adaptability, and flexibility\nExperience with SAP and Excel\nBelieves in the power of a team; strong team player mindset\nLearning agility - ability to adjust to changing policies and procedures as well as new systems and workflows\nAt ease with using multiple applications and demonstrates high computer literacy\nCritical thinking & sound judgment\nAdvanced problem solving skills", "preferred_qualifications": "", "education_experience": "Bachelor’s Degree or equivalent work experience preferred", "additional_requirements": "- Experience in Contact Center Preferred\n- Comfortable to use English in business scene. (Reading&Writing is required, speaking is a plus)\n- Our customers require support 7 days per week, with morning and evening hours, including holidays. Schedule flexibility is a requirement.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552865"}