{"title": "Haptic Sensor Test Engineer", "summary": "“Quality is not an act, it is a habit.”  - Aristotle\nDo you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? At Apple, quality is built into our DNA. As test engineers, our objective is very simple, building optimized test solutions to deliver the greatest products with no compromise!\nSensing Technology empowers Apple products with revolutionary features, such as TouchID, FaceID, Taptic Engine & TrueTone Display. The Sensing Test Engineering group is looking for an exceptional and multidisciplinary test engineer with responsibilities of research, design, development of complete test solutions for the mass production of various sensing hardware across Apple’s product lines.", "description": "Work with cross-functional teams to define the test methodology and coverage for various sensing hardware\nDesign, build and deploy test station together with manufacturing partners and overlook manufacturing test development for new and/or existing hardware design.\nReview vendor DFM and drive issues resolution with preventive measures or design improvements.\nProvide test software development/test fixture development and be responsible for test readiness and execution.\nLiaise with both the internal team and the external partners to optimize test system to meet Apple's quality standard for high volume production", "key_qualifications": "3+ years of relevant test development experience. Prior exposure to consumer electronics test station design would be a plus\nMechanical expertise for test fixture design with good understanding in 3D & 2D CAD including DFM, DFMEA, GD&T & Tolerance Analysis\nProficiency in programming languages such as C/C++/Python for test script design and algorithm implementation\nStrong FA capability to troubleshoot complex technical issues, identify root causes and propose effective solutions\nFundamental EE/PCBA and debug skills\nData analysis through JMP or other software\nExcellent written and verbal communication and leadership skills\nTeam Oriented: be able to thrive in a collaborative multi-functional environments and respond in a timely manner\nKnowledge in noise and vibration engineering would be a big plus\nFrequent travel to the supplier factories", "preferred_qualifications": "", "education_experience": "BS / MS Computer Science, Electrical Engineering or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551030"}