{"title": "Data Scientist — Services Finance Data Science and Engineering", "summary": "Services Finance Data Science and Engineering team is looking for a passionate and highly motivated data scientist. You will provide a key function in shaping the success of Apple’s current and future products. As members of the Services Finance Data Science and Engineering team, we work with various business and engineering teams to understand current and future business initiatives. We need to be persistent and flexible in extracting data from various sources, cleaning and curating this data, and then clearly and concisely communicating insights.", "description": "In this role, you will be responsible for developing descriptive and predictive data products that provide decision support for many business units and initiatives across Apple. A successful data scientist will be skilled in taking a business problem and translating it into a data science solution. ", "key_qualifications": "N/A", "preferred_qualifications": "Experience with building statistical and/or machine learning solutions to solve business problems, Experience with data wrangling and working with large datasets, Experience working in a cross-functional team, willingness to solicit input and accept feedback, Creative and curious thinker. Ability to translate business problems into data requirements, Strong written and verbal communication skills, capable of explaining technical results to a non-technical audience, Familiarity with time series modeling and forecasting, bayesian modeling, or anomaly detection, Experience accessing and building various endpoints (e.g., REST APIs) and accessing databases (e.g., Postgres, Spark, Snowflake), Experience working with relationship databases (e.g., BigQuery, Snowflake, Postgres), object storages (e.g., S3), and flat files (e.g., Arrow, Parquet), Experience with scheduling systems (e.g., Github Actions, Airflow, Jenkins), cloud environment (e.g., AWS, GCP) and CI/CD tools and containers for streamlining work at scale (e.g., Kubernetes), Experience with building interactive data visualizations, strong storytelling skills (e.g., Shiny, Dash, Streamlit, D3, Tableau, ggplot2, plotly), and reports (e.g., Quarto), Experience with shell scripting (e.g., bash), Experience in coding in multiple source editors (e.g., VSCode, RStudio, Dataiku), Well-organized and self-motivated. Comfortable advancing multiple priorities at once on tight schedules, Masters or PhD degree preferred", "education_experience": "N/A", "additional_requirements": "N/A", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $136,300 and $205,500, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556907"}