{"title": "Image Sensor Architect - Camera Hardware (m/f/d)", "summary": "Do you love taking on big challenges that require exceptionally creative solutions? Do you deeply understand how an incredible camera experience should work? As part of our Camera Technologies group, you’ll help design the innovative technology that allows each generation of Apple products to produce photos even more incredible than the last. You’ll design and develop groundbreaking ideas for everything involved in our camera systems, from sensor to lens. You’ll collaborate with teams across Apple to research, design, develop, test, and qualify camera hardware for Apple products. Together, we’ll craft a magical photography experience that redefines what millions of customers can expect from their cameras. The Camera Hardware team develops innovative camera solutions and technologies for Apple’s products, including the iPhone, iPad, MacBooks, and more! The key goal of the team is to enable the world’s best camera experience for our customers. New challenges arise every day that require the sharp problem-solving skills of versatile and thoughtful individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation!", "description": "-Work multi-functionally to architect and develop digital control and processing HW architectures for novel camera sensors & systems -Evaluate problem space to determine key system requirements -Evaluate solution space including system constraint discovery to identify creative architectural implementation approaches -Develop & drive chip level architecture specifications through the implementation phase -Participate in system integration tasks with multi-disciplinary teams.", "key_qualifications": "", "preferred_qualifications": "Knowledge of image sensor manufacturing technology, image sensor performance metrics, image sensor usage and integration into camera systems is preferred Being familiar with general industry trends and technical challenges for high performance and low power imaging sensors Ability to methodically derive design and verification requirements from design specifications and drive design activities toward compliance to requirements Excellent written and verbal communication skills and solid collaboration and leadership skills Experience in algorithm development and signal processing data-path design or Neural Network processing is a plus. Experience in secure hardware development and hardening against physical attacks is a plus. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559769"}