{"title": "GNSS System Validation Engineer", "summary": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solving problems? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. Our GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy-efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications.", "description": "Develop automated test frameworks for GNSS Measurement Engine (ME) validation. Test plan preparation, design, develop and complete test suites, generate race chart. Quantify functional, stress, and key performance indicators of GNSS ME firmware. Writing test FW to validate the SoC. Debugging and reproducing the HW and FW issues with primary analysis. Generate detailed test reports for performance and functional tests. Collaborate with the system, FW, verification, FPGA, test automation, and multi-functional teams. Carry out board testing in the lab. GNSS field testing and data collection.", "key_qualifications": "Experience in wireless SoC or system validation. Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization. Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG. Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc. Experience with version control (Git) and issue tracking tools (JIRA). Validation knowledge of wireless system, digital signal processing, and statistics is preferable. Strong Python programming required, C/C++ and other scripting preferred. Experience in hardware design, verification, board design, FPGA, schematics/layout is a plus. GNSS/Cellular validation experience preferred. Strong written and verbal communication skills. BS + 3 years of relevant industry experience.", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years of relevant industry experience is required. BS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $135,400 and $250,600, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551496"}