{"title": "Software Engineer, Developer Triage Tools", "summary": "As a software engineer on the Customer Feedback team, you will primarily be responsible for designing, developing, and maintaining software tools and pipelines that automate the triaging and processing of bug reports submitted by Apple’s internal teams and feedback submitted by customers. Your work is crucial towards ensuring the quality and performance of our products and the productivity of Apple’s development teams.", "description": "We’re a small team with a big footprint. Our mission is to provide cutting edge, reliable and easy to use infrastructure for ingesting, storing, processing and interacting with bug report data while keeping Apple’s users’ data private and secure. Our tools are used by thousands of engineers at Apple to quickly find the most meaningful insights from bug reports. We’re passionate about building highly reliable and performant tooling that Apple relies on.  You will work on web applications, APIs, databases, and large scale data processing pipelines. You’ll tackle broad-context challenges, such as:  - Expanding bug report processing pipelines with a focus on reliability and scalability - Surfacing new insights based on data collected from bug reports in user friendly experiences - Working with engineers across the company to understand new use cases and drive engagement across many organizations", "key_qualifications": "empty string", "preferred_qualifications": "Knowledge of cloud platforms, virtualization technologies, and service monitoring tools a plus\nCommunicate ideas clearly and ask insightful questions, with a positive and respectful attitude, to a diverse audience\nPassionate about software quality, reliability, and the power of tooling", "education_experience": "empty string", "additional_requirements": "empty string", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554334"}