{"title": "Software Development Engineering Manager, Framework Internal Apps", "summary": "Do you like developing apps that use new Apple APIs? Do you look forward to using the latest version of Xcode and the SDKs? Do you like building and managing a team of skilled engineers? If so, we want you to be part of the team that builds internal apps using new APIs that are yet to be released to external developers. The Framework Internal Apps team designs and develops internal apps used to qualify many flagship developer features like SwiftUI, WidgetKit, macOS Catalyst, and watchOS Complications. We are hiring a Software Development Engineering Manager to lead, inspire, and drive a group of versatile engineers. If this leadership position sounds exciting, we would like to hear from you! Join us and help shape the developer experience for future versions of Apple SDKs!", "description": "The Framework Internal Apps team is looking for a leader with experience guiding a development team, building APIs, and working collaboratively across multiple teams. We design, develop, and maintain apps that are used to validate new APIs in the public SDKs for iOS, iPadOS, tvOS, watchOS, and Catalyst. Your team will be embedded with software development teams to ensure Apple's SDKs provide the intended functionality and experience for the thousands of developers who build apps for our platforms. You will work closely with other Developers, Quality Assurance Engineers, and Automation Engineers across Apple to ensure we have adequate test coverage for new APIs. We also occasionally develop accompanying web services and tools needed to ensure new APIs work.", "key_qualifications": "This section is not provided in the HTML.", "preferred_qualifications": "Proven ability to ramp up quickly on new technologies. Ability to lead several concurrent projects. Self driven and the ability to work autonomously. Creative thinker and strong problem solver that thrives in an environment that focuses on customer experience and attention to detail. Excellent written and verbal communication skills. Experience developing software on Apple platforms (Xcode, macOS, iOS, iPadOS, tvOS, and watchOS) is preferred but not required. Experience using any of Apple’s OS SDKs is a plus.", "education_experience": "This section is not provided in the HTML.", "additional_requirements": "This section is not provided in the HTML.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553168"}