{"title": "Software Quality Engineer, POS Engineering - Retail Engineering", "summary": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Retail Engineering Point of Sale (POS) team is responsible for the technology and IT systems used to enable Apple Retail Stores service millions of customers and are an industry leader in Retail. Bring passion and dedication to your job and there's no telling what you could accomplish. Are you passionate about solving complex business challenges with process engineering and technology? Do you thrive in environments that require multi-functional thinking, collaboration, and innovation? If so, this may be the job for you!", "description": "As a Quality Engineer you'll need to take an active role in shaping the quality of our software. This will demand deep integration with our development engineers, creating test plans, bug reporting and triaging, identifying automation opportunities, and supporting design reviews. You'll help us identify holes in coverage, actively sync with multi-functional teams to reduce duplication, foster better testing, and resist regressions. We are building a passionate and diverse team that will span a broad range of applications, tools, and frameworks. We need your help to reach Apple's high standards of quality.", "key_qualifications": "", "preferred_qualifications": "BA/BS degree or equivalent, Experience working in an agile software development lifecycle, Strong attention to detail and excellent analytical capabilities, Experience troubleshooting problems and working with a team to resolve large scale production issues., Strong sense of ownership, customer service, and integrity demonstrated through clear communication., Passion for eliminating repetitive manual processes using automation, Excellent knowledge of software testing methodologies & practices, Ability to triage problems, prioritize accordingly, and propose a resolution, Ability to thrive in a collaborative working environment within your team and beyond", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559201"}