{"title": "C++ Software Engineer, Enterprise Technology Services", "summary": "The IS&T Product Engineering Systems group is seeking a C++ Software Engineer with a proven track record in designing and developing high-quality enterprise software solutions! Our group is responsible for the Enterprise Product Lifecycle Management (PLM) transformation initiative, aiming to deliver the next-generation PLM/PIM Platform to drive Apple’s Product Innovation across hardware, software, and services lines of business. We are looking for someone with experience building and delivering scalable and high-performance enterprise applications. This individual should possess strong technical knowledge and leadership skills.", "description": "Join the IS&T Product Engineering Systems group as a C++ Software Engineer, where you will help build innovative enterprise software applications. Your responsibilities include working with business partners to define project requirements; developing architecture and detailed design; implementation and maintenance. You will own all engineering and product feature work in release cycles, designing and developing solutions for scalability, extensibility, security, and performance. You must be able to communicate and work with multi-functional IS&T and Business groups. Self-motivation, creativity, and the ability to operate with minimal direction and deliver on time are essential. Strong multitasking skills are crucial. This role will demonstrate your hands-on coding skills and leadership skills with other developers and vendors to deliver the solution. You will also enjoy the benefits of working in a fast-growing business where you are encouraged to “Think Different” and where your efforts play a key role in the success of Apple’s product design and innovation!", "key_qualifications": "3 years of hands-on experience using C++ for cross-platform development\nSolid understanding of C++ programming fundamentals, including core language concepts, object-oriented programming principles, memory management, and standard Template Library (STL)\nExperience with software development lifecycle, including requirements capturing, coding, testing, and deployment\nAbility to write efficient and optimized code\nFamiliarity with relational databases like SQL Server or Oracle\nExcellent problem-solving and analytical skills\nStrong communication and partnership abilities", "preferred_qualifications": "Bachelor’s degree or equivalent experience in Computer Science, Engineering, or a related field\nExperience with dependency management and build tools like Bazel, CMake, and Conan\nExposure to Test Driven Development concepts and tools like GoogleTest, Doctest, or Catch2\nFamiliarity with version control systems such as Git\nKnowledge of network programming and protocols, as well as web services", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558164"}