{"title": "Senior Computer Vision & Machine Learning Engineer, Creativity Apps", "summary": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly! The Creativity Apps team needs your help shaping the next generation of creative editing tools by working on pioneering technologies to surprise and delight creative pros and enthusiasts alike. You’ll be working with the world-class teams behind Final Cut Pro, Logic Pro, iMovie, and GarageBand to create next-generation tools for creators. As a Senior Computer Vision & Machine Learning Engineer, you will be working alongside our world-class creatives, designers, and engineers to help innovate in the creative space in ways that only Apple can. This is a highly visible, highly impactful opportunity!", "description": "Are you ready to be an early member of a new engineering team? Join us, and you’ll build state-of-the-art models and applications, partner with cross-functional teams and deliver end-to-end features to power the next-generation tools for creators. The ideal candidate should have deep experience in computer vision and machine learning, care about long term sustainable software development, and can drive features from concept all the way to delivery. This position requires a self-motivated individual with excellent interpersonal skills to effectively collaborate with all levels of the organization.", "key_qualifications": "Extensive knowledge in theory and practice of computer vision, machine learning and deep learning techniques. Experience delivering products in Computer Vision, Computational Photography, Generative AI, Machine Learning, or related areas. Hands-on experience with building, training, evaluating, and deploying transformer based vision models, Generative Adversarial Network based models, and related methods. Familiarity with modern camera ISP and digital image processing algorithms and models is a plus. Experience optimizing models and algorithms that run efficiently on resource constrained platforms is a plus. Strong patent and publication record at top conferences is a plus. Experience delivering high quality software at scale. Strong programming skills in Python and/or C++ and one of the deep learning toolkits such as PyTorch, JAX, or Tensorflow. Experience with Core ML, Swift, and iOS/macOS machine learning development is a plus. Ability to solve everyday problems in innovative ways. Ability to communicate effectively and collaborate with partner teams. Committed to encouraging an open and inclusive work environment.", "preferred_qualifications": "", "education_experience": "MS or PhD in Computer Science, Machine Learning or related field, and 3-5 years of significant industry experience delivering products using state-of-the-art computer vision and machine learning technologies.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551083"}