{"title": "Sr. Software Engineer, Information Systems & Technology", "summary": "Apple is a place where extraordinary people gather to do their best work! Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job! The Information Systems & Technology organization is looking for an experienced Sr. Software Engineer (Java). You will work closely with our business leaders and other partners to implement these new solutions. The ideal candidate must be able to work independently, build the solutions for sophisticated architecture and be comfortable working under pressure at times.", "description": "As a Sr. Software Engineer; you will develop, document, and maintain code and unit tests by utilizing software development environments and programming languages (Java) You will interface with Business, application owners, developers and project managers to take projects from inception to completion Be responsible for promised deliveries on time  Review technical designs and perform code review", "key_qualifications": "8+ years of experience in designing and developing scalable enterprise level back end solutions Proven skills and Hands-on programming experience in Java, Spring, multi-threading, REST, Data Caching Services, DB schema design and data access technologies Hands-on with design, development, and deployment of enterprise systems Experience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clients Understand security concepts and build reliable and safe distributed applications Solid knowledge of applications performance improvement techniques and caching solutions", "preferred_qualifications": "Knowledge of applications performance and optimizing techniques Experience with processing large amounts of data/ large scale internet infrastructure Good understanding on the concepts of Cloud, Networking, CDN, Web Browse Understanding of encryption algorithms and technologies. No-sql databases like Cassandra, Mongo DB, etc.", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558541"}