{"title": "Cross Functional Test Lead", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The IS&T Retail Systems is looking for a Cross Functional Test Lead to join our group. In this role you will be responsible for planning, coordination, execution, and continuous improvement of processes for end to end integration testing.", "description": "This position demands a self-motivated individual with strong technical and interpersonal skills who can contribute in a team environment. This candidate must be able to build and present risks and mitigations to Senior Management. Day to day work involves the following:\n-  Manage/Lead testing efforts for multiple cross functional retail projects with concurrent timelines\n-  Establish QA standards, guidelines, technologies, and approaches for the projects and for the testing team\n-  Manage and coordinate onsite and offshore testing team activities\n-  Actively participate in development and execution of test processes, strategies, and plans\n-  Work with Automation Lead to reduce regression test cycles with goal of 100% automation\n-  Work with the business, technical project development teams, and project managers to establish project development schedules and implement test plan to deliver high quality product releases", "key_qualifications": " ", "preferred_qualifications": "Strong experience developing and implementing test plans, QA processes and methodologies\nStrong experience performing manual and automation testing\nExperience with automation framework and tools\nStrong experience in test data and environment setup for end to end testing\nAble to quickly identify and understand issues\nOutstanding team player with excellent interpersonal skills and ability to work cross functionally\nExcellent written, verbal communication and presentation skills\nAble to work under pressure and comfortable working in dynamic environment\nAble to collaborate with business partners, developers, and various support teams to troubleshoot and resolve defects and issues\nStrong capabilities in end to end software testing in both Agile and Waterfall methodologies", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200556175"}