{"title": "Senior Wireless System Application Engineer", "summary": "At Apple, we work every single day to craft products that enrich people’s lives. As a member of our Wireless Silicon Design group, you will have unique and rewarding opportunity to build our future products that will delight and encourage millions of Apple’s customers every single day! New generations of emerging applications demand performances in specific definitions.", "description": "Core responsibilities include, but are not limited to, the following: •Design and simulate state-of-the-art wireless communication system for next generations of applications. Implement system models and investigate innovative architecture, protocols, algorithms in PHY/MAC cross-layer to mitigate the impact congested radio environment and achieve robust performance. Collaborate with product teams and come up with novel architecture, protocols, integrated systems, algorithms to meet the requirements from the emerging applications in a congested radio environment.", "key_qualifications": "Extensive experience in developing wireless communications systems on algorithm designs, architecting, integrating systems and protocols. In-depth knowledge on wireless communication system (OFDM/MIMO, etc.), including hands-on experience on lab testing and characterization. Deep understanding of communication theory and signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization and coding theory), and more.", "preferred_qualifications": "", "education_experience": "BS and 10+ years of relevant experience required. MSEE/PhD preferred", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534396"}