{"title": "Software Tools Developer", "summary": "At Apple, our products touch millions of lives every single day with consistency and dependability. Ever wonder how we achieve this? Our System Architecture & Design team is a group of interdisciplinary performance architects, analysts, software engineers, and expert content creation professionals who explore actual production workflows and everyday use cases to enhance and improve customer experiences on current hardware and software. As a Tools Developer, you will play a critical role in ensuring the performance excellence of iPhone/Mac/iPad systems under development. You will also be involved with designing, developing, and maintaining automation and tools to measure and analyze system performance and identify bottlenecks. You will design databases to store data collected across many multi-functional teams and develop visualizations for that data. We are also looking for someone who can support teams with debugging performance and test issues, test code, analyze data, identify bugs, and resolve problems as necessary. If this role sounds fun, we would love to hear from you!", "description": "In this role, the Tools Developer will assume responsibility for the conception, development, and maintenance of tools and automation essential for analyzing system performance. These will be used for identifying performance bottlenecks, studying how applications utilize our hardware, and for reporting performance while products are being developed. Additionally, the developer will design databases to aggregate performance data sourced from diverse teams within Apple, and create visualizations and reports based on the collected data. You will support cross-functional teams globally by troubleshooting performance issues, triaging OS issues, addressing testing issues, conducting code reviews, and conducting statistical analysis.", "key_qualifications": "", "preferred_qualifications": "Atleast 7 years of Software development Experience, with a focus on performance optimization. Solid foundation in Computer Science including statistics and algorithms. Proficiency in Python and/or Swift, with a proven track record of delivering high-quality software. Expertise with tools like Xcode and git. Strong database design skills, capable of crafting robust database solutions. Proficiency in data analytics and principles of descriptive analysis. Experience producing compelling visualizations and dashboards. Excellent communication and presentation skills", "education_experience": "Bachelors of Engineering Degree in Computer Science or relevant field.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200554050"}