{"title": "Third Party AirPlay Engineering Manager", "summary": "Do you want to make a significant impact on how hundreds of millions of people around the world stream content from their Apple devices to third-party devices? If you are passionate about being a technical leader with a strong product focus, look no further. Imagine the groundbreaking innovations you could contribute to here! Apple's Audio and Media Technologies (AMT) group is seeking an experienced Software Engineering Manager to join our AirPlay team. This team is at the forefront of creating cutting-edge audio-visual experiences across Apple’s platforms (iPhones/iPads, Apple TV, Apple Watch, HomePod, macOS, and Vision Pro) and third-party devices. Recently, our team made headlines by bringing AirPlay to select hotels, enhancing user experiences in new and exciting ways.", "description": "As an AirPlay Software Engineering Manager, you will be accountable for the following: Leading a versatile team of engineers developing exciting new features in the area of remote media playback Open up the boundaries on innovation, working on compelling designs at the very edge of what’s technically possible Contribute to overall media systems design, performance analysis and optimizations Collaborate closely with multi-functional teams to ensure end to end bringup of new features", "key_qualifications": "Must have strong software development experience in C, C++, and/or JavaScript Excellent prioritization skills and focus Strong problem solving, critical thinking, and communications skills Experience in working with media systems Debugging and solving software issues using system profiling, network analysis tools (e.g., GDB/LLDB, Valgrind, Xcode Instruments, Wireshark, etc.,)", "preferred_qualifications": "Experience in working with embedded media systems that feature playback and user interface components", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $181,000 and $313,000, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200553939"}