{"title": "Senior Software Engineer,  ML Model Operations", "summary": "Apple's Machine Learning and AI team transform every Apple product and because we fully integrate hardware and software, we can collaborate to deliver amazing experiences while protecting user data. Siri is used by hundreds of millions of people worldwide helping with their daily tasks. Powered by data, machine learning and software that applies ML to translate that data into the best possible user experience. To help continue this work we are looking for an innovative Software Engineer eager to push the boundaries of AI with a single aim: to make a real difference to the lives of Siri users.", "description": "Working as part of an extraordinary team of top software engineers and specialist machine learning practitioners, we are passionate about applying state of the art techniques to conversational dialogue. Siri processes more than a billion requests every week, so you will enjoy creating designs and leading teams to develop high quality software, implemented at scale. You will design the software and tools that support, train, and test our machine learning models within Siri’s architecture to make Siri more intelligent. Working with a high degree of autonomy, to be successful in the role you will drive the architecture of internal model pipelines and web services, that serve other internal teams at Apple. You will review designs and code by others and provide constructive feedback. You will share knowledge and coach others, whilst continuously learning from colleagues. Based in Cambridge, we work closely with teams across Apple worldwide. This means occasional evening meetings with teams outside UK, and limited international travel may be required. If this is you, we'd love to hear from you!", "key_qualifications": "Experience in the architecture of internal tooling and ML model training/evaluation/promotion pipelines, Software engineering experience in multiple languages and stacks for backend development, Ability to scale up existing system and improve performances, Ability to drive cross functional projects, Ability to assist with product roadmap planning and iterate on internal user experience, Experience in mentoring existing engineers on a growth trajectory, Ability to help teams to set good engineering practices and help driving design decisions", "preferred_qualifications": "", "education_experience": "BS or MSc in Computer Science or equivalent work experience.", "additional_requirements": "Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200540843"}