{"title": "AI/ML - Siri Language Engineer (Vietnamese), Siri & Information Intelligence", "summary": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways! New challenges arise every day that require the sharp problem solving skills of individuals. Are you in for these challenges? Join the team in Singapore that engineers Siri and other cloud-based services for international markets. Our team is primarily responsible for making Siri the best worldwide digital assistant. Teaching Siri how to understand and speak new languages is the main goal of our team, together with designing and implementing a highly locally customized experience for our users. We are a deeply diverse and passionate group dedicated to bringing the future of intelligent assistants to the world. We are looking for highly motivated Vietnamese-speaking engineers, with strong software engineering skills and high sensibility for foreign languages and cultures.", "description": "We are looking for proven ability to be creative, take ownership of a project, a superior technical expertise, and a knack for solving problems that stump most engineers. Having worked on shipping products and being familiar with the rush to the finish line is highly desired. This is an opportunity to durably shape the future of human - computer interaction and walk the state-of-the-art of a nascent field. Specific responsibilities will include: - Engineering Natural Language Processing and Speech components specific to your language - Using the power of large amount of data to tackle complex NLP and machine learning problems - Leading data annotation efforts and define language specific representations, conventions and techniques - Analyzing data and making data driven decisions to improve the localized user experience - Automating, scripting and integrating workflow from diverse systems - Providing insights and suggestions towards innovative new approaches and new product features tailored to your home market - Developing creative solutions to complex issues - Interacting with other teams at Apple working towards the same goal; from Speech Recognition Specialists, Data Scientists and Speech Synthesis engineers", "key_qualifications": "Fluency in Vietnamese to support the Vietnam market and ability to work in an English-speaking environment - Strong Software Engineering Fundamentals - Proficiency in at least one Object-Oriented programming language - Quick prototyping, scripting and tool development (Python, Perl, Ruby, Shell and etc.) - Experience with one or more version control systems - Familiarity with machine learning methods for classification, regression, or ranking problems - Knowledge of Text Processing, NLP techniques and Automatic Speech Recognition (ASR) - Analytic mindset and obsession for data - Outstanding problem solving and critical thinking skills and getting-things-done attitude - Excellent verbal and written communication, team player mentality and collaborative in nature", "preferred_qualifications": "", "education_experience": "BS/MSc in Computer Science or Computer Engineering or related fields, or equivalent experience", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200501904"}