{"title": "Worldwide Sales Finance Program Manager", "summary": "Imagine what you could do here. The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do. Bring passion and dedication to your job and there's no telling what you could accomplish! Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. Apple is looking for a dynamic, highly motivated Program Manager to join the WW Channel Sales Finance team. We are looking for a driven professional with high analytical capacity, creativity, and strong communication skills to support the Worldwide Sales Organization. In this role, you will partner with worldwide and regional leads in finance, sales, as well as other key technical partners, to drive optimization through process, data and technology solutions. You’ll apply your abilities for strategy, planning, and execution to devise operational and technical solutions that support the sales and sales finance teams and help drive Apple’s demand strategy. The position requires the ability to understand and work with sophisticated data set in order to drive insights.", "description": "Success requires an individual to think strategically, connecting the dots of the bigger picture, as well as being comfortable in the details of the all key deliverables. You must be self-motivated, comfortable working with minimal direction in a global, fast-paced, sometimes ambiguous environment. You have exceptional analytical skills, are comfortable with getting into the weeds of data analysis, a maniacal attention to detail, and a proven ability to influence and collaborate across all levels of the organization. You’ll connect the dots, build trust and understanding between groups, and orchestrate the activities needed to make your projects successful. The ideal candidate should have experience managing global technical projects that interweave across multiple functional teams and/or multiple systems with the commercial knowledge of a business team supporting Sales and Sales Finance. The position will require the ability to complete complex business process analysis, dive deep into data across these disciplines, and develop and gain alignment on data strategies and data governance across global cross-functional teams. You’ll often need to analyze large amount of data that the team is working with and be able to present findings to stakeholders. You should be able to leverage your strong verbal skills to elevate and articulate priorities, trade offs, and explain technical concepts in business context to senior leaders. This role requires you to be a champion of best practices in data management, governance, and business processes to instill a robust and sustainable data strategy across sales and sales finance for analytics to support demand and financial planning. The duties and responsibilities are very diverse, but include the following:", "key_qualifications": "8+ years of experience in finance, planning, management consulting, data analytics, product management, enablement/effectiveness and/or digital transformation role Proven track record of leading strategic programs, combined with the ability to execute tactical project-level tasks Experience planning, managing, and successfully delivering large cross-functional enterprise systems projects Excellent process management, planning, and organizational skills Proficient knowledge of development lifecycles Technical acumen required to effectively discuss and strategize on solutions with IT teams Technical understanding with ability to articulate complex technical issues in easy to understand business terms * Comfortable with data analysis in Excel or SQL * Understanding of data management best practices to ensure sustainable data strategy in business areas * Strong team orientation and collaborative & flexible style * Able to form cohesive project teams across disparate organizations and groups * Comfortable with driving clarity through ambiguity * Outstanding verbal & written communication skills * Experience presenting and making recommendations to senior level executives * Proven ability to lead teams with or without direct reports; natural leader and motivator that can lead through influence", "preferred_qualifications": "", "education_experience": "Bachelor’s degree in Business Management, Finance, Computer Science or related field required", "additional_requirements": "- Big 5 consulting experience preferred - Experience in a channel sales finance role preferred. - Proven track record in implementing complex initiatives that significantly improve business process and performance. - Business Process Mapping and Master Data Management around customer data and channel data experience is also a plus.", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200549115"}