{"title": "Manager, Apple Store Online BPR APAC", "summary": "The Retail Online Project Management team is looking for a proven Manager with exemplary project management, digital transformation, and program management skills to join our team.", "description": "Lead our team responsible for end-to-end implementation of transformational technology and process improvements focused on the interactions between contact center specialists and Apple customers, while facilitating an overall great customer experience for both our internal and external partners.", "key_qualifications": "8+ years experience in leading process / project implementations, with at least 3-5 years of management experience, or direct leadership experience in an internal role. Detailed expertise related to business process re-engineering best practices and project management methodologies (i.e. Agile and Waterfall), as well as change management and organizational readiness tools and methodologies. A track record of leading project delivery for a large, multi-functional project portfolio. Deep strategic and technical knowledge in Contact Center technologies including but not limited to NLP, RPA, IVR, Live Video streaming, Screen-sharing, Data solutions and Staffing tools. Strong critical thinking, with outstanding analytical, influencing, and interpersonal skills. The ability to achieve results in an ambiguous environment. Superb communication and presentation across the organization. Collaborative, flexible, open working style and an ability to establish trust and credibility quickly. Outstanding partner management experience at the most senior levels, superior influencing and collaboration skills. Drive strategic discussions and convert strategy to action. Technical skill required to effectively discuss and strategize with Information Technology leads. Ability to drive Capital Planning conversations including investment trade-offs, technical debt and prioritisation. Interpersonal communication skills with expertise distilling complicated technical topics to a broader audience. Deep expertise of Apple's Digital Commerce ecosystem and the Retail Contact Center technologies and processes (preferred). Certified Scrum Master required, SAFe Certification (preferred).", "preferred_qualifications": "", "education_experience": "Bachelors Degree or equivalent experience.  Masters Degree (preferred)", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200536330"}