{"title": "Product Design Engineering Manager - Data Center.", "summary": "The Mac Product Design team is looking for a senior leader to help us shape the future of our data center. We want you to join us in doing the most impactful work of your life! The Data Center PD senior manager will lead a team of 11-15 mechanical engineers, ranging from junior new hires to technical experts and experienced managers. The team is responsible for a range of activities including refreshing existing server deployments, executing on derivative designs from concept through deployment, and ideating ambitious future-facing architectures from the chassis level to the data center infrastructure interface.", "description": "Collaborate with infrastructure, product integrity, hardware, software, and technology groups to define & execute on data center products. Lead the team to define product requirements, develop initial layouts, generate concepts, prototype, analyze, and test to drive down-selection. Partner with external vendors & internal manufacturing teams to optimize designs for function, performance, and manufacturability. Ensure designs meet requirements throughout their lifecycle by performing stress, tolerance, and failure analyses. Travel up to 10% in Asia to support factory builds.", "key_qualifications": "The ideal candidate would demonstrate the majority of these key skills: Genuine curiosity and a strong sense of ownership, Talent for building consensus amongst cross-functional teams and coordinating with stakeholders at a senior level, Strong engineering fundamentals; ability to lead a design from the details to the big picture; ability to take a data-driven approach to evaluating technical tradeoffs, Knowledge and experience in data center infrastructure and server mechanical and thermal architecture design, Excellent written and verbal communication skills; ability to clearly communicate technical ideas and issues at an executive level, Experience managing a large and diverse team; genuine desire to maintain a healthy and supportive team culture, 10+ years experience in a mechanical engineering role, including 5+ years in management and technical team leadership", "preferred_qualifications": "", "education_experience": "B.S. Mechanical Engineering or equivalent", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200550231"}