{"title": "Sales - Enterprise Business Development Manager (Philippines)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Apple’s Sales organisation generates the revenue needed to fuel our ongoing development of products and services.", "description": "As a Channel Business Development Manager, you will: - Drive Apple’s core enterprise message and product story through working with channel reseller partners, along with multiplier organisations and solution partners. - Understand and share Apple’s extraordinarily deep product story, connecting our values and inspiring Channel Resellers to think and act differently; providing the highest level of customer service to Apple’s priority Reseller Partners. - Conduct strategic account planning sessions with Apple’s most significant resellers, communicating plans to Apple leadership, and implementing plans. - Actively scour the market for new reseller partners, business opportunities, growing geographic coverage, identify new programs or enterprise initiatives - Ensure operational efficiencies within the Enterprise Channel, including working closely with Apple’s Supply Teams to coordinate supply requests and requirements. - Plan and carry out training requirements, including working with Apple’s training teams to upskill key partners with vital skills to grow Apple’s Enterprise business, completing programs in place in each market. - Work closely with the broader Enterprise and Country Sales team to ensure planning and alignment for the entire business in Philippines Success is significant growth in Apple’s sales volume across all lines of business from our Reseller Channel. You are accountable for signing up and leading a critical mass of Reseller Partners to fulfil the end customer demands of scale and scope. APPLE PEOPLE: Apple people are versatile, collaborative, creative, tenacious, passionate and authentic and possess a wonderful sense of humour. An obsession for quality and excellence in everything we do is shared by all, along with deep respect for our values, each other and the impact we can have on the lives of others.", "key_qualifications": "-  Experience in sales, account management, commercial and partner development\n-  Understanding of Apple in Enterprise, with deep knowledge of the considerations, requirements and journey of enterprise organisations in the adoption of Apple technology; including how this translates to the skills and knowledge required by our Reseller Channel\n-  Understanding and proven commercial competence in the channel growth of enterprise sales, across all commercial segments.\n-  Confident and articulate with a clear ability to influence others, learn quickly, navigate diversity, cater to the demands of partners and growing business in emerging markets, strong presentation skills and business planning\n-  Ability to facilitate collaboratively in cross-functional decision-making environments as well as moving ideas to execution\n-  Be able to work independently and as part of a local, regional, global or cross-functional teams\n-  Able to go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas\n-  Be abreast on market trends, partner’s platform capabilities and strategic plans for new partnership opportunities.\n-  High level of ethics, values, integrity and trust", "preferred_qualifications": "", "education_experience": "Bachelor’s degree, preferably with Master’s degree or equivalent experience.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200537639"}