{"title": "KR Sales Change Management Lead (Direct Contractor)", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish! Preferably with Salesforce experience, as part of the regional Business Process Re-engineering team (BPR), and broader WW BPR group, the regional change manager will focus on the people side of change, including business processes, systems and technologies impacting the teams in region. Working closely with the global change team, you will support the creation and a delivery of change strategies, and plans to help teams in region maximise their adoption of new solutions by honing methods of effective and sustained behaviour change.  Also, you will lead demo development and implementation process of Apple’s products and services. Drive demo content and software compliance across all demo program tracks, utilizing existing systems and tools, as well as crafting new processes as needed. Plan and drive execution of strategic campaigns in partnership with Content and Technical Operations functions. This is a great opportunity for someone who is looking to play a key role in implementing fast and effective change across regional and global teams in Apple Sales!", "description": "Liaising with the WW BPR team and local BPR leadership. Assess change impacts in region, by conducting impact analyses, assess change readiness and identify key partners in region. Apply organisational change processes and tools to build a strategy to support the adoption and changes required by projects and initiatives to be deployed in region. Support the definition, provide input, document requirements and support the design and delivery of training and communication programs in region, including localisation considerations. Complete change management assessments. Identify, mitigate and manage anticipated resistance, issues, and risks, proactively. Build actionable results for the five change management levers; communication plan,, collaborator/sponsor roadmap, coaching plan, training plan, resistance management plan. Partner with regional leadership to develop and build a change network for key initiatives including the creation and maintenance of change champion groups in the business. Facilitate sessions with that local change network to support adoption. Integrate change management activities into project and program plans, according to regional and global strategy. Define and measure success metrics and monitor change progress and adoption. Input and support in partner engagement activities, including local partner onboarding needs. Digital asset mgt - digital signage, motion graphic management both in-store and out of store. On-device communication contents mgt - operational readiness to display product specific contents as well as close communication with external partners to create and publish pricing to contents. With the support from WW team, troubleshoot and provide solutions to in-store issues regarding digital assets and contents.", "key_qualifications": "Experience in sales process change and transformation. I.e. experience in core sales processes such as pipeline management, fields sales management, account planning, forecasting, demand generation, reporting. Knowledge and experience of implementing change management principles, methodologies and tools. Strong understanding of how people journey through change Experience of project management approaches, tools and phases of a project life-cycle Experience in approaches to create and manage localised content needs. Organised, with a natural inclination for both strategic and tactical planning and turn strategy into tangible deliverables. Exceptional written and verbal communication and presentation skills, to audiences of varying seniority. Good business insight and understanding of organisational issues and challenges. Past experience with developing communications and training material. High level of integrity, energy and sense of urgency to make things happen. Ability to establish and maintain trust, credibility and build positive relationships. Resilient and tenacious with a propensity to persevere. Experience in delivering within large scale ERP transformation implementations, preferably Sales Force Experience with agile delivery models Change management certification (such as PROSCI) or other designation desirable.", "preferred_qualifications": "", "education_experience": "BA/BS or equivalent degree in Business Management, Organisational behaviour or Industrial / Organisational Psychology or related discipline preferred.", "additional_requirements": "Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200548525"}