{"title": "Manager of Special Projects Group EMEA", "summary": "We are seeking an experienced, collaborative, and highly motivated senior manager to join our team and be responsible for the management of special projects in multiple countries in Europe.", "description": "We are looking for a high-energy candidate with proven experience in facilities management with a demonstrated focus in operating buildings as outstanding workplaces, delivering high quality results at the best value. The Manager of Special Projects Group EMEA will be responsible for supervising a team of seasoned professionals and multiple organizations to provide top management and support of the real estate portfolio.", "key_qualifications": "Extensive experience in building engineering, facility/construction/project management experience with a demonstrated focus in making buildings outstanding workplaces. Experience managing a full-scale project management team tasked with delivering exceptional results in a fiscally responsible manner. Deep expertise in the planning, scheduling, budgeting, resourcing, and executing of all technical services required to deliver large scale construction projects. Experience managing bespoke design elements that require attention to detail and industry leading techniques. Expertise in the management of mechanical, electrical, plumbing, building controls, fire-alarm, and architectural finish scopes. Capability to diagnose, handle and resolve construction issues quickly and efficiently, including experience prioritizing and assigning materials and resources; Excellent leadership, communication, and supervisory skills, including experience working with all levels of an organization and ability to handle customer service issues involving employees in a professional and positive manner; Demonstrated success in employee development and mentoring including fostering collaboration, continuous performance feedback and motivating the team to develop and utilize tools for more efficient project management and improved customer service.", "preferred_qualifications": "Extensive knowledge of and experience with the upkeep and function of buildings, building systems, machinery, and landscape to ensure new projects are designed to the highest architectural standards without sacrificing maintainability", "education_experience": "Bachelor's Degree in Mechanical, Electrical, Industrial, or Building Construction Management preferred.", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200552338"}