{"title": "Design Human Factors Manager", "summary": "Design Human Factors is a discipline within the Apple Design Team that is responsible for the quality of human experience in products that are used by billions of people.", "description": "The responsibilities of the Design Human Factors team manager are broad. You are expected to: Connect the team with collaborators across Apple. Build and maintain strong relationships with key research and human factors teams, hardware and software engineering teams, and other teams within Apple such as Health, Services, Marketing, Retail, and Quality. Be a champion for the team. Advocate for resources (prototype development, lab time, engineering support, etc.), inclusion in project work, accommodation of diverse perspectives, and partnerships with other teams. Support the growth of each team member. Elevate members of the team to represent the group in new and innovative ways. Establish practices to foster deeper collaboration across HF team and their partners. Connect with teammates to advance personal and professional growth through discussion and enabling resources such as coaching, external research support, and continuing education.", "key_qualifications": "Experienced, ethical, compassionate, and grounded leader; Deep appreciation for human factors in product development; Networking, building strong relationships, and maintaining trust; Understanding and respecting nuanced, holistic approaches to connect people with products; Literate in topics related to diversity, inclusion, intersectionality, equity, and unconscious bias; Willingness to listen and learn from diverse perspectives with patience and humility", "preferred_qualifications": "", "education_experience": "", "additional_requirements": "Must have experience managing teams", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $219,300 and $378,700, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200522704"}