{"title": "CLM Business Systems Analyst, Analytics", "summary": "We are seeking an experienced Systems Analyst with over 5 years of hands on experience with Contracts Lifecycle Management (CLM) tools. The ideal candidate will have experience developing and automating operational, analytical, and audit reports in the Sales Contracts space, along with expertise in system integration design, workflow, and clause/template builds. Candidate must have working proficiency leveraging AI/ML technologies to drive process improvements and implement advanced analytics. If you have a passion for excellence and a drive to deliver exceptional results, we encourage you to apply for this exciting opportunity.", "description": "Develop and manage operational, analytical, and audit reports to support contract operations and SOX controls. Manage contracts data quality, governance, and act as a data steward. Design and integrate with upstream/downstream systems, configure contract workflows. Conduct requirements analysis, design, build, testing, end-user training, and system rollouts leveraging schedule/project management skills. Maintain a strong focus on customer delight and effectively manage multiple changing priorities. Collaborate with and project manage multi-functional group projects. Develop Stored Procedures/Views/Triggers etc within databases like MS SQL Server, Snowflake. Use reporting tools such as Tableau and Business Objects to develop reporting solutions. Leverage AI/ML concepts for continuous improvements in contracting flows, reporting and analytics.", "key_qualifications": "", "preferred_qualifications": "Strong analytical, problem-solving and project management skills. Excellent communication and interpersonal abilities. Ability to self manage and work in a collaborative and fast-paced environment", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $133,900 and $201,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559839"}