{"title": "Senior Software Engineer - Apple Vision Pro", "summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.", "description": "Apple makes the newest technologies accessible to create amazing user experiences. You will have the opportunity to work in a team developing system level frameworks enabling these experiences, in close collaboration with creative teams across Apple and VPG. The candidate for this role will be comfortable working in a dynamic and creative environment. Engineers are expected to work quickly and smartly to help determine the viability of ideas and technologies. You will need a keen understanding of GPUs and lower level programming and how this fit together to deliver real-time experiences on Apple Silicon platforms. You will ideally bring an ambition to improve, innovate and explore these technologies to enable creatives to surprise and delight our users.", "key_qualifications": "Programming skills and knowledge of C++ or Swift, Proficient in mathematics for 3D real-time applications (linear algebra), Understanding of CPU/GPU hardware architecture and how that affects solutions, Excellent communication and collaboration skills, Experience delivering high-quality software to end users", "preferred_qualifications": "", "education_experience": "BS/MS in Computer Science OR equivalent degree and at least 8 years of relevant industry experience.", "additional_requirements": "- Apple Silicon CPU/GPU architecture, - Experience writing optimized code using e.g. profiling tools, assembly, SIMD, compute, etc, - Proficient in at least one of the major graphics APIs (Metal, OpenGL, DirectX, Consoles, etc), - Familiarity with macOS and Unix", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $197,400 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits. Note: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551842"}