{"title": "Global Fixed Asset Lead (permanent)", "summary": "Apple’s Global Business Solutions (GBS) organization supports tens of thousands of Apple employees, customers and vendors on just about every topic under the sun. We offer advice and develop innovative solutions to challenging problems that come up all around the world. Team up with Apple, one of the most influential technology leaders in the industry.", "description": "Plan and coordinate across 85+ legal entities, local reporting deliverables on Apple’s Fixed assets and ensure all is completed to a high standard. Analyse the designated Local GAAP accounting treatment of Fixed Assets globally across all legal entities. Develop and document a governance model to support Apple’s Global Fixed Asset Statutory & Tax reporting process. Determine the appropriate GAAP and related Local policy elections for Global Fixed Assets legal entity reporting, when a new site or material site change arises.", "key_qualifications": " ", "preferred_qualifications": "Tableau experience, Ability to maintain a global perspective and recognise opportunities to align with other GBS regions on similar processes, Great teammate who likes to work in a fast-paced environment, Possess excellent written and verbal interpersonal skills, as well as presentation skills, Mature, responsible, driven, and able to work independently with minimal direct supervision, Demonstrated ability to engage and communicate effectively across the organization and with external partners, Detailed and meticulous, outstanding attention to detail with strong analytical and problem-solving skills, Possess a real passion for process improvement with an approach that urges innovation, elimination of non-value-added work, and efficiency improvements, Ability to think creatively and develop innovative solutions, Ability to influence and implement ideas effectively.", "education_experience": " ", "additional_requirements": " ", "pay_benefits": " ", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200559566"}