{"title": "Software Development Engineer in Test, Partner Solutions and Technology", "summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish. Apple's Partner Solutions and Technology team is looking for an extraordinary Quality Engineer who is passionate about quality. You should have attention to detail and a dedication to deliver high-quality results. To be successful, you should be self-motivated; and driven to achieve and exceed commitments. You also need to exude exceptional collaboration skills, including the ability to mentor and be mentored. Possess a strong passion to work in a growing, energizing environment of innovation, working with a creative team of dedicated developers and Quality Engineers. If you want to be a part of this amazing team, this position is for you. Dynamic, hard-working people and inspiring, innovative technologies are the norms here. Will you join us in crafting solutions that do not yet exist?", "description": "You will prioritize tasks with rapid development cycles, remain flexible and calm in uncertainty, and drive vendors to deliver excellent results for time-critical issues. You will use your experience in QA to test various applications. The basic day-to-day responsibilities include: Prioritizing the development of strong and effective working partnerships with app owners, developers, and other project team members. Review and analyze requirements, user issues, wireframes, prototypes, etc. Participate in cross-functional review meetings to ask questions and provide feedback. Develop test plans, test cases and bug reports. Create and Run automated tests and investigate failures. Provide risk assessment to app owner - Participate in go-live activities by validating the product after production deployment and supporting any warranty activities. Assist in training development, change management, and adoption goals.", "key_qualifications": "Solid understanding of development lifecycles, testing methodologies, and QA processes. Experienced in developing test plans, building tools, and test frameworks. Computer Science fundamentals and experience in object-oriented design, data structures, and algorithms. Proficiency in a programming language (e.g. Java, Python, JavaScript, SQL). Experience understanding and/or testing with APIs. Programming experience with automation scripting/tools/tests harness (e.g. Selenium, Cucumber, Karate, RestAssured, Appium). Strong debugging skills to identify software issues", "preferred_qualifications": "", "education_experience": "B.S. in Computer Science or equivalent. 5+ years of relevant experience.", "additional_requirements": "Experience testing AEM-based solutions is a plus. Experience testing Salesforce ecosystem is a plus.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200520587"}