{"title": "Display Manufacturing Process Engineer", "summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, you will help us leave the world better than we found it! We have an opportunity for an accomplished process engineer to lead development, and ramp for next generation Apple product. You will have the opportunity to bring significant impact on Apple Products, and leave a footprint for years to come.", "description": "-  Review and provide feedback on product design and engineering drawing to reflect the design intent of display component and module. DFM knowledge and skill is crucial. -  Partner with internal and external multi-functional teams to evaluate design and processes at early phase and set expectations for manufacturing processes -  Conduct tolerance analysis of mechanical and cosmetic performance with engineering teams to ensure key dimension and profile is controlled in 2D drawing. -  Responsible for manufacturing research and development to solve complex manufacturing problems that immediately impact to product cost, quality and delivery of products. -  Define and develop assembly tool of fixture or equipment through the application of theoretical and practical engineering to fulfill product design and feature. -  Set and perform standard procedure to qualify the process. -  Optimize the key parameter of assembly tool through DOE (design of experiment) and statistic to fulfill product spec. -  Set process control point or parameter which is critical to quality for process to ensure no process issue in assembly line and reliability test. -  Review assembly SOP to ensure critical assembly procedure is included. -  Conduct failure analysis in production line and drive the solution and validation happened. -  Present technical issues and updates to Apple management team and multi-functional team on a frequent basis -  Provide creative solutions for engineering challenges or issues related to assembly process -  Lead supplier production line qualification, provide short-term, long-term corrective actions for any process/equipment issues and drive improvements back into whole supply chain for process and design robustness -  Drive vendor to improve line output UPH and process cycle time to meet ramp curve. -  Drive FAI/Cpk data collection, verify the data integrity and work with PD/ME on disposition and final spec lockdown. -  Develop metrology for complicated parts' measurement, design gauges and measurement fixtures, AOI and drive their qualifications", "key_qualifications": "5+ years experience in Process or Manufacturing. Hands-on experience and good understanding on: 1. SOP definition and review 2. Metrology development and qualification 3. Auto manufacturing equipment design and qualification 4. Key process parameter optimization via DOE. (Design, perform DOE and review data) 5. DFM review and come out improvement plan. Working knowledge of GD&T, strong Statistical Data Analysis, engineering drawing interpretation and mechanical tolerance analysis Proficient in written and verbal English. Education: Bachelor's in Mechanical/Industrial Engineering, Materials Science and Engineering or equivalent", "preferred_qualifications": "Strong technical skills, i.e. problem solving, issue root causing, superior analytic skills with leadership to drive manufacture site member complete every activity. Smart manufacturing related relevant experience would be preferred. A strong collaborator who is able to work independently under high pressure and tight schedule. Project management experience is helpful LCD/OLED display knowledge and manufacturing process experience is an added advantage Metrology Development, Programming and hands on measurement a plus (CMM, OMM, Laser, CCD, X-rays Etc) Education: Masters' preferred", "education_experience": "", "additional_requirements": "", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200558346"}