{"title": "AIML - Generative Foundation Model/LLM Research Scientist, MLR", "summary": "Play a part in building the next revolution of machine learning technology. We’re looking for passionate mid-level and senior researchers to work on ambitious curiosity driven long-term research projects that will impact the future of Apple, and our products. In this role, you’ll have the opportunity to work on innovative foundational research in machine learning through publication and cross-team collaborations. As a member of Apple Machine Learning Research (MLR), you will have the freedom to define your own research agenda, work on open-ended problems and publish in high-quality scientific venues, while having access to real-world problems and data through Apple’s product teams. Within MLR, our team is currently interested in large generative models for vision and language, with particular interests in fairness, reasoning, robustness, efficiency, and uncertainty in such models.", "description": "You have a strong research background in machine learning or related fields, and regularly publish your results in the main relevant conference and journal venues, and make sure that your research results are of high quality and reproducible. You will propose your own research plan to advance our understanding of machine learning and execute it through implementation and experimentation, in collaboration with your colleagues. You will provide technical mentorship and guidance, and prepare technical reports for publication and conference talks. You will have the opportunity to collaborate with broader teams across Apple.", "key_qualifications": "Demonstrated expertise in machine learning research. Publication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, AAAI, CVPR, ICCV, ECCV, ACL, EMNLP, etc). Hands-on experience working with deep learning toolkits such as Tensorflow or PyTorch. Strong mathematical skills in linear algebra and statistics. In-depth understanding of modern machine learning techniques. Ability to formulate a research problem, design, experiment, implement and communicate solutions. Ability to work in a diverse collaborative environment.", "preferred_qualifications": "", "education_experience": "PhD, or equivalent practical experience, in Computer Science, or related technical field.", "additional_requirements": "Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programmes vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200528816"}