{"title": "Senior Manager for Apple Ray", "summary": "We are looking for an experienced technical leader who can bring their passion for machine learning, infrastructure, big data, and distributed systems to build world class data and machine learning (ML) platform/products at scale and across different cloud environments. As a senior manger in the Apple Data group, you will work closely with many cross functional teams and lead the planning, execution and delivery of technical projects with the ultimate goal of improving the user experience throughout their data+ML workflow.", "description": "Apple Ray leverages open-source Ray to offer a unified framework for processing of complex data+ML pipelines. It enables the next generation of intelligent experiences for Apple products and services by combining data and processing layers into one unified end-to-end workflow that eliminates the complexity of running multiple independent jobs while significantly improving the hardware resource efficiency and development speed. Tight integration of Apple Ray with Apple Data services makes it the go-to solution when dealing with complex and large-scale data and ML pipelines. The team enables future Apple intelligent products by making cutting edge ecosystem of data+ML technologies for large-scale and efficient systems for all data and ML engineers within Apple. This role requires strong technical expertise, strategic thinking, robust planning and effective execution, relationship management, and seamless coordination across multi-functional areas. Our platform is built using a variety of systems and services, from bare metal to managed infrastructure services, and everything in between. We use existing and open-source systems when possible, but do not shy away from building in-house solutions when needed.", "key_qualifications": " ", "preferred_qualifications": "Manage, mentor, and grow a large team of software engineers, tech leads, and managers\nFoster a healthy and collaborative culture, and a high output group\nDrive technical and cross-functional projects and provide leadership in an innovative and fast-paced environment\nMeasure and improve the efficiency and reliability of data+ML infrastructure systems\nSet vision for the long term in alignment with business priorities and guide short-term planning towards that\nComfortable with ambiguity, and will enjoy working in a fast-paced dynamic environment.", "education_experience": "", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $208,300 and $360,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200555132"}