{"title": "Senior Vision Display Module Engineer", "summary": "Do something different! Apple is seeking for a hard-working and experienced Senior Module Engineer to join our vision display module development and validation team. In this role, you will focus on AR/VR display hardware design, development, and validation for key modules for next generation Apple vision products. You will organize and collaborate closely with multi-functional teams and suppliers to ensure the successful implementation of new display technologies and drive engineering excellence from initial concept to final mass production. This position demands proactive problem-solving across many technical domains, including optical design, human perception, product development, material science, manufacturing process, optical metrology, reliability testing, and failure analysis. A successful candidate needs to be highly independent and results driven, have strong presentation and communication skills, and can thrive in a fast-paced and highly dynamic environment.", "description": "-  Support development of overall display and module-specific specifications from initial concept to mass production, and drive rigorous validation plan to meet performance for vision displays\n\n-  Identify and refine viable optical architectures to meet target size, weight, power, display quality, and undesired display artifacts through simulation and prototype hardware demonstration\n\n-  Organize multi-functional teams to drive display module development by collaborating with key partners, setting clear goals and priorities throughout the product development phases, driving design convergence, and ensuring successful display product builds\n\n-  Identify and assesses critical metrics affecting display module performance, analyze experimental and build data, address process limitation, and follow through between modeling and as-built performance\n\n-  Drive issue failure analysis and corrective actions, engaging with broader team on benefit and risks associated with any proposed solutions and drive implementation of the solutions\n\n-  Travel to support build at component, module, and system factories during critical new product introduction phases", "key_qualifications": "Minimum of 10 years of experience in near-to-eye display hardware development, validation, and research, or applicable related field\nExperience in mass production of consumer display modules/systems and managing domestic and international vendors\nStrong working knowledge of display related calibration and metrology methods\nUnderstanding of display and display artifacts impacts on user visual experience\nProficiency in statistical tools (e.g., JMP), scientific programming languages (e.g., MATLAB, Python), and optical simulators (e.g., LightTools, Zemax)\nAbility to communicate effectively across the organization, influence other teams, manage risk, make decisions with limited amount of information, deliver against a fast-paced development schedule are key requirements", "preferred_qualifications": "", "education_experience": "BS and a minimum of 10 years relevant industry experience", "additional_requirements": "Preferred Qualifications:\n- Experience in consumer electronics and optics/process development, shipping product development\n- Deep understanding of optics development for DMD, LCoS, OLED, LCD, or uLED display systems\n- M.S. or Ph.D. in Optical Science/Engineering or related field with 7+ years of proven experience", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $166,600 and $296,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200551177"}