{"title": "Account Executive, Nigeria", "summary": "The people here at Apple don’t just create products—they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Apple’s Sales organization generates the revenue needed to fuel our ongoing development. This in turn enriches the lives of hundreds of millions of people around the world. Our sales team is, in many ways, the face of Apple to our largest customers. We collaborate with our partners to define opportunities and develop growth plans resulting in delivering an extraordinary customer experience and expanded adoption of the Apple ecosystem.", "description": "Grow the business with our retail/channel partners who resell Apple products. Build deep relationships, negotiate programs, and develop capabilities to achieve best possible end-customer experience with results that benefit Apple and our consumer online partners. Part of the end-customer experience is also to make sure we’re driving the right offer-propositions, addressing end-customer needs and thereby maximising our sales. Demonstrate a deep understanding of market trends and sales channels. Develop comprehensive account strategies that both align with our partners’ priorities and deepen or expand Apple's footprint. Work with partners to develop new and exciting growth opportunities, drive relevant market activities and ultimately ensure sales through our partners. Supervise key performance indicators that support growth and enable forecasts on the overall health of our accounts.", "key_qualifications": "You understand there are many moving parts in an organisation. Navigating the interdependencies within Apple is needed for success. Understanding how business financials work, and strategies for sustaining profitable growth, are key to staying ahead of the competition. You analyse and think beyond the short-term. You see the world through the eyes of the customer by deeply understanding their business needs, challenges, and concerns. At Apple, we obsess over how people experience our products and services. You not only meet our customers’ expectations, but you exceed them. Customer and partner needs can often be unique—but, you’re quick on your feet and connect and influence the right people both inside and outside of Apple. As a go to person with leadership, you are trusted and comfortable in tough situations. You can settle disputes, negotiations and be responsible for the hard calls with minimal noise. You step up to conflicts and see them as opportunities to shine. You are only as strong as the people around you, so you know how to chip in to your team. You enjoy a collaborative environment with open dialogue and debate. You empower your teammates to do their life’s best work. When projects require extra support, you are eager to step up to the plate and bring your knowledge to the table. You strive for completion in everything you do. Due to changing priorities, urgent customer needs, or a final push to meet a quarterly forecast, you face the daily challenge of where to focus your time and energy. You have a don’t give up attitude, and finish, especially in resistance or setbacks. You seize every opportunity and empower others to reach their goals along the way. You believe that communication is key to Apple’s success. You’re a dreamer and someone who actively talks and listens through endless possibilities—with customers and teammates alike. To ensure the most innovative ideas become a reality, you recognise perspectives, persistently listen to every detail and commit to what is right, in order to move us forward. No matter the audience, you are a specialist at communicating. And, you’re cool under pressure. You make the sophisticated simple and you command an audience by bringing them along for the journey. You empower others to learn, to be curious and ultimately, share your passion for the Apple story. When challenged with sophisticated questions, you share your deep knowledge of how our hardware, software and services integrate. Apple and third party solutions tackle sophisticated business problems in simple and innovative ways. You create driven and breakthrough strategies that truly shape the future. You do this by asking why and why not, both stripping out what is not crucial and identifying what is. By doing so, you are able to see what’s ahead and identify trends that will be critical for growth.", "preferred_qualifications": "", "education_experience": "Bachelor’s degree or equivalent experience.", "additional_requirements": "You have experience in consultative selling and developing channel growth strategies with partners. In your experience, you’ve balanced delivering on short-term goals, while building balanced value for customers and partners, and demand for the future. You bring shown ability as an Account Executive and working experience for a mobile device or HW company is a plus.", "pay_benefits": "", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200534374"}