{"title": "iOS/macOS Engineer - Camera Tools and Prototyping", "summary": "The Video Engineering organization is at the center of the Camera stack here at Apple. We develop image/video core technologies used in almost all of Apple products and services. Our team is responsible for prototyping and incubating camera solutions for the future! Imagine what you could do at Apple. Are you ready to help us deliver the next groundbreaking Apple products?", "description": "You will closely collaborate with cross-functional teams to scope and design prototypes for future camera-based technologies. This involves crafting high-quality, polished demos showcasing new camera technologies, use cases, and features, as well as writing extremely reusable and modular frameworks to be used by others at Apple. The position requires a candidate to be a quick learner who can take a project from broad scoping to execution from a perspective. The problems you will face will be dynamic, ranging from soliciting agreement for a software solution from cross-functional partners to a deeply technical blocker. While working on the regular software delivery, you will also be expected to bring knowledge back to the team and help improve the infrastructure for testing and reliability of our deliverables.", "key_qualifications": "Excellent Objective-C/Swift programming and debugging skills, Experience working with embedded system using C/C++, Experience in AVFoundation, CoreMedia, and/or other media frameworks, Knowledge of multi-threaded programming and synchronization, Proven experience in building shipping high quality iOS/MacOS apps or maintaining open source projects, Experience in system design, Excellent communication skills, Experience in building SwiftUI applications is a plus, Experience in Metal is highly desired, Experience in Swift Concurrency is a plus, Experience with CoreML is also a plus", "preferred_qualifications": "", "education_experience": "BS and a minimum of 3 years relevant industry experience.", "additional_requirements": "", "pay_benefits": "At Apple, base pay is one part of our total compensation package and is determined within a range. The base pay range for this role is between $143,100 and $264,200, and your base pay will depend on your skills, qualifications, experience, and location. Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation.", "company": "apple", "url": "https://jobs.apple.com/en-in/details/200538494"}