{"jobTitle": "Agent's Executive Assistant - State Farm Agent Team Member", "company": {"name": "State Farm Agent", "location": "Brooklyn, NY"}, "location": "Brooklyn, NY", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "23.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "Responsive recruiter<br/><br/>Position Overview<br/><br/>Successful State Farm Agent is seeking a qualified professional to join their winning team for the role of Agent's Executive Assistant - State Farm Agent Team Member. We seek an energetic professional interested in helping our business grow through value-based conversations and remarkable customer experience. If you are a motivated self starter who thrives in a fast-paced environment, then this is your opportunity for a rewarding career with excellent income and growth potential.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Work with the agent to identify and support local community events in our market.</li><li>Work with the agent to help manage the website and social media content.</li><li>Maintain a strong work ethic with a total commitment to success each and every day.<br/><br/></li></ul>As an Agent Team Member, you will receive...<br/><br/><ul><li>401K</li><li>Hourly pay</li><li>Health benefits</li><li>Paid time off (vacation and personal/sick days)</li><li>Valuable experience</li><li>Growth potential/Opportunity for advancement within my agency<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Excellent interpersonal skills</li><li>Excellent communication skills - written, verbal and listening</li><li>Organizational skills</li><li>Self-motivated</li><li>Detail oriented</li><li>Proactive in problem solving</li><li>Experience in a variety of computer applications, particularly Windows</li><li>Pride in getting work done accurately and timely</li><li>Ability to multi-task</li><li>Provide timely and thorough activity reports to agent</li><li>Position may require travel</li><li>Must be available to work the following schedule: Monday, Tuesday and Thursday </li><li>Associate's degree or higher preferred<br/><br/></li></ul>If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.<br/><br/>This position is with a State Farm independent contractor agent, not with State Farm Insurance Companies. Employees of State Farm agents must be able to successfully complete any applicable licensing requirements and training programs. State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm.<br/><br/>Compensation: $23.00 per hour<br/><br/>My Team's Mission Is To Help People Manage The Risks Of Everyday Life, Recover From The Unexpected And Realize Their Dreams. We Are Located In Brooklyn, NY And Help Customers With Their Insurance And Financial Services Needs, Including<br/><br/><ul><li>Auto insurance</li><li>Home insurance</li><li>Life insurance</li><li>Retirement planning<br/><br/></li></ul><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "responsibilities": "Work with the agent to identify and support local community events in our market.Work with the agent to help manage the website and social media content.Maintain a strong work ethic with a total commitment to success each and every day.", "qualifications": {"required": "Excellent interpersonal skillsExcellent communication skills - written, verbal and listeningOrganizational skillsSelf-motivatedDetail orientedProactive in problem solvingExperience in a variety of computer applications, particularly WindowsPride in getting work done accurately and timelyAbility to multi-taskProvide timely and thorough activity reports to agentPosition may require travelMust be available to work the following schedule: Monday, Tuesday and Thursday ", "preferred": "Associate's degree or higher preferred"}, "skills": ["Communication", "Social Media", "Customer Service", "Microsoft Office", "Time Management", "Organization", "Problem Solving"], "postedDate": "1 year ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3578425653"}