{"jobTitle": "Director of Partnerships", "company": {"name": "Campfire Interactive", "location": "Ann Arbor, MI"}, "location": "Ann Arbor, MI", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Information Technology", "industry": "Software Development", "description": "Company Description<br/><br/>Why Campfire? <br/><br/>Campfire Interactive is a leader in cloud-based Opportunity Management &amp; Sales Forecasting, Quote Lifecycle Management, and Program, Project &amp; Issues Management. We work with many of the world’s largest automotive suppliers, an exciting industry facing big changes from electrification of vehicles to globally distributed supply chains. Rapid adoption of Campfire software has resulted in our company being named to the Inc. 5000 as one of America’s fastest growing companies.<br/><br/>This is where YOU will impact the future of our business. Campfire’s unique, powerful, and cost-effective solution suite has kindled a growing base of happy customers around the world by bringing future and current revenues and costs under a single roof, with advanced functionality to create, analyze, and modify plans, optimize portfolios, and manage long-term profitability. Campfire’s technology sparks unprecedented insight into a company’s bottom line, which can unleash the freedom to focus on the decisions that matter most. Join our visionary tech company and talented and passionate team as we continue to develop such valuable systems.<br/><br/>Job Description<br/><br/>Job Duties and Responsibilities<br/><br/>As Director of Partnerships, you will be responsible to create, nurture and support revenue-generating corporate partnerships in ways that result in significant joint business potential. Campfire partners with other companies to provide our customers with the best solutions and highest value professional services to support the growing demand for Campfire software. Partners expand our sales reach, extend our solution footprint and enhance our marketing presence. Our partners include services partners, solution partners and channel partners. Campfire strategic partners include Amazon Web Services (AWS), Salesforce and Plante Moran. These and other partnerships are increasingly important to our growth and market position.<br/><br/>The position will lead go-to-market strategy and execution with partners and oversee partner collaborations in areas of marketing, product, sales and implementations. Partner initiatives include joint promotional activities, joint sales activities, and working together on solution offerings and services including joint technology development and implementation support. You will be required to forecast the resource needs and financial impact of partnerships. The position reports directly to Campfire’s Chief Operating Officer.<br/><br/>Qualifications<br/><br/>Successful Candidates Will Demonstrate: <br/><br/><ul><li>Ability to work in a collaborative team environment while also being able to execute work independently</li><li>Ability to lead and manage teams of internal and external resources across organizations other than their own and evangelize benefits of partnering</li><li>Ability to problem-solve complex issues independently and with a team</li><li>Meet project timelines and deadlines while producing high-quality work</li><li>Eagerness to learn and the ability to adapt to company culture</li><li>Ability to work in a fast-paced environment; requires a high energy, can-do individual</li><li>Establish and maintain effective working relationships with peers, project team members, and customers</li><li>Excellent verbal and written communication ability<br/><br/><br/></li></ul>Technical Skills<br/><br/><ul><li>Define business objectives for each partnership and develop a strategic direction, action plan for success, financial targets and milestones as part of partner project plans</li><li>Craft and negotiate MOUs, partnership and sales agent agreements</li><li>Successfully facilitate and manage the path to partnership productivity</li><li>Manage potential conflict among partners</li><li>Work closely with Campfire sales team to support joint targeting and pursuit with partners</li><li>Maintain alignment between internal team and partner goals</li><li>Collaborative approach to working across internal and partners cross-functional teams</li><li>Project management skills, extreme attention to detail and follow-up</li><li>Participate in new business activities including scoping calls, generating quotes, ideation, and proposal development and delivery</li><li>Conduct regular evaluations of partnership health, including insights and recommendations</li><li>Proven aptitude to understand complex technologies and handle technical relationships</li><li>Ability to handle multiple projects, relationships, and tasks simultaneously</li><li>Excellent partner management, expectation management, negotiation, and conflict resolution skills<br/><br/><br/></li></ul>Work Experience<br/><br/><ul><li>5+ years of sales, marketing or business development</li><li>3+ years of working with partners, resellers, alliances or agents and growing senior-level relationships</li><li>2+ years in roles requiring strong project or program management skills and approaches</li><li>Sales process oriented and knows how to sell; experience driving/impacting revenue</li><li>Background in computer software industry, especially enterprise applications</li><li>Experience in automotive sector and working with auto suppliers is preferred<br/><br/><br/></li></ul>Educational Experience<br/><br/><ul><li>BA/BS degree in Business, Marketing, Communications, Sales and/or related discipline</li><li>MBA degree is a plus<br/><br/><br/></li></ul>Additional Information<br/><br/>Currently, Campfire is working remotely to keep our employees safe and healthy! This individual might need to be in the office and able to meet with our customers when necessary.<br/><br/>All your information will be kept confidential according to EEO guidelines.<br/><br/>We do not accept unsolicited 3rd party resumes.", "responsibilities": "As Director of Partnerships, you will be responsible to create, nurture and support revenue-generating corporate partnerships in ways that result in significant joint business potential. Campfire partners with other companies to provide our customers with the best solutions and highest value professional services to support the growing demand for Campfire software. Partners expand our sales reach, extend our solution footprint and enhance our marketing presence. Our partners include services partners, solution partners and channel partners. Campfire strategic partners include Amazon Web Services (AWS), Salesforce and Plante Moran. These and other partnerships are increasingly important to our growth and market position.<br/><br/>The position will lead go-to-market strategy and execution with partners and oversee partner collaborations in areas of marketing, product, sales and implementations. Partner initiatives include joint promotional activities, joint sales activities, and working together on solution offerings and services including joint technology development and implementation support. You will be required to forecast the resource needs and financial impact of partnerships. The position reports directly to Campfire’s Chief Operating Officer.", "qualifications": {"required": "Ability to work in a collaborative team environment while also being able to execute work independently, Ability to lead and manage teams of internal and external resources across organizations other than their own and evangelize benefits of partnering, Ability to problem-solve complex issues independently and with a team, Meet project timelines and deadlines while producing high-quality work, Eagerness to learn and the ability to adapt to company culture, Ability to work in a fast-paced environment; requires a high energy, can-do individual, Establish and maintain effective working relationships with peers, project team members, and customers, Excellent verbal and written communication ability", "preferred": "Experience in automotive sector and working with auto suppliers, MBA degree"}, "skills": ["Project Management", "Sales", "Business Development", "Marketing", "Partner Management", "Negotiation", "Conflict Resolution", "Software Development", "Enterprise Applications", "Automotive", "AWS", "Salesforce"], "postedDate": "1 year ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3648918480"}