{"jobTitle": "Customer Service Representative - State Farm Agent Team Member", "company": {"name": "State Farm Agent", "location": "Garden City, NY"}, "location": "Garden City, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00 - 90,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Insurance", "description": "Responsive recruiter<br/><br/>Position Overview<br/><br/>Are you outgoing and customer-focused? Do you enjoy working with the public? If you answered yes to these questions, working for a State Farm independent contractor agent may be the career for you! State Farm agents market only State Farm insurance and financial service products.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Establish customer relationships and follow up with customers, as needed.</li><li>Use a customer-focused, needs-based review process to educate customers about insurance options.</li><li>Develop leads, schedule appointments, identify customer needs, and market appropriate products and services.<br/><br/></li></ul>As an Agent Team Member, you will receive...<br/><br/><ul><li>401K</li><li>Hourly pay plus commission/bonus</li><li>Health benefits</li><li>Paid time off (vacation and personal/sick days)</li><li>Flexible hours</li><li>Growth potential/Opportunity for advancement within my agency<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Interest in marketing products and services based on customer needs</li><li>Excellent communication skills - written, verbal and listening</li><li>People-oriented</li><li>Detail oriented</li><li>Proactive in problem solving</li><li>Able to learn computer functions</li><li>Ability to work in a team environment<br/><br/></li></ul>If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.<br/><br/>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm.<br/><br/>Compensation: $70,000.00 - $90,000.00 per year<br/><br/><strong>Do you want a career and not just a job?<br/><br/></strong>This busy insurance and financial services office has a passion to make a difference in the lives of others and better the community. We attribute our success to having a fun, energetic environment that is an enjoyable place to work. We want to work alongside those who are equally committed to excellence and personal achievement. We take pride in using our years of valuable experience to mentor individual team members and prepare them for successful careers. If you're willing to work hard and you expect to get results from yourself and those around you, we want to meet you and talk about the opportunity we have for you.<br/><br/><strong>About Our Agency<br/><br/></strong><ul><li>Our office is located in New Hyde Park, NY.</li><li>I am a second generation State Farm agent. </li><li>We currently have 8 team members at our agency. </li><li>We have 140 years of combined insurance experience in our office.</li><li>Our agency has received awards including: Chairman's Circle, Ambassador Travel, Legion of Honor, Senior Vice President's Club, and Golden Triangle <br/><br/></li></ul><strong>Apply now and let us put you on the path to success.<br/><br/></strong><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "responsibilities": "Establish customer relationships and follow up with customers, as needed. Use a customer-focused, needs-based review process to educate customers about insurance options. Develop leads, schedule appointments, identify customer needs, and market appropriate products and services.", "qualifications": {"required": "Interest in marketing products and services based on customer needs Excellent communication skills - written, verbal and listening People-oriented Detail oriented Proactive in problem solving Able to learn computer functions Ability to work in a team environment"}, "skills": [], "postedDate": "1 year ago", "applicationDeadline": "", "benefits": "401K Hourly pay plus commission/bonus Health benefits Paid time off (vacation and personal/sick days) Flexible hours Growth potential/Opportunity for advancement within my agency", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3673359301"}