{"jobTitle": "Side Hustle - Gig Worker", "company": {"name": "Fud, Inc.", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "We are a growing start-up company looking for a Side Hustle - Gig Worker to join our community. As a Gig Worker, you will be responsible for a variety of tasks to help our community, including researching, sharing, and mentoring other Side Hustlers to succeed with their Side Hustles, including Gig Work. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>Fud is a unique community that offers a wealth of knowledge and resources to help individuals achieve their goals. Our members are hustlers who are always looking for ways to improve themselves and their businesses. We bring together people from all walks of life who share a common desire to be successful. By joining our community as a Gig Worker, you will be part of a dynamic and supportive community that is passionate about helping others to achieve their dreams.<br/><br/>Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>You can experience our community for yourself by downloading our free to use app.<br/><br/>Requirements<br/><br/><ul><li>Provide one-on-one and group mentoring to side hustlers</li><li>Help side hustlers develop their side hustle ideas</li><li>Set goals and track progress with side hustlers</li><li>Provide support and motivation to side hustlers</li><li>Share knowledge and resources with side hustlers</li><li>Stay up-to-date on the latest trends in side hustles</li><li>Build relationships with side hustlers and other mentors</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>Passion for innovation and entrepreneurship<br/><br/><br/></li></ul>Benefits<br/><br/><ul><li>Be your own boss</li><li>Learn how to make money from your passion and interests</li><li>Find a community of like minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want <br/><br/><br/></li></ul>We are a community that values diversity. We encourage everyone including women and people of color to join us.", "responsibilities": "As a Gig Worker, you will be responsible for a variety of tasks to help our community, including researching, sharing, and mentoring other Side Hustlers to succeed with their Side Hustles, including Gig Work.", "qualifications": {"required": "Provide one-on-one and group mentoring to side hustlers\nHelp side hustlers develop their side hustle ideas\nSet goals and track progress with side hustlers\nProvide support and motivation to side hustlers\nShare knowledge and resources with side hustlers\nStay up-to-date on the latest trends in side hustles\nBuild relationships with side hustlers and other mentors\nA willingness to share know-how through video, livestreaming, and text content\nPassion for innovation and entrepreneurship"}, "skills": ["Mentoring", "Research", "Content Creation", "Entrepreneurship", "Community Building"], "postedDate": "1 year ago", "benefits": "Be your own boss\nLearn how to make money from your passion and interests\nFind a community of like minded hard working solopreneurs and entrepreneurs\nChoose your own schedule and work when you want", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3687142831"}