{"jobTitle": "CUSTOMER SERVICE REPRESENTATIVE", "company": {"name": "City of New York", "location": "Manhattan, NY"}, "location": "Manhattan, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "41,483.00 – 47,705.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Government Administration", "description": "The NYC Department of Homeless Services (DHS) is one of the largest organizations of its kind committed to preventing and addressing homelessness in New York City. Collaborating with other public agencies and not-for-profit partners, the Department of Homeless Services works to prevent homelessness before it occurs, reduce street homelessness, and assist New Yorkers to transition from shelter into appropriate permanent housing.<br/><br/>The Department of Homeless Services is recruiting for six (6) Caseworkers to function as a Customer Service Representatives, who will:<br/><br/><ul><li> Answer customer calls and provide accurate, satisfactory answers to their questions and concerns.</li><li> De-escalate situations involving dissatisfied customer, offering assistance and support.</li><li> Identify customer’s needs, clarify information, research issues, and provide response/solution.</li><li> Interact with Real Estate Broker/landlords and Housing Specialist to inform about the status of their units in process.</li><li> Guide callers through/ troubleshooting, navigating the agency's website or using new application and services.</li><li> Collaborate with the managers to improve customer service.</li><li> Help to train new employees and inform them about the agency’s customer management policies.</li><li> Compile daily and weekly metrics on the number of calls received and the status of the said calls.</li><li> Manage high volume of inbound and outbound calls in a timely manner.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li> A baccalaureate degree from an accredited college or university accredited by regional, national, professional, or specialized agencies recognized as accrediting bodies by the U.S. Secretary of Education and by the Council for Higher Education Accreditation (CHEA).<br/><br/></li></ul>Additional Information: Section 424-a of the New York State Social Services Law requires an authorized agency to inquire whether a candidate for employment with child-care responsibilities is or has been the subject of an indicated child abuse and maltreatment report on file with the State Central Register for child abuse and maltreatment. State Central Register screening will be conducted prior to considering a candidate for employment as a Caseworker. Candidates who have been the subject of an indicated child abuse and maltreatment report will not be assigned to any position which requires child-care responsibilities. Employees who have been the subject of such a report may be reassigned or terminated from employment from their positions as Caseworker.<br/><br/>55a Program<br/><br/>This position is also open to qualified persons with a disability who are eligible for the 55-a Program. Please indicate at the top of your resume and cover letter that you would like to be considered for the position through the 55-a Program.<br/><br/>Residency Requirement<br/><br/>New York City Residency is not required for this position<br/><br/>Additional Information<br/><br/>The City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.<br/><br/>", "postedDate": "10 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3728296455"}