{"jobTitle": "Account Executive", "company": {"name": "MikMak", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000 - $120,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "MikMak is hiring an Account Executive for our B2B marketing technology SaaS platform, working with Fortune 1000 brand partners. In this role, you will serve as the commercial lead on a portfolio of assigned accounts, and own the retention for your book of business. You will work collaboratively with Sales and Customer Success to ensure accounts are set up for success from day one and on track for long-term partnerships with MikMak.<br/><br/><strong>ABOUT THE ROLE: <br/><br/></strong><ul><li>Build strong and long-lasting relationships with customers </li><li>Own retention sales process from start to finish for your assigned portfolio of accounts using the ValueSelling methodology framework</li><li>Regularly ensure that MikMak solutions are aligned with customer objectives and delivering business impact</li><li>Keep Salesforce updated with status of account health, contacts and renewal/expansion opportunities and all client and agency communication </li><li>Manage and maintain renewal pipeline for regular revenue forecasting and reporting </li><li>Collaborate with Sales, Customer Success, Marketing and Product teams to communicate and help prioritize customer needs regarding features, service, support and collateral <br/><br/></li></ul><strong>WHO YOU ARE:<br/><br/></strong><ul><li>5+ years of experience in a revenue-carrying role, preferably in a SaaS startup environment</li><li>3+ years of relevant industry experience working with CPG brands and Marketing, eCommerce and IT contact personas </li><li>Experience managing a sizable portfolio of accounts </li><li>Experience negotiating and closing contracts </li><li>Proven track record of working ahead of renewals </li><li>Experience working complex renewals that require engaging multiple stakeholders at once</li><li>Experience using Salesforce as a single-source of truth </li><li>Experience working in a performance driven and fast-paced environment</li><li>Excellent communication and organizational skills </li><li>Team-oriented, strong customer focus and ability to multitask</li><li>Eager to contribute to a rapidly growing start-up environment<br/><br/></li></ul>At MikMak, we value team members who are passionate and enthusiastic about what we're building here. We believe there is no \"perfect\" candidate, and want to encourage applying even if all the requirements listed aren't met.<br/><br/>Base Salary Range: $80,000 - $120,000 + Commission<br/><br/><strong>WHY MIKMAK?<br/><br/></strong><ul><li>Live and work from anywhere in the U.S. We call the program MikMak ANYWHERE.</li><li>Great Medical, Dental, Vision, and Life insurance options for MikMak employees + dependents (Company covering 90-100% of all plans)</li><li>Flexible Time Off and Health Days (office closed between Christmas and New Years)</li><li>Competitive Parental Leave Policy</li><li>401k with company contribution</li><li>Monthly utilities stipend</li><li>Wellness stipend<br/><br/></li></ul><strong>WHO WE ARE<br/><br/></strong>MikMak is the leading platform for eCommerce acceleration for multichannel brands, and provides analytics and eCommerce enablement software to help product manufacturers and CPG companies understand their consumers' online behavior, determine the best use of marketing dollars, and drive online sales.<br/><br/>The flagship product, MikMak Insights improves marketing effectiveness, drives market share over competitors, and strengthens a brand's positioning with retailers. The MikMak Commerce product enables brands to create shopping experiences connected to 200+ online retailers and streamline the path-to-purchase from any media, ad, or website.<br/><br/>MikMak's investors include Wavecrest Growth Partners, VaynerMedia, Luminari Capital, SLOW Ventures, UTA Ventures, Brave Ventures, Lunch Partners, Madrona Venture Group, Bazaarvoice founder Brett Hurt, Hooklogic founder/CEO Jonathan Opdyke and founding CRO John Roswech, Foursquare CEO David Shim, and Kargo CEO Harry Kargman.<br/><br/><strong>A note to our applicants…<br/><br/></strong>MikMak is proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, veteran status, or any other legally protected status. Each individual at MikMak brings their own perspectives, work experiences, lifestyles, and cultures with them, and we believe that a more diverse team creates a more innovative environment and helps us all grow and learn as individuals.<br/><br/>To support MikMak's commitment to provide a healthy and safe work environment, we require all of our team members to be fully vaccinated against COVID-19 to enter any of our physical work locations. In accordance with law, accommodations may be available in specific circumstances, including religious beliefs and medical conditions.", "responsibilities": "Build strong and long-lasting relationships with customers \nOwn retention sales process from start to finish for your assigned portfolio of accounts using the ValueSelling methodology framework\nRegularly ensure that MikMak solutions are aligned with customer objectives and delivering business impact\nKeep Salesforce updated with status of account health, contacts and renewal/expansion opportunities and all client and agency communication \nManage and maintain renewal pipeline for regular revenue forecasting and reporting \nCollaborate with Sales, Customer Success, Marketing and Product teams to communicate and help prioritize customer needs regarding features, service, support and collateral", "qualifications": {"required": "5+ years of experience in a revenue-carrying role, preferably in a SaaS startup environment\n3+ years of relevant industry experience working with CPG brands and Marketing, eCommerce and IT contact personas \nExperience managing a sizable portfolio of accounts \nExperience negotiating and closing contracts \nProven track record of working ahead of renewals \nExperience working complex renewals that require engaging multiple stakeholders at once\nExperience using Salesforce as a single-source of truth \nExperience working in a performance driven and fast-paced environment\nExcellent communication and organizational skills \nTeam-oriented, strong customer focus and ability to multitask\nEager to contribute to a rapidly growing start-up environment"}, "skills": ["Salesforce", "ValueSelling", "CPG", "Ecommerce", "SaaS"], "postedDate": "11 months ago", "benefits": "Live and work from anywhere in the U.S. We call the program MikMak ANYWHERE.\nGreat Medical, Dental, Vision, and Life insurance options for MikMak employees + dependents (Company covering 90-100% of all plans)\nFlexible Time Off and Health Days (office closed between Christmas and New Years)\nCompetitive Parental Leave Policy\n401k with company contribution\nMonthly utilities stipend\nWellness stipend", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3732697820"}