{"jobTitle": "Mgr Inventory Control", "company": {"name": "Republic National Distributing Company", "location": "Deerfield Beach, FL"}, "location": "Deerfield Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Beverage Manufacturing", "description": "Republic National Distributing Company (RNDC) is a family-owned business with roots extending before Prohibition that has evolved into one of the nation's largest wine and spirits wholesalers. Our success is grounded in our core values of Family, Service, Accountability, Honesty, and Professionalism. We offer a vibrant, inclusive culture and workplace experience for individuals who want a career that makes them feel accomplished and engaged. RNDC values the health and well-being of our associates, inside and outside the office, offering dynamic health and wellness benefits that supply exceptional care and value. RNDC is geared toward growing our footprint and our people. Join our team of energetic professionals who believe in many happy hours and are experts in our craft.<br/><br/><strong>Summary<br/><br/></strong>RNDC is looking for an Innovative and proficient Inventory Control Manager to join our Amazing RNDC team. The Inventory Control Manager will oversee warehousing inventory operations, manage warehouse employees, company safety processes, and that all company SOPs are being followed. The role will also be responsible to manage KPI's to ensure all goals are being met.<br/><br/><strong>In this role, you will<br/><br/></strong><ul><li>To ensure that inventory physically exists and that the stated quantities of inventory are accurately stated in their various conditions and their various locations. Communicate and coordinate timely receiving, organization, and storage of products in warehouse. </li><li>To create standard operating procedures (SOP'S) to ensure products are received, put away and shipped correctly. Supervise the inventory return process in the assigned warehouse. </li><li>Ensures safe handling and proper documentation of breakage. Research and apply corrective actions for shortages, filling errors, not-on-trucks, breakage, and incorrect invoices. Manages warehouse company safety processes. </li><li>Establish a strong inventory control presence in our distribution operations that acts as a deterrent against theft and procedural misconduct. Investigate inventory shortages and discrepancies and correct them. This would include the following daily activities: Reviewing “variance” and “No Stock” reports to track down items such as receiving errors shipping errors, letdown errors, cycle and walk-off miscounts, keypunch errors, system errors (both AS400 and RA6000), failed upload, no uploads, orders shipped but not purged, erroneous credits, pre-receiving's received twice, orders shipped twice on the RS6000. </li><li>Conduct cycle counts and product walk-offs to ensure product location accuracy. Helps with the preparation and distribution of O S &amp; D's. Prepares for and helps conduct statewide physical inventory counts. Work with Operations Manager to make sure our unsellable products are continually invoiced and destroyed. Prepares destruction affidavits for destruction of unsellable products. </li><li>Work with Customer Service to research errors on customer invoices. Promote ongoing best-in-class customer service throughout all positions in warehouse operations. </li><li>Support warehouse operations and ensure a safe, clean, and orderly warehouse. </li><li>This position is required to serve as information resources for employees, and conduits between them and upper company's management. This position is accountable for 3 Warehouse leads. This position is required to hire, to use corrective action, to terminate, and to handle employee relations issues. <br/><br/></li></ul><strong>What you bring to RNDC<br/><br/></strong>A Bachelor's degree (B. A.) from an accredited four-year college or university with a concentration in Business or in related fields; AND 3 to 5 years of experience as an operations or warehouse supervisor; AND experience in managing union and non-union employees, including grievances. This position will require the ability to read, analyze, and interpret general business periodicals, technical procedures, or governmental regulations. This role also will require the ability to write reports, business correspondence, and procedure manuals. This position will further require the ability to effectively present information and responds to questions from groups of managers. This role will require the ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume. This position will require the ability to apply concepts of basic algebra and geometry. This position will require the ability to define problems, collect data, establish facts, and draw valid conclusions. This role also will require the ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. Certificates, Licenses, Registrations: Certified Production &amp; Inventory Management (CPIM) SKILLS/ABILITIES: Proficient in Windows environment and Microsoft Office (Excel, PowerPoint, Word, etc.) environment. Must have working knowledge of Federal and Cal OSHA regulations. Must have excellent communication skills / both formal and informal. Must have ability to communicate effectively at all levels of the organization. Must possess continuous improvement mindset. Thorough understanding of warehouse cost structure. Able to interpret cost build up, trends, and monthly financial reports. Highly collaborative leadership style. Exceptional project management skills. Ability to multitask.<br/><br/><strong>What's In It For You<br/><br/></strong><ul><li>401(k) with company matching </li><li>Medical, dental and vision benefits* </li><li>Generous paid time off program – work your way up to 5 weeks of PTO a year with the ability to carryover unused PTO </li><li>Paid volunteer time </li><li>Paid parental leave </li><li>Paid caregiver leave </li><li>Fertility benefits </li><li>Paid training </li><li>Company paid life insurance, short-term disability, and company-paid holidays </li><li>Associate resource groups, and diversity, equity, and inclusion programs available for all associates</li><li>Participation in these programs are subject to applicable wait periods and all plan and program terms and eligibility<br/><br/></li></ul><strong>COVID-19 Considerations<br/><br/></strong>We follow CDC Guidelines and have a fun and safe environment for our teams.<br/><br/><strong>Bonus if you bring<br/><br/></strong><ul><li>Bachelor's degree </li><li>Previous experience in the Wine and Spirits industry </li><li>WSET certification </li><li>Lean Six Sigma, or similar training </li><li>Bilingual in Spanish <br/><br/></li></ul>Republic National Distributing Company and National Distributing Company are Equal Opportunity/Affirmative Action employers. It is our policy not to discriminate against any Employee or Applicant. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, age, status as a protected veteran, among other things, or status as a qualified individual with disability. This policy of nondiscrimination in employment includes but is not limited to: recruitment, hiring, placement, promotion, transfer, employment advertising or solicitations, compensation, layoff or termination of employment.<br/><br/>RNDC is committed to providing reasonable accommodation to people with disabilities throughout the job application and interview process, to the point of undue hardship. If you require an accommodation during the application or interview process, please click here.", "responsibilities": "To ensure that inventory physically exists and that the stated quantities of inventory are accurately stated in their various conditions and their various locations. Communicate and coordinate timely receiving, organization, and storage of products in warehouse. \nTo create standard operating procedures (SOP'S) to ensure products are received, put away and shipped correctly. Supervise the inventory return process in the assigned warehouse. \nEnsures safe handling and proper documentation of breakage. Research and apply corrective actions for shortages, filling errors, not-on-trucks, breakage, and incorrect invoices. Manages warehouse company safety processes. \nEstablish a strong inventory control presence in our distribution operations that acts as a deterrent against theft and procedural misconduct. Investigate inventory shortages and discrepancies and correct them. This would include the following daily activities: Reviewing “variance” and “No Stock” reports to track down items such as receiving errors shipping errors, letdown errors, cycle and walk-off miscounts, keypunch errors, system errors (both AS400 and RA6000), failed upload, no uploads, orders shipped but not purged, erroneous credits, pre-receiving's received twice, orders shipped twice on the RS6000. \nConduct cycle counts and product walk-offs to ensure product location accuracy. Helps with the preparation and distribution of O S &amp; D's. Prepares for and helps conduct statewide physical inventory counts. Work with Operations Manager to make sure our unsellable products are continually invoiced and destroyed. Prepares destruction affidavits for destruction of unsellable products. \nWork with Customer Service to research errors on customer invoices. Promote ongoing best-in-class customer service throughout all positions in warehouse operations. \nSupport warehouse operations and ensure a safe, clean, and orderly warehouse. \nThis position is required to serve as information resources for employees, and conduits between them and upper company's management. This position is accountable for 3 Warehouse leads. This position is required to hire, to use corrective action, to terminate, and to handle employee relations issues. ", "qualifications": {"required": "A Bachelor's degree (B. A.) from an accredited four-year college or university with a concentration in Business or in related fields; AND 3 to 5 years of experience as an operations or warehouse supervisor; AND experience in managing union and non-union employees, including grievances. This position will require the ability to read, analyze, and interpret general business periodicals, technical procedures, or governmental regulations. This role also will require the ability to write reports, business correspondence, and procedure manuals. This position will further require the ability to effectively present information and responds to questions from groups of managers. This role will require the ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume. This position will require the ability to apply concepts of basic algebra and geometry. This position will require the ability to define problems, collect data, establish facts, and draw valid conclusions. This role also will require the ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. Certificates, Licenses, Registrations: Certified Production &amp; Inventory Management (CPIM) SKILLS/ABILITIES: Proficient in Windows environment and Microsoft Office (Excel, PowerPoint, Word, etc.) environment. Must have working knowledge of Federal and Cal OSHA regulations. Must have excellent communication skills / both formal and informal. Must have ability to communicate effectively at all levels of the organization. Must possess continuous improvement mindset. Thorough understanding of warehouse cost structure. Able to interpret cost build up, trends, and monthly financial reports. Highly collaborative leadership style. Exceptional project management skills. Ability to multitask.", "preferred": "Bachelor's degree \nPrevious experience in the Wine and Spirits industry \nWSET certification \nLean Six Sigma, or similar training \nBilingual in Spanish"}, "skills": ["Microsoft Office", "Excel", "PowerPoint", "Word", "Federal and Cal OSHA regulations", "Communication", "Continuous improvement", "Warehouse cost structure", "Leadership", "Project management"], "postedDate": "10 months ago", "benefits": "401(k) with company matching \nMedical, dental and vision benefits* \nGenerous paid time off program – work your way up to 5 weeks of PTO a year with the ability to carryover unused PTO \nPaid volunteer time \nPaid parental leave \nPaid caregiver leave \nFertility benefits \nPaid training \nCompany paid life insurance, short-term disability, and company-paid holidays \nAssociate resource groups, and diversity, equity, and inclusion programs available for all associates\nParticipation in these programs are subject to applicable wait periods and all plan and program terms and eligibility", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3733465711"}