{"jobTitle": "Corporate Account Executive", "company": {"name": "Staffbase", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "77,500.00/yr - 87,500.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "About Staffbase<br/><br/>In a polarized world, we inspire people to achieve great things together. Our mission is to help organizations unlock the power of inspirational communication so they can thrive in the Narrative Age. Our award-winning communications channels - intranet, employee app and email - deliver experiences that drive engagement and inspire hearts and minds.<br/><br/>We're headquartered in Chemnitz, Germany, with offices in many locations throughout the world, including New York, London, Berlin and Dresden. Our international team counts more than 750 employees from 45+ nationalities and we have a growing base of 2200+ customers that want to transform their employee experience. We are rapidly scaling, post-Series E ($115 million funding), have strong-growing revenue, and our customers love us.<br/><br/>Staffbase is seeking a dynamic and results-driven Account Executive to join our growing team. As an Account Executive, you will be responsible for driving sales and revenue growth by identifying and cultivating relationships with potential clients. The ideal candidate possesses excellent communication and negotiation skills, a deep understanding of the employee communication landscape, and a proven track record of exceeding sales targets.<br/><br/>What you'll be doing <br/><br/> <ul><li>Become an expert on employee communication and engagement strategies</li><li>Close new business and drive revenue at or above quota level</li><li>Serve as a brand enthusiast for Staffbase</li><li>Build relationships with prospects and internal stakeholders</li><li>Manage and control complex sales cycles and leverage necessary resources</li><li>Work collaboratively with Marketing and Customer Success teams</li><li>Bring your strategies and ideas to advance our company's values, unique culture, and vision for the future<br/><br/></li></ul>What you need to be successful<br/><br/> <ul><li>Min. 2+ years of experience in Enterprise SaaS sales producing and exceeding targets, ideally within web technology, collaboration, communication, or an innovative online product environment</li><li>Bachelor's degree, MBA and/or sales training certification is a plus</li><li>Experience in a start-up/scale-up environment preferred</li><li>Experience working with communications teams, IT, HR, and C-level executives</li><li>Emotional intelligence and the ability to really listen to and understand your prospects</li><li>Tons of passion, humor, and enthusiasm</li><li>Superior communication and closing skills<br/><br/></li></ul>What you'll get<br/><br/> <ul><li>Competitive Compensation - we offer attractive salary packages including an Employee Stock Option Plan. </li><li>Flexibility - we offer flexible working time models and the option of hybrid work, and support this with a yearly flex work allowance of $1608. </li><li>Growth Budget - all employees get a yearly budget for external training of $1100. </li><li>Wellbeing - in addition to 30 days PTO and 10 wellness days, we're running a 4-day-work week every year in August. </li><li>Support - we're offering a 401(k) plan with company match and health plans, including dental &amp; vision. Parents can get 12 weeks of paid parental leave. </li><li>Snacks - The offices are equipped with fruits, drinks and snacks. </li><li>Team Building - Regular team and office events including the yearly Staffbase Camp</li><li>Volunteer Day - you'll get one day off per year for supporting a social project. We will donate a small amount for that project in addition.</li><li>Employee Referral Program - one of your friends is a fit to one of our full-time openings? Refer them and get a referral bonus paid.<br/><br/></li></ul>In compliance with local law, we are disclosing the compensation, or a range thereof, for roles that will be performed in New York City. Actual salaries will vary and may be above or below the range based on various factors including but not limited to location, experience, and performance. The range listed is just one component of Staffbase's total compensation package for employees. Pay Range: $77,500-$87,500 base salary per year. Other rewards may include commissions and program-specific awards. In addition, Staffbase provides a variety of benefits to employees, including health insurance coverage, equity, paid parental leave, an employee growth budget, life and disability insurance, a retirement savings plan, wellness days, paid holidays and paid time off (PTO).<br/><br/>We Love Diversity - Equal Employment Opportunity<br/><br/>Our platforms are for everyone, and so is our workplace. We are passionate about equity, inclusion, and diversity at Staffbase. Read more about our policies here.<br/><br/>Our Global Benefits<br/><br/>Employee Stock Option Plan (ESOP)<br/><br/>Staffbase offers you a benefit plan which entitles you to an ownership interest in stock options in the company. We're in business to create value for our shareholders and we want our employees to benefit from that shared success as well.<br/><br/>Ongoing Learning<br/><br/>We thrive on personal and professional growth. Every employee gets EUR 1,000 / USD 1,100 / GBP 900 / CAD 1,400 / RON 5,000 / AUD 1,600 gross per year to spend on personal and professional development.<br/><br/>Feel Good Fridays<br/><br/>Summertime means extended vacation time at Staffbase! During August we run the 4-days workweek which means that during this month Fridays are off for all employees.<br/><br/>Flexibility<br/><br/>We offer different working time models and hybrid work set ups, to get the best office and working-from-home experience at once.<br/><br/>Parental Leave<br/><br/>We recognize that one of the most special events in an individual's life is the birth or adoption of a child. We offer paid parental leave options for all employees.", "responsibilities": "Become an expert on employee communication and engagement strategies\nClose new business and drive revenue at or above quota level\nServe as a brand enthusiast for Staffbase\nBuild relationships with prospects and internal stakeholders\nManage and control complex sales cycles and leverage necessary resources\nWork collaboratively with Marketing and Customer Success teams\nBring your strategies and ideas to advance our company's values, unique culture, and vision for the future", "qualifications": {"required": "Min. 2+ years of experience in Enterprise SaaS sales producing and exceeding targets, ideally within web technology, collaboration, communication, or an innovative online product environment", "preferred": "Bachelor's degree, MBA and/or sales training certification is a plus\nExperience in a start-up/scale-up environment preferred\nExperience working with communications teams, IT, HR, and C-level executives\nEmotional intelligence and the ability to really listen to and understand your prospects\nTons of passion, humor, and enthusiasm\nSuperior communication and closing skills"}, "skills": ["SaaS", "Sales", "Communication", "Negotiation", "Customer Relationship Management (CRM)"], "postedDate": "8 months ago", "benefits": "Competitive Compensation - we offer attractive salary packages including an Employee Stock Option Plan. \nFlexibility - we offer flexible working time models and the option of hybrid work, and support this with a yearly flex work allowance of $1608. \nGrowth Budget - all employees get a yearly budget for external training of $1100. \nWellbeing - in addition to 30 days PTO and 10 wellness days, we're running a 4-day-work week every year in August. \nSupport - we're offering a 401(k) plan with company match and health plans, including dental &amp; vision. Parents can get 12 weeks of paid parental leave. \nSnacks - The offices are equipped with fruits, drinks and snacks. \nTeam Building - Regular team and office events including the yearly Staffbase Camp\nVolunteer Day - you'll get one day off per year for supporting a social project. We will donate a small amount for that project in addition.\nEmployee Referral Program - one of your friends is a fit to one of our full-time openings? Refer them and get a referral bonus paid.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3775380480"}