{"jobTitle": "Product Manager (Remote)", "company": {"name": "Rise25", "location": "Chicago, IL"}, "location": "Chicago, IL", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Internet Publishing", "description": "Job Details:<br/><br/>Want to help entrepreneurs all over the world build life-changing relationships and inspiring content? Through done-for-you B2B podcast services and our Podcast Copilot platform, we help businesses grow, expand their outreach, and leave a lasting legacy.<br/><br/>We are seeking a highly motivated and experienced Product Manager to assist in the development of innovative digital products. As a remote Product Manager, you will play a pivotal role in driving our product vision, defining strategies, and bringing to market features that meet the needs of our customers. You will work closely with cross-functional teams to ensure the successful execution of product initiatives.<br/><br/>Job Description:<br/><br/>The Product Manager will be responsible for the end-to-end management of digital products, from conceptualization to launch and post-launch performance analysis. The ideal candidate will have a strong background in product management, a passion for technology, and a proven track record of delivering exceptional digital products. You will need to be a strategic thinker with an analytical mind and have the ability to work independently in a fully remote environment.<br/><br/>This is a role that will initially start part time but could expand over time into more of a full time role.<br/><br/>Key Responsibilities:<br/><br/><ul><li>Define and articulate product vision and strategy, aligning with company goals and user needs</li><li>Conduct market research to identify customer demands, market trends, and competitive landscape</li><li>Collaborate with UX/UI designers, engineers, and other stakeholders to create and prioritize product roadmaps</li><li>Write clear and concise product requirements and user stories, ensuring technical feasibility and clear communication across teams</li><li>Oversee the product development lifecycle, ensuring timely delivery of high-quality products</li><li>Develop and implement product launch plans, working closely with marketing, sales, and customer support teams</li><li>Monitor product performance metrics and conduct data analysis to inform product decisions and improvements</li><li>Gather and incorporate feedback from customers, stakeholders, and other teams to refine product features and functionality</li><li>Stay abreast of new technologies and methodologies that may improve product development processes or offer innovative solutions to users</li><li>Lead and facilitate agile ceremonies, such as sprint planning, reviews, and retrospectives<br/><br/></li></ul>This position is location-independent and self-paced.<br/><br/>You must be good at self-direction and taking initiative. In addition, it is important to us that all of our team members are detail-oriented and meticulous; therefore, in the application form below, when it asks for your “favorite vegetable?” please fill in the word “eggplant.”<br/><br/>Required Skills:<br/><br/><ul><li>Proven experience as a Product Manager or similar role in digital product development</li><li>Strong understanding of the software development lifecycle and agile methodologies</li><li>Excellent analytical and problem-solving skills, with a data-driven approach to decision-making</li><li>Proficient in product management tools (e.g., Clickup) and analytics platforms (e.g., Google Analytics, Mixpanel)</li><li>Strong leadership skills with the ability to influence cross-functional teams without formal authority</li><li>Exceptional communication and presentation skills, with the ability to articulate complex concepts to a diverse audience</li><li>Experience with user-centered design principles and practices</li><li>Ability to work independently and manage multiple projects simultaneously in a remote environment</li><li>Bachelor’s degree in Business, Computer Science, Engineering, or related field</li><li>We offer a dynamic work environment, competitive salary, and the opportunity to make a significant impact in a growing company. If you are passionate about product management and excited about the opportunity to develop cutting-edge digital products, we would love to hear from you<br/><br/></li></ul>Who We Are:<br/><br/>Rise25, LLC is a company on a mission to help businesses connect with their ideal prospects, referral partners, and strategic partners using a podcast.<br/><br/>Rise25 is also the creator of Podcast Copilot, also known as the “Wix” or “Squarespace” of B2B podcasting.<br/><br/>Co-founders Dr. Jeremy Weisz, a chiropractor turned serial entrepreneur, and John Corcoran, a former White House writer and speechwriter, were early adopters of the podcasting medium and between them have over 22+ years of experience with podcasting. Today, Rise25 works with top-notch B2B businesses around the globe, including one of the nation’s largest ticket sellers, consulting firms, law firms, and more. Learn more at: www.Rise25.com/about<br/><br/>Why Rise25:<br/><br/>The team at Rise25 prioritizes flexibility, so you can work where and when you want, as long as you get your job done. Although we have team members all across the globe, we strive to build a culture of one team working together toward a common goal.<br/><br/>Monthly Book and Masterclass Club meetings - One of our core values is to Keep Learning, so we pay for our entire team to join our Book and Masterclass Club, where we have monthly meetings to discuss one book or masterclass we have all read or watched together.<br/><br/>Monthly video team meetings - We meet as a team once a month to celebrate each member’s personal and professional successes and participate in team-building activities.<br/><br/>New team member mentoring sessions - Experienced team members meet one-on-one or in small groups with new team members to help them get onboarded, answer questions, and welcome them to the team.<br/><br/>Powered by JazzHR<br/><br/>V3MET5c1lI", "responsibilities": "<ul><li>Define and articulate product vision and strategy, aligning with company goals and user needs</li><li>Conduct market research to identify customer demands, market trends, and competitive landscape</li><li>Collaborate with UX/UI designers, engineers, and other stakeholders to create and prioritize product roadmaps</li><li>Write clear and concise product requirements and user stories, ensuring technical feasibility and clear communication across teams</li><li>Oversee the product development lifecycle, ensuring timely delivery of high-quality products</li><li>Develop and implement product launch plans, working closely with marketing, sales, and customer support teams</li><li>Monitor product performance metrics and conduct data analysis to inform product decisions and improvements</li><li>Gather and incorporate feedback from customers, stakeholders, and other teams to refine product features and functionality</li><li>Stay abreast of new technologies and methodologies that may improve product development processes or offer innovative solutions to users</li><li>Lead and facilitate agile ceremonies, such as sprint planning, reviews, and retrospectives<br/><br/></li></ul>", "qualifications": {"required": "Proven experience as a Product Manager or similar role in digital product development, Strong understanding of the software development lifecycle and agile methodologies, Excellent analytical and problem-solving skills, with a data-driven approach to decision-making, Proficient in product management tools (e.g., Clickup) and analytics platforms (e.g., Google Analytics, Mixpanel), Strong leadership skills with the ability to influence cross-functional teams without formal authority, Exceptional communication and presentation skills, with the ability to articulate complex concepts to a diverse audience, Experience with user-centered design principles and practices, Ability to work independently and manage multiple projects simultaneously in a remote environment, Bachelor’s degree in Business, Computer Science, Engineering, or related field", "preferred": ""}, "skills": ["Product Management", "Agile Methodologies", "Market Research", "Product Development", "User Experience (UX)", "User Interface (UI)", "Data Analysis", "Product Requirements", "User Stories", "Product Launch", "Communication", "Presentation Skills", "Leadership", "Teamwork", "Remote Work", "Clickup", "Google Analytics", "Mixpanel"], "postedDate": "8 months ago", "benefits": "The team at Rise25 prioritizes flexibility, so you can work where and when you want, as long as you get your job done. Although we have team members all across the globe, we strive to build a culture of one team working together toward a common goal.<br/><br/>Monthly Book and Masterclass Club meetings - One of our core values is to Keep Learning, so we pay for our entire team to join our Book and Masterclass Club, where we have monthly meetings to discuss one book or masterclass we have all read or watched together.<br/><br/>Monthly video team meetings - We meet as a team once a month to celebrate each member’s personal and professional successes and participate in team-building activities.<br/><br/>New team member mentoring sessions - Experienced team members meet one-on-one or in small groups with new team members to help them get onboarded, answer questions, and welcome them to the team.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3787799220"}