{"jobTitle": "Outside Account Executive", "company": {"name": "Sauce", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "120,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Sauce is a premier restaurant technology platform that helps businesses grow with our Commission-Free Delivery & Pickup structure and proprietary delivery optimization technology. We are serving a 105 billion dollar US local restaurant business. Headquartered in Miami, NYC and Tel-Aviv, Sauce wants restaurants to fulfill their highest potential, this means giving local establishments everything they need to connect directly with their customers. The Sauce team pools together decades of restaurant tech experience, along with seasoned tech, sales, marketing, product and operations executives who produce an industry-changing delivery system for successful local restaurants and chains.<br/><br/>We put the restaurant brand first. The Sauce Sales team is on a mission to reinvent the delivery industry for restaurants around the United States (and beyond!). Sauce Outside Account Executives (AE's) are trusted advisors who build real relationships, approaching every interaction with potential restaurant partners consultatively to identify any existing delivery business gaps, while thinking creatively to introduce the best possible solution. We are re-envisioning the current delivery market by allowing restaurant owners and operators to own their delivery business (inclusive of their customer data), reducing their dependency on 3rd party ordering platforms. A growing team of experienced and determined sales people, we are ready to share our 1st party delivery platform with the world, and to really show what it means to be a partner to restaurants.<br/><br/>This is a Field Sales role and reports directly to the VP of Sales at Sauce!<br/><br/><strong>What You'll Do<br/><br/></strong><ul><li>Acquire New Restaurants for Our Platform: Develop and grow a pipeline of restaurants and hospitality groups by being out in the field</li><li>Set Expectations: Work on setting the right expectations with your restaurant partners to set them up for success in the long run</li><li>Be an Industry Expert: Master the value proposition of the Sauce platform to help operators understand how we can help their business</li><li>Conduct Demos: Conduct meetings and demos in person with decision makers at their restaurants</li><li>Own the Full Sales Cycle: Own 100% of the sale from prospecting, pitching, negotiation, contracts and through to go-live: including live product demonstrations, follow-ups, agreement signing, etc</li><li>Be a Trusted Consultant: Build relationships with your partners and always advocate for Sauce clients to ensure their success<br/><br/><br/><br/><br/></li></ul><strong>What You Bring<br/><br/></strong><ul><li>Based in or around the New York City Metropolitan Area</li><li>3+ years of Restaurant Technology SMB sales experience in NYC</li><li>Ability to conduct Face-to-face and Virtual Presentations with restaurant owners and managers</li><li>Autonomous in your work and able to work both in-office and remotely</li><li>Technologically savvy and can learn new tools</li><li>Perform daily responsibilities with a drive for results</li><li>Experience with HubSpot, Slack, and equivalent tools</li><li>Restaurant / Hospitality experience a plus<br/><br/><br/><br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Strong & Competitive Compensation Package ($120-150k OTE)</li><li>Company-Sponsored Insurance Package (Health, Dental, Vision, Mental Health)</li><li>Paid Parental Leave</li><li>Flexible Work Environment</li><li>Responsible Paid Time Off Policy</li><li>Monthly Team Dinners & Activities!</li><li>The Opportunity to Build Something that Changes the Delivery Tech Industry for the Better!<br/><br/><br/><br/><br/></li></ul><em>Sauce is an equal opportunity workplace and an affirmative action employer. We welcome all qualified applicants regardless of race, color, ancestry, religion, sex (including pregnancy and related conditions), national origin, sexual orientation, age, marital status, disability (physical or mental), gender identity, gender expression, genetic information, veteran status, citizenship, immigration status, or any other classification, category or characteristic protected by applicable federal, state or local laws. We understand the importance of creating a more diverse and inclusive workplace and celebrate our employees for their differences.<br/><br/></em>This salary is the total On-Target Earnings (OTE) for this role, with a base + commission compensation structure.", "responsibilities": "Acquire New Restaurants for Our Platform: Develop and grow a pipeline of restaurants and hospitality groups by being out in the field\nSet Expectations: Work on setting the right expectations with your restaurant partners to set them up for success in the long run\nBe an Industry Expert: Master the value proposition of the Sauce platform to help operators understand how we can help their business\nConduct Demos: Conduct meetings and demos in person with decision makers at their restaurants\nOwn the Full Sales Cycle: Own 100% of the sale from prospecting, pitching, negotiation, contracts and through to go-live: including live product demonstrations, follow-ups, agreement signing, etc\nBe a Trusted Consultant: Build relationships with your partners and always advocate for Sauce clients to ensure their success", "qualifications": {"required": "Based in or around the New York City Metropolitan Area\n3+ years of Restaurant Technology SMB sales experience in NYC\nAbility to conduct Face-to-face and Virtual Presentations with restaurant owners and managers\nAutonomous in your work and able to work both in-office and remotely\nTechnologically savvy and can learn new tools\nPerform daily responsibilities with a drive for results\nExperience with HubSpot, Slack, and equivalent tools\nRestaurant / Hospitality experience a plus"}, "skills": ["HubSpot", "Slack", "Sales", "Restaurant Technology", "Business Development"], "postedDate": "8 months ago", "benefits": "Strong & Competitive Compensation Package ($120-150k OTE)\nCompany-Sponsored Insurance Package (Health, Dental, Vision, Mental Health)\nPaid Parental Leave\nFlexible Work Environment\nResponsible Paid Time Off Policy\nMonthly Team Dinners & Activities!\nThe Opportunity to Build Something that Changes the Delivery Tech Industry for the Better!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3795800419"}