{"jobTitle": "Enterprise Account Executive", "company": {"name": "Compass", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "90,000.00/yr - 110,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Real Estate", "description": "At Compass, our mission is to help everyone find their place in the world. Founded in 2012, we’re revolutionizing the real estate industry with our end-to-end platform that empowers residential real estate agents to deliver exceptional service to seller and buyer clients.<br/><br/><strong>Summary<br/><br/></strong><ul><li>This is a fully onsite role and will report into our HQ New York City office. </li><li>Our Strategic Growth team is the face of the company and the engine of our market expansion. As a Strategic Growth Manager, you are directly responsible for driving net-new revenue.</li><li>In its simplest form, the SGM’s role is to bring top producing agents to Compass by effectively selling the Compass value proposition (technology, marketing, culture and growth). Successful SGMs influence top agents to leave their current brokerage and join Compass. Since every agent is an independent contractor they can take their business wherever they receive the best value and support.</li><li>The refreshing part of this sale is that you are working directly with decision-makers, thus eliminating many of the hassles of selling to large corporations.<br/><br/></li></ul><strong>METRICS<br/><br/></strong><ul><li>This is a quota carrying role. Your quota per quarter is metric’d by the amount of Gross Commission Income (GCI) you successfully bring to Compass. GCI is a way to quantify an agent and equates to the amount of commission an agent’s produced in the prior 12 month period. Our deal size is anywhere from $200k - $3M+, with an average time to close at about 30 days.</li><li>You can meet quota each quarter by bringing on a number of individual agents or large agent teams. Your quota is based on the prior 12 months performance of that agent or team. It is not contingent upon their future production once at Compass.</li><li>You are tasked with helping agents understand why their business, and their clients, will benefit by moving to Compass.<br/><br/></li></ul><strong>NUANCES<br/><br/></strong><ul><li>This is a more humanized sale than your average sales process as you are dealing directly with decision makers. You can think of every agent as the CEO of their own business - with that comes a heightened degree of empathy needed to be successful in the sale, but also the ability for quick decisions.</li><li>Think about a top producing agent who’s been with a brokerage for 15+ years. Their personal and professional identity is often wrapped up in that brokerage’s brand. Successfully decoupling an agent from their prior brokerage takes outstanding patience, listening, agility and ultimate focus to get the deal done.</li><li>The equally demanding need for high IQ and EQ in this role has resulted in an incredibly high performing and driven team of diverse backgrounds such as investment banking, management consulting, law and enterprise sales.</li><li>By virtue of the space we are operating in, the talent on the team and the incredible momentum in our business, we are seeing our SGM’s conservatively generate 15x more revenue per head than the top tech firms in the world.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>B.A. or B.S. with 5+ years of relevant experience</li><li>Strong interpersonal skills, glass-half-full mentality</li><li>Self-starter attitude and ability to exercise judgment and solve difficult problems without direct supervision</li><li>Excellent communication skills; ability to effectively lead client meetings and presentations</li><li>Highly organized; ability to multi-task and handle multiple deadlines simultaneously</li><li>Track record of excellence across strategic, operational, and detail-demanding functional responsibilities<br/><br/></li></ul>The base pay range for this position is $90,000-$110,000 annually; however, base pay offered may vary depending on job-related knowledge, skills, and experience. Bonuses and restricted stock units may be provided as part of the compensation package, in addition to a full range of benefits. Base pay is based on market location. Minimum wage for the position will always be met.<br/><br/><strong>Perks That You Need To Know About<br/><br/></strong>Participation in our incentive programs (which may include where eligible cash, equity, or commissions). Plus paid vacation, holidays, sick time, parental leave, marriage leave, and recharge leave; medical, tele-health, dental and vision benefits; 401(k) plan; flexible spending accounts (FSAs); commuter program; life and disability insurance; Maven (a support system for new parents); Carrot (fertility benefits); UrbanSitter (caregiver referral network); Employee Assistance Program; and pet insurance.<br/><br/><strong>Do your best work, be your authentic self.<br/><br/></strong>At Compass, we believe that everyone deserves to find their place in the world — a place where they feel like they belong, where they can be their authentic selves, where they can thrive. Our collaborative, energetic culture is grounded in our Compass Entrepreneurship Principles and our commitment to diversity, equity, inclusion, growth and mobility. As an equal opportunity employer, we offer competitive compensation packages, robust benefits and professional growth opportunities aimed at helping to improve our employees' lives and careers.<br/><br/>Notice for California Applicants", "responsibilities": null, "qualifications": {"required": "B.A. or B.S. with 5+ years of relevant experience, Strong interpersonal skills, glass-half-full mentality, Self-starter attitude and ability to exercise judgment and solve difficult problems without direct supervision, Excellent communication skills; ability to effectively lead client meetings and presentations, Highly organized; ability to multi-task and handle multiple deadlines simultaneously, Track record of excellence across strategic, operational, and detail-demanding functional responsibilities", "preferred": null}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": null, "benefits": "Participation in our incentive programs (which may include where eligible cash, equity, or commissions). Plus paid vacation, holidays, sick time, parental leave, marriage leave, and recharge leave; medical, tele-health, dental and vision benefits; 401(k) plan; flexible spending accounts (FSAs); commuter program; life and disability insurance; Maven (a support system for new parents); Carrot (fertility benefits); UrbanSitter (caregiver referral network); Employee Assistance Program; and pet insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3796798772"}