{"jobTitle": "Wholesale Account Executive - Leading Beauty Brand", "company": {"name": "Monday Talent", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000-$85,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Health and Personal Care Products", "description": "Job Title: Wholesale Account Executive\n\nPosition Type: Full-Time\n\nLocation: NYC | In-office Wednesday-Friday\n\nSalary: $75,000-$85,000 base (depending on experience) + uncapped commission\n\nAre you looking for an opportunity to work with a growing artistry brand and support a company that focuses on self-expression and innovation? If so, please continue reading!\n\nThis innovative and leading beauty brand is seeking a dynamic and results-driven Wholesale Account Executive to join their team. The ideal candidate will be a true sales professional with a proven track record of success and significant experience in the beauty industry. This role requires a proactive individual who is capable of driving new business and expanding the brand. If you are a creative and visionary leader, we want to hear from you!\n\nResponsibilities: \n\n* Develop and implement sales strategies to achieve and exceed revenue targets.\n* Collaborate with clients to understand their needs, provide product knowledge, and offer customized solutions.\n* Stay informed about market trends and competitors.\n* Articulate the brand’s value proposition compellingly and persuasively.\n* Provide in-depth product knowledge to clients, highlighting unique selling points and benefits.\n\nQualifications: \n\n* Demonstrated success in achieving and exceeding sales targets.\n* Strong organizational skills with attention to detail.\n* A well-spoken individual who can maintain strong relationships with retailers.\n* Self-motivated and results-oriented.\n* Excelled verbal and written communication skills.\n\nAt Monday Talent, we understand that not everyone has had the same opportunities to gain experience and develop their skills. We're committed to changing that. We partner with organizations that understand the importance of building diverse, equitable, and inclusive workplaces. If you are passionate about your work and eager to learn, we encourage you to apply even if you don't meet all the requirements listed in the job description.\n\nClick 'Easy Apply' to be considered for this opportunity or share this job posting with a friend who may be interested and you could be eligible for our referral reward program!", "postedDate": "23 hours ago", "benefits": null, "remoteWork": "No", "responsibilities": "Develop and implement sales strategies to achieve and exceed revenue targets.\nCollaborate with clients to understand their needs, provide product knowledge, and offer customized solutions.\nStay informed about market trends and competitors.\nArticulate the brand’s value proposition compellingly and persuasively.\nProvide in-depth product knowledge to clients, highlighting unique selling points and benefits.", "qualifications": {"required": "Demonstrated success in achieving and exceeding sales targets.\nStrong organizational skills with attention to detail.\nA well-spoken individual who can maintain strong relationships with retailers.\nSelf-motivated and results-oriented.\nExcelled verbal and written communication skills.", "preferred": null}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3797032320"}