{"jobTitle": "Sales VP’s, National Account Manager, and / or Regional Sales Managers", "company": {"name": "GHA Technologies, Inc", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Business Development, Information Technology, and Sales", "industry": "IT Services and IT Consulting, Computer and Network Security, and Computer Hardware Manufacturing", "description": "Financial Highlights – Enjoy an Immediate Pay Raise!\n<br/>\n$2,500 First Week Training Pay for the first five training days.\n$500 per virtual appointment bonus with food with no bonus limit.\nUp to $1500 per week for meeting minimum call and one qualified onsite appointment.\n200% of the profit margin for the first 90 days of orders shipped.\n40% to 59% of the profit margin after 90 days\nUp to $10k new client account credits\nUp to $5k new account donation credits\nUp to $400 of gift cards for business building activities\n$20,000 Fast Start Bonus available for the first 90 days!\n<br/>\nGHA Technologies, Inc. has become the #1 Employee-Owned Value-Added Reseller in America. Past rewards have included #1 Microsoft Western Region VAR, #1 fastest growing company in Arizona, #69 on the CRN Solution Provider 500, #15 2018 CRN Fast Growth 150 List.\n<br/>\nWe sell the latest AI technologies from Nvidia, Supermicro, Dell, HP, Microsoft, Google, Cisco, Lenovo, Apple, VMWare, Adobe, APC, IBM, Nutanix, EMC, Pure Storage, Samsung, Intel, Eaton, and all the hottest AI and Green Data Center, Virtualization, Energy Conservation, Cloud, Storage, Security, Wireless, SD Wan, Video, Identification, solar, and battery technologies! We also specialize in mission critical product procurement and integration services for some of the largest Corporate, Government, and Education clients in America! Our client base is a who's who of corporate America!\n<br/>\nGHA employee owners will receive stock shares every year on top of our industry leading commissions, bonuses, and promotional offerings!\n<br/>\nMission critical, online, vast E Commerce distribution network coast-to-coast warehouse locations support just-in-time delivery.\n<br/>\nSuper convenient, orders placed by 9:00 p.m. EST (8:00 p.m. CST) can be received the next morning for in-stock items.\n<br/>\nSecure, 24-hour access to your own personal portal customized with special pricing on more than 2 million top selling products from 3,500 manufacturers in the USA and across the globe.\n<br/>\nWe are currently HIRING industry experienced Sales Professionals nationwide.\n<br/>\nWe offer a highly lucrative earnings and benefits package with top salespeople earning between $50,000 to $2,000,000 annually. W-2 Employment, Medical, Dental, and HSA Benefits, 401K Retirement Plan, and GHA company stock ownership (ESOP) plan.\n<br/>\nPlease email your resume to recruiters@gha-associates.com and schedule a strictly confidential interview\n<br/>\nVisit us at: https://www.gha-associates.com/", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3802443687"}