{"jobTitle": "Executive Assistant", "company": {"name": "Perennial Resources International", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$95,000.00/yr - $110,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services, Investment Banking, and Venture Capital and Private Equity Principals", "description": "Looking for an Executive Assistant in a Midtown Investment Asset management firm. One of the Best. If you are an excellent Executive Assistant with a solid background in a corporate service industry with excellent computer skills and excellent verbal and written skills and you are interested in joining a firm that offers a wonderful collaborative environment, then this role is for you. It reports to high level executives and you will be a critical safety net for the team and the firm. We are looking for someone who has built a career assisting others and knows the level of attention this role demands. You are used to creating a to-do-list, you have great judgement, multitask, and always have backup plans, should something unforeseen arises. You are collaborative, and highly resourceful, composed, and empathetic. You handle the day to day running of the office and you are the point person for everything that comes up. You have a way with people. You expertly leverage relationships to coordinate complicated calendars, prepare documents for meetings, make travel arrangements, and contribute to ad hoc projects. You handle and manage complex travel arrangements using Concur, Calendars, meetings, conference calls, and you are proactive and initiate the willingness to help and assist. You are an Outlook expert and have advanced Microsoft skills. This position offers an excellent salary + Benefits and Bonus.", "postedDate": "2 weeks ago", "skills": ["Microsoft", "Outlook", "Concur", "Travel Arrangements", "Calendar Management", "Meeting Coordination", "Document Preparation", "Relationship Building", "Communication", "Multitasking", "Problem Solving", "Resourcefulness", "Empathy", "Organization", "Time Management"], "url": "https://www.linkedin.com/jobs/view/3804293926"}