{"jobTitle": "Wedding & Honeymoon Travel Planner", "company": {"name": "Travel by Tilly", "location": "Newton, MA"}, "location": "Newton, MA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "Join our dynamic team and immerse yourself in an environment that's all about support, fun, and creating unforgettable memories that last a lifetime! We firmly believe that while things may fade, experiences are forever priceless. Explore a world of growth opportunities, top-notch training, enticing company perks, and the flexibility of working hours tailored to your lifestyle.<br/><br/>You'll embark on a thrilling journey, orchestrating and planning dream vacations for our clients. Dive into the excitement of collaborating with an incredible team, utilizing data analysis to stay ahead of travel trends, and ensuring every client experience is nothing short of exceptional. If you're a self-starter who thrives in a fast-paced, challenging environment, this could be your dream business.<br/><br/>Responsibilities:<br/><br/><ul><li>Effortlessly collect traveler information</li><li>Safeguard client information with the utmost confidentiality</li><li>Seamlessly process deposits and payments</li><li>Verify names and addresses with precision</li><li>Maintain up-to-date client contact information</li><li>Stay abreast of the latest travel restrictions<br/><br/></li></ul>Embark on this journey with us! If you're 18 years or older, residing in the United States, Mexico, or Australia, and equipped with a smartphone or computer with reliable internet, we want you on our team!<br/><br/>Indulge in a flexible schedule with fantastic benefits! Whether you're seeking a full-time or part-time role, relish in discounts, flexible hours, and professional development assistance.<br/><br/>Your adventure begins now! We're seeking enthusiastic individuals comfortable working with minimal supervision. If you're eager to learn, be coachable, and become a vital part of our incredible team, don't miss out on this opportunity!<br/><br/>Powered by JazzHR<br/><br/>3dybmM7Ulf", "postedDate": "7 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3812723962"}