{"jobTitle": "Inventory Manager", "company": {"name": "Pack On The Go", "location": "Pompano Beach, FL"}, "location": "Pompano Beach, FL", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20 - 25 hourly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Consumer Services", "description": "We are looking for an individual who pays great attention to detail and has expertise in organizing items. This position involves supervising and actively participating in the restoration process for client contents, providing both guidance and operational support. The main responsibilities include leading pack-out operations, managing tasks related to content relocation, cleaning, deodorizing, manipulation, and storage. Specialized equipment and cleaning supplies will be utilized in this role.<br/><br/><strong>Benefits Of This Position Include<br/><br/></strong><ul><li>Opportunities for personal and professional growth, with a strong emphasis on learning</li><li>A positive and supportive work environment</li><li>Paid time off and benefits, including 10 paid days off, holidays, and 50% health insurance coverage after 90 days</li><li>A strong commitment to safety</li><li>A collaborative culture that encourages listening and cooperation</li><li>A commitment to diversity and inclusion, fostering a welcoming and respectful environment for all employees, regardless of their background<br/><br/></li></ul>Compensation: $20 - $25 hourly + bonuses", "postedDate": "6 months ago", "benefits": "Opportunities for personal and professional growth, with a strong emphasis on learning, A positive and supportive work environment, Paid time off and benefits, including 10 paid days off, holidays, and 50% health insurance coverage after 90 days, A strong commitment to safety, A collaborative culture that encourages listening and cooperation, A commitment to diversity and inclusion, fostering a welcoming and respectful environment for all employees, regardless of their background", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3823662966"}