{"jobTitle": "Corporate Account Executive", "company": {"name": "Asana", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$91,000.00 - $116,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Our sales team is focused on finding efficient paths to successful, profitable, long term customers by building a user-driven marketing and sales engine. To do so, we employ a bottom-up enterprise sales model by helping many small, successful customers evolve into larger, successful ones. We act as a key voice of the customer to the product team. We help identify and overcome technical, educational, and competitive obstacles to our continued growth.<br/><br/>We're seeking a Corporate Account Executive, who will fuel Asana's expansion into established books of business, uncovering hidden potential and driving exponential growth. You will craft bespoke expansion plans, deepen relationships with key decision-makers, and collaborate with internal teams to create deep, lasting partnerships.<br/><br/>Join Asana's sales team and become a seasoned explorer and a strategic partner for potential clients. Your contribution will be instrumental in our company's growth, while you embark on your own journey of personal and professional development. If you're eager to make a significant impact and refine your sales expertise, we're excited to connect with you!<br/><br/>This role is based in our New York City office with an office-centric hybrid schedule. The standard in-office days are Monday, Tuesday, and Thursday. Most Asanas have the option to work from home on Wednesdays. Working from home on Fridays depends on the type of work you do and the teams with which you partner. If you're interviewing for this role, your recruiter will share more about the in-office requirements.<br/><br/><strong>What You’ll Achieve<br/><br/></strong><ul><li>Craft expansion strategies, analyzing customer needs and finding solutions that unlock untapped potential</li><li>Leverage customer data and industry insights to identify expansion opportunities</li><li>Identify and champion high-impact use cases within different departments, driving adoption beyond initial deployment</li><li>Track and measure key metrics, continuously refining your approach to maximize engagement and value realizatio<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>4+ years of B2B sales experience, demonstrating a proven track record of acquiring new corporate accounts</li><li>A passion for understanding unique business needs and tailoring effective Asana solutions</li><li>Exceptional communication and presentation skills</li><li>A strategic mindset coupled with a data-driven approach to sales</li><li>The ability to thrive in a fast-paced, results-oriented environment<br/><br/></li></ul>At Asana, we're committed to building teams that include a variety of backgrounds, perspectives, and skills, as this is critical to helping us achieve our mission. If you're interested in this role and don't meet every listed requirement, we still encourage you to apply.<br/><br/><strong>What We’ll Offer<br/><br/></strong>Our comprehensive compensation package plays a big part in how we recognize you for the impact you have on our path to achieving our mission. We believe that compensation should be reflective of the value you create relative to the market value of your role. To ensure pay is fair and not impacted by biases, we're committed to looking at market value which is why we check ourselves and conduct a yearly pay equity audit.<br/><br/>For this role, the estimated base salary range is between $91,000 - $116,000. The actual base salary will vary based on various factors, including market and individual qualifications objectively assessed during the interview process. The listed range above is a guideline, and the base salary range for this role may be modified.<br/><br/>In addition to base salary, your compensation package may include additional components such as equity, sales incentive pay (for most sales roles), and benefits. If you're interviewing for this role, speak with your Talent Acquisition Partner to learn more about the total compensation and benefits for this role.<br/><br/>We strive to provide equitable and competitive benefits packages that support our employees worldwide and include:<br/><br/><ul><li>Mental health, wellness &amp; fitness benefits</li><li>Career coaching &amp; support</li><li>Inclusive family building benefits</li><li>Long-term savings or retirement plans</li><li>In-office culinary options to cater to your dietary preferences <br/><br/></li></ul>These are just some of the benefits we offer, and benefits may vary based on role, country, and local regulations. If you're interviewing for this role, speak with your Talent Acquisition Partner to learn more about the total compensation and benefits for this role.<br/><br/><strong>About Us<br/><br/></strong>Asana helps teams orchestrate their work, from small projects to strategic initiatives. Millions of teams around the world rely on Asana to achieve their most important goals, faster. Asana has been named a Top 10 Best Workplace for 5 years in a row, is Fortune's #1 Best Workplace in the Bay Area, and one of Glassdoor’s and Inc.’s Best Places to Work. After spending more than a year physically distanced, Team Asana is safely and mindfully returning to in-person collaboration, incorporating flexibility that adds hybrid elements to our office-centric culture . With 11+ offices all over the world, we are always looking for individuals who care about building technology that drives positive change in the world and a culture where everyone feels that they belong.<br/><br/>We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that Asana upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We provide equal employment opportunities to all applicants without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by law. We also comply with the San Francisco Fair Chance Ordinance and similar laws in other locations.<br/><br/>", "responsibilities": "Our sales team is focused on finding efficient paths to successful, profitable, long term customers by building a user-driven marketing and sales engine. To do so, we employ a bottom-up enterprise sales model by helping many small, successful customers evolve into larger, successful ones. We act as a key voice of the customer to the product team. We help identify and overcome technical, educational, and competitive obstacles to our continued growth.<br/><br/>We're seeking a Corporate Account Executive, who will fuel Asana's expansion into established books of business, uncovering hidden potential and driving exponential growth. You will craft bespoke expansion plans, deepen relationships with key decision-makers, and collaborate with internal teams to create deep, lasting partnerships.<br/><br/>Join Asana's sales team and become a seasoned explorer and a strategic partner for potential clients. Your contribution will be instrumental in our company's growth, while you embark on your own journey of personal and professional development. If you're eager to make a significant impact and refine your sales expertise, we're excited to connect with you!<br/><br/>This role is based in our New York City office with an office-centric hybrid schedule. The standard in-office days are Monday, Tuesday, and Thursday. Most Asanas have the option to work from home on Wednesdays. Working from home on Fridays depends on the type of work you do and the teams with which you partner. If you're interviewing for this role, your recruiter will share more about the in-office requirements.", "qualifications": {"required": "4+ years of B2B sales experience, demonstrating a proven track record of acquiring new corporate accounts, A passion for understanding unique business needs and tailoring effective Asana solutions, Exceptional communication and presentation skills, A strategic mindset coupled with a data-driven approach to sales, The ability to thrive in a fast-paced, results-oriented environment"}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Our comprehensive compensation package plays a big part in how we recognize you for the impact you have on our path to achieving our mission. We believe that compensation should be reflective of the value you create relative to the market value of your role. To ensure pay is fair and not impacted by biases, we're committed to looking at market value which is why we check ourselves and conduct a yearly pay equity audit.<br/><br/>For this role, the estimated base salary range is between $91,000 - $116,000. The actual base salary will vary based on various factors, including market and individual qualifications objectively assessed during the interview process. The listed range above is a guideline, and the base salary range for this role may be modified.<br/><br/>In addition to base salary, your compensation package may include additional components such as equity, sales incentive pay (for most sales roles), and benefits. If you're interviewing for this role, speak with your Talent Acquisition Partner to learn more about the total compensation and benefits for this role.<br/><br/>We strive to provide equitable and competitive benefits packages that support our employees worldwide and include:<br/><br/><ul><li>Mental health, wellness &amp; fitness benefits</li><li>Career coaching &amp; support</li><li>Inclusive family building benefits</li><li>Long-term savings or retirement plans</li><li>In-office culinary options to cater to your dietary preferences <br/><br/></li></ul>These are just some of the benefits we offer, and benefits may vary based on role, country, and local regulations. If you're interviewing for this role, speak with your Talent Acquisition Partner to learn more about the total compensation and benefits for this role.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3828184888"}