{"jobTitle": "Content Creator - Stay-at-home Parent", "company": {"name": "Fud, Inc.", "location": "Salt Lake City, UT"}, "location": "Salt Lake City, UT", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Calling all talented Stay-at-home Parents! We are seeking a creative Content Creator to join our community at Fud. As a Content Creator and Stay-at-home Parent, you understand the challenges of balancing work and family life, and we believe that you can bring a unique perspective and creative flair to our community.<br/><br/>Fud is a unique community that offers a wealth of knowledge and resources to help individuals achieve their goals. Our members are hustlers who are always looking for ways to improve themselves and their businesses. At Fud, we are passionate about supporting ambitious moms who want to pursue their entrepreneurial dreams. By joining our community, you will be part of a dynamic and supportive community that is passionate about helping others to achieve their dreams.<br/><br/>Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>You can experience our community for yourself by downloading our free to use app.<br/><br/>Requirements<br/><br/><ul><li>Personal experience as a stay-at-home parent</li><li>Excellent communication skills</li><li>Ability to create engaging and relatable content</li><li>Understanding of the needs and challenges of stay-at-home parents</li><li>Strong writing and storytelling abilities</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>An empathetic and supportive mindset</li><li>High level of initiative and creativity<br/><br/><br/></li></ul>Benefits<br/><br/>Why should you join Fud?<br/><br/><ul><li>Find a community of like minded hard working solopreneurs and entrepreneurs</li><li>Receive recognition for your knowledge of side hustling</li><li>Build authentic community and relationship mentoring side hustlers<br/><br/></li></ul>If you're passionate about sharing your knowledge on side hustles and want to help others achieve their financial goals, we encourage you join us for this exciting opportunity.<br/><br/>We are a community that values diversity. We encourage everyone including women and people of color to join us!", "jobFunction": "General Business", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "5 months ago", "benefits": "Find a community of like minded hard working solopreneurs and entrepreneurs, Receive recognition for your knowledge of side hustling, Build authentic community and relationship mentoring side hustlers", "skills": ["Communication", "Content Creation", "Storytelling", "Video", "Livestreaming", "Empathy", "Initiative", "Creativity"], "url": "https://www.linkedin.com/jobs/view/3845999230"}