{"jobTitle": "Virtual Assistant - Mompreneur", "company": {"name": "Fud, Inc.", "location": "Boulder, CO"}, "location": "Boulder, CO", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "description": "We are a growing start-up company looking for a **Virtual Assistant** to join our community. As a Virtual Assistant, you will be responsible for a variety of tasks to help our community, including researching, sharing, and mentoring others to succeed with their side hustles, including how to become a virtual assistant.<br/><br/>Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>**You can experience our community for yourself by **downloading our free to use app**.<br/><br/>**Requirements<br/><br/>**<ul><li>You are aware of the trends in future of work, personal finance, and entrepreneurship</li><li>Ability to follow trends and understand the type of content that drives engagement</li><li>Have a passion for:</li><ul><li>Gig Economy — like DoorDash, Uber, or Lyft</li><li>Creator Economy — YouTube, TikTok, or Instagram</li><li>Online Business — including blogging, podcasting, and online courses</li><li>Freelancing and Consulting — social media marketing, graphic design, and more</li><li>E-Commerce — including Amazon, Shopify, and your own online store</li><li>Reselling and Thrifting — including eBay, Etsy, Mercari, Poshmark, and others</li><li>Self-Publishing — including Kindle Direct Publishing and Canva</li><li>Local Services — including cleaning, knife sharpening, notary services, pet waste removal, and more</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>An abundance mindset</li><li>An entrepreneurial spirit</li><li>High level of initiative and positive approach<br/><br/></li></ul></ul>**Benefits<br/><br/>****Why should you join Fud?<br/><br/>**<ul><li>Find a community of like-minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want</li></ul>", "jobFunction": "Administrative", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3846939245"}