{"jobTitle": "Amazon Flex Side Hustler", "company": {"name": "Fud, Inc.", "location": "Renton, WA"}, "location": "Renton, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are looking for an Amazon Flex Side Hustler to join our community at Fud. If you love the flexibility of gig work and have experience with Amazon Flex, this opportunity may be perfect for you.<br/><br/>Our community supports content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/>In this role, you will be responsible for researching, sharing, and mentoring fellow side hustlers to succeed in their Amazon Flex side hustle.<br/><br/>Join us in the Fud community, where we understand and support the unique challenges and aspirations of side hustlers. Let's empower each other to reach new heights!<br/><br/><strong>You can experience our community for yourself by </strong><strong>downloading our free to use app</strong><strong>.<br/><br/></strong><strong>Requirements<br/><br/></strong><ul><li>You are aware of the trends in future of work, personal finance, and entrepreneurship</li><li>Ability to work independently and manage your time effectively</li><li>High level of initiative and positive approach</li><li>Strong communication skills</li><li>Comfortable with using social media and other digital tools</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>Passion for innovation and entrepreneurship<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Be your own boss</li><li>Learn how to make money from your passion and interests</li><li>Find a community of like minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want<br/><br/><br/></li></ul><strong>We are a community that values diversity. We encourage everyone including women and people of color to join us! No previous experience required.</strong>", "jobFunction": "General Business", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "5 months ago", "benefits": "Be your own boss, Learn how to make money from your passion and interests, Find a community of like minded hard working solopreneurs and entrepreneurs, Choose your own schedule and work when you want", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3849598087"}