{"jobTitle": "North America Product Marketing Manager, SMB Advertising", "company": {"name": "TikTok", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Administrative and Product Management", "industry": "Entertainment Providers", "description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>TikTok is seeking an experienced product marketing professional with a background in media &amp; advertising to lead go-to-market of our advertising solutions and drive product adoption across multiple different customer segments across our small to medium sized customers, across all verticals. As part of the SMB Growth team, this role involves close collaboration with multiple in-market sales team, global product marketing, business marketing, and operations teams in a high-growth environment. An ability to self-motivate, prioritize, problem solve and be the expert for our ads platform and ecosystem/customers are key skills. Candidates must have experienced working with media products in a product marketing capacity and be familiar with digital marketing.<br/><br/>Responsibilities:<br/>- Define the SMB North America go-to-market strategy for TikTok's ever-evolving ads products.<br/>- Partner with a range of cross-functional teams including Solutions Engineering, Marketing Sciences, Marketing and Strategy teams to ensure flawless execution against this strategy.<br/>- Partner closely with field teams and utilize data proficiently to deeply understand performance pain points, and formulate product and activation based solutions.<br/>- Act as the voice of the market with product; synthesize market insights and collaborate with product teams and global product marketing teams to identify solutions.<br/>- Analyze and summarize product gaps and pain points to recommend product enhancements.<br/>- Adapt regional product initiatives for SMB clients, prioritizing scale, platform based and low touch solutions.<br/>- Manage growth at scale for a range of products in market; manage launches and implement activations in order to drive product adoption. Collaborate with technical and operations teams to monitor product performance.<br/>- Build robust processes, systems, tools/solutions, workflow optimization, and automation to increase operational efficiency and productivity. <br/><br/><strong>Qualifications<br/><br/></strong> Qualifications<br/>- BA/BS degree or above with 3-5+ years' experience working within AdTech industry with product marketing responsibilities.<br/>- Understanding of commerce-related business models, with focus on small- and media businesses<br/>- Experience working with product teams and influencing the product roadmap with advertising products<br/>- Experience in the ad tech or internet industry, with experience in the commerce industry being a huge plus<br/>- Experience driving end to end go-to-market planning and execution for advertising products.<br/><br/><br/>Preferred Qualifications:<br/>- A fast learner with a good sense of judgement and original thinking. Ability to thrive in ambiguity and adjust quickly to change.<br/>- Excellent communication, presentation and analytical skills<br/>- A commercial mindset with a history of delivering against stretch performance goals.<br/>- Experience leveraging data to test hypotheses and drive business recommendations-Experience leading and delivering complex, cross-functional projects on fast-paced timelines.<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2", "responsibilities": "- Define the SMB North America go-to-market strategy for TikTok's ever-evolving ads products.\n- Partner with a range of cross-functional teams including Solutions Engineering, Marketing Sciences, Marketing and Strategy teams to ensure flawless execution against this strategy.\n- Partner closely with field teams and utilize data proficiently to deeply understand performance pain points, and formulate product and activation based solutions.\n- Act as the voice of the market with product; synthesize market insights and collaborate with product teams and global product marketing teams to identify solutions.\n- Analyze and summarize product gaps and pain points to recommend product enhancements.\n- Adapt regional product initiatives for SMB clients, prioritizing scale, platform based and low touch solutions.\n- Manage growth at scale for a range of products in market; manage launches and implement activations in order to drive product adoption. Collaborate with technical and operations teams to monitor product performance.\n- Build robust processes, systems, tools/solutions, workflow optimization, and automation to increase operational efficiency and productivity.", "qualifications": {"required": "BA/BS degree or above with 3-5+ years' experience working within AdTech industry with product marketing responsibilities.\n- Understanding of commerce-related business models, with focus on small- and media businesses\n- Experience working with product teams and influencing the product roadmap with advertising products\n- Experience in the ad tech or internet industry, with experience in the commerce industry being a huge plus\n- Experience driving end to end go-to-market planning and execution for advertising products.", "preferred": "A fast learner with a good sense of judgement and original thinking. Ability to thrive in ambiguity and adjust quickly to change.\n- Excellent communication, presentation and analytical skills\n- A commercial mindset with a history of delivering against stretch performance goals.\n- Experience leveraging data to test hypotheses and drive business recommendations-Experience leading and delivering complex, cross-functional projects on fast-paced timelines."}, "skills": [], "postedDate": "2 weeks ago", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3876158313"}