{"jobTitle": "Outside Sales Account Manager - Industrial Component Service and Repair", "company": {"name": "SunSource", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "Industrial Machinery Manufacturing", "description": "Paragon Technologies, a SunSource company, specializes in providing world-class service, repair and re-manufacturing in the areas of electronics, hydraulics, robotics, servos and mechanical components for various industries. https://www.paragontech.com/ In this role you will manage the overall relationship with customers and maximize sales within your assigned territory. This is a great opportunity for a driven salesperson to build on an existing territory representing a well-known leader in the industry. Essential Functions<br/><br/><ul><li>Work with your Manager to create a sales plan to develop new customers and maintain existing accounts</li><li>Ability to manage territory, projected sales and build/maintain business relationships</li><li>Full cycle prospecting activities including qualification of leads, cold calls, and sales presentations</li><li>Collaborate with knowledgeable customer service and technical support teams who will assist you in meeting and exceeding your goals</li><li>Utilization of tools, resources and CRM to plan and manage time and territory<br/><br/><br/></li></ul>Experience, Education and Skills<br/><br/><ul><li>Highschool Diploma or GED</li><li>4-year degree in sales, marketing or engineering OR 2-year technical degree in an industrial discipline, mechanics or related field is preferred </li><li>Fluid Power Certification is preferred, but not required</li><li>2+ years industrial sales experience with preference given to experience within electronics, hydraulics, robotics, servos, and/or mechanical components. </li><li>Experience with rebuilding and repair of hydraulic equipment of both mobile and industrial machinery is a plus</li><li>Must have clear and concise verbal and written communication skills</li><li>Computer proficiency is required</li><li>Must have a valid driver's license </li><li>Overnight travel may be required <br/><br/><br/></li></ul>We Offer<br/><br/><ul><li>Industry competitive compensation plan </li><li>Medical / Dental / Vision / 401K</li><li>Paid vacation and Holidays </li><li>Tuition reimbursement and ongoing training opportunities </li><li>Mileage Reimbursement</li><li>Paragon provides a team environment that fosters personal growth and development. <br/><br/><br/></li></ul>https://www.paragontech.com/ www.sun-source.com Would you rather see what we have to offer? Check out SunSource Core Competency video We are an Equal Employment Opportunity Employer M/F/V/D. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status. eeopost.pdf (dol.gov). WE PARTICIPATE IN E-VERIFY E-Verify Participation Poster English and Spanish (uscis.gov). If you are an individual with a disability and require an accommodation to complete the application process, please contact recruiting@sunsrce.com to request reasonable accommodation. Only requests for accommodations in the application process will be returned. Sun-Source | Privacy Policy", "responsibilities": "In this role you will manage the overall relationship with customers and maximize sales within your assigned territory. This is a great opportunity for a driven salesperson to build on an existing territory representing a well-known leader in the industry. Essential Functions<br/><br/><ul><li>Work with your Manager to create a sales plan to develop new customers and maintain existing accounts</li><li>Ability to manage territory, projected sales and build/maintain business relationships</li><li>Full cycle prospecting activities including qualification of leads, cold calls, and sales presentations</li><li>Collaborate with knowledgeable customer service and technical support teams who will assist you in meeting and exceeding your goals</li><li>Utilization of tools, resources and CRM to plan and manage time and territory<br/><br/><br/></li></ul>", "qualifications": {"required": "Highschool Diploma or GED", "preferred": "4-year degree in sales, marketing or engineering OR 2-year technical degree in an industrial discipline, mechanics or related field is preferred, Fluid Power Certification is preferred, but not required, 2+ years industrial sales experience with preference given to experience within electronics, hydraulics, robotics, servos, and/or mechanical components., Experience with rebuilding and repair of hydraulic equipment of both mobile and industrial machinery is a plus, Must have clear and concise verbal and written communication skills, Computer proficiency is required, Must have a valid driver's license, Overnight travel may be required"}, "skills": ["Sales", "Marketing", "Engineering", "Industrial", "Mechanics", "Fluid Power", "Hydraulics", "Robotics", "Servos", "Mechanical Components", "Customer Service", "Technical Support", "CRM", "Communication", "Computer Proficiency"], "postedDate": "4 months ago", "benefits": "Industry competitive compensation plan, Medical / Dental / Vision / 401K, Paid vacation and Holidays, Tuition reimbursement and ongoing training opportunities, Mileage Reimbursement, Paragon provides a team environment that fosters personal growth and development.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3887646674"}