{"jobTitle": "Cloud Solution Sales Account Manager", "company": {"name": "Telestream", "location": "Beaverton, OR"}, "location": "Beaverton, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Broadcast Media Production and Distribution", "description": "<strong>Cloud Solution Sales - Account Manager <br/><br/></strong>For over 25 years, Telestream has been the undisputed trailblazer of innovation in the digital video industry. We craft cutting edge solutions for every facet of media processing and workflow orchestration. Whether it's the adrenaline-pumping live capture, seamless streaming, awe-inspiring production, or meticulous quality assurance of video content - Telestream stands as the unyielding force that ensures your video reaches audiences flawlessly, no matter how they are created, disseminated, or consumed.<br/><br/>Our roster of customers include most of the top Media &amp; Entertainment, Video Production, Broadcasting and streaming companies in the world.<br/><br/>Now is the time for the next phase of Telestream's growth as we help our customers move to the next generation of video products and solutions that not only take advantage of traditional on premises solutions, but are now moving to more hybrid and cloud based technologies and business solutions, while also incorporating AI into their video workflows.<br/><br/><strong>Position Summary<br/><br/></strong>This is a strategically critical position that will play a vital role in our growth. You will be reporting to the VP Cloud Solution Sales, and be responsible for assigned accounts and/or territory, building and maintaining relationships with key decision-makers, and closing deals.<br/><br/>To be successful in this role, you must have a proven track record of selling high-value SaaS solutions, to tier one US media companies. You must also be able to develop relationships with Director, VP and C-level decision-makers and influencers, and have experience in closing large technology and service deals.<br/><br/>In addition, you must have solid business and technical acumen, as well as the ability to effectively understand and articulate customers' business and key drivers. You must also be equally comfortable dealing with senior management as well as mid-level technical staff.<br/><br/>If you are a highly motivated and experienced sales professional with a passion for the media industry, we encourage you to apply for this exciting opportunity.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Cultivate a consistent and expanding revenue stream within assigned strategic accounts and regions.</li><li> Establish and maintain robust relationships with key influencers, engineering and operations personnel, technical evaluators, and procurement entities within existing strategic accounts.</li><li> Ascend the ranks by getting delegated upwards, positioning Telestream as a strategic partner to key executives, earning their trust and respect.</li><li> Collaborate on key account strategy and implementation plans with the presales team and business units, working seamlessly with a global virtual team to develop customer-centric solutions based on specific needs.</li><li> Provide stellar service to existing accounts and stoke strategic demand in emerging markets through direct efforts and collaboration with resale and system integration partners.</li><li> Develop, manage, and report on a burgeoning sales pipeline, meticulously tracking opportunities in our Salesforce.com CRM for ongoing forecasting and reporting.</li><li> Master the understanding of competitors' products and strategies, utilizing this knowledge to sell against the competition.</li><li> Consult with customers and business partners on best practices and workflows associated with Telestream solutions and applications.</li><li> Navigate the intricate pathways of complex sales processes from initial customer contact through product delivery and post-sales support, including negotiation of master purchase and services agreements.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> 10+ years demonstrated success in selling high-value SaaS solutions to tier one US media companies</li><li> Proven track record in developing relationships with Director, VP and C-level decision-makers and influencers, and closing substantial technology and service deals</li><li> Solid business and technical acumen, analytical skills, and the ability to effectively understand and articulate customers' business and key drivers</li><li> Comfort in dealing with both senior management and mid-level technical staff in client engagements</li><li> Strong business knowledge, complemented by skills to comprehend customers' and prospects' business and technical drivers</li><li> Proven ability to manage complex sales processes from initial customer contact through product delivery and post-sales support</li><li> Ability to travel and work effectively in a remote capacity<br/><br/></li></ul><strong>What's so exciting about this role?<br/><br/></strong><ul><li> The opportunity to make a real impact on the success of a leading industry player.</li><li> The chance to work with cutting-edge technology and solutions.</li><li> The opportunity to collaborate with a global team of talented and passionate individuals.</li><li> The chance to develop your skills and knowledge in a fast-paced and ever-changing environment.</li><li> The opportunity to make a difference in the way that people consume and experience video content.<br/><br/></li></ul>If you are looking for a challenging and rewarding career opportunity, Telestream is the place for you. Apply today and join us on our mission to captivate any audience. To apply for this position, please visit our careers page and submit your resume and cover letter. We look forward to hearing from you!<br/><br/><em>Job Posted by ApplicantPro</em>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3887958816"}