{"jobTitle": "Customer Service Representative", "company": {"name": "NEMA", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "Nemas International is looking for a customer service representative to join our team remotely. This person will drive customer satisfaction by fielding inquiries, addressing pain points and maintaining extensive product knowledge.<br/><br/>The ideal candidate has a customer-first mindset and aims to deliver high-quality service in every customer interaction.<br/><br/>Responsibilities:<br/><br/><ul><li>Manage inbound customer communications - Answer incoming calls and emails to address customer questions, requests and issues</li><li>Consult on customer success - Advise customers on how to successfully leverage the product/service based on their unique needs</li><li>Maintain working product knowledge - Act as a product expert to ensure information given to customers is accurate, up-to-date and strategic</li><li>Track interactions in CRM - Record customers interactions in internal system for cross-functional awareness and relationship development<br/><br/></li></ul>Requirements:<br/><br/><ul><li>Bachelor’s degree, High School Diploma or equivalent</li><li>1-2 years proven experience in supporting client success a plus</li><li>Excellent written and verbal communication skills</li><li>Ability to address complaints and issues with effective solutions and a positive attitude</li><li>Passion for delighting customers with above and beyond service</li><li>Excellent time-management and prioritization skills</li><li>Familiarity with CRM system<br/><br/></li></ul><strong>About Nemas International:<br/><br/></strong>Nemas International is a full service provider of consumer product management, warranty and support for original equipment manufacturers and branded products throughout the Americas.<br/><br/>Our employees enjoy a work culture that promotes equality and diversity.<br/><br/>Nemas International benefits include health care, paid time off, retirement savings, employee assistance programs and professional development.<br/><br/>Employees can also take advantage of offerings like casual dress code, 401k, corporate discounts, and gym memberships etc.<br/><br/>Powered by JazzHR<br/><br/>nNhJjkHik4", "postedDate": "4 months ago", "skills": ["CRM"], "url": "https://www.linkedin.com/jobs/view/3888770123"}