{"jobTitle": "Talent Acquisition Partner", "company": {"name": "Symmetrio", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Symmetrio, a full-service staffing solutions and consulting services provider, is recruiting a Talent Acquisition Partner to join our dynamic team. Founded in 2012, we have been instrumental in helping our clients identify and recruit top-tier talent across multiple business verticals, including information technology, healthcare, medical devices, pharmaceuticals, biotechnology, engineering, manufacturing, hospitality, government, and more. As we continue to grow, we are in need of a Talent Acquisition Partner to help us maintain our high standards of service. The ideal candidate will have a keen eye for evaluating and vetting talent, growing existing accounts and contracts through relationship building, and quickly aligning talent with our customer's needs. This is a full-time position with competitive compensation, paid time off, paid holidays, healthcare benefits, and a 401k retirement plan (4% match after 6 months).<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Collaborate with Symmetrio's Practice Area Leaders to proactively identify candidate sourcing opportunities with our existing clients</li><li>Maintain constant communication with client hiring managers. </li><li>Obtain new job requisitions from clients for permanent placement and staff augmentation positions</li><li>Develop and enhance job descriptions, when required, based upon client requirements. </li><li>Responsible for the full recruiting cycle, which includes:</li><ul><li>Passively and actively sourcing candidates that meet / exceed requirements of client job requisitions using LinkedIn Recruiter Professional, Workable ATS and other tools</li><li>Reviewing and evaluating resumes</li><li>Assessing candidates' applications</li><li>Interviewing candidates</li><li>Pre-screening candidates</li><li>Submitting candidates to hiring managers</li><li>Preparing candidates for interviews</li><li>Extending offers to candidates</li><li>Onboarding</li></ul><li>Update all candidate activity in Workable ATS</li><li>Update sales opportunities in Salesforce CRM. </li><li>Exceed sales goals and successfully achieve revenue / margin targets</li><li>Establish and maintain ongoing communication with our Digital Communications team to ensure timely social media updates for new position openings<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>3-5 years of experience as a Recruiter</li><li>Expertise with LinkedIn Recruiter Professional, LTI and related tools</li><li>3-5 years using an Applicant Tracking System (ATS). Experience with Workable is preferred, but experience with ATS' such as Greenhouse, JobDiva, Pinpoint, or Recruitee is also acceptable</li><li>Proficiency in using Salesforce CRM is highly desired. </li><li>Bachelor's degree in your area of expertise</li><li>Excellent communication skills, both verbal and written</li><li>Strong networking skills and the ability to build and maintain professional relationships<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>401K Retirement Plan (4% match)</li><li>Paid Time Off (Vacation, Sick, &amp; Public Holidays)</li></ul>", "responsibilities": "Collaborate with Symmetrio's Practice Area Leaders to proactively identify candidate sourcing opportunities with our existing clientsMaintain constant communication with client hiring managers. Obtain new job requisitions from clients for permanent placement and staff augmentation positionsDevelop and enhance job descriptions, when required, based upon client requirements. Responsible for the full recruiting cycle, which includes:Passively and actively sourcing candidates that meet / exceed requirements of client job requisitions using LinkedIn Recruiter Professional, Workable ATS and other toolsReviewing and evaluating resumesAssessing candidates' applicationsInterviewing candidatesPre-screening candidatesSubmitting candidates to hiring managersPreparing candidates for interviewsExtending offers to candidatesOnboardingUpdate all candidate activity in Workable ATSUpdate sales opportunities in Salesforce CRM. Exceed sales goals and successfully achieve revenue / margin targetsEstablish and maintain ongoing communication with our Digital Communications team to ensure timely social media updates for new position openings", "qualifications": {"required": "3-5 years of experience as a RecruiterExpertise with LinkedIn Recruiter Professional, LTI and related tools3-5 years using an Applicant Tracking System (ATS). Experience with Workable is preferred, but experience with ATS' such as Greenhouse, JobDiva, Pinpoint, or Recruitee is also acceptableProficiency in using Salesforce CRM is highly desired. Bachelor's degree in your area of expertiseExcellent communication skills, both verbal and writtenStrong networking skills and the ability to build and maintain professional relationships", "preferred": ""}, "skills": ["LinkedIn Recruiter Professional", "Workable ATS", "Salesforce CRM"], "postedDate": "5 months ago", "benefits": "Health Care Plan (Medical, Dental & Vision)401K Retirement Plan (4% match)Paid Time Off (Vacation, Sick, & Public Holidays)", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3891680058"}