{"jobTitle": "Director of Marketing (Full-Time)", "company": {"name": "Shift Robotics", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "We are on a mission to transform the world into a more walkable place. Our innovative personal mobility solution not only makes walking faster and more efficient, but also more accessible than ever before. We believe in empowering individuals to choose walking as their preferred mode of transport, leaving traffic jams behind. With our cutting-edge Moonwalk technology, we are paving the way to a brighter future, one step at a time.<br/><br/>As a Moonwalker, you'll have numerous opportunities to utilize our product. Whether it's for personal use like commuting, staying fit and healthy, or simply taking your dog for a stroll, our Moonwalkers are meant to enhance your everyday experience. But our impact extends beyond the individual level. Our solution is also applicable in warehouse and factory settings, revolutionizing logistics and doubling productivity. And the best part? Our product pays for itself in less than a month. We have been featured in major press including: Today's Show, Wired, Reuters, and Time.<br/><br/>We are searching for a passionate and dedicated full-time Marketing Director to lead our dynamic team. In this influential role, you will have the opportunity to shape and execute Shift's cutting-edge marketing strategy for both B2B and B2C aspects.<br/><br/>As the Director of Marketing, your primary focus will be on logistics and warehouse space, ensuring that our brand is consistently represented in the most impactful way. With your expertise and strategic mindset, you will have the freedom to make data-driven decisions and drive innovative marketing initiatives.<br/><br/>Responsibilities:<br/><br/><ul><li>Develop, execute, and manage a comprehensive B2C and B2B marketing strategy and budget to achieve a target of $280K in monthly sales</li><li>Lead comprehensive market research initiatives to gather detailed insights into the 3PL logistics industry, including market trends, competitor analysis, customer segmentation, and emerging opportunities</li><li>Develop and implement a data-driven marketing strategy, utilizing insights from market research to tailor approaches specifically to the 3PL logistics market</li><li>Conduct in-depth customer needs analysis to understand the challenges, preferences, and decision-making processes of clients in the logistics sector</li><li>Utilize research findings to create compelling messaging and positioning strategies that differentiate the company in the 3PL market</li><li>Create and disseminate high-value, research-based content (such as whitepapers, case studies, and industry reports) to establish thought leadership in the logistics space</li><li>Drive online sales and create targeted marketing campaigns focusing on consumers and SMEs leveraging extensive knowledge of the e-commerce space</li><li>Build, lead, and mentor a high-performing marketing team of in-house or contracted professionals to implement initiatives</li><li>Develop and maintain strong relationships with key partners, vendors, and influencers to expand brand reach and awareness</li><li>Identify diverse creator communities, craft content and community strategies, and provide team leadership</li><li>Design branding, positioning, pricing strategies, and ensure a consistent brand message across all channels and marketing efforts</li><li>Analyze consumer behavior, determine customer personas, and identify opportunities for market expansion</li><li>Monitor competition and coordinate sales and marketing efforts to maximize impact</li><li>Participate in the quarterly and annual planning of company objectives, budgets, and hiring plans<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong>Qualifications:<br/><br/><ul><li>Bachelor's degree in marketing, business, or a related field; advanced degree preferred</li><li>A minimum of 7 years of experience in marketing, with a strong background in e-commerce and marketing management</li><li>Proven track record of generating significant revenue and driving change and innovation across organizations</li><li>Experience in building and managing high-performing teams, both in-house and contracted</li><li>Exceptional communication, interpersonal, and leadership skills, with the ability to collaborate effectively with diverse stakeholders</li><li>Strong analytical and problem-solving skills, with experience in data-driven decision-making and using analytics for larger initiatives</li><li>Passion for staying current with industry trends and a desire to drive innovation in the marketing space</li><li>Familiarity with the CPG &amp; Personal Mobility space is preferred</li><li>Excellent written, verbal, and professional communication skills</li><li>Superior attention-to-detail, multi-tasking, time management, and project management skills</li><li>A team player who is accountable, proactive, and solution-oriented<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Opportunities for participation in our Employee Options programs</li><li>401K retirement plan</li><li>Excellent medical, dental, and vision insurance</li><li>Sick and Vacation time (Flex time for salary positions), and Paid Holidays</li><li>Massive Growth Opportunities and a long-term career</li><li>Casual and comfortable work environment</li></ul>", "jobFunction": "Marketing", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "5 months ago", "benefits": "<ul><li>Opportunities for participation in our Employee Options programs</li><li>401K retirement plan</li><li>Excellent medical, dental, and vision insurance</li><li>Sick and Vacation time (Flex time for salary positions), and Paid Holidays</li><li>Massive Growth Opportunities and a long-term career</li><li>Casual and comfortable work environment</li></ul>", "qualifications": {"required": "<ul><li>Bachelor's degree in marketing, business, or a related field; advanced degree preferred</li><li>A minimum of 7 years of experience in marketing, with a strong background in e-commerce and marketing management</li><li>Proven track record of generating significant revenue and driving change and innovation across organizations</li><li>Experience in building and managing high-performing teams, both in-house and contracted</li><li>Exceptional communication, interpersonal, and leadership skills, with the ability to collaborate effectively with diverse stakeholders</li><li>Strong analytical and problem-solving skills, with experience in data-driven decision-making and using analytics for larger initiatives</li><li>Passion for staying current with industry trends and a desire to drive innovation in the marketing space</li><li>Familiarity with the CPG &amp; Personal Mobility space is preferred</li><li>Excellent written, verbal, and professional communication skills</li><li>Superior attention-to-detail, multi-tasking, time management, and project management skills</li><li>A team player who is accountable, proactive, and solution-oriented<br/><br/><br/></li></ul>", "preferred": ""}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3894833347"}