{"jobTitle": "Customer Support Agent", "company": {"name": "Journey Clinical", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Journey Clinical is on a mission to transform the growing mental health crisis by accelerating the adoption of frontier treatments that lead to lasting improvements in clinical outcomes. We have built a turnkey healthtech platform to safely and effectively expand access to a powerful modality known as Psychedelic-Assisted Psychotherapy, starting with Ketamine-Assisted Psychotherapy (KAP). In our patient-centered collaborative care model, licensed psychotherapists in the network take on the psychotherapy, while Journey Clinical's in-house medical team takes on patient eligibility, treatment plan and outcome monitoring. Our platform gives psychotherapists passionate about PAP the infrastructure and support required to become empowered KAP providers, while enabling higher standards of patient care and enhanced clinical outcomes.<br/><br/>We have recently closed a successful Series A round led by Union Square Ventures, and are backed by a number of top-tier investors including AlleyCorp, Fifty Years, Able Partners, Gaingels, Palo Santo, PsyMed Ventures, Coalition Operators, Christina Sass co-founder of Andela, Edvard Engesæth, MD co-founder of Nurx and, Hans Gangeskar co-founder of Nurx.<br/><br/>We are building an open-minded and inclusive workplace where you will have the opportunity to grow and collaborate with a diverse team of high performing individuals. Our team combines extensive experience in business and healthcare. We are mission driven and strive to make the workplace stimulating, ethical, rewarding, and fun. Together, we will be working at the cutting edge of a groundbreaking field that is reshaping mental health and we will make a direct impact on people’s lives.<br/><br/>Here’s what you’ll do day-to-day:<br/><br/><ul><li> Manage day-to-day therapist questions and requests through a shared mailbox and member support across multiple channels (SMS, phone, emails)</li><li> Provide support to therapists to ensure success along their treatment journey</li><li> Bring feedback and share insights with the team on common themes expressed by therapists</li><li> Work with your direct manager to (i) escalate open questions and concerns (ii) collaborate with cross-functional teams to drive continuous process improvements and deliver a world-class support experience (iIi) execute experiments and document knowledge bases/saved responses for better serving patients<br/><br/><br/></li></ul>Responsibilities:<br/><br/><ul><li> Assist with coordination of scheduling, rescheduling, and canceling therapist appointments as required</li><li> Manage therapist inquiries and requests through our email communication system</li><li> Provide tech support for therapists struggling with account access</li><li> Coordinate with operations and therapist success teams to ensure requests are responded to in a timely manner</li><li> Monitor the therapist journey to identify and mitigate potential issues as well as discover opportunities to improve the process</li><li> Oversee the processing of therapist credentials submitted to our platform<br/><br/><br/></li></ul>Profile:<br/><br/><ul><li> Team player who is passionate, detail oriented and a strong communicator</li><li> 3+ years of related work experience in client service and support</li><li> 2+ years of experience in medical industry, particularly if you have worked in mental health</li><li> Knowledge of CRM systems, particularly Zendesk and Gmail</li><li> Customer-first mindset, deep work ethic and dedication to the highest level of support</li><li> Comfortable working remotely in a telehealth fast-paced startup environment</li><li> Interest for the field of psychedelic-assisted psychotherapy to transform mental health<br/><br/><br/></li></ul>What we offer:<br/><br/><ul><li> Competitive hourly salary</li><li> Flexible working hours</li><li> Growth opportunities and a high level of freedom</li><li> We aim to set our team members up for success and offer a clear path for career advancement and personal growth</li><li> Work with a team of industry leading experts, who are highly collaborative, disciplined, and who have fun working together</li><li> The opportunity to change the way we approach mental health by advancing the mainstream adoption of psychedelic assisted psychotherapy and make a positive impact on the lives of 100M+ people who are suffering from depression and anxiety in the US today!<br/><br/><br/></li></ul>We recognize healthcare is a universal concern and tackling the mental health crisis will require team members with different strengths from all walks of life. We are an Equal Opportunity Employer and consider applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law.<br/><br/>If you feel discouraged by the job description because your skills don’t exactly match please apply anyway. We likely missed something and are open to expanding our understanding of the role.", "jobFunction": "Other", "industry": "Mental Health Care", "postedDate": "3 months ago", "skills": ["CRM", "Zendesk", "Gmail", "Telehealth", "Customer Service", "Client Service", "Support", "Mental Health", "Medical Industry", "Psychedelic-Assisted Psychotherapy", "Ketamine-Assisted Psychotherapy", "Patient Care", "Healthcare", "Healthtech", "Business", "Startup"], "url": "https://www.linkedin.com/jobs/view/3905557583"}