{"jobTitle": "Computer Forensic and Intrusion Detection Analyst", "company": {"name": "I2X Technologies", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "I2X Technologies is a reputable technology services company to the Federal Government.  Whether the focus is on space exploration, national security, cyber security, or cutting-edge engineering applications, I2X is ready to offer you the chance to make a real-world impact in your field and for your country.  We provide long-term growth and development. Headquartered in Colorado, I2X is engaged in programs across the country and in more than 20 states.  Our programs support multiple Federal agencies, the Department of Defense and often focused on the space initiatives of our government customers.\n\nWe are seeking a Computer Forensic and Intrusion Detection Analyst  to support our customer at Eglin AFB in Florida.   This vital position will be onsite supporting our client in a cybersecurity test and evaluation environment. It wil l require an active Top Secret/SCI Clearance.\n\nComputer Forensic and Intrusion Detection Analyst Primary Duties:\n\n* Performs analysis, design, and development of security features for system architectures. \n* Provides knowledge in computer and network forensics. \n* Analyzes and defines security requirements for computer systems which may include mainframes, workstations, and personal computers. \n* Performs vulnerability/risk analyses of computer systems and applications during all phases of the system development life cycle. \n* Conducts vulnerability assessments/penetration tests of information systems. \n* Develops, researches and maintains proficiency in tools, techniques, countermeasures, and trend in computer and network vulnerabilities, data hiding, and encryption. \n* Identifies, deters, monitors, and investigates computer and network intrusions. \n* Provides computer forensic support to high technology investigations in the form of evidence seizure, computer forensic analysis, and data recovery. \n\nComputer Forensic and Intrusion Detection Analyst Education and Qualifications\n\n* Requires a bachelor's degree or its equivalent\n* Relevant certifications for each position \n* 4 or more years of related experience\n\nEssential Requirements:\n\n* US Citizenship is required\n* Active Top Secret/SCI clearance\n\nI2X Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected Veteran status, or disability status.\n\nSalary bands have not yet been determined for this opportunity. I2X Technologies considers factors such as (but not limited to) scope and responsibilities of the position, candidate’s work experience, education/training, key skills, internal peer equity, as well as, market and business considerations when extending an offer. \n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job with or without reasonable accommodation.\n\nWhile performing the duties of this job, the employee will regularly sit, walk, stand and climb stairs and steps. May require walking long distance from parking to work station. Occasionally, movement that requires twisting at the neck and/or trunk more than the average person, squatting/ stooping/kneeling, reaching above the head, and forward motion will be required. The employee will continuously be required to repeat the same hand, arm, or finger motion many times. Manual and finger dexterity are essential to this position. Specific vision abilities required by this job include close, distance, depth perception and telling differences among colors. The employee must be able to communicate through speech with clients and public. Hearing requirements include conversation in both quiet and noisy environments. Lifting may require floor to waist, waist to shoulder, or shoulder to overhead movement of up to 20 pounds. This position demands tolerance for various levels of mental stress.\n\nI2X Technologies is an Engineering and Information Technology Company focused on providing Services to the Federal and State Government. I2X offers a competitive compensation program and comprehensive benefits package to our employees.", "responsibilities": "Performs analysis, design, and development of security features for system architectures. \nProvides knowledge in computer and network forensics. \nAnalyzes and defines security requirements for computer systems which may include mainframes, workstations, and personal computers. \nPerforms vulnerability/risk analyses of computer systems and applications during all phases of the system development life cycle. \nConducts vulnerability assessments/penetration tests of information systems. \nDevelops, researches and maintains proficiency in tools, techniques, countermeasures, and trend in computer and network vulnerabilities, data hiding, and encryption. \nIdentifies, deters, monitors, and investigates computer and network intrusions. \nProvides computer forensic support to high technology investigations in the form of evidence seizure, computer forensic analysis, and data recovery.", "qualifications": {"required": "Requires a bachelor's degree or its equivalent\nRelevant certifications for each position \n4 or more years of related experience\nUS Citizenship is required\nActive Top Secret/SCI clearance"}, "skills": [], "postedDate": "4 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3907485958"}