{"jobTitle": "Systems Engineer", "company": {"name": "I2X Technologies", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "I2X Technologies is a reputable technology services company to the Federal Government.  Whether the focus is on space exploration, national security, cyber security, or cutting-edge engineering applications, I2X is ready to offer you the chance to make a real-world impact in your field and for your country.  We provide long-term growth and development.  Headquartered in Colorado, I2X is engaged in programs across the country and in more than 20 states.  Our programs support multiple Federal agencies, the Department of Defense and are often focused on the space initiatives of our government customers.   We are seeking a Systems Engineer to support our customer at Eglin AFB in Florida.   This vital position will be onsite supporting our client in a cybersecurity test and evaluation environment. It will require an active Top Secret/SCI Clearance. Systems Engineer Primary Duties: Designs, develops, and maintains the organization's systems infrastructure, new software, and software enhancements Provides analysis related to hardware, software, interfaces and all system-level requirements to provide an integrated IT solution Develops integrated system test requirement, strategies, devices and systems Directs overall system level testing and defines system scope and objectives Works with project managers, developers, and end users to ensure application designs meet business requirements Prepares detailed specifications for programs Provides consultation on complex projects and is considered to be the top-level systems specialist Considers the business implications of a given technology when planning its application  Systems Engineer Education and Qualifications Bachelor's degree in an associated discipline (e.g., engineering) 4-7 years of professional experience with systems engineering Essential Requirements: US Citizenship Active Top Secret/SCI clearance I2X Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected Veteran status, or disability status. Salary bands have not yet been determined for this opportunity. I2X Technologies considers factors such as (but not limited to) scope and responsibilities of the position, candidate’s work experience, education/training, key skills, internal peer equity, as well as, market and business considerations when extending an offer.  Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job with or without reasonable accommodation. While performing the duties of this job, the employee will regularly sit, walk, stand and climb stairs and steps. May require walking long distance from parking to work station. Occasionally, movement that requires twisting at the neck and/or trunk more than the average person, squatting/ stooping/kneeling, reaching above the head, and forward motion will be required. The employee will continuously be required to repeat the same hand, arm, or finger motion many times. Manual and finger dexterity are essential to this position. Specific vision abilities required by this job include close, distance, depth perception and telling differences among colors. The employee must be able to communicate through speech with clients and public. Hearing requirements include conversation in both quiet and noisy environments. Lifting may require floor to waist, waist to shoulder, or shoulder to overhead movement of up to 20 pounds. This position demands tolerance for various levels of mental stress. I2X Technologies is an Engineering and Information Technology Company focused on providing Services to the Federal and State Government. I2X offers a competitive compensation program and comprehensive benefits package to our employees.", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3907488664"}