{"jobTitle": "Inventory Manager", "company": {"name": "Pack On The Go", "location": "Pompano Beach, FL"}, "location": "Pompano Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20 - 25 hourly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Consumer Services", "description": "We are seeking an individual with meticulous attention to detail and a knack for organizing items to join us as an Inventory Manager in Pompano Beach, FL. This role entails overseeing and actively participating in the restoration process for client content, offering both guidance and operational support. Key responsibilities include leading pack-out operations, and overseeing tasks related to content relocation, cleaning, deodorizing, manipulation, and storage. You will utilize specialized equipment and cleaning supplies in this position.<br/><br/><strong>Position Benefits<br/><br/></strong><ul><li>Ample opportunities for personal and professional development with a strong focus on continuous learning</li><li>A positive and encouraging work atmosphere</li><li>Generous benefits such as 10 paid days off, paid holidays, and 50% health insurance coverage after 90 days</li><li>Emphasis on maintaining a safe work environment</li><li>A culture that promotes collaboration and attentive listening </li><li>Dedication to diversity and inclusion, nurturing a welcoming and respectful workplace for all team members, regardless of their backgrounds.<br/><br/></li></ul><strong>Compensation:</strong> $20 - $25 hourly + bonuses", "postedDate": "3 months ago", "benefits": "Ample opportunities for personal and professional development with a strong focus on continuous learning, A positive and encouraging work atmosphere, Generous benefits such as 10 paid days off, paid holidays, and 50% health insurance coverage after 90 days, Emphasis on maintaining a safe work environment, A culture that promotes collaboration and attentive listening, Dedication to diversity and inclusion, nurturing a welcoming and respectful workplace for all team members, regardless of their backgrounds.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3908985168"}