{"jobTitle": "Customer Advisor", "company": {"name": "Zegna", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "23.00/hr - 25.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>About Zegna<br/><br/></strong>Following the path traced by the founder Ermenegildo over 110 years ago, ZEGNA is now internationally recognized as a leading global luxury menswear brand. Established as a fabric maker in the mountains of Piedmont, ZEGNA is part of the Ermenegildo Zegna Group, which counts more than 6,000 employees. Managed by Gildo Zegna as Chairman and CEO, Ermenegildo Zegna Group designs, creates, and distributes luxury ready-to-wear and accessories under both the ZEGNA and Thom Browne brands to over 500 stores. The Group also operates TOM FORD FASHION through a long-term license agreement with The Estée Lauder Companies Inc. to over 100 stores. As of 30th September 2023, ZEGNA has 403 stores of which 242 are directly operated. The brand remains committed to leveraging its rich heritage to build a better present and future,<br/><br/><strong>YOUR OPPORTUNITY<br/><br/></strong>As a<strong> Customer Advisor </strong>for Zegna, you will aid in transforming a customer’s store visit into a memorable luxury shopping experience. As Brand Ambassadors, you help engage the Customers in the discovery of our heritage through stories and creating an atmosphere of passion and enthusiasm for the Zegna collections. The Customer Advisors builds a relationship with each customer that lasts over time and begins with the quality of their welcome, the gestures, and rituals of the selling ceremony and the provision of the highest level of service.<br/><br/>Reporting directly to the Store Manager, you will maximize sales through retail operational excellence and support to the overall store visual and image.<br/><br/>Customer Advisors are the trusted advisors of fashion and style, offering to the customer the highest level of sophistication and service. The role of the Customer Advisor at Ermenegildo Zegna stands at the very center of our organization as they continue to safeguard the growth and longevity of our Brand.<br/><br/><strong>How You Will Contribute<br/><br/></strong><ul><li>Provide memorable luxury in-store customer service experience by following the Zegna Selling Flow and acting in accordance with the Zegna Mindset. </li><li>Demonstrate an entrepreneurial mindset in developing the business.</li><li>Consistently and effectively networks to attract new customers and develop a customer database. </li><li>Consults with customers to discover their needs by exploring customer preferences and occasions for which the customers are shopping.</li><li>Anticipate customers expressed and unexpressed needs and wants and responds appropriately to exceed customer expectations. </li><li>Create opportunities for customers to experience multiple Zegna brands, products and “total looks” through demonstrating relevant yet personalized mix and match options. </li><li>Promote Zegna Made-to-Measure service as part of the selling repertoire where appropriate to meet the customer’s current and/or future needs.</li><li>Utilize company provided (iPod/iPad) technology to offer a complete and integrated luxury experience.</li><li>Leverage “Zegna Stories” to support and enhance the selling ceremony - </li><li>Collates useful and accurate customer data and information in accordance with Zegna CRM procedures and guidelines.</li><li>Cultivates future customer connections with Zegna (e.g. CRM after-sales activities including Thank You notes and Follow-up phone calls).</li><li>Utilize CRM software as the primary tool for after-sales communication. </li><li>Take ownership of resolving customer issues or complaints with empathy, while adhering to Zegna customer service policies such as alteration, damage, and repair, global return policies, etc. </li><li>Drive and perform onsite audits of store physical inventories.</li><li>Develop progressively in-depth knowledge of Zegna products, craftsmanship, fabrics, made-to-measure and style evolution whilst translating such knowledge into customer benefits.</li><li>Actively communicate customer, product, and other store information within the store team to ensure customer and business needs are met.</li><li>When required to support the orientation of new staff through acting as a learning coach or “buddy” if assigned by the Store Manager.</li><li>Measure own performance using Zegna customer service and sales KPIs such as cross-selling ratio, conversion rate, average sales bill</li><li>Adhere to Zegna store operations and time and attendance policies and standards.<br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>Is passionate and open-minded</li><li>Ability to self-learn and self-develop</li><li>Generates customer delight</li><li>Proficient with digital technology</li><li>Familiar with Apple products is a plus</li><li>Excellent written and verbal communication skills</li><li>The hiring range for this position ranges from $23-$25/hr with commission eligibility. The rate of pay offered will be dependent upon candidates' relevant skills and experience.</li></ul>", "responsibilities": "As a Customer Advisor for Zegna, you will aid in transforming a customer’s store visit into a memorable luxury shopping experience. As Brand Ambassadors, you help engage the Customers in the discovery of our heritage through stories and creating an atmosphere of passion and enthusiasm for the Zegna collections. The Customer Advisors builds a relationship with each customer that lasts over time and begins with the quality of their welcome, the gestures, and rituals of the selling ceremony and the provision of the highest level of service.<br/><br/>Reporting directly to the Store Manager, you will maximize sales through retail operational excellence and support to the overall store visual and image.<br/><br/>Customer Advisors are the trusted advisors of fashion and style, offering to the customer the highest level of sophistication and service. The role of the Customer Advisor at Ermenegildo Zegna stands at the very center of our organization as they continue to safeguard the growth and longevity of our Brand.", "qualifications": {"required": "Is passionate and open-minded\nAbility to self-learn and self-develop\nGenerates customer delight\nProficient with digital technology\nFamiliar with Apple products is a plus\nExcellent written and verbal communication skills"}, "skills": ["Customer Service", "Sales", "Retail", "Luxury", "Fashion", "CRM", "Digital Technology", "Apple Products"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3908978839"}