{"jobTitle": "Senior Director, Joint Ventures & Partnerships", "company": {"name": "Ankura", "location": "Washington, DC"}, "location": "Washington, DC", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "110,000.00/yr - 240,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Business Consulting and Services", "description": "Ankura is a team of excellence founded on innovation and growth.<br/><br/>The Joint Ventures &amp; Partnerships practice is the world’s leading advisory team on joint venture transactions and governance. This practice specializes in joint ventures and other non-M&amp;A partnerships, both in new deal formation and restructuring. On governance, consultants advise clients on corporate and joint venture governance, working with boards, management teams, and individual shareholders. We offer clients access to the most experienced advisors, the most comprehensive database of practices and benchmarks, the best proprietary tools, and the widest network of practitioners in the world. Our team has negotiated, restructured, or advised many of the largest and most complicated partnerships in the world across industries and geographies. This practice has advised on 250+ JV transactions valued at $750 billion, and supported the shareholders, boards, or management teams in more than 450 existing joint ventures.<br/><br/>The Senior Director role is an experienced senior level position that manages and delivers client engagement team(s) through challenging and complex joint venture strategy, transactions, and governance.<br/><br/><strong>Responsibilities<br/><br/></strong>Client Advisory: You will work with other members of the Joint Venture and Alliances team in directly advising clients on issues related to joint venture structuring, restructuring, and governance. You will be responsible for managing overall client engagements, including managing workstreams related to performing specific research and analyses, conducting, and capturing insights from interviews, and developing recommendations – as well as participating in client conversations and presentations. For joint venture transactions, this will include identifying comparable, developing deal options, evaluating, and recommending deal terms, recommending negotiating strategies and implementation approaches. For existing ventures, this will include diagnosing venture performance and underlying root causes (typically related to strategy and scope, governance, financial arrangements, service agreements, organisation, and talent), generating restructuring options, and supporting clients with implementation strategy. You will have significant interaction with senior executives at major global companies – including BU Presidents, CFOs, and Heads of Strategy and M&amp;A.<br/><br/>Client Development: You will work with other members of the Joint Venture and Alliances team, as well as members of practices throughout Ankura, to introduce new clients to Ankura, actively participating in introductory and ongoing relationship conversations, drafting proposals, and building new relationships.<br/><br/>Content Development and Delivery: You will work with other members of the Joint Venture and Alliances team, and take a lead role, in creating and delivering new and practical thinking on joint ventures. This will include conducting interviews with dealmakers, board members and CEOs of major joint ventures, and other executives involved in joint ventures. You will generate ideas on new content – and conduct interviews, perform research and analyses, generate insights, and develop tools to address the issues.<br/><br/>Broader Company Capabilities. Depending on your skills and interests – and the company’s needs at the time – you will likely be asked to take the lead on one (or two) areas associated with building our practice’s broader capabilities and market positioning.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>Manager level experience in transaction, joint venture and partnership intensive industries including high-tech, healthcare, pharmaceuticals, aerospace and defense, financial services, renewable energy, chemicals and/or mining</li><li>Preferable experience in one of the following environments:</li><li>Top tier strategy consulting firm focused on strategy, transactions and governance</li><li>Top law firm focused on M&amp;A and other transactions, with some exposure to corporate governance</li><li>An undergraduate degree from a top academic institution; advanced degree preferable</li><li>Ability and willingness to travel internationally is required.<br/><br/></li></ul>For individuals assigned and/or hired to work in California, Colorado, or New York, Ankura is required to include a reasonable estimate of the compensation range for this role. This compensation range is specific to the said markets and considers a broad range of factors including but not limited to skill sets, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. The range does not include additional benefits outside of salary. At Ankura, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each role. A reasonable estimate of the current base pay range is between $110,000 to $240,000 for Senior Director; this range is not a promise of a particular wage.<br/><br/>Ankura is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against based on disability. Equal Employment Opportunity Posters, if you have a disability and believe you need a reasonable accommodation to search for a job opening, submit an online application, or participate in an interview/assessment, please email accommodations@ankura.com or call toll-free +1.312-583-2122. This email and phone number are created exclusively to assist disabled job seekers whose disability prevents them from being able to apply online. Only messages left for this purpose will be returned. Messages left for other purposes, such as following up on an application or technical issues unrelated to a disability, will not receive a response.<br/><br/>", "responsibilities": "Client Advisory: You will work with other members of the Joint Venture and Alliances team in directly advising clients on issues related to joint venture structuring, restructuring, and governance. You will be responsible for managing overall client engagements, including managing workstreams related to performing specific research and analyses, conducting, and capturing insights from interviews, and developing recommendations – as well as participating in client conversations and presentations. For joint venture transactions, this will include identifying comparable, developing deal options, evaluating, and recommending deal terms, recommending negotiating strategies and implementation approaches. For existing ventures, this will include diagnosing venture performance and underlying root causes (typically related to strategy and scope, governance, financial arrangements, service agreements, organisation, and talent), generating restructuring options, and supporting clients with implementation strategy. You will have significant interaction with senior executives at major global companies – including BU Presidents, CFOs, and Heads of Strategy and M&amp;A.<br/><br/>Client Development: You will work with other members of the Joint Venture and Alliances team, as well as members of practices throughout Ankura, to introduce new clients to Ankura, actively participating in introductory and ongoing relationship conversations, drafting proposals, and building new relationships.<br/><br/>Content Development and Delivery: You will work with other members of the Joint Venture and Alliances team, and take a lead role, in creating and delivering new and practical thinking on joint ventures. This will include conducting interviews with dealmakers, board members and CEOs of major joint ventures, and other executives involved in joint ventures. You will generate ideas on new content – and conduct interviews, perform research and analyses, generate insights, and develop tools to address the issues.<br/><br/>Broader Company Capabilities. Depending on your skills and interests – and the company’s needs at the time – you will likely be asked to take the lead on one (or two) areas associated with building our practice’s broader capabilities and market positioning.", "qualifications": {"required": "Manager level experience in transaction, joint venture and partnership intensive industries including high-tech, healthcare, pharmaceuticals, aerospace and defense, financial services, renewable energy, chemicals and/or mining\nPreferable experience in one of the following environments:\nTop tier strategy consulting firm focused on strategy, transactions and governance\nTop law firm focused on M&amp;A and other transactions, with some exposure to corporate governance\nAn undergraduate degree from a top academic institution; advanced degree preferable\nAbility and willingness to travel internationally is required.", "preferred": ""}, "skills": ["Joint Venture", "Governance", "Strategy", "Transactions", "M&A", "Consulting", "Corporate Governance", "Client Management", "Research", "Analysis", "Negotiation", "Relationship Building", "Content Development", "Delivery", "Market Positioning"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3914157152"}