{"jobTitle": "Senior Demand Planner", "company": {"name": "West Marine", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "About West Marine<br/><br/>We don’t just sell anchors and rigging. We sell a love of the water that lasts for generations. <br/><br/>We don’t just sell life jackets and flares. We sell peace of mind for your most precious cargo.<br/><br/>We don’t just have a passion for boating. We have a lifetime of experience that we can’t wait to share with you. <br/><br/>So when you shop at West Marine, it’s not just for boating gear – it’s for the pure pursuit of more water and less hassle.<br/><br/>If you have a passion for being on the water and are looking to join a world-class organization, then West Marine is the place for you! West Marine is recognized as the premier multi-channel retailer of boating and fishing supplies with more than 230 stores located throughout 37 states and Puerto Rico. When you work at West Marine, you’re part of a family; one that values spending quality time on the water, doing the things you love, and sharing that passion with our customers and community.<br/><br/>Position Summary:<br/><br/>As a Sr. Demand Planner you will be responsible for optimizing our forecasting processes and driving process improvements throughout the organization. This critical role will be responsible for improving forecast accuracy in a complex and fast-moving organization while guiding business opportunities and operational insights through advanced data analytics.<br/><br/>Primary Responsibilities:<br/><br/><ul><li>Collaborate across the organization with category managers, marketing, and the operations teams to develop accurate demand forecasts and ensure supportability throughout the network.</li><li>Optimize forecast models and system configuration to drive accurate item/store level forecasts in partnership with our software partners.</li><li>Develop processes to accurately forecast promotions, new product introductions and strategic initiatives.</li><li>Participate in weekly cross functional S&amp;OP meetings to drive consensus throughout the organization and highlight business insights including risks and opportunities to the broader team.</li><li>Work closely with Replenishment Analysts to ensure that store level trends align with inventory and in-stock strategies.</li><li>Develop tools to track and drive forecast accuracy KPIs to achieve targets and drive continuous improvements in the organization.<br/><br/></li></ul>Education, Experience &amp; Skills:<br/><br/>CategoryApplicable Knowledge/Skills/Abilities<br/><br/>Minimum education required/preferred, area of study:<br/><br/><ul><li>A bachelor’s degree in business or related field<br/><br/></li></ul>Minimum years of relevant experience required:<br/><br/><ul><li>3-5 years of forecasting and S&amp;OP experience<br/><br/></li></ul>Additional skills/knowledge required include:<br/><br/><ul><li>Experience forecasting in a multi-tier planning tool (Relex a plus)</li><li>Strong data and analytics capabilities to drive business insights (SQL a plus)</li><li>Excellent written and verbal communication skills</li><li>Proven ability to collaborate with cross-functional teams to achieve company goals and objectives.</li></ul>", "responsibilities": "<ul><li>Collaborate across the organization with category managers, marketing, and the operations teams to develop accurate demand forecasts and ensure supportability throughout the network.</li><li>Optimize forecast models and system configuration to drive accurate item/store level forecasts in partnership with our software partners.</li><li>Develop processes to accurately forecast promotions, new product introductions and strategic initiatives.</li><li>Participate in weekly cross functional S&amp;OP meetings to drive consensus throughout the organization and highlight business insights including risks and opportunities to the broader team.</li><li>Work closely with Replenishment Analysts to ensure that store level trends align with inventory and in-stock strategies.</li><li>Develop tools to track and drive forecast accuracy KPIs to achieve targets and drive continuous improvements in the organization.<br/><br/></li></ul>", "qualifications": {"required": "Experience forecasting in a multi-tier planning tool (Relex a plus), Strong data and analytics capabilities to drive business insights (SQL a plus), Excellent written and verbal communication skills, Proven ability to collaborate with cross-functional teams to achieve company goals and objectives.", "preferred": "A bachelor’s degree in business or related field, 3-5 years of forecasting and S&amp;OP experience"}, "skills": ["Forecasting", "S&amp;OP", "Relex", "Data Analytics", "SQL", "Communication"], "postedDate": "2 weeks ago", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3915334087"}