{"jobTitle": "AMF Bakery Regional Account Manager - West Coast", "company": {"name": "AMF Bakery Systems", "industry": "Machinery Manufacturing", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Machinery Manufacturing", "description": "<strong>WE RISE TOGETHER! <br/><br/></strong>At AMF, we are dedicated to working alongside our customers to produce better food for families around the world while creating better lives for our teammates, families, customers, and communities.<br/><br/>AMF Bakery Systems is the world's largest manufacturer of high-speed bakery equipment. We provide complete automated bakery solutions for numerous categories, including Soft Bread and roll, Artisan Bread, Cake and Pie, Pizza and Flatbread and Pastry and Croissant. AMF is part of the Markel Food Groups, the leading equipment supplier to food manufactures around the world.<br/><br/>Our culture and shared values are spelled out in \"The Markel Style\" as we encourage and recognize teammates that bring these values to life each day. With the style as our guide, our teams pursue excellence while keeping a sense of humor. Seeking to know our customers' needs, we aim to build financial value for our shareholders while sharing success with others and winning together. We are inspired to work hard and encouraged to challenge management to find better ways of doing things. At AMF, we believe in fostering the professional development and personal potential of our diverse workforce.<br/><br/>If you're searching for the next company to call home, AMF Bakery Systems provides a teammate-centered culture with exciting career growth opportunities. We strive to build extraordinary teams by seeking out a wide range of talent, experiences, and diverse backgrounds. Diversity of thought and the collaboration of various life experiences are what drive growth and innovation at AMF.<br/><br/><strong>Job Description<br/><br/></strong>As the leading bakery equipment supplier, we're growing and need talented teammates like you to help us continue this journey. AMF Bakery is looking to hire a motived go-getter to serve as a Regional Account Manager. The Regional Account Manager is responsible for developing and executing a strategy for establishing new customer relationships and business opportunities as well as focusing on revenue growth strategy for existing customers that will lead to additional sales of products. The ideal candidate should be able to deliver excellent results and achieve goals set by the business and should have exceptional communication skills. This position will be partnering with Engineering, Project Management, and Marketing teams to deliver superior products and solutions to our clients.<br/><br/><strong>Job Duties Include<br/><br/></strong><ul><li>Develop and execute a strategy for establishing new customer relationships and business opportunities develop and execute a revenue growth strategy for existing customers leading to the additional sales of product </li><li>Execute through customer account analysis and prepare reports of field activities and Key Performance Indicators (KPIs) against target and forecasts</li><li>Attend sales review meeting with the Sales Director</li><li>Maintain customer relationships, respond to and anticipate customer needs and address any issues raised by customers in a timely manner</li><li>Manage all customer activity, opportunities, and proposals through CRM Software </li><li>Prepare tailored proposals for customers</li><li>Partner with the New Product Development team to research/develop new products/ranges</li><li>Partner with project managers to deliver products and solutions per contract requirements</li><li>Negotiate contracts to include commercial terms, pricing, and fulfillment of all agreed upon requirements</li><li>Maintain professional and technical knowledge by attending educational workshops; reviewing professional publications, and establishing personal networks<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Minimum of 5 years' experience in baking, or food processing equipment or related B@B Sales </li><li>Knowledge of the fundamentals of processing and baking of specialty products such as artisan bread, pastry, croissant, pizza, cake, and pie </li><li>Experience with AutoCAD software, and ability to interpret layout drawings</li><li>Experience with pricing and executing sales strategies </li><li>Strong negotiation and influencing skills with a customer-oriented approach </li><li>Proven decision making and problem-solving skills </li><li>Strong organizational skills and ability to prioritize work </li><li>Willingness to travel 50+% of the time</li><li>Commitment to continuous improvement <br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Bachelor's Degree in Mechatronic, Mechanical, Electronic, Bakery Science, or related field </li><li>Experience in the food, beverage, or bakery industry</li><li>Experience with CRM systems (AMF uses Dynamics365)<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>AMF Bakery Systems offers a competitive compensation, benefits package, and excellent opportunities for growth throughout our organization globally and within the Markel Food Group </li><li>Laptop, Mobile Phone, benefits package</li></ul>", "responsibilities": "As the leading bakery equipment supplier, we're growing and need talented teammates like you to help us continue this journey. AMF Bakery is looking to hire a motived go-getter to serve as a Regional Account Manager. The Regional Account Manager is responsible for developing and executing a strategy for establishing new customer relationships and business opportunities as well as focusing on revenue growth strategy for existing customers that will lead to additional sales of products. The ideal candidate should be able to deliver excellent results and achieve goals set by the business and should have exceptional communication skills. This position will be partnering with Engineering, Project Management, and Marketing teams to deliver superior products and solutions to our clients.", "qualifications": {"required": "Minimum of 5 years' experience in baking, or food processing equipment or related B@B Sales , Knowledge of the fundamentals of processing and baking of specialty products such as artisan bread, pastry, croissant, pizza, cake, and pie , Experience with AutoCAD software, and ability to interpret layout drawings, Experience with pricing and executing sales strategies , Strong negotiation and influencing skills with a customer-oriented approach , Proven decision making and problem-solving skills , Strong organizational skills and ability to prioritize work , Willingness to travel 50+% of the time, Commitment to continuous improvement ", "preferred": "Bachelor's Degree in Mechatronic, Mechanical, Electronic, Bakery Science, or related field , Experience in the food, beverage, or bakery industry, Experience with CRM systems (AMF uses Dynamics365)"}, "skills": ["AutoCAD", "CRM", "Sales", "Negotiation", "Customer Service", "Problem Solving", "Communication", "Baking", "Food Processing"], "postedDate": "3 months ago", "benefits": "AMF Bakery Systems offers a competitive compensation, benefits package, and excellent opportunities for growth throughout our organization globally and within the Markel Food Group , Laptop, Mobile Phone, benefits package", "remoteWork": "No", "salary": {"amount": "59,000.00/yr - 60,000.00/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3916132371"}