{"jobTitle": "Customer Service Representative Advocate", "company": {"name": "CLC", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Education Management", "description": "<strong>Job Description<br/><br/></strong>The Customer Advocate is responsible for locating a legal provider (lawyer and/or mediator) to assist with the customer's legal matter. Customer Advocates are also responsible for creating and maintaining CLC's network of provider relationships. This position involves outbound calling, receiving inbound calls, and email communications to our members and providers. This is an hourly position with the ability to earn monthly incentives.<br/><br/>Position Responsibilities:<br/><br/><ul><li></li><li> Assisting customers with locating a qualified legal provider for the customer's legal need(s). </li><li></li><li> Building CLC's network of legal providers by researching and using various online and referral recruitment resources. </li><li></li><li> Introducing and promoting the CLC Legal Program by cold calling to legal providers. </li><li></li><li> Validating legal provider's professional licensing through local and state agencies. </li><li></li><li> Managing a caseload of 25+ customers. </li><li></li><li> Successfully recruiting for individual customer's referrals, network partnership, legal class requests, and other special promotions/assignments. </li><li></li><li> Meeting or exceeding established company standards of provider and member satisfaction, accuracy, quality, and timelines. <br/><br/></li></ul>Our Newest Team Member Must Come With the Following Qualifications:<br/><br/><ul><li></li><li> Compassionate and courteous communicator in all internal and external interactions. </li><li></li><li> Strong organizational and time-management skills</li><li></li><li> Ability to successfully multitask with multiple assigned cases. </li><li></li><li> Accurately able to retain and document large amounts of information. </li><li></li><li> Has a willing, \"can do\" attitude, always ready to seek-out best solutions and outcomes for our customers and/or providers. <br/><br/></li></ul>Education/Training/Experience Required:<br/><br/><ul><li>High school or equivalent (Preferred)<br/><br/></li></ul>Work Environment &amp; Physical Demands:<br/><br/>While performing the duties of the job, this position operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. While performing the duties of this job, the employee is regularly required to use hands and fingers to handle, feel, or operate objects, tools or controls, and reach with hands and arms. The employee is frequently required to sit, stand, talk and hear. Travel is not required for this position.<br/><br/>To apply for this position, please submit your application via the link below:<br/><br/>https://legalshieldcorp.wd1.myworkdayjobs.com/CLC/job/Remote-Job-Posting/Provider-Relations-Recruiter_R0002062<br/><br/><strong>Company Description<br/><br/></strong>We provide members with access to top rated attorneys in their local communities, and Identity Theft Protection.<br/><br/>We provide members with access to top rated attorneys in their local communities, and Identity Theft Protection.", "postedDate": "3 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3921042618"}