{"jobTitle": "Inventory Planning Analyst", "company": {"name": "Jazwares, LLC", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Business Development and Sales", "industry": "Manufacturing", "description": "The Inventory Planning Analyst is responsible for helping manage inventory plans within the organization. This position involves analyzing inventory levels, distributing inventory reports, and consistently updating systems and reports. Additionally, the Inventory Analyst is responsible for documenting and communicating any inventory-related issues that may arise. Reporting to the Director of Inventory Planning, this role works closely with Demand Planning, Sales, and Procurement teams to maintain smooth inventory operations.<br/><br/>What you'll be doing:<br/><br/>\n<ul><li>Review and track inventory reservations for both production and warehouse inventory.</li><li>Maintain and develop reports that identify various analytical perspectives of inventory.</li><li>Monitor the allocation process with analytical thinking and problem solving.</li><li>Balance customer allocations and demand plan.</li><li>Reconcile production dates against demand requirements.</li><li>Attend weekly cross-functional meetings with sales, procurement, and planning team.</li><li>Collaborate with supporting departments to ensure on-time delivery of purchase requests</li><li>Create comprehensive reports that identify aged inventory for leadership and sales review.</li><li>Responsible to ensure documentation related to inventory flows/purchase requests is complete and accurate.</li><li>Maintain all files, reports and related activities in professional, timely and organized manner</li><li>Participate in special projects related to inventory management as required.</li><li>Perform other duties as assigned<br/><br/></li></ul>What we look for:<br/><br/>\n<ul><li>Minimum High school diploma or GED required</li><li>Bachelor’s degree in business, finance, economics or related field preferred</li><li>2+ years of similar professional experience (or commensurate combination of experience and education)</li><li>Must have excellent computer skills with an advanced understanding of excel</li><li>Team player that works in the best interests of all - within and across functions and levels. </li><li>Proactive problem solver, with a willingness to jump in and fix something even if its outside regular scope of responsibility</li><li>Must be able to function effectively and independently in an evolving office environment.</li><li>Good communication, presentation, and multi-tasking skills</li><li>Highly motivated self-starter with a sense of ownership and an ability to thrive in a high-energy, fast-paced environment</li><li>Must perform well in high pressure situations, and able to effectively balance competing priorities </li><li>Experience in a consumer goods industry</li><li>Multilingual a plus <br/><br/></li></ul>Working Conditions:<br/><br/>\n<ul><li>Environment: Office</li><li>Extreme Exposures: None</li><li>Schedule: Typically requires regular office hours, but will require attending calls with global counterparts outside of regular office hours </li><li>Physical Requirements: Lift up to 10 lbs . Must be able to stand, walk, sit, hear, and see frequently</li><li>Travel Required: None<br/><br/></li></ul>What we offer:<br/><br/>\nAt Jazwares, we believe in providing our employees with comprehensive and competitive benefits that support their well-being and overall satisfaction.<br/><br/>Base salary may vary based on experience, role tenure, performance, industry, and location. Eligibility for annual performance incentives may apply. Jazwares is a multi-state employer, salary range may not apply to other states.<br/><br/>Our benefits package includes basic medical insurance that is 100% company-paid for employees and their children, employee basic life and AD&amp;D insurance, a 401(K) retirement program with Jazwares matching up to 4% of pretax or post-tax deferrals, short and long-term disability, and tuition reimbursement.<br/><br/>Our work environment provides a flexible work schedule that includes a Monday through Thursday on-site, with an optional WFH on Fridays, up to 20 workdays fully remote each year, and Time Off for vacation, and sick leave. Through Jazwares Cares, you have the opportunity to volunteer for up to 16 hours a year on community service projects.<br/><br/>Working at Jazwares:<br/><br/>\nAt Jazwares, we believe an innovative idea can come from anywhere, and anyone. Through our three pillars, we foster innovation and encourage creativity in every area of our business.<br/><br/>Humility: We recognize the value in others and treat everyone with respect. Our strength lies in our people and talent.<br/><br/>Passion: Our conviction and enthusiasm show in our products, relationships, and commitment to our community.<br/><br/>Collaboration: We share one vision worldwide, constantly striving to improve and innovate together.<br/><br/>Don't miss out on this extraordinary opportunity to be part of the fastest-growing toy company in the industry. Connect with us today and let's shape the future of play together!<br/><br/>JAZWARES is an equal opportunity employer and does not discriminate in employment based on race, color, sex, religion, national or ethnic origin, citizenship status, ancestry, disability, age, military status, marital status, sexual orientation, or any other characteristic protected by law.", "responsibilities": "The Inventory Planning Analyst is responsible for helping manage inventory plans within the organization. This position involves analyzing inventory levels, distributing inventory reports, and consistently updating systems and reports. Additionally, the Inventory Analyst is responsible for documenting and communicating any inventory-related issues that may arise. Reporting to the Director of Inventory Planning, this role works closely with Demand Planning, Sales, and Procurement teams to maintain smooth inventory operations.", "qualifications": {"required": "Minimum High school diploma or GED required\nBachelor’s degree in business, finance, economics or related field preferred\n2+ years of similar professional experience (or commensurate combination of experience and education)\nMust have excellent computer skills with an advanced understanding of excel\nTeam player that works in the best interests of all - within and across functions and levels. \nProactive problem solver, with a willingness to jump in and fix something even if its outside regular scope of responsibility\nMust be able to function effectively and independently in an evolving office environment.\nGood communication, presentation, and multi-tasking skills\nHighly motivated self-starter with a sense of ownership and an ability to thrive in a high-energy, fast-paced environment\nMust perform well in high pressure situations, and able to effectively balance competing priorities \nExperience in a consumer goods industry\nMultilingual a plus ", "preferred": ""}, "skills": ["Excel", "Problem Solving", "Communication", "Teamwork"], "postedDate": "1 week ago", "benefits": "At Jazwares, we believe in providing our employees with comprehensive and competitive benefits that support their well-being and overall satisfaction.<br/><br/>Base salary may vary based on experience, role tenure, performance, industry, and location. Eligibility for annual performance incentives may apply. Jazwares is a multi-state employer, salary range may not apply to other states.<br/><br/>Our benefits package includes basic medical insurance that is 100% company-paid for employees and their children, employee basic life and AD&amp;D insurance, a 401(K) retirement program with Jazwares matching up to 4% of pretax or post-tax deferrals, short and long-term disability, and tuition reimbursement.<br/><br/>Our work environment provides a flexible work schedule that includes a Monday through Thursday on-site, with an optional WFH on Fridays, up to 20 workdays fully remote each year, and Time Off for vacation, and sick leave. Through Jazwares Cares, you have the opportunity to volunteer for up to 16 hours a year on community service projects.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3925348300"}