{"jobTitle": "Geospatial Database Engineer", "company": {"name": "Akima", "location": "Hurlburt Field, FL"}, "location": "Hurlburt Field, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Consumer Services", "description": "<strong>Overview<br/><br/></strong><strong>Work Where it Matters<br/><br/></strong>Compass Point, an Akima company, is not just another federal IT contractor. As an Alaska Native Corporation (ANC), our mission and purpose extend beyond our exciting federal projects as we support our shareholder communities in Alaska.<br/><br/>At Compass Point, the work you do every day makes a difference in the lives of our 15,000 Iñupiat shareholders, a group of Alaska natives from one of the most remote and harshest environments in the United States.<br/><br/><strong>For our shareholders</strong> , Compass Point provides support and employment opportunities and contributes to the survival of a culture that has thrived above the Arctic Circle for more than 10,000 years.<br/><br/><strong>For our government customers</strong> , Compass Point delivers a broad range of skilled IT services, including data-centric services, software development, IT infrastructure modernization, managed IT services, and more.<br/><br/><strong>As a Compass Point employee</strong> , you will be surrounded by a challenging, yet supportive work environment that is committed to innovation and diversity, two of our most important values. You will also have access to our comprehensive benefits and competitive pay in addition to growth opportunities and excellent retirement options.<br/><br/><strong>Job Summary:<br/><br/></strong>Compass Point is looking to hire a Geospatial Database Engineer to join us supporting one of our current government customers at Hurlburt Field, FL. The successful candidate will be part of a team that builds virtual environments that are flown on Special Operations Forces ground and air simulators; the system provides operational intelligence support to enable integrated SOF mission planning and rehearsal for real-world combat environments. This position will help develop, enhance, and analyze various forms of digital geographical data, and then assemble this data into real-time 3D visual databases for flight and ground simulation.<br/><br/>There are significant growth and learning opportunities exist for those who demonstrates initiative, inventiveness, original thought, incisive analysis, and comprehensive synthesis. Excellent analytical, organizational, and communication skills are required.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Job Responsibilities:<br/><br/></strong><ul><li>This position produces 3D high-level and low-level models in support of SOF training, planning, rehearsal, and 3D terrain database generation execution systems. </li><li>Formulates concepts and renders details from photos, CAD drawings, video, imagery, written or verbal information, and uses imagination to create or recreate 3D models. </li><li>Editing and creating textures, buildings, vehicles, and people for incorporation into various 3D database formats such as Vital, Unity, VRSG, VBS4, etc. </li><li>Creates geospatial informational (GIS) data in support of 3D simulation projects. </li><li>Validates the geospatial accuracy and certifies the use of intelligence data in the completed products. </li><li>Other duties as required. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Minimum Qualifications:<br/><br/></strong><ul><li> Ability to obtain a Secret clearance. </li><li>Associate or Bachelor-level degree (Combination of training, education, experience including Military service equivalent to a degree and required years of experience may be acceptable). </li><li>Minimum of 5 years of professional and relevant experience, Experience supporting military / DoD program is a plus. </li><li>Experience in creating 3D models for database generation software; or creating Geographic Information Systems (GIS) computer systems displays and mapping. </li><li>Proficient user of at least two of the following programs: Photoshop, Presagis Creator, Autodesk 3D Studio Max, Autodesk Maya, ESRI ArcGIS Suite, FSI Vital 1100, CDB, Presagis Terra Vista, TerraSim TerraTools, VBS4 Toolkit, Unity. </li><li>Working knowledge of database generation workflow. </li><li>Experience creating and manipulating textures in Photoshop, Substance, or other editing software. </li><li>Experience creating and manipulating multiple geospatial intelligence data formats used to create simulation visual databases. </li><li>Have demonstrated an ability to balance responsibilities among assigned activities; including the ability to manage transitions effectively from task to task, and proven adaptability to varying customer needs. </li><li>Good time management skills are necessary to complete projects. <br/><br/></li></ul>We are an equal opportunity employer and comply with all applicable federal, state, and local fair employment practices laws. All applicants will receive consideration for employment, without regard to race, color, religion, creed, national origin, gender or gender-identity, age, marital status, sexual orientation, veteran status, disability, pregnancy or parental status, or any other basis prohibited by law. If you are an individual with a disability, or have known limitations related to pregnancy, childbirth, or related medical conditions, and would like to request a reasonable accommodation for any part of the employment process, please contact us at job-assist@akima.com or 571-353-7053 (information about job applications status is not available at this contact information).<br/><br/><strong>Job:</strong> Information Technology<br/><br/><strong>Travel:</strong> Yes, 25% of the time<br/><br/><strong>Organization:</strong> Compass Point<br/><br/><strong>Clearance:</strong> Able to Obtain Secret<br/><br/><strong>Work Type:</strong> On-Site<br/><br/><strong>Remote:</strong> No<br/><br/><strong>ReqID:</strong> 2024-11288", "responsibilities": "<strong>Job Responsibilities:<br/><br/></strong><ul><li>This position produces 3D high-level and low-level models in support of SOF training, planning, rehearsal, and 3D terrain database generation execution systems. </li><li>Formulates concepts and renders details from photos, CAD drawings, video, imagery, written or verbal information, and uses imagination to create or recreate 3D models. </li><li>Editing and creating textures, buildings, vehicles, and people for incorporation into various 3D database formats such as Vital, Unity, VRSG, VBS4, etc. </li><li>Creates geospatial informational (GIS) data in support of 3D simulation projects. </li><li>Validates the geospatial accuracy and certifies the use of intelligence data in the completed products. </li><li>Other duties as required. <br/><br/></li></ul>", "qualifications": {"required": " Ability to obtain a Secret clearance. \nAssociate or Bachelor-level degree (Combination of training, education, experience including Military service equivalent to a degree and required years of experience may be acceptable). \nMinimum of 5 years of professional and relevant experience, Experience supporting military / DoD program is a plus. \nExperience in creating 3D models for database generation software; or creating Geographic Information Systems (GIS) computer systems displays and mapping. \nProficient user of at least two of the following programs: Photoshop, Presagis Creator, Autodesk 3D Studio Max, Autodesk Maya, ESRI ArcGIS Suite, FSI Vital 1100, CDB, Presagis Terra Vista, TerraSim TerraTools, VBS4 Toolkit, Unity. \nWorking knowledge of database generation workflow. \nExperience creating and manipulating textures in Photoshop, Substance, or other editing software. \nExperience creating and manipulating multiple geospatial intelligence data formats used to create simulation visual databases. \nHave demonstrated an ability to balance responsibilities among assigned activities; including the ability to manage transitions effectively from task to task, and proven adaptability to varying customer needs. \nGood time management skills are necessary to complete projects. <br/><br/>", "preferred": null}, "skills": ["Photoshop", "Presagis Creator", "Autodesk 3D Studio Max", "Autodesk Maya", "ESRI ArcGIS Suite", "FSI Vital 1100", "CDB", "Presagis Terra Vista", "TerraSim TerraTools", "VBS4 Toolkit", "Unity", "GIS"], "postedDate": "3 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3927475398"}