{"jobTitle": "Senior Account Executive, High Tech Global Enterprise - SF Bay Area, Portland, Phoenix", "company": {"name": "Gartner", "industry": "IT Services and IT Consulting, Information Services, and Research Services", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "129,500 USD - 177,000 USD", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Information Technology", "industry": "IT Services and IT Consulting, Information Services, and Research Services", "description": "About the role: <br/><br/>The Senior Account Executive is a field-based, direct sales role responsible for both client retention as well as growth through contract expansion and the introduction of new products and services. You will consult with C-level executives to develop and implement an effective, enterprise-wide strategy that maximizes the value delivered by Gartner’s products and services.<br/><br/>What you will do:<br/><br/><ul><li>Account management with an outcome of increased customer satisfaction and an increase in retention and account growth </li><li>Quota responsibility of $800,000+ of contract value within a territory of major client accounts</li><li>Mastery and consistent execution of Gartner’s sales methodology </li><li>Account planning and territory management </li><li>Managing forecast accuracy on a monthly/quarterly/annual basis </li><li>Maintaining competitive knowledge and focus </li><li>In-depth knowledge of Gartner’s products and services <br/><br/></li></ul>What you will need: <br/><br/><ul><li>8-15 years of experience with proven consultative sales, preferably in high technology (services, software, or consultative environment), with evidence of prior success in Sales</li><li>Strong demonstration of intellect, drive, executive presence and sales acumen </li><li>Proven experience building excellent client relationships at C-level within large enterprise organizations</li><li>Strong computer proficiency and presentation skills</li><li>Knowledge of the full life cycle of the sales process </li><li>Bachelor’s or Master’s degree – desired<br/><br/></li></ul>What you will get:<br/><br/><ul><li>Competitive salary, generous paid time off policy, charity match program, Medical, Dental &amp; Vision Plans, Parental Leave, Employee Assistance Program (EAP), 401K matching</li><li>Collaborative, team-oriented culture that embraces diversity </li><li>Professional development and unlimited growth opportunities<br/><br/></li></ul>#GTSSales<br/><br/>Who are we?<br/><br/>At Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world.<br/><br/>Our mission relies on expert analysis and bold ideas to deliver actionable, objective insight, helping enterprise leaders and their teams succeed with their mission-critical priorities.<br/><br/>Since our founding in 1979, we’ve grown to more than 20,000 associates globally who support ~15,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here.<br/><br/>What makes Gartner a great place to work?<br/><br/>Our sustained success creates limitless opportunities for you to grow professionally and flourish personally. We have a vast, virtually untapped market potential ahead of us, providing you with an exciting trajectory long into the future. How far you go is driven by your passion and performance.<br/><br/>We hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients.<br/><br/>Our teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations.<br/><br/>We invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work.<br/><br/>What do we offer?<br/><br/>Gartner offers world-class benefits, highly competitive compensation and disproportionate rewards for top performers.<br/><br/>In our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring.<br/><br/>Ready to grow your career with Gartner? Join us.<br/><br/>Gartner believes in fair and equitable pay. A reasonable estimate of the base salary range for this role is 129,500 USD - 177,000 USD. Please note that actual salaries may vary within the range, or be above or below the range, based on factors including, but not limited to, education, training, experience, professional achievement, business need, and location. In addition to base salary, employees will participate in either an annual bonus plan based on company and individual performance, or a role-based, uncapped sales incentive plan. Our talent acquisition team will provide the specific opportunity on our bonus or incentive programs to eligible candidates. We also offer market leading benefit programs including generous PTO, a 401k match up to $7,200 per year, the opportunity to purchase company stock at a discount, and more.<br/><br/>The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.<br/><br/>Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to ApplicantAccommodations@gartner.com.<br/><br/>Job Requisition ID:88734<br/><br/>By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.<br/><br/>Gartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy<br/><br/>For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.<br/><br/>", "responsibilities": "The Senior Account Executive is a field-based, direct sales role responsible for both client retention as well as growth through contract expansion and the introduction of new products and services. You will consult with C-level executives to develop and implement an effective, enterprise-wide strategy that maximizes the value delivered by Gartner’s products and services.", "qualifications": {"required": "8-15 years of experience with proven consultative sales, preferably in high technology (services, software, or consultative environment), with evidence of prior success in Sales, Strong demonstration of intellect, drive, executive presence and sales acumen , Proven experience building excellent client relationships at C-level within large enterprise organizations, Strong computer proficiency and presentation skills, Knowledge of the full life cycle of the sales process , Bachelor’s or Master’s degree – desired", "preferred": ""}, "skills": ["Sales", "Account Management", "Customer Relationship Management (CRM)", "Sales Process", "Sales Management", "Sales Strategy", "Business Development", "Client Relationship Management", "Sales Operations", "Sales Forecasting", "Territory Management", "Product Knowledge", "Competitive Analysis", "Presentation Skills", "Communication Skills", "Relationship Building", "Consultative Selling", "Executive Presence", "Sales Acumen", "High Technology", "Software", "Services", "Enterprise Sales", "C-Level", "Computer Proficiency"], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Competitive salary, generous paid time off policy, charity match program, Medical, Dental &amp; Vision Plans, Parental Leave, Employee Assistance Program (EAP), 401K matching, Collaborative, team-oriented culture that embraces diversity , Professional development and unlimited growth opportunities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3930474039"}