{"jobTitle": "Territory Sales Manager", "company": {"name": "Alside", "industry": "Wholesale Building Materials", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Wholesale Building Materials", "description": "Since 2022, Associated Materials / Alside has been undergoing a transformation to maximize our potential through investments in people, operations, and brands.<br/><br/>If you want to be part of a company where your ideas and input are more than just encouraged--they are valued--this is the place for you. At Associated Materials / Alside, your contributions will provide an immediate and lasting impact, helping us achieve what is possible.<br/><br/><strong>Position Summary<br/><br/></strong>Founded in 1947, Alside is a leading distributor of exterior building products for residential and commercial remodeling and new construction markets.<br/><br/>As the <strong>Territory Sales Manager</strong> you will be responsible for developing and maintaining target accounts while driving sales growth and new business within a specific territory. This is such a critical role to our business and is well suited for someone who enjoys talking with customers and cultivating relationships. This is a perfect sales opportunity for the sales hunter that prefers to be home in the evening!<br/><br/><strong>Compensation<br/><br/></strong>Base range: $65,000 to $75,000 based on experience<br/><br/>Commission: 55% uncapped<br/><br/><strong>Key Accountabilities<br/><br/></strong><ul><li>Leading all sales and account/planning, forecasting, reporting, management efforts for assigned accounts within territory</li><li>Understanding, assessing, and anticipating customers' objectives, strategies, and requirements to identify and pursue sales opportunities</li><li>Through the acquisition of new customers to maximize supply center revenue</li><li>Providing exceptional, and escalated customer service issue follow-up, and a solid partnership with the primary contact point for issue resolution</li><li>Working closely with supply center and corporate resource to have them enter &amp; fulfill orders</li><li>Having a strong knowledge of the AM sales process and policies (e.g., accruals, credit, expenses, rewards)</li><li>Acting as a mentor for other sales representatives<br/><br/></li></ul><strong>Key Responsibilities<br/><br/></strong><ul><li>Brings core product specification knowledge, application, and value to the customer</li><li>Understands necessary building codes and how they impact AM company products</li><li>Reads blueprints and understands take-off capabilities for core products</li><li>Sells remodeling, new construction, project work, and ISS (Installed Sales Solutions)</li><li>Must be able to accurately demo all core products to small and large audiences</li><li>Understands the basics of negotiating correct market value pricing for the assigned territory, and seeks advice from the Market General Manager or Regional VP<br/><br/></li></ul><strong>Required Education, Experience &amp; Skills<br/><br/></strong><ul><li>Successful sales history with 2+ years of outside sales experience</li><li>Solid longevity in past positions</li><li>Strong organizational and time management skills</li><li>Vehicle that meets our vehicle reimbursement program</li><li>CRM experience required</li><li>Microsoft suite; must be able to use in your day to day</li><li>Self-directed, highly organized, customer-focused, detail oriented, and competitive</li><li>Proven experience in new business selling, upselling, and selling</li><li>Travel 70% of the week within the region<br/><br/></li></ul><strong>Preferred Education, Experience &amp; Skills<br/><br/></strong><ul><li>Experience within the building materials industry is highly preferred</li><li>Bachelor's degree preferred</li><li>Salesforce preferred</li><li>Working knowledge of core building material products (specifically windows &amp; siding) for both single and multi-family applications</li><li>Preferred experience working with builders and architects to create bigger ticket sales<br/><br/></li></ul>A brand of Associated Materials, Alside is a leader in exterior building products for residential and commercial remodeling and new construction markets. Established in 1947, Alside distributes a variety of windows, siding, metals, and other building products throughout its more than 100 company-operated supply centers across the United States, serving as a true partner to contractors, remodelers, builders and architects for building products and services.<br/><br/><strong>ALSIDE BUILDING PRODUCTS . . . THE CHOICE OF INDUSTRY PROFESSIONALS<br/><br/></strong>Associated Materials, LLC. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, ancestry, age, disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. We also make reasonable accommodations for disabled employees and applicants, as required by law.<br/><br/>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled", "responsibilities": "As the Territory Sales Manager you will be responsible for developing and maintaining target accounts while driving sales growth and new business within a specific territory. This is such a critical role to our business and is well suited for someone who enjoys talking with customers and cultivating relationships. This is a perfect sales opportunity for the sales hunter that prefers to be home in the evening!", "qualifications": {"required": "Successful sales history with 2+ years of outside sales experience, Solid longevity in past positions, Strong organizational and time management skills, Vehicle that meets our vehicle reimbursement program, CRM experience required, Microsoft suite; must be able to use in your day to day, Self-directed, highly organized, customer-focused, detail oriented, and competitive, Proven experience in new business selling, upselling, and selling, Travel 70% of the week within the region", "preferred": "Experience within the building materials industry is highly preferred, Bachelor's degree preferred, Salesforce preferred, Working knowledge of core building material products (specifically windows &amp; siding) for both single and multi-family applications, Preferred experience working with builders and architects to create bigger ticket sales"}, "skills": ["Sales", "Customer Service", "CRM", "Microsoft Suite", "Building Materials", "Salesforce", "Negotiation", "Time Management", "Organization"], "postedDate": "2 weeks ago", "benefits": "Base range: $65,000 to $75,000 based on experience<br/><br/>Commission: 55% uncapped", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3938958230"}