{"jobTitle": "Senior Account Executive - Cisco Solutions", "company": {"name": "CyberCoders", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $300,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Accounting", "description": "We are a National, leading Technology Services &amp; Solutions Provider partnered with Cisco, Aruba, Microsoft and other vendors and working with commercial, enterprise and public sector customers. We are currently seeking an experienced Senior Account Manager to join our growing team.<br/><br/>The Senior Account Manager will be responsible for selling advanced IT managed and professional services and solutions to customers in the Commercial and Enterprise space. The Senior Account Manager will be responsible for managing and expanding the customer base within the assigned territory as well as manage a quota in both network product resale and consulting services to include Enterprise Networking, Data Center, Collaboration and Security solutions.<br/><br/><ul><li>This position allows you to work remotely from home when not meeting with customers. This position will require the Account Manager be based in the Portland or Seattle areas and can work remotely with some occasional travel.<br/><br/></li></ul>If this sounds like you, please read on and you are encouraged to apply ASAP. You may also send your resume directly to Alex.Higgins@cybercoders.com<br/><br/><strong>What You Will Be Doing<br/><br/></strong><ul><li>The Senior Account Manager will be responsible for managing and expanding the customer base within the assigned territory.</li><li>Achieve sales and growth objectives through prospecting, lead response, and relationship building with Enterprise &amp; Commercial Accounts </li><li>Selling Advanced IT Solutions and Services (Networking, Data Center, Security, Collaboration, etc.) to customers </li><li>Discover clients' business needs and propose appropriate product or services</li><li>Manage territory, including account planning and opportunity management</li><li>Develop and maintain a high level of knowledge about our products and services<br/><br/></li></ul><strong>What You Need For This Position<br/><br/></strong><ul><li>At least 4 or more years of technology sales experience </li><li>Strong knowledge and experience Selling Advanced IT Solutions (Enterprise Networking, Data Center, Collaboration, Security) </li><li>Experience selling multiple vendors solutions such as: Cisco, Microsoft, VMware, Dell, NetApp, EMC, etc. </li><li>Experience working with and selling to commercial, enterprise, healthcare and/ or public sector verticals </li><li>Experience working at a Value-add reseller (VAR) or system integrator is highly preferred</li><li>Willingness to do some travel to customers in the territory </li><li>Successful track record in field sales / hunting roles </li><li>Strong skills in developing new relationships with customers </li><li>Proven record of success achieving / exceeding sales targets and goals </li><li>Excellent written and verbal communication skills </li><li>Strong Presentation skills<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive Compensation (Base + Uncapped earning potential) based on experience </li><li>Remote w/ minimal travel (Must be based in Portland and/ or Seattle areas) </li><li>3 Weeks PTO </li><li>Paid Holidays</li><li>Flexible Schedules to ensure Work/ Life Balance </li><li>401k match</li><li>Medical, Dental, Vision</li><li>Opportunities for growth <br/><br/></li></ul><strong>Email Your Resume In Word To<br/><br/></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br/><br/>alex.higgins@cybercoders.com<br/><br/><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AM8-1804018 -- in the email subject line for your application to be considered.***<br/><br/></li></ul>Alex Higgins - Lead Recruiter<br/><br/>Applicants must be authorized to work in the U.S.<br/><br/><strong>CyberCoders is proud to be an Equal Opportunity Employer<br/><br/></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, status as a crime victim, disability, protected veteran status, or any other characteristic protected by law. CyberCoders will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. CyberCoders is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please contact a member of our Human Resources team to make arrangements.<br/><br/>", "responsibilities": "The Senior Account Manager will be responsible for managing and expanding the customer base within the assigned territory. Achieve sales and growth objectives through prospecting, lead response, and relationship building with Enterprise &amp; Commercial Accounts  Selling Advanced IT Solutions and Services (Networking, Data Center, Security, Collaboration, etc.) to customers  Discover clients' business needs and propose appropriate product or services Manage territory, including account planning and opportunity management Develop and maintain a high level of knowledge about our products and services", "qualifications": {"required": "At least 4 or more years of technology sales experience  Strong knowledge and experience Selling Advanced IT Solutions (Enterprise Networking, Data Center, Collaboration, Security)  Experience selling multiple vendors solutions such as: Cisco, Microsoft, VMware, Dell, NetApp, EMC, etc.  Experience working with and selling to commercial, enterprise, healthcare and/ or public sector verticals  Experience working at a Value-add reseller (VAR) or system integrator is highly preferred Willingness to do some travel to customers in the territory  Successful track record in field sales / hunting roles  Strong skills in developing new relationships with customers  Proven record of success achieving / exceeding sales targets and goals  Excellent written and verbal communication skills  Strong Presentation skills"}, "skills": ["Cisco", "Microsoft", "VMware", "Dell", "NetApp", "EMC", "Sales", "Technology", "Networking", "Data Center", "Collaboration", "Security", "Enterprise", "Commercial", "Healthcare", "Public Sector", "Value-add reseller", "System integrator", "Relationship building", "Prospecting", "Lead response", "Account planning", "Opportunity management", "Presentation skills", "Communication skills"], "postedDate": "2 weeks ago", "benefits": "Competitive Compensation (Base + Uncapped earning potential) based on experience  Remote w/ minimal travel (Must be based in Portland and/ or Seattle areas)  3 Weeks PTO  Paid Holidays Flexible Schedules to ensure Work/ Life Balance  401k match Medical, Dental, Vision Opportunities for growth ", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3940580308"}