{"jobTitle": "Data Analyst, Senior with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "Job Number: R0199140 Data Analyst, Senior<br/><br/><strong>The Opportunity<br/><br/></strong>As a data analyst, you love diving into data and turning it into meaningful insights. With the abundance of structured and unstructured data, you understand the importance of transforming complex data sets into useful information to solve challenges. As a data analyst at Booz Allen, you can use your skills and experience to support a mission and use data for good. As a client-facing data analyst, you'll work closely with your clients to understand their questions and needs and then dig into their data-rich environments to find the pieces of their information puzzle. Not only will you provide a deep understanding of their data, but you'll also advise your client on what the information means and how it can be used to make an impact. How You'll Contribute: * Use your data analytics expertise to support client and stakeholder relationships.<br/><br/><ul><li> Research, develop, and test data methodologies, and generate cross-functional solutions through analysis of large data sets.</li><li> Contribute to impactful work and guide decision-making across multiple organizations.</li><li> Apply consulting skills and data analytics expertise by simplifying te chn ical requirements and trends, based on audience.</li><li> Present data findings and recommendations to clients and stakeholders using your knowledge of databases, scripting languages such as SQL, Python, and R, and Micro sof t Office Suite, including Power BI.</li><li> Establish quantitative and qualitative metrics and key performance indicators to drive te chn ical outcomes.</li><li> Apply data visualization through different formats such as dashboards, graphs, tables, and PowerPoint slides.</li><li> Grow your communication and te chn ical skills by merging consulting and big data to create data-centric solutions. Work with us to drive large-scale business and process decisions through data insights. Join us. The world can't wait. You Have: * 5+ years of experience with data visualization te chn iques and tools, including Tableau or Power BI</li><li> 4+ years of experience working with Python and SQL * Knowledge of building data pipelines and ETL tools</li><li> Knowledge of the DoD acquisitions life cycle and program management, including earned value management, cost-benefit, what-if, project performance, and business project analysis</li><li> Knowledge of statistical analysis te chn iques and how to apply them to large datasets</li><li> Ability to develop and maintain interactive dashboards and visualizations in Power BI to communicate data insights to business stakeholders</li><li> Ability to work independently and collaboratively in a team environment</li><li> Secret clearance * Bachelor's degree Nice If You Have: * Ability to be self-motivated and pay strict attention to detail</li><li> Possession of strong analytical, problem-solving, and critical thi nk ing skills</li><li> Possession of strong written and verbal communication skills, including presenting complex information in a clear and concise manner, and translating data into actionable insights</li><li> Top Secret clearance * Bachelor's degree in Data Analytics or Mathematics Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information ; Secret clearance is required. Create Your Career: Grow With Us<br/><br/></li></ul>Your growth matters to us-that's why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like upskilling programs , tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms. A Place Where You Belong<br/><br/>Diverse perspectives cultivate collective ingenuity. Booz Allen's culture of respect, equity, and opportunity means that, here, you are free to bring your whole self to work. With an array of business resource groups and other opportunities for connection, you'll build your community in no time. Support Your Well-Being<br/><br/>Our comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401 ( k ) match, and more. With these benefits, plus the option for flexible schedules and remote and hybrid locations, we'll support you as you pursue a balanced, fulfilling life-at work and at home. Your Candidate Journey<br/><br/>At Booz Allen, we know our people are what propel us forward, and we value relationships most of all. Here, we've compiled a list of resources so you'll know what to expect as we forge a connection with you during your journey as a candidate with us. Compensation At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen's benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page. Salary at Booz Allen is determined by various factors, including but not limited to location, the individual's particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $75,600.00 to $172,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen's total compensation package for employees. This posting will close within 90 days from the Posting Date. Work Model<br/><br/>Our people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely. * If this position is listed as remote or hybrid, you'll periodically work from a Booz Allen or client site facility.<br/><br/><ul><li> If this position is listed as onsite, you'll work with colleagues and clients in person, as needed for the specific role. EEO Commitment We're an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change - no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.</li></ul>", "responsibilities": "Use your data analytics expertise to support client and stakeholder relationships.<br/><br/><ul><li> Research, develop, and test data methodologies, and generate cross-functional solutions through analysis of large data sets.</li><li> Contribute to impactful work and guide decision-making across multiple organizations.</li><li> Apply consulting skills and data analytics expertise by simplifying te chn ical requirements and trends, based on audience.</li><li> Present data findings and recommendations to clients and stakeholders using your knowledge of databases, scripting languages such as SQL, Python, and R, and Micro sof t Office Suite, including Power BI.</li><li> Establish quantitative and qualitative metrics and key performance indicators to drive te chn ical outcomes.</li><li> Apply data visualization through different formats such as dashboards, graphs, tables, and PowerPoint slides.</li><li> Grow your communication and te chn ical skills by merging consulting and big data to create data-centric solutions. Work with us to drive large-scale business and process decisions through data insights. Join us. The world can't wait.</li></ul>", "qualifications": {"required": "5+ years of experience with data visualization te chn iques and tools, including Tableau or Power BI\n4+ years of experience working with Python and SQL\nKnowledge of building data pipelines and ETL tools\nKnowledge of the DoD acquisitions life cycle and program management, including earned value management, cost-benefit, what-if, project performance, and business project analysis\nKnowledge of statistical analysis te chn iques and how to apply them to large datasets\nAbility to develop and maintain interactive dashboards and visualizations in Power BI to communicate data insights to business stakeholders\nAbility to work independently and collaboratively in a team environment\nSecret clearance\nBachelor's degree", "preferred": "Ability to be self-motivated and pay strict attention to detail\nPossession of strong analytical, problem-solving, and critical thi nk ing skills\nPossession of strong written and verbal communication skills, including presenting complex information in a clear and concise manner, and translating data into actionable insights\nTop Secret clearance\nBachelor's degree in Data Analytics or Mathematics"}, "skills": ["Tableau", "Power BI", "Python", "SQL", "ETL", "DoD", "Data Visualization", "Data Analysis", "Statistical Analysis", "PowerPoint", "Communication", "Problem Solving"], "postedDate": "2 months ago", "salary": {"amount": "75,600.00 to $172,000.00", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3943908884"}