{"jobTitle": "Regional Sales Specialist", "company": {"name": "ABB", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "Take your next career step at ABB with a global team that is energizing the transformation of society and industry to achieve a more productive, sustainable future.<br/><br/>At ABB, we have the clear goal of driving diversity and inclusion across all dimensions: gender, LGBTQ+, abilities, ethnicity and generations. Together, we are embarking on a journey where each and every one of us, individually and collectively, welcomes and celebrates individual differences.<br/><br/>This position reports to<br/><br/>Regional Sales Manager<br/><br/>Your role and responsibilities<br/><br/>In this role, you will have the opportunity to be responsible for the sales of products/systems/services within a designated market/division, in line with the division strategy. Each day, you will achieve both qualitative and quantitative sales targets to ensure sustainable order growth, revenues, profitability, market share, and customer satisfaction. You will also showcase your expertise by identifying and developing new sales opportunities.<br/><br/>The work model for the role is:<br/><br/>This role is contributing to the Motion – System Drives.<br/><br/>You will be mainly accountable for:<br/><br/><ul><li> Deploy sales process to understand account performance, including establishing annual budget by account/monthly order rate/gap to budget/time to quote/hit rate/key opportunities/customer key drivers to decision/key decision makers.</li><li> Own CRM (Customer Relationship Management) utilization, opportunity/pipeline through all steps of the sales process; maintaining accurate updates through close of opportunity.</li><li> Develop and close monthly forecast for assigned territory by building, maintaining and executing on a 30, 90, 180 and 365 opportunity funnel with accounts.</li><li> Year over year sales growth; meeting or exceeding budget.<br/><br/></li></ul>Our team dynamics<br/><br/>You will join a dynamic, talented, and high performing team, where you will be able to thrive.<br/><br/><br/><strong>Qualifications For The Role<br/><br/></strong><ul><li> Bachelor degree and 10 years of relevant experience OR Associate degree and 12 years of relevant experience OR High School/GED and 14 years of relevant experience required</li><li> Maintaining residency within the defined region (unless approved by Executive leadership); travel minimum 40%</li><li> Comprehensive understanding of USA AC and DC Drives market, including related customers and competition</li><li> Goal/result-oriented mind-set with capability to identify new opportunities and translate these into executable action plans</li><li> Highly skilled at developing and growing relationships, from plant level to C-level</li><li> Structured and Process orientated (sales processes, tools, dashboard…)</li><li> Candidates must already have a work authorization that would permit them to work for ABB in the US<br/><br/></li></ul>What's in it for you?<br/><br/><ul><li>Get exposed to cutting-edge technology in Motion and have a visible impact on the future</li><li>Play a part in anticipating, sensing and responding to technology trends</li><li>Work in a company with a strong technology legacy and deeply rooted in local communities<br/><br/></li></ul>More about us<br/><br/>ABB System Drives is a global supplier of high-power, high-performance drives, drive systems and packages for industrial processes and large infrastructure applications. With our industry leading technology and global support, we help our customers, partners and equipment manufacturers with asset reliability, performance improvement and energy efficiency in mission critical applications. Our people and culture are the foundation of our success. We all together make the difference for our customers every day.<br/><br/>We look forward to receiving your application. If you want to discover more about ABB, take another look at our website www.abb.com.<br/><br/>Equal Employment Opportunity and Affirmative Action at ABB<br/><br/>ABB is an Equal Employment Opportunity (EEO) and Affirmative Action Employer encouraging diversity in the workplace.<br/><br/>All qualified applicants will receive consideration for employment without regard to their race, creed, color, ancestry, religion, sex, national origin, citizen status, age, sexual orientation, gender identity, disability, marital status, family medical leave status, or protected veterans status. For more information regarding your (EEO) rights as an applicant, please visit the following websites:<br/><br/>https://www.eeoc.gov/sites/default/files/2022-10/EEOC_KnowYourRights_screen_reader_10_20.pdf<br/><br/>https://www.dol.gov/sites/dolgov/files/OFCCP/pdf/pay-transp_%20English_formattedESQA508c.pdf<br/><br/>As an Equal Employment Opportunity and Affirmative Action Employer, applicants may request to review the Affirmative Action Plan of a particular ABB facility between the hours of 9:00 A.M. - 5:00 P.M. EST Monday through Friday by contacting an ABB HR Representative at 1-888-694-7762.<br/><br/>Protected veterans and qualified individuals with a disability may request a reasonable accommodation if you are unable or limited in your ability to use or access ABB's career site as a result of your disability. You may request reasonable accommodations by calling an ABB HR Representative at 1-888-694-7762 or by sending an email to US-AskHR@abb.com. Resumes and applications will not be accepted in this manner.<br/><br/>While base salary is determined by things such as the successful applicant's qualifications and experience, the position is expected to pay between $92,500 and $171,500 annually and is bonus eligible.<br/><br/>myBenefitsABB.com<br/><br/><br/><strong>91996980<br/><br/></strong>", "responsibilities": "In this role, you will have the opportunity to be responsible for the sales of products/systems/services within a designated market/division, in line with the division strategy. Each day, you will achieve both qualitative and quantitative sales targets to ensure sustainable order growth, revenues, profitability, market share, and customer satisfaction. You will also showcase your expertise by identifying and developing new sales opportunities.<br/><br/>The work model for the role is:<br/><br/>This role is contributing to the Motion – System Drives.<br/><br/>You will be mainly accountable for:<br/><br/><ul><li> Deploy sales process to understand account performance, including establishing annual budget by account/monthly order rate/gap to budget/time to quote/hit rate/key opportunities/customer key drivers to decision/key decision makers.</li><li> Own CRM (Customer Relationship Management) utilization, opportunity/pipeline through all steps of the sales process; maintaining accurate updates through close of opportunity.</li><li> Develop and close monthly forecast for assigned territory by building, maintaining and executing on a 30, 90, 180 and 365 opportunity funnel with accounts.</li><li> Year over year sales growth; meeting or exceeding budget.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor degree and 10 years of relevant experience OR Associate degree and 12 years of relevant experience OR High School/GED and 14 years of relevant experience required\nMaintaining residency within the defined region (unless approved by Executive leadership); travel minimum 40%\nComprehensive understanding of USA AC and DC Drives market, including related customers and competition\nGoal/result-oriented mind-set with capability to identify new opportunities and translate these into executable action plans\nHighly skilled at developing and growing relationships, from plant level to C-level\nStructured and Process orientated (sales processes, tools, dashboard…)\nCandidates must already have a work authorization that would permit them to work for ABB in the US<br/><br/>", "preferred": null}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": null, "benefits": "Get exposed to cutting-edge technology in Motion and have a visible impact on the future\nPlay a part in anticipating, sensing and responding to technology trends\nWork in a company with a strong technology legacy and deeply rooted in local communities<br/><br/>", "remoteWork": null, "salary": {"amount": "$92,500 and $171,500", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3947478060"}