{"jobTitle": "Customer Care Specialist", "company": {"name": "Bvlgari", "location": "Lawrence, NY"}, "location": "Lawrence, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$55,000.00/yr - $65,000.00/yr", "currency": "USD"}, "jobFunction": "Customer Service, Administrative, and Quality Assurance", "industry": "Wholesale Luxury Goods and Jewelry", "description": "<strong>Position Summary:</strong>\n<p>The B2B Customer Care Ambassador is responsible for the day-to-day operations and communication for repair coordination with both internal and external business partners. This role provides and processes information in response to inquiries, concerns and requests about repairs and spare part orders. </p>\n<p><br/></p>\n<p><strong>Responsibilities: </strong></p>\n<ul>\n<li>Act as a liaison between the technicians and partners/store teams for assigned geographical regions.</li>\n<li>Daily registration of repairs, estimate preparation and invoicing using SAP, Excel and extranet, within established lead-times.</li>\n<li>Assess daily priorities with administration supervisor.</li>\n<li>Run daily operational reports to monitor repair activity. Escalate and communicate on delays.</li>\n<li>Support technicians and store teams to optimize the repair process.</li>\n<li>Supervise and document aesthetic checks at reception and before shipping repaired items. Update warranty status.</li>\n<li>Fulfill invoicing according to account terms for both repaired items and spare part orders.</li>\n<li>Receive in, document and ship repairs upon completion.</li>\n<li>Complete ad-hoc tasks as assigned by supervisor.</li>\n</ul>\n<p><br/></p>\n<p><strong>Qualifications: </strong></p>\n<ul>\n<li>Must be organized and detail-oriented, with an ability to handle multiple tasks simultaneously.</li>\n<li>Experience with Excel and SAP is a plus but not required</li>\n<li>Must be bilingual: English and Spanish.Portuguese a plus, but not required.</li>\n<li>Solutions-driven, team attitude</li>\n<li>Excellent communication and interpersonal skills including written, verbal, and listening skills</li>\n<li>Proven ability and desire to provide exceptional customer service</li>\n<li>Ability to present professional image via phone; superb phone etiquette skills</li>\n<li>Excellent research and problem resolution skills</li>\n</ul>\n<p></p>", "responsibilities": "Act as a liaison between the technicians and partners/store teams for assigned geographical regions. Daily registration of repairs, estimate preparation and invoicing using SAP, Excel and extranet, within established lead-times. Assess daily priorities with administration supervisor. Run daily operational reports to monitor repair activity. Escalate and communicate on delays. Support technicians and store teams to optimize the repair process. Supervise and document aesthetic checks at reception and before shipping repaired items. Update warranty status. Fulfill invoicing according to account terms for both repaired items and spare part orders. Receive in, document and ship repairs upon completion. Complete ad-hoc tasks as assigned by supervisor.", "qualifications": {"required": "Must be organized and detail-oriented, with an ability to handle multiple tasks simultaneously. Experience with Excel and SAP is a plus but not required Must be bilingual: English and Spanish.Portuguese a plus, but not required. Solutions-driven, team attitude Excellent communication and interpersonal skills including written, verbal, and listening skills Proven ability and desire to provide exceptional customer service Ability to present professional image via phone; superb phone etiquette skills Excellent research and problem resolution skills"}, "skills": ["SAP", "Excel", "Customer Service", "Communication", "Problem Solving"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3948683761"}