{"jobTitle": "Supply Chain Planning Specialist", "company": {"name": "Green Key Resources", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "<strong>Summary<br/><br/></strong>Green Key's client is a biopharmaceutical company relentlessly committed to creating superior products for immunodeficient patients at risk for infection. It is our devotion to this underserved population that fuels us and our hands-on approach to production and development that sets us apart. If you are looking for a dynamic, innovative, growing company in the biopharmaceutical industry that is committed to excellence and integrity, then consider this role.<br/><br/>The Supply Chain Planning Specialist is responsible for ensuring that the day-to-day supply chain business results are achieved. This role combines analysis and reporting along with hands-on transactional and master data activities to ensure excellence in the overall performance of the operation.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Establish, implement and maintain corporate policies, procedures and communications to ensure manufacturing operations and related warehousing, inventory control and distribution functions are carried out legally, timely, efficiently and professionally; support corporate cGMP.</li><li>Based on the approved production forecast and business plan, develop and coordinate the detailed production and delivery schedules for products manufactured in Boca, including products marketed by the client and products manufactured for the client by third parties and input data into SAP.</li><li>Maintain the Master Production Schedule and Manufacturing Resource Planning in the SAP system to ensure adequate coverage of raw materials to support production and production support departments.</li><li>Propose planning schedule for all levels of production from intermediates to finished goods.</li><li>Maintain material master, bill of materials (BOM), recipes and production versions to support production activities. </li><li>Partner with Manufacturing and Quality to coordinate any changes in the production plan to meet changing production demands.</li><li>Deliver Supply Chain trend analysis and KPI reporting (dashboards, service level agreements, back orders, inventory, volume).</li><li>Prepare for and assist in the running of weekly production meetings and facilitate cross functional meetings to support client goals and objectives.</li><li>Review and revise SOPs as deemed necessary by the business to continually improve internal work processes.</li><li>Work closely with Plasma Operations and Procurement to ensure continuity of supply of plasma and raw materials and to coordinate production schedules changes as it impacts plasma/raw materials supply.</li><li>Reconcile inventory of all bulk, semifinished, and finished products at month-end close and distribute reports to Manufacturing, for products manufactured in Boca.</li><li>Reconcile inventory for third party manufacturers and execute weekly transactions in the system.</li><li>Maintain reports and dashboards for lot status and tracking.</li><li>Participate in change controls and corrective actions for cross functional processes.</li><li>Supports deviation investigations associated with issues/deviations.</li><li>Interfaces with third party vendors and departments.</li><li>Participate in special projects as required.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s degree in supply chain or related field, or at least 3 years of experience in a highly automated inventory system environment, preferably a manufacturing environment</li><li>Entry level up to 3 or more years of progressive experience in related position with in-depth knowledge of inventory management, system-based process enhancement and 3rd party contract services management a plus.</li><li>Proficiency in office software packages, including word processing, spreadsheets, and SAP. Must be able to work independently with strong decision-making skills. Excellent analytical and communication skills are essential.</li></ul>", "responsibilities": "The Supply Chain Planning Specialist is responsible for ensuring that the day-to-day supply chain business results are achieved. This role combines analysis and reporting along with hands-on transactional and master data activities to ensure excellence in the overall performance of the operation.", "qualifications": {"required": "Bachelor’s degree in supply chain or related field, or at least 3 years of experience in a highly automated inventory system environment, preferably a manufacturing environment\nEntry level up to 3 or more years of progressive experience in related position with in-depth knowledge of inventory management, system-based process enhancement and 3rd party contract services management a plus.\nProficiency in office software packages, including word processing, spreadsheets, and SAP. Must be able to work independently with strong decision-making skills. Excellent analytical and communication skills are essential."}, "skills": ["Supply Chain", "Inventory Management", "SAP", "Manufacturing", "Analysis", "Communication"], "postedDate": "2 months ago", "url": "https://www.linkedin.com/jobs/view/3949743843"}