{"jobTitle": "Director, Strategic Partnerships & Alliances (US)", "company": {"name": "PointClickCare", "industry": "Software Development", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$163,000.00/yr - $182,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "For more than 20 years, PointClickCare has been the backbone of senior care. We’ve amassed the richest senior care dataset making our market density untouchable and our connections to the healthcare ecosystem exponentially more powerful than those of any other platform.<br/><br/>With Collective Medical &amp; Audacious Inquiry, we’ve become the most expansive, full-continuum care collaboration network, offering care teams immediate, point-of-care access to deep, real-time insights at every stage of a patient’s journey.<br/><br/>For more information on PointClickCare, please connect with us on Glassdoor and LinkedIn.<br/><br/>Reporting to the VP, Partnerships &amp; Strategic Alliances, the Director, Strategic Partnerships &amp; Alliances is responsible for developing and maintaining the Partner Powered Solutions strategy, managing the entire life cycle of partner relationships (identification, prioritization, negotiation, GTM planning &amp; execution, and ongoing performance management). The role requires an individual who is a strategic thinker with a demonstrated ability to act individually where required but also lead and improve team efficiency and effectiveness through the creation and continued optimization of process and approach. The Director must have a deep understand of our industry, company, the relevant partner ecosystem landscape, and have the ability to lead a team to complete complex financial analysis and business modeling. The Director must have the ability to build and maintain strong relationships with external and internal cross-functional stakeholders.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Formulate and evolve partnership strategy, articulate partnership hypothesis, define and deliver an exceptional exchange of value.</li><li>Lead a partnerships team to identify, select, finalize and operationalize the ensuing commercial agreement for new technology partners that meet the company’s standards for quality, commercial, and technical performance.</li><li>Lead a partnerships team that is responsible for the performance management of existing technology partnerships relative to annual bookings, revenue, GM targets and other KPIs as relevant.</li><li>Collaborate cross-functionally internally and externally with all levels to ensure a seamless integration of partner solutions into PointClickCare’s product and commercial strategies.</li><li>Ensure that the implementation and support of these solutions meets or exceeds customer expectation and ensuring that there is appropriate participation from partners as both negotiated and appropriate.</li><li>Oversee the go-to-market motion and strategy for partner-powered solutions under the company's brand. Collaborate with cross-functional teams to ensure a seamless integration of partner technologies into the company's core platforms.</li><li>Monitor market trends and maintain a deep understanding of the competitive landscape to inform strategic decisions.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree in Business Administration or Commerce and/or Math; MBA is definitely preferred.</li><li>Minimum of 5 years of experience in sourcing, vetting and performance managing technology partnerships, business development, or a related field.</li><li>Strategic thinker with a strong business acumen, analytical and market/partnership opportunity modelling skills who can work independently as well as collaboratively</li><li>Strong negotiation skills and the ability to influence at the executive level.</li><li>Excellent communication and interpersonal skills, with the ability to build and maintain relationships.<br/><br/></li></ul>It is the policy of PointClickCare to ensure equal employment opportunity without discrimination or harassment on the basis of race, religion, national origin, status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, veteran status, genetic information, or any other basis protected by law. PointClickCare welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process. Please contact recruitment@pointclickcare.com should you require any accommodations.<br/><br/>When you apply for a position, your information is processed and stored with Lever, in accordance with Lever’s Privacy Policy. We use this information to evaluate your candidacy for the posted position. We also store this information, and may use it in relation to future positions to which you apply, or which we believe may be relevant to you given your background. When we have no ongoing legitimate business need to process your information, we will either delete or anonymize it. If you have any questions about how PointClickCare uses or processes your information, or if you would like to ask to access, correct, or delete your information, please contact PointClickCare’s human resources team: recruitment@pointclickcare.com<br/><br/>PointClickCare is committed to Information Security. By applying to this position, if hired, you commit to following our information security policies and procedures and making every effort to secure confidential and/or sensitive information.<br/><br/>At PointClickCare, base salary is one of the many components that make up our total rewards package. The US base salary range for this position is $163,000 - $182,000 + bonus or commission + equity + benefits. Our salary ranges are determined by job and level. The range displayed on each job posting reflects the target for new hire salaries for the position across all US locations. Within the range, individual compensation is determined by job-related skills and knowledge, relevant experience including professional and lived experience, and/or work location. Your recruiter can share more information about our total rewards package during the hiring process.<br/><br/>", "responsibilities": "Formulate and evolve partnership strategy, articulate partnership hypothesis, define and deliver an exceptional exchange of value.Lead a partnerships team to identify, select, finalize and operationalize the ensuing commercial agreement for new technology partners that meet the company’s standards for quality, commercial, and technical performance.Lead a partnerships team that is responsible for the performance management of existing technology partnerships relative to annual bookings, revenue, GM targets and other KPIs as relevant.Collaborate cross-functionally internally and externally with all levels to ensure a seamless integration of partner solutions into PointClickCare’s product and commercial strategies.Ensure that the implementation and support of these solutions meets or exceeds customer expectation and ensuring that there is appropriate participation from partners as both negotiated and appropriate.Oversee the go-to-market motion and strategy for partner-powered solutions under the company's brand. Collaborate with cross-functional teams to ensure a seamless integration of partner technologies into the company's core platforms.Monitor market trends and maintain a deep understanding of the competitive landscape to inform strategic decisions.", "qualifications": {"required": "Bachelor's degree in Business Administration or Commerce and/or Math; MBA is definitely preferred.Minimum of 5 years of experience in sourcing, vetting and performance managing technology partnerships, business development, or a related field.Strategic thinker with a strong business acumen, analytical and market/partnership opportunity modelling skills who can work independently as well as collaborativelyStrong negotiation skills and the ability to influence at the executive level.Excellent communication and interpersonal skills, with the ability to build and maintain relationships.", "preferred": ""}, "skills": ["Business Development", "Strategic Partnerships", "Partnership Management", "Business Acumen", "Negotiation"], "postedDate": "2 months ago", "applicationDeadline": "", "benefits": "bonus or commission + equity + benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3951039866"}