{"jobTitle": "Sr. Director of Partners (remote)", "company": {"name": "Experian", "location": "Schaumburg, IL"}, "location": "Schaumburg, IL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Information Technology", "industry": "Financial Services", "description": "Job Posting - Salary Range: See Pay Range<br/><br/><strong>Company Description<br/><br/></strong>Ready to make a difference? Experian has evolved into a global tech company and leader in data and analytics. We’re passionate about unlocking the power of data in order to transform lives and create opportunities for consumers, businesses and society. We’re a constituent of the FTSE 30 and for more than 125 years we’ve helped economies and communities flourish – and we’re not done.<br/><br/>Discover the Unexpected - Our 22k amazing employees in 30+ countries believe the possibilities for you, and the world, are growing. We’re investing in the future, through new technologies, talented people and innovation so we can help create a better tomorrow. To do this we employ ‘big-thinkers’ and ‘can-doers’ that share our purpose #uniquelyexperian<br/><br/><strong>Job Description<br/><br/></strong>Experian Employer Services is seeking a dynamic and strategic leader to join our team as the Senior Director of Partners. This role is pivotal in driving sales and revenue goals through the cultivation of deep, strategic relationships with key partners and the exploration of new partnership avenues. The Senior Director will lead a team of Alliance Directors with a focus on synergizing Experian’s solutions, values, and strategies with our partners’ capabilities to achieve mutual growth.<br/><br/>Our Alliance Team develops partnerships with various organizations such as Payroll providers, Benefit providers, HR consulting organizations and others, who sell into the HR and Payroll space. The Sr. Director of Partners is responsible for developing and deploying specific alliance partner sales strategies for their respective territory. A critical responsibility will be driving revenue growth selling through alliance partners, both independently and with the support of internal sources (i.e., Sales Channel Partners, Product Management and Marketing). Through these activities you will be expected to develop relationships with senior leaders and key stakeholders in target prospect alliance partner clients.<br/><br/>Thought leadership, formal sales presentations, compelling solution design and comprehensive business and technical proposals will be core skill sets you will bring to the role. You will lead the effort to negotiate and close contracts which provide market-differentiating value for our partners and their clients.<br/><br/>The ideal candidate will have an established track record of year-over-year success leading teams through solution selling using business insight and the ability to navigate partner dynamics as well as strong negotiation and communication skills. It is important that the candidate be a self-starter, have superior people skills and be very goal and results driven with the ability to work independently.<br/><br/>The Senior Director of Strategic Alliances is a visionary leader who shapes and steers Experian Employer Services’ (EES) partnership strategy.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Strategic Leadership: Craft and execute a comprehensive partnership strategy that aligns with EES’s long-term business objectives.</li><li>Partnership Development: Proactively identify, develop, and nurture relationships with existing and potential strategic partners to expand EES’s market reach.</li><li>Cross-Functional Collaboration: Serve as the primary liaison between EES and our partners, ensuring seamless integration and cooperation across Sales, Product, Marketing, and other key departments.</li><li>Revenue Growth: Drive the partner opportunity pipeline, ensuring a robust flow of high-quality leads that contribute to EES’s revenue targets.</li><li>Stakeholder Engagement: Forge and strengthen high-level connections with partner stakeholders through strategic engagements and executive-level discussions.</li><li>Team Leadership: Mentor and guide the Partner team, fostering a culture of innovation, collaboration, and excellence.</li><li>Performance Metrics: Establish and monitor key performance indicators to track partnership success and inform strategic adjustments.</li><li>Market Insights: Leverage market analysis and partner feedback to inform product development and go-to-market strategies.<br/><br/></li></ul><strong>Desired Competencies<br/><br/></strong><ul><li>Strategic Thinker: Demonstrates a strong ability to conceptualize and implement effective partnership strategies.</li><li>Influential Leader: Inspire and mobilize internal and external teams towards common goals.</li><li>Relationship Architect: Excels in building and maintaining high-level relationships with a diverse array of stakeholders.</li><li>Innovative Mindset: Brings a creative and forward-thinking approach to partnership development and problem-solving.</li><li>Results-Oriented: Focuses on achieving measurable outcomes that drive business growth and partner satisfaction.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in business, marketing, or related field; MBA preferred.</li><li>Proven experience (10+ years’ experience) in developing and managing successful channel development with sales organizations using scalable technical solutioning.</li><li>Strong negotiation, sales enablement, and relationship-building skills.</li><li>Strategic leadership with enterprise level partners</li><li>Exceptional strategic thinking and analytical abilities.</li><li>Excellent communication and presentation skills.</li><li>Demonstrated ability to drive revenue growth through partner channels.<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>Our uniqueness is that we truly celebrate yours. Experian's culture and people are key differentiators. We take our people agenda very seriously and focus on what truly matters; DEI, work/life balance, development, authenticity, engagement, collaboration, wellness, reward &amp; recognition, volunteering... the list goes on. Experian’s strong people first approach is award winning; Great Place To Work™ in 24 countries, FORTUNE Best Companies to work and Glassdoor Best Places to Work (globally 4.4 Stars) to name a few. Check out Experian Life on social or our Careers Site to understand why.<br/><br/>Experian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is a critical part of Experian's DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, irrespective of their gender, ethnicity, religion, colour, sexuality, physical ability or age. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity.", "postedDate": "2 weeks ago", "skills": ["Sales", "Partnership Development", "Strategic Leadership", "Cross-Functional Collaboration", "Revenue Growth", "Stakeholder Engagement", "Team Leadership", "Performance Metrics", "Market Insights", "Business Development", "Channel Development", "Negotiation", "Relationship Building", "Strategic Thinking", "Analytical Abilities", "Communication", "Presentation Skills"], "url": "https://www.linkedin.com/jobs/view/3952686321"}