{"jobTitle": "Product Manager", "company": {"name": "Granicus", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00 - $110,000.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "<strong>The Company<br/><br/></strong><strong>Serving the People Who Serve the People <br/><br/></strong>Granicus is driven by the excitement of building, implementing, and maintaining technology that is transforming the Govtech industry by bringing governments and its constituents together. We are on a mission to support our customers with meeting the needs of their communities and implementing our technology in ways that are equitable and inclusive. Granicus has consistently appeared on the GovTech 100 list over the past 5 years and has been recognized as the best companies to work on BuiltIn.<br/><br/>Over the last 25 years, we have served 5,500 federal, state, and local government agencies and more than 300 million citizen subscribers power an unmatched Subscriber Network that use our digital solutions to make the world a better place. With comprehensive cloud-based solutions for communications, government website design, meeting and agenda management software, records management, and digital services, Granicus empowers stronger relationships between government and residents across the U.S., U.K., Australia, New Zealand, and Canada. By simplifying interactions with residents, while disseminating critical information, Granicus brings governments closer to the people they serve—driving meaningful change for communities around the globe.<br/><br/>Want to know more? See more of what we do here .<br/><br/>Granicus is looking for a skilled Product Manager with deep interest in software and its ability to impact global democracy, citizen engagement, and increased government transparency. No company in the world reaches more people on behalf of public organizations as Granicus – and this individual will serve as both the internal and external evangelist for the solutions that make that happen. You possess a unique blend of business and technical savvy; a big-picture vision as well as the drive and attention to detail that transforms vision into a reality.<br/><br/>We’re looking for someone who realizes that success as a Product Manager is all about relationships. You will work closely with other Product Managers, Product Owners, Engineers, Designers, Data Analysts, and the Leadership team to define the future of Granicus Products. You are ultimately responsible for aligning the team behind the most important projects at any given time, with an eye toward driving growth in key metrics and constantly improving the user experience. Ideal candidates are extremely entrepreneurial and analytical, able to combine concrete data with solid instincts to move the product forward every day.<br/><br/><ul><li>EST/ CST time zones preferred**<br/><br/></li></ul><strong>What your impact will look like:<br/><br/></strong><ul><li>Manage the long-term product vision and can translate that vision into tangible, actionable plans</li><li>Develop and execute specific product features, from ideation to implementation</li><li>Prioritize product deliverables against competing high-value features, clearly understanding tradeoffs</li><li>Utilize data-driven insights to decide when, what and how to deliver appropriate product scope</li><li>Proven ability to communicate, present, and sell your ideas to senior executives</li><li>Bring a detailed eye for user experience and design to ensure features drive high adoption, amazing quality and customer enthusiasm</li><li>Facilitate ideation within a specific product area through internal brainstorming, user outreach, feedback and usage data analysis, and intimate knowledge of the competitive landscape</li><li>Establish shared vision across the company by building consensus on priorities leading to product execution and launch</li><li>Support a team of world-class engineers, product owners and designers throughout product lifecycle</li><li>Define, analyze, and report on the metrics that determine the success of feature launches or experiments</li><li>Monitor adoption, usage and revenue impact of new services and enhancements and report on release impact as necessary</li><li>Engage with customers through a variety of channels and serve as the voice of the customer internally</li><li>Engage with the internal Implementation Services teams to understand, prioritize and productize specific customer needs. </li><li>Act as a mentor and resource to other Product team members</li><li>Participate in the continuous improvement and scaling of Product Management best practices at Granicus<br/><br/></li></ul><strong>Preferred qualifications:<br/><br/></strong><ul><li>4+ combined years in Product Management</li><li>Fluency in JIRA and/or Aha!</li><li>Experience in marketing automation and/or digital engagement platforms is an added bonus. <br/><br/></li></ul><strong>You will love this job if you have:<br/><br/></strong><ul><li>Demonstrated ability to build quantitative business cases and financial models</li><li>Demonstrated experience with complex, transformational roadmap initiatives</li><li>Experience delivering high-quality technology products/services in a fast-moving environment where priorities and structures shift rapidly</li><li>Success working in an agile environment</li><li>High level of intellectual curiosity drives you to ask great questions and seek supporting data to interpret the most important needs of the product</li><li>Excellent organizational and quantitative analytical skills</li><li>Technical depth that enables you to understand and earn the respect of the engineers you work with</li><li>Ability to break the long-term vision down into specific, manageable deliverables that deliver user value as quickly as possible</li><li>Ability to think strategically with the capacity to expand customer use cases into platform-wide requirements</li><li>Demonstrated success in working with cross-functional teams</li><li>Excellent communication skills regardless of the audience — software engineers, product designers, business stakeholders, users, etc. <br/><br/></li></ul>$90,000 - $110,000 a year<br/><br/><ul><li>bonus and benefits<br/><br/></li></ul><strong>Security And Privacy Requirements<br/><br/></strong><ul><li> Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company's information security program. </li><li> Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies. <br/><br/></li></ul>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!<br/><br/><strong> The Team <br/><br/></strong><ul><li> We are a remote-first company with a globally distributed workforce across the United States, Canada, United Kingdom, India, Armenia, Australia, and New Zealand. <br/><br/></li></ul><strong> The Culture <br/><br/></strong><ul><li> At Granicus, we are building a transparent, inclusive, and safe space for everyone who wants to be<br/><br/></li></ul>a part of our journey.<br/><br/><ul><li> A few culture highlights include – Employee Resource Groups to encourage diverse voices</li><li> Coffee with Mark sessions – Our employees get to interact with our CEO on very important and<br/><br/></li></ul>sometimes difficult issues ranging from mental health to work-life balance and current affairs.<br/><br/><ul><li> Microsoft Teams communities focused on wellness, art, furbabies, family, parenting, and more.-=- - We bring in special guests from time to time to discuss issues that impact our employee<br/><br/></li></ul>population<br/><br/><strong> The Impact <br/><br/></strong><ul><li> We are proud to serve dynamic organizations around the globe that use our digital solutions to make the world a better place — quite literally. We have so many powerful success stories that illustrate how our solutions are impacting the world. See more of our impact here . <br/><br/></li></ul><strong>The Benefits<br/><br/></strong>At Granicus, we offer a competitive benefits package that allows employees to tailor benefits to their needs. Benefits listed below are for employees based in the U.S.<br/><br/><ul><li> Flexible Time Off</li><li> Medical (includes an option that is paid 100% by Granicus!), Dental &amp; Vision Insurance</li><li> 401(k) plan with matching contribution</li><li> Paid Parental Leave</li><li> Employer-paid Short and Long Term Disability Insurance, Group Term Life Insurance and AD&amp;D Insurance</li><li> Group legal coverage</li><li> And more!<br/><br/></li></ul><em>Granicus is committed to providing equal employment opportunities. All qualified applicants and employees will be considered for employment and advancement without regard to race, color, religion, creed, national origin, ancestry, sex, gender, gender identity, gender expression, physical or mental disability, age, genetic information, sexual or affectional orientation, marital status, status with regard to public assistance, familial status, military or veteran status or any other status protected by applicable law.</em>", "responsibilities": "<ul><li>Manage the long-term product vision and can translate that vision into tangible, actionable plans</li><li>Develop and execute specific product features, from ideation to implementation</li><li>Prioritize product deliverables against competing high-value features, clearly understanding tradeoffs</li><li>Utilize data-driven insights to decide when, what and how to deliver appropriate product scope</li><li>Proven ability to communicate, present, and sell your ideas to senior executives</li><li>Bring a detailed eye for user experience and design to ensure features drive high adoption, amazing quality and customer enthusiasm</li><li>Facilitate ideation within a specific product area through internal brainstorming, user outreach, feedback and usage data analysis, and intimate knowledge of the competitive landscape</li><li>Establish shared vision across the company by building consensus on priorities leading to product execution and launch</li><li>Support a team of world-class engineers, product owners and designers throughout product lifecycle</li><li>Define, analyze, and report on the metrics that determine the success of feature launches or experiments</li><li>Monitor adoption, usage and revenue impact of new services and enhancements and report on release impact as necessary</li><li>Engage with customers through a variety of channels and serve as the voice of the customer internally</li><li>Engage with the internal Implementation Services teams to understand, prioritize and productize specific customer needs. </li><li>Act as a mentor and resource to other Product team members</li><li>Participate in the continuous improvement and scaling of Product Management best practices at Granicus<br/><br/></li></ul>", "qualifications": {"preferred": "4+ combined years in Product Management, Fluency in JIRA and/or Aha!, Experience in marketing automation and/or digital engagement platforms is an added bonus.", "required": "<ul><li>Demonstrated ability to build quantitative business cases and financial models</li><li>Demonstrated experience with complex, transformational roadmap initiatives</li><li>Experience delivering high-quality technology products/services in a fast-moving environment where priorities and structures shift rapidly</li><li>Success working in an agile environment</li><li>High level of intellectual curiosity drives you to ask great questions and seek supporting data to interpret the most important needs of the product</li><li>Excellent organizational and quantitative analytical skills</li><li>Technical depth that enables you to understand and earn the respect of the engineers you work with</li><li>Ability to break the long-term vision down into specific, manageable deliverables that deliver user value as quickly as possible</li><li>Ability to think strategically with the capacity to expand customer use cases into platform-wide requirements</li><li>Demonstrated success in working with cross-functional teams</li><li>Excellent communication skills regardless of the audience — software engineers, product designers, business stakeholders, users, etc. <br/><br/></li></ul>"}, "skills": ["JIRA", "Aha!", "marketing automation", "digital engagement platforms", "quantitative business cases", "financial models", "agile", "data analysis", "technical depth", "cross-functional teams", "communication"], "postedDate": "2 weeks ago", "benefits": "Flexible Time Off, Medical (includes an option that is paid 100% by Granicus!), Dental &amp; Vision Insurance, 401(k) plan with matching contribution, Paid Parental Leave, Employer-paid Short and Long Term Disability Insurance, Group Term Life Insurance and AD&amp;D Insurance, Group legal coverage, And more!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3953826410"}