{"jobTitle": "English / Spanish Language Interpreter - Remote", "company": {"name": "Kelly", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Kelly® Professional &amp; Industrial has open opportunities for remote Language Interpreters <br/><br/>We are currently looking for skilled Spanish Bilingual Interpreters that are available to work from home and interpret high volume inbound calls.<br/><br/>Details Of The Position<br/><br/>\n<ul><li>Work from Home (Must reside in the United States) </li><li>$15 an hour – Long term contract </li><li>3 Weeks of Paid Training </li><li>Helping others in your community connect in meaningful work </li><li>Perks and options for benefits </li><li>Video Interpreting will occur as well <br/><br/></li></ul>A Typical Day In This Position Might Look Like<br/><br/>\n<ul><li>Handling telephone calls on demand in a quiet home office </li><li>Help translate Spanish/English conversations for a wide range of industries including Healthcare, Government, Insurance Financial, Travel &amp; Hospitality and government entities </li><li>Translating Spanish/English conversations that may be simple, complex, or technical <br/><br/></li></ul>Ideal Candidates Will Be<br/><br/>\n<ul><li>Fluent in both Spanish and English </li><li>Able to work a minimum of 30 hours a week </li><li>Monday shifts are required </li><li>Manual dexterity to type or write notes </li><li>Previous experience not required </li><li>Education or work experience in teaching or translation considered an asset </li><li>Comfortable being on camera as Interpreting in video calls will be a mandatory occurrence in this position <br/><br/></li></ul>Remote Technical Requirements<br/><br/>\n<ul><li>The use of your personal iPhone or Android phone </li><li>High speed Internet connection for work related electronic communication. </li><li>Dry Erase Marker Board </li><li>A dedicated workspace </li><li> What happens next: Once you apply, your application will proceed to next steps with an interview if your skills and experience look like a good fit. Please note only eligible applications will be contacted. At Kelly, helping you discover what’s next in your career is what we strive for. If you feel this position may be a good fit and your skillsets are a suitable match for this position, please apply now. Let’s start the next step in your career today! <br/><br/></li></ul>As part of our promise to talent, Kelly supports those who work with us through a variety of benefits, perks, and work-related resources. Kelly offers eligible employees voluntary benefit plans including medical, dental, vision, telemedicine, term life, whole life, accident insurance, critical illness, a legal plan, and short-term disability. As a Kelly employee, you will have access to a retirement savings plan, service bonus and holiday pay plans (earn up to eight paid holidays per benefit year), and a transit spending account. In addition, employees are entitled to earn paid sick leave under the applicable state or local plan. Click here for more information on benefits and perks that may be available to you as a member of the Kelly Talent Community.<br/><br/>Why Kelly®?<br/><br/>As a worker today, it’s up to you to take charge of your career and look for opportunities to learn, grow, and achieve your potential. Helping you find what’s next is what we’re all about. We know what’s going on in the evolving world of work—just ask the 440,000 people we employ each year. Connecting with us means getting the support, guidance, and opportunities needed to take your career where you may have never imagined.<br/><br/>About Kelly<br/><br/>Work changes everything. And at Kelly, we’re obsessed with where it can take you. To us, it’s about more than simply accepting your next job opportunity. It’s the fuel that powers every next step of your life. It’s the ripple effect that changes and improves everything for your family, your community, and the world. Which is why, here at Kelly, we are dedicated to providing you with limitless opportunities to enrich your life—just ask the 300,000 people we employ each year.<br/><br/>Kelly Services is proud to be an Equal Employment Opportunity and Affirmative Action employer. We welcome, value, and embrace diversity at all levels and are committed to building a team that is inclusive of a variety of backgrounds, communities, perspectives, and abilities. At Kelly, we believe that the more inclusive we are, the better services we can provide. Requests for accommodation related to our application process can be directed to Kelly’s Human Resource Knowledge Center. Kelly complies with the requirements of California’s state and local Fair Chance laws. A conviction does not automatically bar individuals from employment. Kelly participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.<br/><br/>", "postedDate": "2 months ago", "remoteWork": "Yes", "skills": ["Spanish", "English", "Translation", "Interpreting", "Video Conferencing", "Customer Service", "Communication", "Telephone Skills", "Microsoft Office", "Time Management", "Organization", "Problem Solving", "Teamwork", "Adaptability", "Flexibility", "Detail Oriented", "Multitasking", "Prioritization", "Work From Home", "Remote Work", "Bilingual", "Multilingual"], "url": "https://www.linkedin.com/jobs/view/3954400714"}