{"jobTitle": "Sr. Technical Account Manager", "company": {"name": "Mattermost", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$113,378 - $184,239 a year", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Mattermost provides secure, workflow-centric collaboration for technical and operational teams that need to meet nation-state-level security and trust requirements. We serve technology, public sector, national defense, and financial services industries with customers ranging from tech giants to the world’s largest banks, to the U.S. Department of Defense and governmental agencies around the world.<br/><br/>Our self-hosted and cloud offerings provide integrated workflow automation, AI-acceleration, ChatOps with team messaging, audio calling and screen share on an open core platform vetted and deployed by the world’s most secure and mission critical organizations.<br/><br/>We co-build the future of collaboration with over 4,000 open source project contributors who’ve provided over 30,000 code improvements towards our shared product vision, which is translated into 20 languages.<br/><br/>To learn more, visit www.mattermost.com<br/><br/>In this role, you will serve as the primary technical lead to guide key customers through implementation, integration, and expansion of their use of Mattermost as the central communication platform for their DevOps and technical teams. A key part of your job will be to identify and architect the key points of integration for the Mattermost platform within the customer's environment and work with the customer to implement these integrations utilizing customer, or partner-led development expertise. Delivering our predefined Onboarding Journey process, and helping to evolve this process through continuous improvement will be key.<br/><br/>This is a highly technical role for people who also enjoy interacting with and enabling customers to unblock the power of Mattermost’s product. You have a growth mindset and you constantly seek to understand blindspots and challenges - whether it’s a customer’s unique need or interacting with new technologies. You feel comfortable tackling issues, enjoy digging into technical details with customers, and are energized by solving challenges across a diverse range of technologies from databases to Docker, and cross-platform mobile development to RESTful web services. This role is U.S. based.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Lead the delivery of a purposeful Onboarding Journey process from initial internal sales hand-off, through technical discovery, system configuration, testing, and end-user roll-out.</li><li>Make architectural recommendations for the Mattermost software deployment and other adjacent technologies (e.g. MySQL/PostgreSQL, mobile, SSO, ElasticSearch, to ensure high availability, redundancy and scalability).</li><li>Deliver best practices and consulting based on experiences with other successful Mattermost customer deployments.</li><li>Work with our Product Management, Engineering and Support teams to resolve issues that occur during the Onboarding Journey.</li><li>Capture detailed documentation of customer design and deployment decisions, and onboarding challenges, for sharing with the broader customer and Mattermost teams.</li><li>Identify key integration opportunities to develop Mattermost as the central collaboration platform within DevOps and technical teams.</li><li>Present detailed technical information and benefits of the Mattermost platform to a wide array of customers, including: line of business managers, developers, technical architects, and executives.</li><li>Serve as the technical lead for all things related to the Mattermost deployment.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>5+ years Technical Account Management, Customer Support, hands-on Sales Engineering or equivalent experience - developers interested in working directly with customers are highly encouraged to apply.</li><li>Proficiency in understanding concepts and technologies in DevOps, IT operations, security, cloud, microservices, and container platforms.</li><li>Expertise in open source and SaaS is a major advantage.</li><li>Interest in working creatively with customers to understand technical and business requirements and implement solutions, including change management and technical engagement delivery.</li><li>Outstanding written and verbal communications skills, with the ability to go deep with technical customer resources or to describe the value proposition of Mattermost to IT executives.</li><li>Excellent presentation skills for presenting advanced technical concepts.</li><li>Experience leading and crafting technical projects, engaging with, and motivating change across multiple levels of IT executives and organizations.</li><li>Ability to travel up to 30% (Post-COVID).<br/><br/></li></ul>$113,378 - $184,239 a year<br/><br/>The pay range for this position at commencement of employment is expected to be between $113,378 and $184,239/year; however, pay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. Please refer to the Mattermost employee handbook and our careers page for more information on our total compensation package. <strong>Colorado Only: </strong> The total compensation package for this position may also include other elements, including a sign-on bonus, stock options, and discretionary awards in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as vacation, sick time, and parental leave), dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment. <strong>Washington Only:</strong> The total compensation package for this position also includes other elements, including stock options, annual target variable, and participation in the Company’s annual bonus program. Employees and eligible dependents are covered by medical, dental, vision, and basic life insurance. Employees are also eligible to enroll in a 401(k) plan. Employees are eligible for unlimited vacation.<br/><br/>If hired, employee will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) or benefits at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.<br/><br/>Mattermost is an EEO Employer. We are a remote-first, open source company.<br/><br/>We are constantly working towards adding more countries/regions to this list, but first we need to make sure we are compliant with local laws and regulations, which takes time.<br/><br/>Mattermost is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people from all walks of life. We don't discriminate against staff or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!", "responsibilities": "Lead the delivery of a purposeful Onboarding Journey process from initial internal sales hand-off, through technical discovery, system configuration, testing, and end-user roll-out.\nMake architectural recommendations for the Mattermost software deployment and other adjacent technologies (e.g. MySQL/PostgreSQL, mobile, SSO, ElasticSearch, to ensure high availability, redundancy and scalability).\nDeliver best practices and consulting based on experiences with other successful Mattermost customer deployments.\nWork with our Product Management, Engineering and Support teams to resolve issues that occur during the Onboarding Journey.\nCapture detailed documentation of customer design and deployment decisions, and onboarding challenges, for sharing with the broader customer and Mattermost teams.\nIdentify key integration opportunities to develop Mattermost as the central collaboration platform within DevOps and technical teams.\nPresent detailed technical information and benefits of the Mattermost platform to a wide array of customers, including: line of business managers, developers, technical architects, and executives.\nServe as the technical lead for all things related to the Mattermost deployment.", "qualifications": {"required": "5+ years Technical Account Management, Customer Support, hands-on Sales Engineering or equivalent experience - developers interested in working directly with customers are highly encouraged to apply.\nProficiency in understanding concepts and technologies in DevOps, IT operations, security, cloud, microservices, and container platforms.\nExpertise in open source and SaaS is a major advantage.\nInterest in working creatively with customers to understand technical and business requirements and implement solutions, including change management and technical engagement delivery.\nOutstanding written and verbal communications skills, with the ability to go deep with technical customer resources or to describe the value proposition of Mattermost to IT executives.\nExcellent presentation skills for presenting advanced technical concepts.\nExperience leading and crafting technical projects, engaging with, and motivating change across multiple levels of IT executives and organizations.\nAbility to travel up to 30% (Post-COVID).", "preferred": null}, "skills": ["DevOps", "IT operations", "security", "cloud", "microservices", "container platforms", "open source", "SaaS", "change management", "technical engagement delivery", "written and verbal communications", "presentation skills"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "The pay range for this position at commencement of employment is expected to be between $113,378 and $184,239/year; however, pay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. Please refer to the Mattermost employee handbook and our careers page for more information on our total compensation package. <strong>Colorado Only: </strong> The total compensation package for this position may also include other elements, including a sign-on bonus, stock options, and discretionary awards in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as vacation, sick time, and parental leave), dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment. <strong>Washington Only:</strong> The total compensation package for this position also includes other elements, including stock options, annual target variable, and participation in the Company’s annual bonus program. Employees and eligible dependents are covered by medical, dental, vision, and basic life insurance. Employees are also eligible to enroll in a 401(k) plan. Employees are eligible for unlimited vacation.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3957891721"}