{"jobTitle": "Cloud Application Engineer", "company": {"name": "Accenture Federal Services", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting", "description": "At Accenture Federal Services, nothing matters more than helping the US federal government make the nation stronger and safer and life better for people. Our 13,000+ people are united in a shared purpose to pursue the limitless potential of technology and ingenuity for clients across defense, national security, public safety, civilian, and military health organizations.<br/><br/>Join Accenture Federal Services to do the work you love in an inclusive, collaborative, and caring community, where you can be empowered to grow, learn and thrive through hands-on experience, certifications, industry training and more.<br/><br/>Join us to drive positive, lasting change that moves missions and the government forward!<br/><br/>Accenture Federal Services is seeking an experienced a Cloud Application Engineer or Splunk Engineer with technical expertise, customer engagement skills, and a commitment to a vital national security mission. You will be responsible for reviewing and integrating all application requirements, including functional, security, integration, performance, quality and operations requirements. Excellent customer engagement skills and the ability to provide technical recommendations is crucial for this role.<br/><br/><strong>Responsibilities include: <br/><br/></strong><ul><li>Develop and implement automation and efficiencies with Splunk and create workflows</li><li>Oversee application architecture and deployment in cloud platform environments</li><li>Manage application availability, performance, and pro-actively find performance bottlenecks</li><li>Enable integration of Splunk Core and Splunk ES and development of the single pane of glass dashboard</li><li>Perform monitoring and security incident triage through the review of SIEM events, network traffic data collection, endpoint activity logs</li><li>Develop and Implement Apps &amp; Knowledge Objects (KO) like dashboard, reports, and data models as well as actionable alerts and workflow for Splunk as a cybersecurity monitoring tool</li><li>Implement best in class engineering strategies to support a distributed clustered Splunk environment consisting of Search Heads, Indexers, Forwarders, Splunk Enterprise Security (ES) app spanning security, performance, engineering, and operational roles</li><li>ACAS/Nessus scanning with SIEM/Splunk to configure and operate SIEM, create dashboards and reports Incident handling procedures</li><li>Work closely with other teams and business stakeholders to gather requirements, perform troubleshooting, provide assistance with the creation of Splunk search queries and dashboards design automated solutions for performance, privacy, and compliance *</li><li>Be the engineering voice in helping recognize and onboard new data sources into Splunk, analyze the data for anomalies and trends, and building dashboards highlighting the key trends of the data<br/><br/></li></ul><strong>Here is what you need: <br/><br/></strong><ul><li>2+ years working with Splunk</li><li>2+ years of using information security and assurance practices and principles</li><li>3+ years of experience with Special Access Programs</li><li>3+ years of Enterprise system engineering and administration</li><li>Relevant Associates or Bachelor’s Degree or, supporting certifications and relevant job or military experience of 4 years in lieu of degree</li><li>DoD 8570 IAT Level II certification or higher (Sec+, CISSP, CASP, etc.) or DoD 8140 equivalent<br/><br/></li></ul><strong>Bonus points if you have:<br/><br/></strong><ul><li>Splunk Enterprise Certified Architect, Splunk Enterprise Security Certified Admin, Splunk Core Certified Consultant *</li><li>Experience working in a cloud environment, preferably AWS GovCloud</li><li>Experience working in a DevSecOps project environment</li><li>Ability to work cross-functionally with application teams to modernize applications where appropriate and support cloud integration efforts with Splunk</li><li>Strong verbal and written communication skills</li><li>Able to engage with users in a professional manner and present technical concepts plainly to semi-technical customers</li><li>Ability to interface with seasoned Government personnel</li><li>Ability to work in a matrixed team environment and support multiple different efforts as needed</li><li>Desire to learn new technologies and tools and willing to share your experience with the team</li><li>JSIG or ICD 503 compliance knowledge<br/><br/></li></ul><strong>Security Clearance: <br/><br/></strong><ul><li>Active TS with SCI eligibility. Must be willing to undergo a polygraph examination. <br/><br/></li></ul>As required by local law, Accenture Federal Services provides reasonable ranges of compensation for hired roles based on labor costs in the states of <strong>California, Colorado, Hawaii, New York, Washington, and the District of Columbia</strong>. The base pay range for this position in these locations is shown below. Compensation for roles at Accenture Federal Services varies depending on a wide array of factors, including but not limited to office location, role, skill set and level of experience. Accenture Federal Services offers a wide variety of benefits. You can find more information on benefits here. We accept applications on an on-going basis and there is no fixed deadline to apply.<br/><br/>The pay range for the states of California, Colorado, Hawaii, New York, Washington, and the District of Columbia is:<br/><br/>$97,300—$196,500 USD<br/><br/><strong>What We Believe<br/><br/></strong><em>We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture Federal Services has the responsibility to create and sustain an inclusive environment.<br/><br/></em><em>Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. </em><em>Read more here<br/><br/></em><strong><em>Equal Employment Opportunity Statement<br/><br/></em></strong><em>Accenture Federal Services is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.<br/><br/></em><em>All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.<br/><br/></em><em>Accenture is committed to providing veteran employment opportunities to our service men and women.<br/><br/></em><em>For details, view a copy of the </em><em>Accenture Equal Opportunity and Affirmative Action Policy Statement</em><em>.<br/><br/></em><strong><em>Requesting An Accommodation<br/><br/></em></strong><em>Accenture Federal Services is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture Federal Services and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.<br/><br/></em><em>If you<strong> </strong>are being considered for employment opportunities with Accenture Federal Services and need an accommodation for a disability or religious observance during the interview process or for the job you are interviewing for, please speak with your recruiter.<br/><br/></em><strong>Other Employment Statements<br/><br/></strong><em>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.<br/><br/></em><em>Candidates who are currently employed by a client of Accenture Federal Services or an affiliated Accenture business may not be eligible for consideration.<br/><br/></em><em>Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.<br/><br/></em><em>The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.<br/><br/></em>", "responsibilities": "Develop and implement automation and efficiencies with Splunk and create workflows\nOversee application architecture and deployment in cloud platform environments\nManage application availability, performance, and pro-actively find performance bottlenecks\nEnable integration of Splunk Core and Splunk ES and development of the single pane of glass dashboard\nPerform monitoring and security incident triage through the review of SIEM events, network traffic data collection, endpoint activity logs\nDevelop and Implement Apps & Knowledge Objects (KO) like dashboard, reports, and data models as well as actionable alerts and workflow for Splunk as a cybersecurity monitoring tool\nImplement best in class engineering strategies to support a distributed clustered Splunk environment consisting of Search Heads, Indexers, Forwarders, Splunk Enterprise Security (ES) app spanning security, performance, engineering, and operational roles\nACAS/Nessus scanning with SIEM/Splunk to configure and operate SIEM, create dashboards and reports Incident handling procedures\nWork closely with other teams and business stakeholders to gather requirements, perform troubleshooting, provide assistance with the creation of Splunk search queries and dashboards design automated solutions for performance, privacy, and compliance *\nBe the engineering voice in helping recognize and onboard new data sources into Splunk, analyze the data for anomalies and trends, and building dashboards highlighting the key trends of the data", "qualifications": {"required": "2+ years working with Splunk\n2+ years of using information security and assurance practices and principles\n3+ years of experience with Special Access Programs\n3+ years of Enterprise system engineering and administration\nRelevant Associates or Bachelor’s Degree or, supporting certifications and relevant job or military experience of 4 years in lieu of degree\nDoD 8570 IAT Level II certification or higher (Sec+, CISSP, CASP, etc.) or DoD 8140 equivalent", "preferred": "Splunk Enterprise Certified Architect, Splunk Enterprise Security Certified Admin, Splunk Core Certified Consultant *\nExperience working in a cloud environment, preferably AWS GovCloud\nExperience working in a DevSecOps project environment\nAbility to work cross-functionally with application teams to modernize applications where appropriate and support cloud integration efforts with Splunk\nStrong verbal and written communication skills\nAble to engage with users in a professional manner and present technical concepts plainly to semi-technical customers\nAbility to interface with seasoned Government personnel\nAbility to work in a matrixed team environment and support multiple different efforts as needed\nDesire to learn new technologies and tools and willing to share your experience with the team\nJSIG or ICD 503 compliance knowledge"}, "skills": ["Splunk", "SIEM", "Cloud", "AWS GovCloud", "DevSecOps", "Security Clearance", "TS/SCI"], "postedDate": "1 day ago", "salary": {"amount": "97,300—$196,500", "currency": "USD"}, "benefits": "Accenture Federal Services offers a wide variety of benefits. You can find more information on benefits here.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3957739838"}