{"jobTitle": "Customer Experience Specialist", "company": {"name": "MaestroQA", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000-70,000 USD", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "Location: USA or Canada<br/><br/>About Us<br/><br/>We like to work on problems that are important but unpopular. Surprisingly, management is broken at most companies. At the intersection of HR tools and Business Intelligence is a gaping unaddressed problem. We have been fooling ourselves into thinking the solution is simply to make people more efficient. In reality, the focus should be on up-leveling peoples' skills, judgment, and intuition.<br/><br/>There will be a software category called Performance Excellence and MaestroQA is at the helm of helping companies build performance excellence cultures.<br/><br/>What is Performance Excellence? <br/><br/>Performance Excellence is enabling team leads with the tools and guidance to go from average managers to phenomenal coaches. It's about providing individual contributors access to their metrics to better own their performance, career trajectory, and skill development. We work with hundreds of customer support/contact center teams including those at Doordash, Etsy, Peloton, and much more!<br/><br/>Why Maestro?<br/><br/>In addition to wanting to be part of a team evangelizing Performance Excellence -<br/><br/>These statements resonate with you:<br/><br/><ul><li>Other companies have been overlooking your potential and this is the place that sees something different in your abilities</li><li>You want to be coached and trained more than ever before</li><li>You want your peers and managers to work closely with you and challenge your ideas to both self-improve and deliver a better experience for customers<br/><br/></li></ul>Why this Opportunity<br/><br/><ul><li>We sell the importance of great CX - so we value it internally as a key way to fulfill our brand promise</li><li>We are constantly innovating on how CX can become more and more strategic<br/><br/></li></ul>Key Requirements:<br/><br/><ul><li>Are passionate about helping people and have experience in a support or client-facing role</li><li>Have a genuine interest in technology and experience troubleshooting issues</li><li>Strong written English <br/><br/></li></ul>Compensation: $60,000-70,000 USD", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3957696907"}