{"jobTitle": "Intelligence Support Engineer – Mid", "company": {"name": "Nisga'a Tek, LLC", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "Global in service but local in approach, Nisga'a Tek is committed to high-quality service to those who defend us. Nisga'a Tek ensures mission assurance and execution for customers and warfighters. Providing intelligence, IT, cyber security, training, logistics, administrative, acquisition, and background investigation services.<br/><br/><strong>Summary:<br/><br/></strong>Goldbelt Nisga’a NTEK, LLC is looking for a Mid-Level Intelligence Support Engineer to support the Global System Support Engineers (GSSE) under the United States Special Operations Command (USSOCOM) , Program Executive Office for Special Operations Forces Digital Applications (PEO SDA) . The objective of this effort is to provide software-agnostic field support for forward-deployed users of operational, advanced analytic intelligence support, as well as to provide technical and analytical mission planning and execution systems support .<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Essential Job Functions:<br/><br/></strong><ul><li> Provide expert support and analysis for SOCOM and Joint Staff intelligence operations, utilizing in-depth knowledge of intelligence analysis principles and cycles. </li><li> Apply expertise in HUMINT, SIGINT, GEOINT, and OSINT to support comprehensive intelligence analysis and operations. </li><li> Develop and deliver tailored training courses on SOF programs of record, commercial, and government-sponsored mission-relevant technologies. </li><li> Offer subject matter expert (SME) insight to end users on effectively utilizing technologies to build comprehensive intelligence pictures. </li><li> Collaborate with cross-functional teams to enhance intelligence support capabilities and develop innovative solutions. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Necessary Skills and Knowledge:<br/><br/></strong><ul><li> I n-depth knowledge on SOCOM and Joint Staff intelligence analysis principles and intelligence cycles to include a working knowledge of the major intelligence disciplines: Human Intelligence (HUMINT), Signals Intelligence (SIGINT), Geospatial Intelligence (GEOINT), and Open Source Intelligence (OSINT). </li><li> M ust be able to create and conduct tailored courses on SOF programs of record, in addition to commercial or government sponsored, mission relevant technologies to provide subject matter expert insight to end users on how to use those technologies to build a comprehensive intelligence picture. </li><li> In addition to current technologies, the contractor must be able to adapt to future technologies ensuring the seamless integration into their hosting unit’s intelligence production schedules. </li><li> Excellent analytical and problem-solving skills. </li><li> Strong communication and interpersonal skills. </li><li> Ability to work independently and as part of a team. <br/><br/></li></ul><strong>Minimum Qualifications:<br/><br/></strong><ul><li> Minimum 4 years with communicating intelligence and operations details to senior leaders. </li><li> Minimum of 4 years analyzing HUMINT, SIGINT, IMINT, OSINT, or a combination of two or more intelligence disciplines. </li><li> Minimum of 3 years’ experience in the following applications: Microsoft Office (Word, PowerPoint, Excel, and Access); Analyst Notebook; M3 - Multimedia Messenger (Or other reports-based research tools such as Catapult, Palantir, or FADE), HOT-R (Or CHROME - Counterintelligence and Human Intelligence Requirements, Reporting, and Operations Management Environment) </li><li> Must be a US citizen. </li><li> An ACTIVE Top Secret Clearance with SCI Eligibility is required . <br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li> Relevant certifications are a plus. <br/><br/></li></ul><strong>Pay And Benefits<br/><br/></strong>At Goldbelt, we value and reward our team's dedication and hard work. We provide a competitive base salary commensurate with your qualifications and experience. As an employee, you'll enjoy a comprehensive benefits package, including medical, dental, and vision insurance, a 401(k) plan with company matching, tax-deferred savings options, supplementary benefits, paid time off, and professional development opportunities.", "responsibilities": "Essential Job Functions:<br/><br/>\n<ul><li> Provide expert support and analysis for SOCOM and Joint Staff intelligence operations, utilizing in-depth knowledge of intelligence analysis principles and cycles. </li><li> Apply expertise in HUMINT, SIGINT, GEOINT, and OSINT to support comprehensive intelligence analysis and operations. </li><li> Develop and deliver tailored training courses on SOF programs of record, commercial, and government-sponsored mission-relevant technologies. </li><li> Offer subject matter expert (SME) insight to end users on effectively utilizing technologies to build comprehensive intelligence pictures. </li><li> Collaborate with cross-functional teams to enhance intelligence support capabilities and develop innovative solutions. <br/><br/></li></ul>", "qualifications": {"required": "In-depth knowledge on SOCOM and Joint Staff intelligence analysis principles and intelligence cycles to include a working knowledge of the major intelligence disciplines: Human Intelligence (HUMINT), Signals Intelligence (SIGINT), Geospatial Intelligence (GEOINT), and Open Source Intelligence (OSINT).\n\nMust be able to create and conduct tailored courses on SOF programs of record, in addition to commercial or government sponsored, mission relevant technologies to provide subject matter expert insight to end users on how to use those technologies to build a comprehensive intelligence picture.\n\nIn addition to current technologies, the contractor must be able to adapt to future technologies ensuring the seamless integration into their hosting unit’s intelligence production schedules.\n\nExcellent analytical and problem-solving skills.\n\nStrong communication and interpersonal skills.\n\nAbility to work independently and as part of a team. <br/><br/>\nMinimum 4 years with communicating intelligence and operations details to senior leaders.\n\nMinimum of 4 years analyzing HUMINT, SIGINT, IMINT, OSINT, or a combination of two or more intelligence disciplines.\n\nMinimum of 3 years’ experience in the following applications: Microsoft Office (Word, PowerPoint, Excel, and Access); Analyst Notebook; M3 - Multimedia Messenger (Or other reports-based research tools such as Catapult, Palantir, or FADE), HOT-R (Or CHROME - Counterintelligence and Human Intelligence Requirements, Reporting, and Operations Management Environment)\n\nMust be a US citizen.\n\nAn ACTIVE Top Secret Clearance with SCI Eligibility is required . <br/><br/>", "preferred": "Relevant certifications are a plus. <br/><br/>"}, "skills": ["HUMINT", "SIGINT", "GEOINT", "OSINT", "Microsoft Office", "Analyst Notebook", "M3 - Multimedia Messenger", "HOT-R", "CHROME"], "postedDate": "1 week ago", "benefits": "At Goldbelt, we value and reward our team's dedication and hard work. We provide a competitive base salary commensurate with your qualifications and experience. As an employee, you'll enjoy a comprehensive benefits package, including medical, dental, and vision insurance, a 401(k) plan with company matching, tax-deferred savings options, supplementary benefits, paid time off, and professional development opportunities.", "url": "https://www.linkedin.com/jobs/view/3958983249"}