{"jobTitle": "Account Executive, Commercial", "company": {"name": "Notion", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "150,000.00/yr - 180,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About Us<br/><br/>We're on a mission to make it possible for every person, team, and company to be able to tailor their software to solve any problem and take on any challenge. Computers may be our most powerful tools, but most of us can't build or modify the software we use on them every day. At Notion, we want to change this with focus, design, and craft.<br/><br/>We've been working on this together since 2016, and have customers like Pixar, Mitsubishi, Figma, Plaid, Match Group, and thousands more on this journey with us. Today, we're growing fast and excited for new teammates to join us who are the best at what they do. We're passionate about building a company as diverse and creative as the millions of people Notion reaches worldwide.<br/><br/>Notion is an in person company, and currently requires its employees to come to the office for two Anchor Days (Mondays &amp; Thursdays) and requests that employees spend the majority of their week in the office (including a third day).<br/><br/>About The Role<br/><br/>We are looking for a motivated Account Executive with an entrepreneurial and building spirit to join the GTM Sales Team. You will be instrumental in helping build pipeline, generate revenue, and expand our most strategic customers. As an Account Executive, you will play an important role defining/iterating on our sales motions and providing customer feedback to help share our roadmap.<br/><br/>What You'll Achieve<br/><br/>\n<ul><li>Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion</li><li>Actively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage</li><li>Be creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction</li><li>Hold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals</li><li>Drive executive level relationships</li><li>Run product demos to close business at or above quota level</li><li>Help build playbooks and define our sales motion</li><li>Liaise with our incredible user base to provide world class customer experience</li><li>Work cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal)<br/><br/><br/></li></ul>Skills You'll Need To Bring<br/><br/>\n<ul><li>1-3 years of full cycle sales at a fast growing software company</li><li>A track record of high achievement in current and previous roles hitting or exceeding quotas</li><li>A phenomenally strong communicator</li><li>Engaging and compelling presentation skills</li><li>A positive and openness minded attitude</li><li>A strong desire to be successful without sacrificing your values</li><li>A builder mentality who thrives in collaborative environments</li><li>An ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity<br/><br/><br/></li></ul>Nice To Haves<br/><br/>\n<ul><li>You've been an early sales hire at a fast growing start up before</li><li>You've got strong technical chops</li><li>Direct sales plus experience of selling through Partners</li><li>Experience of quarterly sales planning</li><li>New logo acquisition sales experience<br/><br/><br/></li></ul>Our customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Notion.<br/><br/>Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.<br/><br/>Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco or New York City, the estimated range for total on target earnings (including base salary and on target incentive pay) for this role is $150,000 - $180,000 per year.<br/><br/>By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.<br/><br/>", "responsibilities": "Prospect and develop new potential accounts by educating contacts about how they can increase their team's collaboration, transparency, and productivity with Notion\nActively work to maintain strong relationships with Notion's existing customer base while identifying opportunity for expanding usage\nBe creative and iterate on the contract renewal process to retain and grow customers while mitigating churn or contraction\nHold face-to-face and Zoom meetings with prospective customers to understand their business challenges and goals\nDrive executive level relationships\nRun product demos to close business at or above quota level\nHelp build playbooks and define our sales motion\nLiaise with our incredible user base to provide world class customer experience\nWork cross-functionally and collaboratively with internal teams (sales, inside sales, customer success, solution engineer, deal-desk, ops, legal)", "qualifications": {"required": "1-3 years of full cycle sales at a fast growing software company\nA track record of high achievement in current and previous roles hitting or exceeding quotas\nA phenomenally strong communicator\nEngaging and compelling presentation skills\nA positive and openness minded attitude\nA strong desire to be successful without sacrificing your values\nA builder mentality who thrives in collaborative environments\nAn ability to operate within the gray and find creative or out-of-the-box solutions when faced with ambiguity", "preferred": "You've been an early sales hire at a fast growing start up before\nYou've got strong technical chops\nDirect sales plus experience of selling through Partners\nExperience of quarterly sales planning\nNew logo acquisition sales experience"}, "skills": ["Sales", "Software", "Communication", "Presentation Skills", "Customer Relationship Management", "Customer Success", "Sales Operations", "Sales Management", "Business Development", "Account Management", "Product Demo", "Sales Strategy", "Sales Process", "Sales Pipeline", "Sales Forecasting", "Sales Reporting", "Sales Analytics", "Sales Enablement", "Sales Training", "Sales Coaching", "Sales Leadership", "Sales Motivation", "Sales Negotiation", "Sales Closing", "Sales Prospecting", "Sales Qualification", "Sales Outreach", "Sales Follow-up", "Sales CRM", "Sales Automation", "Sales Intelligence", "Sales Analytics", "Sales Reporting", "Sales Forecasting", "Sales Pipeline", "Sales Strategy", "Sales Process", "Sales Management", "Sales Leadership", "Sales Coaching", "Sales Motivation", "Sales Negotiation", "Sales Closing", "Sales Prospecting", "Sales Qualification", "Sales Outreach", "Sales Follow-up", "Sales CRM", "Sales Automation", "Sales Intelligence", "Sales Analytics", "Sales Reporting", "Sales Forecasting", "Sales Pipeline", "Sales Strategy", "Sales Process", "Sales Management", "Sales Leadership", "Sales Coaching", "Sales Motivation", "Sales Negotiation", "Sales Closing", "Sales Prospecting", "Sales Qualification", "Sales Outreach", "Sales Follow-up", "Sales CRM", "Sales Automation", "Sales Intelligence"], "postedDate": "2 weeks ago", "benefits": "Notion is committed to providing highly competitive cash compensation, equity, and benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3958499520"}