{"jobTitle": "Manager Supply Chain Logistics Specialty", "company": {"name": "Holy Cross Health Fl", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Employment Type<br/><br/></strong>Full time<br/><br/><strong>Shift<br/><br/></strong><strong>Description:<br/><br/></strong><ul><li> Is knowledgeable of and ensures that supervised Associates are knowledgeable of applicable current compliance policies and procedures, laws and regulatory developments including their responsibility to comply with applicable laws, regulations and Holy Cross Hospital policies as a condition of employment, as well as reporting mechanisms such as the corporate compliance hotline.</li><li> Ensures that Associates complete compliance orientation and ensures and arranges for ongoing specific risk training (applicable to the department) on a regular basis throughout the year.</li><li> Provides appropriate assistance regarding monitoring techniques to reasonably assure compliance in supervised functional areas, including the submission of reports of suspect non-compliance to the Compliance Officer so that further evaluation can be performed.</li><li> Interviews and selects vendors based on service, competitive costs, quality, etc.</li><li> Investigates alternative resources and councils Department Heads on available options to their request. * Determine product specification and possible vendors. Reviews vendor bids and selects vendor. Monitors contracts and evaluates contract performance. Authorizes payment.</li><li> Assists in negotiating capital purchases as well as supply and service contracts. Submits capital request for consultation review. Takes appropriate steps to reduce costs.</li><li> Responsible for the assignment and/or disposition of used furnishings, supplies and equipment.</li><li> Prepares annual budget for Materials Management departments with VP approval.</li><li> Analyzes and monitors Departmental budgets on an ongoing basis; works with VP to assure conformance to budget guidelines and financial \"report card\"</li><li> Works with and advises Department head and Administration on budgeting for purchasing of supplies and equipment.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li> High school diploma or equivalent is required. College degree preferred.</li><li> Minimum of three (3) years hospital or related purchasing experience is required.</li><li> Two (2) years experience in a supervisory or management capacity is required.</li><li> Knowledge of hospital supply and purchasing activities, inventories, basic accounting, word processing and computer utilization is required.</li><li> Good analytical and math skills are a plus.<br/><br/></li></ul><strong>Our Commitment to Diversity and Inclusion<br/><br/></strong>Trinity Health is one of the largest not-for-profit, Catholic healthcare systems in the nation. Built on the foundation of our Mission and Core Values, we integrate diversity, equity, and inclusion in all that we do. Our colleagues have different lived experiences, customs, abilities, and talents. Together, we become our best selves. A diverse and inclusive workforce provides the most accessible and equitable care for those we serve. Trinity Health is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other status protected by law.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3958056248"}