{"jobTitle": "Public Relations Senior Account Executive", "company": {"name": "LaunchSquad", "location": "Multnomah County, OR"}, "location": "Multnomah County, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "70,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Public Relations and Communications Services", "description": "LaunchSquad is known for building brands from scratch. Together we create public relations programs for innovative startup and mid-stage technology, consumer lifestyle and media companies like Waabi, Climeworks, and On Running. We are looking for a storyteller to join our team. LaunchSquad is working in a flexible, hybrid environment. We are open to remote work candidates for this opportunity. LaunchSquad Senior Account Executives are experienced public relations professionals. They are active participants on four accounts responsible for owning and overseeing large pieces of public relations programs. At times, they also oversee the day-to-day operations of smaller account teams. Senior Account Executives have a track-record of generating consistent, impactful results. They are expert writers and seasoned media pitchers. They are comfortable placing proactive company stories and writing contributed articles for executives independently. Senior Account Executives are confident in their ability to do the work and are learning how to lead clients. They teach new, junior teammates the fundamentals of public relations and share their knowledge and ideas across teams. Requirements<br/><br/><ul><li>3+ of public relations experience at an agency or start-up technology company</li><li>Experience leading accounts and driving significant portions of a public relations programs</li><li>Capable project manager across several distinct teams or large-scale projects</li><li>Media relations proficiency</li><li>Solid writing and editing skills</li><li>Ability to share knowledge and teach teammates how to execute public relations activities at an individual level</li><li>Direct, transparent, inclusive interpersonal communication skills</li><li>Collaborative, consistent approach to work and team</li><li>Track-record of reliable, high-quality work in fast-paced environments</li><li>Diverse work samples that exemplify expert execution of public relations goals<br/><br/><br/></li></ul>Salary &amp; Benefits<br/><br/><ul><li>Senior Account Executives are salary, exempt and the salary range is $70,000 - $80,000</li><li>Mentorship program focused on internal growth and development </li><li>Fully covered health benefits including vision and dental </li><li>401K matching program</li><li>Generous paid family leave</li><li>Flexible vacation and rotational Fridays off </li><li>Sabbatical leave </li><li>Wellness stipend</li><li>Virtual first, work from anywhere </li><li>People and community oriented with in-person team gatherings<br/><br/><br/></li></ul>At LaunchSquad, we care about our work, our clients and our community. We are a people-first company committed to making sure everyone has a great experience and an equal opportunity to grow and succeed. If you’re looking for a new opportunity, and you’re excited about our work and community, we’d love to hear from you.", "responsibilities": "Senior Account Executives are experienced public relations professionals. They are active participants on four accounts responsible for owning and overseeing large pieces of public relations programs. At times, they also oversee the day-to-day operations of smaller account teams. Senior Account Executives have a track-record of generating consistent, impactful results. They are expert writers and seasoned media pitchers. They are comfortable placing proactive company stories and writing contributed articles for executives independently. Senior Account Executives are confident in their ability to do the work and are learning how to lead clients. They teach new, junior teammates the fundamentals of public relations and share their knowledge and ideas across teams.", "qualifications": {"required": "3+ of public relations experience at an agency or start-up technology company, Experience leading accounts and driving significant portions of a public relations programs, Capable project manager across several distinct teams or large-scale projects, Media relations proficiency, Solid writing and editing skills, Ability to share knowledge and teach teammates how to execute public relations activities at an individual level, Direct, transparent, inclusive interpersonal communication skills, Collaborative, consistent approach to work and team, Track-record of reliable, high-quality work in fast-paced environments, Diverse work samples that exemplify expert execution of public relations goals"}, "skills": [], "postedDate": "1 month ago", "benefits": "Mentorship program focused on internal growth and development, Fully covered health benefits including vision and dental, 401K matching program, Generous paid family leave, Flexible vacation and rotational Fridays off, Sabbatical leave, Wellness stipend, Virtual first, work from anywhere, People and community oriented with in-person team gatherings", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959579250"}