{"jobTitle": "Public Relations Account Executive", "company": {"name": "LaunchSquad", "location": "Multnomah County, OR"}, "location": "Multnomah County, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "52,000.00 - 65,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Public Relations and Communications Services", "description": "LaunchSquad is known for building brands from scratch. Together we create public relations programs for innovative startup and mid-stage technology, consumer lifestyle and media companies like Waabi, Climeworks, and On Running. We are looking for a storyteller to join our team. LaunchSquad is working in a flexible, hybrid environment. We are open to remote work candidates for this opportunity. LaunchSquad Public Relations Account Executives are evolving public relations professionals. They are active participants on four accounts responsible for developing new and existing storytelling opportunities for clients. They have experience developing subject matter expertise for complex topics and can quickly dive into learning about new technology products and services. Account Executives are known for well-researched, structured bylines and thoughtful, concise pitches. They actively build new relationships with key media contacts and find new proactive media opportunities for clients. They develop and write key pieces of thought leadership content for executives. They are good at the work and can balance competing priorities and objectives across four teams. Team leaders rely on Account Executives to produce consistent, high-quality results. New teammates rely on Account Executives to share knowledge and guide day-to-day work. Requirements<br/><br/><ul><li>2+ years of public relations experience </li><li>Experienced project manager with a knack for staying organized and working across multiple competing projects and timelines</li><li>Proficient writer and editor</li><li>Media pitching experience preferred</li><li>Passion for consuming the news and following media trends; interest in technology is a plus</li><li>Effective facilitator of information and reliable, consistent collaborator on teams</li><li>Direct, transparent, inclusive interpersonal communication skills</li><li>Track-record of sustained, high-quality work in fast-paced environments</li><li>Writing samples and/or media placements encouraged<br/><br/><br/></li></ul>Salary &amp; Benefits<br/><br/><ul><li>Account Executives are salary, exempt and the salary range is $52,000 - $65,000</li><li>Mentorship program focused on internal growth and development </li><li>Fully covered health benefits including vision and dental </li><li>401K matching program</li><li>Generous paid family leave</li><li>Flexible vacation and rotational Fridays off </li><li>Sabbatical leave </li><li>Wellness stipend</li><li>Virtual first, work from anywhere </li><li>People and community oriented with in-person team gatherings<br/><br/><br/></li></ul>At LaunchSquad, we care about our work, our clients and our community. We are a people-first company committed to making sure everyone has a great experience and an equal opportunity to grow and succeed. If you’re looking for a new opportunity, and you’re excited about our work and community, we’d love to hear from you.", "responsibilities": "LaunchSquad Public Relations Account Executives are evolving public relations professionals. They are active participants on four accounts responsible for developing new and existing storytelling opportunities for clients. They have experience developing subject matter expertise for complex topics and can quickly dive into learning about new technology products and services. Account Executives are known for well-researched, structured bylines and thoughtful, concise pitches. They actively build new relationships with key media contacts and find new proactive media opportunities for clients. They develop and write key pieces of thought leadership content for executives. They are good at the work and can balance competing priorities and objectives across four teams. Team leaders rely on Account Executives to produce consistent, high-quality results. New teammates rely on Account Executives to share knowledge and guide day-to-day work.", "qualifications": {"required": "2+ years of public relations experience, Experienced project manager with a knack for staying organized and working across multiple competing projects and timelines, Proficient writer and editor, Media pitching experience preferred, Passion for consuming the news and following media trends; interest in technology is a plus, Effective facilitator of information and reliable, consistent collaborator on teams, Direct, transparent, inclusive interpersonal communication skills, Track-record of sustained, high-quality work in fast-paced environments, Writing samples and/or media placements encouraged", "preferred": null}, "skills": ["Public Relations", "Project Management", "Writing", "Media Relations", "Storytelling", "Communication", "Collaboration"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Mentorship program focused on internal growth and development, Fully covered health benefits including vision and dental, 401K matching program, Generous paid family leave, Flexible vacation and rotational Fridays off, Sabbatical leave, Wellness stipend, Virtual first, work from anywhere, People and community oriented with in-person team gatherings", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959577246"}