{"jobTitle": "Channel Sales Manager, US Enterprise and Public Sector", "company": {"name": "Canonical", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Canonical is the publisher of Ubuntu, the world's leading operating system for container, cloud and hyperscale computing. Ubuntu is the operating system of choice for most public cloud linux workloads as well as the emerging categories of smart gateways, self-driving cars and advanced robots. Canonical provides enterprise security, support, and services to commercial users of Ubuntu.<br/><br/>Canonical is growing its channel sales team to capitalize on rapidly growing demand from channel partners, leveraging their expertise and connections to bring open source technology to organizations across a multitude of industries.<br/><br/>At Canonical, the Channel Sales Manager role reports to the Director, Global Channel Sales and requires a mix of both farming and hunting capabilities. The successful candidate will be responsible for achieving assigned annual growth quotas.<br/><br/>They should be able to identify, prospect, and engage reseller and distributor partners to build and maintain relationships and grow Canonical's business within the assigned territory.<br/><br/>The successful candidate must be comfortable owning and leading initiatives in an unstructured, startup-like environment. This individual must be able to sell open source, cloud, virtualization, and technical software solutions.<br/><br/>Although the role is focused primarily on reseller and distributor channel partners, the successful candidate must be capable of and comfortable with initial customer discovery calls and presentations as appropriate.<br/><br/><strong>Location: </strong>US<br/><br/><strong>The Role Entails<br/><br/></strong><ul><li>Develop and execute channel strategy for distributors and resellers within the assigned territory</li><li>Increase awareness of Canonical as a lead player in Open Source and Cloud (Private, Hybrid, Multi, and Public models) </li><li>Identify and recruit new potential partners in assigned territory</li><li>Leverage personal network and prospecting skills to engage new partners and build on Canonical's already-successful relationships</li><li>Guide partners through onboarding and enablement </li><li>Develop mutually beneficial go-to-market plans and commitments with partners</li><li>Arrange and execute sales and pre sales trainings to these resellers</li><li>Drive and manage channel pipeline through recurring partner interactions</li><li>Support partner's satisfaction and act as trusted advisor and point of contact</li><li>Maintain a regularity/frequency of contact with priority resellers and distributors. <br/><br/></li></ul><strong>What we are looking for in you<br/><br/></strong><ul><li>Bachelor's level degree, preferably in a technology field</li><li>Experience in software or technology sales from the specified market</li><li>Fluency in English</li><li>An understanding of open source, Linux and Ubuntu</li><li>A self starter with a proven track record of achieving sales targets</li><li>Detail oriented with strong follow-up skills</li><li>Effective negotiating skills with ability to close sales</li><li>Excellent interpersonal and presentation skills (written and verbal)</li><li>Productive in a globally distributed team through self-discipline and self-motivation</li><li>Mature approach to long-term relationship development with customers</li><li>The ability to represent the company at external events</li><li>Start-up experience would be an advantage<br/><br/></li></ul><strong>Nice-to-have skills<br/><br/></strong><ul><li>US public sector experience<br/><br/></li></ul><strong>What we offer colleagues<br/><br/></strong><ul><li>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</li><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/></li></ul></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/><strong>Canonical is an equal opportunity employer<br/><br/></strong>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "postedDate": "1 month ago", "skills": ["Open Source", "Cloud", "Virtualization", "Linux", "Ubuntu", "Sales", "Channel Sales", "Partner Management", "Relationship Building", "Go-to-Market Strategy", "Sales Training", "Negotiation", "Public Sector", "Technology Sales", "Software Sales"], "url": "https://www.linkedin.com/jobs/view/3959712455"}