{"jobTitle": "Contact Center Member Services Representative (MSR) II", "company": {"name": "Municipal Credit Union", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "16.10/hr - 35.04/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Financial Services", "description": "<strong>About MCU:<br/><br/></strong>At Municipal Credit Union, we believe that an incredible culture helps create a happy and motivated team that works hard to achieve the best results for themselves and their members. For more than 100 years, MCU has provided affordable financial products and convenient services to a membership base that is now comprised of over 500,000 individuals. With each new generation we have the pleasure of interacting with, we maintain the credit union promise of people helping people.<br/><br/><strong> About the job: <br/><br/></strong>Answer incoming service calls ensuring first-call resolution; perform member inquiries and transactions while providing the<br/><br/>highest quality member experience. Operate within a high volume call environment to perform a basic transactional and/or support duties with a high degree of accuracy and in accordance with MCU policies and procedures. <strong>This role is on a hybrid schedule with the potential to transition to 100% remote. <br/><br/></strong><strong> What you’ll be responsible for: <br/><br/></strong><ul><li>Ensure excellent member service; every call, every time. </li><li>Answer inbound member requests via member call-ins; queue assignment based on knowledge, skills and abilities. </li><li>Perform more complex member transactions and inquiries (releasing check holds, debit and credit card inquiries/disputes, address and phone change, answering loan documentation inquiries, account research, payment requests, account resolution inquiries, online banking requests, fee refund requests, etc.) </li><li>Perform outbound calls as needed (member call back queue, as requested for follow-up, may follow-up on member referrals, etc.) </li><li>Properly log and track all incoming calls and member contact; ensure wrap up codes properly correspond to member requests. </li><li>May document more complicated service transactions required by separation of duties to be performed by a partner department (i.e. MAS or ACH processing). Ensure proper documentation and routing of the request. </li><li>Meet/exceed set eBranch metrics and service goals (i.e. call quality, avg talk time, hold time, mbr wait time, productivity requirements, etc.)</li><li>Maintain comprehensive knowledge of MCU products and services. </li><li>Maintain comprehensive knowledge of credit union policies and procedures as well as applicable rules and regulations and how they apply to MCUs eBranch environment. </li><li>Cross-sell additional products and services to best fit member need(s). </li><li>Cross-train more complex servicing transactions and service such as online banking requests and troubleshooting, member email, existing and pending loan questions, etc. </li><li>May train new MSRs for basic transactions and inbound service calls. </li><li>Back up other queues as necessary (general queue and queues less complex, when call volume dictates). </li><li>May help answer member emails or chats, as necessary </li><li>Other duties as assigned. <br/><br/><br/></li></ul><strong> What you’ll bring: <br/><br/></strong><ul><li>Excellent member service skills </li><li> Excellent interpersonal, oral and written communication skills </li><li>Retail banking experience is a plus </li><li>1-2 years’ Call Center experience </li><li>Ability to multi-task; good time management skills </li><li>Strong research and problem-solving skills </li><li>Proficiency in Microsoft Office Suite </li><li>Availability to work Hybrid Schedule; Overtime and Saturdays as needed</li><li>6 months on-site</li><li>Highly ethical. <br/><br/><br/></li></ul><strong> Why you’ll be a good fit: <br/><br/></strong>Our Core Values are an integral part of who we are and who we hire. By living our Core Values, every day, we continue to attract the best and brightest talent, achieve unsurpassed results and continuously challenge ourselves to be better than yesterday. These values are at the heart of our organization and within every teammate. To be a great fit, you’ll bring the following:<br/><br/><strong>Results</strong> – You’ll look to achieve the best outcomes for our members. Continuously track and measure everything, and use it to always improve. Be proactive, not reactive.<br/><br/><strong>Agility</strong> – You’ll remain agile in your decision making, planning, and delivery; using curiosity and creativity to see situations from all perspectives.<br/><br/><strong>Integrity</strong> – You’ll act professionally and positively. Build trust, be upfront and communicate thoroughly.<br/><br/><strong>Teamwork</strong> – You’ll work to achieve common goals as part of ONE TEAM.<br/><br/><strong>Ownership</strong> – You’ll hold yourself and others accountable and remain committed to our obligations while caring about the outcomes as much as an owner would.<br/><br/><strong>Belonging</strong> – You’ll embrace and environment in which any individual or group can be and feel welcomed, respected, supported and valued.<br/><br/>We stand by our mission to connect our members and communities with an exceptional financial future and we are looking for individuals who share this same purpose to take this journey with us.<br/><br/><strong> What we can offer you: <br/><br/></strong><strong>Competitive Compensation, Medical And Dental Benefits.<br/><br/></strong>401K with employer contribution<br/><br/>Flexible paid time off<br/><br/>We are committed to hiring, training, cultivating, promoting, and celebrating an environment where we have a welcoming and fulfilling place for all people to call home. Diversity of race, thought, sexual orientation, age, veteran status, religion, and disability will empower us to thrive as individuals, as teams, and as an organization.<br/><br/>Municipal Credit Union (MCU) is an Equal Opportunity Employer.<br/><br/>MCU provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.<br/><br/>Salary: $16.10 to $25.57", "responsibilities": "Answer incoming service calls ensuring first-call resolution; perform member inquiries and transactions while providing the highest quality member experience. Operate within a high volume call environment to perform a basic transactional and/or support duties with a high degree of accuracy and in accordance with MCU policies and procedures. This role is on a hybrid schedule with the potential to transition to 100% remote. Ensure excellent member service; every call, every time. Answer inbound member requests via member call-ins; queue assignment based on knowledge, skills and abilities. Perform more complex member transactions and inquiries (releasing check holds, debit and credit card inquiries/disputes, address and phone change, answering loan documentation inquiries, account research, payment requests, account resolution inquiries, online banking requests, fee refund requests, etc.). Perform outbound calls as needed (member call back queue, as requested for follow-up, may follow-up on member referrals, etc.). Properly log and track all incoming calls and member contact; ensure wrap up codes properly correspond to member requests. May document more complicated service transactions required by separation of duties to be performed by a partner department (i.e. MAS or ACH processing). Ensure proper documentation and routing of the request. Meet/exceed set eBranch metrics and service goals (i.e. call quality, avg talk time, hold time, mbr wait time, productivity requirements, etc.). Maintain comprehensive knowledge of MCU products and services. Maintain comprehensive knowledge of credit union policies and procedures as well as applicable rules and regulations and how they apply to MCUs eBranch environment. Cross-sell additional products and services to best fit member need(s). Cross-train more complex servicing transactions and service such as online banking requests and troubleshooting, member email, existing and pending loan questions, etc. May train new MSRs for basic transactions and inbound service calls. Back up other queues as necessary (general queue and queues less complex, when call volume dictates). May help answer member emails or chats, as necessary. Other duties as assigned.", "qualifications": {"required": "Excellent member service skills, Excellent interpersonal, oral and written communication skills, Retail banking experience is a plus, 1-2 years’ Call Center experience, Ability to multi-task; good time management skills, Strong research and problem-solving skills, Proficiency in Microsoft Office Suite, Availability to work Hybrid Schedule; Overtime and Saturdays as needed, 6 months on-site, Highly ethical."}, "skills": ["Member Service", "Communication", "Retail Banking", "Call Center", "Time Management", "Research", "Problem Solving", "Microsoft Office Suite"], "postedDate": "1 month ago", "benefits": "Competitive Compensation, Medical And Dental Benefits, 401K with employer contribution, Flexible paid time off", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3959586574"}