{"jobTitle": "Customer Support Specialist", "company": {"name": "VERO", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "VERO Leasing for the Future | Confidence for Today VERO is a vertical SaaS platform, purpose-built to mitigate risk, increase leasing velocity, and consolidate vendors in the rental real estate workflow. Our cloud-native platform handles everything from applicant pre-qualification through lease execution. VERO’s proprietary technology quickly and accurately verifies financial and personal information critical to risk mitigation and lease execution. VERO creates trust and confidence in the leasing process by empowering property owners and operators to work more efficiently and profitably while simultaneously allowing applicants to maintain control of their own data and financial identity. OUR CORE VALUES Excellence: We are a high-performing team and hold the bar high for ourselves and each other. We take pride in the quality work that we produce and continually iterate to improve. Bias For Action: We optimize for execution, asking ourselves “What can we do today?” to make progress towards our goals, always iterating along the way. Passion: We bring energy and enthusiasm to our work and connect our day-to-day activities to our mission so that it is clear to our teammates and customers that we care. Customer Centric: We make every decision, big and small, with the customer in mind. We know we don’t get to be here without them and never lose sight of that in all we do. One Team: We are collaborative, rowing in the same direction toward our common goals. We believe the whole is greater than the sum of its parts and that we win and lose together as one team across all departments. HOW WE MEASURE SUCCESS Our customer-facing teams are dedicated to delivering reliable and effective solutions with a dedication to excellence for both our users (applicants/renters) and our clients (property managers). We take pride in every interaction, ensuring our support exceeds expectations and reflects our commitment to quality and efficiency. KPIs including, but not limited to, Customer Satisfaction (CSAT) and First Response Time are used to measure the success and health of our team’s delivery of our mission. LIFE &amp; CULTURE We strive to create a passionate and results-oriented team by fostering a culture of collective achievement, continuous improvement, and passionate service. We believe that by democratizing access to information and instilling a bias towards action, we allow good ideas to percolate from anywhere and avoid siloed thinking. We work fast, hard, and with a focus on providing a world-class experience for our clients. ABOUT THE ROLE The Customer Support team is responsible for supporting both the Renters that are applying through VERO, and the Managers that are reviewing and managing applications and leases in VERO. Our dedicated concierge-level service for strategic clients, VERO1, increases the occupancy rate of our clients by actively engaging with applicants to streamline the process of meeting leasing application requirements. Most of our support is done through chat and email, but we also jump on the phone or a scheduled screen share meeting with users when that is the most effective way to assist. This opportunity is for folks who truly love supporting our strategic customers to achieve their objectives and see themselves in a customer-facing role long-term. This is not a springboard into other areas or jobs at VERO. This is a great role for those who are looking to be a pivotal part of creating customer experience excellence at VERO, helping us innovate through experience as we grow and develop both as an organization and as a team. NOTE: We are currently looking to fill a shift of Tue-Sat 9am to 6pm ET (6am to 3pm PT). What You'll Do<br/><br/><ul><li>Deliver highly responsive proactive support to users and clients</li><li>Troubleshoot concerns and answer questions for our strategic clients</li><li>Become a VERO product expert, always curious to discover how to best use the product to achieve customer outcomes</li><li>Identify and report bugs, surface product feedback, and collaborate with the product team to advocate for client satisfaction</li><li>Accurately and efficiently complete application review tasks for clients</li><li>Track activity, actions, and results on proactive support for users</li><li>Collaborate with team members and cross-functional teams to grow and improve the concierge service offering<br/><br/><br/></li></ul>Who You Are<br/><br/><ul><li>Passionate for helping others and a desire to find a solution that meets their needs</li><li>Exceptional troubleshooting and investigative skills, with a knack for creative problem-solving and a make-it-happen spirit</li><li>Ability to rapidly switch gears while retaining focus on the bigger picture</li><li>Ability to explain complex topics in easy-to-understand and concise language [English]</li><li>Ambition, eagerness, and the will to learn and improve upon your skills</li><li>Strong organizational and time management skills</li><li>A passion for building valued relationships with customers</li><li>A strong attention to detail<br/><br/><br/></li></ul>Helpful Skills<br/><br/><ul><li>Prior SaaS product support experience</li><li>Experience with Intercom, Guru, Jira, FullStory</li><li>Knowledge of the multi-family residential rental process<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Competitive compensation package</li><li>Great medical, vision, dental, and commuter benefits</li><li>Flexible vacation policy</li><li>Work from home or from one of our hubs in New York City or Dallas<br/><br/><br/></li></ul>VERO is growing. We share an excitement for best-in-class technology, serving our customers, and building unprecedented solutions for complex problems. It’s an exciting time to join VERO, and we’re looking for the best talent to help us build high-impact solutions for businesses and individuals alike. If you are a high-performing team player who enjoys working collaboratively with others and you are willing to share and support diverse opinions, come transform leasing with us! Learn more at sayvero.com or follow us on Instagram, Twitter or LinkedIn.", "jobFunction": "Other", "industry": "Real Estate", "postedDate": "1 month ago", "benefits": "Competitive compensation package, Great medical, vision, dental, and commuter benefits, Flexible vacation policy, Work from home or from one of our hubs in New York City or Dallas", "remoteWork": "Yes", "responsibilities": "Deliver highly responsive proactive support to users and clients, Troubleshoot concerns and answer questions for our strategic clients, Become a VERO product expert, always curious to discover how to best use the product to achieve customer outcomes, Identify and report bugs, surface product feedback, and collaborate with the product team to advocate for client satisfaction, Accurately and efficiently complete application review tasks for clients, Track activity, actions, and results on proactive support for users, Collaborate with team members and cross-functional teams to grow and improve the concierge service offering", "skills": ["SaaS", "Intercom", "Guru", "Jira", "FullStory", "Multi-family Residential Rental"], "url": "https://www.linkedin.com/jobs/view/3959582215"}