{"jobTitle": "Senior Manager, Supplier Planning", "company": {"name": "Carrier", "location": "Palm Beach Gardens, FL", "industry": "Wholesale Building Materials"}, "location": "Palm Beach Gardens, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Wholesale Building Materials", "description": "Country<br/><br/>United States of America<br/><br/>Location: <br/><br/>CAF77: CCS - CIB 13995 Pasteur Blvd , Palm Beach Gardens, FL, 33418 USA<br/><br/>Carrier is the leading global provider of healthy, safe and sustainable building and cold chain solutions with a world-class, diverse workforce with business segments covering HVAC, refrigeration, and fire and security. We make modern life possible by delivering safer, smarter and more sustainable services that make a difference to people and our planet while revolutionizing industry trends. This is why we come to work every day. Join us and we can make a difference together.<br/><br/>About This Role<br/><br/>Carrier Supply Chain has a role open for a Senior Manager – Supplier Planning who will be a critical leader and member of the Global Supply Chain Center of Excellence. The Supplier Capacity Planner is responsible for ensuring that suppliers have the capacity to meet the production demands of the organization. This role involves analyzing supplier capabilities, forecasting demand, coordinating with suppliers to align their production capacities with the company’s needs, and mitigating risks related to supply constraints.<br/><br/>Key Responsibilities<br/><br/>Capacity Analysis:<br/><br/><ul><li>Assess and evaluate the production capabilities of suppliers</li><li>Conduct capacity audits and gap analysis to identify potential constraints<br/><br/></li></ul>Demand Forecasting<br/><br/><ul><li>Collaborate with demand planning and production teams to understand future production needs.</li><li>Use forecasting tools to predict supplier capacity requirements based on production schedules.<br/><br/></li></ul>Supplier Coordination<br/><br/><ul><li>Work closely with suppliers to ensure they can meet current and future demand.</li><li>Develop and implement action plans with suppliers to address capacity constraints.<br/><br/></li></ul>Risk Management<br/><br/><ul><li>Identify potential risks related to supplier capacity and develop mitigation strategies.</li><li>Create contingency plans to address supply disruptions.<br/><br/></li></ul>Performance Monitoring<br/><br/><ul><li>Establish key performance indicators (KPIs) to monitor supplier capacity and performance.</li><li>Conduct regular reviews and audits to ensure supplier compliance with capacity commitments.<br/><br/></li></ul>Continuous Improvement<br/><br/><ul><li>Identify opportunities for process improvements within supplier operations.</li><li>Collaborate with suppliers to implement best practices and enhance capacity planning processes.</li><li>Collaborate with supplier to execute VSM (Value Stream Mapping) to drive process improvement.<br/><br/></li></ul>Reporting And Documentation<br/><br/><ul><li>Maintain accurate records of supplier capacity data and performance metrics.</li><li>Prepare and present reports to management on supplier capacity status and issues.<br/><br/></li></ul>Cross-functional Collaboration<br/><br/><ul><li>Work with S&amp;OP, procurement, logistics, quality, and production teams to align supplier capacity with overall supply chain strategy.<br/><br/></li></ul>Required Qualifications<br/><br/><ul><li>Bachelor’s degree</li><li>8+ years of experience in supply chain planning or supplier management</li><li>Travel 30%<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Advanced degree or certification in supply chain management (e.g., APICS CPIM, CSCP).</li><li>Strong analytical and problem-solving abilities.</li><li>Proficiency in capacity planning tools and ERP systems (e.g. SAP).</li><li>Excellent communication and negotiation skills.</li><li>Ability to build and maintain strong relationships with suppliers.</li><li>Detail-oriented with strong organizational and project management skills.</li><li>Leading in a global, multi-site environment<br/><br/></li></ul>RSRCAR<br/><br/><strong><strong>Carrier is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.<br/><br/></strong></strong><strong>Job Applicant's Privacy Notice<br/><br/></strong>Click on this link to read the Job Applicant's Privacy Notice<br/><br/>", "postedDate": "1 month ago", "qualifications": {"required": "Bachelor’s degree\n8+ years of experience in supply chain planning or supplier management\nTravel 30%", "preferred": "Advanced degree or certification in supply chain management (e.g., APICS CPIM, CSCP).\nStrong analytical and problem-solving abilities.\nProficiency in capacity planning tools and ERP systems (e.g. SAP).\nExcellent communication and negotiation skills.\nAbility to build and maintain strong relationships with suppliers.\nDetail-oriented with strong organizational and project management skills.\nLeading in a global, multi-site environment"}, "skills": ["Supply Chain", "Supplier Management", "Capacity Planning", "Demand Forecasting", "Risk Management", "Performance Monitoring", "Continuous Improvement", "Reporting", "Documentation", "Cross-functional Collaboration", "SAP", "ERP", "S&OP", "Procurement", "Logistics", "Quality", "Production", "Analytical Skills", "Problem Solving", "Communication", "Negotiation", "Relationship Building", "Organizational Skills", "Project Management", "Global", "Multi-site"], "url": "https://www.linkedin.com/jobs/view/3960132911"}