{"jobTitle": "Yard Manager", "company": {"name": "Copart", "location": "West Palm Beach, FL"}, "location": "West Palm Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Motor Vehicle Manufacturing", "description": "Under the direction of the General Manager or Assistant General Manager, the Yard Manager is responsible for leading the yard staff to achieve customer service goals and ensure Copart processes are implemented and followed for all yard functions. Under the direction of the GM and/or AGM and through a thorough understanding of Copart practices, the Yard Manager will lead their team to facilitate a unique Copart experience for customers by implementing and maintaining Copart best practices that meet company policy, quality and service expectations.<br/><br/><ul><li>Hire, train, develop and motivate staff members</li><li>Ensure performance is within company standards</li><li>Employee scheduling, time and attendance management</li><li>Cash handling to include daily bank deposits</li><li>Monitor yard inventory and purchase as needed</li><li>Conduct performance reviews according to company schedules</li><li>Plan and lead meetings per company standards</li><li>Contract maintenance (certificates of insurance for vendors)</li><li>Monitor and maintain yard fence Facility and equipment maintenance</li><li>Ability to complete all job tasks for positions supervised</li><li>Compliance to company Equipment and Safety requirements</li><li>Ability to work on mechanical problems present on vehicles</li><li>Handle employee/customer service issues</li><li>Travel as needed<br/><br/></li></ul><strong>Required Skills &amp; Experience:<br/><br/></strong><ul><li>Three (3) years general outside operation management or equivalent experience</li><li>High School Degree (GED), some college preferred</li><li>Computer Proficiency (MS Office Suite)</li><li>Excellent communication skills - verbal and written</li><li>Ability to hire, train, develop and motivate employees</li><li>Excellent customer service skills</li><li>Typing at least 45 Words Per Minute</li><li>Ability to read/write English fluently</li><li>Ability to manage expenses with basic accounting and inventory management skills</li><li>Ability to work in a fast-paced environment</li><li>Managing multiple processes for employees</li><li>Conflict management skills</li><li>Ability to differentiate color</li><li>Have a valid driver's license</li><li>Bilingual a plus<br/><br/></li></ul><strong>For 40 years, Copart has led its industry in innovation and customer service, enabling it to grow profitably in markets across the globe. Our success is the direct result of the skills and efforts of our talented and diverse employees. Our mindset? It's never just a \"job\" when your coworkers are like family - it's like coming home.</strong>", "postedDate": "1 month ago", "skills": ["Customer Service", "Management", "Training", "Communication", "Inventory Management", "Microsoft Office", "Conflict Management", "Teamwork", "Leadership", "Cash Handling", "Scheduling", "Performance Management", "Equipment Maintenance", "Safety", "Mechanical Skills", "Travel", "Bilingual"], "url": "https://www.linkedin.com/jobs/view/3960224586"}