{"jobTitle": "Field Marketing Operations Manager", "company": {"name": "Nutrabolt", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "Who We Are:\n\nNutrabolt is a fast-growing, global active health and wellness company with a portfolio of market leading performance-oriented brands that energize and fuel active lifestyles. The company's disruptive and innovative products compete in the Functional Beverage and Active Nutrition segments, under three consumer-loved brands: C4® (one of the fastest-growing energy drink brands in the United States and the #1 selling global pre-workout brand), XTEND® (the #1 post-workout recovery brand in the United States), and Cellucor® (an award-winning sports nutrition brand created in 2002).\n\nSince its founding 20 years ago, Nutrabolt has set out to meet the discerning needs of performance athletes and fitness enthusiasts, while appealing beyond this core group to include consumers around the globe who are making healthy, active living a daily priority.\n\nAs a Certified Great Place to Work, Top Workplaces USA honoree, Fortune Best Workplace in Texas, and more – Nutrabolt cares deeply about our people, planet, and the communities we serve. Here, our teammates are united by our mission, and take ownership in creating a healthy workplace environment that promotes strong bodies, clear minds, and a culture of respect and belonging for all.\n\n*Note to applicants: This is a hybrid role located in Austin, TX with occasional travel to Field Marketing key markets. \n\n*Who You Are: As the Field Marketing Operations Manager reporting to the Director of Field Marketing, you will assume a highly supportive role to the entire Field Marketing Team, undertaking administrative and clerical tasks to ensure the functionality, coordination, and accurate reporting of the department's activities.\n\nWhat You're Good At: \n\n* You will provide administrative support to the Field Marketing organization directed by its leaders to ensure reporting, fleet vehicles, assets and inventory are managed properly.\n* Administer day-to-day operations for the Field Marketing Team including scheduling organizational meetings, local storage unit management, Field Team analytics and reporting, expense and budget management, and fleet management services\n* Fleet management, both internal tracking and external coordination, for company vehicles. Includes procurement of new vehicles, disposition at lease-end, and maintenance of current vehicles.\n* Ensure vehicles are kept up to standard by regularly monitoring reporting software, contacting drivers, and maintaining compliance and safety for the team.\n* Manage any fleet management company requests by reporting necessary accidents/ maintenance and other action items to appropriate internal team\n* Work with Commercial team to drive brand messaging, positioning in market and generate strategies to continue to stay ahead of the market trends.\n* Compile monthly Field Marketing recap, assist in department storytelling, track KPIs, and progress reports for upper management review.\n* Coordinate shipping of product, assets, uniforms, etc., to Field Teams, as needed, utilizing Nutrabolt's ordering system(s) and approved, outsourced vendors.\n* Research and make recommendations on cost-effective ways to innovate and improve branding for field team activations.\n* Manage budgets and keep detailed and accurate records for Field Team expenses.\n* Liaise between the Field Marketing Team and the primary contact for our Field reporting tool (Repsly).\n* Manage the team's creative requests using our current project management software (Wrike).\n* **Logistical support for Field Team efforts, as needed or directed by either the Director of Field Marketing or Regional Field Marketing Managers.**\n* Cross departmental communication and coordination of assets and activit\n* Support events, as appropriate, with on-site coordination and execution.\n\nWhat You Contribute:\n\n* Has a Bachelor's degree in Marketing, Communications, Business or an equivalent field\n* Is familiar with Field Marketing principals\n* Ability to thrive under pressure and in a dynamic, fast-paced environment\n* Can manage multiple priorities at one time, with respect to priority level\n* Has superior critical thinking, analytic and communication skills\n* Is creative and resourceful; can resolve issues/problems that may come up\n* Has efficient time management skills\n* Is proficient in Microsoft Suite and Google-based tools (Sheets, Docs, Forms, etc.)\n* Superior organization skills\n* Demonstrated attention to detail and accuracy in work\n* Highly dependable; strong follow-through and initiative\n\nIn this role your goals and KPIs will be focused around:\n\n* Order management accuracy\n* Successful market asset sourcing\n* Full-cycle asset management from purchasing, use, and maintaining inventory\n\nWhy Nutrabolt?\n\nWellness Benefits\n\nNutrabolt cares about our teammates' physical, mental, and financial wellness by providing benefits like: competitive health insurance, life insurance, mental wellness programs, 401K matching, and a Lifestyle Spending Account.\n\nLifestyle Perks\n\nWe offer unlimited vacation paid time off and volunteer time off. You'll get discounts on C4 Energy, Cellucor, and XTEND products, too!\n\nFamily Support\n\nWe want you to reach your full potential at work by taking care of all loved ones at home. We provide paid parental leave, in addition to reimbursement for expenses related to childcare, fertility treatments, legal fees, and more through our Lifestyle Spending Account.\n\nEmployment Type: Full-time, Typical Office/Hybrid Environment.\n\nPlease review our CCPA policy here.\n\n*By providing your phone number, you consent to receiving text communications related to your job application via SMS from Nutrabolt. Applicable messaging and data rates may apply. You may opt out at any time by replying STOP. View our terms of use for additional details.*", "responsibilities": "As the Field Marketing Operations Manager reporting to the Director of Field Marketing, you will assume a highly supportive role to the entire Field Marketing Team, undertaking administrative and clerical tasks to ensure the functionality, coordination, and accurate reporting of the department's activities.", "qualifications": {"required": "Has a Bachelor's degree in Marketing, Communications, Business or an equivalent field\nIs familiar with Field Marketing principals\nAbility to thrive under pressure and in a dynamic, fast-paced environment\nCan manage multiple priorities at one time, with respect to priority level\nHas superior critical thinking, analytic and communication skills\nIs creative and resourceful; can resolve issues/problems that may come up\nHas efficient time management skills\nIs proficient in Microsoft Suite and Google-based tools (Sheets, Docs, Forms, etc.)\nSuperior organization skills\nDemonstrated attention to detail and accuracy in work\nHighly dependable; strong follow-through and initiative", "preferred": ""}, "skills": ["Field Marketing", "Microsoft Suite", "Google-based tools", "budget management", "fleet management", "analytics and reporting", "communication", "critical thinking"], "postedDate": "1 month ago", "benefits": "Wellness Benefits\n\nNutrabolt cares about our teammates' physical, mental, and financial wellness by providing benefits like: competitive health insurance, life insurance, mental wellness programs, 401K matching, and a Lifestyle Spending Account.\n\nLifestyle Perks\n\nWe offer unlimited vacation paid time off and volunteer time off. You'll get discounts on C4 Energy, Cellucor, and XTEND products, too!\n\nFamily Support\n\nWe want you to reach your full potential at work by taking care of all loved ones at home. We provide paid parental leave, in addition to reimbursement for expenses related to childcare, fertility treatments, legal fees, and more through our Lifestyle Spending Account.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3961729478"}