{"jobTitle": "513th Electronic Warfare Mission Data Analyst", "company": {"name": "DCS Corp", "location": "Niceville, FL"}, "location": "Niceville, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "DCS Corp has an immediate opening for a Electronic Warfare (EW) Mission Data (MD) Analyst supporting the United States reprogramming Lab (USRL) and 513 th Electronic Warfare Squadron (EWS) on Eglin AFB.<br/><br/><strong>Essential Job Functions<br/><br/></strong>The EW MD Analyst will work with other members of the team to develop state-of-the-art mission data for advanced 5th generation fighter aircraft. The ideal candidate’s responsibilities will include:<br/><br/>Conduct research and perform intelligence collection to assist in EW programming efforts.<br/><br/>Develop complex electronic warfare models and programs for lab testing.<br/><br/>Program complex mission data files to provide enhanced situational awareness for pilots.<br/><br/>Advise on RF antenna performance.<br/><br/>Provide detailed feedback and support by performing validation and verification analysis, mission data file generation as well as assisting in mission data group management.<br/><br/><strong>Required Skills<br/><br/></strong>Due to the sensitivity of customer related requirements, U.S. Citizenship is required.<br/><br/>Bachelor's Degree with 5 years of relevant experience, Associate's degree with 10 years of relevant experience, or high School diploma with 16 years of relevant experience.<br/><br/>Must have or be able to obtain a Secret security clearance.<br/><br/><strong>Desired Skills<br/><br/></strong>Experience with programming 4th or 5th generation fighter mission data.<br/><br/>Experience with developing SW supporting creating mission data reports.<br/><br/>Experience with training on mission data SW and programming.<br/><br/>Experience with directing mission data tests in the lab.<br/><br/>Experience with MATLAB.<br/><br/>Experience with Intel sources such as CED, EWIRDB, and NGES.<br/><br/>Experience with electronic countermeasures to include: V&amp;V test plans AESA radar systems, HFIM, and EW modulation on pulse.<br/><br/>Familiarity with F-35 avionics.", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3962144322"}