{"jobTitle": "Customer Support Specialist", "company": {"name": "Igentify", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "Resolve customer queries and recommend solutions Guide product users through features and functionalities Work closely with R&D on creating and testing new Cloud environments Craft serviceability documentation (e.g., user manual, release notes) Generate Customer Support dashboards and reports Build sustainable relationships and trust with customer accounts through open and interactive communication Handle customer calls: Complaints, suggestions, and requests for support Provide appropriate solutions per Q&A protocol and follow the relevant workflow to ensure successful resolution Provide professional customer support in order to ensure customer satisfaction Write the product manuals and training materials Manage the clients’ help desk and open tickets to other departments in company as necessary<br/><br/>To be successful in this role, you should be an excellent communicator who’s able to earn our clients’ trust.<br/><br/>You should also be familiar with help desk software. Ultimately, you will help establish our reputation as a company<br/><br/>that offers excellent customer support during all sales and after-sales procedures.<br/><br/>Requirements:<br/><br/><ul><li> Bachelor’s Degree or equivalent</li><li> 2-3 years of experience as a Customer Service Representative, preferably in B2B SaaS organization</li><li> Excellent communication and presentation skills</li><li> Quick learner of new technologies</li><li> Working in tense operations environments, when quick resolutions are required</li><li> Customer orientation and ability to adapt/respond to different types of characters</li><li> Quick learner, always looking to embrace and master new technologies</li><li> Ability to prioritize, multitask and organize workload</li><li> Ability to work both individually and collaboratively within a team environment</li><li> Strong written and verbal communication skills</li><li> Experience in software companies, preferred from digital health companies</li><li> Experience in a startup environment preferred</li><li> Additional language skills e.g., French and Spanish<br/><br/></li></ul><strong>﻿What can you expect in our hiring process?<br/><br/></strong>Our goal is to find amazing individuals to join us on our journey, and it is important for us to get to know you to understand if there is a good fit.<br/><br/>Our company culture drives our managers, employees, and processes to be transparent, responsive, and inviting.<br/><br/>Along every step of the way, we will let you know where you stand and will be open to discuss any matter. You will gain a clear understanding of the company and position that will help you make an informed career decision. Finally, if we both agree to start our path together, you will become an integral member of a great company! Good luck on our mutual path.<br/><br/><strong>Igentify is committed to being an equal opportunity employer<br/><br/></strong>We know that applying for a new job can be intimidating. But guess what? At Igentify, there is no such thing as an “ideal candidate.” We believe in the power of teamwork -- and in the desire to learn something new every day. We believe in hiring people, not just skills.<br/><br/>If this sounds like a company you would like to join and a role you would thrive in, please don’t hold back from applying! We need your unique perspective for our continued innovation and success. We’re looking forward to learning more about you!", "postedDate": "1 month ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3962959825"}