{"jobTitle": "Data Analyst with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Fort Walton Beach, FL"}, "location": "Fort Walton Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$75,000 - $110,000", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "Join Us in Making a Difference in the Lives of Those Defending Our Nation! Why SURVICE? Come join the SURVICE Engineering mission to protect, enhance, and enable those who defend the United States. Since 1981, we have supported the DoD community, as well as Homeland Security, advanced technologies, environmental, and commercial markets. Our employees have backgrounds in engineering, physics, mathematics, chemistry, computer science, acquisition, technical writing, training, and other technical and administrative fields. And many of our personnel have DoD and/or operational military experience. If you're looking for a challenging and rewarding career with a leading organization, come see what we can offer you! Position Data Analyst<br/><br/><ul><li>Location: Fort Walton Beach, FL</li><li>Security Clearance: Active Clearance or Eligible to Obtain - U.S. citizenship required</li><li>Salary: $75,000 - $110,000 Depending on Experience and Education</li><li>Travel: 5%</li><li>Benefits: SURVICE Engineering offers a total rewards package to include competitive salaries, comprehensive insurance options, paid time off, 401(k) with company match, flexible spending, tuition reimbursement. Position Summary SURVICE Engineering is currently seeking a Data Analyst to support Air Force Research Laboratory (AFRL) programs. This position provides analytic support to wargaming as well as platform and AFRL concept research to integrate into wargame design and post-wargame analysis. We are looking for someone who thrives in a small team environment, enjoys asking tough questions, and likes designing and prepping simulative/test environments to help answer these tough questions. Primary Duties and Responsibilities</li><li>Collaborate with a team of AFRL representatives to research and develop AFRL concepts and analytic requirements for wargame inclusion</li><li>Provide analytic support to AFRL wargames, to include data management, post-event analysis, and analytic report development</li><li>Draft analytic reports exploring historical trends, AFRL project and concept overviews, and qualitative and/or quantitative analyses from events</li><li>Participate in analytical wargame events and post-wargame data analysis; prepares briefings of post-game outcomes for stakeholders Minimum Qualifications of Data Analyst Bachelor's degree in a social science or technical field of study and 0-5 years of relevant experience. Candidates are not required to possess all qualifications; if you possess some of the desired qualifications, please apply.</li><li>Strong communication and writing skills</li><li>Practical knowledge of Department of Defense (DoD) aircraft and weapon systems.</li><li>Experience drawing qualitative insights and manipulating quantitative data (using Excel, Python, or similar data analysis tool).</li><li>Professional operations research knowledge in drawing insights from diverse MS&amp;A scenarios.</li><li>Experience with engineering, engagement, mission, or campaign level M&amp;S environments is a plus, but not required.</li><li>Knowledge of the intelligence community and past wargaming participation, such as Red Teaming or planning, is a plus.</li><li>Demonstrated ability to work independently and in a small team environment.</li><li>Excellent organizational skills.</li><li>Demonstrated ability to participate in small, dynamic teams and deliver products exceeding customer expectations. About Us SURVICE Engineering is a nationally recognized, single-source engineering service provider for Government and Industry organizations involved in all phases of the systems engineering process. Our employees are our most valuable asset, and they are proud to have supported the development, testing, analysis, and modeling and simulation (M&amp;S) of many of the major U.S. air, land, and sea combat systems in the field today. They have also contributed their expertise to other vital national defense programs and technologies that involve survivability, cybersecurity, information technology/management, software engineering, unmanned aerial systems (UASs), and metrology/reverse engineering. SURVICE Engineering is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. VEVRAA Federal Contractor.</li></ul>", "responsibilities": "Collaborate with a team of AFRL representatives to research and develop AFRL concepts and analytic requirements for wargame inclusion\nProvide analytic support to AFRL wargames, to include data management, post-event analysis, and analytic report development\nDraft analytic reports exploring historical trends, AFRL project and concept overviews, and qualitative and/or quantitative analyses from events\nParticipate in analytical wargame events and post-wargame data analysis; prepares briefings of post-game outcomes for stakeholders", "qualifications": {"required": "Bachelor's degree in a social science or technical field of study and 0-5 years of relevant experience. Candidates are not required to possess all qualifications; if you possess some of the desired qualifications, please apply.\nStrong communication and writing skills\nPractical knowledge of Department of Defense (DoD) aircraft and weapon systems.\nExperience drawing qualitative insights and manipulating quantitative data (using Excel, Python, or similar data analysis tool).\nProfessional operations research knowledge in drawing insights from diverse MS&A scenarios.\nExperience with engineering, engagement, mission, or campaign level M&S environments is a plus, but not required.\nKnowledge of the intelligence community and past wargaming participation, such as Red Teaming or planning, is a plus.\nDemonstrated ability to work independently and in a small team environment.\nExcellent organizational skills.\nDemonstrated ability to participate in small, dynamic teams and deliver products exceeding customer expectations."}, "skills": ["Data Analysis", "Excel", "Python", "Operations Research", "Wargaming", "Intelligence", "Communication", "Writing", "DoD", "Aircraft", "Weapon Systems"], "postedDate": "1 month ago", "benefits": "SURVICE Engineering offers a total rewards package to include competitive salaries, comprehensive insurance options, paid time off, 401(k) with company match, flexible spending, tuition reimbursement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3962628632"}