{"jobTitle": "Account Manager (inside sales)", "company": {"name": "Oasis Financial", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "MoveDocs is seeking an assertive and ambitious Regional Account Manager to support our growing law firm relationships and their interactions with medical providers while assisting our Regional Vice President. This person will be the primary regional point of escalation to address law firm and plaintiff medical needs as identified by the Regional VP. This person should be a relationship builder with the ability to work fast and efficiently, and with an incredible ability to multi-task. This role will allow you the opportunity to both open up new business within existing accounts and help manage accounts. Candidates must be located in the United States and have personal injury industry or medical experience.<br/><br/>Reporting to VP- Inside Sales<br/><br/>Position Responsibilities:<ul><li>Be the point of contact for BDEs while they’re in the field, informing them of issues with firms and providers.</li><li>Be the level one-point person for law firm escalations for issues related to medical related matters on our platform, requiring complete understanding of the operations processes supporting the MoveDocs platform.</li><li>Work with providers, firms and the Ops team to resolve ongoing issues with certain cases, involving the necessary departments to resolve problems quickly.</li><li>Support firm growth by performing and supporting Demos of the MoveDocs platform</li><li>Be a point of contact to make active introductions to firms not already on the platform.</li><li>Handles incoming calls professionally with clear communication and prompt follow through</li><li>Works in an organized fashion with an extreme attention to detail on all tasks</li><li>Serves as a back-up for Directors and other Regional Account Managers when needed</li></ul>Required Skills and Experience:<ul><li>Experience working in the Medical or Personal Injury field required</li><li>High School graduate required; College degree preferred</li><li>1-2 years of sales experience preferred</li><li>Customer service experience preferred; strong relationship building skills a must</li><li>Excellent verbal and written communication skills, coupled with a strong aptitude to listen</li><li>Excellent PC skills (email, MS Office including Microsoft Word and Excel)</li><li>Possess a high level of drive, motivation, and goal-orientation</li></ul><ul><li>Be organized, detail- oriented, confident, positive, passionate, and compassionate</li><li>Ability to work in a fast-paced environment with strong ability to multi-task</li><li>Adaptable and driven to ensure that the tasks of the day are completed</li></ul>Benefits: MoveDocs offers competitive compensation (salary and commission) and benefits that include medical, dental and vision plans, 401(k) with company match, flexible spending account and paid time off.<br/><br/>About Us:<br/>MoveDocs is the leading Personal Injury Solutions Platform that integrates key medical, financial, and expert services to optimize client case outcomes while minimizing the time it takes to achieve them. MoveDocs was created by doctors and attorneys who knew there must be a better – and more efficient – way to support their clients. More than 20 years later, 40,000+ personal injury firms and 10,000+ providers have used the platform and seen the results. <br/><br/>Together under Libra Solutions, the combination of our footprints, relationships, technology, and funding power solidifies our combined companies as the premier leaders in medical lien, medical legal, Pre-Settlement funding (Oasis Financial), and inheritance (Probate Advance) industries.", "postedDate": "2 months ago", "skills": ["Sales", "Customer Service", "Relationship Building", "Communication", "Microsoft Office", "Microsoft Word", "Microsoft Excel", "Personal Injury", "Medical", "Operations", "Demos", "Problem Solving", "Multitasking", "Goal-Orientation", "Detail-Oriented", "Fast-Paced Environment"], "url": "https://www.linkedin.com/jobs/view/3963307604"}