{"jobTitle": "Director of Partnerships", "company": {"name": "Relocity, Inc.", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "110,000.00/yr - 130,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Business Development, and Strategy/Planning", "industry": "Technology, Information and Internet", "description": "What Relocity Is Doing<br/><br/>Relocity is reimagining the global mobility experience. We enable enterprises to attract, retain, and engage talent globally. Powered by our AI-driven workforce mobility platform, we bring together local experts and insightful content in our native mobile app to deliver an excellent user experience for people on the move. Our core values drive us to focus on our customers, innovation, integrity, and excellence. Relocity serves hundreds of cities in more than 40 markets across the United States, Europe, Asia, and Australia. Learn more at www.relocity.com.<br/><br/>What You’ll Do…<br/><br/>As a Director of Partnerships, your primary responsibility is to identify, cultivate, develop and sign new long-term client partnerships for Relocity. The candidate will act in harmony with the Relocity’s Leadership Team to accomplish annual new business development financial goals and targets.<br/><br/>Our Sales team drives the entire company forward by bringing our SaaS + service model platform to new customers and up-selling to our client base - every single day. We are a tight-knit, high-energy crew that love to hunt. We value being a great team, achieving the extraordinary, and changing lives.<br/><br/>How You’ll Do It…<br/><br/><ul><li>Identify, contact, profile and qualify Company Partners through a high-level of outbound prospecting from a defined ecosystem</li><li>Build and nurture relationships with key partners, primarily Relocation Management Companies (RMC’s) to expand our partner network and drive revenue growth</li><li>Manage partner alliance contracting and onboarding process</li><li>Create and manage partner relationships and work closely with Customer Success on enablement</li><li>Work with partners to train client teams and equip them for success, including how they position Relocity and how they leverage Relocity to grow revenue and enhance the client experience</li><li>Develop a solid working knowledge of company's SaaS and service solutions and the benefits it provides to potential customers and across the partner network</li><li>Bring both a process oriented approach as well as creative thinking to build our partner channel</li><li>Work with partners to expand relationship in support of new and existing clients and programs</li><li>Build a partner-influenced / partner-led pipeline for 2024 and beyond</li><li>Meet and exceed established partner quotas</li><li>Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws when needed</li><li>Responsible for interviewing, hiring, and training employees</li><li>Responsible for planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.<br/><br/></li></ul>What Past Experience and Current Skills Will Enable Your Success In This Role?<br/><br/><ul><li>Experienced and passionate individual who’s looking for a high growth opportunity in a fast-paced startup environment</li><li>Has a “can-do” attitude and is willing to take on ad-hoc tasks and challenges when needed</li><li>A collaborative spirit and team leader with excellent interpersonal skills, both written and verbal</li><li>Ability to manage and drive business discussions with influence</li><li>5+ years in partner sales or strategic partner development, ideally within the talent mobility space or a related human capital management industry</li><li>Superior executive presence and communication, both internally and externally</li><li>Thrives in an independent, agile work environment with the ability to influence and persuade others cross-functionally to achieve desired outcomes</li><li>Passion for Partners and the company solution</li><li>Bachelor’s degree in Marketing, Communications, Business or related field</li><li>Excellent problem solving, organizational and time management skills</li><li>Exceptional analytical, verbal, and written communication skills<br/><br/></li></ul>Pay Range: $110,000 - $130,000 plus Bonus<br/><br/>How We Support You And Work Life Balance…<br/><br/><ul><li>Competitive Compensation</li><li>Paid Time Off</li><li>Paid Parental Leave</li><li>Remote Workplace</li><li>Flexible Work Schedules</li><li>Health, Dental, Vision, LTD Insurance</li><li>401(k)<br/><br/></li></ul><em>Relocity is an Equal Opportunity Employer and does not discriminate against any applicant on the basis of race, color, religion/creed, national origin, gender, or sex, marital status, age, disability, use of a guide dog or service animal, sexual orientation, military/veteran status, or any other status protected by Federal or State law or local ordinance. Relocity will only employ those who are legally authorized to work. Any offer of employment is conditioned on the successful completion of a background investigation, credit check and drug test.<br/><br/></em>", "responsibilities": "As a Director of Partnerships, your primary responsibility is to identify, cultivate, develop and sign new long-term client partnerships for Relocity. The candidate will act in harmony with the Relocity’s Leadership Team to accomplish annual new business development financial goals and targets.", "qualifications": {"required": "Experienced and passionate individual who’s looking for a high growth opportunity in a fast-paced startup environment, Has a “can-do” attitude and is willing to take on ad-hoc tasks and challenges when needed, A collaborative spirit and team leader with excellent interpersonal skills, both written and verbal, Ability to manage and drive business discussions with influence, 5+ years in partner sales or strategic partner development, ideally within the talent mobility space or a related human capital management industry, Superior executive presence and communication, both internally and externally, Thrives in an independent, agile work environment with the ability to influence and persuade others cross-functionally to achieve desired outcomes, Passion for Partners and the company solution, Excellent problem solving, organizational and time management skills, Exceptional analytical, verbal, and written communication skills", "preferred": "Bachelor’s degree in Marketing, Communications, Business or related field"}, "skills": ["SaaS", "Partner Management", "Business Development", "Sales", "Strategic Partnerships", "Talent Acquisition", "Customer Success", "Partner Sales", "Partner Development", "Talent Mobility", "Human Capital Management", "Executive Presence", "Communication", "Problem Solving", "Time Management", "Analytical Skills", "Marketing", "Communications", "Business"], "postedDate": "5 days ago", "benefits": "Competitive Compensation, Paid Time Off, Paid Parental Leave, Remote Workplace, Flexible Work Schedules, Health, Dental, Vision, LTD Insurance, 401(k)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3965903354"}