{"jobTitle": "Senior Director of Global Partnerships", "company": {"name": "Iterable", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "169,000.00 - 255,000.00", "currency": "USD"}, "jobFunction": "Management and Marketing", "industry": "Software Development", "description": "Iterable is the top-rated AI-powered customer engagement platform that helps organizations like Redfin, Priceline, Calm, and Box to activate customers with joyful interactions at scale. With Iterable, organizations drive high growth with individualized, harmonized and dynamic communications that engage customers throughout the entire lifecycle at the right time. Iterable’s data engine, ease of use, and flexible and open architecture makes it the best platform to close the data activation gap by bringing together customer data, ability to design the experiences, deliver them and optimize them. All in one platform. We’ve surpassed $200M in ARR and have raised more than $230M from top-tier investors like Index Ventures, Viking, and CRV. Nearly 1200 companies from over 50 countries around the world rely on us to captivate their many millions of users.<br/><br/>Iterable helps brands unlock growth in the digital era by enabling joyful customer experiences with individualized communications based real-time behavioral data, harmonized cross-channel communications based on customer lifecycle, and dynamic always-on journeys that adapt to customer signals. Our powerful customer communication platform helps marketers manage end-to-end customer engagement programs with enterprise-grade security, compliance and controls for their customers.<br/><br/>Iterable’s momentum grows daily and there has never been a more exciting time to join the team! We’ve been recognized as one of the Best Places to Work - SF for the past five years, recognized as one of Inc’s Best Workplaces and Fastest Growing Companies, and we were recognized on Forbes’ list of America’s Best Startup Employers in 2022. Notably, Iterable has also been listed on Wealthfront’s Career Launching Companies List and has held a top 10 ranking on the Top 25 Companies Where Women Want to Work.<br/><br/>We have a global presence with offices in San Francisco, New York, Denver, and London, and recently expanded our operations to Australia and New Zealand. Iterable’s reach extends worldwide, and we have remote employees across the globe. As we scale, we continue to live by our core four, founding values - Trust, Growth Mindset, Balance, and Humility. To understand the Iterable story, and learn more about our mission, explore our Culture and About Us page.<br/><br/><strong>Job Description:<br/><br/></strong>You will drive strategic initiatives with our agency and tech partners to accelerate our growth and market presence. This role requires a strategic visionary leader who can lead their team to identify, negotiate, and manage partnerships that drive pipeline creation and assist with deal closure. The ideal candidate will have a strong track record in partner development, excellent leadership skills, and a deep understanding of the MarTech landscape.<br/><br/><strong>Responsibilities Include:<br/><br/></strong><ul><li>Develop and execute a comprehensive agency and tech partner strategy aligned with the company’s business objectives and market trends.</li><li>Identify, evaluate, and prioritize strategic partnerships and business opportunities that enhance our product offerings, market reach, and competitive position.</li><li>Cultivate and nurture relationships with key partners, including technology partners, system integrators, and agencies, to drive collaboration and mutual success.</li><li>Collaborate with sales and marketing teams to develop strategies that leverage partnerships to create and accelerate pipeline opportunities.</li><li>Drive joint go-to-market initiatives with partners to maximize revenue potential.</li><li>Optimize partner performance through business reviews, identify additional business opportunities to expand revenue, and deploy a joint sales approach.</li><li>Build, manage, and mentor a high-performing business development team.</li><li>Develop team members through coaching, feedback, and professional development opportunities.</li><li>Work cross-functionally with product, marketing, sales, and customer success teams to ensure alignment and success of partnership initiatives.</li><li>Work with the program, marketing, and sales teams on the execution of partner programs, events, sales engagement, building playbooks, and collateral to enable partners to co-sell effectively.<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Minimum of 10 years of experience in business development, partnerships, or a related role within the MarTech industry.</li><li>Proven track record of developing and executing successful partnership strategies that drive revenue growth.</li><li>Strong negotiation, communication, and relationship-building skills.</li><li>Deep understanding of the MarTech industry, market dynamics, and competitive landscape.</li><li>Ability to think strategically and execute methodically.</li><li>Experience leading and mentoring high-performing teams.</li><li>Aptitude for technical language and a quantitative, analytical mindset.<br/><br/></li></ul><strong>Perks &amp; Benefits:<br/><br/></strong><ul><li>Paid parental leave</li><li>Competitive salaries, meaningful equity, &amp; 401(k) plan</li><li>Medical, dental, vision, &amp; life insurance</li><li>Balance Days (additional paid holidays)</li><li>Fertility &amp; Adoption Assistance</li><li>Paid Sabbatical</li><li>Flexible PTO</li><li>Monthly Employee Wellness allowance </li><li>Monthly Professional Development allowance </li><li>Pre-tax commuter benefits</li><li>Complete laptop workstation<br/><br/></li></ul>The US base salary range for this position at the start of employment is $169,000 - $255,000. Within this range, individual pay is determined by specific US work location, as well as additional factors, including job-related skills, experience, relevant education or training, and internal equity considerations.<br/><br/>Please note that the range listed above reflects only base salary. The total compensation package includes variable pay (where applicable), equity, plus a range of benefits, including medical, dental, vision, and financial. In addition, we offer perks such as generous stipends for health &amp; fitness and learning &amp; development, among others.<br/><br/>Iterable is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. Iterable does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender-identity, sexual orientation, disability, age, military or veteran status, or any other basis protected by applicable local, state, or federal laws or prohibited by Company policy. Iterable also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Pursuant to the San Francisco Fair Chance Ordinance and other similar state laws and local ordinances, and its internal policy, Iterable will also consider for employment qualified applicants with arrest and conviction records.", "responsibilities": "Develop and execute a comprehensive agency and tech partner strategy aligned with the company’s business objectives and market trends. Identify, evaluate, and prioritize strategic partnerships and business opportunities that enhance our product offerings, market reach, and competitive position. Cultivate and nurture relationships with key partners, including technology partners, system integrators, and agencies, to drive collaboration and mutual success. Collaborate with sales and marketing teams to develop strategies that leverage partnerships to create and accelerate pipeline opportunities. Drive joint go-to-market initiatives with partners to maximize revenue potential. Optimize partner performance through business reviews, identify additional business opportunities to expand revenue, and deploy a joint sales approach. Build, manage, and mentor a high-performing business development team. Develop team members through coaching, feedback, and professional development opportunities. Work cross-functionally with product, marketing, sales, and customer success teams to ensure alignment and success of partnership initiatives. Work with the program, marketing, and sales teams on the execution of partner programs, events, sales engagement, building playbooks, and collateral to enable partners to co-sell effectively.", "qualifications": {"required": "Minimum of 10 years of experience in business development, partnerships, or a related role within the MarTech industry. Proven track record of developing and executing successful partnership strategies that drive revenue growth. Strong negotiation, communication, and relationship-building skills. Deep understanding of the MarTech industry, market dynamics, and competitive landscape. Ability to think strategically and execute methodically. Experience leading and mentoring high-performing teams. Aptitude for technical language and a quantitative, analytical mindset.", "preferred": null}, "skills": [], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Paid parental leave, Competitive salaries, meaningful equity, & 401(k) plan, Medical, dental, vision, & life insurance, Balance Days (additional paid holidays), Fertility & Adoption Assistance, Paid Sabbatical, Flexible PTO, Monthly Employee Wellness allowance, Monthly Professional Development allowance, Pre-tax commuter benefits, Complete laptop workstation", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3966430867"}