{"jobTitle": "Home Study & Post Release Worker - Las Vegas, NV", "company": {"name": "Southwest Key Programs", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Education and Training", "industry": "Non-profit Organizations", "description": "The Home Study and Post Release Worker (HSPRW) is responsible for conducting home studies of prospective sponsors and providing post release services to youth who have been released from ORR’s custody to a sponsor in the United States . The HSPRW will carry a combined caseload of home study and post release cases. For home studies, the HSPRW a ssesses the sponsor family unit, evaluates the prospective sponsor’s ability to provide a safe living environment that meets the child’s needs, and educates and prepares the prospective sponsor for reunification with the child. Post release services are a collaborative process in which the HSPRW assists the youth and sponsor identify areas where additional support and resources or information are needed to ensure successful reunification and provides assistance with accessing needed supports and services. The HSPRW maintains a flexible, organized and efficient work schedule and is subject to work overtime and be on-call.<br/><br/><strong> Essential Functions: <br/><br/></strong><ul><li> Conduct interviews with shelter staff, youth, and prospective sponsors as well as home visits for the purpose of making client release recommendations. </li><li> Conduct initial post release visit, assessment, and identify goals to be completed; document goals in treatment plan. </li><li> Conduct subsequent post release vistis to monitor progress of goals in accordance with the ORR timelines. </li><li> Complete documentation in a timely manner and in accordance with SWK and ORR standards. </li><li> Link client and family with community resources and services. </li><li> Write thorough and complete reports with minimal grammatical errors. </li><li> Submit reports to supervisor by program deadlines. </li><li> Maintain ongoing communication with supervisor as well as participate in weekly case review. </li><li> Provide services within Southwest Key and ORR guidelines. </li><li> Participate in and comply with all meetings, assignments, process improvement, and quality improvement initiatives as assigned by supervisor. </li><li> Demonstrate the ability to react to change productively and handle other essential tasks as assigned. </li><li> Act as a mandated reporter and submit reports to state child welfare authorities (Child Protective Services) </li><li> when necessary. </li><li> Coordinate all travel arrangements for home visits. </li><li> Travel to other cities and states as needed for required home visits, training and implementation of new initiatives. <br/><br/></li></ul><strong> Other Functions: <br/><br/></strong><ul><li> Maintain confidentiality in all areas of client and program operations. </li><li> Maintain professional and ethical standards as prescribed by Southwest Key and other relevant entities. </li><li> Attend all organizational, departmental and program meetings to ensure that up-to-date information is received and/or information of policy changes or practice are adhered t </li><li> Must be available to travel to other SWK and community sites as needed in order to support necessary program operations. </li><li> Develop and maintain productive relations with local, state, and federal contact </li><li> Reconcile all business and travel-related expenses as required by SWK. </li><li> Maintain a safe work environment that is free from distractions. </li><li> Perform other functions as assigned. <br/><br/></li></ul><strong> Qualifications and Requirements: <br/><br/></strong><strong>Required:<br/><br/></strong><ul><li> Bachelor’s Degree in Social Work (BSW) or an equivalent degree in education, psychology, sociology, or other behavioral science with at least one (1) year of related experience. </li><li> Knowledgeable about local social services and have experience with home studies, working with immigrant populations, knowledgeable about family preservation, kinship care, and/or child welfare. </li><li> Ability to communicate well both verbally and in writing. </li><li> Ability to complete required reports and documentation in a timely manner. </li><li> Excellent time management, organization, and task completion skills and must be flexible to schedule changes. </li><li> Experience working with children, youth, and/or families from high-risk backgrounds. </li><li> Must be fluent in English and Spanish. </li><li> Ability to travel during up to 75% of work week via plane and automobile. </li><li> Maintain a clean driving record and must be eligible to drive on behalf of SWK. </li><li> Must possess a valid state driver's license, current driver's insurance, and access to reliable transportation. </li><li> Successful completion of all pre-hire requirements, 86 pre-service training hours and on the job shadowing. </li><li> Compliance with pre-service TB testing and PPD Reading. Bi-annual TB testing and PPD reading required thereafter for continued employment. </li><li> Compliance with annual requirement of training hours as mandated by SWK and ORR. </li><li> Must be computer literate with working knowledge of Microsoft Windows such as Microsoft Word, Excel, and other computer programs as required by the position. <br/><br/></li></ul><strong>Preferred:<br/><br/></strong><ul><li> Master’s Degree in Social Work (MSW) or an equivalent degree in education, psychology, sociology or other behavioral science. </li><li> Two (2) years of direct service delivery experience with family reunification or family preservation and/or foster care and home adoption home study preparation. <br/><br/></li></ul>Any candidate that does not meet the job requirements must receive written approval from the ORR Project Officer.<br/><br/><strong> Physical Demands: <br/><br/></strong><ul><li> Must have the ability to travel up to 75% of the work week via plane and automobile. </li><li> Job requires extended periods of sitting and computer work. <br/><br/></li></ul><strong> Work Environment: <br/><br/></strong>This is a work from home job where high levels of self-motivation and organizational skills are needed. Employees must have a quiet, private space in which to work at home. Ability to work a flexible work schedule is required dependent upon the assigned caseload and duties. Work schedules are subject to variation and extended hours and may include weekend and holiday hours as needed in order to satisfactorily complete all job duties in a timely manner.", "postedDate": "1 month ago", "skills": ["Home Studies", "Immigrant Populations", "Family Preservation", "Kinship Care", "Child Welfare", "Time Management", "Organization", "Task Completion", "Children", "Youth", "Families", "High-Risk Backgrounds", "English", "Spanish", "Travel", "Driving", "Microsoft Word", "Excel", "Computer Programs", "Family Reunification", "Foster Care", "Home Adoption", "Home Study Preparation"], "url": "https://www.linkedin.com/jobs/view/3968613499"}