{"jobTitle": "REMOTE - Employee Benefits Account Manager (Must be located in Pacific or Mountain time zone)", "company": {"name": "Jobot", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$80,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/><strong>Join a growing company and one of the most successful teams within the organization!<br/><br/></strong>This Jobot Job is hosted by Jonathan Santo<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $80,000 - $100,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We have been in business for over 30 years and have built a strong business that operates nationwide with offices in multiple states. We are a full service agency helping customers unique needs in both insurance and benefits services. We are proud of our knowledgeable and experienced team that understands the industry and the best way to approach each individual differently to meet our customers exactly where they are. We focus on risk management to ensure that we foresee issues before they occur or meet them head on with a quick solution.<br/><br/>We are proud of the customer service we provide and focus on a proactive approach to all things. We are looking for a new person to join our team that can help us continue our service and the success of our customers.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong><ul><li> Competitive salary and bonus </li><li> Comprehensive benefits package </li><li> 401k with company match </li><li> Long term growth potential<br/><br/></li></ul><strong>Job Details<br/><br/></strong>Job Details<br/><br/>Are you a dynamic, client-focused professional with a background in employee benefits and insurance? Do you thrive in a fast-paced environment where your skills are put to the test? If so, we have a fantastic opportunity for you! We are currently seeking a Employee Benefits Account Manager to join our team. This role involves handling a diverse portfolio of client accounts, ensuring their employee benefits programs are managed effectively and efficiently. You will be the main point of contact for our clients, providing them with exceptional service and expert guidance.<br/><br/><strong>Responsibilities<br/><br/></strong>As an Employee Benefits Account Manager, your responsibilities will include, but are not limited to<br/><br/><ul><li> Managing a portfolio of client accounts, ensuring their employee benefits programs are compliant with regulatory standards and meet the unique needs of each client.</li><li> Handling all aspects of account management, including renewals, claims, billing, and client data management.</li><li> Providing expert guidance to clients on group health, life, and other insurance products, as well as COBRA administration and TPA services.</li><li> Developing and maintaining strong relationships with clients, ensuring their satisfaction and loyalty.</li><li> Preparing and presenting detailed summaries and reports on account status, changes in benefits, rates, and other relevant information.</li><li> Collaborating with other team members to identify and implement strategies for improving service delivery and client satisfaction.</li><li> Staying updated on the latest trends and developments in the employee benefits industry, and incorporating this knowledge into your work.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To be considered for the role of Employee Benefits Account Manager, you should have<br/><br/><ul><li> A minimum of 3 years of experience in employee benefits, insurance, or a related field.</li><li> Proven experience in account management, with a focus on client satisfaction and retention.</li><li> Strong knowledge of group health, life, and other insurance products, as well as COBRA administration and TPA services.</li><li> Excellent understanding of regulatory compliance in the employee benefits industry.</li><li> Exceptional interpersonal and communication skills, with the ability to build strong relationships with clients.</li><li> Proficiency in using various applications and software for managing client data and accounts.</li><li> Strong analytical and problem-solving skills, with the ability to handle complex client issues and queries.</li><li> A proactive and flexible approach to work, with the ability to thrive in a fast-paced and dynamic environment.</li><li> A valid Life and Health license is preferred for this role.<br/><br/></li></ul>If you are a motivated professional with a passion for client service and employee benefits, we would love to hear from you. Apply today and take the next step in your career!<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "As an Employee Benefits Account Manager, your responsibilities will include, but are not limited to<br/><br/><ul><li> Managing a portfolio of client accounts, ensuring their employee benefits programs are compliant with regulatory standards and meet the unique needs of each client.</li><li> Handling all aspects of account management, including renewals, claims, billing, and client data management.</li><li> Providing expert guidance to clients on group health, life, and other insurance products, as well as COBRA administration and TPA services.</li><li> Developing and maintaining strong relationships with clients, ensuring their satisfaction and loyalty.</li><li> Preparing and presenting detailed summaries and reports on account status, changes in benefits, rates, and other relevant information.</li><li> Collaborating with other team members to identify and implement strategies for improving service delivery and client satisfaction.</li><li> Staying updated on the latest trends and developments in the employee benefits industry, and incorporating this knowledge into your work.<br/><br/></li></ul>", "qualifications": {"required": "A minimum of 3 years of experience in employee benefits, insurance, or a related field.\nProven experience in account management, with a focus on client satisfaction and retention.\nStrong knowledge of group health, life, and other insurance products, as well as COBRA administration and TPA services.\nExcellent understanding of regulatory compliance in the employee benefits industry.\nExceptional interpersonal and communication skills, with the ability to build strong relationships with clients.\nProficiency in using various applications and software for managing client data and accounts.\nStrong analytical and problem-solving skills, with the ability to handle complex client issues and queries.\nA proactive and flexible approach to work, with the ability to thrive in a fast-paced and dynamic environment.", "preferred": "A valid Life and Health license is preferred for this role."}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Competitive salary and bonus, Comprehensive benefits package, 401k with company match, Long term growth potential", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3970880435"}