{"jobTitle": "Account Executive", "company": {"name": "Firework", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "85,000.00/yr - 100,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "About Firework<br/>Firework is the world’s leading unified video commerce platform that empowers its global partners to personalize the customer experience and engagement at scale. Firework bridges the offline and online for a robust omnichannel immersive brand experience cultivating a deeper emotional human connection between our partners and their end consumers. We are customer-centric and inspired to win together offering total solutions with endless possibilities to help our customers increase purchases and conversions using the power of video. At the heart, we are a global and diverse team of “SuperSpark” creators, entrepreneurs, life-long learners, and data geeks driven by the future of authenticity to transform commerce. Firework has raised over $235M to date, with its latest Series B round led by SoftBank Vision Fund 2. Come reimagine the online customer experience with us.<br/><br/>Summary<br/>We’re looking for talented Sr. Account Executives who are results-driven professionals to join the sales team. You are the face of Firework and will evangelize Firework’s innovative SaaS solutions to high mid-market and low enterprise brand leads in a variety of categories.<br/><br/>You’ll be tasked with creating and executing creative account strategies to generate new business opportunities for Firework (think new segment, geo or product). To succeed in this role, candidates must be able to source their own sales opportunities and navigate medium sized organizations with multiple stakeholders for the duration of the entire sales cycle. Leveraging your depth of selling experience, you’ll also have the opportunity to influence revenue organization (i.e. mentorship, methodologies, strategy etc.) as we experiment and explore new ways to reach more customers. You’ll strengthen the value of partnerships internally and harness those partnerships to transform the business of our merchants.<br/><br/>Before you apply, consider if you can<br/><br/><br/>\n<ul><li>Care deeply about what you do and about making video commerce an industry norm</li><li>Excel by seeking professional and personal hypergrowth</li><li>Keep up with an unrelenting pace (the week, not the quarter)</li><li>Be resilient and resourceful in face of ambiguity and thrive on (rather than endure) change</li><li>Bring critical thought and opinion</li><li>Embrace differences and disagreement to get sh*t done and move forward</li><li>Work independently and be accountable for your daily work as if it’s your own business<br/><br/><br/><br/><br/></li></ul>What You’ll Be Doing<br/><br/>\n<ul><li>Work cross-functionally with the team to set priorities and make key strategic decisions for growing the mid-market and low enterprise segments</li><li>Build long-term relationships with key decision-makers (brands in various industries) in order to close deals and achieve set quota</li><li>Act as a strategic advisor and consultant to prospects; understand business goals and objectives and frame the Firework value proposition as a new and innovative solution </li><li>Along with SDR, marketing lead generation, build, prospect, and drive new opportunities through strategic cold outreach and other channels such as industry events and partnerships</li><li>Prioritize and manage the entire sales funnel process from initial interest to negotiation and close; ensure the successful integration post-acquisition (full cycle)</li><li>Understanding the unique business goals, needs, and pains of prospects, helping them grow their business with Firework products</li><li>Developing and implementing strategic plans to identify and target potential customers who align with our target marketUsing your extensive network, industry knowledge, and advanced research techniques to generate high-quality leads</li><li>Actively sourcing, building, and managing your sales pipeline and forecast your business</li><li>Demonstrating an ability to engage and communicate effectively with C-level executives</li><li>Continuously assess the entire SaaS revenue operations and logo acquisition process to ensure it continues to scale efficiently while delivering an outstanding product and service experience</li><li>Collaborating on projects (mentorship, sales methodologies, tooling) to improve internal business processes<br/><br/><br/><br/><br/></li></ul>We'll be excited if you have<br/><br/><br/>\n<ul><li>1-3 years experience in a quota-bearing sales role in SaaS targeting mid-market and low enterprise clients, where you have built net new revenue opportunities </li><li>Experience in a closing sales role, with a strong track record of successfully acquiring new business and exceeding sales targets</li><li>Demonstrated passion for hunting with a proven ability to identify and close high-value opportunities in high velocity segments</li><li>Ability to create and multiply a sales playbook to educate higher-ups on the value of Firework and deliver results through multi-threaded evaluations. This includes collaborating with Partnerships, Marketing, Legal, Product, and Finance</li><li>Consultative and solutions-oriented mindset, with an ability to challenge assumptions and comfortably speak about various product offerings</li><li>Extensive experience with outbound prospecting, cultivating a territory, and building a robust pipeline</li><li>Comfort level with getting deep into technical product knowledge and becoming a video commerce product expertAbility to create multi-product pipeline generation strategies driven by sales, marketing, partnerships, events, etc</li><li>Proactive and accurate forecasting that helps set priorities (both short and long term) with clear action plans</li><li>Extensive experience with sales tools (i.e. Salesforce, Apollo, Linkedin, etc)Comfortable with change in a high-growth organization: ability to demonstrate comfort with ambiguity, adapt quickly and be effective in new situations in a highly dynamic setting</li><li>Start-up mentality; you are team-oriented, resilient, empathetic, and no ego<br/><br/><br/><br/><br/></li></ul>Bonus<br/><br/><br/>\n<ul><li>Experience selling or in depth knowledge of one or more of the following industries: Ecommerce, Retail, Fashion, Beauty</li><li>Experience selling to CMO, Head of Marketing, and Head of Ecommerce personas</li><li>Experience with MEDDICC, BANT, and Challenger sales methodologies is a BIG plus<br/><br/><br/><br/><br/></li></ul>The role is hybrid in our New York office.<br/><br/>The following represents the expected range of compensation for this role: The estimated pay range for this role is $85,000-$100,000 plus variable. Other factors that impact compensation include stock options. The posted pay range represents the anticipated low and high end of the compensation for this position and is subject to change based on business need. To determine a successful candidate’s starting pay, we carefully consider a variety of factors, including primary work location, an evaluation of the candidate’s skills and experience, market demands, and internal parity. Candidates may receive more information from the talent partner.<br/><br/>Don’t hold back<br/><br/>We understand some candidates may see the above and not apply because they don’t meet all the qualifications. We encourage you to apply anyway; we often find talented candidates that fit many other opportunities we have and look for potential too, not just what you did in the past. As an equal employment opportunity employer, we are a diverse team that strives for an inclusive environment for all. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, age, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.<br/><br/>By submitting your application, you acknowledge that you have read and understood Firework's Applicant Privacy Policy located at: https://firework.com/legal/applicantpolicy/.", "responsibilities": "Work cross-functionally with the team to set priorities and make key strategic decisions for growing the mid-market and low enterprise segments\nBuild long-term relationships with key decision-makers (brands in various industries) in order to close deals and achieve set quota\nAct as a strategic advisor and consultant to prospects; understand business goals and objectives and frame the Firework value proposition as a new and innovative solution \nAlong with SDR, marketing lead generation, build, prospect, and drive new opportunities through strategic cold outreach and other channels such as industry events and partnerships\nPrioritize and manage the entire sales funnel process from initial interest to negotiation and close; ensure the successful integration post-acquisition (full cycle)\nUnderstanding the unique business goals, needs, and pains of prospects, helping them grow their business with Firework products\nDeveloping and implementing strategic plans to identify and target potential customers who align with our target marketUsing your extensive network, industry knowledge, and advanced research techniques to generate high-quality leads\nActively sourcing, building, and managing your sales pipeline and forecast your business\nDemonstrating an ability to engage and communicate effectively with C-level executives\nContinuously assess the entire SaaS revenue operations and logo acquisition process to ensure it continues to scale efficiently while delivering an outstanding product and service experience\nCollaborating on projects (mentorship, sales methodologies, tooling) to improve internal business processes", "qualifications": {"required": "1-3 years experience in a quota-bearing sales role in SaaS targeting mid-market and low enterprise clients, where you have built net new revenue opportunities \nExperience in a closing sales role, with a strong track record of successfully acquiring new business and exceeding sales targets\nDemonstrated passion for hunting with a proven ability to identify and close high-value opportunities in high velocity segments\nAbility to create and multiply a sales playbook to educate higher-ups on the value of Firework and deliver results through multi-threaded evaluations. This includes collaborating with Partnerships, Marketing, Legal, Product, and Finance\nConsultative and solutions-oriented mindset, with an ability to challenge assumptions and comfortably speak about various product offerings\nExtensive experience with outbound prospecting, cultivating a territory, and building a robust pipeline\nComfort level with getting deep into technical product knowledge and becoming a video commerce product expertAbility to create multi-product pipeline generation strategies driven by sales, marketing, partnerships, events, etc\nProactive and accurate forecasting that helps set priorities (both short and long term) with clear action plans\nExtensive experience with sales tools (i.e. Salesforce, Apollo, Linkedin, etc)Comfortable with change in a high-growth organization: ability to demonstrate comfort with ambiguity, adapt quickly and be effective in new situations in a highly dynamic setting\nStart-up mentality; you are team-oriented, resilient, empathetic, and no ego", "preferred": "Experience selling or in depth knowledge of one or more of the following industries: Ecommerce, Retail, Fashion, Beauty\nExperience selling to CMO, Head of Marketing, and Head of Ecommerce personas\nExperience with MEDDICC, BANT, and Challenger sales methodologies is a BIG plus"}, "skills": ["SaaS", "Sales", "Business Development", "Salesforce", "Apollo", "Linkedin", "Video Commerce", "Ecommerce", "Retail", "Fashion", "Beauty", "MEDDICC", "BANT", "Challenger Sales"], "postedDate": "1 month ago", "benefits": "The estimated pay range for this role is $85,000-$100,000 plus variable. Other factors that impact compensation include stock options.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3971826279"}