{"jobTitle": "Mid-Market Content & Marketing Manager (Non-Commerce), NA SMB Marketing", "company": {"name": "TikTok", "industry": "Entertainment Providers", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Art/Creative, Writing/Editing, and Marketing", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>About Us<br/>TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>About the Team<br/>The SMB Regional Marketing Team's purpose is to make TikTok the most relevant growth platform for small and medium sized businesses, providing education, guidance and showcasing success. As part of the Global SMB Team, the Regional Business Marketing Team works in close collaboration with the Sales and Product teams, becoming the champions of SMB and mid-market audiences, continually optimizing performance driven messaging strategies and customer journeys. We are creative entrepreneurs at heart, ready to dig in and capitalize on the potential and opportunities of the platform and its creative community. <br/><br/>The ideal candidate is a skilled marketer and a creative thinker but is first and foremost a visionary strategist. Candidates should have prior experience designing and executing multi-channel customer experiences and managing ecosystem strategies and implementation. <br/><br/>Responsibilities<br/>- Develop and Execute Growth Strategies:<br/>  - Design and implement bespoke marketing campaign solutions for SMB and/or Mid-Market non-commerce  verticals, collaborating across Sales, Product, and Enterprise Marketing teams.<br/>  - Develop compelling program narratives and sales enablement materials tailored to seasonal, verticalized or ongoing campaigns, catering to both SMB and/or Mid-Market audiences.<br/>  - Identify regional SMB and/or Mid-Market needs through data, campaigns, and content, ensuring solutions address specific requirements across the customer spectrum.<br/>- Drive Full-Funnel Growth:<br/>  - Lead the development and execution of integrated marketing plans (webinars, events, web, social, email) for priority growth initiatives, focusing on both SMB and/or Mid-Market non-commerce verticals.<br/>  - Partner with Sales, Growth, and Product to define market size and prioritize support for initiatives that drive lead generation, new customer acquisition, and revenue growth across SMB and/or Mid-Market non-commerce verticals.<br/>- Content &amp; Campaign Management:<br/>  - Oversee the entire campaign lifecycle for SMB and/or Mid-Market initiatives – from strategy and content creation to vendor management and launch execution, ensuring all projects stay on time and budget.<br/>  - Lead content creation for campaigns, managing internal/external vendors across formats to develop high-quality assets targeted towards SMB and/or Mid-Market commerce and/or non-commerce verticals.<br/>  - Track and analyze campaign performance across all digital platforms for both SMB and/or Mid-Market commerce and/or non-commerce verticals, identifying areas for improvement and continuously iterating for better results.<br/>- Collaboration &amp; Knowledge Sharing:<br/>  - Advocate for the needs of both SMB and/or Mid-Market non-commerce vertical customers, influencing internal teams to prioritize solutions and develop data-driven approaches.<br/>  - Share best practices and collaborate with regional counterparts to achieve full-funnel success (leads, new customers, incremental revenue) across SMB and/or Mid-Market non-commerce verticals.<br/>  - Contribute to broader team initiatives, leveraging insights to inform program and content needs for both SMB and/or Mid-Market commerce and/or non-commerce verticals.<br/>  - Identify and package successful regional platform content strategies for scaling across different markets, promoting knowledge transfer and best practices.<br/> <br/>What We Value in this Role (Aligned to our ByteStyles): <br/>- Aim for the Highest: A blend of strategic thinking and execution who can wear multiple hats and get things done.  Insist on high standards and don't just get the job done, execute with excellence. Take calculated risks for bigger gains, with a focus on return on investment.<br/>- Stay Agile: Someone who adapts to changing priorities and embraces new challenges. Show patience and resilience in the face of short-term fluctuations. Pursue efficiency and simplicity.<br/>- Entrepreneurial Mindset: Focus on achieving goals, not relying on past experiences from companies with rigid structures. <br/><br/>Qualifications<br/><br/>Minimum Qualifications<br/>- Minimum 5 years of experience in a strategy or content strategy role.<br/>- Experience designing and executing sales enablement, content strategies and analyzing content strategy performance.<br/>- Expert written and verbal communicator, with the ability to articulate abstract concepts.<br/>- Ability to identify opportunities, develop project scope and independently lead ideation and execution. <br/>- Experience leading and collaborating across broader teams (Product, Sales, Marketing) to define product value propositions and GTM plans.<br/>- Confidence in crafting integrated marketing plans encompassing various channels.<br/>Preferred Qualifcations<br/>- A deep understanding of the Mid-market industry, with specialty in non-commerce.<br/>- Experience at a startup or in an entrepreneurial environment in the tech industry.<br/> <br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/> <br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2 .", "responsibilities": "- Develop and Execute Growth Strategies:\n  - Design and implement bespoke marketing campaign solutions for SMB and/or Mid-Market non-commerce  verticals, collaborating across Sales, Product, and Enterprise Marketing teams.\n  - Develop compelling program narratives and sales enablement materials tailored to seasonal, verticalized or ongoing campaigns, catering to both SMB and/or Mid-Market audiences.\n  - Identify regional SMB and/or Mid-Market needs through data, campaigns, and content, ensuring solutions address specific requirements across the customer spectrum.\n- Drive Full-Funnel Growth:\n  - Lead the development and execution of integrated marketing plans (webinars, events, web, social, email) for priority growth initiatives, focusing on both SMB and/or Mid-Market non-commerce verticals.\n  - Partner with Sales, Growth, and Product to define market size and prioritize support for initiatives that drive lead generation, new customer acquisition, and revenue growth across SMB and/or Mid-Market non-commerce verticals.\n- Content &amp; Campaign Management:\n  - Oversee the entire campaign lifecycle for SMB and/or Mid-Market initiatives – from strategy and content creation to vendor management and launch execution, ensuring all projects stay on time and budget.\n  - Lead content creation for campaigns, managing internal/external vendors across formats to develop high-quality assets targeted towards SMB and/or Mid-Market commerce and/or non-commerce verticals.\n  - Track and analyze campaign performance across all digital platforms for both SMB and/or Mid-Market commerce and/or non-commerce verticals, identifying areas for improvement and continuously iterating for better results.\n- Collaboration &amp; Knowledge Sharing:\n  - Advocate for the needs of both SMB and/or Mid-Market non-commerce vertical customers, influencing internal teams to prioritize solutions and develop data-driven approaches.\n  - Share best practices and collaborate with regional counterparts to achieve full-funnel success (leads, new customers, incremental revenue) across SMB and/or Mid-Market non-commerce verticals.\n  - Contribute to broader team initiatives, leveraging insights to inform program and content needs for both SMB and/or Mid-Market commerce and/or non-commerce verticals.\n  - Identify and package successful regional platform content strategies for scaling across different markets, promoting knowledge transfer and best practices.", "qualifications": {"required": "- Minimum 5 years of experience in a strategy or content strategy role.\n- Experience designing and executing sales enablement, content strategies and analyzing content strategy performance.\n- Expert written and verbal communicator, with the ability to articulate abstract concepts.\n- Ability to identify opportunities, develop project scope and independently lead ideation and execution. \n- Experience leading and collaborating across broader teams (Product, Sales, Marketing) to define product value propositions and GTM plans.\n- Confidence in crafting integrated marketing plans encompassing various channels.", "preferred": "- A deep understanding of the Mid-market industry, with specialty in non-commerce.\n- Experience at a startup or in an entrepreneurial environment in the tech industry."}, "skills": ["Content Strategy", "Sales Enablement", "Marketing Strategy", "Digital Marketing", "Campaign Management", "Content Creation", "Marketing Communications", "Project Management", "Teamwork", "Communication", "Leadership", "Strategic Thinking", "Data Analysis", "Product Marketing", "Customer Experience", "Growth Marketing", "Entrepreneurship"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3971870064"}