{"jobTitle": "Account Executive", "company": {"name": "Brex", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "117,600.00/yr - 147,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Why join us<br/><br/>Brex is the AI-powered spend platform. We help companies spend with confidence with integrated corporate cards, banking, and global payments, plus intuitive software for travel and expenses. Tens of thousands of companies from startups to enterprises — including DoorDash, Flexport, and Compass — use Brex to proactively control spend, reduce costs, and increase efficiency on a global scale.<br/><br/>Working at Brex allows you to push your limits, challenge the status quo, and collaborate with some of the brightest minds in the industry. We’re committed to building a diverse team and inclusive culture and believe your potential should only be limited by how big you can dream. We make this a reality by empowering you with the tools, resources, and support you need to grow your career.<br/><br/>Sales at Brex<br/><br/>The Sales team is the driving factor behind revenue for Brex and every member of our team directly affects our bottom line. We focus on generating new opportunities, acquiring new customers, and building even stronger relationships with our current customers. Our winning culture recognizes big team wins and celebrates individual accomplishments. We ensure that top performers are recognized and have built a competitive environment to motivate and unify the team.<br/><br/>What You’ll Do<br/><br/>As an Account Executive, you will be a part of a fast-paced upmarket sales team focused on sourcing net-new customers and generating revenue in the Growth and Mid-Market segments. This team is tasked with hunting exciting, growing, new clients for Brex and communicating the value of our industry-leading Financial Operating System (Corporate Credit Card, Expense Management, Travel, etc.). If you enjoy working in a creative, competitive environment while helping customers accelerate their growth, this role is for you!<br/><br/>Responsibilities<br/><br/><ul><li>Deal Cycle Management: Proactively identify and target potential customers while managing a high volume of sales deal cycles simultaneously, including prospecting, discovery, demo, and closing</li><li>Pipeline Management: Build and manage a robust sales pipeline, ensuring a steady flow of qualified leads and opportunities</li><li>Value Selling: Articulate the unique value proposition of Brex’s products and services, aligning solutions with customer needs, and solving complex business challenges</li><li>Problem Solving: Act as a trusted advisor to customers, addressing their pain points and delivering innovative solutions that drive business growth and value</li><li>Cross-Functional Collaboration: Collaborate effectively with cross-functional teams, including Sales Development, Product, Underwriting, and Pre-Sales, to ensure a seamless customer experience<br/><br/></li></ul>Requirements<br/><br/><ul><li>High-performing SDR/BDR background</li><li>1+ years of B2B SAAS closing experience, preferably in a hunter role </li><li>Familiarity selling SAAS products/solutions and effectively communicating the value/ROI</li><li>Consistent quota attainment and track record of being a top 10% performer</li><li>Bachelor’s degree preferred</li><li>Must be willing to work in office 2 days per week on Wednesday and Thursday<br/><br/></li></ul>Bonus points<br/><br/><ul><li>Familiarity selling financial software (Expense Management, ERP, AP Automation, T&amp;E, Accounting Software, etc.)<br/><br/></li></ul>Compensation<br/><br/>The expected OTE range for this role is $132,888 - $166,110. The starting wage will depend on a number of factors including the candidate’s location, skills, experience, market demands, and internal pay parity. The OTE figure listed here includes base salary and commissions, which may or may not be earned depending on performance. Depending on the position offered, equity and other forms of compensation may be provided as part of a total compensation package.<br/><br/><em>Please be aware, job-seekers may be at risk of targeting by malicious actors looking for personal data. Brex recruiters will only reach out via LinkedIn or email with a brex.com domain. Any outreach claiming to be from Brex via other sources should be ignored.</em>", "responsibilities": "Deal Cycle Management: Proactively identify and target potential customers while managing a high volume of sales deal cycles simultaneously, including prospecting, discovery, demo, and closing\nPipeline Management: Build and manage a robust sales pipeline, ensuring a steady flow of qualified leads and opportunities\nValue Selling: Articulate the unique value proposition of Brex’s products and services, aligning solutions with customer needs, and solving complex business challenges\nProblem Solving: Act as a trusted advisor to customers, addressing their pain points and delivering innovative solutions that drive business growth and value\nCross-Functional Collaboration: Collaborate effectively with cross-functional teams, including Sales Development, Product, Underwriting, and Pre-Sales, to ensure a seamless customer experience", "qualifications": {"required": "High-performing SDR/BDR background\n1+ years of B2B SAAS closing experience, preferably in a hunter role \nFamiliarity selling SAAS products/solutions and effectively communicating the value/ROI\nConsistent quota attainment and track record of being a top 10% performer\nBachelor’s degree preferred\nMust be willing to work in office 2 days per week on Wednesday and Thursday", "preferred": "Familiarity selling financial software (Expense Management, ERP, AP Automation, T&amp;E, Accounting Software, etc.)"}, "skills": ["SDR", "BDR", "SAAS", "Sales", "Financial Software"], "postedDate": "2 weeks ago", "benefits": "The expected OTE range for this role is $132,888 - $166,110. The starting wage will depend on a number of factors including the candidate’s location, skills, experience, market demands, and internal pay parity. The OTE figure listed here includes base salary and commissions, which may or may not be earned depending on performance. Depending on the position offered, equity and other forms of compensation may be provided as part of a total compensation package.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3972575003"}