{"jobTitle": "Account Executive, Enterprise", "company": {"name": "Roku", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "242,000.00/yr - $408,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Teamwork makes the stream work.<br/><br/><strong>Roku Is Changing How The World Watches TV<br/><br/></strong>Roku is the #1 TV streaming platform in the US, and we've set our sights on powering every television in the world. Roku pioneered streaming to the TV. Our mission is to be the TV streaming platform that connects the entire TV ecosystem. We connect consumers to the content they love, enable content publishers to build and monetize large audiences, and provide advertisers unique capabilities to engage consumers.<br/><br/>From your first day at Roku, you'll make a valuable - and valued - contribution. We're a fast-growing public company where no one is a bystander. We offer you the opportunity to delight millions of TV streamers around the world while gaining meaningful experience across a variety of disciplines.<br/><br/><strong>About The Team<br/><br/></strong>At Roku, we like to say that there are no bystanders, and that is as true in the advertising team as it is in any other facet of the company. We work together to ensure our clients understand this new world of advertising, that they are making the best possible decisions to support their own goals, and drive advertiser interest and engagement across the board. The Advertising Sales team is responsible for driving ad revenue with Advertisers and ultimately enabling our clients to reach their business objectives.<br/><br/><strong>About The Role<br/><br/></strong>The world is cutting the cord and streaming its TV online, a shift that has dramatically changed how advertisers target, reach and measure their preferred audiences in ways that broadcast TV and cable never could. In this new world, Roku has re-written the rules of modern advertising, and we are looking for great Account Executives who can partner with brands and show them how to best leverage this new advertising platform.<br/><br/>This position is on the front lines. You will be responsible for growing ad sales and custom content sponsorship revenue on the Roku platform supporting the Enterprise vertical.  You are driven to work independently and resourcefully manage many duties, including relationship building, media planning, developing sales proposals, presentations, marketing materials. You love to invent custom solutions and find ways to bring them to life with your partners.  The ideal candidate will be partnering with clients and agencies to develop meaningful advertising programs that propel businesses forward.<br/><br/>A background in video advertising and/or sponsorship sales is required.  Experience planning, buying or selling either broadcast television or digital media is a plus.  You clearly understand the landscape and have a point of view on how Roku creates value for partners.  You have a proven ability to develop a sales strategy, relationship map and business plans to help drive new revenue streams for the ad business. You are dedicated, comfortable with the intense focus, context switching and often long hours required to build something great. Ideally you have worked in a start-up environment and are confident operating amidst ambiguity. You are a fast learner and anxious to hit the ground running.<br/><br/>This is a crucial hire for Roku and an incredible opportunity for the right candidate looking to advance their career with a market leader in an exploding category.<br/><br/>For New York Only - The estimated annual salary for this position is between $242,000 - $408,000 annually.<br/><br/>Compensation packages are based on factors unique to each candidate, including but not limited to skill set, certifications, and specific geographical location.<br/><br/>This role is eligible for health insurance, equity awards, life insurance, disability benefits, parental leave, wellness benefits, and paid time off.<br/><br/>What you’ll be doing<br/><br/><ul><li>Achieving aggressive advertising revenue goals </li><li>Researching, developing, and pitching media plans to our top advertising partners across the Enterprise vertical </li><li>Presenting Roku product suite and selling in strategic opportunities </li><li>Proactively building and maintaining a pipeline of sales targets, contacts, and sales opportunities via Roku’s existing connections, leveraging your brand and agency connections with some cold calling </li><li>Providing campaign management, optimization, reporting, recaps, and lead upsell opportunities </li><li>Responding to RFPs, collaborating with editorial on sponsorable custom content solutions, support research in development of winning case studies </li><li>Building reliable and accurate revenue projections/forecasts </li><li>Expertly collaborating with cross-functional internal teams to service clients, build proposals and partner on strategies <br/><br/></li></ul>We’re excited if you have<br/><br/><ul><li>5+ years' experience in owning a book of business as Account Executive or similar </li><li>A successful track record in closing large, complex, and custom advertising partnerships with Fortune 500 clients and key stakeholders at their agencies</li><li>Understanding of the TV, digital, programmatic and/or ad tech ecosystem </li><li>Bachelor’s degree <br/><br/></li></ul><strong>Benefits<br/><br/></strong>Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.<br/><br/><strong>The Roku Culture<br/><br/></strong>Roku is a great place for people who want to work in a fast-paced environment where everyone is focused on the company's success rather than their own. We try to surround ourselves with people who are great at their jobs, who are easy to work with, and who keep their egos in check. We appreciate a sense of humor. We believe a fewer number of very talented folks can do more for less cost than a larger number of less talented teams. We’re independent thinkers with big ideas who act boldly, move fast and accomplish extraordinary things through collaboration and trust. In short, at Roku you'll be part of a company that's changing how the world watches TV. <br/><br/>We have a unique culture that we are proud of. We think of ourselves primarily as problem-solvers, which itself is a two-part idea. We come up with the solution, but the solution isn't real until it is built and delivered to the customer. That penchant for action gives us a pragmatic approach to innovation, one that has served us well since 2002. <br/><br/>To learn more about Roku, our global footprint, and how we've grown, visit https://www.weareroku.com/factsheet.<br/><br/>By providing your information, you acknowledge that you have read our Applicant Privacy Notice and authorize Roku to process your data subject to those terms.<br/><br/>", "responsibilities": "Achieving aggressive advertising revenue goals \nResearching, developing, and pitching media plans to our top advertising partners across the Enterprise vertical \nPresenting Roku product suite and selling in strategic opportunities \nProactively building and maintaining a pipeline of sales targets, contacts, and sales opportunities via Roku’s existing connections, leveraging your brand and agency connections with some cold calling \nProviding campaign management, optimization, reporting, recaps, and lead upsell opportunities \nResponding to RFPs, collaborating with editorial on sponsorable custom content solutions, support research in development of winning case studies \nBuilding reliable and accurate revenue projections/forecasts \nExpertly collaborating with cross-functional internal teams to service clients, build proposals and partner on strategies", "qualifications": {"required": "5+ years' experience in owning a book of business as Account Executive or similar \nA successful track record in closing large, complex, and custom advertising partnerships with Fortune 500 clients and key stakeholders at their agencies\nUnderstanding of the TV, digital, programmatic and/or ad tech ecosystem", "preferred": "Bachelor’s degree"}, "skills": ["Advertising", "Sales", "Media Planning", "Relationship Building", "Sales Proposals", "Presentations", "Marketing Materials", "Custom Solutions", "Client Management", "Agency Management", "Video Advertising", "Sponsorship Sales", "Broadcast Television", "Digital Media", "Sales Strategy", "Business Plans", "Revenue Generation", "Start-up Environment", "Ambiguity Tolerance", "Fast Learning"], "postedDate": "2 weeks ago", "benefits": "Roku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973058865"}