{"jobTitle": "Marketing Manager", "company": {"name": "Nulixir Inc.", "location": "Austin, Texas Metropolitan Area"}, "location": "Austin, Texas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Sales, and Business Development", "industry": "Food and Beverage Services, Pharmaceutical Manufacturing, and Technology, Information and Media", "description": "Welcome to the future of intelligent food! At Nulixir, we are revolutionizing the food and beverage industry with our breakthrough technology, Nusomes™. We specialize in delivering nutrient-packed, functional superfoods that taste great and enhance human health and well-being. Our innovation and sustainability practices are setting new standards in the market. Join us in our mission to redefine nutrition and wellness!\n\nRole Overview:\n\nAre you a creative powerhouse with a passion for cutting-edge technology and innovative marketing strategies? Do you thrive in a fast-paced, dynamic environment where your ideas can make a real impact? If so, Nulixir is looking for you! We are seeking an enthusiastic and visionary Marketing Manager to lead our marketing efforts and help us drive the next wave of growth.\n\n\nKey Responsibilities:\n\n<ul>\n<li><strong>Strategic Leadership</strong>: Develop and execute comprehensive marketing strategies to drive brand awareness, customer acquisition, and revenue growth.</li>\n<li><strong>Content Creation</strong>: Lead the creation of compelling content across all channels, including social media, email campaigns, and our website.</li>\n<li><strong>Campaign Management</strong>: Plan, implement, and monitor marketing campaigns, ensuring they align with our brand voice and business goals.</li>\n<li><strong>Market Analysis</strong>: Conduct market research to identify trends, customer needs, and competitive insights to inform marketing strategies.</li>\n<li><strong>Collaboration</strong>: Work closely with the sales, product, and R&amp;D teams to ensure cohesive messaging and alignment with overall business objectives.</li>\n<li><strong>Innovation</strong>: Stay ahead of industry trends and continuously explore new marketing avenues to keep Nulixir at the forefront of the market.</li>\n</ul>\n\n\nWhat We're Looking For:\n\n<ul>\n<li><strong>Experience</strong>: 5+ years in marketing, preferably within the food and beverage or tech industry.</li>\n<li><strong>Education</strong>: Bachelor's degree in Marketing, Business, or a related field.</li>\n<li><strong>Skills</strong>:</li>\n<li>Proven track record of developing and executing successful marketing strategies.</li>\n<li>Exceptional creativity and innovative thinking.</li>\n<li>Strong analytical skills with the ability to interpret data and make data-driven decisions.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Proficiency in digital marketing tools and platforms.</li>\n<li><strong>Passion</strong>: A genuine passion for health, wellness, and sustainable practices.</li>\n</ul>\n\n\nWhy Nulixir?\n\n<ul>\n<li><strong>Innovation at Its Best</strong>: Be part of a team that is pioneering the future of food technology.</li>\n<li><strong>Growth Opportunities</strong>: We invest in your personal and professional growth.</li>\n<li><strong>Dynamic Environment</strong>: Work in a fast-paced, collaborative, and inclusive culture.</li>\n<li><strong>Impact</strong>: Make a real difference in the health and well-being of people globally.</li>\n</ul>\n\n\n\n\n<strong>About Nulixir</strong>\n\nNulixir is defining the fundamentals of Nutrition Precision for the future generations.\n\nIn the heart of our founding team lies a shared past deeply rooted in Cancer Research at some of the most prestigious institutions worldwide. Our journey began in the sterile environments of laboratories, where we dedicated ourselves to understanding the intricacies of one of humanity’s most formidable adversaries—cancer. Surrounded by the brightest minds and cutting-edge technology, we pursued breakthroughs in pharmaceuticals, aiming to extend lifespans and enhance the quality of life for those battling this relentless disease. Yet, as we delved deeper into the science of healing, a transformative realization dawned upon us: the most potent medicine and the key to preemptive health care does not always come in the form of pills or therapies, but from the very sustenance that fuels us—our food.\n\nDriven by a pioneering spirit and a fervent desire to make a more encompassing impact on human health, we embarked on a bold transition from pharma to food. Our mission transcended the confines of combating illness to redefining wellness at its core. We envisioned a world where daily nutrition does not merely serve to satisfy hunger but acts as a foundational pillar for disease prevention and optimal health. This vision is rooted in the ancient wisdom that “true medicine is our daily food,” a principle that guides our journey towards revolutionizing what we define as “food”.\n\nIn this culture deck, we outline the principles and values that define us—not just as a company, but as a movement. We are united by a belief in the power of food to transform lives, a commitment to innovation that marries science with nature, and a dedication to creating products that do more than nourish—they empower and heal. Our journey from cancer researchers to pioneers in the food industry underscores a commitment to preventative health and a passion for harnessing the potential of food as the ultimate form of medicine. Together, we are not just changing diets; we are reshaping the Future of Intelligent Food for generations to come.\n\nAt Nulixir, our mission is to shape the Future of Intelligent Food through cutting-edge bio-nanotechnology. Our mission enables us to serve as the bridge that seamlessly connects the sophistication of pharmaceutical innovation with the essential footprint of food. We are committed to pioneering a new era where advanced pharmaceutical principles converge with the inherent nourishment of food, redefining the boundaries of health and well-being.\n\n\n\n<strong>Nulixirians' Culture</strong>\n\nWe recruit, promote, and reward based off of our five core values:\n\n<ul>\n<li><strong>Sleeves Up</strong> - At Nulixir, we provide the autonomy and creativity needed to own your role, iterate where needed and drive impact on a massive scale.</li>\n<li><strong>100% Transparency</strong> - Nulixir is passionate about open feedback at all levels of the company. This allows us to fail fast, create in real time and build an open company culture.</li>\n<li><strong>Be Defiantly Great </strong>- We are defiant, that’s in our lifeblood, we accomplish what other people think are impossible. Challenging the status quo is our lifeblood.</li>\n<li><strong>Unconditional Empathy</strong> - Our customers are real people with real business needs, and we are here to listen and tackle accordingly. If we care and respect each other, there is no challenge we can’t overcome.</li>\n<li><strong>Be the solution, not just the critic</strong> - take ownership and drive collaboration. We work together and we build together.</li>\n</ul>", "postedDate": "1 week ago", "skills": ["Marketing", "Food and Beverage", "Technology", "Digital Marketing", "Brand Management", "Content Marketing", "Social Media Marketing", "Market Research", "Campaign Management", "Strategic Planning", "Leadership", "Communication", "Collaboration", "Innovation", "Health and Wellness", "Sustainable Practices"], "url": "https://www.linkedin.com/jobs/view/3973991474"}