{"jobTitle": "Account Coordinator", "company": {"name": "International Cosmetics & Perfumes, Inc.", "location": "East Rutherford, NJ"}, "location": "New Jersey", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>TITLE: </strong>Account Coordinator<br/><br/><strong>REPORTS TO: </strong>Regional Sales Director<br/><br/><strong>FLSA: </strong>Exempt<br/><br/><strong>LOCATION: New Jersey<br/><br/></strong><strong>JOB OVERVIEW: </strong>This full-time role is responsible for driving and building retail sales through events and on-the-floor selling.By embracing the Customer Experience and leading by example, this position will focus on<br/><br/>achieving the sales goal for the counters on behalf of the International Cosmetics &amp; Perfumes (ICP) brands – specifically, The House of Creed. This role will provide outstanding client service through proactivity, creativity, and organization. This person will also promote and maintain the intrinsic company culture that fosters the firm’s core values of: Transparency, Recognition, Accountability, and Communication.<br/><br/><strong>CORE RESPONSIBILITIES: </strong>Works directly with Regional Sales Director to execute sales strategy of the company and brands, including but not limited to:<br/><br/><strong>Sales Responsibilities<br/><br/></strong><ul><li>Champion and drive The Customer Experience by being an example to the Coop and ICP Product Specialists</li><li>Work side-by-side with Product Specialist to identify opportunities for sales and elevated client experience</li><li>Drive retail sales plan at the store level by exhibiting accountability for the overall function of the Creed Sales Team</li><li>Develop Product Specialists to achieve personal sales goals, in part by developing relationships throughout the store to promote ICP brands and intersell</li><li>Execute action plans based on side-by-side to meet seasonal and yearly goals</li><li>Act as Brand Ambassador on behalf of Creed by part taking in monthly morning meetings; Department Wide Meetings, Store Wide Meetings, and Out of Home-base Meetings in conjunction with the ICP Management Team and store PS</li><li>Responsible for managing T &amp; E budget, as per guidelines from supervisor and submitting expenses in a timely manner</li><li>Establish partnerships with store management and elevated services, (personal shoppers, store stylists, digital stylists, Bridal registry)</li><li>Responsible for ensuring all Fragrance merchandising guidelines and visual merchandising elements are properly executed</li><li>Accountable for event presell and set up in partnership with store teams. </li><li>Partner with New York Office Team on any store needs, (collateral, visual, stock, etc..)</li><li>Onboard and train new hires. </li><li>Execute brand and product launch trainings. </li><li>Recruit and hire for open positions<br/><br/></li></ul><strong>REQUIREMENTS:<br/><br/></strong><ul><li>2 - 3 years of retail sales experience, demonstrating progression in positions that drive retail sales</li><li>Excellent selling, event planning and execution skills, to be used to continually educate and motivate the sales force</li><li>Self-motivated, results-oriented, creative thinker</li><li>Excellent verbal and written communication skills, including strong interpersonal skills</li><li>Proficiency in Excel, Microsoft Word, and navigating online reporting. </li><li>Strong attention to detail and organizational skills</li><li>Physical ability to move about in store, kneeling, stooping, using stairs, carrying, bending, stretching, and twisting, lifting to 40 lbs</li><li>Flexible and adaptable to changing priorities with the ability and willingness to multi-task<br/><br/></li></ul><strong>Compensation includes competitive salary, subsidized health benefits, generous PTO schedule and 401K plan.<br/><br/></strong><strong><em>ICP is an Equal Opportunity Employer. All applicants are considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.<br/><br/></em></strong>Powered by JazzHR<br/><br/>1xZ3DrjzBt", "responsibilities": "Works directly with Regional Sales Director to execute sales strategy of the company and brands, including but not limited to:<br/><br/><strong>Sales Responsibilities<br/><br/></strong><ul><li>Champion and drive The Customer Experience by being an example to the Coop and ICP Product Specialists</li><li>Work side-by-side with Product Specialist to identify opportunities for sales and elevated client experience</li><li>Drive retail sales plan at the store level by exhibiting accountability for the overall function of the Creed Sales Team</li><li>Develop Product Specialists to achieve personal sales goals, in part by developing relationships throughout the store to promote ICP brands and intersell</li><li>Execute action plans based on side-by-side to meet seasonal and yearly goals</li><li>Act as Brand Ambassador on behalf of Creed by part taking in monthly morning meetings; Department Wide Meetings, Store Wide Meetings, and Out of Home-base Meetings in conjunction with the ICP Management Team and store PS</li><li>Responsible for managing T &amp; E budget, as per guidelines from supervisor and submitting expenses in a timely manner</li><li>Establish partnerships with store management and elevated services, (personal shoppers, store stylists, digital stylists, Bridal registry)</li><li>Responsible for ensuring all Fragrance merchandising guidelines and visual merchandising elements are properly executed</li><li>Accountable for event presell and set up in partnership with store teams. </li><li>Partner with New York Office Team on any store needs, (collateral, visual, stock, etc..)</li><li>Onboard and train new hires. </li><li>Execute brand and product launch trainings. </li><li>Recruit and hire for open positions<br/><br/></li></ul>", "qualifications": {"required": "2 - 3 years of retail sales experience, demonstrating progression in positions that drive retail sales, Excellent selling, event planning and execution skills, to be used to continually educate and motivate the sales force, Self-motivated, results-oriented, creative thinker, Excellent verbal and written communication skills, including strong interpersonal skills, Proficiency in Excel, Microsoft Word, and navigating online reporting., Strong attention to detail and organizational skills, Physical ability to move about in store, kneeling, stooping, using stairs, carrying, bending, stretching, and twisting, lifting to 40 lbs, Flexible and adaptable to changing priorities with the ability and willingness to multi-task"}, "skills": ["Retail Sales", "Event Planning", "Customer Service", "Communication", "Microsoft Excel", "Microsoft Word"], "postedDate": "1 month ago", "benefits": "Compensation includes competitive salary, subsidized health benefits, generous PTO schedule and 401K plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3973843242"}