{"jobTitle": "MANAGER - TRANSPORTATION & LOGISTICS", "company": {"name": "Hard Rock International", "location": "Davie, FL"}, "location": "Davie, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "Location : Location US-FL-DAVIE<br/><br/><strong>Overview<br/><br/></strong>The Transportation &amp; Logistics Manager is dedicated to creating an outstanding customer experience by providing reliable delivery solutions from the source to the Cafe venue. Responsibilities include import compliance of inbound shipments into customs of USA, EU and UK, efficiently manage distribution network, develop strategic relationships with 3 PLs and transportation partners, and provide daily support to cafe retail operations in USA, EU and UK. Further duties include P.O. tracking, inventory management, extensive data analysis, invoice reviews and management of Merchandise Logistics P&amp;L.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> Essential duties include, but are not limited to: <br/><br/></strong><ul><li> Import Compliance of Inbound Shipments </li><li> Supports merchandise vendors to meet HRI Cross-Border Document Guidelines and HRI VCM prior to shipment </li><li> Works closely with HRI brokers to immediately attend customs issues or concerns </li><li> Supports Memorabilia team </li><li> Subject Matter Expert of domestic and international shipping to internal teams </li><li> Manages all aspects of company 3PL warehouse facilities </li><li> 3PL Strategic Relationship Management </li><li> Leads weekly business calls with 3PL teams to view inbound P.O.’s, promptly communicate local HR Cafes’ needs, review KPIs and execute allocation schedule </li><li> Drives operational excellence via KPI management and Dashboard reporting to ensure efficient and timely supply chain accuracy of retail and e-comm (receiving, storage, allocation, distribution) to meet business demands. </li><li> Partners with I/T and Planning team to support 3PL’s systems integration, procedures and compliance </li><li> Develop KPIs to evaluate cost/performance of 3PL’s across distribution network. </li><li> Schedules visits to 3PL facilities as directed. </li><li> Transportation Management </li><li> Executes weekly allocation schedules for EU, UK and USA with 99% OTD </li><li> Forwarder and transportation carrier strategic relationship management </li><li> Updates Open P.O. Report and provides DCs with estimated arrival dates, advises buyers of delays, and projects merchandise availability to retail operations team </li><li> Evaluates air/ocean freights, transit times, onboards carriers, monitors performance for international inbound, outbound LTL/FTL, and parcel transportation services for all shipping needs of retail and e-comm merchandise, and cafe supplies </li><li> Provides tracking of inbound and outbound shipments </li><li> Maintains VCM relating to import compliance, freight and distribution center needs </li><li> Inventory Management </li><li> Assures prompt and accurate receipt of P.O.’s at 3PL facilities. </li><li> Records and reports weekly receipts, inventory discrepancies and adjustments </li><li> Responsible for authorizing Work Orders for inspections, re-work, cycle counts and destruction. </li><li> Align Product Development with 3PL when special handling/storage is required </li><li> Monitors “Audit” bin. </li><li> Leads inventory analysis with internal teams, reconciliation reports </li><li> Manages Cycle Counts at 3PL facilities </li><li> Execute annual Physical Inventory at each 3PL facility. Updates and maintains DC Inventory SOP </li><li> P&amp;L Management </li><li> Works closely with A/P to review invoices, monthly accrual and analyze expenditures </li><li> Reviews 3PL partner invoices for payment, authorization and G/L account coding. </li><li> Review Transportation invoices for payment, authorization and G/L account coding. </li><li> Review Import Duty invoices for HS classifications, country of origin, authorization and G/L account coding and provide corresponding customs entry form. </li><li> Charge domestic vendors 50% of delivery freight </li><li> Charge vendors for 3PL costs of non-compliance </li><li> Calculate shrink or surplus from annual warehouse physical inventories <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor’s Degree </li><li> 5-10 years progressive experience in logistics, 3PL operations </li><li> Import/Export, International Business experience a must </li><li> Strong communication, attention to detail, deadline-driven and goal oriented </li><li> Excel skills: Pivot tables, Dashboards </li><li> Ability to collaborate cross functionally and motivate at all levels </li><li> Ability to think critically and strategically in a high energy, fast paced environment </li><li> Experience with e-comm international shipping in both DDP and DDU </li><li> Experience with Rate Resellers and rate shopping solutions a plus <br/><br/></li></ul>#IndeedHRI<br/><br/><strong> #zipcorporate <br/><br/></strong>Application FAQs<br/><br/>Software Powered by iCIMS<br/><br/>www.icims.com", "postedDate": "4 days ago", "skills": ["Import/Export", "International Business", "Logistics", "3PL Operations", "Excel", "Pivot Tables", "Dashboards", "Communication", "Deadline-Driven", "Goal Oriented", "Collaboration", "Motivation", "Critical Thinking", "Strategic Thinking", "E-comm International Shipping", "DDP", "DDU", "Rate Resellers", "Rate Shopping Solutions"], "url": "https://www.linkedin.com/jobs/view/3973398212"}