{"jobTitle": "Administrative Assistant", "company": {"name": "Major League Baseball (MLB)", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Spectator Sports", "description": "Seeking a Legal Department Administrative Assistant to manage and execute administrative, project and senior-level support while exercising a high level of professionalism, discretion, attention to detail and responsiveness in a fast-paced environment.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage communications for multiple lawyers including taking and conveying messages, providing reminders and following-up on open matters</li><li>Manage group and/or individual calendars, including scheduling, planning and coordinating calls and meetings</li><li>Create, edit and circulate documents, including letters, legal memos and other correspondence</li><li>Assist in the preparation, assembly and distribution of materials for board and committee meetings (e.g., agendas, presentations, minutes, etc.)</li><li>Coordinate logistics for events, arrange travel plans and prepare and submit expense reports</li><li>Administer and file documents and maintain document database</li><li>Manage process of sending and receiving contracts to internal clients and external parties</li><li>Oversee and manage process for execution of agreements</li><li>Process and ensure payment of invoices</li><li>Provide support for legal department projects</li><li>Perform related duties as required<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Bachelor’s Degree and a minimum of three years of administrative or similar experience</li><li>Prior experience supporting lawyers and/or senior-level executives preferred</li><li>Excellent organization, communication, writing and multi-tasking skills</li><li>Demonstrated time management skills including the ability to meet strict deadlines</li><li>Strong problem solving, resourceful and innovative thinking skills</li><li>Excellent and professional interpersonal skills; team-oriented demeanor</li><li>Excellent computer aptitude and advanced proficiency with MS Office Suite. Experience with Adobe Acrobat, Workshare, Concur, CounselLink, DocuSign, or other similar contract, document and electronic management systems</li><li>Ability to perform duties while maintaining the highest level of confidentiality</li><li>Available to work overtime</li><li>Location: NYC office; Full-Time in-office position<br/><br/></li></ul><strong>Why MLB?<br/><br/></strong>Major League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of opportunity, collaboration, and professionalism. The professionals who are most successful at MLB take initiative, know how to identify and solve problems, put the team first, and work collaboratively. For those who are ready to join the “Major Leagues” of their careers, MLB takes the same approach as they do with their players: striving to empower their own “workforce athletes” to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are ready to step up to the plate and continue transforming America’s pastime to best serve its fans for decades to come.<br/><br/>MLB’s vision is to be the global sport of choice for youth to play, fans of all backgrounds to enjoy and a desired destination for employment.<br/><br/>With a belief that the journey to growth and greatness is ongoing, MLB gives employees the opportunity to continue learning and honing their skills with programs such as: tuition reimbursement; mentorship programs; lunch and learns; online course subscriptions; paid industry certifications; business resource groups; and more.<br/><br/>MLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!<br/><br/>Are you ready to Step Up to the Plate? Apply below!<br/><br/>Per the NYC pay transparency law, the hiring range for this position is $67,500 - $77,500.<br/><br/>As a candidate for this position, your salary and related elements of compensation will be contingent upon your work experience, education, skills and any other factors Major League Baseball (MLB) considers relevant to the hiring decision. In addition to your salary, MLB believes in providing a competitive compensation and benefits package for its employees. MLB offers employees a full range of best in class benefits with no employee contributions towards medical, dental, and vision coverage premiums, as well as incentive and recognition programs, life insurance and automatic employer 401k contributions. All benefits are subject to eligibility requirements and the terms of official plan documents which may be modified or amended from time to time.<br/><br/>If you are interested in joining our team and require a reasonable accommodation to assist with any part of the application and/or interview process, please contact us by email at: accommodations@mlb.com", "responsibilities": "Manage communications for multiple lawyers including taking and conveying messages, providing reminders and following-up on open matters\nManage group and/or individual calendars, including scheduling, planning and coordinating calls and meetings\nCreate, edit and circulate documents, including letters, legal memos and other correspondence\nAssist in the preparation, assembly and distribution of materials for board and committee meetings (e.g., agendas, presentations, minutes, etc.)\nCoordinate logistics for events, arrange travel plans and prepare and submit expense reports\nAdminister and file documents and maintain document database\nManage process of sending and receiving contracts to internal clients and external parties\nOversee and manage process for execution of agreements\nProcess and ensure payment of invoices\nProvide support for legal department projects\nPerform related duties as required", "qualifications": {"required": "Bachelor’s Degree and a minimum of three years of administrative or similar experience\nPrior experience supporting lawyers and/or senior-level executives preferred\nExcellent organization, communication, writing and multi-tasking skills\nDemonstrated time management skills including the ability to meet strict deadlines\nStrong problem solving, resourceful and innovative thinking skills\nExcellent and professional interpersonal skills; team-oriented demeanor\nExcellent computer aptitude and advanced proficiency with MS Office Suite. Experience with Adobe Acrobat, Workshare, Concur, CounselLink, DocuSign, or other similar contract, document and electronic management systems\nAbility to perform duties while maintaining the highest level of confidentiality\nAvailable to work overtime\nLocation: NYC office; Full-Time in-office position", "preferred": ""}, "skills": ["Communication", "Problem Solving", "Time Management", "Microsoft Office", "Adobe Acrobat", "Workshare", "Concur", "CounselLink", "DocuSign"], "postedDate": "2 weeks ago", "benefits": "MLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!", "remoteWork": "No", "salary": {"amount": "67,500 - 77,500", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3973689755"}