{"jobTitle": "Shopper Marketing Manager", "company": {"name": "Nutrabolt", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "Who We Are:\n\nNutrabolt is a fast-growing, global active health and wellness company with a portfolio of market leading performance-oriented brands that energize and fuel active lifestyles. The company's disruptive and innovative products compete in the Functional Beverage and Active Nutrition segments, under three consumer-loved brands: C4® (one of the fastest-growing energy drink brands in the United States and the #1 selling global pre-workout brand), XTEND® (the #1 post-workout recovery brand in the United States), and Cellucor® (an award-winning sports nutrition brand created in 2002).\n\nSince its founding 20 years ago, Nutrabolt has set out to meet the discerning needs of performance athletes and fitness enthusiasts, while appealing beyond this core group to include consumers around the globe who are making healthy, active living a daily priority.\n\nAs a Certified Great Place to Work, Top Workplaces USA honoree, Fortune Best Workplace in Texas, and more – Nutrabolt cares deeply about our people, planet, and the communities we serve. Here, our teammates are united by our mission, and take ownership in creating a healthy workplace environment that promotes strong bodies, clear minds, and a culture of respect and belonging for all.\n\n*Note to applicants: This role has the potential to work remote outside of Austin.\n\n*Who You Are: As Nutrabolt's Shopper Marketing Manager, you will own the Shopper Marketing strategy and development for convenience/ drug/dollar and specialty channels. You will develop programming that drives short-term and long-term sales, as well as builds our brand equity.\n\n\n\n*This role is eligible to participate in our Management Bonus Plan.\n\n\n\n*What You're Good At:\n\n<ul>\n<li>Understanding the shopper journey and incorporating insights across retailer, channel, brand, and shopper</li>\n<li>Using integrated marketing plans to identify touchpoints that can seamlessly facilitate shopper engagement across various classes of trade</li>\n<li>Leveraging brand assets and programming and translating those into retailer-specific shopper programs to drive velocities and gain off-shelf placement</li>\n<li>Developing KPIs to determine program success and improve on future programming</li>\n<li>Analyzing and reporting on how well each program initiative achieves its specific objectives</li>\n<li>Strong understanding of retailer media and how to reach shoppers across each touchpoint</li>\n<li>Identifying key 3rd party Shopper Marketing partners, building annual plans and managing relationships with these partners</li>\n<li>Building and maintaining relationships across sales, brand, trade, and category management</li>\n<li>Forging strong partnerships with retailer marketing counterparts</li>\n<li>Experience in developing multicultural programs is a plus</li>\n<li>Being the voice of Shopper Marketing in customer calls/line reviews and internal meetings</li>\n<li>Strong budget management: managing the shopper/omni budget to ensure accuracy and fiscal responsibility</li>\n<li>In this role your goals and KPIs will be focused around:</li>\n<ul>\n<li>Sales-based metrics (e.g post-event sales, share growth)</li>\n<li>Engagement-based (e.g digital clicks, trade/display support)\n</li>\n</ul>\n</ul>\n*What You Contribute:\n\n<ul>\n<li>Ideally has 3+ years of experience in shopper, trade and/or brand</li>\n<li>Previous knowledge/experience working with the convenience and or grocery/dollar classes of trade.</li>\n<li>Ability to thrive in a dynamic, fast-paced environment under pressure</li>\n<li>Experience juggling multiple priorities across various retailers simultaneously</li>\n<li>Strong communication skills, comfortable with presenting/public speaking</li>\n<li>Computer proficiency in Microsoft Word, Excel, and Outlook</li>\n<li>Experience working with Consumer-Packaged Goods strongly preferred</li>\n<li>Ability to travel (20% - 30%) as needed\n</li>\n</ul>\n*Why Nutrabolt?\n\nWellness Benefits\n\nNutrabolt cares about our teammates' physical, mental, and financial wellness by providing benefits like: competitive health insurance, life insurance, mental wellness programs, 401K matching, and a Lifestyle Spending Account.\n\nLifestyle Perks\n\nWe offer unlimited vacation paid time off and volunteer time off. You'll get discounts on C4 Energy, Cellucor, and XTEND products, too!\n\nFamily Support\n\nWe want you to reach your full potential at work by taking care of all loved ones at home. We provide paid parental leave, in addition to reimbursement for expenses related to childcare, fertility treatments, legal fees, and more through our Lifestyle Spending Account.\n\n*Employment Type:* Full-time\n\nPlease review our CCPA policy here.\n\n*By providing your phone number, you consent to receiving text communications related to your job application via SMS from Nutrabolt. Applicable messaging and data rates may apply. You may opt out at any time by replying STOP. View our terms of use for additional details.*", "responsibilities": "As Nutrabolt's Shopper Marketing Manager, you will own the Shopper Marketing strategy and development for convenience/ drug/dollar and specialty channels. You will develop programming that drives short-term and long-term sales, as well as builds our brand equity.", "qualifications": {"required": "Ideally has 3+ years of experience in shopper, trade and/or brand\nPrevious knowledge/experience working with the convenience and or grocery/dollar classes of trade.\nAbility to thrive in a dynamic, fast-paced environment under pressure\nExperience juggling multiple priorities across various retailers simultaneously\nStrong communication skills, comfortable with presenting/public speaking\nComputer proficiency in Microsoft Word, Excel, and Outlook\nExperience working with Consumer-Packaged Goods strongly preferred\nAbility to travel (20% - 30%) as needed", "preferred": null}, "skills": ["Shopper Marketing", "Retailer Media", "Shopper Engagement", "Brand Equity", "KPI Development", "Program Analysis", "Retailer Relationships", "Budget Management", "Sales Metrics", "Engagement Metrics", "Consumer-Packaged Goods"], "postedDate": "1 month ago", "applicationDeadline": null, "benefits": "Wellness Benefits\n\nNutrabolt cares about our teammates' physical, mental, and financial wellness by providing benefits like: competitive health insurance, life insurance, mental wellness programs, 401K matching, and a Lifestyle Spending Account.\n\nLifestyle Perks\n\nWe offer unlimited vacation paid time off and volunteer time off. You'll get discounts on C4 Energy, Cellucor, and XTEND products, too!\n\nFamily Support\n\nWe want you to reach your full potential at work by taking care of all loved ones at home. We provide paid parental leave, in addition to reimbursement for expenses related to childcare, fertility treatments, legal fees, and more through our Lifestyle Spending Account.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3974366512"}