{"jobTitle": "Event Coordinator Remote", "company": {"name": "Erika4Travel", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "If you are searching for your next adventure in your professional life, ifyou have a talent for making things happen, we have the perfect opportunity for you. we may have the perfect opportunity for you as a Remote Event Sales Coordinator. You will be able to make clients dream events and destinations become a reality. You will learn about the inner workings of the industry and can even access exclusive perks to make plans for yourself. your primary goal will be to deliver outstanding service to clients.<br/><br/><strong>Responsibilities &amp; Roles<br/><br/></strong><ul><li>Be a team player, willing to help out when needed</li><li>Plan spectacular trips for corporate and leisure clients</li><li>Handling booking airfare, car rental, cruises, hotels, ticket and/or event sales</li><li>Handle presenting presentations of services to other clients</li><li>Review and respond to all emails and phone calls within a timely manner</li><li>Follow all company rules and guidelines</li><li>- Offer exceptional remote customer service throughout the booking process, addressing inquiries, concerns, and providing support to enhance the villa vacation experience</li><li>We offer mentorship and guidance to help you succeed in your role and create outstanding events for our clients</li><li>This is a remote position, providing you the flexibility to work from the comfort of your own home or any location with an internet connection. You can balance your work and personal life while delivering exceptional travel experiences to your clients</li><li>We believe that your dedication and expertise should be rewarded</li><li>You'll have the opportunity to get the highest commission rates in the travel industry, ensuring that your hard work is highly rewarded</li><li>This role offers more than a job; it's a chance to build your own travel planning business within our organization. This is a business opportunity in which with your dedication and hard work can shape your financial future and explore career advancement opportunities within our company</li><li>We're committed to your success. Our comprehensive training and ongoing support will equip you with the skills and knowledge needed to excel in your role and grow your travel planning business</li><li>Provide outstanding customer service and attention to detail</li><li>Utilize time management skills in order to research, plan, and book vacation packages for clients</li><li>- Collaborate with villa owners, property managers, and local partners to secure services, accommodations, and special arrangements for clients</li><li>- Stay informed about luxury travel trends, emerging villa destinations, and unique villa experiences to provide clients with the most relevant and captivating recommendations</li><li>Effectively manage time wisely</li><li>Participate in familiarization trips/tours</li><li>Attend ongoing trainings as needed</li><li>Obtain certification to book travel within 5-days upon starting</li><li>Maintain appropriate documentation of clients forms</li><li>Stay active on social media platforms to reach clients</li><li>Participate in group meetings/trainings</li><li>Verify all information from clients</li><li>Be a self-starter/motivated</li><li>Business opportunity</li><li>Meet timely deadlines set by the team</li><li>Exceed clients expectations</li><li>Anticipate client needs when planning trips</li><li>Prepare, plan, and sell travel (including but not limited to airline, car rental, cruises, hotels, and ticket/events)</li><li>Handle all planning of ground transportation to and from accommodations for clients</li><li>Offer insurance options to clients to cover any unforeseen changes in plans</li><li>Provide exceptional service to clients</li><li>Work well in a group/team setting<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Strong ability to communicate</li><li>Excellent and quick decision-making skills</li><li>Good management skills</li><li>Great commission</li><li>Legally authorized to work in the United States</li><li>Must Live in the United States</li><li>Have internet</li><li>Have computer/laptop/phone</li><li>Must be 18+ years old<br/><br/></li></ul>Powered by JazzHR<br/><br/>h5Z9lSPZCs", "postedDate": "1 month ago", "remoteWork": "Yes", "skills": [], "url": "https://www.linkedin.com/jobs/view/3974301096"}