{"jobTitle": "Supply Manager", "company": {"name": "Pero Family Farms Food Company LLC", "location": "Delray Beach, FL", "industry": "Food Production"}, "location": "Delray Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Food Production", "description": "<strong>Full-Time | Onsite<br/><br/></strong><strong>Company Summary<br/><br/></strong><strong>Pero Family Farms</strong> is a market share leader with over a century of dedication, commitment, and integrity. Operating since 1908, Pero is the farm trusted by retailers and consumers alike. We are a fully integrated farming operation, with departments that specialize in organic farming, logistics, global supply chain management, national sales operations, food processing operations, and strategic marketing functions. Our operation includes over 35,000 acres spanning across the East Coast of the United States from Florida to New York, with distribution and production facilities in several different states. We pride ourselves in maintaining a strong family heritage and tradition that has been dedicated to quality, innovation, and excellent customer service that has been feeding America’s families for over a century. Our family’s passion for farming remains unwavering, with a vision to continue the tradition for many generations to come, whilst maintaining the reverence and trust it has established with the American consumer.<br/><br/>As we expand our offering to include an assortment of organic vegetable options; we have become one of the largest organic vegetable growers in the country and we are looking to grow our workforce family. Join us in continuing and strengthening our position as a market share leader dedicated and trusted by retailers and consumers alike.<br/><br/><strong>Position Summary<br/><br/></strong>The Supply Manager’s main responsibility is to manage the flow of all assigned produce items procured from either domestic or imported sources. This position reports to the Director of Supply and works closely with the leaders of all the S&amp;OP departments. This position will require periodic travel to multiple growing regions throughout the year as well as to other Pero locations as the company deems necessary. The ideal candidate will have experience with fresh produce.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Develops and innovates sourcing strategy for assigned commodities</li><li>Negotiate raw product contracts with suppliers based on commodity specifications</li><li>Integrate new suppliers into our network with the collaboration of the Quality Assurance Team in order to help them to reach the level of excellence required by company standards</li><li>Expand current grower relations to keep portfolio balanced and diversified</li><li>Maintain Pero standard of quality and food safety throughout the network</li><li>Facilitate targeted deliveries of raw product with the Logistics Team and Production</li><li>Monitor daily quality inspection reports with the QA Team</li><li>Analyze daily inventory levels to maintain freshness and ease the flow of materials</li><li>Communicate with the Sales team to ensure all variances are understood</li><li>Prepare assigned commodity update reports of volume, price, and availability for weekly review</li><li>Responsible for maintaining budgetary profit margins and improving costs on assigned commodities</li><li>Participate with growers, finance, sales/marketing, R&amp;D and project managers with new product development and launch<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor’s Degree or equivalent industry experience</li><li>Minimum of 2+ years in procurement or related field</li><li>Computer skills:</li><ul><li>Basics: Microsoft Office Suite, strong emphasis in Excel</li><li>Industry Specific: ERP Software; Famous, Forecasting Software</li></ul><li>Experience in the CPG space, preferably in fresh produce is required</li><li>Food Safety and Quality regulations: Primus, BRC, HAACP, GMP, GSFI<br/></li></ul><strong>Company Benefits/Perks<br/><br/></strong><ul><li>401(k)</li><li>Health, Dental, Vision Insurance and more</li><li>Paid Time Off (PTO)</li></ul>", "responsibilities": "The Supply Manager’s main responsibility is to manage the flow of all assigned produce items procured from either domestic or imported sources. This position reports to the Director of Supply and works closely with the leaders of all the S&amp;OP departments. This position will require periodic travel to multiple growing regions throughout the year as well as to other Pero locations as the company deems necessary. The ideal candidate will have experience with fresh produce.", "qualifications": {"required": "Bachelor’s Degree or equivalent industry experience, Minimum of 2+ years in procurement or related field, Computer skills: Basics: Microsoft Office Suite, strong emphasis in Excel, Industry Specific: ERP Software; Famous, Forecasting Software, Experience in the CPG space, preferably in fresh produce is required, Food Safety and Quality regulations: Primus, BRC, HAACP, GMP, GSFI"}, "skills": ["Microsoft Office Suite", "Excel", "ERP Software", "Famous", "Forecasting Software", "CPG", "Fresh Produce", "Primus", "BRC", "HAACP", "GMP", "GSFI"], "postedDate": "1 month ago", "benefits": "401(k), Health, Dental, Vision Insurance and more, Paid Time Off (PTO)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3974599620"}