{"jobTitle": "Bookkeeper - Las Vegas, NV - Remote | WFH", "company": {"name": "Get It Recruit - Finance", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "25.00 to 28.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Human Resources Services", "description": "We are a leading public accounting firm seeking a proactive and dynamic individual for a remote, part-time full charge bookkeeper position. This role involves preparing accounting and financial reports, recording transactions across all ledgers, reconciling accounts, and assisting with general accounting tasks. Additionally, you will handle payroll and sales/use tax returns.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li> Prepare accounting and financial reports</li><li> Record financial transactions and reconcile accounts</li><li> Assist with journal entries and general accounting duties</li><li> Prepare payroll and sales/use tax returns<br/><br/></li></ul><strong>Required Skills And Qualifications<br/><br/></strong><ul><li> Minimum 8 years of bookkeeping experience</li><li> Expertise in QuickBooks</li><li> Proficiency in Microsoft Office (Outlook, Word, Excel) and other computerized software</li><li> Strong organizational skills with the ability to manage multiple projects and meet deadlines</li><li> Excellent communication skills, both verbal and written</li><li> Team-oriented with the ability to work effectively with diverse personalities</li><li> Professional, dependable, detail-oriented, and motivated self-starter</li><li> Ability to work independently with minimal supervision and review own work thoroughly<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Previous experience in public accounting</li><li> Successful completion of the firm's bookkeeping exam and background check<br/><br/></li></ul>Job Type: Part-time, hourly position (15 - 20 hours per week) with potential for full-time conversion<br/><br/>Pay: $25.00 to $28.00 per hour, depending on experience<br/><br/>Schedule: Flexible schedule, Monday to Friday (PST)<br/><br/>Employment Type: Part-Time", "responsibilities": "Prepare accounting and financial reports, recording transactions across all ledgers, reconciling accounts, and assisting with general accounting tasks. Additionally, you will handle payroll and sales/use tax returns.", "qualifications": {"required": "Minimum 8 years of bookkeeping experience, Expertise in QuickBooks, Proficiency in Microsoft Office (Outlook, Word, Excel) and other computerized software, Strong organizational skills with the ability to manage multiple projects and meet deadlines, Excellent communication skills, both verbal and written, Team-oriented with the ability to work effectively with diverse personalities, Professional, dependable, detail-oriented, and motivated self-starter, Ability to work independently with minimal supervision and review own work thoroughly", "preferred": "Previous experience in public accounting, Successful completion of the firm's bookkeeping exam and background check"}, "skills": ["QuickBooks", "Microsoft Office", "Excel", "Communication", "Teamwork"], "postedDate": "1 month ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3975660328"}