{"jobTitle": "Senior Director of Partnerships", "company": {"name": "Bamboo Health", "industry": "Hospitals and Health Care", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Executive", "jobFunction": "Business Development and Sales", "industry": "Hospitals and Health Care", "description": "Bamboo Health is a leader in cloud-based care coordination software and analytics solutions focused on patients with complex needs, including those suffering from physical health and mental health issues and substance use disorders. We are driven by our mission of enabling better care for patients across the continuum. Our software solutions help healthcare professionals collaborate on shared patients across the spectrum of care. Join us in reducing human suffering in moments that matter, turning vicious healthcare cycles into virtuous ones!<br/><br/><strong>Summary<br/><br/></strong>As the Senior Director of Partnerships, you will be responsible for identifying and engaging strategic partners who can accelerate Bamboo Health’s growth. This includes negotiating partnership terms, executing mutually beneficial partnership agreements, and managing and expanding existing partnership relationships. You will need to develop a deep understanding of Bamboo’s solutions and customer segments and stay updated on market trends and developments.<br/><br/>This role is highly visible and cross-functional, requiring regular collaboration with Product Strategy, Product Management, Product Marketing, Sales, Legal, and Customer Success, and communication with our Executive Leadership Team. You should be a self-starter, enjoy rolling up your sleeves, and thrive in a dynamic, fast-paced environment.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Proactively identify and evaluate potential partners that can accelerate Bamboo’s growth through complementary product functionality, services, or access to customer audiences</li><li>Stay informed about our customer segments, market trends, and competitive landscape</li><li>Develop business cases for partnership opportunities and create prioritization frameworks for evaluating strategic options, through a build, buy, partner lens</li><li>Negotiate the terms and conditions of partnership agreements including revenue models and key performance metrics </li><li>Manage and grow existing partnerships by monitoring performance and identifying areas for expansion</li><li>Build a network of partners across key internal stakeholders to assist in decision-making and feedback processes</li><li>Provide succinct updates to our Executive Leadership Team<br/><br/></li></ul><strong>What Success Looks Like…<br/><br/></strong><strong>In 3 months…<br/><br/></strong><ul><li>Develop a deep familiarity with our existing products, product positioning, &amp; use cases</li><li>Understand the core buyers, market trends, and competitive landscape across all our customer segments</li><li>Gain familiarity with our existing partnership agreements and key performance metrics</li><li>Internalize our 3-year strategy and roadmap. Begin to help the team in evaluating strategic opportunities<br/><br/></li></ul><strong>In 6 months…<br/><br/></strong><ul><li>Collaborate closely with Product Strategy, Product, and Commercial teams to identify partnership opportunities that can accelerate Bamboo’s growth</li><li>Translate opportunities into clear and quantified business cases and create prioritization frameworks to guide investment decisions</li><li>Improve the performance of existing channel partnership agreements</li><li>Build strong relationships across Bamboo Health to learn and share your learnings<br/><br/></li></ul><strong>In 12 months…<br/><br/></strong><ul><li>Be a critical stakeholder to the long-term direction of business line investment and strategy </li><li>Have full ownership of our partnership function both in the strong execution and optimization of existing agreements and the identification, negotiation, closing, &amp; implementation of new partnerships<br/><br/></li></ul><strong>What You Need<br/><br/></strong><ul><li>10+ years of experience with a track record of owning partnership strategy &amp; execution for products/product suites/lines of business</li><li>Experience developing business cases, revenue models, and mutually beneficial contract structures</li><li>Comfort in negotiating partnership terms and conditions and executing agreements</li><li>You have a strong desire and willingness to learn; a roll up your sleeves attitude toward tackling novel problems</li><li>An ability to work productively with and drive alignment and consensus among various internal stakeholders</li><li>Excellent communication and interpersonal skills</li><li>Comfort giving presentations/updates to the company’s Executive Leadership Team</li><li>Experience driving projects from start-to-finish, with a predictable cadence and involving multiple stakeholders from diverse disciplines</li><li>A high level of judgment, analytical ability, and creativity in investigating strategic directions for our business</li><li>You feel passionate about improving healthcare outcomes</li><li>A work environment that is conducive to high quality virtual interactions. This includes but is not limited to being able to work from a quiet space with minimal interruptions or distractions, and a strong internet connection<br/><br/></li></ul><strong>What You Get<br/><br/></strong><ul><li>Join one of the most innovative healthcare technology companies in the country</li><li>Have the autonomy to build something with an enthusiastically supportive team</li><li>Learn from working at the highest levels and on the most strategic priorities of the company, including from world class investors and advisors</li><li>Receive competitive compensation, including equity, with health, dental, vision and other benefits<br/><br/></li></ul><strong> <br/><br/></strong><strong> <br/><br/></strong><strong>Belonging at Bamboo<br/><br/></strong><strong>We Care. #BambooHealthValuesCare<br/><br/></strong>Every human being has the right to the best possible healthcare. Our solutions enable healthcare professionals to see and treat every individual as a whole person by providing the right information, at the right time – regardless of physical, behavioral, or social barriers.<br/><br/>We’re a great place to work because we care. We continually seek to learn about our differences and ensure the unique identities and contributions of all employees are welcome, valued and celebrated.<br/><br/>Our commitment to making a positive impact starts by recognizing and leveraging our differences, building inclusive teams, cultivating a sense of belonging, combating biases, and actively removing barriers to equity.<br/><br/><strong><em>Bamboo Health is proud to be an Equal Employment Opportunity and affirmative action employer. <br/><br/></em></strong>To protect our applicants from fraudulent recruitment activity, we recommend that all applicants verify the validity of an interview and hiring process by visiting our website www.bamboohealth.com. All valid job postings will be listed on our careers page. Bamboo Health does not conduct interviews via text and will not request sensitive information such as banking details during the application process.<br/><br/>", "responsibilities": "As the Senior Director of Partnerships, you will be responsible for identifying and engaging strategic partners who can accelerate Bamboo Health’s growth. This includes negotiating partnership terms, executing mutually beneficial partnership agreements, and managing and expanding existing partnership relationships. You will need to develop a deep understanding of Bamboo’s solutions and customer segments and stay updated on market trends and developments.", "qualifications": {"required": "10+ years of experience with a track record of owning partnership strategy &amp; execution for products/product suites/lines of business\nExperience developing business cases, revenue models, and mutually beneficial contract structures\nComfort in negotiating partnership terms and conditions and executing agreements\nYou have a strong desire and willingness to learn; a roll up your sleeves attitude toward tackling novel problems\nAn ability to work productively with and drive alignment and consensus among various internal stakeholders\nExcellent communication and interpersonal skills\nComfort giving presentations/updates to the company’s Executive Leadership Team\nExperience driving projects from start-to-finish, with a predictable cadence and involving multiple stakeholders from diverse disciplines\nA high level of judgment, analytical ability, and creativity in investigating strategic directions for our business\nYou feel passionate about improving healthcare outcomes\nA work environment that is conducive to high quality virtual interactions. This includes but is not limited to being able to work from a quiet space with minimal interruptions or distractions, and a strong internet connection", "preferred": ""}, "skills": [], "postedDate": "3 weeks ago", "benefits": "Join one of the most innovative healthcare technology companies in the country\nHave the autonomy to build something with an enthusiastically supportive team\nLearn from working at the highest levels and on the most strategic priorities of the company, including from world class investors and advisors\nReceive competitive compensation, including equity, with health, dental, vision and other benefits", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3975641770"}