{"jobTitle": "Administrative Assistant", "company": {"name": "American Skin Association", "industry": "Technology, Information and Internet"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000—75,000", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Technology, Information and Internet", "description": "<strong>Company: American Skin Association<br/><br/></strong><strong>Position: Administrative Assistant<br/><br/></strong><strong>Employment Status: Full-Time, Exempt<br/><br/></strong><strong>Reports To: Executive Vice President<br/><br/></strong><strong>Office Location: Midtown, NYC Office<br/><br/></strong><strong>Job Summary: <br/><br/></strong>American Skin Association (ASA), a 501(c)3 nonprofit organization, with the mission of advancing research in skin biology and championing skin health, particularly among children, is seeking an Administrative Assistant. The Administrative Assistant has a vital role in supporting a nonprofit organization in the medical community.<br/><br/><strong>Job Specific Responsibilities and Duties:<br/><br/></strong><ul><li>Providing day-to-day administrative support to the organization and leadership</li><li>Drafting correspondence such as emails, acknowledgement &amp; outreach letters, press releases, executive summaries, statements, and reports</li><li>Scheduling meetings, taking detailed and accurate minutes, and keeping records</li><li>Preparing materials for all board and committee meetings</li><li>Supporting the grant administration process</li><li>Assisting with the planning of conferences/symposiums/award ceremonies and coordinating production of the collateral materials needed (videos, brochures, standing banner, etc.)</li><li>Providing event and fundraising support</li><li>Preparing and processing invoices, financial statements, checks and to track &amp; record financial data</li><li>Processing forms and transactions (financial, travel, reimbursements/expenses); maintaining records and databases</li><li>Coordinating space and office organization; purchasing and managing supplies and equipment</li><li>Effectively communicating with and management of vendors</li><li>Contributing to the continued growth of the organization</li><li>Manage ongoing and special projects</li><li>Adhering to all company policies and procedures<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor's Degree required with 2-3 years of experience</li><li>Prior administrative experience required</li><li>Prior nonprofit organization experience preferred</li><li>Exceptional organizational skills and attention to detail</li><li>High proficiency in Microsoft Word and Excel and applicable PC hardware</li><li>Excellent verbal and written communication skills</li><li>Proficient in basic office math</li><li>Able to work independently, as well as part of a small team</li><li><strong>Must be able to work in-person (5 days/week) <br/><br/></strong></li></ul>The job description outlined above is considered a core list of job duties/requirements. This document should not be considered a complete or comprehensive list. The incumbent assigned to this position is required to perform the duties listed above. The incumbent is also expected to adapt to changes and/or additions as needed. Nothing contained within this document is intended or shall be construed to create or constitute a contract of employment between any employee or group of employees and Emigrant Bank and its Subsidiaries. Emigrant Savings Bank and its Subsidiaries retain and reserve any and all rights to change, modify, amend, add to or delete from any section of this document as it deems, in its judgment, to be proper. Emigrant Savings Bank and its subsidiaries and affiliates are Equal Opportunity and Affirmative Action employers.<br/><br/>New York pay range<br/><br/>$65,000—$75,000 USD", "responsibilities": "Providing day-to-day administrative support to the organization and leadership, Drafting correspondence such as emails, acknowledgement &amp; outreach letters, press releases, executive summaries, statements, and reports, Scheduling meetings, taking detailed and accurate minutes, and keeping records, Preparing materials for all board and committee meetings, Supporting the grant administration process, Assisting with the planning of conferences/symposiums/award ceremonies and coordinating production of the collateral materials needed (videos, brochures, standing banner, etc.), Providing event and fundraising support, Preparing and processing invoices, financial statements, checks and to track &amp; record financial data, Processing forms and transactions (financial, travel, reimbursements/expenses); maintaining records and databases, Coordinating space and office organization; purchasing and managing supplies and equipment, Effectively communicating with and management of vendors, Contributing to the continued growth of the organization, Manage ongoing and special projects, Adhering to all company policies and procedures", "qualifications": {"required": "Bachelor's Degree required with 2-3 years of experience, Prior administrative experience required, Exceptional organizational skills and attention to detail, High proficiency in Microsoft Word and Excel and applicable PC hardware, Excellent verbal and written communication skills, Proficient in basic office math, Able to work independently, as well as part of a small team, Must be able to work in-person (5 days/week)", "preferred": "Prior nonprofit organization experience preferred"}, "skills": ["Microsoft Word", "Microsoft Excel", "Administrative Support", "Nonprofit", "Event Planning", "Fundraising", "Financial Management", "Vendor Management", "Office Management"], "postedDate": "1 month ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3975407859"}