{"jobTitle": "Product Marketing Manager Growth, Ring Customer Experience & Engagement Team", "company": {"name": "Ring", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$108,000.00/year - $185,000.00/year", "currency": "USD"}, "jobFunction": "Public Relations and Marketing", "industry": "Computers and Electronics Manufacturing", "description": "The Customer Experience & Engagement (CxE) team is seeking a talented individual with a blend of marketing savvy and product management experience to drive international customer growth strategies.\n\nIn this role, you will provide guidance and subject matter expertise to partners on how best to communicate with customers. This role will create and manage data driven growth initiatives with a voice of customer focus to help achieve Ring's business goals.\n\nYou will be responsible for understanding a variety of markets and products offered so you can recommend the best channel (email, push, in-app message, & SMS) to reach customers at the right moment in their purchasing journey.\n\nIf you enjoy working in a fast-paced environment with good people, developing data driven strategies, and get excited about driving international growth through impactful customer communications, Ring has an opportunity for you.\n\nKey job responsibilities\n\n<ul><li>Manage audience-specific messaging and communications strategies.</li><li>Problem-solve proactively to ensure smooth delivery and efficiencies for the CxE deliverables.</li><li>Influence across teams, roadmaps, priorities and decisions.</li><li>Track and document project workflow to ensure on-time delivery that aligns with business goals.</li><li>Measure and evaluate how growth initiatives impact customer experience (e.g., revenue, product/feature adoption, customer journeys, message clarity) and business outcomes</li><li>Comfortable interacting with all levels of Ring leadership<br/><br/></li></ul>A day in the life\n\nThe most exciting part of this role is that each day at Ring offers a new opportunity to meaningfully impact Ring's customers. One day, this role may interact with partners in the UK or Canada to determine the best approach for a new marketing campaign or product introduction. A day later, you might be presenting to marketing, e-comm, product, and CxE leadership on the results of the campaign you just completed.\n\nAbout The Team\n\nThe CxE team is a blend of marketing, product, creative, and analytic minded customer focused teammates. Our mission is to engage customers at the right moment and in the correct channel to provide an engaging and meaningful customer experience. Whether recommending a new product or helping to keep current products online and working correctly, the CxE team is communicating with Ring's customers every day.\n\nBasic Qualifications\n\n<ul><li> 3+ years of professional non-internship marketing experience</li><li> 7+ years of developing and managing marketing or channel programs experience</li><li> Experience building, executing and scaling cross-functional marketing programs</li><li> Experience using data and metrics to drive improvements</li><li> Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables)</li><li> Experience in online marketing channels such as social media marketing, display advertising, and search engine marketing</li><li> Experience managing teams<br/><br/></li></ul>Preferred Qualifications\n\n<ul><li> Knowledge of HTML, SQL, Excel</li><li> Experience with Tableau, SQL, or basic data-mining</li><li> Experience developing campaigns with a voice of customer (voc) narrative and lens.<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $108,000/year in our lowest geographic market up to $185,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.\n\n\nCompany - Amazon.com Services LLC\n\nJob ID: A2701089", "responsibilities": "Manage audience-specific messaging and communications strategies.\nProblem-solve proactively to ensure smooth delivery and efficiencies for the CxE deliverables.\nInfluence across teams, roadmaps, priorities and decisions.\nTrack and document project workflow to ensure on-time delivery that aligns with business goals.\nMeasure and evaluate how growth initiatives impact customer experience (e.g., revenue, product/feature adoption, customer journeys, message clarity) and business outcomes\nComfortable interacting with all levels of Ring leadership", "qualifications": {"required": "3+ years of professional non-internship marketing experience\n7+ years of developing and managing marketing or channel programs experience\nExperience building, executing and scaling cross-functional marketing programs\nExperience using data and metrics to drive improvements\nExperience with Excel or Tableau (data manipulation, macros, charts and pivot tables)\nExperience in online marketing channels such as social media marketing, display advertising, and search engine marketing\nExperience managing teams", "preferred": "Knowledge of HTML, SQL, Excel\nExperience with Tableau, SQL, or basic data-mining\nExperience developing campaigns with a voice of customer (voc) narrative and lens."}, "skills": ["Marketing", "Product Management", "Customer Experience", "Customer Engagement", "International Growth", "Data Driven Strategies", "Voice of Customer", "Channel Management", "Marketing Programs", "Cross-Functional Collaboration", "Data Analysis", "Excel", "Tableau", "Online Marketing", "Social Media Marketing", "Display Advertising", "Search Engine Marketing", "Team Management", "HTML", "SQL", "Data Mining", "Voice of Customer (VOC)"], "postedDate": "1 week ago", "benefits": "Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3976468763"}