{"jobTitle": "Public Relations Account Manager (AdTech/MarTech)", "company": {"name": "Highwire", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Not Applicable", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Public Relations and Communications Services", "description": "About us: Highwire is a modern strategic communications and digital marketing agency designed for disruptive companies. We work with high-growth technology companies and established brands looking to reinvent themselves. At Highwire, we believe that storytelling fuels transformation. And the most impactful stories represent all voices and perspectives. As a values-driven agency, we foster an inclusive environment where everyone—regardless of age, race/ethnicity, size, shape, gender identity, sexual orientation, religion and different abilities–can feel safe, celebrated and worthy. We ensure every Highwire Walker has unique support to climb to success. Our commitment to diversity, inclusion and belonging is permanent and foundational to our business and culture. We aspire to change our industry and build a better future for all. Our people-first culture is driven by four core values: Inclusion Always Growth Mindset Team Empowerment Fierce Distinction We’re looking for individuals with big ideas, strong opinions, and the energy to bring them to life. If you thrive in an environment that values personal accountability, high standards, and boundless motivation, this is the opportunity for you. Be part of our award-winning culture and contribute to an exciting and growing business where you can make a real impact. We are based in San Francisco, with offices in New York, Boston, and Chicago. However, we are also open to hiring in the following states: Connecticut, Florida, Indiana, Michigan, Missouri, New Jersey, North Carolina, Oregon, Pennsylvania, Texas, Utah, Vermont, and Washington. We’re looking for a visionary, creative type with 5+ years of experience growing teams and delighting clients. As an Account Manager, you will lead 3 to 4 teams doing everything from developing high-level strategy with clients to making magic happen with media, influencers and social media. Rock-solid writing skills, an in-depth knowledge of the technology industry and proficiency with all things digital and social are a must. We also take pride in our passionate and contemporary standard, so you should have a track record of leading edge thinking to develop programs that have a meaningful and relevant business impact. And, we love and adore our staff at all levels so we’re looking for someone to inspire and energize their teams and take Highwire to new heights. Technology background and established relationships with consumer tech media. Essential Functions<br/><br/><ul><li>Media/Influencer Relations </li><li>Strong relationships particularly with business, broadcast and influencer media and ability to direct staff to develop the same. </li><li>Strong grasp and creative use of social media channels to engage and support efforts. </li><li>Ongoing engagement of media for the agency (e.g. blog Q&amp;A, lunch talks, etc.) </li><li>Experience measuring the ROI of communications activities. </li><li>Experience with social media influencer engagement, content campaigns, and media coverage amplification</li><li>Client Service/Management</li><li> Ability to manage PR Programs from kick off through achieving goals</li><li> Ability to set aggressive but achievable goals based on generating news and ongoing coverage. </li><li>Exceptional client management skills and deep personal investment in client success. </li><li>Ability to manage through periods of change or challenge. </li><li>Ability to think clearly and project confidence amid crisis situations or in the face of strong competition. </li><li>Day to day contact for clients. </li><li>Develop budget and team priority allocations and identify opportunities to increase budget. </li><li>Lead media training sessions with clients including developing key messages and all follow up from session</li><li>Writing Proficiencies </li><li>Ability to generate a plan for a campaign or an entire PR program. </li><li>Ability to generate and edit award submissions, press releases, fact sheets, backgrounders, biographies, tour reports, briefing books, contributed articles, speaking opportunity abstracts, pitches, Q&amp;As, company memorandum and general team correspondence; also responsible for their production and assembly. </li><li>Professional, articulate and timely client communication. Development of consistent, creative, successful pitches</li><li>Agency Operations </li><li>Maintain 2 direct reports, assist in development of goals for reports, deliver annual reviews and quarterly check ins. </li><li>Participation in new business process including proactively identifying new targets, research and presenting at pitch. Identify, attend and encourage others to attend networking events. </li><li>Maintain a respectful, enthusiastic, and professional attitude towards coworkers, clients, and outside colleagues and lead team by example. </li><li>Support teams and manage up and down. </li><li>Responsible use of flexible work policies. </li><li>Uses Highwire social channels; writes for Highwire blog</li><li> Mentor junior staff to elevate development</li><li>Self Development </li><li>Proactively set up quarterly goals with principal; track against goals and demonstrate growth. </li><li>Effectively prioritize responsibilities based on impact, timelines, workflow and client goals. </li><li>Drive projects forward independently, eliminating the need for managers to consistent check in re: follow through/ task completion. Identify areas for self-improvement and bring suggestions and solutions to management. </li><li>Consistently hit deadlines or give enough notice if you won’t. </li><li>Attends regular networking events<br/><br/><br/></li></ul>Highwire Perks<br/><br/><ul><li>Competitive salary</li><li>Merit-based bonuses and promotions</li><li>Hybrid work model to suit your schedule and lifestyle</li><li>Excellent vacation policy including an extended break for summer and winter holiday</li><li>Participate in Empower Hours on Fridays; Team has the ability to log off by 3 pm</li><li>401K Match</li><li>Medical and dental benefits/ FSA</li><li>Paid Parental Leave</li><li>Commuter Benefit</li><li>Home office equipment stipend</li><li>Growth Mindset Stipend of $100 annually for books, exhibitions, etc</li><li>Technology reimbursement</li><li>Wellness benefit</li><li>Donation Match</li><li>Full-time writing Coach</li><li>Mentorship</li><li>Monthly recognition programs</li><li>Employee referral bonus</li><li>New business referral bonus</li><li>Quarterly Highwire fun events – Thanksgiving is our favorite holiday</li><li>Dog-friendly work environment</li><li>Extremely supportive, nurturing environment with many opportunities for learning and growth<br/><br/><br/></li></ul>The duties delineated above will vary depending on the needs of each specific account, and in no way states or implies that these are the only duties to be performed by this employee. This individual will be required to follow any other instructions and to perform any other duties requested by his or her supervisors. We are actively seeking candidates who possess a genuine passion for tech PR and are excited to expand our team. As we continue to grow our agency, we are proactively building a pipeline of exceptional individuals to connect with and consider for future opportunities. If you are enthusiastic about the world of tech PR and are eager to embark on a rewarding career in this field, we encourage you to start the conversation by applying today. We value your interest in our agency and look forward to hearing from you. Apply now and let's explore the possibilities together! Job Alert If you have been targeted by a scammer, you can file a complaint with the Federal Trade Commission here. Highwire will not send recruiting-related emails from any other email domain name or variation other than @highwirepr.com. Highwire will never request your bank account, credit card, or credit score as part of our application process. If you receive a suspicious email not sent from a team member, specifically at our @highwirepr.com email address, or if you receive suspicious outreach on social media, please forward the communication to hwsecurity@highwirepr.com so that we can review and flag the fraudulent domain and user IDs for removal.", "responsibilities": "Media/Influencer Relations \nStrong relationships particularly with business, broadcast and influencer media and ability to direct staff to develop the same. \nStrong grasp and creative use of social media channels to engage and support efforts. \nOngoing engagement of media for the agency (e.g. blog Q&A, lunch talks, etc.) \nExperience measuring the ROI of communications activities. \nExperience with social media influencer engagement, content campaigns, and media coverage amplification\nClient Service/Management\n Ability to manage PR Programs from kick off through achieving goals\n Ability to set aggressive but achievable goals based on generating news and ongoing coverage. \nExceptional client management skills and deep personal investment in client success. \nAbility to manage through periods of change or challenge. \nAbility to think clearly and project confidence amid crisis situations or in the face of strong competition. \nDay to day contact for clients. \nDevelop budget and team priority allocations and identify opportunities to increase budget. \nLead media training sessions with clients including developing key messages and all follow up from session\nWriting Proficiencies \nAbility to generate a plan for a campaign or an entire PR program. \nAbility to generate and edit award submissions, press releases, fact sheets, backgrounders, biographies, tour reports, briefing books, contributed articles, speaking opportunity abstracts, pitches, Q&amp;As, company memorandum and general team correspondence; also responsible for their production and assembly. \nProfessional, articulate and timely client communication. Development of consistent, creative, successful pitches\nAgency Operations \nMaintain 2 direct reports, assist in development of goals for reports, deliver annual reviews and quarterly check ins. \nParticipation in new business process including proactively identifying new targets, research and presenting at pitch. Identify, attend and encourage others to attend networking events. \nMaintain a respectful, enthusiastic, and professional attitude towards coworkers, clients, and outside colleagues and lead team by example. \nSupport teams and manage up and down. \nResponsible use of flexible work policies. \nUses Highwire social channels; writes for Highwire blog\n Mentor junior staff to elevate development\nSelf Development \nProactively set up quarterly goals with principal; track against goals and demonstrate growth. \nEffectively prioritize responsibilities based on impact, timelines, workflow and client goals. \nDrive projects forward independently, eliminating the need for managers to consistent check in re: follow through/ task completion. Identify areas for self-improvement and bring suggestions and solutions to management. \nConsistently hit deadlines or give enough notice if you won’t. \nAttends regular networking events", "qualifications": {"required": "5+ years of experience growing teams and delighting clients. Rock-solid writing skills, an in-depth knowledge of the technology industry and proficiency with all things digital and social are a must.  A track record of leading edge thinking to develop programs that have a meaningful and relevant business impact. ", "preferred": ""}, "skills": ["Media Relations", "Influencer Marketing", "Social Media", "Public Relations", "Client Management", "Writing", "Strategic Planning", "Technology", "Digital Marketing", "Communication"], "postedDate": "1 month ago", "benefits": "Competitive salary\nMerit-based bonuses and promotions\nHybrid work model to suit your schedule and lifestyle\nExcellent vacation policy including an extended break for summer and winter holiday\nParticipate in Empower Hours on Fridays; Team has the ability to log off by 3 pm\n401K Match\nMedical and dental benefits/ FSA\nPaid Parental Leave\nCommuter Benefit\nHome office equipment stipend\nGrowth Mindset Stipend of $100 annually for books, exhibitions, etc\nTechnology reimbursement\nWellness benefit\nDonation Match\nFull-time writing Coach\nMentorship\nMonthly recognition programs\nEmployee referral bonus\nNew business referral bonus\nQuarterly Highwire fun events – Thanksgiving is our favorite holiday\nDog-friendly work environment\nExtremely supportive, nurturing environment with many opportunities for learning and growth", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3977064666"}