{"jobTitle": "Materials Manager", "company": {"name": "Serta Simmons Bedding, LLC", "location": "West Palm Beach, FL"}, "location": "West Palm Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Manufacturing", "description": "<strong>Be Part of the Future of Sleep! <br/><br/></strong>At Serta Simmons Bedding (SSB), we're more than a mattress company, we're a leading global sleep company with a mission to help people sleep better so they can live healthier lives. With a 150-year heritage in delivering industry-leading sleep solutions, we own iconic brands including <strong>Serta®, Beautyrest®, Simmons® </strong>and <strong>Tuft &amp; Needle®.<br/><br/></strong><strong><strong>What You'll Do:<br/><br/></strong></strong>Join Serta Simmons Bedding, the leading provider of sleep solutions, as a Materials Manager at our West Palm Beach location.<br/><br/>As the Materials Manager, you will play a pivotal role in ensuring a continuous supply of raw materials to support production within our high-velocity, just-in-time, make-to-order, Lean manufacturing environment.<br/><br/>If you're ready to take on a dynamic role where you'll drive efficiency and excellence in materials management, we invite you to apply and become part of our dedicated team in West Palm Beach.<br/><br/><strong><strong>How You'll Do It:<br/><br/></strong></strong><ul><li> Foster a safety culture and ensure compliance with company safety program and OSHA regulations to prevent work-related injuries. </li><li> Manage timely receipt and disposition of materials. </li><li> Plan, order, execute, and manage storage of critical raw materials according to supplier selections and Sourcing Operations guidelines, utilizing MAP/MRP system. </li><li> Oversee Lean raw material replenishment and storage on the production floor, including setup, daily usage estimates, trigger points, and reorder quantities. </li><li> Strategize material life cycle management and eliminate obsolete inventory items, aiming to reduce waste across the value chain. </li><li> Create and distribute quality alerts, reporting raw material quality defects to Sourcing Operations for resolution. </li><li> Maintain accurate inventory levels aligned with cost and service goals, utilizing MRP system and conducting cycle counts as necessary to resolve discrepancies. </li><li> Participate in the cycle count process and ensure materials are stored in designated locations. </li><li> Optimize inbound delivery profile and assist with inbound freight cost management. </li><li> Collaborate with Supply Chain Manager to identify opportunities for improving key results areas (KRAs) while enhancing business growth through service excellence. <br/><br/></li></ul><strong><strong>What You'll Bring:<br/><br/></strong></strong><ul><li> 8-10 years of experience in Lean manufacturing environment. </li><li> BA/BS Degree in related field or equivalent work experience. </li><li> Experience in leading and coaching supervisors and hourly associates. </li><li> Proficiency in Excel, particularly in pivot tables, v-lookups, and data validations. </li><li> Proficient in ERP Systems, including SAP SuccessFactors. </li><li> Strong analytical skills for generating reports on cycle counts, root cause analysis, and countermeasures. </li><li> Previous experience in Control Management preferred. </li><li> Previous experience as a Buyer preferred, though not required. </li><li> Excellent organizational and time management skills. </li><li> Strong sense of urgency and proactive problem-solving abilities. <br/><br/></li></ul><strong> Additional qualifications: <br/><br/></strong><ul><li> Experience with OSHA regulations. </li><li> APICS/CPM certification preferred <br/><br/></li></ul><strong><strong>Your Work Enviroment:<br/><br/></strong></strong><ul><li> Up to 25% travel required. </li><li> Offsite travel primarily to manage a Receiving Warehouse. </li><li> Standard shift hours: 7am-5pm EST. On-site arrival expected around 6am/6:30am EST. </li><li> Quarterly responsibility for running and leading Physical Inventory. </li><li> Candidate Relocation: This role is relocation eligible <br/><br/></li></ul><strong>Why work at Serta Simmons Bedding?<br/><br/></strong>When you join SSB, you become part of a winning and diverse team that is excited and committed to helping people get better sleep. We provide inspiring career opportunities, competitive benefits, employee perks, and the chance to be part of the future of sleep.<br/><br/><strong> Benefits and Perks (USA, Salary non-union- optional): <br/><br/></strong><ul><li> Health, Dental, and Vision (starts on day one) </li><li> Annual employee contribution to HSA </li><li> 401K with company match </li><li> Paid Time Off / Vacation </li><li> 12 company holidays </li><li> Sick days </li><li> Company paid short- and long-term disability </li><li> Paid parental leave </li><li> Discount programs including Friends and family discounts </li><li> Referral Bonus </li><li> Tuition Reimbursement <br/><br/></li></ul>Employees are required to comply with COVID policies established by a vendor or customer.<br/><br/>It is our policy to abide by all federal, state, and local laws prohibiting employment discrimination, with respect to all terms and conditions of employment, based solely on a person’s race, color, religious creed/religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, ancestry, citizenship status, disability, age, military status, or status as a Vietnam-era or special disabled veteran, marital status, registered domestic partner or civil union status, gender (including sex stereotyping or expression), medical condition genetic information (including family medical history), or any other protected status except where a reasonable, bona fide occupational qualification exists.<br/><br/>SSB will provide reasonable accommodations to applicants and employees who need them, as required by law.<br/><br/>The hiring salary range for this position applies to where legally required, and most other geographies. Starting pay for the successful applicant depends on a variety of job-related factors, including but not limited to geographic location, market demands, experience, training, and education. The benefits available for this position include medical, dental, vision, 401(k) plan, life insurance coverage, disability benefits, tuition assistance program and PTO or, if applicable, as otherwise dictated by the appropriate Collective Bargaining Agreement.<br/><br/>", "responsibilities": "<ul><li> Foster a safety culture and ensure compliance with company safety program and OSHA regulations to prevent work-related injuries. </li><li> Manage timely receipt and disposition of materials. </li><li> Plan, order, execute, and manage storage of critical raw materials according to supplier selections and Sourcing Operations guidelines, utilizing MAP/MRP system. </li><li> Oversee Lean raw material replenishment and storage on the production floor, including setup, daily usage estimates, trigger points, and reorder quantities. </li><li> Strategize material life cycle management and eliminate obsolete inventory items, aiming to reduce waste across the value chain. </li><li> Create and distribute quality alerts, reporting raw material quality defects to Sourcing Operations for resolution. </li><li> Maintain accurate inventory levels aligned with cost and service goals, utilizing MRP system and conducting cycle counts as necessary to resolve discrepancies. </li><li> Participate in the cycle count process and ensure materials are stored in designated locations. </li><li> Optimize inbound delivery profile and assist with inbound freight cost management. </li><li> Collaborate with Supply Chain Manager to identify opportunities for improving key results areas (KRAs) while enhancing business growth through service excellence. <br/><br/></li></ul>", "qualifications": {"required": "8-10 years of experience in Lean manufacturing environment. <br/>BA/BS Degree in related field or equivalent work experience. <br/>Experience in leading and coaching supervisors and hourly associates. <br/>Proficiency in Excel, particularly in pivot tables, v-lookups, and data validations. <br/>Proficient in ERP Systems, including SAP SuccessFactors. <br/>Strong analytical skills for generating reports on cycle counts, root cause analysis, and countermeasures. <br/>Excellent organizational and time management skills. <br/>Strong sense of urgency and proactive problem-solving abilities. <br/><br/>", "preferred": "Previous experience in Control Management preferred. <br/>Previous experience as a Buyer preferred, though not required. <br/>Experience with OSHA regulations. <br/>APICS/CPM certification preferred <br/><br/>"}, "skills": ["Lean Manufacturing", "MRP", "ERP", "SAP SuccessFactors", "Excel", "Pivot Tables", "V-lookups", "Data Validations", "Analytical Skills", "Cycle Counts", "Root Cause Analysis", "Countermeasures", "Organizational Skills", "Time Management", "Problem Solving", "OSHA Regulations", "APICS", "CPM"], "postedDate": "2 weeks ago", "benefits": "<ul><li> Health, Dental, and Vision (starts on day one) </li><li> Annual employee contribution to HSA </li><li> 401K with company match </li><li> Paid Time Off / Vacation </li><li> 12 company holidays </li><li> Sick days </li><li> Company paid short- and long-term disability </li><li> Paid parental leave </li><li> Discount programs including Friends and family discounts </li><li> Referral Bonus </li><li> Tuition Reimbursement <br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3977405745"}