{"jobTitle": "Customer Service Representative  (10:30a-7p CST)", "company": {"name": "HTLF", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Customer Service", "industry": "Financial Services", "description": "Under close supervision, the Customer Care Rep I HOC is responsible for providing excellent customer service to both internal team members and external customers regarding a variety needs. Main objective is to project the professional organizational image through telephone, electronic (e-mail), social media, chat and written interaction with the both HTLF member bank employees and customers. The Customer Care Rep I must adhere to all bank policies and procedures.", "responsibilities": "1. Responds to both internal and external customer inquiries through a variety of mediums such as: e-mails, chat, telephone, etc. in a courteous and timely manner as outlined in the department’s established service levels.\n2. Assists internal and external customers with troubleshooting, recommending possible solutions, or determining when to escalate a problem to management or referring to a technical expert within the area.\n3. Accurately processes orders, forms, applications, and requests submitted within SLA timeframe.\n4. Completes customer contact logs.\n5. Recognizes and reports to management trends in internal and external customer calls that may identify system/product related issues. \n6. Assists with all banking deposit product inquiries including: checking, savings, certificate of deposit, internet banking, debit card, and mobile banking.\n7. Completes annual E-Learning Plan and Bank Secrecy Act (BSA) training as assigned and keeps up-to-date knowledge of BSA as it relates to the job function.\n8. Performs other duties as assigned.", "qualifications": {"required": "High School Diploma/GED\nBusiness related college courses preferred\n6-12 months of customer service experience. \nExperience using Microsoft Office Suite.\nAbility to demonstrate an understanding of electronic banking services especially, but not limited to, internet banking, bill payment, mobile banking, and ATM/debit card.\nHave previous experience using social media, instant chat, e-mail, etc.\nDemonstrated knowledge of current technologies such as used: tablets, computers, smart phones, etc.\nKnowledge of general banking practices preferred.", "preferred": ""}, "skills": ["Customer Service", "Microsoft Office", "Banking", "Social Media", "Email", "Telephone", "Chat"], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3978259973"}