{"jobTitle": "Event Coordinator (Remote)", "company": {"name": "Bryant Park Consulting", "location": "Denver, CO"}, "location": "Denver, CO", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000 to $85,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Technology, Information and Internet", "description": "<strong>About Bryant Park Consulting:<br/><br/></strong>Bryant Park Consulting (BPC) is a modern consulting firm focused on strategy, technology, and business transformation. We partner with leading technology firms like Oracle NetSuite, Boomi, Celigo, and more to bring leading capabilities to our clients across industries. BPC was founded in early 2021 and has grown quickly to become a leader in technology consulting.<br/><br/><strong>What you will do<br/><br/></strong>Bryant Park is hiring a full-time Event Coordinator to join our Marketing team. This team focuses on field events, contents, and SDN alliance partnerships for a comprehensive approach to support our organization's growth.<br/><br/>As an Event Coordinator, your role will be responsible for planning, coordinating, and executing a variety of events throughout the calendar year. This includes our flagship event, BPC Club, our annual sponsorship at SuiteWorld, and several other tradeshows and conferences throughout the year. The ideal candidate will have a proven track record in event planning, excellent organizational skills, and the ability to manage multiple projects simultaneously. This role will also involve some travel for on-site events operations.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Event Planning and Coordination:</li><ul><li>80% of your time will be focused on leading go-to-market events</li><li>Lead the planning and execution of Bryant Park Consulting's annual sponsorship at SuiteWorld, including booth design, promotional materials, on-site coordination, and schedule management for all attendees</li><li>Lead the planning and execution of BPC's annual flagship event: BPC Club</li><li>Plan and coordinate additional tradeshows and conferences, ensuring alignment with company goals and objectives (COE Micro Verticals)</li><li>20% of your time will be focused on supporting internal events to capitalize on marketing opportunities - including but not limited to internal team retreats, annual leadership summits, etc.</li></ul><li>Logistics Management:</li><ul><li>Oversee all event logistics, including venue selection, vendor management, transportation, accommodations, meetings, calendar invites, booth giveaway items, shipments to venues</li><li>Meet all deadlines for early-bird conference registration, early hotel accommodations, administrative tasks on event portals</li><li>Coordinate with internal teams to ensure timely execution and prep of event presentations, booth handout creation, internal swag coordination for attendees, additional event materials and equipment</li></ul><li>Sponsorship:</li><ul><li>Leverage existing relationships with partners to secure sponsorship revenue for events</li><li>Develop and maintain strong relationships with partners for co-marketing collaboration opportunities</li><li>Create sponsorship packages and prospectus to attract sponsors by leveraging graphic designer</li><li>Collaborate with internal teams to understand strong positioning of each partner and relationship dynamics to go-to-market effectively</li></ul><li>Budget Management:</li><ul><li>Develop and manage event budgets, ensuring all expenses are tracked and within budget constraints </li><li>Negotiate contracts with vendors and suppliers to secure cost-effective services </li><li>Collaboration with BPC procurement and accounting team as needed</li></ul><li>Marketing and Promotion:</li><ul><li>Collaborate with team of contractors, internal subject matter experts, and partners to develop event promotion strategies, including social media campaigns, email marketing, content development</li><li>Create and distribute event invitations, sponsorship packages, promotional materials, digital assets, physical pop-up banners onsite</li></ul><li>Stakeholder Communications:</li><ul><li>Act as the primary point of contact for all event-related inquiries, providing timely and accurate information to stakeholders</li><li>Maintain clear, consistent and effective communication with event sponsors, partners, vendors, attendees</li></ul><li>Post-Event Evaluation:</li><ul><li>Conduct post-event evaluation to assets the success of event and identify areas for improvement</li><li>Create a prospect outreach strategy and work with internal resources to develop follow-up assets, meetings, import clean contacts into our NetSuite system</li><li>Prepare detailed reports on event outcomes, including attendee feedback, budget analysis, key learnings, and help make recommendations/decisions for future events<br/></li></ul></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's or advanced degree in Business Administration, Event Management, Marketing, Communications, related fields, or equivalent work/life experience.</li><li>2-4 years of experience in event planning and coordination, preferably within the technology or consulting industry.</li><li>Strong project management skills with the ability to handle multiple events simultaneously.</li><li>Excellent communication and interpersonal skills.</li><li>Proficiency in event management software, Google Suite (Docs, Sheets, Slides) and Microsoft Office Suite.</li><li>Ability to work independently and as part of a team.</li><li>Experience in securing and managing sponsorships is highly desirable.</li><li>Willingness to travel as needed for event execution.</li><li>Nice to have: NetSuite, ERP industry knowledge, and experience<br/><br/></li></ul><strong>Work From Home &amp; Travel Requirements<br/><br/></strong><ul><li>Willingness to travel up to 30% to be on-site at event (Note: this role is fully remote with travel as needed)<br/><br/></li></ul><strong>Salary Range</strong>: $75,000 to $85,000 USD<br/><br/><strong>Putting Our People First From Day One<br/><br/></strong>From the founding of Bryant Park Consulting, we committed to putting people first and offering variety, fulfillment, and balance. You will have the opportunity to work with the world's top companies and business leaders, keep up with the latest technology, and flex your skills across industries and disciplines. You will also be encouraged to engage with your community and nature. We attract and retain the best in the business - people from industry, consulting, agencies, startups, nonprofits, and the public sector - all drawn to building a career that's both exciting and sustainable.<br/><br/><ul><li><strong>Feed Your Curiosity - </strong>Foster technical and industry expertise, and grow as a leader. Knowledge management and professional development are held in highest regard, we offer and sponsor flexible learning options on topics from Project Management to Web Development, and we pay for certifications with top programs.</li><li><strong>Cultivate Well Being - </strong>Thrive holistically with a robust and personalized set of benefits and company resources to support your emotional, mental, financial, physical, and social well-being. Celebrate with your team or explore interests with other team members, from book clubs to speaking events and annual retreats.</li><li><strong>Choose Your Career - </strong>There is no pressure to go 'up-or-out' and welcome you to build a career that gets you excited about coming to work every day - whether that's as an individual contributor or a team manager. Performance is evaluated fairly and regularly and as the organization grows we expect you and your career to grow with us.</li><li><strong>Comprehensive Benefits -</strong> We provide best-in-class benefits for employees including 401k with Company match up to 6%, United Health Plan, as well as Dental, Vision, Life Insurance and Accidental Death and Dismemberment, and more. We also encourage and reimburse for costs of approved training, continuing education, skills development, and professional certification programs and exams to help further your career development.<br/><br/></li></ul>Bryant Park Consulting is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity or any other characteristic protected by law.", "responsibilities": "Event Planning and Coordination:\n\n* 80% of your time will be focused on leading go-to-market events\n* Lead the planning and execution of Bryant Park Consulting's annual sponsorship at SuiteWorld, including booth design, promotional materials, on-site coordination, and schedule management for all attendees\n* Lead the planning and execution of BPC's annual flagship event: BPC Club\n* Plan and coordinate additional tradeshows and conferences, ensuring alignment with company goals and objectives (COE Micro Verticals)\n* 20% of your time will be focused on supporting internal events to capitalize on marketing opportunities - including but not limited to internal team retreats, annual leadership summits, etc.\n\nLogistics Management:\n\n* Oversee all event logistics, including venue selection, vendor management, transportation, accommodations, meetings, calendar invites, booth giveaway items, shipments to venues\n* Meet all deadlines for early-bird conference registration, early hotel accommodations, administrative tasks on event portals\n* Coordinate with internal teams to ensure timely execution and prep of event presentations, booth handout creation, internal swag coordination for attendees, additional event materials and equipment\n\nSponsorship:\n\n* Leverage existing relationships with partners to secure sponsorship revenue for events\n* Develop and maintain strong relationships with partners for co-marketing collaboration opportunities\n* Create sponsorship packages and prospectus to attract sponsors by leveraging graphic designer\n* Collaborate with internal teams to understand strong positioning of each partner and relationship dynamics to go-to-market effectively\n\nBudget Management:\n\n* Develop and manage event budgets, ensuring all expenses are tracked and within budget constraints \n* Negotiate contracts with vendors and suppliers to secure cost-effective services \n* Collaboration with BPC procurement and accounting team as needed\n\nMarketing and Promotion:\n\n* Collaborate with team of contractors, internal subject matter experts, and partners to develop event promotion strategies, including social media campaigns, email marketing, content development\n* Create and distribute event invitations, sponsorship packages, promotional materials, digital assets, physical pop-up banners onsite\n\nStakeholder Communications:\n\n* Act as the primary point of contact for all event-related inquiries, providing timely and accurate information to stakeholders\n* Maintain clear, consistent and effective communication with event sponsors, partners, vendors, attendees\n\nPost-Event Evaluation:\n\n* Conduct post-event evaluation to assets the success of event and identify areas for improvement\n* Create a prospect outreach strategy and work with internal resources to develop follow-up assets, meetings, import clean contacts into our NetSuite system\n* Prepare detailed reports on event outcomes, including attendee feedback, budget analysis, key learnings, and help make recommendations/decisions for future events\n", "qualifications": {"required": "Bachelor's or advanced degree in Business Administration, Event Management, Marketing, Communications, related fields, or equivalent work/life experience.\n2-4 years of experience in event planning and coordination, preferably within the technology or consulting industry.\nStrong project management skills with the ability to handle multiple events simultaneously.\nExcellent communication and interpersonal skills.\nProficiency in event management software, Google Suite (Docs, Sheets, Slides) and Microsoft Office Suite.\nAbility to work independently and as part of a team.\nExperience in securing and managing sponsorships is highly desirable.\nWillingness to travel as needed for event execution.\nNice to have: NetSuite, ERP industry knowledge, and experience", "preferred": "NetSuite, ERP industry knowledge, and experience"}, "skills": ["Event Management", "Project Management", "Communication", "Interpersonal Skills", "Google Suite", "Microsoft Office Suite", "Sponsorship Management", "Budget Management", "Marketing", "Social Media", "Email Marketing", "Content Development", "Stakeholder Communication", "Post-Event Evaluation", "NetSuite", "ERP"], "postedDate": "1 month ago", "benefits": "401k with Company match up to 6%, United Health Plan, as well as Dental, Vision, Life Insurance and Accidental Death and Dismemberment, and more. We also encourage and reimburse for costs of approved training, continuing education, skills development, and professional certification programs and exams to help further your career development.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3978077631"}