{"jobTitle": "Product Manager", "company": {"name": "Avenue Code", "industry": "IT Services and IT Consulting", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100.000 USD to $130.000 USD", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "IT Services and IT Consulting", "description": "Avenue Code is the leading software consultancy focused on delivering end-to-end development solutions for digital transformation across every vertical. We’re privately held, profitable, and have been on a solid growth trajectory since day one. We care deeply about our clients, our partners, and our people. We prefer the word ‘partner’ over ‘vendor’, and our investment in professional relationships is a reflection of that philosophy. We pride ourselves on our technical acumen, our collaborative problem-solving ability, and the warm professionalism of our teams.\n\nAvenue Code has been believing in and promoting plurality actions for over 10 years, understanding that recognizing differences and fostering a safe environment, employment opportunities, representation, and support are the best ways to promote an increasingly equitable culture.\n\n<br/>\n\nAbout the opportunity:\n\nWe are looking for a Senior Product Manager to join our team in building an engaging and intuitive category-based browsing experience for a big ecommerce client. This platform not only enhances the buyer journey but also attracts significant traffic through optimization for external search engines like Google, Bing, and Yahoo. As a key team member, you will own specific product components from roadmap planning through execution, evaluation, and iteration. You will collaborate closely with engineers, business stakeholders, analysts, researchers, and designers to identify customer needs, develop strategies, and test solutions.\n\nThis is a hybrid position, 3x weekly (Tuesday-Thursday) in San Jose, California office.\n\n<br/>\n\nResponsibilities:\n\n* Analyze requirements from multiple business verticals and develop a strategy for shared horizontal solutions.\n* Identify and evaluate customer needs.\n* Present quarterly and annual plans to senior leadership.\n* Gather and document product requirements.\n* Manage an engineering backlog.\n* Conduct A/B tests, analyze and report on results with recommended actions. \n\n<br/>\n\nRequired Qualifications:\n\n* Bachelor’s degree in Computer Science or related field.\n* Deep experience in Product Management.\n* Strong technical aptitude, business acumen, and design sensibilities.\n* Experience coordinating a team of engineers.\n* Proficiency in A/B quantitative testing.\n* Data-driven and results-oriented decision-making.\n* Proven track record of product execution and delivery.\n* Experience working with user experience design and research.\n* Effective written and oral communication skills.\n* Ability to ask challenging questions in a productive manner.\n* Comfortable working in large, matrixed organizations. \n\n<br/>\n\nNice to Have:\n\n* Experience with e-commerce or other consumer-facing products. \n\n<br/>\n\n<br/>\n\n<br/>\n\nAvenue Code discloses salary range information in compliance with state and local pay transparency obligations. It considers a wide range of factors such as internal equity, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, business or organizational needs and others. At Avenue Code it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for US Based Product Manager is $100.000 USD to $130.000 USD per year. \n\n<br/>\n\n<br/>\n\nAvenue Code reinforces its commitment to privacy and to all the principles guaranteed by the most accurate global data protection laws, such as GDPR, LGPD, CCPA and CPRA. The Candidate data shared with Avenue Code will be kept confidential and will not be transmitted to disinterested third parties, nor will it be used for purposes other than the application for open positions. As a Consultancy company, Avenue Code may share your information with its clients and other Companies from the CompassUol Group to which Avenue Code’s consultants are allocated to perform its services.", "responsibilities": "* Analyze requirements from multiple business verticals and develop a strategy for shared horizontal solutions.\n* Identify and evaluate customer needs.\n* Present quarterly and annual plans to senior leadership.\n* Gather and document product requirements.\n* Manage an engineering backlog.\n* Conduct A/B tests, analyze and report on results with recommended actions.", "qualifications": {"required": "Bachelor’s degree in Computer Science or related field.\nDeep experience in Product Management.\nStrong technical aptitude, business acumen, and design sensibilities.\nExperience coordinating a team of engineers.\nProficiency in A/B quantitative testing.\nData-driven and results-oriented decision-making.\nProven track record of product execution and delivery.\nExperience working with user experience design and research.\nEffective written and oral communication skills.\nAbility to ask challenging questions in a productive manner.\nComfortable working in large, matrixed organizations.", "preferred": "Experience with e-commerce or other consumer-facing products."}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978639951"}