{"jobTitle": "Director of Partnerships", "company": {"name": "FURTHER", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "180,000.00/yr - 190,000.00/yr USD", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "About FURTHER\n\nFURTHER is the leading AI-powered customer acquisition platform for senior care and healthcare organizations. Our digital experience platform and sales automation solutions make it easier for consumers to buy and easier for sales teams to sell, increasing conversion rates and driving incremental revenue for our clients. FURTHER is the only data platform in the industry that connects first-party marketing and sales data, making it easier for client marketing teams to be data-driven. FURTHER works with over 4,500 care communities and delivered $1.5B of revenue to our customers in 2023.\n\nThe Role\n\nDevelop and drive revenue and growth opportunities by identifying, designing, and executing strategic partnerships that provide incremental clients and assist with client retention.\n\nWhat You’ll Own\n\n<ul><li>Deliver a clear roadmap for scaling partner programs and identifying and testing additional partnership opportunities. </li><li>Develop pipeline and sign new deals/ partnerships delivering a measurable and steady growth of new customers/ clients. </li><li>Create partnership deal frameworks and sales playbooks to ensure lucrative partnerships that deliver against company goals and brand guidelines. </li><li>Develop processes &amp; documentation for new partner onboarding &amp; technical set up. </li><li>Conduct research, work with product marketing to develop BD materials such as pitch decks and talking points. </li><li>Create marketing plans and disseminate company marketing materials/campaigns for partner programs (new launches and post- launch pushes). </li><li>Quantify and evaluate return for each partnership, offer performance analysis insights and improvement strategies. </li><li>You’ll be our brand ambassador at trade events and conferences. There will be around 1-2 trips a month to attend these events. <br/><br/></li></ul>What You’ll Bring\n\n<ul><li>You will have 7+ years experience in partnership management within a SaaS environment, exceptional negotiation skills, and a keen commercial awareness to identify and develop opportunities into successful collaborations. </li><li>You have experience developing a scalable model for formalizing partnerships from early stages, ideally at companies between $10m ARR to $30m ARR. </li><li>You have strong collaboration skills with sales, product, marketing, and development teams to create partnership strategies. </li><li>You have excellent program management skills to prioritize, monitor, and manage the cadence of interactions with partners. </li><li>You have experience creating the foundation for a partnerships program to eventually build out a team, ensuring the formula for success is established before expanding headcount. </li><li>You have effective communication, both written and verbal. <br/><br/></li></ul>Bonus Points\n\n<ul><li>You have worked with Automation or AI products in the past. </li><li>You have experience building partnerships with marketing agencies. <br/><br/></li></ul><strong>Compensation<br/><br/></strong>Our openings span more than one career level. The salary band for this role is $180,000-$190,000 USD base/ $250K OTE. The provided salary depends on many factors, such as location, work experience and transferable skills, business needs and impact, and market demands.<br/><br/><ul><li>Comprehensive benefits package, including health insurance, retirement plans, and more. </li><li>Opportunities for professional development and career advancement. <br/><br/></li></ul>Equal Opportunity Employer\n\nWe hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.\n\nFURTHER is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. FURTHER considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. FURTHER is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.", "responsibilities": "Develop and drive revenue and growth opportunities by identifying, designing, and executing strategic partnerships that provide incremental clients and assist with client retention.", "qualifications": {"required": "You will have 7+ years experience in partnership management within a SaaS environment, exceptional negotiation skills, and a keen commercial awareness to identify and develop opportunities into successful collaborations.", "preferred": "You have worked with Automation or AI products in the past. You have experience building partnerships with marketing agencies."}, "skills": ["Partnership Management", "SaaS", "Negotiation", "Commercial Awareness", "Automation", "AI", "Marketing Agencies"], "postedDate": "1 month ago", "benefits": "Comprehensive benefits package, including health insurance, retirement plans, and more. Opportunities for professional development and career advancement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3978169165"}