{"jobTitle": "Customer Support Specialist", "company": {"name": "Whop", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$48,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Software Development", "description": "About Whop<br/><br/>Whop is on a mission to create a new paradigm of the internet – where connection, consumption, creation and commerce can happen all in one place. People come to Whop every month, from nearly every country, to learn new things, meet new people, and elevate their daily lives.<br/><br/>Less than 3 years into our existence, we have enabled tens of thousands of creators to earn nearly $400M by selling access to increasingly diverse digital offerings. Our apps infrastructure allows anyone to build a digital experience, and our marketplace offers creators a sleek storefront that can accept payments, seamlessly deliver digital products, and attract new customers.<br/><br/>We envision a future in which everyone is an internet entrepreneur. Join us in making that future a reality.<br/><br/>About The Role<br/><br/>Title: Customer Support Specialist<br/><br/>✅ Salary: $48,000<br/><br/>📍 Remote: This role can work in any location that allows for working hours between 8:00am - 4:00pm, 4:00pm - 12:00am, and 12:00am - 8:00am. Mon-Sat or Sun EST.<br/><br/>What does the role look like?<br/><br/>As a Customer Support Specialist, you'll be the primary point of contact for users and creators, addressing their inquiries through live chat using Intercom. You'll troubleshoot and resolve various issues, ensuring that your responses are clear and comprehensive. In cases where the problem requires additional expertise, you'll work closely with your colleagues to find solutions and escalate matters when necessary. Your focus will be on maintaining a high standard of customer satisfaction through prompt, effective, and friendly service.<br/><br/>Your First 30 Days Will Look Like The Following<br/><br/><ul><li>Within 7 days, you’ll get introduced to the team, and learn about the products and services you'll be supporting. Receive initial training on communication tools like Intercom, and start understanding basic workflows and customer support processes.</li><li>Within 14 days, you’ll begin shadowing experienced team members to observe customer interactions, then begin handling simple tickets with supervision. Learn about escalation procedures and review the knowledge base for common customer issues and solutions.</li><li>Within 21 days, you’ll start managing your own tickets independently while collaborating with other teams to resolve complex issues. Focus on effective communication, customer satisfaction, and participate in team meetings to contribute to process improvements.</li><li>Within 30 days, you’ll take on a full caseload of tickets, demonstrating proficiency in problem-solving and customer interaction. Engage in cross-functional collaboration as needed, and receive performance feedback to identify areas for further development and set goals for the next 60 days.<br/><br/></li></ul>Who You Are<br/><br/><ul><li>Experience with Whop. You’ve personally used our platform and have a deep understanding on how things work already.</li><li>E-commerce knowledge or experience. You have a deep understanding of e-commerce.</li><li>Analytical and Strategic. You are capable of both thinking strategically and rolling up your sleeves to get down into the details.</li><li>Problem Solver. You find creative solutions to complex problems.</li><li>Polished Communicator. You are the best communicator you know, with exceptional written and verbal communication skills in English.<br/><br/></li></ul>What You Will Be Doing<br/><br/><ul><li>Serve as the first point of contact for users and creators, handling inquiries via Intercom.</li><li>Troubleshoot and resolve user and creator issues, providing clear and comprehensive guidance.</li><li>Collaborate with other team members to address complex customer concerns and escalate issues when necessary.</li><li>Maintain a high level of customer satisfaction through responsive, effective, and friendly support.</li><li>Participate in team meetings and contribute to continuous improvement of customer support processes.<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Prior experience in customer support, customer service, or a similar role.</li><li>Excellent communication skills, both written and verbal.</li><li>Strong problem-solving abilities and a customer-centric mindset.</li><li>Ability to multitask and manage time effectively in a fast-paced environment.</li><li>Familiarity with Whop, Intercom, Slack, and Linear is a plus.</li><li>Flexibility to work during different shifts, including nights and weekends.</li></ul>", "responsibilities": "As a Customer Support Specialist, you'll be the primary point of contact for users and creators, addressing their inquiries through live chat using Intercom. You'll troubleshoot and resolve various issues, ensuring that your responses are clear and comprehensive. In cases where the problem requires additional expertise, you'll work closely with your colleagues to find solutions and escalate matters when necessary. Your focus will be on maintaining a high standard of customer satisfaction through prompt, effective, and friendly service.", "qualifications": {"required": "Prior experience in customer support, customer service, or a similar role. Excellent communication skills, both written and verbal. Strong problem-solving abilities and a customer-centric mindset. Ability to multitask and manage time effectively in a fast-paced environment. Familiarity with Whop, Intercom, Slack, and Linear is a plus. Flexibility to work during different shifts, including nights and weekends."}, "skills": ["Intercom", "Slack", "Linear", "Customer Support", "Customer Service", "Problem Solving", "Communication"], "postedDate": "1 week ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3979740074"}