{"jobTitle": "Rental Sales Manager", "company": {"name": "PEAK Technologies", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Events Services", "description": "We are looking for a **Rental Sales Manager (RSM**),** to join our team remotely.\n\nAs a Rental Sales Manager (RSM), assume responsibility for managing and growing PEAK’s equipment rental business throughout North America. This position will lead, service and manage all aspects of Equipment Rental client accounts which include Event Production Companies, AV Companies and Independent Producers. An RSM is also responsible for receiving, proposing & confirming the majority of PEAK *local inbound sales inquiries* which will be serviced from one of PEAK’s four locations in the U.S. and Canada.\n\n**RESPONSIBILITIES:**\n\n* A RSM is responsible for overseeing the rental of AV equipment and ensuring the profitability and achievement of rental sales goals. This role must establish open communications and key working relationships with PEAK operations and project management personnel who execute equipment rental jobs throughout North America.\n* Must have good general knowledge of audio, video, lighting and rigging equipment, and the application of this technology in an event and trade show environment. Additionally, an RSM must have in-depth knowledge of PEAK equipment inventory and the real-time rental availability of this equipment company wide.\n* Recognize and develop business opportunities with new and existing clients. Build and maintain relationships throughout the client organization and at all management levels.\n* Develop price quotations and bid responses that are complete, accurate, and profitable. Maintain a strong sales pipeline with detailed reporting and meet or exceed monthly sales quotas\n* Manage a core revenue of $2,000,000 or greater and generate 20% growth of this business annually.\n* Ability to sell and communicate company’s entire suite of AV equipment solutions.\n* Lead all aspects of capabilities presentations, sales presentations, pitches and proposal generation for existing client base and prospects.\n* Drive the strategy and creative direction of the Equipment Rental business company-wide and communicate with the internal teams to ensure that client goals are being met.\n* Clearly represent their client’s needs, while guiding internal teams with their knowledge and insights of the client and the client’s business throughout the project life cycle, from concept development through delivery and final billing.\n\n**OTHER SKILLS AND RESPONSIBILITIES**\n\n* Previous experience operating AV & Lighting equipment in an event or trade show environment.\n* Recent sales or account management experience in the event or trade show industry (preferred, not required)\n* Must be passionate about sales, account management, working with people and be customer centric.\n* Must be a strategic thinker - maintains big picture view.\n* Thrives in an entrepreneurial and independent environment.\n* Identifies something valuable in being part of a team and ability to effectively collaborate.\n* Must be able to develop excellent rapport with existing and prospective clients.\n* Exhibit the ability to multi-task, sell, and operate under severe time constraints and immovable deadlines. Good organization, detail and follow-up skills are required.\n* Proficient in using Microsoft office programs.\n\n**EDUCATION and/or EXPERIENCE**\n\nBachelor's degree (B. A. or B.S.) from four-year college or university and/or 5+ years related experience as an AV Technician in the event and trade show industry, or equivalent combination of education and experience.\n\n**Peak Technologies Benefits**\n\nPeak Technologies offer a comprehensive benefit package including: Medical, Dental, Vision, Life, LTD, 401(k), Flexible Time Off and Holiday pay as well as competitive salaries and the opportunity for growth within our exciting industry!", "postedDate": "4 weeks ago", "skills": ["Sales", "Account Management", "Event Production", "AV Equipment", "Customer Service", "Microsoft Office", "Strategic Thinking", "Teamwork", "Communication", "Time Management", "Detail Oriented", "Follow-up"], "url": "https://www.linkedin.com/jobs/view/3980672859"}