{"jobTitle": "Senior Account Executive", "company": {"name": "Nike Communications, Inc.", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000.00/yr - 70,000.00/yr", "currency": "USD"}, "jobFunction": "Public Relations, Strategy/Planning, and Writing/Editing", "industry": "Public Relations and Communications Services, Food and Beverage Services, and Travel Arrangements", "description": "<strong><u>About Us</u></strong> <p>Established in 1984 and celebrating its 40th Anniversary this year, Nike Communications is a female-founded creative communications firm specializing in the marketing of prestige brands. We create meaningful connections between some of the world’s most iconic brands and their audiences by utilizing diverse perspectives to develop culturally relevant client campaigns. We believe differences fuel the creative spirit; that by embracing diverse perspectives and cultures, innovation can flourish, and creativity will shine through in each story we tell.</p><p><br/></p><p><strong><u>DEI Statement</u></strong></p><p>Differences fuel the creative spirit. </p><p><br/></p><p>At Nike Communications, we recognize that diversity, equity, and inclusion are critical components to our success, and we are deeply committed to creating a workplace that values and supports the unique talents and perspectives of every individual. We are passionate about building an agency that truly reflects the diversity of our world, and we firmly believe that fostering a culture of inclusivity and equity is a fundamental responsibility shared by everyone within our agency. </p><p><br/></p><p><strong><u>More About the Role</u></strong> </p><p>Join our Travel team as a New York-based Senior Account Executive! Dive into a dynamic role, working on a variety of accounts across the Travel industry. Your chance to fuel the creative spirit starts here! </p><p><br/></p><p><strong><u>Responsibilities</u></strong></p><ul><li><strong>Media Relations Mastery</strong>: Leads by example in securing earned media, focusing on marquee feature stories in top national outlets and emerging media platforms. </li><li><strong>Build Lasting Relationships</strong>: Cultivates genuine relationships with journalists and media members, fostering trust and mutual respect. </li><li><strong>Bring Events to Life</strong>: Assists with facilitating media events and product launches, ensuring every detail is perfect and every attendee feels welcome. </li><li><strong>Shape Media Campaigns Together</strong>: Participates in strategy and brainstorming sessions to help plan and execute media campaigns. </li><li><strong>Team Mentorship &amp; Development</strong>: Supports the growth and advancement of junior staff through mentoring, development, and retention efforts. </li><li><strong>Communicate with Care</strong>: Serves as a trusted contact and resource for clients, providing support and guidance with professionalism and empathy. </li><li><strong>Brand Collaborations &amp; Partnerships</strong>: Participates in the ideation, execution, and recommendation of brand collaborations, partnerships, talent-led campaigns, and event strategies, leveraging creativity to resonate with key media and target audiences. </li></ul><p><br/></p><p><strong><u>Qualifications</u></strong> </p><ul><li><strong>Professional Experience</strong>: Minimum of 3 years of experience in public relations and media relations </li><li><strong>Passion &amp; Industry Knowledge</strong>: Genuine enthusiasm and in-depth knowledge of the Beauty, Fashion, Wellness, and/or Lifestyle industries with a proven track record of delivering impactful stories across diverse media </li><li><strong>Build &amp; Maintain Lasting Relationships</strong>: Cultivates and maintains genuine relationships with top media outlets and key freelance writers, fostering trust and mutual respect. </li><li><strong>Communication Skills</strong>: Exceptional written, verbal, and interpersonal communication skills online and in-person </li><li><strong>Travel Flexibility</strong>: Embraces opportunities to travel for work-related events or meetings, allowing for engagement and collaboration across diverse settings </li><li><strong>Media Landscape Mastery</strong>: Possesses a comprehensive understanding of the media landscape, including print, online, broadcast and new-media (i.e. podcast) channels, enabling effective media outreach and engagement</li><li><strong>Commitment to Diversity, Equity and Inclusion</strong>: Embodies the values of diversity, equity, and inclusion; demonstrates self-awareness, cultural competency, and the ability to work with people from diverse cultures and backgrounds </li><li><strong>Adaptability</strong>: Ability to thrive in a dynamic workplace, showcasing adaptability and resilience</li></ul><p> </p><p><strong>The salary range is $65,000-$70,000 annually</strong>. </p><p><br/></p><p><strong><u>Benefits</u></strong></p><ul><li><strong>Health Benefits</strong>: Options for medical coverage through UnitedHealthcare, and Dental and Vision coverage through Principal </li><li><strong>Financial Security</strong>: Contribute to 401(k) plan for retirement with the potential agency contribution via year-end profit sharing </li><li><strong>Time Off</strong>: Enjoy 15 vacation days, with an extra day off on your birthday month </li><li><strong>Holiday Closure</strong>: Agency closed between Christmas and New Years for a well-deserved break, as well as 10 other holidays throughout the calendar year </li><li><strong>Summer Flexibility</strong>: Summer Fridays offer shorter work hours from Memorial Day to Labor Day </li><li><strong>Family Support</strong>: Benefit from 12 weeks of paid parental leave and formal policies to support working parents </li><li><strong>Cell Phone Benefit Options</strong>: Transfer your personal number or get a new business phone fully covered by the agency </li><li><strong>Technology</strong>: Company provided laptop and accessories, along with IT support </li><li><strong>Bonuses</strong>: Potential for discretionary end-of-year bonuses </li><li><strong>Agency Bonding</strong>: Engage in happy hours and our annual agency-wide offsite for camaraderie and celebration </li><li><strong>Emphasis on DEI</strong>: A variety of specialized employee resource groups, DEI programming and other initiatives </li></ul><p><br/></p><p>Nike Communications, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws. </p><p><br/></p><p>Nike Communications, Inc. is committed to providing access, equal opportunity, and reasonable accommodations for individuals with disabilities in employment, its services, programs, and activities.</p>", "responsibilities": "Leads by example in securing earned media, focusing on marquee feature stories in top national outlets and emerging media platforms. Cultivates genuine relationships with journalists and media members, fostering trust and mutual respect. Assists with facilitating media events and product launches, ensuring every detail is perfect and every attendee feels welcome. Participates in strategy and brainstorming sessions to help plan and execute media campaigns. Supports the growth and advancement of junior staff through mentoring, development, and retention efforts. Serves as a trusted contact and resource for clients, providing support and guidance with professionalism and empathy. Participates in the ideation, execution, and recommendation of brand collaborations, partnerships, talent-led campaigns, and event strategies, leveraging creativity to resonate with key media and target audiences.", "qualifications": {"required": "Minimum of 3 years of experience in public relations and media relations Genuine enthusiasm and in-depth knowledge of the Beauty, Fashion, Wellness, and/or Lifestyle industries with a proven track record of delivering impactful stories across diverse media Cultivates and maintains genuine relationships with top media outlets and key freelance writers, fostering trust and mutual respect. Exceptional written, verbal, and interpersonal communication skills online and in-person Embraces opportunities to travel for work-related events or meetings, allowing for engagement and collaboration across diverse settings Possesses a comprehensive understanding of the media landscape, including print, online, broadcast and new-media (i.e. podcast) channels, enabling effective media outreach and engagement Embodies the values of diversity, equity, and inclusion; demonstrates self-awareness, cultural competency, and the ability to work with people from diverse cultures and backgrounds Ability to thrive in a dynamic workplace, showcasing adaptability and resilience", "preferred": ""}, "skills": ["Media Relations", "Public Relations", "Media Strategy", "Event Management", "Communication", "Relationship Building", "Brand Partnerships", "Travel Industry", "Media Landscape", "Diversity & Inclusion"], "postedDate": "4 weeks ago", "benefits": "Options for medical coverage through UnitedHealthcare, and Dental and Vision coverage through Principal Contribute to 401(k) plan for retirement with the potential agency contribution via year-end profit sharing Enjoy 15 vacation days, with an extra day off on your birthday month Agency closed between Christmas and New Years for a well-deserved break, as well as 10 other holidays throughout the calendar year Summer Fridays offer shorter work hours from Memorial Day to Labor Day Benefit from 12 weeks of paid parental leave and formal policies to support working parents Transfer your personal number or get a new business phone fully covered by the agency Company provided laptop and accessories, along with IT support Potential for discretionary end-of-year bonuses Engage in happy hours and our annual agency-wide offsite for camaraderie and celebration A variety of specialized employee resource groups, DEI programming and other initiatives", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3980368152"}