{"jobTitle": "Event Coordinator", "company": {"name": "COREcruitment Ltd", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$50,000.00/yr - $50,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development", "industry": "Hospitality and Hotels and Motels", "description": "<strong>Event Planner - $50,000 + Benefits + PTO - US Remote</strong> <strong>(West Coast Hours)</strong><p><br/></p><p><strong>About the company: </strong></p><p>My client, a Global Travel and Events Company, is growing their events team! This company promises a fulfilling career path, a welcoming work environment with ample opportunities for growth, and a comprehensive benefits package. With ambitious growth initiatives underway, you will play a pivotal role in supporting their clients.</p><p><br/></p><p><strong>Responsibilities</strong>:</p><ul><li>Help to develop and implement strategic plans to meet the client's diverse event activity requests across multiple locations in the United States</li><li>Handle all administrative tasks related to event planning, including budget management, contracts, and documentation</li><li>Source and coordinate a variety of activities and experiences tailored to the client's event requests, ensuring high-quality service and satisfaction</li><li>Liaise with vendors and service providers to negotiate contracts and secure the best options for the client's events</li></ul><p><br/></p><p><strong>Requirements:</strong></p><ul><li>Proven experience in planning diverse events</li><li>Experience with Cvent highly regarded</li><li>2+ years of current event planning experience</li><li>Self-motivated with a positive and enthusiastic demeanor.</li><li>Effective client-facing and presentation abilities</li></ul><p><br/></p><p><em>If you are keen to discuss the details further, please apply today or send your cv to Nastasija at COREcruitment dot com</em></p>", "responsibilities": "Help to develop and implement strategic plans to meet the client's diverse event activity requests across multiple locations in the United States, Handle all administrative tasks related to event planning, including budget management, contracts, and documentation, Source and coordinate a variety of activities and experiences tailored to the client's event requests, ensuring high-quality service and satisfaction, Liaise with vendors and service providers to negotiate contracts and secure the best options for the client's events", "qualifications": {"required": "Proven experience in planning diverse events, Experience with Cvent highly regarded, 2+ years of current event planning experience, Self-motivated with a positive and enthusiastic demeanor., Effective client-facing and presentation abilities"}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": "", "benefits": "$50,000 + Benefits + PTO", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3981952893"}