{"jobTitle": "Demand Manager", "company": {"name": "TBC Corporation", "location": "Palm Beach Gardens, FL"}, "location": "Palm Beach Gardens, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Wholesale", "description": "<strong>Company Overview</strong><p>With $5 billion in revenue and 3,800+ employees in the U.S., Mexico and Canada, TBC Corporation is a leader in the mobility industry and one of North America’s largest marketers of automotive replacement tires through wholesale and franchise operations. TBC serves wholesale customers in the United States, Canada and Mexico through TBC Brands, NTW, TBC International, and TBC de Mexico. Additionally, TBC responds to the needs of consumers in search of total car care at more than 2,000 franchised tire and automotive service centers under the Big O Tires® and Midas®. TBC is headquartered in Palm Beach Gardens, Florida.</p><p><br/></p><p>TBC markets on a wholesale basis to regional tire chains and distributors serving independent tire dealers throughout the US, Canada, and Mexico. TBC has 20 proprietary brands of tires specializing in passenger, commercial, farm and specialty tires. In 2005, TBC Corp. was purchased by Sumitomo Corporation of America (SCOA). SCOA is the largest subsidiary of Sumitomo Corporation, one of Japan’s major integrated trading and investment business enterprises. In 2018 Michelin, the largest tire manufacturer in Europe, invested in the company which is now a 50:50, privately held joint venture between Sumitomo and Michelin.</p><p><br/></p><p>Our values are the foundation of our work, how we interact with each other, and the strategies we employ to fulfill our purpose. These are the practices we use every day – in everything we do:</p><ul><li>Integrity - We act honestly because nothing is more important than our reputation.</li><li>Teamwork - We are better together.</li><li>People-Focused - We put people first – our Associates, customers, franchisees, and partners – and cultivate a respectful, collaborative, and inclusive culture, top to bottom, inside and out.</li><li>Accountability - We own our actions and decisions; we do what we say we are going to do.</li><li>Leave Everything Better - We innovate to improve everything we touch, and we take actions now to protect the future.</li></ul><p><br/></p><p><strong>Description</strong></p><p>Participate in demand planning duties, including optimizing future product demand forecasts. Optimize Sales planning to serve consumers, drive profitable growth, and deliver revenue targets. The Demand Planner will be responsible for KPI performance.</p><p><br/></p><p>This role will be a hybrid work environment.</p><p><br/></p><p><strong>Job Responsibilities</strong></p><ul><li>Hands on technical manager that manages the design, implementation, and on-going maintenance of statistical forecasts for all businesses in a formal demand planning solution delivering analytical insights and results that drive actions and quantifiable business results</li><li>Build demand planning models and provide risk analysis based on “what if” scenarios to drive strategic decisions and supporting a demand/financial forecast.</li><li>Present insights and recommendations to executive and business stakeholders discovered from data analysis and statistical/machine learning algorithms</li><li>Implement continuous improvement of the statistical forecasting process (process, forecast accuracy / bias &amp; forecast improvement)</li><li>Ensure correct historical data cleansing during deployment and implement processes to allow data cleansing in a routing mode during each forecast cycle</li><li>Be a leader in driving process improvements and automation for demand planning tools to reduce manual data aggregation and increase visibility to the forecast analysis.</li><li>Act as a key contributor in demand reviews, sharing data driven alternatives to optimize the business in clear and succinct written format for both short and long term demand planning.</li><li>Review historical sales trends, research demand drivers, validate sales inputs, develop statistical forecast models, and evaluate forecast results for both tops down and bottoms up planning.</li><li>Work closely with channel and regional owners to understand the nuances of each unique sales channel and reconcile significant variances, refine forecasts to reflect updated sales and marketing strategies, and reduce forecast model variance across channels.</li><li>Understand NPI/PIPO roadmaps to manage product transitions through the full product life cycle.</li><li>Dive deep with product management, sales channel owners, supply planning, marketing, and finance to understand demand forecast drivers and the downstream impacts of forecast changes.</li><li>Support the engagement with channel teams to collaborate on forecasting, and ensure that current and accurate information is used for demand forecasts through both formalized and ad hoc processes and reporting.</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>Bachelor’s degree in business administration or supply chain required. Masters preferred.</li><li>APICS or equivalent Supply Chain certification preferred.</li><li>5-7+ years demand forecasting or relevant experience with statistical forecasting</li><li>Advanced experience in JDA – Blue Yonder, SAP APO, IBP, or similar Demand Planning software</li><li>Advanced analytical skills - ability to brainstorm, gather data, detect outliers or trends, interpret data, and make decisions based on multiple different data points.</li><li>Proven track record of effectively collaborating with other supply chain functions, and company stakeholders including sales, purchasing, pricing, marketing, inventory, transportation, warehousing and finance.</li><li>Experienced forecasting skills – utilize multiple different forecasting metrics (% bias, turns, %ABS, etc) to determine a strategic and accurate forecast.</li><li>Proficient in Microsoft Office with high-level capabilities in Excel</li><li>Strong business acumen and understanding of inventory policies, P&amp;L’s and operating performance metrics.</li><li>Positive, solution-focused attitude with a team-oriented growth mindset</li><li>Focus on continuous improvement.</li><li>Excellent verbal and written communication skills including influencing skills.</li><li>Solid knowledge of advanced mathematical, statistical, and forecasting policies is required.</li></ul><p><br/></p><p><strong>Benefits</strong></p><ul><li>Competitive compensation</li><li>401k plan with a company match. Immediate 100% vesting</li><li>Generous paid vacation and paid time off</li><li>Comprehensive benefits including medical, dental and vision</li><li>Company paid short term disability and employer subsidized long term disability</li><li>Tuition Reimbursement</li><li>Employee Assistance Program</li><li>Company paid life insurance</li><li>Discounted tire purchasing</li><li>And more!</li></ul><p><br/></p><p>TBC Corporation is an Equal Opportunity Employer and maintains a Drug-Free Work Environment.</p>", "responsibilities": "Participate in demand planning duties, including optimizing future product demand forecasts. Optimize Sales planning to serve consumers, drive profitable growth, and deliver revenue targets. The Demand Planner will be responsible for KPI performance.", "qualifications": {"required": "Bachelor’s degree in business administration or supply chain required. Masters preferred. APICS or equivalent Supply Chain certification preferred. 5-7+ years demand forecasting or relevant experience with statistical forecasting Advanced experience in JDA – Blue Yonder, SAP APO, IBP, or similar Demand Planning software Advanced analytical skills - ability to brainstorm, gather data, detect outliers or trends, interpret data, and make decisions based on multiple different data points. Proven track record of effectively collaborating with other supply chain functions, and company stakeholders including sales, purchasing, pricing, marketing, inventory, transportation, warehousing and finance. Experienced forecasting skills – utilize multiple different forecasting metrics (% bias, turns, %ABS, etc) to determine a strategic and accurate forecast. Proficient in Microsoft Office with high-level capabilities in Excel Strong business acumen and understanding of inventory policies, P&L’s and operating performance metrics. Positive, solution-focused attitude with a team-oriented growth mindset Focus on continuous improvement. Excellent verbal and written communication skills including influencing skills. Solid knowledge of advanced mathematical, statistical, and forecasting policies is required.", "preferred": ""}, "skills": ["Demand Planning", "Statistical Forecasting", "JDA", "Blue Yonder", "SAP APO", "IBP", "Supply Chain", "Data Analysis", "Microsoft Office", "Excel", "Business Acumen", "Inventory Management", "Continuous Improvement", "Communication"], "postedDate": "3 weeks ago", "benefits": "Competitive compensation 401k plan with a company match. Immediate 100% vesting Generous paid vacation and paid time off Comprehensive benefits including medical, dental and vision Company paid short term disability and employer subsidized long term disability Tuition Reimbursement Employee Assistance Program Company paid life insurance Discounted tire purchasing And more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3981865240"}