{"jobTitle": "Call Center Representative (CCR)", "company": {"name": "New York City Office of Technology & Innovation", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Customer Service", "industry": "Government Administration", "description": "<strong>Call Center Representative (CCR) at NYC311</strong><br/>\n\n<strong>New York City Civil Service Exam Announcement</strong><br/>\n\n<strong> </strong><br/>\n\n<ul><li>Are you a customer service professional or interested in a career in customer service?</li><li>Are you interested in excellent benefits and pension plans?</li><li>Are you ready to make a difference working for the greatest city in the world?</li></ul><br/>\n\n<strong>If your answers are YES, you may be qualified to take this exam and be considered for employment at NYC’s 311 Call Center!</strong><br/>\n\n<br/>\n\nWorking at NYC311 is your opportunity to make a difference in the lives of New Yorkers every day. The heart and soul of NYC311 are the people doing the talking, texting, and tweeting—our Call Center Representatives (CCRs).<br/>\n\n<br/>\n\nThere's no better gateway to a career in public service. As a CCR, you'll join an award-winning team of problem solvers dedicated to delivering outstanding customer service.<br/>\n\n<br/>\n\nEach day, you will engage with New Yorkers and help them:<br/>\n· Navigate City services and programs<br/>\n· File Service Requests<br/>\n· Connect with City Agencies<br/>\n\n<br/>\n\nAs a City employee, you’ll enjoy:<br/>\n· Competitive salary<br/>\n· Paid holidays, annual leave, and sick leave<br/>\n· Health benefits with dental, vision, and drug coverage<br/>\n· Pension and retirement savings plans<br/>\n\n<br/>\n\n<br/>\n\n<strong>APPLY NOW! Time is running out – application deadline is August 27, 2024</strong><br/>\n\n<strong> </strong><br/>\n\n<strong> </strong><br/>\n\n<br/>\n\n<strong>For more detailed information and to apply for this exam click on this link: </strong>https://a856-exams.nyc.gov/OASysWeb/exams<br/>\n\n<strong> </strong><br/>\n\n<br/>\n\n<em>The City of New York are inclusive equal opportunity employers committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.</em>", "postedDate": "3 weeks ago", "benefits": "Competitive salary, Paid holidays, annual leave, and sick leave, Health benefits with dental, vision, and drug coverage, Pension and retirement savings plans", "skills": [], "url": "https://www.linkedin.com/jobs/view/3982204822"}