{"jobTitle": "Customer Service Agent In training", "company": {"name": "Foley", "location": "South Carolina, United States"}, "location": "South Carolina, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$17 per hour", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Missions are accomplished with people, driving towards a greater purpose. Foley has been a trusted partner to motor carriers of all sizes. Our technologically advanced approach to DOT compliance automates many of the background screening and compliance requirements motor carriers must comply with- making it easier for them to onboard and retain the right driver for their business. At Foley we just don't help our customers stay compliant - we help them thrive. A positive attitude is everything. At Foley, we've created a culture that rewards kindness, enthusiasm, and a can-do attitude. Whether we're working together internally or helping a customer solve a problem, we approach every challenge with a sense of humor, optimism, and the determination to succeed.<br/><br/><strong> Compliance Customer Service Agent<br/><br/></strong><strong>This is a remote option- those residing in MA, SC, GA, FL, TX are welcome to apply!<br/><br/></strong>This Foley opportunity is full-time within the hours of 8 am- 8 pm est. Monday-Friday, evening availability is required.<br/><br/>Two evening shifts per week will be necessary.<br/><br/>This position pays starting at $17 per hour.<br/><br/>We're in search of a motivated, highly organized Compliance Customer Service Agent to join our team. In this pivotal role, your primary focus will be to support our clients, their drivers, and candidates in their understanding of the D.O.T. and FCRA regulations and ensuring their effective use of our platform and services to support their compliance with both.<br/><br/>Exceptional communication skills, both verbal and written, as well as a proven ability to manage multiple responsibilities, are essential requirements for this position.<br/><br/>Our work environment fosters internal development, wherein we not only promote but also predict progression in career paths. With our expansion underway, we're seeking the most brilliant minds to join us! If you're eager to become part of a dynamic crew of self-driven individuals who recognize that customer service is the cornerstone of triumph, we're eager to receive your application<br/><br/><strong>ROLE SUMMARY:<br/><br/></strong>As a <strong>Compliance Customer Service Agent</strong> your responsibilities include:<br/><br/><ul><li></li><li> Conduct employment verifications on new applicants seeking employment with our client</li><li> Contact varies companies, to gather and verify information crucial to employment verification</li><li></li><li> Respond to verbal and written client questions or concerns</li><li></li><li> Review driver documents in accordance with required standards for approval</li><li></li><li> Compile and process essential compliance documents and permits</li><li></li><li> Maintain your understanding of Regulations and Foley products and services through continuous learning</li><li></li><li> Frequent database entry for status changes across multiple platforms</li><li></li><li> Understand and educate our client on Regulatory Drug Testing and background checks as required</li><li></li><li> Support Department of Transportation compliance activities</li><li> Promote a favorable reputation for the company and deliver outstanding customer service to both colleagues and clients</li><li></li><li> Strict adherence to the applicable federal laws and company policies and procedures are a must<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>Exceptional communication skills-verbal and written</li><li> Remote experience</li><li>Reliable internet connectivity and peaceful working environment</li><li>Flexibility for shift-based work, including evenings</li><li>Proven ability to multi-task</li><li>Capability to adjust to shifting priorities</li><li>Experience in and the aptitude to provide exceptional customer service</li><li>Motivated individual with a proactive approach</li><li>Strong work ethic and exceptional integrity</li><li>Proficient in upholding confidentiality and professionalism</li><li>Strong computer skills in Microsoft Office, Outlook, and the ability to utilize internal systems</li><li>Strong organizational and prioritization skills</li><li>A strong desire to develop a long-term professional growth<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>WHAT YOU'LL LOVE ABOUT FOLEY<br/><br/></strong><strong>The people! </strong>Our employees and customers consistently express the best thing about Foley is our close-knit, exceptionally talented teams. Check out our customers' feedback - on Trustpilot.<br/><br/><strong>Outstanding benefits. </strong>3 medical plans to choose from, 2 level dental, and 2 level vision plans. Generous vacation, sick, and personal time off. 401K plan with a match. We've got your back so you can live your best life.<br/><br/><strong>It's about ideas over egos.</strong> You will have the freedom to explore new ideas and approaches in an entrepreneurial environment, supported by a collaborative team.<br/><br/><strong>Professional growth.</strong> We open our roles to our employees first and encourage them to apply for growth opportunities. Our People Operations team is available to discuss career growth and help put a plan in place, helping employees achieve the growth they crave.<br/><br/><strong>Our environment! </strong>We celebrate success and believe in transparency and teamwork to get us there. We invest in collaboration tools so you can meet with your team face to face. Many of our roles are remote and we want to ensure our employees are engaged and can interact with their peers in a virtual space.<br/><br/><strong>What We Do, How We Do It<br/><br/></strong>Too often, companies use a piecemeal approach when it comes to screening drivers. They might use one vendor to help recruit. Another to screen. And still, another to address the complex world that is compliance. This approach is inefficient, expensive, and redundant. Not to mention, it makes it too easy for things to fall through the cracks.<br/><br/>At Foley, we've built a company that effortlessly manages these three areas under one roof: recruit, screen, comply. Thanks to powerful technology combined with our compliance expertise, we're able to deliver a comprehensive solution to our customers and, as a result, a better overall customer experience.<br/><br/><strong>Where We're Headed<br/><br/></strong>We're always developing new solutions to slay tomorrow's recruitment, screening, and compliance monsters. At the core of these solutions is our vast collection of data—and the many ways to leverage it, whether that's developing software to calculate a company's compliance risk or implementing predictive analytics to identify the best drivers.<br/><br/><strong>What It's Like To Work With Us<br/><br/></strong>Diving deep into a niche industry and becoming an expert . . .<br/><br/>Continually growing and advancing . . .<br/><br/>Making lifelong friends during the process . . .<br/><br/>That sums up what it's like to work for us. We're a 250+ person company on the verge of explosive growth thanks to our AI-powered technology—and where it's headed with predictive analytics. If you'd like to board our rocket ship, check us out:<br/><br/>www.foleyservices.com", "responsibilities": "As a Compliance Customer Service Agent your responsibilities include:\n\n* Conduct employment verifications on new applicants seeking employment with our client\n* Contact varies companies, to gather and verify information crucial to employment verification\n* Respond to verbal and written client questions or concerns\n* Review driver documents in accordance with required standards for approval\n* Compile and process essential compliance documents and permits\n* Maintain your understanding of Regulations and Foley products and services through continuous learning\n* Frequent database entry for status changes across multiple platforms\n* Understand and educate our client on Regulatory Drug Testing and background checks as required\n* Support Department of Transportation compliance activities\n* Promote a favorable reputation for the company and deliver outstanding customer service to both colleagues and clients\n* Strict adherence to the applicable federal laws and company policies and procedures are a must", "qualifications": {"required": "High School Diploma or equivalent, Exceptional communication skills-verbal and written, Remote experience, Reliable internet connectivity and peaceful working environment, Flexibility for shift-based work, including evenings, Proven ability to multi-task, Capability to adjust to shifting priorities, Experience in and the aptitude to provide exceptional customer service, Motivated individual with a proactive approach, Strong work ethic and exceptional integrity, Proficient in upholding confidentiality and professionalism, Strong computer skills in Microsoft Office, Outlook, and the ability to utilize internal systems, Strong organizational and prioritization skills, A strong desire to develop a long-term professional growth"}, "skills": ["Customer Service", "Communication", "Microsoft Office", "Outlook", "Compliance", "DOT", "FCRA", "Database Entry", "Drug Testing", "Background Checks", "Professionalism", "Integrity", "Multitasking", "Prioritization", "Problem Solving"], "postedDate": "4 weeks ago", "benefits": "Outstanding benefits. 3 medical plans to choose from, 2 level dental, and 2 level vision plans. Generous vacation, sick, and personal time off. 401K plan with a match. We've got your back so you can live your best life.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982363668"}