{"jobTitle": "Commercial Account Manager", "company": {"name": "CareerPaths NW, LLC", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "55,000.00/yr - 65,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Our client's company, a family-owned independent agency specializes in Group Benefits, and Commercial and Personal lines of insurance. They offer a professional and somewhat conservative environment focused on Commercial Property, General Liabilities, Commercial Auto, Workers Comp, Flood, Earthquake, Employment Practices, Management Liabilities, and more. <br/><br/>With a team of 20 dedicated employees, they pride themselves on their company culture, office environment, and employee benefits plan. They are seeking a Commercial Account Manager (CSR) to join their team and manage a small to mid-market book of business.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage the entire renewal process for each account from start to finish</li><li>Negotiate with carriers and re-market rates</li><li>Process certificates and endorsements</li><li>Send quotes to clients and bind policies</li><li>Facilitate the renewal process, while brokers typically present renewals to clients<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum 3 years of Commercial Insurance experience with an independent agency</li><li>Residency within Oregon or Arizona</li><li>Stable work history, no job hoppers<br/><br/><br/></li></ul>This fully remote role is an excellent opportunity for an experienced account manager with an independent broker background. If you are a qualified candidate looking to thrive in a supportive and professional environment, we encourage you to apply and become a valued member of our client's team.", "responsibilities": "Manage the entire renewal process for each account from start to finish, Negotiate with carriers and re-market rates, Process certificates and endorsements, Send quotes to clients and bind policies, Facilitate the renewal process, while brokers typically present renewals to clients", "qualifications": {"required": "Minimum 3 years of Commercial Insurance experience with an independent agency, Residency within Oregon or Arizona, Stable work history, no job hoppers"}, "skills": [], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982457175"}