{"jobTitle": "Product Manager", "company": {"name": "Motion Recruitment", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$75,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management", "industry": "Staffing and Recruiting", "description": "<strong>Job Title: Product Manager<br/><br/></strong><strong>Location: </strong>Remote - Must be based on East Coast working on Eastern Standard Time<br/><br/><strong>Must have qualification</strong>: Experience working on a dating application or social media application.<br/><br/><ul><li> All candidates must be located an authorized to work here in the US. No C2C inquiries, please. **<br/><br/></li></ul><strong>Job Description<br/><br/></strong>Our client is a leading software company operating some of the world's largest social dating apps for the LGBTQ+ community, with a focus on user privacy and security. Their innovative platforms, which reach over 30 million members worldwide, allow users to connect, meet, and express themselves freely without the interference of third-party ad networks. The company boasts a fully remote and global team spread across North America, South America, and Europe, and is committed to fostering a collaborative and inclusive work environment.<br/><br/>In this role, you will serve as a Product Manager, taking on a customer-facing, hands-on position crucial to the development and enhancement of our client's applications. You'll be involved in every aspect of the product lifecycle, from conceptualizing new features to developing and launching innovative products. Working closely with product leaders, developers, designers, support, and marketing teams, you will ensure that the applications continue to provide excellent user experiences. This position requires a balance of customer-centric and business-oriented thinking, along with a passion for improving online community interactions.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>Experience working on a dating application or social media application </li><li>3+ years of Product Management experience </li><li>Proficient in roadmap management and prioritization </li><li>Strong writing skills with experience in creating epics and stories </li><li>Familiarity with tools such as Figma/Figjam, Productboard, Pivotal, Google Suite, MixPanel, and MoEngage </li><li>Experience in working towards KPIs and developing new metric-based KPIs </li><li>Skilled in A/B testing </li><li>Passion for the online dating space and fostering meaningful connections </li><li>High sense of ownership and accountability </li><li>Data-driven decision-maker </li><li>Interest in Go-To-Market and Product Marketing </li><li>Ability to provide direct, humble feedback in a low-ego environment </li><li>Detail-oriented with a commitment to delivering high-quality products <br/><br/></li></ul><strong>Responsibilities:<br/><br/></strong><ul><li>Drive product development from iterative feature improvements to new product launches </li><li>Enhance efficiency in product and delivery areas to ensure consistent and predictable outcomes </li><li>Define product needs and pain points based on consumer feedback and market trends </li><li>Collaborate with the Engineering lead on delivery processes, task management, QA, and UAT </li><li>Work with the Director of Product Management to enhance your skills and advance within the company </li><li>Collaborate with the data team to quantitatively assess the success and performance of features </li><li>Align work hours with team members across different regions, including the EU <br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Salary range: $75,000 - $150,000, depending on experience </li><li>11 Paid Holidays and one paid week off at mid-year </li><li>Home Office Stipend for setting up your workspace </li><li>Paid Parental Leave </li><li>Opportunities for paid travel to meet and collaborate with colleagues </li><li>Paid volunteer days </li><li>Educational/Tuition Reimbursement </li><li>For U.S.-based employees: 401k plan with 6% match, comprehensive healthcare coverage, and flexible time off <br/><br/></li></ul>Our client is an Equal Opportunity Employer, committed to diversity and inclusion. They do not discriminate based on race, religion, gender, sexual orientation, or any other legally protected characteristic. Your information will be kept confidential in accordance with EEO guidelines.<br/><br/><strong>Posted By:</strong> Jason Weiss<br/><br/>", "responsibilities": "<ul><li>Drive product development from iterative feature improvements to new product launches </li><li>Enhance efficiency in product and delivery areas to ensure consistent and predictable outcomes </li><li>Define product needs and pain points based on consumer feedback and market trends </li><li>Collaborate with the Engineering lead on delivery processes, task management, QA, and UAT </li><li>Work with the Director of Product Management to enhance your skills and advance within the company </li><li>Collaborate with the data team to quantitatively assess the success and performance of features </li><li>Align work hours with team members across different regions, including the EU <br/><br/></li></ul>", "qualifications": {"required": "Experience working on a dating application or social media application.", "preferred": null}, "skills": ["Product Management", "Roadmap Management", "Prioritization", "Writing", "Epics", "Stories", "Figma", "Figjam", "Productboard", "Pivotal", "Google Suite", "MixPanel", "MoEngage", "KPIs", "A/B Testing", "Online Dating", "Data-Driven Decision Making", "Go-To-Market", "Product Marketing", "Feedback", "Detail-Oriented"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Salary range: $75,000 - $150,000, depending on experience, 11 Paid Holidays and one paid week off at mid-year, Home Office Stipend for setting up your workspace, Paid Parental Leave, Opportunities for paid travel to meet and collaborate with colleagues, Paid volunteer days, Educational/Tuition Reimbursement, For U.S.-based employees: 401k plan with 6% match, comprehensive healthcare coverage, and flexible time off", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3982304481"}