{"jobTitle": "Expression of Interest - Internal Recruiter", "company": {"name": "Marlee (Fingerprint For Success)", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "We are inviting professionals in high-growth industries who are thinking about their next move or looking for a new opportunity to join our expanding talent pool.<br/><br/>The Marlee Talent Pool is a pilot project designed to:<br/><br/><ul><li>Help job seekers get discovered by our partners based on their anticipated hiring needs</li><li>Provide optional support and resources for job seekers in their career endeavours</li><li>Help individuals understand, and bring out the best in themselves and each other<br/><br/></li></ul>The Marlee Talent Pool process:<br/><br/>Once you express your interest, you will be asked to complete the Marlee work style assessment which measures 48 key attitudes and motivations in the context of work. On completion, you will be automatically added to our growing talent pool and contacted as new opportunities arise.<br/><br/><strong>About Marlee (Fingerprint For Success)<br/><br/></strong>Backed by 20+ years of research, Marlee’s revolutionary predictive analytics have achieved over 90% reliability in forecasting personal and team motivations, behaviours, and performance.<br/><br/>Ultimately, we help people find purpose and fulfillment at work, and help build and scale high-performing teams.<br/><br/>Keep in mind that joining our talent pool does not guarantee a job offer. We aim to balance your technical skills with the results of your Marlee work style assessment to match the hiring needs of our partners.<br/><br/>Your feedback is a gift! Write to us via: hello@getmarlee.com to help co-create the future of recruitment, together.<br/><br/>Powered by JazzHR<br/><br/>JbSXx4MrTm", "postedDate": "4 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3982568259"}