{"jobTitle": "Customer Support Specialist", "company": {"name": "Miter", "industry": "Software Development", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000.00/yr - 90,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Software Development", "description": "About Us<br/><br/>Miter is a leading HCM (Human Capital Management) platform designed for the $2 trillion construction industry. Miter simplifies construction workforce management, payroll, HR, and expense management, enabling contractors of all sizes to focus on growing their businesses. Miter is growing rapidly and backed by leading venture capital firms including Bessemer and Coatue.<br/><br/>As a Customer Support Specialist or Lead, you will play a critical role in ensuring that our customer-facing operations run smoothly and our customers receive accurate, timely, and reliable support.<br/><br/>Responsibilities<br/><br/><ul><li>Manage customer support inquiries via multiple channels, including phone, email, chat, and social media, ensuring timely and efficient resolution of issues. </li><li>Collaborate closely with the sales, product development, and engineering teams to address customer feedback, product bugs, and feature requests. </li><li>Maintain and update the knowledge base, including troubleshooting guides, FAQs, and other support documentation. </li><li>Establish and maintain strong relationships with customers, consistently delivering exceptional service to promote loyalty and retention. </li><li>Stay current with industry trends and best practices in customer support, incorporating new approach to continually enhance our service offering. <br/><br/></li></ul>Qualifications<br/><br/><ul><li>Exceptional communication skills, both written and verbal, with the ability to interact professionally and empathetically with customers. </li><li>Strong problem-solving skills, with the ability to analyze complex issues and identify appropriate solutions. </li><li>Ability to work well under pressure, manage competing priorities, and adapt quickly to changes in a fast-paced environment. </li><li>Experience in the construction, payroll, benefits, or software industries is a plus!<br/><br/></li></ul>What we offer<br/><br/><ul><li>Competitive salary and benefits package</li><li>Opportunities for professional growth and development</li><li>A supportive, inclusive, and collaborative work environment</li><li>Flexible work arrangements and remote work options</li><li>A chance to make a meaningful impact in the construction industry. <br/><br/></li></ul>Equal opportunity<br/><br/>Miter is proud to be an equal opportunity employer that values diversity and rewards merit. We do not discriminate based on race, national origin, ethnicity, religion, sexual orientation, age, or other characteristics.<br/><br/>Compensation Range: $70K - $90K", "responsibilities": "Manage customer support inquiries via multiple channels, including phone, email, chat, and social media, ensuring timely and efficient resolution of issues. Collaborate closely with the sales, product development, and engineering teams to address customer feedback, product bugs, and feature requests. Maintain and update the knowledge base, including troubleshooting guides, FAQs, and other support documentation. Establish and maintain strong relationships with customers, consistently delivering exceptional service to promote loyalty and retention. Stay current with industry trends and best practices in customer support, incorporating new approach to continually enhance our service offering.", "qualifications": {"required": "Exceptional communication skills, both written and verbal, with the ability to interact professionally and empathetically with customers. Strong problem-solving skills, with the ability to analyze complex issues and identify appropriate solutions. Ability to work well under pressure, manage competing priorities, and adapt quickly to changes in a fast-paced environment. Experience in the construction, payroll, benefits, or software industries is a plus!", "preferred": ""}, "skills": [], "postedDate": "4 weeks ago", "applicationDeadline": "", "benefits": "Competitive salary and benefits packageOpportunities for professional growth and developmentA supportive, inclusive, and collaborative work environmentFlexible work arrangements and remote work optionsA chance to make a meaningful impact in the construction industry.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3982512418"}