{"jobTitle": "Customer Service Specialist", "company": {"name": "Thélios", "industry": "Wholesale Luxury Goods and Jewelry", "location": "Rutherford, NJ"}, "location": "Rutherford, NJ", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Customer Service", "industry": "Wholesale Luxury Goods and Jewelry", "description": "Born from the will of LVMH Group, world leader in luxury, to establish itself in the eyewear sector, **Thélios** designs, produces and distributes sunglasses and optical frames for some of its most prestigious Maisons: **Dior, Fendi, Celine, Givenchy, Loewe, Stella McCartney, Kenzo, Berluti, Bulgari, Tag Heuer** and **Fred**! In addition, Thélios owns two proprietary brands, **Barton Perreira** and **Vuarnet**.\n<br/>\n**CUSTOMER SERVICE SPECIALIST**\n<br/>\n**POSITION SUMMARY: **We are looking for a specialist responsible for order entry, modifications/releases, tracking and monitoring of orders/backorders while providing excellent customer service. The ideal individual should possess exceptional communication skills and impeccable attention to detail.\n<br/>\n**KEY RESPONSIBILITIES**\n<ul><li>Responsible for order entry processing, modification, verification, and release using SAP.</li><li>Manage new client setup and customer data changes, including order entry and maintenance in SAP.</li><li>Respond to customer inquiries via phone and email regarding orders, product status, and other related information or issues.</li><li>Deliver excellent customer service and ensure high quality of service to all accounts and future clients.</li><li>Monitor and track customer orders, backorders, and shipping windows; follow up with accounts.</li><li>Follow up on purchase order extensions, status, current and future product availability, and expedited shipping.</li><li>Ensure timely deliveries within the designated shipping window and communicate with the Distribution Center on shipment priorities.</li><li>Track and assign return authorizations.</li><li>Generate and manage order and product availability reports.</li><li>Manage, investigate, and dispute chargeback claims.</li><li>Perform other duties as assigned.</li></ul><br/>\n**PROFILE**\nHigh School Diploma or Associate degree in Business Administration or certification preferred\nMinimum of 2+ years of relevant Customer Service experience\n<ul><li>Excellent data entry skills with high attention to detail and superb time management skills</li><li>Ability to resolve issues in a quick and timely manner with the ability to prioritize work in a fast-paced environment</li><li>Strong interpersonal skills and excellent communication skills both verbal and written; possess a friendly and positive attitude</li><li>Genuine passion and advocate of diversity and inclusion and integrates this mentality when making all business decisions (both internal &amp; external).</li><li>Proficient in Microsoft Office; SAP knowledge is an added advantage.</li><li>Bilingual in French, Italian, or Spanish is a plus, though not required.</li></ul><br/>\n<br/>\n**<em>Thank you in advance for your interest in this opening. Thélios is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, national origin, ancestry, citizenship, sex, gender (including gender identity and expression), pregnancy, age, sexual orientation, physical or mental disability, medical condition, genetic information, marital status, familial status, veteran status, or any other legally protected status under applicable federal, state or local laws. At this time, only qualified candidates will be contacted. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</em>**\n<br/>\n**<em>Direct applicants only, no third-party staffing inquiries, please.</em>**", "responsibilities": "Responsible for order entry processing, modification, verification, and release using SAP. Manage new client setup and customer data changes, including order entry and maintenance in SAP. Respond to customer inquiries via phone and email regarding orders, product status, and other related information or issues. Deliver excellent customer service and ensure high quality of service to all accounts and future clients. Monitor and track customer orders, backorders, and shipping windows; follow up with accounts. Follow up on purchase order extensions, status, current and future product availability, and expedited shipping. Ensure timely deliveries within the designated shipping window and communicate with the Distribution Center on shipment priorities. Track and assign return authorizations. Generate and manage order and product availability reports. Manage, investigate, and dispute chargeback claims. Perform other duties as assigned.", "qualifications": {"required": "Excellent data entry skills with high attention to detail and superb time management skills Ability to resolve issues in a quick and timely manner with the ability to prioritize work in a fast-paced environment Strong interpersonal skills and excellent communication skills both verbal and written; possess a friendly and positive attitude Genuine passion and advocate of diversity and inclusion and integrates this mentality when making all business decisions (both internal & external). Proficient in Microsoft Office; SAP knowledge is an added advantage.", "preferred": "High School Diploma or Associate degree in Business Administration or certification preferred Minimum of 2+ years of relevant Customer Service experience Bilingual in French, Italian, or Spanish is a plus, though not required."}, "skills": ["SAP", "Customer Service", "Order Entry", "Data Entry", "Communication", "Time Management", "Microsoft Office"], "postedDate": "4 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid paternity leave, Paid maternity leave, Commuter benefits, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3982188073"}