{"jobTitle": "Healthcare Customer Service Expert - Phone Intake. Remote ", "company": {"name": "CareCentrix", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Customer Service", "industry": "Hospitals and Health Care, Insurance, and Medical Practices", "description": "As a Healthcare Customer Service Expert, you have the opportunity to be the first point of contact for patients needing home healthcare services. Typical phone calls range from interactions with customers who need basic information, to assisting those with more complex requests. The more challenging calls can be the most rewarding because you know you are making a difference to a customer or patient that needs your help.", "responsibilities": "You enjoy working in a high volume call center environment where you will be receiving and responding to approximately 60-65 incoming calls per day from providers, referral sources and potential patients by collecting and entering clinical and demographic information into our CareCentrix portal.", "qualifications": {"required": "High School Diploma or GED., Minimum 2 years Customer Service experience in a call center environment., Minimum 1 year of experience working in the healthcare or medical industry., Good computer / typing skills with ability to navigate dual monitors and multiple applications."}, "skills": ["Customer Service", "Call Center", "Healthcare", "Medical", "Computer Skills", "Typing"], "postedDate": "3 weeks ago", "benefits": "Pay is $17.50/hr plus Monthly Incentive Bonus Opportunity., Full range of benefits including Health, Dental and Vision with HSA Employer Contributions and Dependent Care FSA Employer Match., Walgreens Discount - receive up to 25% off eligible items., Profit Sharing, generous PTO, 401K Savings Plan, Paid Parental Leave, free on-demand Virtual Fitness Training and more., PayActiv - Access to Earned Income between paychecks, Advancement opportunities, professional skills training, and tuition Reimbursement, Great culture with a sense of community.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983562985"}