{"jobTitle": "Product Manager", "company": {"name": "Passport", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management", "industry": "Software Development", "description": "Job Summary:\n\nAs a Product Manager at Passport, you are responsible for the financial, operational, strategic and technical success of Passport’s product portfolio. You will establish a go-to-market plan for, and own the evolution of, one or more of Passport’s product capabilities. Working with the VP of Product you will synthesize market demands, strategic imperatives, revenue goals, and more into a coherent and data-driven plan to be realized. You will be at the center of all things related to the product(s) you own, partnering with engineering and design on discovery and execution of capabilities that solve important problems for our clients. \n\nYou will balance the revenue targets and growth needs of your product(s) with the technology demands and operational expense complexity associated with sustaining them. Incorporating feedback from both internal and external stakeholders, you own the development and execution of product roadmaps necessary to drive your business unit forward. You will be keenly familiar with the revenue and profitability targets for your business unit and the role your product roadmap and its execution plays in achieving those goals. \n\nResponsibilities:\n\n* Collaborate with the VP of Product and product management counterparts to develop a product roadmap that is an intersection of client and market needs, Passport growth and revenue objectives, and product health.\n* Demonstrate SME level understanding to clearly articulate how to position your product(s) to prospective clients and the market, including their defined value proposition with differentiating factors and defining features.\n* Direct ownership of product readiness plans to ensure go-to-market activities are fully planned and executed prior to general availability releases.\n* Establishing a shared understanding of outcomes and objectives sought by your business unit and VP of Product, and sharing that with the Product Owners, Software Engineers, and other team members you actively engage with.\n* Understand and communicate the competitive landscape, including competitor capability/feature comparisons and SWOT analysis\n* Partner with UX, Architecture, and Product Owners to identify user personas, create journey maps, and inform architectural decisions.\n* Identify and investigate business and innovation opportunities, their return on investments, dependencies and risks.\n* Represent Product throughout the RFP cycle to answer product specific questions, participate in short list presentations, and conduct win/loss analysis to understand competitive assessment of your product(s) by potential clients\n\nAbout You:\n\nYou are a visionary, but also a realist. You blend technical ability with business acumen. While you are not necessarily a developer, you may have tinkered and are familiar with development methodologies. You are analytical, data-driven, and you understand how to build a P&L from the ground up. You understand the connection between financial drivers and end-user metrics. You are effective at connecting long-term vision to near-term objectives.\n\nYou are detail-oriented, organized. Nothing slips through the cracks when you’re running a project. You measure everything. You are inquisitive, and you know how to listen and incorporate new knowledge into your product strategy. You know how to work collaboratively across teams in order to produce the strongest outputs. Above all else, you are an excellent communicator, both written and verbal, and you understand how to effectively convey ideas to various stakeholders across the organization and in the market.\n\nYou read the books, you’ve followed the blogs, and as someone committed to continual improvement, you’re excited to improve the overall practice of product management at Passport in addition to your product line.\n\nQualifications:\n\n* 5+ years experience in B2B, B2B2C, and/or B2G product management, or a combination of education and relevant experience\n* Experience and knowledge of assigned product vertical/capability is a plus\n* Track record of shipping software products that deliver business results\n* Experience in new product development & discovery\n* Demonstrated ability to develop deep customer empathy and articulate customer problems\n* Excellent written and verbal communication skills, with the ability to explain complex information in a simple and accurate manner.\n* Demonstrated success leading cross-functional teams and working collaboratively with stakeholders, including the ability to influence without direct management authority.\n* Experience creating and using objectives and metrics, eg OKRs, to execute product strategy\n* Analytical proficiency and data-driven problem solver and communicator\n* Experience with Agile methodology and tools, eg JIRA \n* Ability to thrive in a fast-paced, entrepreneurial environment \n* Bachelor’s degree required\n* Pragmatic Institute Certification(s) a plus\n* Willingness to travel up to 20%\n\nAbout Us:\n\nPassport is the technology leader in parking compliance and curbside payment solutions. By helping cities integrate paid parking, enforcement operations, and payment infrastructure into one software solution, Passport provides the only platform that connects the complexities of mobility to efficiently manage and monetize the curb. From mobile payments to citation issuance, permitting technology and more, Passport is empowering cities of all sizes with better insights to improve parking turnover, expand revenue opportunities, and create better compliance. Passport is trusted by more than 800 clients across North America.\n\nPassport provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, genetic information, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state and local laws.", "responsibilities": "Collaborate with the VP of Product and product management counterparts to develop a product roadmap that is an intersection of client and market needs, Passport growth and revenue objectives, and product health.\nDemonstrate SME level understanding to clearly articulate how to position your product(s) to prospective clients and the market, including their defined value proposition with differentiating factors and defining features.\nDirect ownership of product readiness plans to ensure go-to-market activities are fully planned and executed prior to general availability releases.\nEstablishing a shared understanding of outcomes and objectives sought by your business unit and VP of Product, and sharing that with the Product Owners, Software Engineers, and other team members you actively engage with.\nUnderstand and communicate the competitive landscape, including competitor capability/feature comparisons and SWOT analysis\nPartner with UX, Architecture, and Product Owners to identify user personas, create journey maps, and inform architectural decisions.\nIdentify and investigate business and innovation opportunities, their return on investments, dependencies and risks.\nRepresent Product throughout the RFP cycle to answer product specific questions, participate in short list presentations, and conduct win/loss analysis to understand competitive assessment of your product(s) by potential clients", "qualifications": {"required": "5+ years experience in B2B, B2B2C, and/or B2G product management, or a combination of education and relevant experience\nExperience and knowledge of assigned product vertical/capability is a plus\nTrack record of shipping software products that deliver business results\nExperience in new product development & discovery\nDemonstrated ability to develop deep customer empathy and articulate customer problems\nExcellent written and verbal communication skills, with the ability to explain complex information in a simple and accurate manner.\nDemonstrated success leading cross-functional teams and working collaboratively with stakeholders, including the ability to influence without direct management authority.\nExperience creating and using objectives and metrics, eg OKRs, to execute product strategy\nAnalytical proficiency and data-driven problem solver and communicator\nExperience with Agile methodology and tools, eg JIRA \nAbility to thrive in a fast-paced, entrepreneurial environment \nBachelor’s degree required\nPragmatic Institute Certification(s) a plus\nWillingness to travel up to 20%", "preferred": ""}, "skills": ["Product Management", "Software Development", "Agile", "JIRA", "OKRs", "SWOT Analysis", "UX", "Customer Empathy", "Communication", "Leadership", "Cross-functional Teams", "Business Acumen", "Data-driven", "Financial Analysis", "Product Roadmap", "Go-to-market Strategy", "Product Readiness", "RFP", "Competitive Analysis", "Innovation"], "postedDate": "4 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Paid paternity leave, Commuter benefits, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3983250983"}