{"jobTitle": "Director, Partner Success", "company": {"name": "Imagine Pediatrics", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "Who We Are<br/><br/>We are Imagine Pediatrics, a devoted and compassionate, multi-disciplinary pediatrician-led medical group that is creating a world where every child with complex medical conditions gets the care and support they deserve. Energized by our mission to reimagine pediatric health care, we are pioneering virtual-first care services that include care coordination and around-the-clock access to complex-care clinicians from home. We don’t replace a child's existing care team. Instead, we collaborate to deliver continuous support to kids, so they can spend less time in the hospital and more time thriving at home and in their communities.<br/><br/>Every day we boldly challenge old approaches and seek out new and better ways to improve the health and lives of children with medical complexity. In partnership with caregivers, providers, and health plans, we break down the barriers that stand between families and quality care for their children. We know we can’t solve every challenge in the lives of these kids, but we can work tirelessly to give them, their families, and other caregivers the help and relief they need, right when they need it. We know a better approach to pediatric health care is within reach, and we are committed to seizing it today.<br/><br/>What We Live By<br/><br/>We’re guided by our five core values:<br/><br/><ul><li> Children first. We put the best interests of children above all. We are uncompromising in our commitment to improving the lives of children and families by bringing the best care to them. </li><li> Earn trust. We cherish the trusting relationships we build with the children and families we serve, our partners, and each other. We seek first to understand and speak honestly. </li><li> Innovate today. We refuse to accept the way things have always been done. Children and families are waiting for our help and their bravery demands that we relentlessly challenge assumptions to develop new approaches. </li><li> Embrace humanity. We lead with empathy and authenticity, presuming competence and good intentions. When we stumble, we use the opportunity to learn and grow stronger. </li><li> One team, diverse perspectives. We work alongside families as one team towards a shared purpose. We champion diversity and acknowledge the contributions of others. <br/><br/></li></ul>What You’ll Do<br/><br/>Imagine Pediatrics is seeking a Director Partner Success to drive client engagement and growth within a newly created Partner Success Department. This leader will play a critical role in shaping the build of the new department with key business results related to client retention, account expansion, and scaling for growth.<br/><br/>Client-Facing Delivery Expectations:<br/><br/><ul><li>Responsible for the growth, health, and success of Imagine Pediatrics client partnerships</li><li>Lead development of a cross-company Strategic Account Plan for our key client partnerships that outlines strategic objectives, actions, and expected results</li><li>Build and maintain strong and lasting partner relationships and operate as on-going point of contact for client partners</li><li>Track and manage contractual requirements to ensure deliverables and reporting are timely and accurate</li><li>Collaborate with the market teams to support Joint Operating Committee meetings</li><li>Identify new growth opportunities in collaboration with business development<br/><br/></li></ul>Supporting Department Build:<br/><br/><ul><li>Partner with VP of Partner Success to build a team to scale to address the needs of our growing client base</li><li>Develop and deliver a roadmap of tools and processes required to support strong and scalable ongoing client delivery (e.g. Strategic Account Plans templates)<br/><br/></li></ul>Internal Governance and Communication:<br/><br/><ul><li>Drive resolution of client escalations; coordinate with internal resources to deliver for the team and client</li><li>Champion clients’ needs and represent their interests in critical issue resolution</li><li>Collaborate across the organization to ensure all deliverables and milestones are met with quality and excellence</li><li>Clearly communicate the progress of strategic initiatives, both internally and externally</li><li>Organic growth: Provide input to the product and solution development process as the “voice of the customer”<br/><br/></li></ul>What You Bring &amp; How You Qualify<br/><br/>First and foremost, you’re passionate and committed to reimagining pediatric health care and creating a world where every child with complex medical conditions gets the care and support they deserve.<br/><br/><ul><li>A strong relationship builder, who’s passionate about serving children and their families with medical complexity</li><li>Functional experience with client-facing teams and responsibility for driving business results. </li><li>Understanding of the healthcare ecosystem, with a specific focus on the nuances and intricacies of value-based care and Medicaid health plans. </li><li>5+ years experience in a client-facing/client success role, preferably with health plan clients</li><li>Must possess a “commercial mindset” to help the company meet its high growth goals. </li><li>Demonstrated ability/flexibility to work cross-functionally in a fast-growing company</li><li>Strong critical thinking and problem solving skills</li><li>Successful track record of leading and scaling teams</li><li>Willingness to travel (20-30%)<br/><br/></li></ul>What We Offer (Benefits + Perks)<br/><br/>We provide these additional benefits and perks:<br/><br/><ul><li> Competitive medical, dental, and vision insurance </li><li>Healthcare and Dependent Care FSA; Company-funded HSA</li><li>401(k) with 4% match, vested 100% from day one</li><li>Employer-paid short and long-term disability </li><li>Life insurance at 1x annual salary </li><li>20 days PTO + 10 Company Holidays &amp; 2 Floating Holidays</li><li>Paid new parent leave</li><li>Additional benefits to be detailed in offer <br/><br/></li></ul>We Value Diversity, Equity, Inclusion and Belonging <br/><br/>We believe that creating a world where every child with complex medical conditions gets the care and support they deserve requires a diverse team with diverse perspectives. We're proud to be an equal opportunity employer. People seeking employment at Imagine Pediatrics are considered without regard to race, color, religion, sex, gender, gender identity, gender expression, sexual orientation, marital or veteran status, age, national origin, ancestry, citizenship, physical or mental disability, medical condition, genetic information, or characteristics (or those of a family member), pregnancy or other status protected by applicable law.", "jobFunction": "Other", "industry": "Hospitals and Health Care", "postedDate": "3 weeks ago", "benefits": "Competitive medical, dental, and vision insurance, Healthcare and Dependent Care FSA; Company-funded HSA, 401(k) with 4% match, vested 100% from day one, Employer-paid short and long-term disability, Life insurance at 1x annual salary, 20 days PTO + 10 Company Holidays & 2 Floating Holidays, Paid new parent leave, Additional benefits to be detailed in offer", "qualifications": {"required": "A strong relationship builder, who’s passionate about serving children and their families with medical complexity, Functional experience with client-facing teams and responsibility for driving business results., Understanding of the healthcare ecosystem, with a specific focus on the nuances and intricacies of value-based care and Medicaid health plans., 5+ years experience in a client-facing/client success role, preferably with health plan clients, Must possess a “commercial mindset” to help the company meet its high growth goals., Demonstrated ability/flexibility to work cross-functionally in a fast-growing company, Strong critical thinking and problem solving skills, Successful track record of leading and scaling teams, Willingness to travel (20-30%)"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3983714906"}