{"jobTitle": "Marketing Manager", "company": {"name": "Murray Resources", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Marketing and Writing/Editing", "industry": "Venture Capital and Private Equity Principals", "description": "A leading global technology-focused venture capital firm is looking for a Social Media & Content Marketing Manager to drive its brand awareness. The ideal candidate is a multi-faceted marketer passionate about storytelling, creating engagement, and intellectual debate with a wide range of marketing capabilities emphasizing content and social media. Working cross-functionally, the new leader will achieve marketing key metrics/objectives by ensuring high-quality content following brand & style guidelines while maintaining compliance with organizational core values and culture.", "responsibilities": "Manage the firm’s social media accounts, including but not limited to the company and OpenLP across Twitter and LinkedIn in an effort to drive visibility for the brand.  Responsible for organic and paid efforts, as well as copywriting, editorial calendar planning and management, scheduling, executing, and performance analysis. Manage a limited number of key investors’ personal Twitter and LinkedIn accounts to help amplify their personal brand platform. This will be largely driven by company news, industry news, trend forecasting, market commentary, and speaking/events they engage in. Provide guidance and direct social media best practices such as content publishing guidelines, KPI benchmarks, channel growth strategies across our organization. Provide community management support and audience development to help grow channels.  Manage budget and forecasting, including analysis and detailed metrics between spend and performance, providing recommendations on how to best capture ROI. Support and drive content across key stakeholders across the firm, including developing compelling thought leadership angles, drafting content, reviewing, and copy editing. This would be done across a variety of channels, including written blogs, email and newsletter campaigns, event landing pages, playbooks, presentations, portfolio company case studies, podcast support, and more.  Work with the marketing team to develop a strategy to cross-promote content across multiple channels to maximize efforts.  Ability to analyze key metrics through reporting and provide recommendations on how to continue to grow our audiences, newsletter subscribers, blog visitors, etc.  Work closely with compliance team to ensure all content developed for external audiences is reviewed and approved. Live firm’s values of being agile and supportive by staying flexible to jump in on a wide range of marketing tasks across content, social, PR and comms, event support, and beyond.", "qualifications": {"required": "Bachelor’s degree in marketing/communications or a related field 4-7 years of proven working experience in social media, content creation, and marketing in the venture capital/tech ecosystem Demonstrable experience developing LinkedIn and Twitter social media strategies (organic and paid), including copywriting, social calendaring, campaign planning, execution, audience development, community management and analysis - both for company and key stakeholders’ personal brands Experience implementing SEO best practices and content marketing strategies  Experience creating original content for thought leadership, blogs, email marketing campaigns, newsletters, event landing pages, playbooks, presentations, case studies, and more.  Proficiency with social media and project management tools such as HubSpot, Monday.com, WordPress, Sprout or an alternative, etc. Ability to understand how your work maps to marketing objectives and influences business outcomes  Strong time management skills and ability to manage concurrent tasks efficiently Team player mindset, nimble, and can adapt to reprioritization when necessary  Positive, professional attitude with pride in work product Open, honest, and collaborative communication skills Thoughtful and detail-oriented writer and copy editor  Team Player - Experience with and passion for teamwork and cross-functional collaboration Dedicated to Winning - Having the guts to take on a new challenge and the risk to be successful Intellectual Curiosity - Exhibit an entrepreneurial and creative ethos and is continually compelled to learn and explore new ideas Authentic Relationships - Relationships are the key to driving our collective success; superb at nurturing authentic, diverse, and congenial long-term relationships  Excellence - Put your passion for Technology investing to work!", "preferred": ""}, "skills": ["Social Media", "Content Creation", "Marketing", "Venture Capital", "Tech", "LinkedIn", "Twitter", "SEO", "Content Marketing", "HubSpot", "Monday.com", "WordPress", "Sprout", "Teamwork", "Cross-Functional Collaboration"], "postedDate": "3 weeks ago", "benefits": "Competitive Salary 100% Company Paid Medical Premiums Dental Insurance Life Insurance Vision Insurance Company Retreats 401K - company match Collaborative, transparent, and fun-loving culture Various employee development and training opportunities to participate in", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3983315164"}