{"jobTitle": "Director of Partnerships", "company": {"name": "Papa", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Business Development and Sales", "industry": "Individual and Family Services, Hospitals and Health Care, and IT Services and IT Consulting", "description": "Papa is a new kind of care built on human connection. Across the country, health plans and employers look to Papa to provide vital social support by pairing older adults and families with Papa Pals, trained and vetted companions, who provide a helping hand and an open ear, resulting in less loneliness and better health.<br/><br/>Founded in 2017 and headquartered in Miami, Papa is backed by Canaan, Tiger Global Management, Comcast Ventures, SoftBank Vision Fund 2, TCG, Initialized Capital, and Seven Seven Six, among other revered institutional and individual investors. We envision a world where no one has to go it alone. Learn more at Papa.com.<br/><br/><strong>About the Role: <br/><br/></strong>We are seeking a highly motivated and experienced Director of Partnerships to join our team. As an individual contributor, you will play a crucial role in driving our growth by establishing and expanding strategic relationships with Insurance Brokers and other potential healthcare partners. In a hunter role, your ability to win new logo partnerships will be essential in positioning our solutions to solve their most pressing challenges. The Director of Partnerships will be reporting to the VP of Sales.<br/><br/><strong>What you’ll be doing:<br/><br/></strong><ul><li>Business Development: Identify, target, and engage with Insurance Brokers/other potential channel partnerships and relevant stakeholders, to understand their specific needs and challenges</li><li>Being the voice of our partnerships, and working cross functionally to ensure they are fully supported</li><li>Solution Presentation: Effectively communicate the value proposition of Papa’s services to prospective clients, demonstrating how our technology can improve their operations, patient outcomes, and overall healthcare experience</li><li>Relationship Building: Cultivate and maintain strong, long-term relationships with key decision-makers and influencers within client organizations</li><li>Sales Strategy: Develop and implement strategic account plans to achieve revenue targets, including forecasting, pipeline management, and sales cycle management</li><li>Market Intelligence: Stay up-to-date with industry trends, competitive offerings, and regulatory changes to provide valuable insights and recommendations to clients.</li><li>Cross-Functional Collaboration: Collaborate closely with our product development, customer success, and marketing teams to ensure seamless communication and alignment with client needs and expectations.</li><li>Represent Papa at industry events, conferences, and networking opportunities to promote our brand and generate leads.</li><li>Provide regular reporting on sales activities, pipeline status, and forecasts to Papa’s leadership.<br/><br/></li></ul><strong>Your skills and experience: <br/><br/></strong><ul><li>Bachelor's degree in Business, Marketing, Healthcare, or related field </li><li>Proven track record of 7-10 years in HealthTech or healthcare sales, with a focus on Insurance Brokers</li><li>Demonstrated success in achieving and exceeding sales targets</li><li>Adept at navigating partnerships with enterprise organizations with shifting priorities, connecting with multiple stakeholders at varying levels.</li><li>Strong understanding of the healthcare industry, including knowledge of healthcare IT, compliance, and regulations</li><li>Exceptional interpersonal and communication skills, both written and verbal</li><li>Self-starter with a strong sense of initiative and ability to thrive in a fast-paced, entrepreneurial environment</li><li>Willingness to travel as needed to meet with clients and attend industry events<br/><br/></li></ul>About Papa's culture:<br/><br/>Papa’s culture is people first. While we have an incredible team of hard-working Papa people, at the end of the day, our company is really about family and community – and we celebrate that among our employees. We encourage everyone to bring their whole authentic selves to work. To be transparent. To be non-hierarchical. And, above all, to be a really good person.<br/><br/>We see ourselves as a place where every Papa employee feels they belong, a place where careers flourish, a place that brings back purpose and joy to work, a culture where visionaries/entrepreneurs are developed.<br/><br/>Papa’s mission is at the core of our total rewards philosophy wherein we attract and retain high-potential talent aligned with our journey. We offer gender-neutral and inclusive parental leave policies that offer up to 16 weeks of 100% paid parental leave. We immensely value the benefits of a flexible workplace, while designing remote-first principles we ensured that Papa people feel psychologically-safe about their career interests while being remote.", "responsibilities": "Business Development: Identify, target, and engage with Insurance Brokers/other potential channel partnerships and relevant stakeholders, to understand their specific needs and challenges\nBeing the voice of our partnerships, and working cross functionally to ensure they are fully supported\nSolution Presentation: Effectively communicate the value proposition of Papa’s services to prospective clients, demonstrating how our technology can improve their operations, patient outcomes, and overall healthcare experience\nRelationship Building: Cultivate and maintain strong, long-term relationships with key decision-makers and influencers within client organizations\nSales Strategy: Develop and implement strategic account plans to achieve revenue targets, including forecasting, pipeline management, and sales cycle management\nMarket Intelligence: Stay up-to-date with industry trends, competitive offerings, and regulatory changes to provide valuable insights and recommendations to clients.\nCross-Functional Collaboration: Collaborate closely with our product development, customer success, and marketing teams to ensure seamless communication and alignment with client needs and expectations.\nRepresent Papa at industry events, conferences, and networking opportunities to promote our brand and generate leads.\nProvide regular reporting on sales activities, pipeline status, and forecasts to Papa’s leadership.", "qualifications": {"required": "Bachelor's degree in Business, Marketing, Healthcare, or related field \nProven track record of 7-10 years in HealthTech or healthcare sales, with a focus on Insurance Brokers\nDemonstrated success in achieving and exceeding sales targets\nAdept at navigating partnerships with enterprise organizations with shifting priorities, connecting with multiple stakeholders at varying levels.\nStrong understanding of the healthcare industry, including knowledge of healthcare IT, compliance, and regulations\nExceptional interpersonal and communication skills, both written and verbal\nSelf-starter with a strong sense of initiative and ability to thrive in a fast-paced, entrepreneurial environment\nWillingness to travel as needed to meet with clients and attend industry events"}, "skills": ["Business Development", "Sales", "Healthcare", "HealthTech", "Insurance", "Relationship Management", "Strategic Partnerships", "Market Research", "Sales Strategy", "Communication", "Collaboration"], "postedDate": "3 days ago", "benefits": "Papa’s mission is at the core of our total rewards philosophy wherein we attract and retain high-potential talent aligned with our journey. We offer gender-neutral and inclusive parental leave policies that offer up to 16 weeks of 100% paid parental leave. We immensely value the benefits of a flexible workplace, while designing remote-first principles we ensured that Papa people feel psychologically-safe about their career interests while being remote.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3983070511"}