{"jobTitle": "Embedded Software Sales Representative, Manager or Director", "company": {"name": "Canonical", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1000+ colleagues in 70+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.<br/><br/>The company is founder led, profitable and growing.<br/><br/>We are hiring **IoT Sales Representatives** to expand our reach in mission-critical industries such as Automotive, Medical Devices, Industrial Systems, Robotics, and Telco, as well as consumer electronics. We are looking for candidates who are **technically skilled and familiar with embedded Linux and RTOS**. We are expanding in all time zones, so we can accommodate candidates from almost any country as long as they have reasonable business access to a substantial market territory in person. As we grow our teams we will also hire **Sales Team Managers** and **Regional Sales Directors**, please continue with this process if your goal is a management leadership position.<br/><br/>The server edition of Ubuntu is already very widely used in connected devices and industrial PC's. Our newer edition of Ubuntu for IoT, called Ubuntu Core, represents the state of the art in security and resilience for high end appliances and equipment. Our customers include global brands in consumer and industrial electronics as well as automotive and robotics. We continue to expand our range of offerings to bring our security, management and developer experience to the smallest Linux environments and devices. We recently added a real-time Linux capability and are working towards a range of certifications for these offerings. Together, this portfolio is Linux reinvented for optimal reliability, security, developer productivity and footprint.<br/><br/>This is a prospecting sales and strategic account development role and requires energy, ambition and focus. In order to be successful, you must be comfortable positioning and selling open source, services, and software solutions to all levels of an organization, and specifically to departments that are developing embedded software and IoT devices. You should also be familiar with at least one of our priority sectors.<br/><br/>Customers love the idea that they can get security compliance and support for everything open source from a single company. Our goal is to have more solutions on tap than any other vendor, and we have built unique capabilities to make that possible across every cloud, every class of compute and every category of application. Canonical provides licensed enterprise software products, commercial support, managed services, consulting and training services to customers who are deploying Ubuntu or open source applications on the cloud, in their data center, or to the connected device and IoT ecosystem. We are $250m in revenue, profitable, on a steady but relentless growth trajectory. We are almost entirely distributed, with leadership spread across many countries. We believe that talent is equally distributed across the globe, and we are excited to hire, develop, promote and ultimately trust a diverse group of exceptional leads to build the best, not biggest, enterprise software company.<br/><br/>We hire carefully and deliberately; our selection process is long and requires substantial work from applicants. It will take successful applicants three to six months to secure an offer. This is not a place to apply if you are in a rush to find a position, it is a worthwhile place to apply if you are ambitious and long-term in your thinking about your career and the dynamics which move the world forward. If you see clearly the rise of open source, and you understand the drivers of enterprise procurement and technical decision making, then you will understand why Canonical has such a tremendous long term advantage. You will also understand, given the ferocity of competition and the challenges of competing in a market of giants, that we have to set a very high bar for hiring and performance. In order to be a world leading company we select for exceptional ability as well as character, and then provide an environment which promotes teamwork and celebrates diligence, collaboration and effectiveness. All of those are easy to say but hard to do - at Canonical we are willing to be uncomfortable in pursuit of that excellence.<br/><br/>In building our sales team, we look for five things:<br/><br/><ul><li>Empathy for the customer - a real understanding of customer needs, industry-specific challenges, and a desire to help customers solve their business problems</li><li>High intellect - the ability to learn quickly, understand very complex subjects, and communicate clearly to build trust and confidence</li><li>Passion for technology - a fascination with the state of the art from brilliant people solving hard problems, and fierce competition for large prizes</li><li>Teamwork - a willingness to help others, to collaborate well with people from different disciplines, and to balance personal and team ambitions</li><li>Energy - the drive to motivate oneself and others to achieve the best result for the team and our customers<br/><br/></li></ul>Ubuntu is already very widely adopted which gives us a credible basis for conversations in the market. Nevertheless, it requires real work for sales professionals to build on that adoption to create trusted and profitable commercial relationships with brands in their territory. Our product managers and marketing teams run campaigns to generate awareness, engagement and leads, but you will need to go beyond managing inbound interest to develop the potential of your territory. You will need judgement as to which industries and companies are ready to go deeper with open source and Canonical, and energy to develop relationships in advance of proven interest. We expect professional practice, territory and account planning, as well as clear, complete and continuous reporting on pipeline status and activity, using standard professional tools.<br/><br/>The successful candidate will carry an annual bookings quota within their assigned territory. They should be able to travel regionally for client engagement, industry conferences, and internationally for company events twice a year. They will be expected to demonstrate professionalism and effectiveness, to prospect accounts for new business, maintain and develop existing relationships, and work with colleagues and partners on account strategy. They must be comfortable selling enterprise software, open source, cloud, virtualization, container technologies and technical software solutions to senior levels of the enterprise.<br/><br/>**Location:** We are growing our sales reach in all regions - EMEA, APAC and Americas.<br/><br/>What your day will look like<br/><br/><ul><li>Build and execute a territory plan to prioritise leading security-focused brands and manufacturers</li><li>Work with marketing to promote our brand and increase market awareness in prioritized accounts</li><li>Develop pipeline through outreach, prospecting, local marketing, and industry events</li><li>Close contracts to meet and exceed quarterly and annual bookings targets and achieve strategic objectives</li><li>Manage customer relationships and interactions through all stages of the sales cycle</li><li>Work with IoT Field Engineers to understand customer requirements and ensure customer satisfaction</li><li>Maintain accurate data and forecasts within Salesforce</li><li>Establish productive professional relationships with key influencers and decision makers</li><li>Coordinate with colleagues, including support, delivery and management<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>Exceptional academic track record from both high school and university</li><li>Undergraduate degree in a technical subject</li><li>Confidence to respectfully speak up, exchange feedback, and share ideas without hesitation</li><li>Track record of going above-and-beyond expectations to achieve outstanding results</li><li>Field sales experience in embedded Linux, embedded software, or enterprise software</li><li>Track record of achievement of sales targets and large account wins</li><li>Passion for technology evidenced by personal projects and initiatives</li><li>The work ethic and confidence to shine alongside motivated colleagues</li><li>Professional written and spoken English with excellent presentation skills</li><li>Experience with Linux (Debian or Ubuntu preferred) </li><li>Excellent interpersonal skills, curiosity, flexibility, and accountability</li><li>Appreciative of diversity, polite and effective in a multi-cultural, multi-national organisation</li><li>Thoughtfulness and self-motivation </li><li>Result-oriented, with a personal drive to meet commitments </li><li>Ability to travel internationally twice a year, for company events up to two weeks long</li><li>Willingness to travel up to 50% for customer meetings and industry events</li><li>Ability to develop and execute territory sales plans</li><li>Detail oriented with effective follow-up<br/><br/></li></ul>What we offer colleagues<br/><br/>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/><strong>Canonical is an equal opportunity employer<br/><br/></strong>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "responsibilities": "Build and execute a territory plan to prioritise leading security-focused brands and manufacturers\nWork with marketing to promote our brand and increase market awareness in prioritized accounts\nDevelop pipeline through outreach, prospecting, local marketing, and industry events\nClose contracts to meet and exceed quarterly and annual bookings targets and achieve strategic objectives\nManage customer relationships and interactions through all stages of the sales cycle\nWork with IoT Field Engineers to understand customer requirements and ensure customer satisfaction\nMaintain accurate data and forecasts within Salesforce\nEstablish productive professional relationships with key influencers and decision makers\nCoordinate with colleagues, including support, delivery and management", "qualifications": {"required": "Exceptional academic track record from both high school and university\nUndergraduate degree in a technical subject\nConfidence to respectfully speak up, exchange feedback, and share ideas without hesitation\nTrack record of going above-and-beyond expectations to achieve outstanding results\nField sales experience in embedded Linux, embedded software, or enterprise software\nTrack record of achievement of sales targets and large account wins\nPassion for technology evidenced by personal projects and initiatives\nThe work ethic and confidence to shine alongside motivated colleagues\nProfessional written and spoken English with excellent presentation skills\nExperience with Linux (Debian or Ubuntu preferred) \nExcellent interpersonal skills, curiosity, flexibility, and accountability\nAppreciative of diversity, polite and effective in a multi-cultural, multi-national organisation\nThoughtfulness and self-motivation \nResult-oriented, with a personal drive to meet commitments \nAbility to travel internationally twice a year, for company events up to two weeks long\nWillingness to travel up to 50% for customer meetings and industry events\nAbility to develop and execute territory sales plans\nDetail oriented with effective follow-up", "preferred": ""}, "skills": ["Linux", "Sales", "Marketing", "Salesforce", "Customer Relationship Management (CRM)", "Account Management", "Business Development", "Technical Sales", "Software Sales", "Enterprise Software", "Cloud Computing", "Virtualization", "Containerization", "IoT", "Embedded Systems", "Embedded Linux", "RTOS"], "postedDate": "3 weeks ago", "benefits": "Distributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3984586271"}