{"jobTitle": "Customer Support Representative", "company": {"name": "Hatch", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "About Us<br/><br/>There is nothing like the feeling of a good night’s sleep. Cozy, wrapped-up-in-a-heavy-blanket sleep. Fire crackling, curtains drawn, DO NOT DISTURB kind of sleep. *Hygge stuff. That’s the kind of sleep we’re talking about. 85% of people agree sleep is a key to their wellbeing, but more than 50% of people are <em>unsatisfied</em> with their own sleep. Whether it’s stress, interruption, work, children, people need help getting great rest!<br/><br/>Hatch is on a mission to help everyone in the family get great sleep. Getting high quality sleep improves focus, energy, and performance no matter what you love to do in your life. We make bedside sleep devices and original content to help people wind down, sleep deeply and rise rested and relaxed. Led by Rest, the #1 baby registry item on Amazon, and Restore, our Award-winning adult focused product, we have helped over 3 million sleepers of all ages find space for rest in their lives.<br/><br/>The Opportunity<br/><br/>We’re looking for a Customer Support Representative who will play a critical role in ensuring our customers love Hatch! In this role, you’ll become a product expert responsible for helping customers use their Hatch apps and devices seamlessly. Ideal candidates are empathetic, great communicators who love helping people. We’re also looking for adept problem solvers who enjoy navigating tricky troubleshooting. Hatch customers need help getting better sleep around the clock, this role will require availability on Friday and Saturday evenings. Our Customer Support team observes some, but not all holiday closures. Flexibility to work holidays is required.<br/><br/>What You’ll Do<br/><br/>\n<ul><li>Handle a high volume of customer inquiries that vary from shipping, to product functionality, to technical troubleshooting and more.</li><li>Learn the ins and outs of the entire suite of Hatch products and stay up to date on product changes</li><li>Provide friendly, empathetic, and personalized responses to Hatch customers </li><li>Use Support tools and documentation to investigate and troubleshoot hardware and software issues</li><li>Own customer inquiries end to end by gathering information, gaining deep understanding their issues, and providing solutions</li><li>Work collaboratively with your peers, product, and engineering teams to resolve issues and track bugs.<br/><br/></li></ul>Who You Are<br/><br/>\n<ul><li>Super customer focused! You love turning someone’s day around and you’re constantly looking for ways to improve the customer experience.</li><li>You’re a great communicator who knows how to translate complex technical information into a simple language</li><li>You love owning a problem end to end by using all the resources at your disposal but you also know when to ask for help</li><li>You’re efficient and organized; you don’t let things slip through the cracks and you’re always finding ways to do things faster and better</li><li>You’re adaptable to change, you know how to roll with the punches and enjoy innovating and trying new things</li><li>You’re a self-starter who is focused and productive in a remote work set up</li><li>You have a four year college degree or equivalent experience<br/><br/></li></ul>Bonus If You Have<br/><br/>\n<ul><li>1 - 2 years of Customer Service experience</li><li>Experience in high growth technology company</li><li>Interest in gadgets and new technology<br/><br/></li></ul>Why You Will Love Working at Hatch!<br/><br/>\n<ul><li>We are certified as A Great Place to Work! 97% of our employees have reported that Hatch is a great place to work.</li><li>We have an amazing leadership team that truly values its employees and lives our company values each and every day.</li><li>We delight our customers with something everyone needs: a good night’s sleep!</li><li>Our team is collaborative, fun, and brilliant!</li><li>You have an opportunity to make a large impact in people’s lives</li><li>We are backed by world class investors including True Ventures and have strong revenue growth.</li><li>We let you take care of what you need by offering a flexible/remote work environment<br/><br/></li></ul>We also take care of you through our comprehensive compensation package and many other perks and benefits including:<br/><br/>\n<ul><li>100% paid medical, dental, and vision for employees and 80% coverage for dependents</li><li>Meaningful equity</li><li>401(k) match with no vesting schedule</li><li>16 weeks paid parental leave for those important moments in life</li><li>12 free therapy sessions on Samata Health's platform</li><li>Financial Support for Family Planning</li><li>Remote office allowance</li><li>Monthly Internet reimbursement allowance</li><li>Friends and Family discount on our products</li><li>Discount program from popular brands in travel, entertainment and retail</li><li>Many other spontaneous perks<br/><br/></li></ul>Designed by experts and loved by parents, our Rest family includes Rest, Rest+, Rest Mini, and Rest (2nd Gen)—all-in-one sleep products designed for babies and kids that can be controlled remotely. Hatch Restore is a fully-customizable product geared toward helping adults sleep well. As an all-in-one sleep assistant, Restore helps people personalize their perfect night of slumber. Launched in 2014 by parent entrepreneurs Ann Crady Weiss and Dave Weiss, and featured on “Shark Tank” in 2016, Hatch is headquartered in Menlo Park, California.<br/><br/><em><strong>We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.</strong></em>", "jobFunction": "Other", "industry": "Computers and Electronics Manufacturing", "postedDate": "9 hours ago", "benefits": "100% paid medical, dental, and vision for employees and 80% coverage for dependents, Meaningful equity, 401(k) match with no vesting schedule, 16 weeks paid parental leave for those important moments in life, 12 free therapy sessions on Samata Health's platform, Financial Support for Family Planning, Remote office allowance, Monthly Internet reimbursement allowance, Friends and Family discount on our products, Discount program from popular brands in travel, entertainment and retail, Many other spontaneous perks", "remoteWork": "Yes", "skills": [], "url": "https://www.linkedin.com/jobs/view/3984807299"}