{"jobTitle": "Executive Assistant", "company": {"name": "Sony Music Entertainment", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Musicians", "description": "<strong>About Sony Music Entertainment<br/><br/></strong>At Sony Music Entertainment, we fuel the creative journey. We’ve played a pioneering role in music history, from the first-ever music label to the invention of the flat disc record. We’ve nurtured some of music’s most iconic artists and produced some of the most influential recordings of all time.<br/><br/>Today, we work in more than 70 countries, supporting a diverse roster of international superstars, developing and independent artists, and visionary creators. From our position at the intersection of music, entertainment, and technology, we bring imagination and expertise to the newest products and platforms, embrace new business models, employ breakthrough tools, and provide powerful insights that help our artists push creative boundaries and reach new audiences. In everything we do, we’re committed to artistic integrity, transparency, and entrepreneurship.<br/><br/>Sony Music Entertainment is a member of the Sony family of global companies.<br/><br/>We are seeking a detail-oriented and proactive <strong>Executive Assistant</strong> to join our team. The Executive Assistant will be responsible for supporting the SVP of Total Rewards and will also assist the Total Rewards department with administrative support as needed.<br/><br/><strong>What you'll do:<br/><br/></strong><ul><li>Role model SMG’s Global People Promise, Values and Behaviors in all that you do, helping to drive a sustainable high-performance culture within our business</li><li>Manages and maintains daily schedule for SVP of Total Rewards, including compiling daily calendar reports and weekly schedule previews</li><li>Provides technical support including but not limited to; scheduling meetings and room reservations, ordering catering for department-sponsored events, and creating reports and spreadsheets to track departmental and company people data</li><li>Manages event planning and travel arrangements for Total Rewards Team </li><li>Maintains/orders office supply inventory and distributes mail for Total Rewards Team</li><li>Prepare presentation templates for SVP, Total Reward, in alignment with SME and PX branding</li><li>Collaborates with other staff as well as other offices throughout the Sony Corporation<br/><br/></li></ul><strong>Who you are:<br/><br/></strong><ul><li>3+ years of Executive Assistant experience supporting an SVP equivalent role.</li><li>Proactive, flexible, and responsive to the needs of the team.</li><li>Excellent oral and written communication skills, detail orientation and demonstrated organizational, project management, and time management skills.</li><li>Creative problem solver and self starter</li><li>Maintain discretion and confidentiality when working with sensitive information<br/><br/></li></ul><strong>What we give you:<br/><br/></strong><ul><li>You join an inclusive, collaborative and global community where you can channel your passion every day</li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best</li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community</li><li>The space to accelerate progress, positively disrupt and create what happens next</li><li>We give you the platform to champion positive change, with the opportunity to contribute to our social impact, diversity, equity and inclusion initiatives</li><li>Our Hybrid with Flexibility approach combines the flexibility of remote working with the benefits of in-person collaboration whenever we need to come together to do our best work. Managers will partner with their teams and employees to establish work arrangements that meet the business, team, and individual needs.</li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching</li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition and student loans</li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community</li><li>Time off for a winter recess<br/><br/></li></ul><em>Sony Music is committed to providing equal employment opportunity for all persons regardless of age, disability, national origin, race, color, religion, sex, sexual orientation, gender, gender identity or expression, pregnancy, veteran or military status, marital and civil partnership/union status, alienage or citizenship status, creed, genetic information or any other status protected by applicable federal, state, or local law.<br/><br/></em>The anticipated annual base salary does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>New York Pay Range<br/><br/>$57,000—$75,000 USD", "responsibilities": "<ul><li>Role model SMG’s Global People Promise, Values and Behaviors in all that you do, helping to drive a sustainable high-performance culture within our business</li><li>Manages and maintains daily schedule for SVP of Total Rewards, including compiling daily calendar reports and weekly schedule previews</li><li>Provides technical support including but not limited to; scheduling meetings and room reservations, ordering catering for department-sponsored events, and creating reports and spreadsheets to track departmental and company people data</li><li>Manages event planning and travel arrangements for Total Rewards Team </li><li>Maintains/orders office supply inventory and distributes mail for Total Rewards Team</li><li>Prepare presentation templates for SVP, Total Reward, in alignment with SME and PX branding</li><li>Collaborates with other staff as well as other offices throughout the Sony Corporation<br/><br/></li></ul>", "qualifications": {"required": "3+ years of Executive Assistant experience supporting an SVP equivalent role.\nProactive, flexible, and responsive to the needs of the team.\nExcellent oral and written communication skills, detail orientation and demonstrated organizational, project management, and time management skills.\nCreative problem solver and self starter\nMaintain discretion and confidentiality when working with sensitive information<br/><br/>"}, "skills": [], "postedDate": "14 hours ago", "benefits": "<ul><li>You join an inclusive, collaborative and global community where you can channel your passion every day</li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best</li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community</li><li>The space to accelerate progress, positively disrupt and create what happens next</li><li>We give you the platform to champion positive change, with the opportunity to contribute to our social impact, diversity, equity and inclusion initiatives</li><li>Our Hybrid with Flexibility approach combines the flexibility of remote working with the benefits of in-person collaboration whenever we need to come together to do our best work. Managers will partner with their teams and employees to establish work arrangements that meet the business, team, and individual needs.</li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching</li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition and student loans</li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community</li><li>Time off for a winter recess<br/><br/></li></ul>", "remoteWork": "Yes", "salary": {"amount": "57,000—$75,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3984804953"}