{"jobTitle": "Social Media Manager", "company": {"name": "Everyday Dose", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Food and Beverage Services", "description": "<strong>Position Summary:</strong><p><br/></p><p>Everyday Dose is looking for a dynamic and experienced Social Media Manager to run organic social channels, including Instagram, Facebook, and Tiktok. This role requires a creative marketer with a track record in building DTC brands through social media, with an expert understanding of the strategies and tactics required to use social media as an impactful tool for growing brand awareness, loyalty, and conversion.</p><p><br/></p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Develop and implement a comprehensive strategy for organic social media platforms including (but not limited to) Instagram, Facebook, TikTok, and YouTube that includes content, publishing, and engagement.</li><li>Create specific goals and KPI’s for goals for social media that align with the overall marketing objectives of the organization, including growing brand awareness, increasing loyalty and retention, increasing engagement, and driving site traffic and conversion.</li><li>Maintain a rigorous posting schedule to ensure that all frames are continually being filled at the right cadence for maximum impact.</li><li>Continually seek out, test, and scale new creative, publishing, and engagement tactics based on platform best practices</li><li>Identify, curate, and promote user-generated content that aligns with the brand's messaging and values.</li><li>Build and maintain strong relationships with influencers, bloggers, and other members of the online community.</li><li>Create organic content, partnering with the creative team and leveraging assets within marketing and across the business to create engaging content that fills key objectives.</li><li>Analyze and report on the performance of all social media initiatives.</li><li>Collaborate with cross-functional teams, such as marketing, customer service, and product development, to ensure that UGC and social media initiatives are in line with brand guidelines and integrated into the overall marketing mix.</li><li>Respond to customer inquiries, complaints, and other interactions on social media in a timely and professional manner.</li><li>Assist in the evolution and maintenance of social brand guidelines and social voice.</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>3-5 years of experience managing social media for a high-growth eCommerce brand</li><li>Proven experience overseeing social media programs with measurable business results including channel growth, brand awareness, and conversion.</li><li>Ability to create and edit still and video assets using design tools such as Figma</li><li>Ability to set high-level strategy and objectives for social media while also handling day-to-day execution and operations</li><li>Expert communication, reporting, and analysis skills</li><li>Ability to respond quickly to evolving business needs, trends, and opportunities to continually maximize impact</li><li>Expert understanding of the eCommerce ecosystem and the role social media plays in business growth</li><li>Proven ability to stay up to date on best practices in all major social media channels and efficiently integrate them into</li></ul><p></p>", "responsibilities": "Develop and implement a comprehensive strategy for organic social media platforms including (but not limited to) Instagram, Facebook, TikTok, and YouTube that includes content, publishing, and engagement.Create specific goals and KPI’s for goals for social media that align with the overall marketing objectives of the organization, including growing brand awareness, increasing loyalty and retention, increasing engagement, and driving site traffic and conversion.Maintain a rigorous posting schedule to ensure that all frames are continually being filled at the right cadence for maximum impact.Continually seek out, test, and scale new creative, publishing, and engagement tactics based on platform best practicesIdentify, curate, and promote user-generated content that aligns with the brand's messaging and values.Build and maintain strong relationships with influencers, bloggers, and other members of the online community.Create organic content, partnering with the creative team and leveraging assets within marketing and across the business to create engaging content that fills key objectives.Analyze and report on the performance of all social media initiatives.Collaborate with cross-functional teams, such as marketing, customer service, and product development, to ensure that UGC and social media initiatives are in line with brand guidelines and integrated into the overall marketing mix.Respond to customer inquiries, complaints, and other interactions on social media in a timely and professional manner.Assist in the evolution and maintenance of social brand guidelines and social voice.", "qualifications": {"required": "3-5 years of experience managing social media for a high-growth eCommerce brandProven experience overseeing social media programs with measurable business results including channel growth, brand awareness, and conversion.Ability to create and edit still and video assets using design tools such as FigmaAbility to set high-level strategy and objectives for social media while also handling day-to-day execution and operationsExpert communication, reporting, and analysis skillsAbility to respond quickly to evolving business needs, trends, and opportunities to continually maximize impactExpert understanding of the eCommerce ecosystem and the role social media plays in business growthProven ability to stay up to date on best practices in all major social media channels and efficiently integrate them into", "preferred": ""}, "skills": ["Social Media", "Marketing", "Ecommerce", "Instagram", "Facebook", "TikTok", "YouTube", "Content Creation", "Design", "Figma", "Strategy", "Communication", "Reporting", "Analysis", "Influencer Marketing", "Brand Awareness", "Engagement", "Conversion", "Customer Service"], "postedDate": "3 weeks ago", "benefits": "Medical insurance, Dental insurance", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3984806903"}