{"jobTitle": "Associate, Front-Desk Administrator", "company": {"name": "Cohen & Steers", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$65,000.00/yr - $75,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>Job Title: </strong>Associate, Front Desk Administrator<br/><br/><strong>Department: </strong>Office Services<br/><br/><strong>Reports To:</strong> Vice President, Office Services<br/><br/><strong>FLSA Code:</strong> Non-Exempt<br/><br/><strong>Estimated Salary:</strong> $65,000 - $75,000<br/><br/><strong>Job Summary:<br/><br/></strong>Performs a wide variety of duties, including those of a confidential nature. Cohen & Steers is committed to an inclusive culture, valuing diversity in support of our people and clients.<br/><br/><strong>Major Responsibilities/Activities:<br/><br/></strong><ul><li>The Front Desk Administrator provides reception services in a busy high-touch corporate environment.</li><li>Greeting and welcoming all visitors in a friendly, professional manner.</li><li>Directing in-person and telephone inquiries appropriately; honoring specific requests from colleagues regarding the handling of incoming calls while utilizing a multi-line switchboard.</li><li>Overseeing conference room reservations; reserving rooms upon request; resolving conflicts including double-bookings, meeting run-overs, and expanded attendance.</li><li>Overseeing catering issues – accepts delivery, coordinates set-up and clearing time, and appropriately communicates to all stakeholders.</li><li>Assist with administrative tasks for various departments (i.e. invoice processing, messenger service requests, room reservation requests, resolving ticketing system issues, reporting facility issues to building management, inputting visitors into the security system upon request, processing action notices).</li><li>Updating contact lists and procedures.</li><li>Monitoring freight elevator entrance/exit activity via security monitors – screening and access.</li><li>Ensure the reception area is kept tidy throughout the day.</li><li>Provide a polished experience for visitors that lets the firm and colleagues shine.</li><li>Fulfills colleague requests as quickly as possible.<br/><br/><br/></li></ul><strong>Minimum Requirements: <br/><br/></strong><ul><li>Strong verbal and written communication skills.</li><li>Polished, professional, and personable presence.</li><li>Two years working in a reception or client service role in a professional corporate environment.</li><li>Multi-line Switchboard skills.</li><li>Microsoft Office skills Client-facing and colleague-focused.</li><li>Ability to multi-task.</li><li>Highly-organized.</li><li>The scope of the role is expected to evolve over time.<br/><br/><br/></li></ul><strong><em>Note: </em></strong><em>This job description reflects management's assignment of essential functions; it does not prescribe or restrict the tasks that may be assigned. The job title or duties and responsibilities may be changed by the Company at any time.</em>", "responsibilities": "The Front Desk Administrator provides reception services in a busy high-touch corporate environment. Greeting and welcoming all visitors in a friendly, professional manner. Directing in-person and telephone inquiries appropriately; honoring specific requests from colleagues regarding the handling of incoming calls while utilizing a multi-line switchboard. Overseeing conference room reservations; reserving rooms upon request; resolving conflicts including double-bookings, meeting run-overs, and expanded attendance. Overseeing catering issues – accepts delivery, coordinates set-up and clearing time, and appropriately communicates to all stakeholders. Assist with administrative tasks for various departments (i.e. invoice processing, messenger service requests, room reservation requests, resolving ticketing system issues, reporting facility issues to building management, inputting visitors into the security system upon request, processing action notices). Updating contact lists and procedures. Monitoring freight elevator entrance/exit activity via security monitors – screening and access. Ensure the reception area is kept tidy throughout the day. Provide a polished experience for visitors that lets the firm and colleagues shine. Fulfills colleague requests as quickly as possible.", "qualifications": {"required": "Strong verbal and written communication skills. Polished, professional, and personable presence. Two years working in a reception or client service role in a professional corporate environment. Multi-line Switchboard skills. Microsoft Office skills Client-facing and colleague-focused. Ability to multi-task. Highly-organized. The scope of the role is expected to evolve over time."}, "skills": ["Microsoft Office", "Communication", "Client Service", "Multi-line Switchboard"], "postedDate": "5 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3984169822"}