{"jobTitle": "Computer Software Developer - Junior", "company": {"name": "DCS Corp", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing", "description": "As a Senior Computer Software Developer at the 513th EWS you will research, design, develop, test and manage software tools and programs supporting Mission Data (MD) production requirements. The Senior Software Developer will manage/modify enterprise-wide systems and application software as required to ensure the USRL provides leading edge technologies and meets the dynamic pace of F-35 Lightning II operational priorities.<br/><br/><strong>Essential Job Functions<br/><br/></strong>Performs all phases of the software development lifecycle.<br/><br/>Analyzes user/business needs and functionality to plan and design software systems to meet those needs.<br/><br/>Creates a variety of models and diagrams that show programmers the software code needed for an application.<br/><br/>Performs software updates, refinement, testing, and debugging to meet business needs.<br/><br/>Provides analysis for reports on software project specifications, activities, or status.<br/><br/>Thoroughly documents the software or system for future maintenance and updates.<br/><br/>May coach and provide guidance to less-experienced professionals.<br/><br/>May serve as a lead on directed projects and initiatives.<br/><br/><strong>Required Skills<br/><br/></strong>U.S. Citizenship is required (Due to the sensitivity of customer requirements).<br/><br/>Active DoD Secret level security clearance and ability to obtain a Top Secret clearance; must maintain clearance throughout employment.<br/><br/>Bachelors degree in computer science, engineering, mathematics, physics, or related technical discipline and at least 5 years of related experience.<br/><br/>Programming Languages: Assembly; C, C++; Microsoft .Net (C#, VB); Java.<br/><br/>Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux.<br/><br/>Desired Operating Systems: Windows 7/10, Windows Server 2008R2, Windows Server 2012R2.<br/><br/><strong>Desired Skills<br/><br/></strong>Security + or equivalent certification.<br/><br/>Operating Systems: Windows 7/10, Windows Server 2008R2, Windows Server 2012R2, Red Hat Enterprise Linux 5,6,7.<br/><br/>Ability to work, communicate, and problem solve well in a team environment.<br/><br/>Knowledge and experience with analysis, simulation, and, modeling environments (live, virtual, and constructive) and/or concepts.<br/><br/>Domain knowledge related to aerospace systems, sensors, tracking, fusion, communications, command and control, cyber, or electronic warfare.<br/><br/>Knowledge of US military flight test data collection, processing and storage procedures.", "postedDate": "3 weeks ago", "skills": ["Assembly", "C", "C++", "Microsoft .Net", "Java", "Microsoft Windows", "Unix", "Linux", "Windows 7", "Windows 10", "Windows Server 2008R2", "Windows Server 2012R2", "Security+", "Red Hat Enterprise Linux 5", "Red Hat Enterprise Linux 6", "Red Hat Enterprise Linux 7"], "url": "https://www.linkedin.com/jobs/view/3985107267"}