{"jobTitle": "Manager, Port Operations", "company": {"name": "Princess Cruises", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality and Travel Arrangements", "description": "One of the best-known names in cruising, Princess is the world’s leading international premium cruise line and tour company, carrying millions of guests each year to hundreds of destinations around the globe. We give our guests the Medallion Class experience others simply can’t. The Love Boat promises something for everyone.<br/><br/>We’re looking for an experienced Port Operations professional. You’ll be responsible managing in port services for company vessels calling at unique port across the globe. The incumbent will work with local service providers, vendors, and coordinate with local authorities, while considering local rules, regulations, and customs to ensure vessel operations are conducted timely and effectively within the set out budgetary constraints. This is a highly dynamic position, where plans and arrangements are constantly subject to change and will require constant involvement and direction to drive the best outcome. The incumbent will drive vendor performance per company set standards and interact with the various departments within the organization to ensure their specific interests in these operations are validated and covered.<br/><br/>Here’s a summary of what Princess is looking for in its Port Operations Manager. Is this you?<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Ensure all activities in the ports supporting the company vessels in the assigned regions are performed within set guidelines, performance standards, and budgetary restraints.</li><li>Verify performance of the various port operations against the departmental objectives and as required, analyze, and prepare reports to verify effectiveness and drive required improvement </li><li>Responsible for the coordination of vendor services according to contracts, and agreements, to meet company requirements</li><li>Assist in the annual budget preparation and monthly review process</li><li>Participate in the planning, development and management of port operation programs and vessel deployment and itineraries</li><li>Develop professional relationships with local port communities and their representatives; represent the company at local organized meetings, public functions, and events<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>BS or BA in Maritime Studies, Business Administration, logistics, or equivalent work experience </li><li>5+ years’ experience in a management or leadership role with progressively more responsibility</li><li>Prior experience in port-related management and/or marine operations, preferably passenger vessel operations.</li><li>Bilingual preferred (English and Spanish)</li><li>Professional level of knowledge in port operations and customer service equivalent to that which would be acquired through the completion of a bachelor’s degree.</li><li>Demonstration of directly related work experience, which has provided an equivalent breadth, and depth of knowledge may be considered in lieu of the educational requirement.</li><li>Ability to resolve complex customer service issues and respond effectively to sensitive inquiries and complaints, while meeting deadlines and maintaining an attention to detail and accuracy. </li><li>Ability to clearly communicate, verbally and in writing, with all levels of employees, management, and customers.</li><li>Strong proficiency in Microsoft Office applications, Outlook, Teams, Excel. </li><li>Experience in Port Operations (departmental) systems (preferred)</li><li>Familiar with worldwide vessel deployments, portside operations, and vessel operations </li><li>Ability to analyse operational results and data and create reports or create presentations.</li><li>This job normally requires four years of progressively responsible positions in port operations, customer services, or operations management. Demonstrated supervisory experience in a business environment is required.</li><li>Experience working across cultures and geographies with a commitment to recognizing inclusive viewpoints.</li><li>Collaborative and trustworthy to gain support and achieve results.</li><li>Strong interpersonal skills</li><li>Ability to manage smaller projects, </li><li>Ability to multi-task and work within confinement of time management. </li><li>Effective in prioritization of tasks to support daily regional responsibilities while providing additional assistance to third-party vendors, direct reports, and other team members as required. </li><li>Ability to work independently and virtually. Flexibility to travel on short notice and/or internationally as required. Flexible schedule as some work required outside of normal work hours including weekends</li><li>Must be legally authorized to work in the United States. Princess is unable to sponsor or take over sponsorship of employment visas at this time (e.g., H-1B status). <br/><br/></li></ul><strong>What You Can Expect<br/><br/></strong><ul><li>Cruise and Travel Privileges for You and Your Family </li><li>Health Benefits </li><li>401(k) </li><li>Employee Stock Purchase Plan </li><li>Training &amp; Professional Development </li><li>Tuition &amp; Professional Certification Reimbursement </li><li>Rewards &amp; Incentives </li><li>Base Salary Range: $83,300.00 to $112,50.00. The range is applicable for the labor market where the role is intended to be hired. Final base salary is directly related to each candidates' qualifications and experience uniquely. <br/><br/></li></ul><strong>Our Culture… Stronger Together<br/><br/></strong>Our highest responsibility and top priority is compliance, environmental protection and the health, safety and well-being of our guests, the people in the communities we touch and serve, and our shipboard and shoreside employees. Please visit our site to learn more about our Culture Essentials, Corporate Vision Statement and our Core Values at: https://www.princess.com/aboutus/culture-framework/ .<br/><br/>Princess is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.<br/><br/><strong>Americans With Disabilities Act (ADA)<br/><br/></strong>Princess will provide reasonable accommodations with the application process, upon your request, as required to comply with applicable laws. If you have a disability and require assistance in this application process, please contact recruiting@hollandamericagroup.com<br/><br/><strong>#PCL</strong>", "responsibilities": "Ensure all activities in the ports supporting the company vessels in the assigned regions are performed within set guidelines, performance standards, and budgetary restraints. Verify performance of the various port operations against the departmental objectives and as required, analyze, and prepare reports to verify effectiveness and drive required improvement  Responsible for the coordination of vendor services according to contracts, and agreements, to meet company requirements Assist in the annual budget preparation and monthly review process Participate in the planning, development and management of port operation programs and vessel deployment and itineraries Develop professional relationships with local port communities and their representatives; represent the company at local organized meetings, public functions, and events", "qualifications": {"required": "BS or BA in Maritime Studies, Business Administration, logistics, or equivalent work experience  5+ years’ experience in a management or leadership role with progressively more responsibility Prior experience in port-related management and/or marine operations, preferably passenger vessel operations. Bilingual preferred (English and Spanish) Professional level of knowledge in port operations and customer service equivalent to that which would be acquired through the completion of a bachelor’s degree. Demonstration of directly related work experience, which has provided an equivalent breadth, and depth of knowledge may be considered in lieu of the educational requirement. Ability to resolve complex customer service issues and respond effectively to sensitive inquiries and complaints, while meeting deadlines and maintaining an attention to detail and accuracy.  Ability to clearly communicate, verbally and in writing, with all levels of employees, management, and customers. Strong proficiency in Microsoft Office applications, Outlook, Teams, Excel.  Experience in Port Operations (departmental) systems (preferred) Familiar with worldwide vessel deployments, portside operations, and vessel operations  Ability to analyse operational results and data and create reports or create presentations. This job normally requires four years of progressively responsible positions in port operations, customer services, or operations management. Demonstrated supervisory experience in a business environment is required. Experience working across cultures and geographies with a commitment to recognizing inclusive viewpoints. Collaborative and trustworthy to gain support and achieve results. Strong interpersonal skills Ability to manage smaller projects,  Ability to multi-task and work within confinement of time management.  Effective in prioritization of tasks to support daily regional responsibilities while providing additional assistance to third-party vendors, direct reports, and other team members as required.  Ability to work independently and virtually. Flexibility to travel on short notice and/or internationally as required. Flexible schedule as some work required outside of normal work hours including weekends Must be legally authorized to work in the United States. Princess is unable to sponsor or take over sponsorship of employment visas at this time (e.g., H-1B status).", "preferred": ""}, "skills": ["Microsoft Office", "Excel", "Outlook", "Teams", "Customer Service", "Communication", "Management", "Leadership", "Budgeting", "Project Management", "Operations Management", "Port Operations", "Maritime Studies", "Business Administration", "Logistics", "Bilingual", "English", "Spanish", "Travel", "Cruise", "International", "Global", "Vendor Management", "Stakeholder Management", "Relationship Building", "Problem Solving", "Decision Making", "Time Management", "Multitasking", "Prioritization", "Teamwork", "Collaboration", "Trustworthy", "Interpersonal Skills", "Independent Work", "Virtual Work", "Travel", "International Travel", "Flexible Schedule", "Weekend Work", "Compliance", "Environmental Protection", "Health and Safety", "Guest Experience", "Employee Experience", "Culture"], "postedDate": "3 weeks ago", "benefits": "Cruise and Travel Privileges for You and Your Family  Health Benefits  401(k)  Employee Stock Purchase Plan  Training &amp; Professional Development  Tuition &amp; Professional Certification Reimbursement  Rewards &amp; Incentives  Base Salary Range: $83,300.00 to $112,50.00. The range is applicable for the labor market where the role is intended to be hired. Final base salary is directly related to each candidates' qualifications and experience uniquely.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985114910"}