{"jobTitle": "Truck Inventory Manager/Spec", "company": {"name": "All Roads", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Motor Vehicle Manufacturing and Construction", "description": "Due to our rapid growth, All Roads Trucks (Kenworth/Ford/Isuzu) in Ft. Lauderdale, FL has a rare opportunity for a New Truck Inventory Manager. This role is responsible for ordering trucks, coordinating upfits, handling delivery logistics, managing stocking levels and negotiating with body companies. Previous heavy truck spec experience required. Kenworth or Peterbilt truck ordering experience a plus. We offer a competitive salary and great benefits. Onsite, hybrid or remote opportunity available for the right candidate.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Medical, dental, vision, disability, life and supplemental insurance offerings on the 1st of the month after 30 days of employment</li><li>401k with company contribution</li><li>Paid time off</li><li>Company paid holidays</li><li>Tuition Reimbursement program</li><li>Employee referral bonus program<br/><br/></li></ul>Responsibilities:<br/><br/><ul><li>Effectively order and coordinate upfits for a high volume of heavy and medium duty stock trucks. </li><li>Review and confirm specifications of all trucks ordered</li><li>Communicate regularly with the sales management team to develop a successful inventory strategy. </li><li>Accurately Input order information into OEM truck ordering systems </li><li>Other duties as needed<br/><br/></li></ul><strong>Work Authorization<br/><br/></strong>All Roads Company does not provide H1-B sponsorship.<br/><br/><strong>AAP/EEO Statement<br/><br/></strong>All Roads Company and its subsidiaries is committed to equal opportunity for all, without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, age, veteran status, disability, genetic information, or any other protected characteristic. All Roads will make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodation would impose an undue hardship on the operation of our business.", "postedDate": "3 weeks ago", "benefits": "Medical, dental, vision, disability, life and supplemental insurance offerings on the 1st of the month after 30 days of employment, 401k with company contribution, Paid time off, Company paid holidays, Tuition Reimbursement program, Employee referral bonus program", "responsibilities": "Effectively order and coordinate upfits for a high volume of heavy and medium duty stock trucks., Review and confirm specifications of all trucks ordered, Communicate regularly with the sales management team to develop a successful inventory strategy., Accurately Input order information into OEM truck ordering systems, Other duties as needed", "qualifications": {"required": "Previous heavy truck spec experience required. Kenworth or Peterbilt truck ordering experience a plus."}, "skills": [], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3985158261"}