{"jobTitle": "Regional Sales Manager, Building Construction West", "company": {"name": "Topcon Positioning Systems", "location": "Clark County, NV"}, "location": "Clark County, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "Topcon Positioning Group is headquartered in Livermore, California, USA (topconpositioning.com).<br/><br/>We design, manufacture and distribute productivity tools for developing a brighter future. Whether cultivating the earth or building upon it, Topcon brings innovation in workflow automation and seamless connectivity of data to construction, geopositioning and agriculture industries focused on developing a sustainable tomorrow.<br/><br/>Topcon is an equal opportunity employer and does not discriminate against any employee or applicant on the basis of race, color, religion, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, genetic information, or other legally protected status.<br/><br/>To learn more about Topcon career opportunities go to www.topconcareers.com.<br/><br/><strong>Who Is Topcon?<br/><br/></strong>At Topcon, we’re more than just a global leader; we’re a catalyst for change. By leveraging our expertise in optics, positioning, and machine automation, we’re focused on making the world better by solving the challenges facing healthcare, agriculture, and infrastructure. Our solutions improve people’s lives by combining our precision technology and data solutions for better outcomes and increased productivity.<br/><br/>As part of our Topcon family of over 2,500 professionals, you’re not just another employee; you’re a valued member of a tight-knit community. We encourage you to be authentic and bring your own unique perspectives, knowledge and experiences. Across our global teams, you’ll discover individuals from diverse cultures and backgrounds collaborating to create a brighter, more sustainable future.<br/><br/><strong>Why Work at Topcon?<br/><br/></strong>At Topcon, stepping into a sales role means you're joining a mission-driven team dedicated to building a more sustainable future. Our work supports the people who are building and feeding the world, impacting some of society’s most pressing challenges.<br/><br/>As a sales professional, you are not just another employee; you are a key player in a global sales team that thrives on healthy competition and collaborative success. We cultivate a down-to-earth workplace where your competitive spirit, technical sales expertise, and creative ideas are valued and nurtured. Here, your passion for sales and technology drives real-world impact, making each achievement a part of our collective success story.<br/><br/><strong>Who You Are<br/><br/></strong><ul><li>As an ideal member of the Topcon sales team, you'll be:</li><li>Skilled in Technical Acumen, understanding and communicating complex technical products to a diverse clientele.</li><li>Competitive &amp; Supportive, excelling in maintaining a balance between competitive sales goals and supportive teamwork.</li><li>An Independent Self-Starter, thriving in a flexible, global sales environment while bringing creativity and initiative to your role.</li><li>A Team Collaborator, naturally fostering camaraderie and contributing to a culture of mutual success and support.</li><li>Staying Current, aligned with Topcon’s commitment to innovation and keeping abreast of the latest technologies and trends in your field.</li><li>Proven Sales track record within MEP/GC sales in Building construction.<br/><br/></li></ul><strong>What You Will Do<br/><br/></strong>In this dynamic sales role, you'll lead the charge in:<br/><br/><ul><li>Manage and cultivate relationships with existing high-level Building Construction dealers in our Western territory, while also identifying and pursuing opportunities with new distribution and large building construction accounts.</li><li>Develop Market Action Plans (MAPs) with dealers to target and capitalize on opportunities in the Western region.</li><li>Implement and oversee dealer awareness programs to highlight Topcon's offerings in the Building Construction sector, driving growth in this developing market.</li><li>Provide sales support and training to dealers, focusing on the Building segment, to enhance their product knowledge and drive sales.</li><li>Develop and execute promotional activities with dealers in the Building segment to boost sales and market share.</li><li>Provide expertise in scanning sales, understanding the scanning market, and leveraging this knowledge to drive sales strategies.</li><li>Prepare detailed management reports that analyze the current business environment and provide insights for strategic decision-making.<br/><br/></li></ul><strong>What You Need<br/><br/></strong>The ideal candidate for this position will bring a combination of the following skills and qualifications:<br/><br/><ul><li>BS/BA in Business/Marketing/Construction or similar experience</li><li>5 years minimum Building Construction Sales experience</li><li>10 plus years in construction equipment sales as well as past involvement in introducing new products to markets and sales channels</li><li>Excellent written and verbal communication skills.</li><li>Strong motivational and interpersonal abilities.</li><li>Proficiency in Microsoft Office products (Word, Excel, PowerPoint, &amp; Outlook).</li><li>Experience with/for an equipment manufacturer and backgrounds in both direct and channel sales are preferred.</li><li>Skilled sales knowledge and proficiency in Autodesk and other software associated with Vertical construction are required.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Must be able to carry/set up the Building Construction equipment.<br/><br/></li></ul><strong>Working Conditions<br/><br/></strong><ul><li>Available for Travel up to 70% of the time, throughout the Western territory.<br/><br/></li></ul><strong>Base Pay <br/><br/></strong>Expected Base Pay Range: $71,000 to $90,000 Annualized<br/><br/>The base pay range included is a projected hiring range for a position, level and potential work location(s) listed. Topcon provides the compensation range that it in good faith believes it might pay and/or offer for this position. This compensation range is based on a full-time schedule.<br/><br/>In addition to base pay, compensation for this position includes eligibility for certain Sales Incentives/Commissions.<br/><br/><strong>Benefits*</strong>:<br/><br/>Topcon offers a comprehensive benefit package for this position including medical, dental, vision, life insurance, disability insurance, tax saving spending accounts a 401(k) plan with employer match, tuition reimbursement in addition to other perks and benefits. We also offer time off for our employees to recharge. Our employees are eligible for paid company holidays, paid personal time off, and paid sick time that meets or exceeds state/local requirements.<br/><br/>Topcon reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation; individual candidate compensation may be determined based on individual skills, experience, training, certifications, education, final work location and other factors not related to an applicant’s sex or other status protected by local, state, or federal law. Changes in the position level, location or other factors associated with the role may change the final determined compensation. The recruiter can provide additional information during the hiring process.<br/><br/><ul><li>Topcon time off policies can vary as well as roles which are exempt or non-exempt. For hourly (“non-exempt”) employees, we offer personal paid time off which accrues in accordance with local standards. For salaried (“exempt”) employees, we offer a flexible paid time off policy giving you flexibility to take time when needed, while supporting business needs. All paid time off policies are in accordance with or exceeding local law. Employees working at least 30 hours per week are eligible for our Health and Welfare benefit package.</li></ul>", "responsibilities": "<ul><li>Manage and cultivate relationships with existing high-level Building Construction dealers in our Western territory, while also identifying and pursuing opportunities with new distribution and large building construction accounts.</li><li>Develop Market Action Plans (MAPs) with dealers to target and capitalize on opportunities in the Western region.</li><li>Implement and oversee dealer awareness programs to highlight Topcon's offerings in the Building Construction sector, driving growth in this developing market.</li><li>Provide sales support and training to dealers, focusing on the Building segment, to enhance their product knowledge and drive sales.</li><li>Develop and execute promotional activities with dealers in the Building segment to boost sales and market share.</li><li>Provide expertise in scanning sales, understanding the scanning market, and leveraging this knowledge to drive sales strategies.</li><li>Prepare detailed management reports that analyze the current business environment and provide insights for strategic decision-making.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>BS/BA in Business/Marketing/Construction or similar experience</li><li>5 years minimum Building Construction Sales experience</li><li>10 plus years in construction equipment sales as well as past involvement in introducing new products to markets and sales channels</li><li>Excellent written and verbal communication skills.</li><li>Strong motivational and interpersonal abilities.</li><li>Proficiency in Microsoft Office products (Word, Excel, PowerPoint, &amp; Outlook).</li><li>Experience with/for an equipment manufacturer and backgrounds in both direct and channel sales are preferred.</li><li>Skilled sales knowledge and proficiency in Autodesk and other software associated with Vertical construction are required.<br/><br/></li></ul>", "preferred": "<ul><li>Must be able to carry/set up the Building Construction equipment.<br/><br/></li></ul>"}, "skills": ["Technical Acumen", "Competitive", "Supportive", "Independent", "Self-Starter", "Team Collaborator", "Staying Current", "Sales", "Autodesk", "Microsoft Office", "Construction Equipment", "Building Construction", "MEP/GC"], "postedDate": "3 weeks ago", "benefits": "Topcon offers a comprehensive benefit package for this position including medical, dental, vision, life insurance, disability insurance, tax saving spending accounts a 401(k) plan with employer match, tuition reimbursement in addition to other perks and benefits. We also offer time off for our employees to recharge. Our employees are eligible for paid company holidays, paid personal time off, and paid sick time that meets or exceeds state/local requirements.", "remoteWork": "No", "salary": {"amount": "71,000 to 90,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3985087593"}