{"jobTitle": "Account Executive, Temp", "company": {"name": "LVMH Fragrance Brands", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00/yr - 85,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Personal Care Product Manufacturing", "description": "For more than 60 years Parfums Givenchy has perpetuated the values of its founder, Hubert de Givenchy, releasing fragrances, makeup and skincare products that define free, assertive and bold women.<br/><br/>Parfums Givenchy fragrances embody the brand’s Fearless Classic vision, fusing genres and revealing unexpected twists. Inspired by the avant-garde spirit and sensuality of Givenchy Couture creations, Nicolas Degennes, Makeup and Color Artistic Director since 1999, continues to reveal the inventiveness synonymous with Givenchy.<br/><br/>In 1970, Kenzo Takada instilled a touch of jungle exoticism at the heart of Paris, in Galerie Vivienne. With his colorful prints and his self-professed creative freedom, Kenzo upturned the couture diktats of the time by merrily breaking the rules. In keeping with this cheerful and colorful heritage, Carol Lim and Humberto Leon took over the artistic direction of the House of Kenzo in 2011.<br/><br/>The brand’s first feminine fragrance, called Kenzo, was born in 1988. Then followed a series of creations with a unique and original identity that made a strong impression on the world of perfumery. They all tell an optimistic story and play with a mix of multicultural codes to savor again and again. The bottles themselves are symbols of pure refinement and emblems of the brand’s values.<br/><br/>LVMH Fragrance Brands invites you today to join its North America teams.<br/><br/>LVMH Fragrance Brands is part of the LVMH Group<br/><br/><strong>Job Description<br/><br/></strong>The Account Executive will be responsible for executing the business strategies as developed by Corporate. They will oversee the development of LVMH Fragrance Brands at the retail sales level within their assigned territory. This position is scheduled as a 3-month assignment with the opportunity of extension.<br/><br/><strong>Principal Duties And Responsibilities<br/><br/></strong><strong>Execution of Account Strategy by</strong>:<br/><br/><ul><li>Achieving and driving established retail sales goals as set forth by Corporate. </li><li>Ensuring the proper usage of all client retention systems in each account. </li><li>Recruiting, hiring, and motivating Beauty Advisors to achieve established sales goals. </li><li>Recruiting, hiring, scheduling, and managing freelancers to assist in the achievement of sales goals. This responsibility also includes proper budget management. </li><li>Working with appropriate store personnel in the proper planning and execution of product launches, promotions, and special events. </li><li>Implementing the corporate merchandising guidelines to ensure LVMH Fragrance Brands’ image at point of sale at all times. </li><li>Negotiating with store personnel to gain space and improve locations for all product categories at the beauty counter, women’s fragrance counter, and the men’s bar. </li><li>Providing the corporate office with updates for the account profile book including changes to space, location, and staffing. </li><li>Assisting the Education Department in the training and development of all Beauty Advisors while maintaining constant and productive communication/partnerships with Education Executives. </li><li>Providing the Sales team with necessary information for the account’s monthly business report including information on new product launches, promotions, and special events. </li><li>Conduct all other job-related activities including daily travel to locations. <br/><br/></li></ul><strong>SUPERVISION RECEIVED<br/><br/></strong>Regional Sales Director<br/><br/><strong>SUPERVISION EXERCISED<br/><br/></strong>Counter Managers (<em>if applicable</em>)<br/><br/>Beauty Advisors<br/><br/>Selling Specialists<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>5+ years of recruiting and selecting top-performing Beauty Advisors, in addition to multi-door specialty account sell thru experience</li><li>Strong interpersonal and communication skills</li><li>Persistence in quest to improve the market share of all Brand brands within area of responsibility</li><li>Computer skills necessary to operate all Microsoft Office programs</li><li>Each Account Executive works from a home office</li><li>Travel varies by territory and can be extensive</li><li>Hours of work must be flexible to meet job objectives</li><li>Deals with confidential information and/or issues using discretion and judgment<br/><br/></li></ul>Additional Information<br/><br/>LVMH Inc. uses the published salary range as a guideline to provide our employees with market competitive pay while allowing for flexibility to recognize and reward various levels of expertise, performance and tenure.<br/><br/>While the published salary range is a good faith reflection of the targeted salary level for the position, LVMH Inc. reserves the right to pay outside of the published salary range of $75,000-$85,000.<br/><br/>This job description is intended to cover the core accountabilities of the position and is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities, and activities may change, or new ones may be assigned at any time with or without notice.<br/><br/>All your information will be kept confidential according to EEO guidelines.", "responsibilities": "The Account Executive will be responsible for executing the business strategies as developed by Corporate. They will oversee the development of LVMH Fragrance Brands at the retail sales level within their assigned territory. This position is scheduled as a 3-month assignment with the opportunity of extension.<br/><br/><strong>Principal Duties And Responsibilities<br/><br/></strong><strong>Execution of Account Strategy by</strong>:<br/><br/><ul><li>Achieving and driving established retail sales goals as set forth by Corporate. </li><li>Ensuring the proper usage of all client retention systems in each account. </li><li>Recruiting, hiring, and motivating Beauty Advisors to achieve established sales goals. </li><li>Recruiting, hiring, scheduling, and managing freelancers to assist in the achievement of sales goals. This responsibility also includes proper budget management. </li><li>Working with appropriate store personnel in the proper planning and execution of product launches, promotions, and special events. </li><li>Implementing the corporate merchandising guidelines to ensure LVMH Fragrance Brands’ image at point of sale at all times. </li><li>Negotiating with store personnel to gain space and improve locations for all product categories at the beauty counter, women’s fragrance counter, and the men’s bar. </li><li>Providing the corporate office with updates for the account profile book including changes to space, location, and staffing. </li><li>Assisting the Education Department in the training and development of all Beauty Advisors while maintaining constant and productive communication/partnerships with Education Executives. </li><li>Providing the Sales team with necessary information for the account’s monthly business report including information on new product launches, promotions, and special events. </li><li>Conduct all other job-related activities including daily travel to locations. <br/><br/></li></ul><strong>SUPERVISION RECEIVED<br/><br/></strong>Regional Sales Director<br/><br/><strong>SUPERVISION EXERCISED<br/><br/></strong>Counter Managers (<em>if applicable</em>)<br/><br/>Beauty Advisors<br/><br/>Selling Specialists", "qualifications": {"required": "5+ years of recruiting and selecting top-performing Beauty Advisors, in addition to multi-door specialty account sell thru experience, Strong interpersonal and communication skills, Persistence in quest to improve the market share of all Brand brands within area of responsibility, Computer skills necessary to operate all Microsoft Office programs, Each Account Executive works from a home office, Travel varies by territory and can be extensive, Hours of work must be flexible to meet job objectives, Deals with confidential information and/or issues using discretion and judgment", "preferred": ""}, "skills": ["Microsoft Office", "Sales", "Communication", "Recruiting", "Management"], "postedDate": "3 weeks ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3985079989"}