{"jobTitle": "Solution Sales Manager - Hospitality", "company": {"name": "Belden Inc.", "location": "Las Vegas Metropolitan Area"}, "location": "Las Vegas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Manufacturing", "description": "Belong. Believe. Be You. Belden.<br/><br/>Propel your career surrounded by a diverse team of innovative, goal-oriented individuals who are pursuing the next generation of connectivity solutions. At Belden, you’ll participate in work that will challenge you and position you to excel. You’ll collaborate with colleagues from around the world, gaining exposure to a broad base of expertise and perspectives.<br/><br/>Together, we’ll continue on a journey of innovation, creating a connected world and paving the way for automation. Join us and let’s build the future.<br/><br/><strong>Job Summary:<br/><br/></strong>Belden is seeking a Solution Account Manager – Hospitality, to join our growing team. The Solution Account Manager will focus on establishing and maintaining strategic accounts within their assigned client vertical. The Account Manager is responsible for identifying and developing high potential targets whose business aligns to Belden’s leveraged markets or to our Global Smart Building Commercial Plan. The ideal candidate will have demonstrated the ability to leverage industry and client relationship skills within the Enterprise Hospitality Market, i.e., Hotels, Casinos, Theme Parks and Cruise Lines. The Account Manager is responsible for coordinating all aspects of proposing and delivering favorable customer outcomes to target clients with their region or target account base.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Execute Belden’s Commercial Hospitality Strategy as defined by the Hospitality Global Account Lead. Implement defined sales process, deploy programs and deliver outcomes pursuant to the Global Hospitality Plan</li><li>Develop and implement sales strategies to identify and secure business opportunities preferably in the Western United States</li><li>Utilize professional consultative sales approach to conduct needs analysis and evaluate proper resource engagement</li><li>Collaborate with Belden Application Engineers to develop unique and customizable solutions utilizing any number of Belden supporting successful customer outcomes</li><li>Engage Field Sales Team when appropriate to develop an effective Channel Strategy incorporating Contractors, Integrators, Consultants or Supply Chain Partners</li><li>Responsible for expansion of business within Region and Target Account, utilizing all Belden Smart Building and connectivity products</li><li>Collaborate with Marketing and Product Line Management to maximize volume, mix, &amp; margin</li><li>Role will serve as a key member within the Enterprise Sales Team, contributing to strategic direction, program development and customer relationship within targets</li><li>Drive Partner friendly strategies consistent with the Company Strategic Plan to enhance market/product intelligence as well as volume sales</li><li>Provide regular feedback to senior management on sales potential and other important activities within market responsibilities<br/><br/></li></ul><strong>Required Skills And Experience<br/><br/></strong><ul><li>Proficient in Enterprise Functions, Systems and Architecture</li><li>5 or more years of Relevant Sales and Technical Experience in similar or adjacent markets</li><li>College degree preferred</li><li>Strong experience and knowledge in the hospitality vertical</li><li>Ability to define requirements and differentiate customer needs within Hotel, Casino, Theme Park and Cruise Line environments</li><li>Preferred Industry Certifications: BICSI RCDD, DCDC, CTS, CTSD and/or PSP</li><li>Ideal candidate will reside in the Western United States</li><li>Experience specifying and designing Hospitality Infrastructure systems preferred</li><li>Excellent communication and presentation skills</li><li>Experience speaking to C Suite Executives</li><li>Ability/willingness to travel up to 50%</li><li>Experience or participation in industry associations i.e. HTNG, Hitech, Sea trade, TEA, G2E<br/><br/></li></ul><em>Applicants can expect a base compensation range of $120,000 - $160,000 plus benefits and additional incentives based on the level of the role. This is the reasonable estimate that Belden believes it might pay for this job based on applicable circumstances at the time of posting. Belden may ultimately pay more or less than the posted range as permitted by law, and commensurate with the applicant’s experience, qualifications, and geographical location. <br/><br/></em><em>Belden also offers hybrid and remote work practices where feasible and provides employees with benefits that could include health/dental/vision, long term/short term disability, life insurance, HSA/FSA, matching retirement plans, paid vacation, parental leave, employee stock purchase plan, paid leave for volunteer work in your community, training opportunities, professional talent management and succession planning, corporate health well-being initiatives and a work culture which includes commitment to diversity, equity, inclusion and sustainability!<br/><br/></em><strong>Let’s Write the Next 100 Years Together. <br/><br/></strong>Join a global community striving to improve connectivity and security. The work we’re doing puts our people on the front lines of impacting lives and shaping the future. Propel your story of innovation by helping Belden write the next chapter in ours. Shape your future at Belden.<br/><br/>These statements are intended to describe the general nature and level of work involved for this job. It is not an exhaustive list of all responsibilities, duties and skills required of this job.", "postedDate": "3 weeks ago", "qualifications": {"required": "Proficient in Enterprise Functions, Systems and Architecture\n5 or more years of Relevant Sales and Technical Experience in similar or adjacent markets\nCollege degree preferred\nStrong experience and knowledge in the hospitality vertical\nAbility to define requirements and differentiate customer needs within Hotel, Casino, Theme Park and Cruise Line environments\nPreferred Industry Certifications: BICSI RCDD, DCDC, CTS, CTSD and/or PSP\nIdeal candidate will reside in the Western United States\nExperience specifying and designing Hospitality Infrastructure systems preferred\nExcellent communication and presentation skills\nExperience speaking to C Suite Executives\nAbility/willingness to travel up to 50%\nExperience or participation in industry associations i.e. HTNG, Hitech, Sea trade, TEA, G2E", "preferred": "BICSI RCDD, DCDC, CTS, CTSD and/or PSP"}, "skills": ["Enterprise Functions", "Systems and Architecture", "Sales", "Technical Experience", "Hospitality", "Hotel", "Casino", "Theme Park", "Cruise Line", "Communication", "Presentation", "C Suite Executives", "Industry Associations", "HTNG", "Hitech", "Sea trade", "TEA", "G2E"], "benefits": "Applicants can expect a base compensation range of $120,000 - $160,000 plus benefits and additional incentives based on the level of the role. This is the reasonable estimate that Belden believes it might pay for this job based on applicable circumstances at the time of posting. Belden may ultimately pay more or less than the posted range as permitted by law, and commensurate with the applicant’s experience, qualifications, and geographical location. <br/><br/>Belden also offers hybrid and remote work practices where feasible and provides employees with benefits that could include health/dental/vision, long term/short term disability, life insurance, HSA/FSA, matching retirement plans, paid vacation, parental leave, employee stock purchase plan, paid leave for volunteer work in your community, training opportunities, professional talent management and succession planning, corporate health well-being initiatives and a work culture which includes commitment to diversity, equity, inclusion and sustainability!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3986965871"}