{"jobTitle": "Purchasing and Logistics Manager", "company": {"name": "Randstad USA", "location": "Delray Beach, FL"}, "location": "Delray Beach, FL", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Experienced", "salary": {"amount": "55,000.00 - 70,000.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "We specialize in staffing for Purchasing and Logistics for the West Palm Beach to Deerfield Beach area and we are looking to fill Purchasing and Logistics positions for this area. The Purchasing and Logistics Manager will be responsible for overseeing all aspects of our procurement and logistics operations. This includes managing vendor relationships, negotiating contracts, ensuring timely delivery of goods, and optimizing our supply chain processes. The ideal candidate will have a strong background in purchasing and logistics, excellent negotiation skills, and a keen eye for detail. Apply today and email resumes to lauren.izzo@randstadusa.com<br/><br/>salary: $55,000 - $70,000 per year<br/><br/>shift: First<br/><br/>work hours: 8 AM - 5 PM<br/><br/>education: Bachelors<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop and implement procurement strategies to ensure cost-effective sourcing of materials and services.</li><li>Manage vendor relationships, including evaluating performance, negotiating contracts, and ensuring compliance with terms and conditions.</li><li>Coordinate logistics operations, including shipping, receiving, warehousing, and distribution.</li><li>Monitor inventory levels and implement inventory control procedures to minimize excess and obsolete stock.</li><li>Analyze supply chain data to identify and implement process improvements.</li><li>Collaborate with internal departments to forecast demand and ensure timely delivery of products.</li><li>Prepare and present reports on procurement and logistics activities to senior management.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Operations</li><li>Purchasing/Procurement</li><li>Logistics<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Years of experience: 4 years</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.", "responsibilities": "Develop and implement procurement strategies to ensure cost-effective sourcing of materials and services. Manage vendor relationships, including evaluating performance, negotiating contracts, and ensuring compliance with terms and conditions. Coordinate logistics operations, including shipping, receiving, warehousing, and distribution. Monitor inventory levels and implement inventory control procedures to minimize excess and obsolete stock. Analyze supply chain data to identify and implement process improvements. Collaborate with internal departments to forecast demand and ensure timely delivery of products. Prepare and present reports on procurement and logistics activities to senior management.", "qualifications": {"required": "Years of experience: 4 years", "preferred": "Experience level: Experienced"}, "skills": ["Operations", "Purchasing/Procurement", "Logistics"], "postedDate": "2 weeks ago", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3987663338"}