{"jobTitle": "Account Manager K-12 EDU (Beaverton, OR or remote KY)", "company": {"name": "CTL ", "industry": "Internet Publishing", "location": "Beaverton, OR"}, "location": "Beaverton, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "<strong>About Us<br/><br/></strong>CTL, headquartered in Beaverton, Oregon, since 1989, is a Chromebook, Chromebook Tablet, and Chromebox manufacturer. We are a Google Education Premier Partner, and our products have been recognized as some of the top-rated Chrome devices in the market. Our international successes include recognition from CRN as one of the leading EdTech solutions providers in the US and Europe. At the same time, nationally, we’ve been recognized by Inc. Magazine as one of the fastest-growing companies in the US. More locally, we were recently named in the list of “Best and Brightest Companies to Work For” in the Pacific Northwest.<br/><br/>We are currently looking for an experienced Account Manager to join our team. In this role, you will be responsible for promoting our products to K-12 education customers through inside sales via a combination of emails, phone calls, web meetings, and the occasional face-to-face meeting. You will be responsible for managing the full sales cycle, including researching potential leads, acquiring and managing new client relationships, and successfully closing sales targeting K-12 EDU accounts within an assigned territory (Kentucky).<br/><br/>The location for this position is flexible for the right candidate, although we prefer candidates based in Oregon who can come into our Beaverton office on a hybrid schedule or in Kentucky on a remote basis. This is a full-time position with working hours Monday through Friday, 8 am to 5 pm.<br/><br/>Essential Job Duties and Responsibilities:<br/><br/>Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.<br/><br/><ul><li>Prospect and develop outreach strategies to implement a regular cadence of virtual and onsite meetings within the territory</li><li>Proactively manage and build your sales pipeline, including bringing the sale from inquiry to a close</li><li>Coordinate quotes, provide customer service, manage customer accounts, and monitor sales</li><li>Assist customers with inquiries, including product information, pricing, stock availability, tracking orders, RMAs, and other customer service information (e.g., lost shipments, missing or damaged items, etc.)</li><li>Keep an up-to-date sales pipeline and client database to track sales opportunities</li><li>Maintain close contact with the clients whenever an issue is at stake to ensure proper resolution</li><li>Contribute to continuous process improvements</li><li>Other tasks as assigned<br/><br/></li></ul>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities required of the employee for this job.<br/><br/>Qualifications:<br/><br/><ul><li>Proven successful sales experience in a similar role</li><li>Strong sense of urgency and desire to win</li><li>Strong interpersonal and written communication skills with a results-oriented growth mindset</li><li>Excel at working independently to solve problems and make decisions through a combination of analysis, communication, experience, and independent judgment</li><li>Enjoy working hard and looking for challenges in a flexible environment; able to act and react as necessary, even if limited information is available</li><li>Background in technology sales is preferred</li><li>Experience selling to K-12 school districts in Kentucky is preferred</li><li>Knowledge of selling Google Chrome licenses is a plus</li><li>Experience working with HubSpot CRM is a plus</li><li>Ability to travel as needed (up to 20%)</li><li>Bachelor’s degree or equivalent sales experience is required<br/><br/></li></ul>As an Account Manager, you’ll get to be creative and strategic in finding solutions that work for your customers and help grow your territory. We value people who know how to get things done and aren’t afraid to think outside of the box when problem-solving.<br/><br/>Additional Company Details:<br/><br/>Perks:<br/><br/><ul><li>Competitive salary</li><li>Bonus potential</li><li>Work-life balance</li><li>Comprehensive health insurance options include medical, dental, vision, short and long-term disability, and company-supported basic life insurance</li><li>Generous paid vacation (PTO) and paid holiday package</li><li>401K with generous employer matching and 100% vesting in 3 years</li><li>Flexible Spending Account (FSA) plan with company contribution</li><li>Business casual to casual dress code in the office</li><li>Employee discounts on CTL products</li><li>Free parking on-site, free electric vehicle charging, cell phone subsidy, dog-friendly office, free snacks, and sparkling water</li><li>Hybrid work schedule for office employees<br/><br/></li></ul>Company Culture:<br/><br/>We’re a fast-growing company that values innovation, creativity, and strategic thinking and is dedicated to doing things differently from our competitors. We collaborate and celebrate with our colleagues and love it when new ideas are brought forward. Because you’re responsible for maintaining and developing relationships with CTOs and CIOs in school districts across a large territory, you’ll have a lot of variety and exposure to working with different types of people.<br/><br/>What Next?<br/><br/>If you like what you’ve read so far, and you are a self-motivated and enthusiastic person who enjoys sales and being a part of a team. And you are good at time management, persuasion, and communication - we’d love to talk with you! Those with a bachelor’s degree or equivalent sales experience are encouraged to apply.<br/><br/>Powered by JazzHR<br/><br/>A3M9kjEosf", "responsibilities": "Prospect and develop outreach strategies to implement a regular cadence of virtual and onsite meetings within the territory\nProactively manage and build your sales pipeline, including bringing the sale from inquiry to a close\nCoordinate quotes, provide customer service, manage customer accounts, and monitor sales\nAssist customers with inquiries, including product information, pricing, stock availability, tracking orders, RMAs, and other customer service information (e.g., lost shipments, missing or damaged items, etc.)\nKeep an up-to-date sales pipeline and client database to track sales opportunities\nMaintain close contact with the clients whenever an issue is at stake to ensure proper resolution\nContribute to continuous process improvements\nOther tasks as assigned", "qualifications": {"required": "Proven successful sales experience in a similar role\nStrong sense of urgency and desire to win\nStrong interpersonal and written communication skills with a results-oriented growth mindset\nExcel at working independently to solve problems and make decisions through a combination of analysis, communication, experience, and independent judgment\nEnjoy working hard and looking for challenges in a flexible environment; able to act and react as necessary, even if limited information is available\nBachelor’s degree or equivalent sales experience is required", "preferred": "Background in technology sales\nExperience selling to K-12 school districts in Kentucky\nKnowledge of selling Google Chrome licenses\nExperience working with HubSpot CRM\nAbility to travel as needed (up to 20%)"}, "skills": ["Sales", "Customer Service", "Communication", "CRM", "Technology", "Education", "Google Chrome", "HubSpot"], "postedDate": "2 weeks ago", "benefits": "Competitive salary\nBonus potential\nWork-life balance\nComprehensive health insurance options include medical, dental, vision, short and long-term disability, and company-supported basic life insurance\nGenerous paid vacation (PTO) and paid holiday package\n401K with generous employer matching and 100% vesting in 3 years\nFlexible Spending Account (FSA) plan with company contribution\nBusiness casual to casual dress code in the office\nEmployee discounts on CTL products\nFree parking on-site, free electric vehicle charging, cell phone subsidy, dog-friendly office, free snacks, and sparkling water\nHybrid work schedule for office employees", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3987696796"}