{"jobTitle": "Wholesale Customer Service ", "company": {"name": "UNOde50", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Customer Service and Sales", "industry": "Retail and Wholesale Luxury Goods and Jewelry", "description": "Hey! At UNOde50, normality is left at the door. “Goodbye, boredom! Hello UNO world!” Here, being yourself is not only allowed, it's applauded! If you like to fly high and dream big, this is your project. Do you think you are our “ONE in a million” for the position of Wholesale Customer Service at our NYC corporate office ? Let’s see if you have what it takes to shine!\n\nROLE AND RESPONSIBILITIES: \n\n\n\n<ul><li>Assist customers and Sales Reps with all questions and concerns via phone and email.</li><li>Create new customer accounts in the system; update existing customer account information as necessary.</li><li>Resolve product or service problems by clarifying the customer's complaint; determine the cause of the problem; select and explain the best solution to solve the problem; expedite correction or adjustment; follow up to ensure resolution.</li><li>Oversee sales order booking throughout its entire life cycle – from order processing to shipment and invoicing to ensure that all POs are delivered properly within specified timeframe. </li><li>Maintain financial accounts by processing customer adjustments by applying credits and returns.</li><li>Recommend potential products or services to management by collecting customer information and analyzing customer needs.</li><li>Run weekly reports to monitor delivery – coordinate between Wholesale Manager and the Sales team to proactively identify potential problems before issues occur, alert the appropriate personnel in order to seek resolutions – share shipment progress and discrepancies with Manager/Reps on a weekly basis to target most effective methods to address opportunities and concerns.</li><li>Create invoices and send copies of orders &amp; invoices as necessary.</li><li>Enter orders and upload Brandwise.</li><li>Issue RA’s and follow up on repairs/credits.</li><li>Other duties as assigned.</li></ul>\n\n\n\nQUALIFICATIONS AND EDUCATION REQUIREMENTS: \n<ul><li>Minimum 1-2 years of customer service or administrative experience</li><li>Customer service skills</li><li>Problem solving</li><li>Administrative skills</li><li>Conflict resolution</li><li>Multi-tasking</li><li>Documentation and analyzing information skills</li><li>Computer Proficiency Required: MS Excel, Word, PowerPoint, Outlook</li></ul>\n <strong>PREFERRED SKILLS:</strong> \n<ul><li>Product Knowledge inclination</li><li><strong>Sales inclination</strong></li></ul>\n\n\n\nUnode50 is an equal opportunity employer. We value a culture of inclusion and diversity within our workforce, and are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marital status, domestic partner status, civil partnership, status as a covered veteran, status in the Uniformed Service of the United States, citizenship, pregnancy (including unlawful discrimination on the basis of a legally protected pregnancy or maternity leave) and any other characteristic protected by law (“Protected Characteristics”).", "responsibilities": "Assist customers and Sales Reps with all questions and concerns via phone and email.Create new customer accounts in the system; update existing customer account information as necessary.Resolve product or service problems by clarifying the customer's complaint; determine the cause of the problem; select and explain the best solution to solve the problem; expedite correction or adjustment; follow up to ensure resolution.Oversee sales order booking throughout its entire life cycle – from order processing to shipment and invoicing to ensure that all POs are delivered properly within specified timeframe. Maintain financial accounts by processing customer adjustments by applying credits and returns.Recommend potential products or services to management by collecting customer information and analyzing customer needs.Run weekly reports to monitor delivery – coordinate between Wholesale Manager and the Sales team to proactively identify potential problems before issues occur, alert the appropriate personnel in order to seek resolutions – share shipment progress and discrepancies with Manager/Reps on a weekly basis to target most effective methods to address opportunities and concerns.Create invoices and send copies of orders &amp; invoices as necessary.Enter orders and upload Brandwise.Issue RA’s and follow up on repairs/credits.Other duties as assigned.", "qualifications": {"required": "Minimum 1-2 years of customer service or administrative experienceCustomer service skillsProblem solvingAdministrative skillsConflict resolutionMulti-taskingDocumentation and analyzing information skillsComputer Proficiency Required: MS Excel, Word, PowerPoint, Outlook", "preferred": "Product Knowledge inclinationSales inclination"}, "skills": ["Customer service", "Problem solving", "Administrative", "Conflict resolution", "Multi-tasking", "Documentation", "Analyzing information", "MS Excel", "Word", "PowerPoint", "Outlook", "Product Knowledge", "Sales"], "postedDate": "3 weeks ago", "url": "https://www.linkedin.com/jobs/view/3987237289"}