{"jobTitle": "System Engineer", "company": {"name": "Titan Technologies", "location": "Destin, FL"}, "location": "Destin, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "Contingent Upon Award*<br/><br/>The Systems Engineer provides advanced support to users in resolving problems with the various applications and workstations. The responsibilities may also include user-centric support including user hardware and software delivery, installation, and break-fix support. Working closely with network and cybersecurity engineers, this engineer will resolve Incidents and problems and coordinate Service Request resolutions with the proper personnel at the various site locations.<br/><br/><strong>Duties Include But Are Not Limited To<br/><br/></strong><ul><li>Manage incident and problem resolution process</li><li>Perform Tier 1 and 2 Troubleshooting and resolution</li><li>Troubleshoot and repair end user devices</li><li>Install and troubles software</li><li>Re-image hardware</li><li>Perform shared file access maintenance</li><li>Maintain local registration authority capabilities</li><li>Provide information and tracking on IT Projects, ASIs, incidents, and changes that impact customers Ensuring incidents are routed and/or escalated to the appropriate support group in coordination with lab personnel develop solutions to issues or workarounds</li><li>Maintain knowledge management database<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>DoDD 8570.01-M IAT II certification required - Security + Certification </li><li>High School Diploma and 11 years or BS and 2 years experience or MS and1 year experience</li><li>General experience includes background in information systems development, network operations, application performance in a client/server environment, or related fields.</li><li>Specialized experience includes the management of help desks in a multi-user environment, a comprehensive understanding of PC operating systems, a working knowledge of network and electronic mail operations and prior supervision of help desk employees.<br/><br/></li></ul><strong>Clearance<br/><br/></strong><ul><li>Applicants selected will be subject to a security investigation and need to meet eligibility requirements for access to classified information; TS/SCI Clearance is required.<br/><br/></li></ul><strong>Company Description<br/><br/></strong>Titan Technologies, LLC, and our wholly owned subsidiaries, TelaForce, LLC and Titan Facilities, Inc., design, build, integrate, and manage innovative solutions and software applications. Our remarkable people, working collaboratively under a shared vision, have earned a reputation with our customers for delivering results with maximum impact. Sound intriguing? Consider Titan Technologies for the next step in your career journey and be part of an impactful team!<br/><br/>Titan is proud to be a Service Disabled Veteran Owned Business.<br/><br/>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities<br/><br/>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)", "postedDate": "2 weeks ago", "skills": ["Security+", "DoDD 8570.01-M IAT II", "Information Systems Development", "Network Operations", "Application Performance", "Help Desk Management", "PC Operating Systems", "Network Operations", "Electronic Mail Operations", "Supervision"], "url": "https://www.linkedin.com/jobs/view/3988630832"}