{"jobTitle": "Regional Marketing & Philanthropic Lead-Austin", "company": {"name": "Kendra Scott", "location": "Austin, Texas Metropolitan Area"}, "location": "Austin, Texas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Project Management, and Strategy/Planning", "industry": "Retail and Retail Apparel and Fashion", "description": "<strong>Position Overview: </strong><p>The Regional Marketing and Philanthropic Lead is responsible for growing brand heat, customer acquisition &amp; community footprint at the regional level. This position mirrors the Retail structure and reports directly to the Regional Marketing &amp; Philanthropic Manager-West, district, and store level focus areas. </p><p><br/></p><p><br/></p><p><strong>Responsibilities: </strong></p><p>Your primary role involves executing localized retail-focused events and partnerships, assisting MPM in garnering local press impressions and hosting ongoing philanthropic outreach. </p><ul><li>Identifies and fosters partnerships with philanthropic organizations, local businesses, and community influencers to develop revenue-driving initiatives that simultaneously drive brand heat, awareness, and traffic </li><li>Customizes monthly regional retail marketing strategy to best connect with local customers and tell brand story in the most meaningful ways </li><li>Holds accountability and able to strategize with Retail Managers cross functional partner and local retail team(s) member(s) to effectively plan for and achieve quarterly event revenue goals through regional events and partnerships </li><li>Optimizes brand perception through quality execution of events, partnerships, and local press relationships </li><li>Experiments, learns, evolves, and shares best practices with counterparts and key stakeholders </li><li>Acts as a leader and a brand ambassador always by living out the KS core values and setting the example for other team members </li><li>Manages a monthly budget, product/charitable donations and ensures ROI/ revenue goals for district are achieved </li><li>Primary KPIs are brand awareness and overall business growth as measured by revenue and traffic with a special focus on events </li><li>Partners cross functionally with HQ teams to support brand campaigns in the Austin market and amplify with local connections </li></ul><p><strong>Our Ideal Candidate Will Have: </strong></p><p><u>Skills &amp; Knowledge </u></p><ul><li>Highly motivated individual with proven experience in driving event revenue </li><li>Proficiency in Microsoft Office Suite </li><li>Proven record of accomplishment of success within a specialty retail environment </li><li>Solid experience bringing events to life in a Retail organization </li><li>Proficient project Management skills </li><li>Solid written and oral communication skills. </li><li>Skilled at networking and connecting with community partners</li></ul><p><u>Experience &amp; Education Required </u></p><ul><li>Bachelor’s degree </li><li>Minimum 3 years job specific experience</li><li>CPG and/or Retail Marketing experience (premium retail preferred) </li></ul><p><u>Other Requirements</u></p><ul><li>Travel: 15%</li><li>Must live in Austin, and have the ability to work in our Home Office as needed</li></ul><p><br/></p><p><em>We are an equal opportunity employer and value diversity at our company.</em></p>", "responsibilities": "Your primary role involves executing localized retail-focused events and partnerships, assisting MPM in garnering local press impressions and hosting ongoing philanthropic outreach. ", "qualifications": {"required": "Highly motivated individual with proven experience in driving event revenue, Proficiency in Microsoft Office Suite, Proven record of accomplishment of success within a specialty retail environment, Solid experience bringing events to life in a Retail organization, Proficient project Management skills, Solid written and oral communication skills., Skilled at networking and connecting with community partners", "preferred": "Bachelor’s degree, Minimum 3 years job specific experience, CPG and/or Retail Marketing experience (premium retail preferred) "}, "skills": ["Microsoft Office Suite", "Project Management", "Communication", "Networking"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988858765"}