{"jobTitle": "Sr Programmer Analyst / Data Operations (REMOTE)", "company": {"name": "BAE Systems, Inc.", "location": "Fort Walton Beach, FL"}, "location": "Fort Walton Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75510 - 128340", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing", "description": "This Job Is Fully Remote<br/><br/><br/>This role is for an Oracle database administrator to be part of our operational excellence team. This team is responsible for creation and management of scripts leveraged across all database administration teams, focusing on automation and compliance. We are looking for a database administrator who is capable of designing solutions using PL/SQL and shell scripts to meet requirements.<br/>Required Education, Experience, &amp; Skills <br/><br/>\n<ul><li>4+ years’ experience with Oracle databases, capable of writing complex queries and developing complex PL/SQL database objects (DML and DDL).</li><li>3+ years’ experience with database and/or SQL performance tuning.</li><li>2+ years’ experience with Oracle database administration.</li><li>Experience with RMAN backups.</li><li>Familiarity with Unix and Linux operating systems.</li><li>Proficiency in relational database designs.</li><li>Experience with software source control systems (e.g., Git, Subversion).</li><li>Experience with database query tools (e.g., TOAD, SQL Developer, SQL Navigator).</li><li>Knowledge of database security, including role-based security.<br/><br/><br/></li></ul>Preferred Education, Experience, &amp; Skills <br/><br/>\n<ul><li>Experience with SonarQube for code inspection and quality control</li><li>Experience with using and administering Oracle Enterprise Manager.</li><li>Experience with the setup and configuration of Oracle database for high availability using tools like Oracle RAC and Data Guard </li><li>Experience writing and debugging shell scripts</li><li>Experience with Oracle multitenant architecture<br/><br/><br/></li></ul>Pay Information<br/><br/>Full-Time Salary Range: $75510 - $128340<br/><br/>Please note: This range is based on our market pay structures. However, individual salaries are determined by a variety of factors including, but not limited to: business considerations, local market conditions, and internal equity, as well as candidate qualifications, such as skills, education, and experience.<br/><br/>Employee Benefits: At BAE Systems, we support our employees in all aspects of their life, including their health and financial well-being. Regular employees scheduled to work 20+ hours per week are offered: health, dental, and vision insurance; health savings accounts; a 401(k) savings plan; disability coverage; and life and accident insurance. We also have an employee assistance program, a legal plan, and other perks including discounts on things like home, auto, and pet insurance. Our leave programs include paid time off, paid holidays, as well as other types of leave, including paid parental, military, bereavement, and any applicable federal and state sick leave. Employees may participate in the company recognition program to receive monetary or non-monetary recognition awards. Other incentives may be available based on position level and/or job specifics.<br/><br/><br/>About BAE Systems, Inc.BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it’s what we do at BAE Systems. Working here means using your passion and ingenuity where it counts – defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team—making a big impact on a global scale. At BAE Systems, you’ll find a rewarding career that truly makes a difference.<br/><br/><br/><br/>Our Commitment To Diversity, Equity, And Inclusion<br/><br/><br/>At BAE Systems, we work hard every day to nurture an inclusive culture where employees are valued and feel like they belong. We are conscious of the need for all employees to see themselves reflected at every level of the company and know that in order to unlock the full potential of our workforce, everyone must feel confident being their best, most sincere self and be equipped to thrive. We provide impactful professional development experiences to our employees and invest in social impact partnerships to uplift communities and drive purposeful change. Here you will find significant opportunities to do meaningful work in an environment intentionally designed to be one where you will learn, grow and belong.", "responsibilities": null, "qualifications": {"required": "4+ years’ experience with Oracle databases, capable of writing complex queries and developing complex PL/SQL database objects (DML and DDL).\n3+ years’ experience with database and/or SQL performance tuning.\n2+ years’ experience with Oracle database administration.\nExperience with RMAN backups.\nFamiliarity with Unix and Linux operating systems.\nProficiency in relational database designs.\nExperience with software source control systems (e.g., Git, Subversion).\nExperience with database query tools (e.g., TOAD, SQL Developer, SQL Navigator).\nKnowledge of database security, including role-based security.", "preferred": "Experience with SonarQube for code inspection and quality control\nExperience with using and administering Oracle Enterprise Manager.\nExperience with the setup and configuration of Oracle database for high availability using tools like Oracle RAC and Data Guard \nExperience writing and debugging shell scripts\nExperience with Oracle multitenant architecture"}, "skills": ["Oracle", "PL/SQL", "Shell Scripting", "Database Administration", "SQL", "Performance Tuning", "RMAN", "Unix", "Linux", "Relational Database Design", "Git", "Subversion", "TOAD", "SQL Developer", "SQL Navigator", "Database Security", "SonarQube", "Oracle Enterprise Manager", "Oracle RAC", "Data Guard", "Oracle Multitenant Architecture"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": "At BAE Systems, we support our employees in all aspects of their life, including their health and financial well-being. Regular employees scheduled to work 20+ hours per week are offered: health, dental, and vision insurance; health savings accounts; a 401(k) savings plan; disability coverage; and life and accident insurance. We also have an employee assistance program, a legal plan, and other perks including discounts on things like home, auto, and pet insurance. Our leave programs include paid time off, paid holidays, as well as other types of leave, including paid parental, military, bereavement, and any applicable federal and state sick leave. Employees may participate in the company recognition program to receive monetary or non-monetary recognition awards. Other incentives may be available based on position level and/or job specifics.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3988744704"}