{"jobTitle": "Logistics Analyst", "company": {"name": "LATICRETE International", "location": "Sunrise, FL"}, "location": "Sunrise, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "<strong>Classification:<br/><br/></strong>Salary<br/><br/><strong>Job Description:<br/><br/></strong>Are you looking for a new challenge? Passionate about innovation? Want to work for a global company that values integrity, teamwork, and loyalty?<br/><br/>At <strong>LATICRETE International,</strong> we aim to be the leading construction brand trusted globally for high-performance tile and stone installation systems and building finishing solutions. We’ve been in business for over 65 years, family-owned for three generations, and can be found in over 100 countries. <em>The Hartford Business Journal even named us one of Connecticut’s top family-owned companies in 2017!<br/><br/></em>We don't just make innovative, industry-leading products. Our purpose is to improve the built world and the lives of those who build it. We strive to connect with, engage with and improve the lives of our employees, our customers, our partners, and the global communities in which we operate.<br/><br/>We are seeking passionate and ambitious employees who want to make a difference not just within our organization, but within their communities, our industry, and the world. If that sounds like you, then what are you waiting for? Join the family and expand your horizons!<br/><br/><strong>Just some of our benefits:<br/><br/></strong><ul><li>Medical</li><li>Dental</li><li>Vision</li><li>401k</li><li>Tuition reimbursement</li><li>13 paid holidays, that includes 1 week of paid plant shutdown between the Christmas and New Year's Day holidays</li><li>Paid vacation and sick time</li><li>Flexible spending</li><li>Life Insurance, AD&amp;D and Supplemental Insurance<br/><br/><br/></li></ul><strong>Position Summary<br/><br/></strong>This role is responsible for transportation and logistics analytics, seeking out accurate data sources, building analyses from scratch, and telling compelling stories of how Laticrete can improve its logistics operations with data. The Logistics Analyst will work closely with the logistics team, finance, procurement, and business stakeholders to build analysis on transportation spend management and areas of opportunity across Laticrete’s plant locations.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>Additional duties and responsibilities may be assigned as necessary.<br/><br/><strong>Data Analysis: (25%)<br/><br/></strong><ul><li>Collect, analyze, and report transportation and logistics data from various sources such as JDE, Manhattan, and the freight audit company.</li><li>Utilize data visualization tools and analytics software Power BI to extract meaningful insights from large data sets.</li><li>Responsible for developing, maintaining, and growing routine reporting on transportation performance. Report breakdowns could be ad hoc, weekly, monthly, quarterly, or annually.</li><li>Gather feedstock market intelligence around the following areas: Diesel Fuel, LTL, Truckload, Rail, Bulk, International Air, International Ocean, and Intermodal in preparation for carrier business reviews.</li><li>Analyze and summarize carrier RFP results.<br/><br/><br/></li></ul><strong>Performance Metrics: (20%)<br/><br/></strong><ul><li>Develop and maintain key performance indicators to measure the performance of logistics operations and carrier performance. Carrier performance would include On-Time Pickup, On-Time Delivery, Invoice Accuracy, Claims Ratio, and Transit Days from suppliers or interplant transfers.</li><li>Analyze critical drivers of logistics performance and identify prioritized actions.</li><li>Establish baselines and targets, measure results, and identify opportunities for improvement.</li><li>Measure plant and vendor performance for optimal carrier spend usage.</li><li>Maintain master inbound raw bulk material freight cost per pound baseline.<br/><br/><br/></li></ul><strong>Forecasting: (5%)<br/><br/></strong><ul><li>Use historical data and forecasting techniques to predict future spending.</li><li>Create an annual transportation freight spending budget.</li><li>Determine freight spending impact on savings projects, fuel, and carrier inflation.<br/><br/><br/></li></ul><strong>Process Improvement: (20%)<br/><br/></strong><ul><li>Create ways to automate tasks such as claim management, freight quotes, etc.</li><li>Propose and implement process improvements to enhance the overall efficiency of the logistics group and reduce costs. Evaluate and validate the project pipeline.</li><li>Assist in evaluating new supply chain management software to enhance data collection, analysis, and reporting.<br/><br/><br/></li></ul><strong>Functional Backup for Logistic Specialists. (30%)<br/><br/></strong><ul><li>TMS – Create and maintain best practices for scheduling in TMS.</li><li>Enter new truckload lane quotes into TMS.</li><li>Assist in carrier invoice and aging issues.</li><li>Carrier Claims – mitigate any loss based on carrier damage or shortage.</li><li>Update and maintain logistics SOPs.</li><li>Maintain KPIs for carrier performance.<br/><br/><br/></li></ul><strong>Required Skills &amp; Qualifications<br/><br/></strong><em>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements below represent knowledge, skill, and ability. Reasonable accommodation may be made to enable individuals with disabilities to perform essential functions. <br/><br/></em><strong>Education and Experience:<br/><br/></strong><ul><li> High School Diploma required.</li><li> Bachelor’s degree in supply chain management, Business, or equivalent work experience.<br/><br/><br/></li></ul><strong>Specialized Skills and Experience</strong>:<br/><br/><ul><li> At least two years of logistics, supply chain, or finance analysis</li><li> Proven experience in data analysis, preferably within a logistics or supply chain context</li><li> Previous experience with JD Edwards, Microsoft Excel, and Power BI.</li><li> Strong understanding of logistics and supply chain operations</li><li> Excellent problem-solving and critical thinking skills</li><li> Project management experience is a plus.</li><li> Demonstrated ability to work on multiple projects simultaneously, set timelines, and independently prioritize workload.</li><li> Ability to work closely with cross-functional teams.<br/><br/><br/></li></ul><strong>Travel Requirement: </strong>10%<br/><br/><strong>Physical Requirements: <br/><br/></strong><ul><li> Lift: Must be able to lift and carry 25 pounds.</li><li> Push/Pull: Must be able to push/pull 25 pounds.</li><li> Standing: Must be able to stand 50% of the day.</li><li> Sitting: Must be able to sit 75% of the day.</li></ul>", "responsibilities": "This role is responsible for transportation and logistics analytics, seeking out accurate data sources, building analyses from scratch, and telling compelling stories of how Laticrete can improve its logistics operations with data. The Logistics Analyst will work closely with the logistics team, finance, procurement, and business stakeholders to build analysis on transportation spend management and areas of opportunity across Laticrete’s plant locations.", "qualifications": {"required": "High School Diploma required.\nBachelor’s degree in supply chain management, Business, or equivalent work experience.\nAt least two years of logistics, supply chain, or finance analysis\nProven experience in data analysis, preferably within a logistics or supply chain context\nPrevious experience with JD Edwards, Microsoft Excel, and Power BI.\nStrong understanding of logistics and supply chain operations\nExcellent problem-solving and critical thinking skills\nProject management experience is a plus.\nDemonstrated ability to work on multiple projects simultaneously, set timelines, and independently prioritize workload.\nAbility to work closely with cross-functional teams."}, "skills": ["JD Edwards", "Microsoft Excel", "Power BI", "Data Analysis", "Logistics", "Supply Chain", "Project Management"], "postedDate": "2 weeks ago", "benefits": "Medical\nDental\nVision\n401k\nTuition reimbursement\n13 paid holidays, that includes 1 week of paid plant shutdown between the Christmas and New Year's Day holidays\nPaid vacation and sick time\nFlexible spending\nLife Insurance, AD&D and Supplemental Insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3988715194"}