{"jobTitle": "Data Analytics Engineer", "company": {"name": "Starr Insurance", "location": "Destin, FL"}, "location": "Destin, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Insurance, Financial Services, and Business Consulting and Services", "description": "<em>Starr Insurance Companies is a leading insurance and investment organization, providing commercial property and casualty insurance, including travel and accident coverage, to almost every imaginable business and industry in virtually every part of the world.<br/><br/>Cornelius Vander Starr established his first insurance company in Shanghai, China in 1919. Today, we are one of the world’s fastest growing insurance organizations, capable of writing in 128 countries on 6 continents.<br/><br/></em>Starr’s Information Security Team is seeking a qualified and experienced candidate to fill the newly created role of Data Analytics Engineer. The candidate will work within the IT Security team to ensure the development and efficient operation of Starr’s data lake environments. This role involves designing, implementing, and managing scalable data storage solutions, optimizing data flows, and ensuring high-quality data ingestion and processing. The Data Analytics Engineer will also play a crucial role in developing and maintaining data models, ensuring access and security controls as well as scalable and reliable data repositories.<br/><br/>Responsibilities:<br/><br/><ul><li>Build and deploys data repositories, recommends architecture and ensure the scalability and security of solutions</li><li>Develops, solicits feedback and communicates metadata management practices</li><li>Integrate datasets across disparate sources (on prem, various cloud environments and systems), transform and model raw inputs into a form suitable for analysis</li><li>Generate reports from multiple databases/data sets merging into spreadsheets and/or database</li><li>Analyze, interpret, format, and document data sets, procedures for maintaining</li><li>Automating data ingestion and integration processes</li><li>Testing data repositories to ensure retention and security</li><li>Monitoring performance and tuning query executions</li><li>Collaborating with stakeholders, reviewing application to understand data needs<br/><br/></li></ul>Qualifications and Desired Skills (2+ years’ experience with the following):<br/><br/><ul><li>Experience of working with statistical models for summarization and inference</li><li>Experience with managing and securing large data repositories, including on prem and cloud-based environments</li><li>SQL Relational Database Management</li><li>Scripting and programming experience</li><li>BI Reporting and dashboards in PowerBI, similar/equivalent tools sets</li><li>Experience with Devops</li><li>Generally knowledgeable of current and emerging cyber security threats, common counter measures for the monitoring and protection of data repositories<br/><br/></li></ul>Starr is an equal opportunity employer, which means we'll consider all suitably qualified applicants regardless of gender identity or expression, ethnic origin, nationality, religion or beliefs, age, sexual orientation, disability status or any other protected characteristic. We recruit and develop our people based on merit and we're committed to creating an inclusive environment for all employees. We offer first class training and development opportunities to all employees. Our aim is to grow our own talent and bring out the best in people.<br/><br/>", "responsibilities": "Build and deploys data repositories, recommends architecture and ensure the scalability and security of solutions\nDevelops, solicits feedback and communicates metadata management practices\nIntegrate datasets across disparate sources (on prem, various cloud environments and systems), transform and model raw inputs into a form suitable for analysis\nGenerate reports from multiple databases/data sets merging into spreadsheets and/or database\nAnalyze, interpret, format, and document data sets, procedures for maintaining\nAutomating data ingestion and integration processes\nTesting data repositories to ensure retention and security\nMonitoring performance and tuning query executions\nCollaborating with stakeholders, reviewing application to understand data needs", "qualifications": {"required": "Experience of working with statistical models for summarization and inference\nExperience with managing and securing large data repositories, including on prem and cloud-based environments\nSQL Relational Database Management\nScripting and programming experience\nBI Reporting and dashboards in PowerBI, similar/equivalent tools sets\nExperience with Devops\nGenerally knowledgeable of current and emerging cyber security threats, common counter measures for the monitoring and protection of data repositories"}, "skills": ["Statistical Models", "Data Repositories", "SQL", "Scripting", "Programming", "BI Reporting", "PowerBI", "Devops", "Cyber Security"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989250752"}