{"jobTitle": "SIGINT Analyst", "company": {"name": "Leidos", "location": "Fort Walton Beach, FL"}, "location": "Fort Walton Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "87,100.00 - 157,450.00", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "IT Services and IT Consulting", "description": "Through training, teamwork, and exposure to challenging technical work, let Leidos show you how to unleash your potential.<br/><br/>Leidos is seeking an Intelligent professions for a Mid Level SIGINT Analyst position at Hurlburt Field Florida .<br/><br/>The Signals Analyst will assist the 361 ISRG with evaluation of special signals systems and software to support 361 ISRG/TD with systems and software test and evaluation (T&amp;E) and allow 361 ISRG/DO to leverage their expertise for implementation of systems and software training, tactics, techniques and procedures (TTP) and processing exploitation and dissemination (PED) development.<br/><br/><strong>Responsibilities And Duties<br/><br/></strong><ul><li>Serve as a SIGINT Analyst in support of the 361 ISRG.</li><li>Perform analysis and prepare documentation in connection with radar, instrumentation, electronic counter-measurers (ECM), and communication signals/SIGINT</li><li>Provide analytical and operational support for unique tactical and strategic mission intelligence systems.</li><li>Must have a working knowledge of Collection Management principles to task National level assets in support of global and regional operations</li><li>Support a range of analytical products and functions including operational scenarios, development of deployment scenarios, site assessments, and vulnerability assessments.</li><li>Analyze complex system integration requirements to identify mission vulnerability targets and develop multiple scenarios to resolve all mission threats.</li><li>Perform test planning and projections to anticipate future resource requirements to counter identified threats.</li><li>Develop documentation to support objectives in support of external agencies.</li><li>Translate analytical/test results into effective briefings.</li><li>Analyze operational availability of strategic and tactical intelligence assets.</li><li>Develop briefing reports that depict clear assessment of systems availability.</li><li>Maintain a skillful status on assigned tactical and strategic systems.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>A Bachelors Degree and 10 + years of related experience . Additional experience may be considered in lieu of degree .</li><li>A demonstrated National and Tactical Level SIGINT capabilities and experience</li><li>Current TS/SCI security clearance with a current polygraph is required.</li><li>Strong written and oral communications skills.</li><li>Ability to work independently and solve complex problems on the fly.</li><li>Must have a working knowledge of Collection Management principles to task National level assets in support of global and regional operations</li><li>Air Force SIGINT experience is highly desired.<br/><br/></li></ul><strong>Original Posting Date<br/><br/></strong>2024-07-31<br/><br/>While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.<br/><br/><strong>Pay Range<br/><br/></strong>Pay Range $87,100.00 - $157,450.00<br/><br/>The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.", "responsibilities": "The Signals Analyst will assist the 361 ISRG with evaluation of special signals systems and software to support 361 ISRG/TD with systems and software test and evaluation (T&amp;E) and allow 361 ISRG/DO to leverage their expertise for implementation of systems and software training, tactics, techniques and procedures (TTP) and processing exploitation and dissemination (PED) development.", "qualifications": {"required": "A Bachelors Degree and 10 + years of related experience . Additional experience may be considered in lieu of degree .<br/>A demonstrated National and Tactical Level SIGINT capabilities and experience<br/>Current TS/SCI security clearance with a current polygraph is required.<br/>Strong written and oral communications skills.<br/>Ability to work independently and solve complex problems on the fly.<br/>Must have a working knowledge of Collection Management principles to task National level assets in support of global and regional operations<br/>Air Force SIGINT experience is highly desired."}, "skills": ["SIGINT", "Radar", "Instrumentation", "Electronic Counter-Measures", "Communication Signals", "Collection Management", "Air Force SIGINT"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989245536"}