{"jobTitle": "Product Manager", "company": {"name": "Montash", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Product Management", "industry": "Software Development and Financial Services", "description": "<strong>Product Manager ⚡</strong>\n<p><strong>FinTech start-up (Series B) 🚀</strong></p>\n<p><strong>United States (remote) 🌎</strong></p>\n<p><strong>$130-160k USD + equity💰</strong></p>\n<p><br/></p>\n<p>This exciting FinTech start-up that has recently secured its Series B funding round is looking for a <strong>Product Manager</strong>. Their primary role will be to work on customer facing features, with a focus on growth and acquisition. Given the company's growth trajectory, this is a very exciting opportunity to join a growing team in the Payments space.</p>\n<p><br/></p>\n<p><strong>Responsibilities</strong></p>\n<ul><li>Develop and execute a comprehensive growth strategy that aligns with company goals and objectives.</li><li>Identify key metrics and KPIs to measure growth and engagement success, and regularly report on performance.</li><li>Conduct market research and competitive analysis to inform product decisions and identify new opportunities for user acquisition and engagement.</li><li>Collaborate with Marketing and Data Science teams to design and implement experiments, A/B tests, and campaigns to drive user growth and retention.</li><li>Work with Engineering and Design teams to prioritize and build features that enhance user experience and promote engagement.</li><li>Utilize data-driven insights to continuously iterate and improve the product, ensuring a seamless and engaging user journey.</li><li>Develop and maintain a product roadmap that focuses on growth and engagement initiatives, balancing short-term wins with long-term strategic goals.</li><li>Foster a user-centric culture within the product team, advocating for the needs and preferences of our users in all product decisions.</li><li>Stay current with industry trends, best practices, and emerging technologies to keep our product competitive and innovative.</li></ul>\n<p><br/></p>\n<p><strong>Qualifications</strong></p>\n<ul><li>3+ years of experience in high-performing product teams.</li><li>Experience in FinTech / payments start-up environment is highly desired </li><li>Proven experience working with operations teams, product designers, other product managers, and engineering teams.</li><li>A forward-thinking vision with a humble approach.</li><li>Strong skills in data analysis and the use of analytical tools.</li><li>High technical aptitude and a keen interest in state-of-the-art ML/AI technologies.</li></ul><p></p>", "responsibilities": "Develop and execute a comprehensive growth strategy that aligns with company goals and objectives. Identify key metrics and KPIs to measure growth and engagement success, and regularly report on performance. Conduct market research and competitive analysis to inform product decisions and identify new opportunities for user acquisition and engagement. Collaborate with Marketing and Data Science teams to design and implement experiments, A/B tests, and campaigns to drive user growth and retention. Work with Engineering and Design teams to prioritize and build features that enhance user experience and promote engagement. Utilize data-driven insights to continuously iterate and improve the product, ensuring a seamless and engaging user journey. Develop and maintain a product roadmap that focuses on growth and engagement initiatives, balancing short-term wins with long-term strategic goals. Foster a user-centric culture within the product team, advocating for the needs and preferences of our users in all product decisions. Stay current with industry trends, best practices, and emerging technologies to keep our product competitive and innovative.", "qualifications": {"required": "3+ years of experience in high-performing product teams. Experience in FinTech / payments start-up environment is highly desired Proven experience working with operations teams, product designers, other product managers, and engineering teams. A forward-thinking vision with a humble approach. Strong skills in data analysis and the use of analytical tools. High technical aptitude and a keen interest in state-of-the-art ML/AI technologies."}, "skills": ["FinTech", "Payments", "Product Management", "Growth Strategy", "User Acquisition", "Data Analysis", "Market Research", "A/B Testing", "Product Roadmap", "User Experience", "ML/AI"], "postedDate": "2 weeks ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3989853737"}