{"jobTitle": "Senior Marketing Manager, Community", "company": {"name": "Cloudflare", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing", "industry": "IT Services and IT Consulting, Technology, Information and Internet, and Computer and Network Security", "description": "About Us\n\nAt Cloudflare, we are on a mission to help build a better Internet. Today the company runs one of the world’s largest networks that powers millions of websites and other Internet properties for customers ranging from individual bloggers to SMBs to Fortune 500 companies. Cloudflare protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code. Internet properties powered by Cloudflare all have web traffic routed through its intelligent global network, which gets smarter with every request. As a result, they see significant improvement in performance and a decrease in spam and other attacks. Cloudflare was named to Entrepreneur Magazine’s Top Company Cultures list and ranked among the World’s Most Innovative Companies by Fast Company.\n\nWe realize people do not fit into neat boxes. We are looking for curious and empathetic individuals who are committed to developing themselves and learning new skills, and we are ready to help you do that. We cannot complete our mission without building a diverse and inclusive team. We hire the best people based on an evaluation of their potential and support them throughout their time at Cloudflare. Come join us!\n\nAvailable Locations - San Francisco and or Austin, TX area\n\nAbout the Role:\n\nOur customers are such an important part of who we are as a company. We are looking to take that to another level by expanding on our existing Community to a global, end-to-end scalable program where customers can build trusted relationships amongst each other, get expert recommendations for services and products, give valuable insights to the company, and get burning questions answered. We are looking for a rock star to join our Marketing Team to lead this Community effort to focus on growing and engaging the community, developing community programs, measuring the success of the community, and more! We're looking for a natural leader to join us on this amazing community journey.\n\nWhat You’ll Do:\n\n* Build and execute on the community strategy, roadmap, and success metrics.\n* Work with the Content and Product teams to develop all new integrated community content strategy. Manage and execute on that strategy.\n* Work cross functionally on community engagement strategies\n* Moderate, listen and engage regularly with our amazing community members, providing them with any support and resources they need. \n* Constantly gather feedback from the community and bring those insights to the appropriate internal teams.\n* Identify opportunities to surprise, delight, and show our community members how much we appreciate them.\n* Facilitate an inviting, helpful, and honest community culture that represents the best of Cloudflare.\n* Help plan and run community events throughout the year.\n* Measure, analyze, and track community data, providing regular reporting throughout the company and influence to key priorities. \n* Manage all internal and external community documentation.\n* Create community onboarding and offboarding processes.\n* Escalate and flag issues as needed to keep the community a trusted space.\n\n\nWhat We’re Looking For:\n\n* 3-5+ years in Community Management with experience scaling Community Programs and 7-8+ years relevant work experience\n* A strong communicator and writer. Being successful in this role will require you to excel at both internal and external communication.\n* Passion about being a community and customer advocate. You understand why customer voices are so important.\n* Flexibility to adapt quickly when priorities change.\n* Solid understanding of cross departmental functions including Marketing, Technology and Product.\n* An incredibly organized master multitasker.\n* Expertise working with various online community platforms and tools.\n* Experience working in a fast-paced startup-like environment\n* Someone who knows how to set goals, prioritize, and maintain focus when it comes to deadlines.\n* Fantastic interpersonal skills, a great listener, and is extraordinarily empathetic.\n* Willingness to go the extra mile to serve our customers.\n* Good technical understanding and can pick up new tools quickly.\n\n\nYou are a REALLY great fit for this role if you also: \n\n* Have additional experience in any of the following: Project Management, Customer Success, Customer Support, or Event Planning.\n* Experience working with a consumer product community.\n* Have experience working with external vendors (software, swag), setting up SOWs, and submitting POs.\n* Are comfortable using project management software, customer support software, and collaboration software.\n* Have experience creating/pulling reports and working with various forms of data.\n\n\nWhat Makes Cloudflare Special?\n\nWe’re not just a highly ambitious, large-scale technology company. We’re a highly ambitious, large-scale technology company with a soul. Fundamental to our mission to help build a better Internet is protecting the free and open Internet.\n\nProject Galileo: We equip politically and artistically important organizations and journalists with powerful tools to defend themselves against attacks that would otherwise censor their work, technology already used by Cloudflare’s enterprise customers--at no cost.\n\nAthenian Project: We created Athenian Project to ensure that state and local governments have the highest level of protection and reliability for free, so that their constituents have access to election information and voter registration.\n\n1.1.1.1: We released 1.1.1.1 to help fix the foundation of the Internet by building a faster, more secure and privacy-centric public DNS resolver. This is available publicly for everyone to use - it is the first consumer-focused service Cloudflare has ever released. Here’s the deal - we don’t store client IP addresses never, ever. We will continue to abide by our privacy commitment and ensure that no user data is sold to advertisers or used to target consumers.\n\nSound like something you’d like to be a part of? We’d love to hear from you!\n\nThis position may require access to information protected under U.S. export control laws, including the U.S. Export Administration Regulations. Please note that any offer of employment may be conditioned on your authorization to receive software or technology controlled under these U.S. export laws without sponsorship for an export license.\n\nCloudflare is proud to be an equal opportunity employer. We are committed to providing equal employment opportunity for all people and place great value in both diversity and inclusiveness. All qualified applicants will be considered for employment without regard to their, or any other person's, perceived or actual race, color, religion, sex, gender, gender identity, gender expression, sexual orientation, national origin, ancestry, citizenship, age, physical or mental disability, medical condition, family care status, or any other basis protected by law. We are an AA/Veterans/Disabled Employer.\n\nCloudflare provides reasonable accommodations to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job. Examples of reasonable accommodations include, but are not limited to, changing the application process, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment. If you require a reasonable accommodation to apply for a job, please contact us via e-mail at hr@cloudflare.com or via mail at 101 Townsend St. San Francisco, CA 94107.", "responsibilities": "Build and execute on the community strategy, roadmap, and success metrics.\nWork with the Content and Product teams to develop all new integrated community content strategy. Manage and execute on that strategy.\nWork cross functionally on community engagement strategies\nModerate, listen and engage regularly with our amazing community members, providing them with any support and resources they need. \nConstantly gather feedback from the community and bring those insights to the appropriate internal teams.\nIdentify opportunities to surprise, delight, and show our community members how much we appreciate them.\nFacilitate an inviting, helpful, and honest community culture that represents the best of Cloudflare.\nHelp plan and run community events throughout the year.\nMeasure, analyze, and track community data, providing regular reporting throughout the company and influence to key priorities. \nManage all internal and external community documentation.\nCreate community onboarding and offboarding processes.\nEscalate and flag issues as needed to keep the community a trusted space.", "qualifications": {"required": "3-5+ years in Community Management with experience scaling Community Programs and 7-8+ years relevant work experience\nA strong communicator and writer. Being successful in this role will require you to excel at both internal and external communication.\nPassion about being a community and customer advocate. You understand why customer voices are so important.\nFlexibility to adapt quickly when priorities change.\nSolid understanding of cross departmental functions including Marketing, Technology and Product.\nAn incredibly organized master multitasker.\nExpertise working with various online community platforms and tools.\nExperience working in a fast-paced startup-like environment\nSomeone who knows how to set goals, prioritize, and maintain focus when it comes to deadlines.\nFantastic interpersonal skills, a great listener, and is extraordinarily empathetic.\nWillingness to go the extra mile to serve our customers.\nGood technical understanding and can pick up new tools quickly.", "preferred": "Have additional experience in any of the following: Project Management, Customer Success, Customer Support, or Event Planning.\nExperience working with a consumer product community.\nHave experience working with external vendors (software, swag), setting up SOWs, and submitting POs.\nAre comfortable using project management software, customer support software, and collaboration software.\nHave experience creating/pulling reports and working with various forms of data."}, "skills": ["Community Management", "Content Strategy", "Community Engagement", "Customer Advocacy", "Cross-Functional Collaboration", "Online Community Platforms", "Startup Environment", "Project Management", "Customer Success", "Customer Support", "Event Planning", "Vendor Management", "Project Management Software", "Customer Support Software", "Collaboration Software", "Data Analysis", "Reporting"], "postedDate": "2 weeks ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3989278933"}