{"jobTitle": "Associate Account Executive, Client Leadership", "company": {"name": "Dentsu Creative", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "45,000 - 72,450", "currency": "USD"}, "jobFunction": "Other", "industry": "Advertising Services", "description": "Dentsu Creative US is comprised of audacious thinkers and award-winning collaborators across the United States who blend local knowledge with global expertise. Choosing substance over stunts, our Modern Creative mandate is about unlocking sustained growth and holistic impact for brands in ways that Create Culture, Change Society and Invent the Future. Our borderless approach allows us to assemble great talent around each brief, tapping into the expertise of the 9,000+ people across dentsu's global creative network. This integrated model also allows our talent to learn about and explore the breadth of career possibilities within Dentsu Creative.<br/><br/>We are looking for an Associate Account Executive to join our team. You will manage the efficient management of the account by completing tasks such as taking meeting notes, scheduling meetings, updating status reports and timelines, and managing account finances.<br/><br/>You will also:<br/><br/><ul><li>Partner with the Project Manager to ensure all the administrative tasks of the account are completed and maintain our high Dentsu standards. </li><li>Update the asset tracker, master budget tracker and internal/client decks and status docs such as the daily hot sheet and weekly status documents. </li><li>Be a liaison between clients, our teams, media partners, and other agencies. </li><li>Hold an understanding of client's business and goals as well as competitors in space. </li><li>Manage all client tools such as their legal approval system and asset management. </li><li>Management of trafficking paid social assets. </li><li>Manage daily client communications, including fielding requests, communicating feedback and sharing proactive updates. </li><li>Creatively develop solutions to resolve problems. </li><li>Report to an Account Supervisor. <br/><br/></li></ul>Must be located within commutable distance to NYC and open to going into the office.<br/><br/>You have: <br/><br/><ul><li>Education or experience within a relevant field such as Marketing, Advertising, Communications or Business. </li><li>Internship(s) completed at a communications agency. </li><li>Demonstrated history of establishing working relationships across diverse team</li><li>Demonstrated understanding of agency process, department functions and workflow<br/><br/></li></ul>The anticipated base salary range for this position is $45,000 - $72,450. Salary is based on a range of factors that include relevant experience, knowledge, skills, other job-related qualifications, and geography. Additionally, this position is eligible for discretionary incentive compensation. The company's incentive compensation plan is subject to change. A range of medical, dental, vision, 401(k) matching, paid time off, and other benefits also are available. For more information about dentsu benefits, please visit dentsubenefitsplus.com<br/><br/>Dentsu is an integrated growth and transformation partner to the world’s leading organizations. Founded in 1901 in Tokyo, Japan, and now present in more than 110 markets, it has a proven track record of nurturing and developing innovations, combining the talents of its global network of leadership brands to develop impactful and integrated growth solutions for clients. Dentsu delivers end-to-end experience transformation (EX) by integrating its services across Media, CXM and Creative, while its business transformation (BX) mindset pushes the boundaries of transformation and sustainable growth for brands, people and society.<br/><br/>Dentsu, Innovating to Impact.<br/><br/>Find out more:<br/><br/>https://www.dentsu.com/<br/><br/>https://www.group.dentsu.com/en/<br/><br/>We are champions for meaningful progress and we strive to be a force for good—for our people, for our clients, for the industry and for our society. We keep our people at the center, creating space for growth, understanding and learning so they can thrive. We embed diversity, in our mindset, in our solutions and in our teams to empower an inclusive, equitable and culturally fluent environment. Building this culture within our teams makes us better collaborators with each other and with our clients, driving better outcomes for all.<br/><br/>Dentsu (the \"Company\") is committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee of the Company, on the basis of age, sex, sexual orientation, race, color, creed, religion, ethnicity, national origin, alienage or citizenship, disability, marital status, veteran or military status, genetic information, or any other legally-recognized protected basis under federal, state or local laws, regulations or ordinances. Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and/or certain state or local laws. A reasonable accommodation is a change in the way things are normally done that will ensure an equal employment opportunity without imposing an undue hardship on the Company. Please contact your recruiter if you need assistance completing any forms or to otherwise participate in the application process or to request or discuss an accommodation in connection with a job at the Company to which you are applying.", "responsibilities": "You will manage the efficient management of the account by completing tasks such as taking meeting notes, scheduling meetings, updating status reports and timelines, and managing account finances.<br/><br/>You will also:<br/><br/><ul><li>Partner with the Project Manager to ensure all the administrative tasks of the account are completed and maintain our high Dentsu standards. </li><li>Update the asset tracker, master budget tracker and internal/client decks and status docs such as the daily hot sheet and weekly status documents. </li><li>Be a liaison between clients, our teams, media partners, and other agencies. </li><li>Hold an understanding of client's business and goals as well as competitors in space. </li><li>Manage all client tools such as their legal approval system and asset management. </li><li>Management of trafficking paid social assets. </li><li>Manage daily client communications, including fielding requests, communicating feedback and sharing proactive updates. </li><li>Creatively develop solutions to resolve problems. </li><li>Report to an Account Supervisor. <br/><br/></li></ul>", "qualifications": {"required": "Education or experience within a relevant field such as Marketing, Advertising, Communications or Business. Internship(s) completed at a communications agency. Demonstrated history of establishing working relationships across diverse team Demonstrated understanding of agency process, department functions and workflow", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "The anticipated base salary range for this position is $45,000 - $72,450. Salary is based on a range of factors that include relevant experience, knowledge, skills, other job-related qualifications, and geography. Additionally, this position is eligible for discretionary incentive compensation. The company's incentive compensation plan is subject to change. A range of medical, dental, vision, 401(k) matching, paid time off, and other benefits also are available. For more information about dentsu benefits, please visit dentsubenefitsplus.com", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990923704"}