{"jobTitle": "Senior Manager, Digital & Channel Marketing", "company": {"name": "Whole Foods Market", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "As we continue to grow and innovate, we are seeking a Senior Team Leader (Senior Manager), Onsite Marketing and SEO to shape the future of our digital strategy and accelerate our growth. Digital is a key growth focus area for Whole Foods Market; we’re investing heavily in evolving direct-to-consumer channels, launching new E-Commerce concepts, and enhancing store shopping through digital interfaces. You’ll be a key partner to the business, product, technology, and design teams in advancing towards that future. Additionally, you’ll help shape the future of the website and SEO marketing function at Whole Foods Market, as we seek to evolve our tools, ways of working, and skillset. The ideal candidate is a self-initiated leader and change agent, has an intuitive understanding of digital and omni-channel customer needs, and is excited about the opportunity to transform an organization towards accelerated growth. This leader will be both a subject matter expert in omnichannel marketing, an effective coach of direct reports, and strong collaborator with cross-functional partners. Lastly, we're seeking an individual with the eagerness to teach and the humility to learn from others.<br/><br/><strong>This hybrid position is based in Austin, TX</strong> and will require a minimum of three days per week in our downtown office.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Provides leadership and guidance for Digital &amp; Channel Marketing teams, Team Leaders, and Team Members in the planning, execution and optimization of innovative marketing initiatives to drive traffic, revenue, and conversion. The successful candidate will be both a subject matter expert and an effective coach to direct reports. </li><li>Influence cross functional partners as a collaborator who seeks win-win solutions and strategies. Collaborates with internal and external teams to execute onsite marketing, SEO, landing pages, and other digital marketing from concept to development.</li><li>Develops targeting strategies that will improve marketing and merchandising performance. Develops, executes, and analyzes creative test plans for marketing channels. </li><li>Leads digital / e-commerce process, program, and technology improvement initiatives, from participating in vendor evaluation through implementation, adoption, and ultimate success.</li><li>Forms online content partnerships, measures email / web / mobile and related online usage and trends and manages vendor relationships. </li><li>Owns the design, development, and maintenance of ongoing marketing and traffic metrics, reports, analyses, dashboards, etc. to drive key business decisions. </li><li>Supports efforts of internal, external, and cross-functional technology teams to troubleshoot, estimate, and coordinate system fixes, enhancements, and maintenance. </li><li>Works closely with Product and IT on technological / platform development, roadmap planning, testing, management, and enhancement. <br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Proven ability to lead, earn trust, and inspire a team of direct reports. </li><li>Able to impart focus by developing clear goals and priorities.</li><li>Proven ability to build cross-functional partnerships and inspire collaboration and action in the absence of a ‘direct report’ relationship. </li><li>Ability to juggle multiple projects while maintaining a clear sense of priorities. </li><li>Consults with business leaders on functional and operational processes, challenges, and related issues and trends - and on project plans designed to improve outreach and effectiveness. </li><li>Engages with business leaders to identify gaps in messaging consistency, formulate resolution strategies, and ensure a consistent and positive approach going forward. </li><li>Proven ability to craft actionable, creative, and data-driven strategies. </li><li>Recommends strategic / business adjustments based on program effectiveness, customer feedback, anticipated direction, and identified challenges and trends. </li><li>Leads detailed task / project planning, including cost, schedule, and resource requirements. </li><li>Ensures planning incorporates data and information from customer, media, partner, and company perspectives. </li><li>Collaborates with task / project stakeholders to identify, evaluate, and resolve emerging and anticipated issues. </li><li>Leverages data-driven insights to recommend and implement task / project management and delivery methodology continuous improvement. </li><li>Demonstrates clear understanding of WFM’s core business and customer / market / partner interfaces.</li><li>Assesses how products, processes, and operating models impact the company’s business and financial performance. </li><li>Understands how changes in customer expectations, the competition, new business, new markets, and evolving strategies impact the company’s competitive position and long-term prospects. </li><li>Proven success driving adoption of new technology/software across multiple teams preferred. </li><li>Experience with lifecycle and/or personalized marketing preferred. <br/><br/></li></ul><strong>Education &amp; Experience<br/><br/></strong><ul><li>BA/BS degree and 6-8+ years’ relevant experience OR equivalent combination of education and relevant experience.</li><li>2-4+ years’ leadership experience.</li></ul>", "postedDate": "2 weeks ago", "skills": ["Leadership", "Cross-functional Collaboration", "Digital Marketing", "E-commerce", "SEO", "Omnichannel Marketing", "Data Analysis", "Project Management", "Vendor Management", "Technology Adoption", "Lifecycle Marketing", "Personalized Marketing"], "url": "https://www.linkedin.com/jobs/view/3990267645"}