{"jobTitle": "Executive Assistant to the President, Tory Burch Foundation", "company": {"name": "TORY BURCH", "industry": "Retail Apparel and Fashion", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Retail Apparel and Fashion", "description": "<strong>We are</strong> an American luxury lifestyle brand, founded in 2004. Anchored in the casual elegance of American sportswear, Tory’s design philosophy is defined by effortless silhouettes, innovative materials, eclectic juxtapositions of color, and the tension of past and present. The collections include ready-to-wear, handbags, footwear, accessories, jewelry, home and beauty.<br/><br/>Empowering women is the company’s guiding principle, expressed through Tory’s collections and reflected in the company culture as well as the work of the Tory Burch Foundation. Established in 2009, the Foundation provides women entrepreneurs in the United States with capital, education and community.<br/><br/><strong>You are</strong> seeking a work environment where people are encouraged to dream, explore, discover and, as important, laugh together. If you’re prepared to work hard, create impact, and have fun while doing it, we would love to have you join #TeamTory. Apply today!<br/><br/><strong>Life @ToryBurch is Special Because:<br/><br/></strong>When you join us, you’re joining a global, purpose-led company on an exciting growth journey with an amazing culture and great benefits.<br/><br/><ul><li>Our culture is welcoming and inclusive -- everyone is empowered to make a difference.</li><li>We have the best team in the world and believe in paying competitively and rewarding for high performance.</li><li>Your overall well-being is important to us; we offer generous benefits to help you take care of your mental and physical health, create financial security, and achieve wellness in all areas of your life.</li><li>We love seeing our employees wear our beautiful collections. You’ll receive a generous employee discount and access to exclusive sample sales.</li><li>We are invested in your professional growth – you’ll have access to free executive coaching on-demand.</li><li>We believe in the importance of giving back and you’ll have many opportunities to do just that through the Tory Burch Foundation and paid volunteer days.<br/><br/></li></ul><strong>This Role Is Tailor-Made For You Because<br/><br/></strong>You will provide administrative and strategic support to the President of the Tory Burch Foundation. You are highly organized and will align the President’s day-to-day time and efforts with the priorities of the Foundation, manage external relationships, and execute special projects to further the Foundation’s mission of empowering women entrepreneurs. You have the ability to work with a high level of discretion and be able to work effectively with stakeholders at all levels.<br/><br/><strong>A Day In The Life<br/><br/></strong>The typical day is… atypical. You might proactively manage day-to-day projects and incoming requests on behalf of the President. You will act as a gatekeeper, managing the President’s communications and serving as a liaison between executive administrative teams internally and externally. You’ll maintain the President’s calendar, prioritizing appointments and work blocks for maximum productivity and impact. Additionally, you’ll manage travel logistics including developing itineraries, booking flights, hotel accommodations and car services. Aside from this, you’ll partner and influence cross-functionally with internal PR and marketing teams, social media manager and speaker’s bureau to ensure dynamic amplification of the Foundation’s mission through the President’s personal brand. You’ll get to work on special projects to include presentation slide content creation, coordination of small events, and data research. Collaborate with stylist and PR team to plan wardrobe for all public appearances to support the President’s role as a brand ambassador. You’ll manage the President’s network of contacts and connections and draft internal and external communications on behalf of the President, along with expense tracking, and ad hoc personal tasks.<br/><br/><strong>To Land This Role<br/><br/></strong><ul><li> Successful track record in supporting a high-level executive</li><li> Orientation toward delighting customers and making people feel valued</li><li> Exceptional interpersonal communication and writing skills</li><li> Strong attention to detail and knowledge of best practice administrative process and systems</li><li> Self-Starter – must manage up, be action oriented and a pro-active problem-solver</li><li> Highly proficient in Microsoft Office and G-Suite</li><li> Experience in live event and meeting software including Teams, Zoom, and WebEx</li><li> High sense of urgency, timeliness and commitment to follow-through</li><li> Highly collaborative team player – no task is too big or too small<br/><br/></li></ul><strong>Why You'll Want To Join Our Team<br/><br/></strong>The Tory Burch Foundation is a nonprofit organization that empowers women and women entrepreneurs in the United States by providing access to capital, education and digital resources. Our mission is reflected in everything we do from our national Fellows program designed to help women entrepreneurs lead, grow and scale their business to our digital education and top-tier online content for small businesses, and partnerships with organizations that provide grants to businesses led by women of color. And through our Embrace Ambition global initiative we create initiatives and events that challenge bias and shatter stereotypes. If you are an entrepreneurial, innovative, creative and resourceful person who wants to make a difference for women, come join us!<br/><br/><strong>How We Work Together<br/><br/></strong><ul><li>Adaptable – We change before we have to</li><li>Entrepreneurial – We own it</li><li>Collaborative – There’s no “I” in Tory</li><li>Client &amp; Brand Focused – We put ourselves in Tory’s shoes</li><li>Live the Values – We show up for each other</li><li>Functional Expertise – We’re constantly learning and growing<br/><br/></li></ul><strong>#TeamTory Values<br/><br/></strong>We show up with honesty &amp; kindness, act with integrity &amp; compassion, work with passion &amp; humility and lead with excellence &amp; humor.<br/><br/><strong>Compensation Range<br/><br/></strong>The compensation range for this position is 55.00 USD - 70.00 USD. Our offer will be based on your relevant experience and work location.<br/><br/><strong>Benefits Information<br/><br/></strong>We offer a generous set of benefits to help you take care of your heath, create financial security, and achieve wellness in all areas of your life. Here are highlights of key benefits available to all Tory Burch members that work over 30 hours.<br/><br/><strong>E<strong>qual Employment Opportunity Statement<br/><br/></strong></strong>Tory Burch LLC is an Equal Employment Opportunity employer and provides equal opportunities to all employees and applicants without regard to an individual’s age, race, creed, color, religion, national origin, sex (including pregnancy) or sexual orientation, gender expression, military status, marital status, genetic predisposition or carrier status, disability or membership in any other protected class under applicable law. Likewise, we will consider qualified applicants with criminal histories for employment in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring, Ordinance No. 184652. Pursuant to the San Francisco Fair Chance Ordinance, we will consider qualified applicants with arrest and conviction records for employment.<br/><br/><strong>Disability Accommodation <br/><br/></strong>Tory Burch is committed to providing reasonable accommodations to applicants and employees with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment. If you require assistance or an accommodation with the hiring process, please contact thetalentteam@toryburch.com.", "responsibilities": "You will provide administrative and strategic support to the President of the Tory Burch Foundation. You are highly organized and will align the President’s day-to-day time and efforts with the priorities of the Foundation, manage external relationships, and execute special projects to further the Foundation’s mission of empowering women entrepreneurs. You have the ability to work with a high level of discretion and be able to work effectively with stakeholders at all levels.", "qualifications": {"required": "Successful track record in supporting a high-level executive, Orientation toward delighting customers and making people feel valued, Exceptional interpersonal communication and writing skills, Strong attention to detail and knowledge of best practice administrative process and systems, Self-Starter – must manage up, be action oriented and a pro-active problem-solver, Highly proficient in Microsoft Office and G-Suite, Experience in live event and meeting software including Teams, Zoom, and WebEx, High sense of urgency, timeliness and commitment to follow-through, Highly collaborative team player – no task is too big or too small"}, "skills": ["Microsoft Office", "G-Suite", "Teams", "Zoom", "WebEx"], "postedDate": "2 weeks ago", "benefits": "We offer a generous set of benefits to help you take care of your heath, create financial security, and achieve wellness in all areas of your life. Here are highlights of key benefits available to all Tory Burch members that work over 30 hours.", "remoteWork": "No", "salary": {"amount": "55.00 USD - 70.00 USD", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3990453508"}