{"jobTitle": "Product Marketing Manager, Solutions", "company": {"name": "Jasper", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "130,000.00/yr - 165,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Software Development", "description": "Jasper is an AI copilot for marketing teams that want better outcomes in addition to faster outputs. Jasper securely trains on your brand and strategy, accelerates content and campaign production, and helps marketers measure and optimize for performance all as part of an end-to-end copilot. Jasper has been recognized as \"one of the Top 15 Most Innovative AI Companies of 2024\" by Fast Company and was one of the fastest companies to reach 100M+ users. Customers include Morningstar, Anthropologie, SentinelOne, ZoomInfo, and more.<br/><br/>Our teams are passionate about supporting new employees and growing a diverse culture of ideas and collaboration. We value being customer-obsessed, ownership, being creative problem solvers, helping one another achieve the best outcomes through collaboration and most importantly making magic. We’re not just building solutions; we’re creating experiences that captivate and amaze us. We strive to deliver moments of wonder and delight that enable our customers to be more effective and creative in ways they never thought possible. Learn more at jasper.ai.<br/><br/><strong>About The Role<br/><br/></strong>As a Product Marketing Manager, Solutions at Jasper, you will be responsible for developing and articulating the point of view and value proposition for the Jasper product across different buyer personas and industries. In this role, you will partner closely with Sales Enablement and GTM teams to develop and deliver solutions-based stories, use cases, content, and tools.<br/><br/>This fully remote role reports to the Director of Product Marketing and is open to candidates located anywhere in the continental US.<br/><br/><strong>What You Will Do At Jasper<br/><br/></strong><ul><li>Partner with GTM and Sales Enablement teams to develop specific marketing solutions for different industries and roles. </li><li>Create prioritized stories and use cases, and communicate them effectively to the business, identifying the best routes-to-market to serve those needs. </li><li>Craft messaging to highlight the value of Jasper's solutions for customers. </li><li>Collaborate, influence, and drive alignment with cross-functional marketing, sales, and product management teams. </li><li>Evangelize key differentiators, demonstrate relevance, and build advocacy. </li><li>Create content, including customer presentations, website content, and collaborate on thought leadership and the creation of marketing plans. </li><li>Work with our Director of Enablement on effective sales materials and training approaches and work with Customer Success to identify and address areas of confusion and opportunities for expansion. </li><li>Contribute to the positioning and creation of product pages, sales enablement materials, and product-related content. Develop creative briefs for our creative team to build out assets for product launches and campaigns. </li><li>Assist with well-researched persona development and evolution, working closely with Product, Engineering, Design, Customer Success, Sales, and Lifecycle Marketing to develop specific and effective segments, and purchase and upgrade paths. </li><li>Be accountable for launch metrics as well as long-term adoption and expansion goals. <br/><br/></li></ul><strong>What You Will Bring To Jasper<br/><br/></strong><ul><li>5-7 years of work experience in Product Marketing for tech/software products, preferably B2B. </li><li>You have strong analytical skills; you excel at synthesizing market, competitive, and customer insights into clear takeaways and recommendations. </li><li>Skills in building launch projections, measuring impact, and a general understanding of product-related data analysis. </li><li>Experience working with product-led growth and Sales closed pipelines. </li><li>Great project management skills including strong communication around project timelines, responsible individuals, and status. </li><li>Experience working with both paid and freemium models is a plus. <br/><br/></li></ul><strong>Compensation Range<br/><br/></strong>At Jasper, we believe in pay transparency and are committed to providing our employees and candidates with access to information about our compensation practices. The expected base salary range offered for this role is $130,000-$165,000. Compensation may vary based on relevant experience, skills, competencies, and certifications.<br/><br/><strong>Benefits &amp; Perks<br/><br/></strong><ul><li>Comprehensive Health, Dental, and Vision coverage beginning on the first day for employees and their families</li><li>401(k) program with up to 2% company matching</li><li>Flexible PTO with a FlexExperience budget ($900 annually) to help you make the most of your time away from work</li><li>FlexWellness program ($1,800 annually) to help support your personal health goals</li><li>Generous budget for home office set up </li><li>$1,500 annual learning and development stipend </li><li>16 weeks of paid parental leave<br/><br/></li></ul>Our goal is to be a diverse workforce that is representative at all job levels as we know the more inclusive we are, the better our product will be. We are committed to celebrating and supporting our differences and that diversity is essential to innovation and makes us better able to serve our customers. We hire people of all levels and backgrounds who are excited to learn and develop their skills.<br/><br/>We are an equal opportunity employer. Applicants will not be discriminated against because of race, color, creed, sex, sexual orientation, gender identity or expression, age, religion, national origin, citizenship status, disability, ancestry, marital status, veteran status, medical condition, or any protected category prohibited by local, state or federal laws.<br/><br/><em>By submitting this application, you acknowledge that you have reviewed and agree to Jasper's CCPA Notice to Candidates, available at </em><em>legal.jasper.ai/#ccpa</em><em>.<br/><br/></em>", "responsibilities": "As a Product Marketing Manager, Solutions at Jasper, you will be responsible for developing and articulating the point of view and value proposition for the Jasper product across different buyer personas and industries. In this role, you will partner closely with Sales Enablement and GTM teams to develop and deliver solutions-based stories, use cases, content, and tools.", "qualifications": {"required": "5-7 years of work experience in Product Marketing for tech/software products, preferably B2B. You have strong analytical skills; you excel at synthesizing market, competitive, and customer insights into clear takeaways and recommendations. Skills in building launch projections, measuring impact, and a general understanding of product-related data analysis. Experience working with product-led growth and Sales closed pipelines. Great project management skills including strong communication around project timelines, responsible individuals, and status. Experience working with both paid and freemium models is a plus.", "preferred": ""}, "skills": ["Product Marketing", "Tech/Software Products", "B2B", "Analytical Skills", "Market Research", "Competitive Analysis", "Customer Insights", "Launch Projections", "Data Analysis", "Product-Led Growth", "Sales Pipelines", "Project Management", "Communication", "Paid and Freemium Models"], "postedDate": "2 weeks ago", "benefits": "Comprehensive Health, Dental, and Vision coverage beginning on the first day for employees and their families, 401(k) program with up to 2% company matching, Flexible PTO with a FlexExperience budget ($900 annually) to help you make the most of your time away from work, FlexWellness program ($1,800 annually) to help support your personal health goals, Generous budget for home office set up, $1,500 annual learning and development stipend, 16 weeks of paid parental leave", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3990406740"}