{"jobTitle": "Export/Logistics Manager", "company": {"name": "Randstad USA", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Not Applicable", "salary": {"amount": "60,000.00/yr - 65,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Randstad is committed to providing the best candidates in the area of logistics, import/export and supply chain. We assist our clients find the best candidates in this area. If you have experience managing export activities, ensuring compliance with international regulatory requirements, collaborating with various departments, interpreting regulations, maintaining necessary documentation, and implementing procedures to ensure seamless and compliant international shipments, then we invite you to apply today! Bilingual in English and Spanish is required. Email resumes to lauren.izzo@randstadusa.com<br/><br/>salary: $60,000 - $65,000 per year<br/><br/>shift: First<br/><br/>work hours: 8 AM - 5 PM<br/><br/>education: Bachelors<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Maintain required export-related records for the Company.</li><li> Complete necessary forms for compliance with export/import regulations </li><li>Work closely with the sales, shipping, and logistics teams, as well as external customers, to develop solutions that ensure regulatory compliance and facilitate import and export shipments.</li><li> Manage export/import compliance activities, including the evaluation of business practices to ensure regulatory adherence.</li><li> Identify, interpret, and communicate regulatory requirements to all team members to ensure compliance measures are effectively implemented. <br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Analytical Thinking<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Years of experience: 5 years</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.", "responsibilities": "Maintain required export-related records for the Company.\nComplete necessary forms for compliance with export/import regulations \nWork closely with the sales, shipping, and logistics teams, as well as external customers, to develop solutions that ensure regulatory compliance and facilitate import and export shipments.\nManage export/import compliance activities, including the evaluation of business practices to ensure regulatory adherence.\nIdentify, interpret, and communicate regulatory requirements to all team members to ensure compliance measures are effectively implemented. ", "qualifications": {"required": "Years of experience: 5 years\nExperience level: Experienced", "preferred": ""}, "skills": ["Analytical Thinking"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990039612"}