{"jobTitle": "TMAS Mission Data Engineer 1038", "company": {"name": "Torch Technologies, Inc.", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Regular Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "Torch Technologies is seeking a Mission Data SW Engineer (entry level) to join a team to assist the 36 th Electronic Warfare Squadron (EWS), 350th Spectrum Warfare Wing (350 SWW), at Eglin AFB, Florida. The 350 SWW is the technical focal point for all electronic warfare (EW) support of warfighter systems for the Combat Air Forces (CAF). The mission of the 350 SWW is to develop and test mission data (MD) to defeat enemy radar and infrared guided missile systems, thus enhancing aircrew and aircraft survivability in combat. This mission includes operational EW testing, MD development/validation/verification, force development evaluation execution and facilitating foreign materiel exploitation.<br/><br/> Responsibilities: <br/><br/> This position requires a highly motivated individual with experience to include the following:<br/><br/><ul><li> Conduct appropriate EW research, MD development and MD testing. </li><li> Support EW system programming/reprogramming, work with EW system engineers to coordinate programming/reprogramming requirements, prepare validation and verification test plans, and organize and participate in MD configuration control boards. </li><li> Assist with the collection, recording, and post-test analysis of data generated during MD testing. </li><li> May be required to travel, both domestic and international, so possessing a US passport or having an ability to obtain one is required. <br/><br/></li></ul>Candidates must have at least a Bachelors' degree in a technical/engineering discipline. The candidate must be a US Citizen, and have the character and background to obtain a Secret security clearance. They must have the potential ability to recognize and analyze problems, conduct research, summarize results, and make appropriate recommendations. Applicants must have a working knowledge of computer systems and an understanding of Windows-based personal computers and Microsoft Office software and possess the ability to communicate effectively both orally and written.<br/><br/> Preferred Qualifications: <br/><br/> Highly desirable (but not required) attributes include a current active Secret security clearance and previous experience in RF integration, EM spectrum management, antenna design, and digital signal processing. Also desired (but not required) is knowledge of EW weapons systems development, test and evaluation, and systems engineering. Candidates without and active Secret security clearance must be a US Citizen able to obtain and maintain a Secret clearance.<br/><br/> U.S. Citizenship Required for this Position:  Yes<br/><br/> Job Type:  Regular Full-time<br/><br/> Security Clearance  : Secret<br/><br/> Schedule:  40 Hrs/week<br/><br/> Work Location:  Eglin AFB, FL<br/><br/> Travel:  yes, 10-15%<br/><br/> Relocation Assistance Available:  No<br/><br/> Position Contingent Upon Award of Contract:  No<br/><br/> Benefits: <br/><br/> Torch Technologies is proud to offer a stable and professional work environment, a competitive salary, and an excellent, comprehensive benefit package including: ESOP participation, 401(k) match and safe-harbor contribution, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, Health Saving Accounts and Health Reimbursement Accounts, EAP, education assistance, paid time off, and holidays.<br/><br/> Applying to Torch Technologies: <br/><br/> Only those candidates invited for an interview will be contacted. Employment at Torch Technologies is contingent upon the successful completion of a comprehensive background check.<br/><br/><em> Torch Technologies is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Employment Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class </em> .<br/><br/>", "responsibilities": "This position requires a highly motivated individual with experience to include the following:<br/><br/><ul><li> Conduct appropriate EW research, MD development and MD testing. </li><li> Support EW system programming/reprogramming, work with EW system engineers to coordinate programming/reprogramming requirements, prepare validation and verification test plans, and organize and participate in MD configuration control boards. </li><li> Assist with the collection, recording, and post-test analysis of data generated during MD testing. </li><li> May be required to travel, both domestic and international, so possessing a US passport or having an ability to obtain one is required. <br/><br/></li></ul>", "qualifications": {"preferred": "Highly desirable (but not required) attributes include a current active Secret security clearance and previous experience in RF integration, EM spectrum management, antenna design, and digital signal processing. Also desired (but not required) is knowledge of EW weapons systems development, test and evaluation, and systems engineering. Candidates without and active Secret security clearance must be a US Citizen able to obtain and maintain a Secret clearance.", "required": "Candidates must have at least a Bachelors' degree in a technical/engineering discipline. The candidate must be a US Citizen, and have the character and background to obtain a Secret security clearance. They must have the potential ability to recognize and analyze problems, conduct research, summarize results, and make appropriate recommendations. Applicants must have a working knowledge of computer systems and an understanding of Windows-based personal computers and Microsoft Office software and possess the ability to communicate effectively both orally and written."}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Torch Technologies is proud to offer a stable and professional work environment, a competitive salary, and an excellent, comprehensive benefit package including: ESOP participation, 401(k) match and safe-harbor contribution, medical, dental, vision, life insurance, short-term disability, long-term disability, flexible spending accounts, Health Saving Accounts and Health Reimbursement Accounts, EAP, education assistance, paid time off, and holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3990124269"}