{"jobTitle": "Director of Marketing Operations", "company": {"name": "Publishing.com", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "Reports to: Director of Marketing<br/><br/>Location: 100% remote, USA or Canada based only<br/><br/><strong>Company Summary<br/><br/></strong>Publishing.comempowers individuals from all walks of life to generate meaningful income streams through book publishing. As a leading online education platform, we specialize in guiding our students through the processes of writing, publishing, and selling books and audiobooks on major platforms like Amazon and Audible. We are thrilled to announce that Publishing.com has been recognized as the 19th fastest-growing private company in America for 2023, according to the prestigious Inc. 5000 list. Over the past two years, we've experienced an incredible 30% year-over-year growth and expanded our team by 500%. Recently, we hit a major milestone by helping 60,000+ students through our programs.<br/><br/>Our mission is to become the premier destination for all publishing-related needs. In line with this vision, we are excited to announce the launch of our latest innovation, Publishing.ai, a software designed to revolutionize the publishing industry further. This year marks a significant milestone in our journey toward achieving our goal, as we continue to expand our offerings and support our community of publishers.<br/><br/><strong>About The Role<br/><br/></strong>Are you a seasoned Marketing Operations Leader ready to significantly influence both our marketing campaigns and overarching business strategy? This is your chance to shine.<br/><br/>As a key leader within our marketing team, you will master the use of CRM and lead our team that is responsible for our day-to-day marketing.<br/><br/>Your expertise in analytics and conversion optimization will drive strategies that refine customer journeys and boost conversion rates, positioning you at the heart of our marketing success. Your leadership will not only ensure the execution of top-tier marketing strategies but also shape our broader business trajectory.<br/><br/>This pivotal role is your opportunity to foster a culture of collaboration and excellence, propelling our ambitious goals forward. If you're looking for a dynamic position where you can make a definitive impact, we invite you to join us in this exciting journey.<br/><br/><strong>Who You Are<br/><br/></strong>You are a results-driven leader who thrives in roles with hands-on execution. With a passion for marketing operations, you find fulfillment in driving successful outcomes and taking full accountability for the performance of yourself and your team. Your approach is proactive and dynamic, thriving on the challenge of leading at a high level while engaging deeply with every detail.<br/><br/>As someone who loves building initiatives from the ground up and seeing them evolve into industry benchmarks, you possess a unique capability to scrutinize our current strategies and define news ways to extract every last ounce of potential. This is how you approach conversion optimization—relentlessly pursuing perfection and leaving no opportunity unexplored. You are a powerhouse and strong executor who thrives on victories, with a key focus on achieving deadlines, regardless of what it takes.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage and optimize marketing operations to support the strategic goals set by the Director of Marketing</li><li>Lead, mentor, and develop the marketing operations team. Create a culture of continuous improvement and professional growth within the team</li><li>Review and analyze marketing activities and make suggestions to management to adhere with legal standards and industry regulations. Manage risks related to data privacy and security, and advertising compliance</li><li>Utilize HubSpot, to drive marketing campaigns, manage leads, and optimize customer journeys</li><li>Manage and work closely with Marketing Technical leads to implement and manage marketing automation processes, ensuring seamless campaign execution</li><li>Work with the Business Operations team to analyze marketing and sales data to develop insights and and implement initiatives based on data</li><li>Maintain comprehensive dashboards to track marketing effectiveness, key performance indicators (KPIs), and campaign metrics to provide actionable insights to senior management</li><li>Lead Conversion Optimization efforts across all marketing channels, focusing on improving the checkout experience and increasing conversion rates</li><li>Oversee and coordinate all marketing campaigns, including live events and email campaigns, ensuring seamless integration and alignment of all departmental responsibilities within the business</li><li>Own the marketing lead funnel process and provide detailed reports for customer behavior and optimize conversions</li><li>Develop and implement best practices for marketing operations, ensuring scalability and efficiency in all processes<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Minimum of 10+ years of progressive experience in Marketing, ideal candidates have held operations titles</li><li>Expertise with HubSpot, and proficiency in marketing automation tools</li><li>Strong analytical skills with the ability to interpret data and make actionable recommendations</li><li>Worked in a B2C business with a strong understanding of consumer marketing compliance</li><li>Experience with Conversion Rate Optimization (CRO) and enhancing checkout experiences</li><li>Excellent communication and interpersonal skills, with the ability to collaborate effectively across teams</li><li>Ability to thrive in a fast-paced, dynamic environment and manage multiple priorities effectively<br/><br/></li></ul>Why Publishing.com?<br/><br/>At Publishing.com, our dedication to our mission and core values isn't just talk; it's reflected in how we treat our team. We believe in nurturing our employees' well-being, supporting their families, and empowering them to contribute to their communities. Here's how we stand out:<br/><br/><ul><li>Recently recognized as #19 on the Inc 5000's list of Fastest Growing Private Companies in America for 2023</li><li>We are a completely remote team located worldwide with 100+ employees</li><li>We have great benefits including paid time off (PTO), competitive health, vision, and dental benefits, 401k, and team socials...yes, even remotely</li><li>We care about our culture deeply and live by our company values (1) Service that WOWs, (2) Ultimate Team Player, (3) Great Freakin' Attitude, (4) Billion Dollar Standards</li><li>We encourage learning, growth, and continuous improvement and create meaningful programs to support our employees' professional development</li><li>If you want to join a team on the ground floor, this is your chance: we are expanding beyond being an education company to become the one-stop shop for all your self-publishing needs<br/><br/></li></ul>*Some benefits are available to our US-based employees only.<br/><br/>At Publishing.com, we're dedicated to assembling teams as diverse as a kaleidoscope and fostering an atmosphere as warm as your favorite coffee shop. We understand that the job application process can sometimes feel daunting, but we’re here to offer our support. Don't hesitate to reach out with any questions or concerns about the hiring process – if you're interested in joining our ranks, we're eager to hear from you! Email us at careers@publishing.com if you need additional support.<br/><br/>We strive to seek out and support individuals from all different backgrounds recognizing your unique experience contributes to the richness of our collective knowledge. We are committed to fostering an environment where we learn from each other's beliefs and experiences and celebrate the differences that eventually will drive forward our innovation. We strive to ensure that every member of our team feels valued and respected, regardless of where they may be situated. Come be a part of our community – your talents and contributions are welcomed!<br/><br/>Powered by JazzHR<br/><br/>yAz1Rzu29g", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "postedDate": "2 weeks ago", "benefits": "We have great benefits including paid time off (PTO), competitive health, vision, and dental benefits, 401k, and team socials...yes, even remotely", "remoteWork": "Yes", "responsibilities": "Manage and optimize marketing operations to support the strategic goals set by the Director of Marketing\nLead, mentor, and develop the marketing operations team. Create a culture of continuous improvement and professional growth within the team\nReview and analyze marketing activities and make suggestions to management to adhere with legal standards and industry regulations. Manage risks related to data privacy and security, and advertising compliance\nUtilize HubSpot, to drive marketing campaigns, manage leads, and optimize customer journeys\nManage and work closely with Marketing Technical leads to implement and manage marketing automation processes, ensuring seamless campaign execution\nWork with the Business Operations team to analyze marketing and sales data to develop insights and and implement initiatives based on data\nMaintain comprehensive dashboards to track marketing effectiveness, key performance indicators (KPIs), and campaign metrics to provide actionable insights to senior management\nLead Conversion Optimization efforts across all marketing channels, focusing on improving the checkout experience and increasing conversion rates\nOversee and coordinate all marketing campaigns, including live events and email campaigns, ensuring seamless integration and alignment of all departmental responsibilities within the business\nOwn the marketing lead funnel process and provide detailed reports for customer behavior and optimize conversions\nDevelop and implement best practices for marketing operations, ensuring scalability and efficiency in all processes", "qualifications": {"required": "Minimum of 10+ years of progressive experience in Marketing, ideal candidates have held operations titles\nExpertise with HubSpot, and proficiency in marketing automation tools\nStrong analytical skills with the ability to interpret data and make actionable recommendations\nWorked in a B2C business with a strong understanding of consumer marketing compliance\nExperience with Conversion Rate Optimization (CRO) and enhancing checkout experiences\nExcellent communication and interpersonal skills, with the ability to collaborate effectively across teams\nAbility to thrive in a fast-paced, dynamic environment and manage multiple priorities effectively", "preferred": ""}, "skills": ["Marketing", "HubSpot", "Marketing Automation", "Data Analysis", "Conversion Rate Optimization", "CRM", "B2C", "Consumer Marketing Compliance", "Communication", "Collaboration", "Team Management", "Leadership"], "url": "https://www.linkedin.com/jobs/view/3991930123"}