{"jobTitle": "Inventory Control Associate Analyst - Boca Raton, FL", "company": {"name": "VetJobs", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Armed Forces", "description": "ATTENTION MILITARY AFFILIATED JOB SEEKERS - Our organization works with partner companies to source qualified talent for their open roles. The following position is available to Veterans, Transitioning Military, National Guard and Reserve Members, Military Spouses, Wounded Warriors, and their Caregivers . If you have the required skill set, education requirements, and experience, please click the submit button and follow the next steps.<br/><br/>At Zimmer Biomet, we believe in pushing the boundaries of innovation and driving our mission forward. As a global medical technology leader for nearly 100 years, a patient’s mobility is enhanced by a Zimmer Biomet product or technology every 8 seconds.<br/><br/>As a Zimmer Biomet team member, you will share in our commitment to providing mobility and renewed life to people around the world. To support our talent team, we focus on development opportunities, robust employee resource groups (ERGs), a flexible working environment, location specific competitive total rewards, wellness incentives and a culture of recognition and performance awards. We are committed to creating an environment where every team member feels included, respected, empowered, and recognized.<br/><br/><strong>What You Can Expect<br/><br/></strong>This position is responsible for the control and communication around field/distributor inventory both physically and systematically, through monitoring, traceability, and reconciliations. This position supports all department and territory goals, especially those that seek to optimize field inventory levels and protect company assets while elevating the satisfaction of the customer’s experience.<br/><br/><strong>How You'll Create Impact<br/><br/></strong><ul><li>Investigates inventory variances and works cross-departmentally to identify root cause and recommend solutions.</li><li>Responsible for the timely research, disposition, and reporting of disputed inventory.</li><li>Review and reconcile missing/late inventory reports on a daily basis.</li><li>Facilitates the return/exchange of expiry dated/calibrated products between warehouse and field personnel, as required.</li><li>Controls the systematic movement of inventory and data integrity.</li><li>Conducts research as necessary for product recalls.</li><li>Generates regular weekly/monthly reporting as well as all ad-hoc reporting.</li><li>Manages all communication and administrative functions related to the termination of distributor inventory accounts.</li><li>Various other administrative duties as assigned or requested.</li><li>Perform duties in compliance with applicable regulations and standards such as FDA Quality System Regulation and ISO (International Organization for Standardization).</li><li>Assist with strategic inventory request and fulfillment</li><li>Monitor and assist with asset placement and recovery through cross functional collaboration with sales and operations; Manage inventory outflow of loose inventory requests<br/><br/></li></ul><strong>Auto req ID<br/><br/></strong>422225BR<br/><br/><strong>Minimum Education Required<br/><br/></strong>Bachelors<br/><br/><strong>Job_Category<br/><br/></strong>Analyst<br/><br/><strong>Additional Qualifications/Responsibilities<br/><br/></strong><strong>What Makes You Stand Out:<br/><br/></strong><ul><li>Computer literate with intermediate to advanced familiarity with MS Excel</li><li>Strong customer service orientation</li><li>Strong written and verbal communication skills, especially the ability to foster positive relationships with all internal and external (sales) personnel</li><li>Results oriented with the ability to accomplish work in a team environment</li><li>Strong attention to detail</li><li>Demonstrated enthusiasm and willingness to learn</li><li>Ability to work unsupervised on assigned tasks</li><li>Demonstrated analytical skills, especially in the areas of process improvement and problem solving.</li><li>Highly developed organizational skills – able to handle multiple high priority tasks/projects concurrently<br/><br/></li></ul><strong>Your Background:<br/><br/></strong><ul><li>2+ years related experience, preferably within the medical device industry</li><li>Experience with Inventory Control practices and data analysis.</li><li>SAP experience and proficiency preferred</li><li>Must have a valid driver’s license</li><li>College Degree is preferred and a combination of education and experience will be considered.<br/><br/></li></ul><strong>Travel Expectations:<br/><br/></strong><ul><li>Up to 10/15%<br/><br/></li></ul><strong>City*<br/><br/></strong>Boca Raton<br/><br/><strong>State*<br/><br/></strong>Florida<br/><br/><strong>Job Code<br/><br/></strong>Analyst_ _Analyst<br/><br/><strong>Affiliate Sponsor<br/><br/></strong>Zimmer Biomet", "responsibilities": "This position is responsible for the control and communication around field/distributor inventory both physically and systematically, through monitoring, traceability, and reconciliations. This position supports all department and territory goals, especially those that seek to optimize field inventory levels and protect company assets while elevating the satisfaction of the customer’s experience.<br/><br/><strong>How You'll Create Impact<br/><br/></strong><ul><li>Investigates inventory variances and works cross-departmentally to identify root cause and recommend solutions.</li><li>Responsible for the timely research, disposition, and reporting of disputed inventory.</li><li>Review and reconcile missing/late inventory reports on a daily basis.</li><li>Facilitates the return/exchange of expiry dated/calibrated products between warehouse and field personnel, as required.</li><li>Controls the systematic movement of inventory and data integrity.</li><li>Conducts research as necessary for product recalls.</li><li>Generates regular weekly/monthly reporting as well as all ad-hoc reporting.</li><li>Manages all communication and administrative functions related to the termination of distributor inventory accounts.</li><li>Various other administrative duties as assigned or requested.</li><li>Perform duties in compliance with applicable regulations and standards such as FDA Quality System Regulation and ISO (International Organization for Standardization).</li><li>Assist with strategic inventory request and fulfillment</li><li>Monitor and assist with asset placement and recovery through cross functional collaboration with sales and operations; Manage inventory outflow of loose inventory requests<br/><br/></li></ul>", "qualifications": {"required": "Computer literate with intermediate to advanced familiarity with MS Excel, Strong customer service orientation, Strong written and verbal communication skills, especially the ability to foster positive relationships with all internal and external (sales) personnel, Results oriented with the ability to accomplish work in a team environment, Strong attention to detail, Demonstrated enthusiasm and willingness to learn, Ability to work unsupervised on assigned tasks, Demonstrated analytical skills, especially in the areas of process improvement and problem solving., Highly developed organizational skills – able to handle multiple high priority tasks/projects concurrently", "preferred": "2+ years related experience, preferably within the medical device industry, Experience with Inventory Control practices and data analysis., SAP experience and proficiency preferred, Must have a valid driver’s license, College Degree is preferred and a combination of education and experience will be considered."}, "skills": ["MS Excel", "Customer Service", "Communication", "Teamwork", "Attention to Detail", "Analytical Skills", "Problem Solving", "Organizational Skills", "Inventory Control", "SAP"], "postedDate": "2 weeks ago", "url": "https://www.linkedin.com/jobs/view/3991008575"}