{"jobTitle": "Work from Home Customer Service Rep in a Contractor Role", "company": {"name": "Omni Interactions", "location": "Spring Valley, NV"}, "location": "Spring Valley, NV", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "14.00/hr - 20.00/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Outsourcing and Offshoring Consulting", "description": "Omni supports many clients. Independent contractors who are among the qualified candidates will provide customer service (taking inbound phone calls, answering chat messages, &amp; responding to emails) for Fortune 500 companies.<br/><br/>You will interact with customers primarily through inbound phone calls and possibly chat/email, helping them with all their needs.<br/><br/><strong>Schedule:<br/><br/></strong><ul><li>Flexible work schedule options available</li><li>Majority of work hours are during weekdays and daytime</li><li>Opportunity to create a work schedule that works best for you<br/><br/></li></ul><strong>Earnings &amp; Revenue:<br/><br/></strong><ul><li>Contract earnings vary by client, with competitive rates typically ranging from $14 to $20 per hour</li><li>Pay is determined by your phone call status when assisting customers</li><li>Additional incentives available based on client and performance metrics. <br/><br/></li></ul><strong>Required Skills for Successful Contractors:<br/><br/></strong><ul><li>Exceptional written and verbal communication skills</li><li>Proven track record in customer service and delivering outstanding customer care</li><li>Keen attention to detail with strong problem-solving skills</li><li>Friendly, empathetic tone, and professional demeanor</li><li>Self-motivated, proactive, and resourceful mindset</li><li>️‍ Proficient in using technology, including computer applications and software. <br/><br/></li></ul><strong>Important Information<br/><br/></strong><strong>Technology &amp; Equipment Requirements:<br/><br/></strong><ul><li>Quiet and secure work environment during working hours</li><li>Personal computer with a minimum of 8GB RAM (tablets and Chromebooks are not permitted)</li><li>Wired USB headset with microphone for clear communication</li><li>High-speed wired internet with a minimum of 10 Mbps download speed for seamless connectivity. Please note: You cannot use Mobile home internet (T-Mobile/Verizon, etc) or Satellite internet service. </li><li>Operating system of Windows 10 or Windows 11 (some clients may accept AppleOS)</li><li>Valid and up-to-date antivirus software installed</li><li>Smart phone, Android tablet or iPad is required for program work, along with an authentication app. </li><li>Windows 10 or Windows 11 operating system must be used (some clients will accept an AppleOS)<br/><br/></li></ul><strong>Work Environment Requirements:<br/><br/></strong><ul><li>Quiet, uninterrupted space</li><li>Organized desk area<br/><br/></li></ul><em>We are currently unable to work with contractors residing in Alaska, California, Connecticut, Delaware, Illinois, Michigan, Maine, Massachusetts, Maryland, New Jersey, New York, Oregon, Rhode Island, Vermont, Washington, or Washington DC. Contractors must also successfully pass a criminal background check.<br/><br/></em><em>We <strong>are</strong> able to work with contractors residing in Alabama, Arizona, Arkansas, Colorado, Florida, Georgia, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, Pennsylvania, South Carolina, South Dakota, Texas, Tennessee, Utah, Virginia, West Virginia, Wisconsin, Wyoming and Puerto Rico.<br/><br/></em><em><strong>Contractual Relationship:</strong> The relationship between you and Omni Interactions is a contractual relationship. You will remain an independent contractor for the duration of your program assignment. Omni Interactions will not be responsible for withholding taxes on your earnings while contracted with Omni Interactions. When you receive your contract, you will be asked to agree to have no claim against Omni Interactions hereunder or otherwise for vacation pay, sick leave, retirement benefits, Social Security, worker’s compensation, health or disability benefits, overtime, unemployment insurance benefits or employee benefits of any kind.<br/><br/></em><strong>Company Description<br/><br/></strong>Welcome to the Gig Life<br/><br/>You want flexible yet dependable work with exceptional companies. Omni provides access to work-from-home Gigs supporting leading brands. We're passionate about empowering our Gig Workers while providing a community for them to grow and be successful.<br/><br/>Be your own boss. Set your own schedule.<br/><br/>Get paid. Enjoy the Gig life.<br/><br/>Welcome to the Gig Life You want flexible yet dependable work with exceptional companies. Omni provides access to work-from-home Gigs supporting leading brands. We're passionate about empowering our Gig Workers while providing a community for them to grow and be successful. Be your own boss. Set your own schedule. Get paid. Enjoy the Gig life.", "responsibilities": "Independent contractors who are among the qualified candidates will provide customer service (taking inbound phone calls, answering chat messages, &amp; responding to emails) for Fortune 500 companies.", "qualifications": {"required": "Exceptional written and verbal communication skills, Proven track record in customer service and delivering outstanding customer care, Keen attention to detail with strong problem-solving skills, Friendly, empathetic tone, and professional demeanor, Self-motivated, proactive, and resourceful mindset, ️‍ Proficient in using technology, including computer applications and software.", "preferred": null}, "skills": ["Customer Service", "Communication", "Problem Solving", "Technology"], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": null, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3991810991"}