{"jobTitle": "Product Manager", "company": {"name": "Avenue Group", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "4,000.00/mo - 6,000.00/mo", "currency": "USD"}, "jobFunction": "Product Management, Research, and Project Management", "industry": "Technology, Information and Media, Business Consulting and Services, and Market Research", "description": "<strong>Who We Are</strong><p>Crowdwave (by Avenue Group) is an exciting new product leveraging the power of LLMs to simulate audiences for consumer sentiment research. Before running costly human surveys to get feedback on new marketing materials, branding, product ideas, etc., companies and researchers use our product to quickly run surveys on virtual audiences representing specific consumer segments. AI allows for faster, lower-cost research, and unlocks additional types of studies such as iterative follow-up surveys, counterfactual comparisons, and lengthy or in-depth surveys that are impractical with human respondents.</p><p><br/></p><p>Crowdwave’s team is drawn in part from Avenue Group, a leading research-driven advisory firm that specializes in delivering actionable insights to enhance decision-making processes for Fortune 500s, private equity firms, and mid-market companies. Leveraging advanced analytics and research methodologies, Avenue Group ensures that its clients achieve optimal strategic outcomes.</p><p>Learn more at avegroup.com, and please watch our <u>overview video</u> to learn more about the product we are building.</p><p><br/></p><p><strong>What You’ll Do</strong></p><p>We are seeking a hands-on, dedicated Product Manager to drive the development of our AI-powered audience simulator. This role demands an obsession with customer needs and problems, interest in new AI technologies and their application in the world of market research, and the hustle to get things done and adjust rapidly in a fast-paced startup environment. You will:</p><ul><li>Lead requirements gathering, roadmap and backlog management, and sprint planning for the product</li><li>Collaborate directly with developers, designers, and leadership to understand product needs, weigh cost and user value, and translate to prioritizations and timelines</li><li>Contribute directly to UI design, new feature ideas, and analytic research as we optimize the architecture and prompt structure that powers our technology</li><li>Interact directly with customers to build a deep understanding of their needs, workflows, and objectives</li><li>Contribute to our commercial direction and company direction as a key member of a small, early-stage team</li><li>Help the team to conduct rigorous testing and debugging to enhance the performance and usability of our product</li></ul><p><br/></p><p><strong>What We’re Looking For</strong></p><ul><li>At least 2 years of experience in Product Management roles</li><li>Experience building products from 0-1 </li><li>Somebody who, at core, is interested in ensuring the team gets things done to deliver an excellent product</li><li>Strong analytical skills with the ability to solve complex problems creatively, and ability to go hands on with analytics to evaluate the relative performance of LLMs and help troubleshoot and optimize our models and architecture</li><li>Direct, hands on experience with market research, including familiarity with basic survey tools/concepts and common challenges, pitfalls, and needs for market research professionals</li><li>Familiarity with agile and Kanban frameworks and a high level of comfort with change, and ambiguity</li><li>Familiarity with common PM and design tools (e.g., JIRA, Miro, etc.)</li><li><strong>Able to start immediately in a full time capacity as a contractor</strong></li></ul><p><br/></p><p>This position offers an exciting opportunity to contribute to a new product with promising early market signs and a clear, concrete AI-based value proposition, setting new standards in research methodologies by integrating advanced AI technologies to simulate and understand behavior in unprecedented ways. Compensation will be a mix of cash and equity in the company.</p><p></p>", "responsibilities": "Lead requirements gathering, roadmap and backlog management, and sprint planning for the productCollaborate directly with developers, designers, and leadership to understand product needs, weigh cost and user value, and translate to prioritizations and timelinesContribute directly to UI design, new feature ideas, and analytic research as we optimize the architecture and prompt structure that powers our technologyInteract directly with customers to build a deep understanding of their needs, workflows, and objectivesContribute to our commercial direction and company direction as a key member of a small, early-stage teamHelp the team to conduct rigorous testing and debugging to enhance the performance and usability of our product", "qualifications": {"required": "At least 2 years of experience in Product Management rolesExperience building products from 0-1 Somebody who, at core, is interested in ensuring the team gets things done to deliver an excellent productStrong analytical skills with the ability to solve complex problems creatively, and ability to go hands on with analytics to evaluate the relative performance of LLMs and help troubleshoot and optimize our models and architectureDirect, hands on experience with market research, including familiarity with basic survey tools/concepts and common challenges, pitfalls, and needs for market research professionalsFamiliarity with agile and Kanban frameworks and a high level of comfort with change, and ambiguityFamiliarity with common PM and design tools (e.g., JIRA, Miro, etc.)Able to start immediately in a full time capacity as a contractor", "preferred": ""}, "skills": ["Product Management", "AI", "Market Research", "Agile", "Kanban", "JIRA", "Miro"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Compensation will be a mix of cash and equity in the company.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992365424"}