{"jobTitle": "Customer Service Agents  - Remote | WFH", "company": {"name": "Get It Recruit - Hospitality", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Human Resources Services", "description": "Are you ready to work from the comfort of your own home with flexible hours that fit your schedule? Join our team as a Remote Customer Service Agent! We're looking for dedicated individuals who are passionate about delivering excellent customer service and are eager to grow with us.<br/><br/><strong>What We Offer<br/><br/></strong>Flexible Scheduling: Create your own work schedule to achieve the perfect work-life balance.<br/><br/>Room for Advancement: We value your career growth and provide opportunities to advance within our organization.<br/><br/>Referral Bonuses: Earn bonuses by referring talented individuals to our team.<br/><br/><strong>Job Responsibilities<br/><br/></strong>Provide exceptional customer service to clients in the travel industry.<br/><br/>Assist customers with inquiries, bookings, and general support via phone and email.<br/><br/>Utilize your own computer, internet connection, and landline phone to effectively perform remote duties.<br/><br/>Complete necessary training and pass a background check.<br/><br/><strong>Preferred Qualifications<br/><br/></strong>Previous experience in customer service or the travel industry is advantageous.<br/><br/>Bilingual skills are a plus, enhancing our ability to serve a diverse clientele.<br/><br/><strong>About Us<br/><br/></strong>We specialize in providing remote call center services for various prestigious companies, offering a dynamic and supportive work environment where your skills can shine.<br/><br/><strong>Apply Now<br/><br/></strong>Ready to embark on a rewarding remote career journey? Click on the apply button now and take the first step towards joining our team of dedicated professionals!<br/><br/>Employment Type: Full-Time", "postedDate": "2 weeks ago", "salary": {"amount": "10.00/hr - 14.00/hr", "currency": "USD"}, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3992484045"}