{"jobTitle": "Account Manager - Portland, OR", "company": {"name": "North American Composites", "industry": "Chemical Manufacturing", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Chemical Manufacturing", "description": "Position covers Portland, OR and Southern WA<br/><br/>We have an outstanding opportunity for an <strong>Account Manager </strong>position covering the region<strong>. </strong>Our Account Managers are responsible for generating new business through customer contact, developing accounts, and driving results. We take the time to build relationships with new and existing customers so we can truly understand what they need and how we can help them succeed while achieving profitable revenue growth year after year.<br/><br/>Job Duties Include:<br/><br/><ul><li> Connecting with customers – looking for growth opportunities with current and new customers. </li><li> Provide technical support to customers for product and process improvements. </li><li> Customer relationship development. </li><li> Managing inventory of customer products to insure no supply disruptions. </li><li> Update SalesForce/CRM regularly for opportunities and new business. </li><li> Customer follow-up on supply challenges, price increases, etc. </li><li> Manage product trials for customer qualification. <br/><br/><br/></li></ul>Minimum Requirements:<br/><br/><ul><li> Bachelor’s Degree or equivalent work experience. </li><li> 5 years’ experience in business, sales or marketing </li><li> Excellent verbal and written communication skills. </li><li> Strong planning and organizational skills. </li><li> High attention to detail and strong administrative management skills. </li><li> Skillful negotiation and presentation abilities. </li><li> Demonstrated ability of excellent customer service techniques including follow-through and resolution. </li><li> Ability to respond to changing work demands and environment in a positive manner, recognizing them as opportunities for personal and professional growth. </li><li> High energy approach to business, and a desire to succeed. </li><li> Computer literacy and experience in MS office applications. </li><li> Must have a valid driver’s license with acceptable driving record <br/><br/><br/></li></ul>Preferred Experience:<br/><br/><ul><li> Knowledge of Distribution &amp; Manufacturing </li><li> Knowledge of markets for reinforced plastics and cast products, as well as a thorough understanding of vendors’ and distributors’ functions. <br/><br/><br/></li></ul><strong> Pay &amp; Benefits: <br/><br/></strong>In addition to salary and commission, we also offer a comprehensive benefits package to include paid major holidays, vacation, health, dental, profit sharing plan, vision, short-and long-term disability insurance, and 401(k) with company match.<br/><br/>North American Composites (NAC) distributes materials and equipment from leading suppliers to the marine and composites industry. We provide national coverage with local service though our 30 distribution centers in the U.S. and Canada. Each location serves our local customers with fast, efficient deliveries of the products they need. Our warehouses maintain inventories of all materials necessary for composites manufacturing: resins, gel coat, fiberglass, catalyst, adhesives, cores, putties, and many others. NAC local salespeople are knowledgeable and CCT certified to insure the best possible service to every manufacturer.<br/><br/>", "responsibilities": "Connecting with customers – looking for growth opportunities with current and new customers. Provide technical support to customers for product and process improvements. Customer relationship development. Managing inventory of customer products to insure no supply disruptions. Update SalesForce/CRM regularly for opportunities and new business. Customer follow-up on supply challenges, price increases, etc. Manage product trials for customer qualification.", "qualifications": {"required": "Bachelor’s Degree or equivalent work experience. 5 years’ experience in business, sales or marketing Excellent verbal and written communication skills. Strong planning and organizational skills. High attention to detail and strong administrative management skills. Skillful negotiation and presentation abilities. Demonstrated ability of excellent customer service techniques including follow-through and resolution. Ability to respond to changing work demands and environment in a positive manner, recognizing them as opportunities for personal and professional growth. High energy approach to business, and a desire to succeed. Computer literacy and experience in MS office applications. Must have a valid driver’s license with acceptable driving record", "preferred": "Knowledge of Distribution &amp; Manufacturing Knowledge of markets for reinforced plastics and cast products, as well as a thorough understanding of vendors’ and distributors’ functions."}, "skills": ["Sales", "Marketing", "Customer Service", "Business Development", "Salesforce", "CRM", "Negotiation", "Presentation Skills", "MS Office"], "postedDate": "2 weeks ago", "benefits": "In addition to salary and commission, we also offer a comprehensive benefits package to include paid major holidays, vacation, health, dental, profit sharing plan, vision, short-and long-term disability insurance, and 401(k) with company match.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992212289"}