{"jobTitle": "Cloud Engineer", "company": {"name": "PeopleTec, Inc.", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing", "description": "<strong>Responsibilities<br/><br/></strong>PeopleTec is currently seeking a <strong>Cloud Engineer</strong> to support our <strong>Niceville, FL</strong> location.<br/><br/>PeopleTec is a company that hires and develops technology talent and puts them to work on client projects across the United States. We specialize in full stack development, Cloud, DevSecOps, Cybersecurity, Artificial Intelligence (AI), Business Intelligence (BI), Data Science, Machine Learning (ML) related initiatives, both in the federal and commercial space. We are currently seeking Cloud DevSecOps Engineer to support our Niceville / Eglin AFB location.<br/><br/>The Cloud Engineer serves as the person responsible for cloud Infrastructure as Code, cloud resource provisioning, cloud security, cloud documentation and cloud DevOps pipelines.<br/><br/><strong>Duties<br/><br/></strong><ul><li> Design, implement, and manage complex cloud-based solutions. </li><li> Lead the development and implementation of advanced network security configurations within cloud environments. </li><li> Ensure the implementation of DoD-approved enterprise authentication in Azure, leveraging advanced security protocols and practices. </li><li> Implement robust Role-Based Access Control (RBAC) for multi-platform products in Azure, ensuring high security and compliance. </li><li> Oversee and optimize the development and operational cloud environment, ensuring efficiency and reliability. </li><li> Lead the development and maintenance of comprehensive technical documentation, ensuring adherence to NIST SP 800-171 standards. </li><li> Drive the development and continuous improvement of CI/CD and DevOps processes for cloud products. </li><li> Collaborate with cross-functional teams to ensure alignment of cloud strategies with business objectives. <br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required Skills/Experience:<br/><br/></strong><ul><li> 3-5 years’ experience working in Azure or AWS cloud environments, with a proven track record of designing and managing cloud solutions. </li><li> Advanced cloud service/vendor certification from Azure (e.g., Azure Administrator Associate, AWS Solutions Architect Associate, AWS SysOps Administrator Associate). </li><li> Experience with Windows and Linux operating systems, including advanced configurations and optimizations. </li><li> Experience with implementing enterprise authentication and Role-Based Access, particularly in complex, multi-platform environments. </li><li> Strong skills related to working with docker and Kubernetes to deploy cloud native applications through complex SDLC processes and CI/CD pipelines. </li><li> Expertise with Microsoft Entra ID and Microsoft Active Directory Domain Services </li><li> Proficient in using Terraform to implement complex Infrastructure as Code (IaC) solutions. </li><li> Competent working with multiple types of CI/CD architectures/tools (e.g. GitLab, Ansible, Jenkins, Azure DevOps) </li><li> Experience using Ansible for server and workstation configuration management in large-scale environments. </li><li> Strong networking background with in-depth knowledge of IP subnetting, network security groups, routing, Palo Alto firewall configurations, load balancing, DNS, etc. </li><li> Travel: Less than 15% </li><li> Must be a U.S. Citizen </li><li> An active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. If required, there may be a requirement to obtain a Top Secret clearance. <br/><br/><br/></li></ul><strong>Education Requirements<br/><br/></strong><ul><li> Bachelor's or Master's degree in network engineering, computer science, cyber security, or a related field. <br/><br/><br/></li></ul><strong>Desired Skills<br/><br/></strong><ul><li> Experience with DoD cloud environments, including compliance and security requirements. AF FENCES experience strongly desired. </li><li> Extensive experience with AWS &amp; Azure, including cross-cloud integrations and hybrid cloud architectures. </li><li> Experience with VMware, particularly in hybrid cloud environments. </li><li> Proven ability to work with clients to gather and translate project requirements into technical solutions. </li><li> Experience working in and applying STIG and other server hardening settings in a cloud environment, ensuring high security and compliance. </li><li> CISSP &amp; CCSP <br/><br/><br/></li></ul><strong>Overview<br/><br/></strong><strong> People First. Technology Always. <br/><br/></strong><strong> PeopleTec, Inc. </strong> is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce.<br/><br/><strong> Culture: </strong> The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields.<br/><br/><strong> Career: </strong> At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people.<br/><br/><strong>Come Experience It.<br/><br/></strong>#cjpost #dpost<br/><br/>EEO Statement<br/><br/>PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, applicationhelp@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc.<br/><br/>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.", "postedDate": "2 weeks ago", "qualifications": {"required": "3-5 years’ experience working in Azure or AWS cloud environments, with a proven track record of designing and managing cloud solutions. \nAdvanced cloud service/vendor certification from Azure (e.g., Azure Administrator Associate, AWS Solutions Architect Associate, AWS SysOps Administrator Associate).\nExperience with Windows and Linux operating systems, including advanced configurations and optimizations.\nExperience with implementing enterprise authentication and Role-Based Access, particularly in complex, multi-platform environments.\nStrong skills related to working with docker and Kubernetes to deploy cloud native applications through complex SDLC processes and CI/CD pipelines.\nExpertise with Microsoft Entra ID and Microsoft Active Directory Domain Services \nProficient in using Terraform to implement complex Infrastructure as Code (IaC) solutions.\nCompetent working with multiple types of CI/CD architectures/tools (e.g. GitLab, Ansible, Jenkins, Azure DevOps) \nExperience using Ansible for server and workstation configuration management in large-scale environments.\nStrong networking background with in-depth knowledge of IP subnetting, network security groups, routing, Palo Alto firewall configurations, load balancing, DNS, etc.\nTravel: Less than 15%\nMust be a U.S. Citizen \nAn active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. If required, there may be a requirement to obtain a Top Secret clearance. ", "preferred": "Experience with DoD cloud environments, including compliance and security requirements. AF FENCES experience strongly desired.\nExtensive experience with AWS &amp; Azure, including cross-cloud integrations and hybrid cloud architectures.\nExperience with VMware, particularly in hybrid cloud environments.\nProven ability to work with clients to gather and translate project requirements into technical solutions.\nExperience working in and applying STIG and other server hardening settings in a cloud environment, ensuring high security and compliance.\nCISSP &amp; CCSP"}, "skills": ["Azure", "AWS", "Windows", "Linux", "Docker", "Kubernetes", "Microsoft Entra ID", "Microsoft Active Directory Domain Services", "Terraform", "GitLab", "Ansible", "Jenkins", "Azure DevOps", "Palo Alto firewall", "DoD", "AF FENCES", "VMware", "CISSP", "CCSP"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3992607571"}