{"jobTitle": "Senior Demand Analyst", "company": {"name": "LifeSync", "location": "Coral Springs, FL"}, "location": "Coral Springs, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Medical Equipment Manufacturing", "description": "<strong>Job Title<br/><br/></strong>Senior Demand Analyst<br/><br/><strong>Department<br/><br/></strong>Operations (On-Site)<br/><br/><strong>Reports To<br/><br/></strong>Senior Supply Chain Manager<br/><br/><strong> FLSA <br/><br/></strong><strong> ☒ Exempt <br/><br/></strong><strong> ☐ Non-Exempt <br/><br/></strong><strong>Summary<br/><br/></strong><strong> SUMMARY: <br/><br/></strong>The Senior Demand Analyst is responsible for analysis and planning of finished good demand working closely with the commercial teams or customers to get market enrichment data to support statistical forecast models and the optimization of material stock levels. This critical role will be responsible for improving forecast accuracy in a complex and fast-moving organization providing operational insights through advanced data analytics.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li> Collaborate across the organization with finance, sales, marketing, and operations teams to develop accurate demand forecasts and ensure supportability throughout the network. </li><li> Create and manage visualization tools to present demand data clearly and effectively. </li><li> Manage and refine the demand and reconciliation portions of the S&amp;OP process throughout the organization to drive consensus throughout the organization and highlight business insights including risks and opportunities. </li><li> Work to improve demand practices within both contract manufacturing (where LifeSync doesn’t own the demand) and direct customers. </li><li> Support the identification and assessment of supply chain risks and opportunities from demand perspectives. </li><li> Assures quarterly safety stock level checks are reviewed and updated in our planning system. </li><li> Monitor and report on key performance indicators (KPIs) related to demand forecasting and planning. </li><li> Refining systems and methods to improve forecasts to better anticipate customer needs. </li><li> Stay updated on industry best practices and emerging trends in demand planning and forecasting. </li><li> Manage other assignments as directed by Management. <br/><br/></li></ul><strong>Requirements<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li> Strong proficiency in data analysis and visualization tools (e.g., Excel, Tableau, Power BI). Experience using ERP and CRM systems manipulating the inputs. </li><li> Strong analytical and statistical skills with the ability to interpret data and trends effectively. </li><li> Excellent communication and interpersonal skills to collaborate with various teams and present data effectively for top management. </li><li> Detail-oriented with a focus on accuracy and precision. </li><li> Ability to work in a fast-paced, dynamic environment and adapt to changing priorities. </li><li> Knowledge of supply chain principles and practices. <br/><br/></li></ul><strong> SUPERVISORY RESPONSIBILITIES: </strong> Not Required<br/><br/><strong>Education And/Or Experience<br/><br/></strong><ul><li> Bachelor’s degree in business, statistics, supply chain management, or a relatable discipline. A combination of experience and education may be considered over a degree. </li><li> A minimum of 5 years' experience working in a supply chain / operations / commercial related field focusing on demand and/or supply planning. </li><li> APICS certification preferred. <br/><br/></li></ul><strong> PHYSICAL DEMAND: <br/><br/></strong>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>Stand, Move, Sit, Bending, climb or balance, stoop, kneel, crouch or crawl, Talk/Hear, Vision, Lift up to 20 lbs.<br/><br/><strong>Work Environment<br/><br/></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li> Office Environment </li><li> Flexible Schedule to be able to support operations in multiple time zones. <br/><br/></li></ul><strong> TRAVEL REQUIREMENT: Less than 5%. <br/><br/></strong>The above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities, or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>LifeSync provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.<br/><br/>The Age Discrimination in Employment Act (ADEA) forbids age discrimination against people who are age 40 or older. It does not protect workers under the age of 40, although some states have laws that protect younger workers from age discrimination. It is not illegal for an employer or other covered entity to favor an older worker over a younger one, even if both workers are age 40 or older.<br/><br/>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.", "responsibilities": "The Senior Demand Analyst is responsible for analysis and planning of finished good demand working closely with the commercial teams or customers to get market enrichment data to support statistical forecast models and the optimization of material stock levels. This critical role will be responsible for improving forecast accuracy in a complex and fast-moving organization providing operational insights through advanced data analytics.", "qualifications": {"required": "Strong proficiency in data analysis and visualization tools (e.g., Excel, Tableau, Power BI). Experience using ERP and CRM systems manipulating the inputs. Strong analytical and statistical skills with the ability to interpret data and trends effectively. Excellent communication and interpersonal skills to collaborate with various teams and present data effectively for top management. Detail-oriented with a focus on accuracy and precision. Ability to work in a fast-paced, dynamic environment and adapt to changing priorities. Knowledge of supply chain principles and practices.", "preferred": "Bachelor’s degree in business, statistics, supply chain management, or a relatable discipline. A combination of experience and education may be considered over a degree. A minimum of 5 years' experience working in a supply chain / operations / commercial related field focusing on demand and/or supply planning. APICS certification preferred."}, "skills": ["Excel", "Tableau", "Power BI", "ERP", "CRM", "Data Analysis", "Data Visualization", "Supply Chain Management", "Demand Planning", "Forecasting", "Communication", "Interpersonal Skills", "Problem Solving", "Analytical Skills", "Statistical Skills"], "postedDate": "2 weeks ago", "url": "https://www.linkedin.com/jobs/view/3992934072"}