{"jobTitle": "Sr. Manager, Supply Chain Logistics Pricing", "company": {"name": "VEYER", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Overview<br/><br/></strong>The Sr. Manager, Supply Chain Logistics Pricing is responsible for developing and executing comprehensive pricing strategies to optimize the financial performance and competitive positioning of our services.<br/><br/>This role involves setting strategic pricing policies, monitoring their implementation, and ensuring the company achieves desired margin dollars and return on investment.<br/><br/>The Pricing Manager plays a critical role in the bidding process, analyzing all incoming bids and providing data-driven insights to refine and enhance our cost models.<br/><br/>The role will work closely with cross-functional teams, including sales, operations, and finance, to ensure cohesive and effective pricing practices. Collaborate with these teams to understand client needs, market demands, and operational capabilities.<br/><br/><strong>Ideal candidates for this position will be located in one of the following states:<br/><br/></strong><ul><li>Florida</li><li>Georgia</li><li>North Carolina</li><li>South Carolina</li><li>Texas</li><li>Illinois </li><li>Remote: While this position does not currently require relocation, candidates within a radius of Boca Raton Headquarters will be required to work in the office a minimum of three days a week.<br/><br/></li></ul><strong>Primary Responsibilities<br/><br/></strong><ul><li>Pricing Strategy Development: Design and implement effective pricing strategies for all services offered, ensuring alignment with the company’s financial objectives and market conditions.</li><li>Margin and ROI Management: Continuously monitor and evaluate pricing execution to ensure the company meets its margin targets and achieves a satisfactory return on investment.</li><li>Bid Pricing: Manage the pricing of all incoming bids, ensuring accuracy, competitiveness, and alignment with strategic goals. This includes thorough analysis and cost estimation to support winning bids.</li><li>Analytical Support: Provide robust analytical support to enhance and improve cost models. Utilize data analytics to identify trends, forecast pricing impacts, and recommend adjustments to pricing strategies.</li><li>Market Analysis: Conduct regular market research and competitive analysis to stay informed about industry trends, pricing movements, and competitor strategies. Use this information to inform pricing decisions and strategies.</li><li>Collaboration: Work closely with cross-functional teams, including sales, operations, and finance, to ensure cohesive and effective pricing practices. Collaborate with these teams to understand client needs, market demands, and operational capabilities.</li><li>Reporting and Documentation: Maintain accurate records of pricing decisions, strategies, and performance metrics. Prepare regular reports for senior management to inform strategic decision-making.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Bachelor's degree in Supply Chain, Operations Research, Applied Mathematics, Industrial Engineering or equivalent experience.</li><li>A minimum of 6 years of expernce in Supply Chain, Operations Research, Applied Mathematics, Industrial Engineering.</li><li>Certifications: Data Modeling, Data Analysis, Mathematical Modeling, Optimization</li><li>Skills and Abilities:</li><ul><li>Detailed, full-cycle knowledge in key supply chain/logistics, network design, warehouse operations, and inventory management (e.g. variability, safety stock, GMROI, marginal revenue/cost, etc.) processes, current best practices and associated cost structures</li><li>Experienced process reengineering champion with multiple projects led that removed efficiencies and costs from the system (Six Sigma I Lean certification highly preferred)</li><li>Prior Sales or direct customer management, Merchandising and Marketing experience in product, placement, price and promotion, strongly preferred.<br/></li></ul></ul><strong>About The ODP Corporation</strong>: The ODP Corporation (NASDAQ:ODP) is a leading provider of products and services through an integrated business-to-business (B2B) distribution platform and omnichannel presence, which includes world-class supply chain and distribution operations, dedicated sales professionals, a B2B digital procurement solution, online presence, and a network of Office Depot and OfficeMax retail stores. Through its operating companies Office Depot, LLC; ODP Business Solutions, LLC; Veyer, LLC; and Varis, LLC, The ODP Corporation empowers every business, professional, and consumer to achieve more every day.<br/><br/><strong>Disclaimer</strong>: The above statements are intended to describe the general nature and level of work being performed by associates assigned to this classification and are not intended to be a complete list of all responsibilities, duties and skills required of associates so classified. Other duties may be assigned.<br/><br/><strong>Pay, Benefits &amp; Work Schedule: </strong>The company offers competitive salaries, a benefits package, which includes a 401(k) and more, along with plenty of opportunity to move and grow within our organization! For immediate consideration for this exciting position, please click the Apply Now button.<br/><br/><strong>How to Apply:</strong> Click the Apply Now button and follow the instructions on each page. When you have completed the application, click the submit button.<br/><br/><strong>Application Deadline</strong>: The job posting will remain open for a minimum of 3 days and will expire once the position has been filled.<br/><br/><strong>Equal Employment Opportunity</strong>: The company is committed to providing equal employment opportunities in all employment practices. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, citizenship status, marital status, age, disability, protected veteran status, sexual orientation or any other characteristic protected by law.<br/><br/>We will consider for employment qualified applicants with arrest and conviction records City &amp; County of San Francisco Fair Chance Ordinance.", "responsibilities": "The Sr. Manager, Supply Chain Logistics Pricing is responsible for developing and executing comprehensive pricing strategies to optimize the financial performance and competitive positioning of our services.<br/><br/>This role involves setting strategic pricing policies, monitoring their implementation, and ensuring the company achieves desired margin dollars and return on investment.<br/><br/>The Pricing Manager plays a critical role in the bidding process, analyzing all incoming bids and providing data-driven insights to refine and enhance our cost models.<br/><br/>The role will work closely with cross-functional teams, including sales, operations, and finance, to ensure cohesive and effective pricing practices. Collaborate with these teams to understand client needs, market demands, and operational capabilities.<br/><br/><strong>Ideal candidates for this position will be located in one of the following states:<br/><br/></strong><ul><li>Florida</li><li>Georgia</li><li>North Carolina</li><li>South Carolina</li><li>Texas</li><li>Illinois </li><li>Remote: While this position does not currently require relocation, candidates within a radius of Boca Raton Headquarters will be required to work in the office a minimum of three days a week.<br/><br/></li></ul><strong>Primary Responsibilities<br/><br/></strong><ul><li>Pricing Strategy Development: Design and implement effective pricing strategies for all services offered, ensuring alignment with the company’s financial objectives and market conditions.</li><li>Margin and ROI Management: Continuously monitor and evaluate pricing execution to ensure the company meets its margin targets and achieves a satisfactory return on investment.</li><li>Bid Pricing: Manage the pricing of all incoming bids, ensuring accuracy, competitiveness, and alignment with strategic goals. This includes thorough analysis and cost estimation to support winning bids.</li><li>Analytical Support: Provide robust analytical support to enhance and improve cost models. Utilize data analytics to identify trends, forecast pricing impacts, and recommend adjustments to pricing strategies.</li><li>Market Analysis: Conduct regular market research and competitive analysis to stay informed about industry trends, pricing movements, and competitor strategies. Use this information to inform pricing decisions and strategies.</li><li>Collaboration: Work closely with cross-functional teams, including sales, operations, and finance, to ensure cohesive and effective pricing practices. Collaborate with these teams to understand client needs, market demands, and operational capabilities.</li><li>Reporting and Documentation: Maintain accurate records of pricing decisions, strategies, and performance metrics. Prepare regular reports for senior management to inform strategic decision-making.<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree in Supply Chain, Operations Research, Applied Mathematics, Industrial Engineering or equivalent experience.<br/>A minimum of 6 years of expernce in Supply Chain, Operations Research, Applied Mathematics, Industrial Engineering.", "preferred": "Certifications: Data Modeling, Data Analysis, Mathematical Modeling, Optimization<br/>Skills and Abilities:<br/>Detailed, full-cycle knowledge in key supply chain/logistics, network design, warehouse operations, and inventory management (e.g. variability, safety stock, GMROI, marginal revenue/cost, etc.) processes, current best practices and associated cost structures<br/>Experienced process reengineering champion with multiple projects led that removed efficiencies and costs from the system (Six Sigma I Lean certification highly preferred)<br/>Prior Sales or direct customer management, Merchandising and Marketing experience in product, placement, price and promotion, strongly preferred."}, "skills": ["Supply Chain", "Operations Research", "Applied Mathematics", "Industrial Engineering", "Data Modeling", "Data Analysis", "Mathematical Modeling", "Optimization", "Six Sigma", "Lean", "Sales", "Customer Management", "Merchandising", "Marketing"], "postedDate": "2 weeks ago", "benefits": "The company offers competitive salaries, a benefits package, which includes a 401(k) and more, along with plenty of opportunity to move and grow within our organization!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3992280411"}