{"jobTitle": "Product Manager", "company": {"name": "MojoTech", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $155,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Software Development", "description": "<strong>Company Overview<br/><br/></strong>MojoTech, established in 2008, is a forward-thinking consultancy dedicated to engineering excellence. Our core mission revolves around fostering an engaging and productive environment, embracing sustainable practices, and driving client success through our expertise.<br/><br/><strong>What We Do<br/><br/></strong>Our 100% US-based team specializes in the design and development of fintech and financial services software. Our expertise caters to a diverse client base, ranging from rapidly growing startups to established enterprises, aiding them in accelerating their pace and making smarter technological advancements.<br/><br/><strong>Role Overview<br/><br/></strong>As a Senior Product Manager at MojoTech, you are at the forefront of product strategy, quality, and client satisfaction. You play a pivotal role, functioning as the primary liaison between our team and stakeholders, ensuring a seamless alignment of business goals and technology solutions.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Embrace and refine our clients' product visions, guiding them towards more precise and impactful directions.</li><li>Manage the full software development lifecycle, collaborating closely with engineers and designers to prioritize, plan, and execute high-quality software solutions.</li><li>Utilize your exceptional communication skills to advocate for realistic and effective solutions to a range of challenges across business, technical, and product domains.<br/><br/></li></ul><strong>Flexible Working Environment<br/><br/></strong>We offer a flexible working model, allowing employees to choose between remote work, on-site work in our offices located in Boulder, CO, and Providence, RI, or a hybrid of both, according to their preference.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Aid our clients in defining their product strategy by performing market and business analysis.</li><li>Understand the users of our client's products and the user needs through detailed interviews and analysis</li><li>Conduct discovery engagements for clients to identify, research, and mitigate product risks.</li><li>Lead design engagements, working with a team of talented product designers, by helping to create prototypes and other user tests required to get external feedback on product decisions.</li><li>Innovate and iterate on our software development processes while helping clients understand the value of agile development.</li><li>Breakdown higher level client goals and roadmaps into an actionable backlog of well-defined user stories.</li><li>Ensure we are shipping working software quickly through careful and deliberate prioritization.</li><li>Manage project's day-to-day operations including sprint planning, retrospectives, stand-ups, etc.</li><li>Track and report on budget and schedule internally and externally.<br/><br/></li></ul>Desired Skills &amp; Experience:<br/><br/><ul><li>4+ years of product management experience with B2C or B2B web and mobile apps</li><li>Skilled at defining and prioritizing product features</li><li>Strong leadership and communication skills and the capacity to teach others</li><li>Ability to work collaboratively with engineers, designers, and clients and navigate complex decision-making</li><li>Previous success with agile / lean methodology and working with an agile development team</li><li>Excellent organizational and time management skills</li><li>Background in engineering or design a plus<br/><br/></li></ul><strong>FinTech Experience Preferred<br/><br/></strong><ul><li>In-depth knowledge of various business models and their applications</li><li>Familiarity with user acquisition strategies and their impact on business performance</li><li>Experience in designing and implementing pricing strategies for products or services<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Base salary $120-155k</li><li>Performance based end of year bonus</li><li>Medical, Dental, FSA</li><li>401k with 4% match</li><li>Trust-based time off</li><li>Catered lunches when in office</li><li>5 hours a week of self-directed, non-client work</li><li>Dog Friendly Offices</li><li>Remote or in office (offices in Boulder, CO and Providence, RI)</li><li>Paid conference attendance/yearly education stipend</li><li>Custom workstation</li><li>6 weeks parental leave<br/><br/></li></ul>", "responsibilities": "<ul><li>Aid our clients in defining their product strategy by performing market and business analysis.</li><li>Understand the users of our client's products and the user needs through detailed interviews and analysis</li><li>Conduct discovery engagements for clients to identify, research, and mitigate product risks.</li><li>Lead design engagements, working with a team of talented product designers, by helping to create prototypes and other user tests required to get external feedback on product decisions.</li><li>Innovate and iterate on our software development processes while helping clients understand the value of agile development.</li><li>Breakdown higher level client goals and roadmaps into an actionable backlog of well-defined user stories.</li><li>Ensure we are shipping working software quickly through careful and deliberate prioritization.</li><li>Manage project's day-to-day operations including sprint planning, retrospectives, stand-ups, etc.</li><li>Track and report on budget and schedule internally and externally.<br/><br/></li></ul>", "qualifications": {"required": "4+ years of product management experience with B2C or B2B web and mobile apps, Skilled at defining and prioritizing product features, Strong leadership and communication skills and the capacity to teach others, Ability to work collaboratively with engineers, designers, and clients and navigate complex decision-making, Previous success with agile / lean methodology and working with an agile development team, Excellent organizational and time management skills, Background in engineering or design a plus", "preferred": "In-depth knowledge of various business models and their applications, Familiarity with user acquisition strategies and their impact on business performance, Experience in designing and implementing pricing strategies for products or services"}, "skills": ["Product Management", "Agile", "FinTech", "Software Development", "User Research", "Market Analysis", "Product Strategy", "Communication", "Leadership"], "postedDate": "1 week ago", "benefits": "<ul><li>Base salary $120-155k</li><li>Performance based end of year bonus</li><li>Medical, Dental, FSA</li><li>401k with 4% match</li><li>Trust-based time off</li><li>Catered lunches when in office</li><li>5 hours a week of self-directed, non-client work</li><li>Dog Friendly Offices</li><li>Remote or in office (offices in Boulder, CO and Providence, RI)</li><li>Paid conference attendance/yearly education stipend</li><li>Custom workstation</li><li>6 weeks parental leave<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3992676391"}