{"jobTitle": "Work from Home Area Sales (AVG First Year 75k-300k)", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Organization Description:<br/><br/>The Fitzgerald Agency is a national insurance and financial services agency. Our company was founded on the belief that everyone deserves financial coverage that allows them to live life to the fullest, while protecting their families when the unthinkable happens. We pride ourselves on embracing cutting-edge technology-driven solutions to assist our sales teams in providing a best-in-class customer experience.<br/><br/>Job Details:<br/><br/>This is a sales position with an incredible commission structure. Our agents protect families from financial hardship through life insurance solutions including: mortgage protection, disability, retirement protection, term life, and more. If you are new to this industry, we will provide you with the best training after you obtain the required Life and Health insurance licenses for your resident state (we will even help you obtain your license). This position is Commission Only, and requires NO cold-calling, NO door knocking, and NO begging for business. No high-pressure sales tactics are needed or allowed! This position is great for those who have a family, community, or other personal commitments that they need to keep while still having the ability to earn a six-figure income.<br/><br/>What you can expect from this position:<br/><br/><ul><li>Full-time or Part-time</li><li>Commission only</li><li>Work from home</li><li>Uncapped income</li><li>Work your own schedule</li><li>A comprehensive training platform designed to get you trained, working with clients, and making money within days, not weeks or months (after obtaining your license)</li><li>Access to highly subsidized, warm, high intent leads</li><li>Direct ongoing mentorship from our team of top-producing agents and advisors</li><li>No re-inventing the wheel. All scripts and systems are provided</li><li>Ability to earn 5% contract promotions every two months, production bonuses, multiple all-inclusive paid vacations based upon performance<br/><br/></li></ul>Responsibilities:<br/><br/>Our corporate office generates exclusive, qualified leads who have expressed interest in our products and services. It will be your responsibility to invest in the proper amount of leads required to meet your personal goals and convert them into clients through the following:<br/><br/><ul><li>Call leads</li><li>Schedule appointments (either through Zoom meetings, phone calls, or in-person meetings - entirely up to you)</li><li>Walk families through the coverage options</li><li>Help families submit applications for coverage</li><li>Get paid daily by insurance carriers</li><li>Life and Health Insurance license (we will help you get your license if you don’t have one already)</li><li>Must either have or be willing to obtain an active life and health insurance license within 10 days</li><li>Applicants must be coachable and willing to follow our proven sales system</li><li>Ideal candidates will be self-disciplined with scheduling and accomplishing tasks and goals</li><li>Moderate to High degree of computer proficiency</li><li>Must be willing to attend annual conferences and/or regional meetings for personal and professional development training<br/><br/></li></ul>Why Work Here?<br/><br/>Earn an amazing income while making a positive impact on your community. We’re an industry-leading company with great income potential, amazing company culture, and room for immense growth.<br/><br/>Disclaimer: No agent’s success, earnings, or production results should be viewed as typical, average, or expected. Not all agents achieve the same or similar results, and no particular results are guaranteed. Your level of success will be determined by several factors, including the amount of work you put in, your ability to successfully follow and implement our training and sales system and engage with our lead system, and the insurance needs of the customers in the geographic areas in which you choose to work.<br/><br/>Powered by JazzHR<br/><br/>qv17dDYRct", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3993265549"}