{"jobTitle": "Director of Global Partners and Channels", "company": {"name": "Phocas Software", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$130,000.00 - $150,000.00", "currency": "USD"}, "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "Applicants for the position must be located in PST**<br/><br/>\n<strong>Position Purpose<br/><br/></strong>The Director of Global Partner Alliances will lead the strategic vision and execution of our Global Channel Alliance program. This role is pivotal in driving the expansion and management of referral and reseller partnerships across global markets. The Director will oversee a team of Partner Alliance Managers, focusing on developing and executing field partner plans to foster new sales opportunities and achieve company revenue goals.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Leadership and Team Development{{:}}<br/><br/><ul><li>Hire, mentor, and coach a team of Partner Alliance Managers, fostering a high-performance and professional culture oriented around Phocas Values. </li><li>Oversee the development, and performance of the global Partner Alliance team, ensuring alignment with company objectives and individual growth goals<br/><br/></li></ul>Innovation and Program Development{{:}}<br/><br/><ul><li>Drive innovation within the partner program by developing and launching new initiatives, tools, and resources to enhance partner experience and performance. </li><li>Evaluate and refine partner programs and incentives to maximize their effectiveness and alignment with business objectives. <br/><br/></li></ul>Global Expansion and Integration{{:}}<br/><br/><ul><li>Lead efforts to expand partnerships into existing international markets, ensuring compliance with local regulations and cultural considerations. </li><li>Integrate new partners into existing frameworks, ensuring seamless collaboration and effective communication across diverse geographic regions. </li><li>Migrate existing partnerships to new models as needed. <br/><br/></li></ul>Cross-functional Collaboration and Feedback{{:}}<br/><br/><ul><li>Work closely with Product, Marketing, and Sales teams to ensure that partner programs are effectively supported and that partners have the tools and resources needed to succeed. </li><li>Facilitate cross-functional initiatives to drive joint partner-customer projects and case studies. </li><li>Collaborate with the Customer Success and Product teams to leverage partner insights and feedback, driving improvements in products and services. </li><li>Analyze partner performance data to identify patterns, opportunities, and areas for improvement, and adjust strategies accordingly. </li><li>Collaborate with Finance, Legal, and Ops to enable partner program performance and reporting. <br/><br/></li></ul>Executive Engagement and Strategy{{:}}<br/><br/><ul><li>Engage with executive leadership to report on global partnership performance, strategic initiatives, and alignment with corporate objectives. Provide actionable insights and recommendations based on partnership performance data. </li><li>Develop and present business cases for new partnership initiatives or adjustments to existing strategies to the executive team. <br/><br/></li></ul>Risk Management, Compliance, and Financial Oversight{{:}}<br/><br/><ul><li>Identify and manage potential risks related to global partner relationships, including changes in market dynamics, compliance with legal, regulatory, and contractual obligations. </li><li>Implement and oversee procedures to ensure partners adhere to company standards and policies. </li><li>Develop and manage the budget for the Global Partner Alliance program, ensuring effective allocation of resources and alignment with financial targets. </li><li>Monitor and analyze the financial impact of partner activities, ensuring profitability and cost-effectiveness. <br/><br/></li></ul>Thought Leadership and Representation{{:}}<br/><br/><ul><li> Represent the company at industry conferences, events, and forums, positioning the company as a thought leader in the partner and channel space. </li><li>Publish whitepapers, articles, and case studies highlighting successful partnerships and innovative approaches within the industry. <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Proven success in growing small channels into larger revenue streams. </li><li>Visionary leadership with experience managing global teams. </li><li>Minimum 10 years prior experience leading in Sales, Marketing or Partner management roles, ideally with software-based solutions and B2B environment. </li><li>Familiarity with accounting technology, system integrator and/or ERP partners and channels. </li><li>Track record of over-achieving quota in past positions. </li><li>Experience working with internal systems including CRM systems, PRM systems, coaching software, reporting software</li><li>Ability to travel 25-50% of the time (domestic &amp; international travel). <br/><br/></li></ul><strong>Qualification/Education Requirements<br/><br/></strong><ul><li>Bachelor's degree in Business/ Sales/ Marketing or equivalent </li><li>Master's Degree is ideal </li><li>Previous Sales Methodology (SPIN, Challenger, Force, MEDDPIC) training highly desired<br/><br/></li></ul><strong>Skills/Attributes<br/><br/></strong><ul><li>You love the thrill of the sales. </li><li>You like technology. </li><li>Possess an inquisitive nature to understand the customer's needs and wants and current situation. </li><li>Strong business acumen and common sense. </li><li>Good interpersonal skills - outgoing and personable. </li><li>Great communication skills - verbal, written, and presentation. <br/><br/></li></ul><strong>A bit about us{{:}}<br/><br/></strong>We're a business planning and analytics company on a mission to make people feel good about data. We've been hard at it for 20 years, helping 2,300 companies turn complex business data into performance boosting results. Despite our global status of 300 world-class humans, we've held on to our start-up roots. The result is a workplace that's fast, exciting and designed for fun.<br/><br/>Whether you want to try out new sales tactics, lead a project, champion wellness, or spend more with the kids, you'll have our full support. As long as you're doing what makes you happy, the rest falls into place.<br/><br/><strong>Create your happy place!!<br/><br/></strong><em>Compensation for the position depends on experience. A fully qualified candidate can expect a salary of between $130,000 and $150,000 with a commission plan<br/><br/></em><strong>Benefits<br/><br/></strong><ul><li>Health Care Plan (Medical, Dental &amp; Vision)</li><li>Retirement Plan (401k, IRA)</li><li>Life Insurance (Basic, Voluntary &amp; AD&amp;D)</li><li>Paid Time Off (Vacation, Sick &amp; Public Holidays)</li><li>Family Leave (Maternity, Paternity)</li><li>Short Term &amp; Long Term Disability</li><li>Training &amp; Development</li><li>Work From Home</li><li>Wellness Resources</li><li>Stock Option Plan<br/><br/></li></ul><em>We are a 2024 Circle Back Initiative Employer - we commit to respond to every applicant.<br/><br/></em><em>Phocas is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.<br/><br/></em>", "responsibilities": "The Director of Global Partner Alliances will lead the strategic vision and execution of our Global Channel Alliance program. This role is pivotal in driving the expansion and management of referral and reseller partnerships across global markets. The Director will oversee a team of Partner Alliance Managers, focusing on developing and executing field partner plans to foster new sales opportunities and achieve company revenue goals.", "qualifications": {"required": "Proven success in growing small channels into larger revenue streams. \nVisionary leadership with experience managing global teams. \nMinimum 10 years prior experience leading in Sales, Marketing or Partner management roles, ideally with software-based solutions and B2B environment. \nFamiliarity with accounting technology, system integrator and/or ERP partners and channels. \nTrack record of over-achieving quota in past positions. \nExperience working with internal systems including CRM systems, PRM systems, coaching software, reporting software\nAbility to travel 25-50% of the time (domestic & international travel). ", "preferred": "Bachelor's degree in Business/ Sales/ Marketing or equivalent \nMaster's Degree is ideal \nPrevious Sales Methodology (SPIN, Challenger, Force, MEDDPIC) training highly desired"}, "skills": ["Sales", "Marketing", "Partner Management", "Software", "B2B", "Accounting Technology", "System Integrator", "ERP", "CRM", "PRM", "Coaching Software", "Reporting Software"], "postedDate": "2 weeks ago", "benefits": "Health Care Plan (Medical, Dental & Vision)\nRetirement Plan (401k, IRA)\nLife Insurance (Basic, Voluntary & AD&D)\nPaid Time Off (Vacation, Sick & Public Holidays)\nFamily Leave (Maternity, Paternity)\nShort Term & Long Term Disability\nTraining & Development\nWork From Home\nWellness Resources\nStock Option Plan", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993625048"}