{"jobTitle": "Executive Assistant", "company": {"name": "Morgan Stanley", "location": "Manhattan, NY"}, "location": "Manhattan, NY", "jobType": "Full-time", "employmentType": "Temporary", "experienceLevel": "Associate", "salary": {"amount": "29.00/hr - 30.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Finance, and Strategy/Planning", "industry": "Financial Services, Investment Management, and Investment Banking", "description": "Description:\n<br/>\nRole is 5 days a week in office. There is no opportunity for remote working.\n<br/>\nThe Executive Assistant will be responsible for performing an array of administrative functions requiring confidentiality, initiative and sound decision making for the executive and his/her team. You will provide high-level administrative support by periodically providing research, preparing reports, handling information requests, and performing clerical functions such as preparing correspondence, receiving visitors, arranging conference calls, travel arrangements, and scheduling meetings.\n<br/>\nAdditionally, the ability to interact with staff (at all levels) in a fast-paced environment, remaining flexible, proactive, resourceful, and efficient, with a high level of professionalism is crucial to this role. You should demonstrate experience in developing relationships in a highly matrixed organization as well as experience in handling the administrative and executive support related tasks with minimal supervision. You will need to adapt procedures, processes, and techniques to the completion of assignments and in line with the department's activities and goals.\n<br/>\nQualifications\n- Minimum of 3 years of experience in an Executive Assistant role\n- High school diploma or GED is required; Bachelor's degree preferred\n- Being able to multi-task in a fast-paced environment\n- Experience in calendar and travel management\n- Adaptable team player\n- Good problem-solving ability\n- Strong working experience with Microsoft Word, Excel and PowerPoint, including table creation, mail merges and basic formatting\n- Knowledge of general office procedures (e.g., filing, correspondence, scheduling, expenses, calendar)\n- Effective interpersonal skills and excellent telephone etiquette\n- Superior oral and written communication skills\n- Tact and good judgment in confidential situations and proven experience interacting with senior management\n", "responsibilities": "The Executive Assistant will be responsible for performing an array of administrative functions requiring confidentiality, initiative and sound decision making for the executive and his/her team. You will provide high-level administrative support by periodically providing research, preparing reports, handling information requests, and performing clerical functions such as preparing correspondence, receiving visitors, arranging conference calls, travel arrangements, and scheduling meetings.", "qualifications": {"required": "Minimum of 3 years of experience in an Executive Assistant role, High school diploma or GED is required; Bachelor's degree preferred, Being able to multi-task in a fast-paced environment, Experience in calendar and travel management, Adaptable team player, Good problem-solving ability, Strong working experience with Microsoft Word, Excel and PowerPoint, including table creation, mail merges and basic formatting, Knowledge of general office procedures (e.g., filing, correspondence, scheduling, expenses, calendar), Effective interpersonal skills and excellent telephone etiquette, Superior oral and written communication skills, Tact and good judgment in confidential situations and proven experience interacting with senior management"}, "skills": ["Microsoft Word", "Excel", "PowerPoint", "Calendar Management", "Travel Management", "Problem Solving", "Communication"], "postedDate": "2 weeks ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993833724"}