{"jobTitle": "Recruiter", "company": {"name": "ActOne Group", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Administrative, Customer Service, and Human Resources", "industry": "Staffing and Recruiting", "description": "The ActOne Group has an amazing opportunity for a motivated and experienced Recruiter to join our dynamic National Accounts team. You will become a member of the business community’s global partner for forward-thinking talent and resource-management solutions. The ActOne Group is the largest privately held, woman and minority-owned workforce management company in the United States, operates in over 30 countries, and services over 17,000 clients.\n\nThis role is focused on the fast-paced, strategic delivery of non-IT contingent labor to National Accounts across a variety of industries and geographies. The position is responsible for developing, implementing, and managing strategies for recruitment, retention, and order fulfillment for multiple locations throughout the country; as well as providing comprehensive reporting validating the recruitment process and results. This person functions as the primary liaison between candidates/workers and corporate offices, MSP/VMO partners, and end clients. This person will oversee their daily operations to include job order fulfillment, contract compliance, relationship building, and best servicing strategies required by customers.\n\nWe are looking for a Recruiter who has experience recruiting for entry to senior level positions, from Receptionists, Fuilfillment Specialists and Call Center Agents to Accountants, Business Analysts, Executive Assistants, Program and Project Managers, Procurement and Supply Chain Specialists, etc. Although a good amount of this Recruiter's focus will be in the mid to high level positions, we need a multi-dimensional Recruiter... someone who CAN and WILL be able to fill entry to mid level positions (call center agents, receptionists, etc.).\n\nThis is a direct hire, base + commission position. Prefer candidates who can work PST or MST hours.\n\nDESCRIPTION OF ESSENTIAL DUTIES AND FUNCTIONS\n\n· Strategic implementation of best recruiting practices to ensure 100% job order fulfillment utilizing all tools, technologies, and resources and available to them\n· Source, recruit, and interview candidates via video\n· Manage all activities related to the operations and maintenance of active candidate inventory and passive candidate network\n· Meet ongoing Key Performance Indicators (KPIs) as required, both internal and client specific\n· Maintain a solid working knowledge of all clients & accounts assigned\n· Support and sustain a positive candidate relationship\n· Resolve candidate questions, suggestions, and grievances\n· Maintain consistent documentation of all fulfillment activity with detailed and accurate communications to candidates, workers, clients, partners, and colleagues\n· Research and reconcile timesheet discrepancies and/or missing timesheets to ensure accurate payroll and invoicing\n· Assist with driving and directing all national recruitment efforts and processes\n· Create and suggest new and effective interviewing, interview prepping and debriefing procedures and techniques\n· Create job postings for online job boards in a timely manner that will attract top talent\n\n\nREQUIRED QUALIFICATIONS:\n\n· 2+ years of recruiting experience (non IT, non Healthcare), within the staffing industry, with a proven track record of successfully recruiting for all types of clerical and business positions, across multiple industries.\n· Must have 2+ years of experience working with various VMS's\n· Excellent verbal and written communication skills\n· Effective recruiting skills with emphasis on volume and specialized recruitment\n· Confident, independent, and decisive capabilities as it relates to candidate evaluation\n· Strong attention to details and follow up skills\n· Full knowledge of end-to-end recruiting life cycle\n· Able to prioritize multiple tasks and action items without compromising service or quality\n· Ability to work with a sense of urgency while maintaining accuracy and process precision\n· Excellent computer skills, including Excel, Applicant Tracking System (ATS), and Vendor Management Systems (VMS) proficiency\n· Able to work both independently, with minimal supervision, and collaboratively\n· Able to successfully interface with all people internally and externally through various communication methods\n\nThe Company is proud to be an Equal Opportunity Employer. We believe in people, and we are committed to working with people of all backgrounds and connecting them with clients and companies who share our goals of diversity and inclusiveness. All qualified applicants will receive consideration for employment without regard to race, religion, ancestry, color, national origin, age, gender identity or expression, genetic information, marital status, medical condition, disability, protected veteran status, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable federal, state, or local laws.", "responsibilities": "· Strategic implementation of best recruiting practices to ensure 100% job order fulfillment utilizing all tools, technologies, and resources and available to them\n· Source, recruit, and interview candidates via video\n· Manage all activities related to the operations and maintenance of active candidate inventory and passive candidate network\n· Meet ongoing Key Performance Indicators (KPIs) as required, both internal and client specific\n· Maintain a solid working knowledge of all clients & accounts assigned\n· Support and sustain a positive candidate relationship\n· Resolve candidate questions, suggestions, and grievances\n· Maintain consistent documentation of all fulfillment activity with detailed and accurate communications to candidates, workers, clients, partners, and colleagues\n· Research and reconcile timesheet discrepancies and/or missing timesheets to ensure accurate payroll and invoicing\n· Assist with driving and directing all national recruitment efforts and processes\n· Create and suggest new and effective interviewing, interview prepping and debriefing procedures and techniques\n· Create job postings for online job boards in a timely manner that will attract top talent", "qualifications": {"required": "2+ years of recruiting experience (non IT, non Healthcare), within the staffing industry, with a proven track record of successfully recruiting for all types of clerical and business positions, across multiple industries.\n· Must have 2+ years of experience working with various VMS's\n· Excellent verbal and written communication skills\n· Effective recruiting skills with emphasis on volume and specialized recruitment\n· Confident, independent, and decisive capabilities as it relates to candidate evaluation\n· Strong attention to details and follow up skills\n· Full knowledge of end-to-end recruiting life cycle\n· Able to prioritize multiple tasks and action items without compromising service or quality\n· Ability to work with a sense of urgency while maintaining accuracy and process precision\n· Excellent computer skills, including Excel, Applicant Tracking System (ATS), and Vendor Management Systems (VMS) proficiency\n· Able to work both independently, with minimal supervision, and collaboratively\n· Able to successfully interface with all people internally and externally through various communication methods"}, "skills": ["Recruiting", "VMS", "Communication", "Candidate Evaluation", "Prioritization", "Computer Skills", "Excel", "ATS", "Vendor Management Systems"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3993671293"}