{"jobTitle": "Event Coordinator (REMOTE)", "company": {"name": "FeyerINC", "location": "North Las Vegas, NV"}, "location": "North Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "We are thrilled to welcome a creative and detail-oriented Remote Event Coordinator to our team. As a Remote Event Coordinator, you will play a pivotal role in conceptualizing, planning, and executing unforgettable events for our clients. This remote position offers the flexibility to work from anywhere while enjoying enticing travel perks, collaborating with diverse vendors, and benefiting from unlimited training opportunities to enhance your event planning expertise.<br/><br/>Responsibilities:<br/><br/><ul><li>Collaborate closely with clients to understand their event vision, goals, and preferences</li><li>Design and plan unique and memorable events, considering all aspects such as themes, venues, decor, entertainment, and logistics</li><li>Utilize your strong organizational skills to coordinate event schedules, timelines, and all necessary arrangements with precision</li><li>Maintain open communication with clients, ensuring their expectations are met and exceeded throughout the event planning process</li><li>Cultivate and maintain relationships with a diverse array of vendors, negotiating terms and securing services to enhance events</li><li>Stay current with event industry trends, emerging technologies, and innovative ideas to deliver exceptional event experiences</li><li>Participate in comprehensive training provided by the company to expand your event planning knowledge and skills</li><li>Troubleshoot and resolve any challenges that may arise before or during events, showcasing your problem-solving abilities<br/><br/></li></ul>Requirements:<br/><br/><ul><li>Must be at least 18 years old and authorized to work in the USA, Australia, Columbia, and Mexico</li><li>Possess a computer, smartphone, or tablet with reliable internet access to facilitate remote work tasks</li><li>Strong organizational capabilities, effective multitasking, and meticulous attention to detail</li><li>Exceptional interpersonal and customer service skills to build rapport with clients, vendors, and team members</li><li>Excellent written and verbal communication skills for seamless interaction and coordination</li><li>Self-discipline, a strong work ethic, and the ability to work autonomously while achieving deadlines</li><li>A passion for event planning and an eagerness to continuously learn and adapt in a dynamic industry<br/><br/></li></ul>Advantages:<br/><br/><ul><li>Experience the realm of event coordination with us, where prior experience is not required. Comprehensive training and opportunities for skill development will be provided</li><li>Seize unlimited training opportunities through various resources and tools, empowering you to stay updated with the latest event planning trends and techniques</li><li>Immerse yourself in a collaborative and supportive team environment, even in a remote setting, benefitting from collective knowledge and expertise</li><li>Embrace the flexibility to choose your work schedule—whether full-time or part-time—and work from your preferred location with internet connectivity</li><li>Shape your earning potential without sales quotas or income caps, enabling you to define your income based on dedication and performance</li><li>Indulge in substantial perks, including travel incentives from vendors and captivating gifts, enhancing the rewarding aspects of your role</li><li>This is a business opportunity and is commission based<br/><br/></li></ul>If you are passionate about crafting extraordinary event experiences, creating lasting memories for clients, and embracing a career filled with travel perks and training opportunities, we encourage you to apply.<br/><br/>Join our team of dedicated Remote Event Coordinators and embark on a journey that celebrates creativity, innovation, and the art of bringing exceptional events to life.<br/><br/>Powered by JazzHR<br/><br/>pkzsC88aFS", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3993395500"}