{"jobTitle": "Customer Service Representative", "company": {"name": "FashionPass", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "FashionPass is an online, subscription-based clothing and accessory rental service for women. We are revolutionizing the retail industry as we know it and we are on a mission to empower women to look and feel like the best version of themselves one outfit at a time.\n<br/>\nWe strive to bring an empathetic mindset to work everyday for the betterment of our entire community - our team members and customers. We are committed to building and growing empathetic leaders throughout the organization to continue to fuel our success and the development of our outstanding team members. From top to bottom, our team fosters a collaborative environment where we focus on getting it right rather than being right.\n<br/>\nWe're looking for a Customer Service Representative (at FashionPass we say Member Concierge Associate) who is eager to be part of a rapidly growing start up. At FashionPass, we believe in genuine, no BS customer service and treat our customers the same way we treat our best friends. As a Member Concierge Associate, you’ll work directly with our amazing clients to deliver an unparalleled renting experience. This position will report to our Director, Member Concierge.\n<br/>\n**What You'll Do:**\n<ul><li>Seamlessly navigate between multiple client interactions and internal systems, while working toward clearly defined goals</li><li>Provide friendly, personal and compassionate support that aligns with our company brand and voice, directly impacting our client retention</li><li>Be empowered to think outside of the box and deliver personalized solutions to each client</li><li>Identify opportunities and have the ability to impact how we evolve and continue to delight our clients</li><li>Manage genuine relationships with customers to ensure they receive high quality service</li><li>Provide styling advice and support based on members needs, fit, and lifestyle preferences</li></ul><br/>\n**Qualifications:**\n<ul><li>1+ years customer service/hospitality experience</li><li>Can-do attitude + a willingness to learn and take on new challenges</li><li>Excellent written and verbal communication skills</li><li>You are deeply passionate about being a client advocate; you're often told you have an amazing attitude and know exactly how to brighten someone's day</li><li>You are comfortable working across multiple communication channels (email, phone, chat, etc...)</li><li>You are a natural problem solver who is known for your creative solutions. You have great communication skills, and are able to effectively communicate with Management and co-workers</li><li>Most importantly you are kind, bright, and know how to hustle</li></ul><br/>\n**Compensation:**\n<ul><li>Full-Time position </li><li>Remote</li></ul><br/>\n**Benefits &amp; Perks:**\nHealth Benefits\n401(k)\nFashionPass Membership", "industry": "Retail Apparel and Fashion", "postedDate": "1 week ago", "benefits": "Health Benefits\n401(k)\nFashionPass Membership", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993647874"}