{"jobTitle": "VP / Sr. Director of Channel Partnerships", "company": {"name": "Get Well", "location": "Bethesda, MD"}, "location": "Bethesda, MD", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "130,000.00/yr - 180,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "<strong>Title: </strong>VP / Sr. Director of Channel Partnerships<br/><br/><strong>Reporting to: </strong>Chief Commercial Officer<br/><br/><strong>Location:</strong>This position can be based remotely. Up to 30% travel is required.<br/><br/><strong>Opportunity:<br/><br/></strong>As the lead for our Channel Partnership program, you will play a vital role in establishing and building Get Well’s channel partnership program, which will be established with the thesis of establishing channels in new markets and growing and nurturing our existing partner ecosystem. We are looking for a candidate who truly wants to build something special.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>As the Sr. Director of Channel Partner Manager, you will be responsible for developing, managing, and expanding relationships with our channel partners. These partnerships include reseller partners (VARs), referral partners, and product partners that provide critical capabilities to our existing technology</li><li>You will work closely with the entire Sales org (Sales leadership, Account Executives, and Sales Directors) to promote and achieve our revenue goals through indirect Sales channels</li><li>You will be responsible for working closely with your counterparts at partnered organizations to review strategy (Sales + Marketing), and sales pipeline, and ensure we are maximizing our relationship and partnership with these organizations</li><li>You willwork in close collaboration with the rest of the Partnerships organization (Strategic &amp; Technology Partnerships), as well as many teams at Get Well, including Partner Marketing, Sales, Success, Solutions and Enablement</li><li>Own strategy and vision for Channel Partnerships, ensuring channel partners get value from the Get Well’s ecosystem and resources</li><li>Support Channel Partner Managers in driving partner-sourced pipeline and revenue, from defining value propositions and objectives all the way to deploying a large variety of partnership strategies and tactics</li><li>Accelerate our partner acquisition strategy in collaboration with Partner Marketing, with a special emphasis on Tier 1 partners of HubSpot and Salesforce</li><li>Collaborate with Sales &amp; Success to successfully deliver on channel initiatives with our prospect and customers</li><li>Track, report, and optimize on activity, partner engagement, pipeline conversion, and revenue generation, and build forecasts for Channel Partnerships pipeline and revenue<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Ability to travel up to 30%</li><li>Bachelor’s degree in Business, Public Health or related field; MBA or Master’s is a plus</li><li>10+ years’ experience in client service, account management or sales in B2B commercial settings</li><li>Ability to collaborate on projects with a mix of remote and centrally located team members across time zones</li><li>Experience in a healthcare setting preferred</li><li>Familiarity with complex enterprise solutions (hardware, software, third party integrations both hardware and software), EMR or equivalent experience strongly preferred</li><li>Adhere to all organizational information security policies and protect all sensitive information, including but not limited to ePHI and PHI in accordance with organizational policy and Federal, State, and local regulations</li><li>U.S. citizenship or permanent residency required<br/><br/></li></ul><strong>About You:<br/><br/></strong><ul><li>A self-starter who thrives in an entrepreneurial, fast-paced environment</li><li>Exceptional motivator and communicator</li><li>Strong relationship builder who builds trust through relationships and inspires achievement through mentorship and guidance</li><li>Effective mentor/role model who also leads by example</li><li>Strong facilitation and influence skills, both internally and with clients</li><li>Knowledge of hospital clinical and business practices, and how to effectively navigate the dialogue around an enterprise solution</li><li>Demonstrated ability to drive client satisfaction, retention and growth</li><li>Strategic thinker, operational executor, and business mindset</li><li>Ability to prioritize, multi-task, and perform effectively under pressure</li><li>Ability to work independently while staying connected to the larger company strategy</li><li>Financial acumen to maintain and grow the assigned revenue; previous P&amp;L responsibility strongly preferred</li><li>Commercial acumen, understanding how to link expansion of products to the hospital/health systems strategic imperatives; keen in timing of offerings</li><li>Understands resource management</li><li>Systems thinker, able to navigate difficult situations</li><li>Demonstrated ability to pull together individuals with diverse skills and opinions and effectively create a unified support approach</li><li>Project management skill and effectively mobilizing support through others</li><li>Ability to effectively navigate and mediate conflict, and ability to foster honest dialogue</li><li>Demonstrated ability to lead through influence</li><li>Previous experience in a clinical setting, with direct experience in hospital operations and/or clinical experience a plus</li><li>Deep product and Get Well company knowledge is preferred<br/><br/></li></ul><strong>About Get Well:<br/><br/></strong>Now part of the SAI Group family, Get Well is redefining digital patient engagement by putting patients in control of their personalized healthcare journeys, both inside and outside the hospital. Get Well is combining high-tech AI navigation with high-touch care experiences driving patient activation, loyalty, and outcomes while reducing the cost of care. For almost 25 years, Get Well has served more than 10 million patients per year across over 1,000 hospitals and clinical partner sites, working to use longitudinal data analytics to better serve patients and clinicians. AI innovator SAI Group led by Chairman Romesh Wadhwani is the lead growth investor in Get Well. Get Well’s award-winning solutions were recognized again in 2024 by KLAS Research and AVIA Marketplace. Learn more at Get Well and follow-us on LinkedIn and Twitter.<br/><br/>When it comes to careers, our approach is simple: empower employees to do their best work and live their best professional and personal lives. Meeting the needs of a diverse group of employees across more than 30 states means offering tools to support financial, physical and emotional well-being and the choice to design what meets your needs. You’ll find everything you’d expect and many things you don’t: exceptionally generous paid time away from work, a variety of paid leave programs, savings opportunities with 401(k) and incentive plans, internal education programs, full array of health benefits, fitness reimbursement, cell phone subsidy, casual offices with snacks and drinks, peer recognition programs, health advocacy and employee assistance programs, chili cook-offs, pet insurance (yes, really) and so much more. Our most valuable benefit? An environment that supports YOU. The estimated pay range for this position is $130,000-$180,000 in base salary plus commission. Base salary is dependent on many factors including, but not limited to education, experience and skills. This range is subject to change and may be modified in the future.<br/><br/>Get Well is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status.<br/><br/>Powered by JazzHR<br/><br/>NVc4gSHb0Z", "responsibilities": "As the lead for our Channel Partnership program, you will play a vital role in establishing and building Get Well’s channel partnership program, which will be established with the thesis of establishing channels in new markets and growing and nurturing our existing partner ecosystem. We are looking for a candidate who truly wants to build something special.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>As the Sr. Director of Channel Partner Manager, you will be responsible for developing, managing, and expanding relationships with our channel partners. These partnerships include reseller partners (VARs), referral partners, and product partners that provide critical capabilities to our existing technology</li><li>You will work closely with the entire Sales org (Sales leadership, Account Executives, and Sales Directors) to promote and achieve our revenue goals through indirect Sales channels</li><li>You will be responsible for working closely with your counterparts at partnered organizations to review strategy (Sales + Marketing), and sales pipeline, and ensure we are maximizing our relationship and partnership with these organizations</li><li>You willwork in close collaboration with the rest of the Partnerships organization (Strategic &amp; Technology Partnerships), as well as many teams at Get Well, including Partner Marketing, Sales, Success, Solutions and Enablement</li><li>Own strategy and vision for Channel Partnerships, ensuring channel partners get value from the Get Well’s ecosystem and resources</li><li>Support Channel Partner Managers in driving partner-sourced pipeline and revenue, from defining value propositions and objectives all the way to deploying a large variety of partnership strategies and tactics</li><li>Accelerate our partner acquisition strategy in collaboration with Partner Marketing, with a special emphasis on Tier 1 partners of HubSpot and Salesforce</li><li>Collaborate with Sales &amp; Success to successfully deliver on channel initiatives with our prospect and customers</li><li>Track, report, and optimize on activity, partner engagement, pipeline conversion, and revenue generation, and build forecasts for Channel Partnerships pipeline and revenue<br/><br/></li></ul>", "qualifications": {"required": "Ability to travel up to 30%, Bachelor’s degree in Business, Public Health or related field; MBA or Master’s is a plus, 10+ years’ experience in client service, account management or sales in B2B commercial settings, Ability to collaborate on projects with a mix of remote and centrally located team members across time zones, Experience in a healthcare setting preferred, Familiarity with complex enterprise solutions (hardware, software, third party integrations both hardware and software), EMR or equivalent experience strongly preferred, Adhere to all organizational information security policies and protect all sensitive information, including but not limited to ePHI and PHI in accordance with organizational policy and Federal, State, and local regulations, U.S. citizenship or permanent residency required", "preferred": "Experience in a healthcare setting preferred, Familiarity with complex enterprise solutions (hardware, software, third party integrations both hardware and software), EMR or equivalent experience strongly preferred, Previous experience in a clinical setting, with direct experience in hospital operations and/or clinical experience a plus, Deep product and Get Well company knowledge is preferred"}, "skills": ["Sales", "Marketing", "Partnership", "Salesforce", "HubSpot", "Client Service", "Account Management", "EMR", "Healthcare", "Project Management", "Financial Acumen", "Commercial Acumen", "Resource Management", "Conflict Mediation", "Influence"], "postedDate": "1 week ago", "benefits": "When it comes to careers, our approach is simple: empower employees to do their best work and live their best professional and personal lives. Meeting the needs of a diverse group of employees across more than 30 states means offering tools to support financial, physical and emotional well-being and the choice to design what meets your needs. You’ll find everything you’d expect and many things you don’t: exceptionally generous paid time away from work, a variety of paid leave programs, savings opportunities with 401(k) and incentive plans, internal education programs, full array of health benefits, fitness reimbursement, cell phone subsidy, casual offices with snacks and drinks, peer recognition programs, health advocacy and employee assistance programs, chili cook-offs, pet insurance (yes, really) and so much more. Our most valuable benefit? An environment that supports YOU.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3993210547"}