{"jobTitle": "Call Center Customer Service Agent", "company": {"name": "Questify Fitness", "location": "Newark, NJ"}, "location": "Newark, NJ", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$850.00/wk - $1,250.00/wk", "currency": "USD"}, "jobFunction": "Other", "industry": "Wellness and Fitness Services", "description": "At Questify Fitness, we're not just a gym; we're your partner on your journey to a healthier, happier, and more vibrant life. Whether you're a seasoned fitness enthusiast or taking your first steps towards a healthier lifestyle, we're here to support you every step of the way.<br/><br/>We are currently seeking a motivated and detail-oriented individual to join our team as a Call Center Customer Service Agent. As a Customer Service Agent, you will be responsible for providing excellent customer service over the phone, addressing customer inquiries, solving problems, and ensuring customer satisfaction.<br/><br/>Pay Range: $850 - $1250 weekly<br/><br/>Full time<br/><br/>Key Responsibilities<br/><br/><ul><li>Answering incoming customer calls and addressing their inquiries or concerns</li><li>Providing accurate information and efficient solutions to customer questions or problems</li><li>Resolving customer complaints in a professional manner and escalating complex issues to the supervisor when necessary</li><li>Maintaining comprehensive knowledge of our products, services, pricing, and promotions</li><li>Processing customer orders, returns, and exchanges accurately and efficiently</li><li>Managing and updating customer accounts, including contact information and preferences</li><li>Utilizing company CRM software to document and track customer interactions and provide follow-up as necessary<br/><br/></li></ul>Skills, Knowledge And Expertise<br/><br/><ul><li>High school diploma or equivalent</li><li>Previous experience in customer service, preferably in a call center environment</li><li>Excellent verbal and written communication skills</li><li>Strong problem-solving abilities and the ability to think on your feet</li><li>Ability to work in a fast-paced, high-pressure environment</li><li>Proficiency in using customer service software, CRM systems, and Microsoft Office Suite</li><li>Strong attention to detail and accuracy</li><li>Ability to multitask and prioritize tasks effectively</li><li>Exceptional customer service skills and a friendly, positive attitude.<br/><br/></li></ul>Benefits<br/><br/><ul><li>Competitive salary</li><li>Health, dental, and vision insurance</li><li>Paid time off</li><li>401(k) plan</li><li>Opportunities for professional development</li></ul>", "responsibilities": "<ul><li>Answering incoming customer calls and addressing their inquiries or concerns</li><li>Providing accurate information and efficient solutions to customer questions or problems</li><li>Resolving customer complaints in a professional manner and escalating complex issues to the supervisor when necessary</li><li>Maintaining comprehensive knowledge of our products, services, pricing, and promotions</li><li>Processing customer orders, returns, and exchanges accurately and efficiently</li><li>Managing and updating customer accounts, including contact information and preferences</li><li>Utilizing company CRM software to document and track customer interactions and provide follow-up as necessary<br/><br/></li></ul>", "qualifications": {"required": "High school diploma or equivalent, Previous experience in customer service, preferably in a call center environment, Excellent verbal and written communication skills, Strong problem-solving abilities and the ability to think on your feet, Ability to work in a fast-paced, high-pressure environment, Proficiency in using customer service software, CRM systems, and Microsoft Office Suite, Strong attention to detail and accuracy, Ability to multitask and prioritize tasks effectively, Exceptional customer service skills and a friendly, positive attitude."}, "skills": ["Customer Service", "CRM", "Microsoft Office Suite"], "postedDate": "2 weeks ago", "benefits": "<ul><li>Competitive salary</li><li>Health, dental, and vision insurance</li><li>Paid time off</li><li>401(k) plan</li><li>Opportunities for professional development</li></ul>", "url": "https://www.linkedin.com/jobs/view/3994073459"}