{"jobTitle": "Supply Planning Manager, SIOP", "company": {"name": "Carrier", "location": "Palm Beach Gardens, FL", "industry": "Wholesale Building Materials"}, "location": "Palm Beach Gardens, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "Country<br/><br/>United States of America<br/><br/>Location: <br/><br/>CAF77: CCS - CIB 13995 Pasteur Blvd , Palm Beach Gardens, FL, 33418 USA<br/><br/>Carrier is the leading global provider of healthy, safe and sustainable building and cold chain solutions with a world-class, diverse workforce with business segments covering HVAC, refrigeration, and fire and security. We make modern life possible by delivering safer, smarter and more sustainable services that make a difference to people and our planet while revolutionizing industry trends. This is why we come to work every day. Join us and we can make a difference together.<br/><br/>About This Role<br/><br/>The <strong>Supply Planning Manager </strong>will be responsible for mid-long term supply plans that support demand requirements and are aligned to financial plans. You will oversee a SIOP supply planning process to optimize lead time, service and inventory levels. You implement medium and long-term supply chain strategies and networks that address capacity issues, continuity of supply, and inventory in support of business growth.<br/><br/>Key Responsibilities<br/><br/><ul><li>Oversees mid-long term supply planning activities including supply and demand balancing and long-term capacity planning.</li><li>Work closely with Demand and Supply Chain teams to translate and validate demand plans in a 3 to18 month horizon as part of an input to the monthly Executive SIOP while optimizing customer delivery and inventory levels</li><li>Identify key data needs, metrics, inputs that will help drive the correct business decisions in the overall SIOP process. Understand and communicate plan changes, risks and overall process performance</li><li>Spearhead monthly supply planning meeting with manufacturing locations and materials teams to ensure the supply plans are in line with the demand plan. Facilitate decisions around materials, equipment, labor and all other resources needed to support demand over the SIOP planning horizon</li><li>Collaborate with Sales, Demand Planning, Material Managers and Production Planning group to generate recommendations to solve capacity issues and support long term sales demand</li><li>Measure, analyze and report key SIOP supply metrics, while monitoring adherence to key performance indicators (KPIs)</li><li>Manage long-term rough-cut capacity views with scenario planning, being able to identify constraints and escalate exceptions for business consideration with the suggestion of possible scenarios and solutions.</li><li>Identify, resolve and escalate supply chain risks including but not limited to, production disruptions and inventory shortages</li><li>Provide regular updates on supply status, risks and opportunities to all key internal partners</li><li>Lead Inventory Management Process for designated BU. Collaborate with sites and business units to drive DIOH targets</li><li>Manage inventory of new and phase out products with key business partners via product life cycle management process</li><li>Play a key role to E&amp;O inventory reviews, root cause analysis and develop action plans to reduce excess inventory<br/><br/></li></ul>Required Qualifications<br/><br/><ul><li>Bachelor’s degree</li><li>6+ years of experience in Supply Chain functions of SIOP, Forecasting, Demand Planning, Supply Planning, Inventory Planning, Materials Management, Master Planning, or Scheduling<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>Bachelor’s degree in Business, Supply Chain, Industrial Engineering, Logistics,</li><li>Strong Working knowledge of S&amp;OE and S&amp;OP with implementation experience</li><li>MBA or master’s degree</li><li>Ability to build cross-functional relationships through strong communication and interpersonal skills.</li><li>Experience with inventory optimization.</li><li>Experience using and/or implementing advanced tools and system for planning and inventory management.</li><li>Advanced capability in Microsoft Excel and PowerPoint</li><li>Experience with MTO/ETO manufacturing environments<br/><br/></li></ul>RSRCAR<br/><br/><strong><strong>Carrier is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.<br/><br/></strong></strong>Job Applicant's Privacy Notice<br/><br/>Click on this link to read the Job Applicant's Privacy Notice<br/><br/>", "responsibilities": "Oversees mid-long term supply planning activities including supply and demand balancing and long-term capacity planning.Work closely with Demand and Supply Chain teams to translate and validate demand plans in a 3 to18 month horizon as part of an input to the monthly Executive SIOP while optimizing customer delivery and inventory levelsIdentify key data needs, metrics, inputs that will help drive the correct business decisions in the overall SIOP process. Understand and communicate plan changes, risks and overall process performanceSpearhead monthly supply planning meeting with manufacturing locations and materials teams to ensure the supply plans are in line with the demand plan. Facilitate decisions around materials, equipment, labor and all other resources needed to support demand over the SIOP planning horizonCollaborate with Sales, Demand Planning, Material Managers and Production Planning group to generate recommendations to solve capacity issues and support long term sales demandMeasure, analyze and report key SIOP supply metrics, while monitoring adherence to key performance indicators (KPIs)Manage long-term rough-cut capacity views with scenario planning, being able to identify constraints and escalate exceptions for business consideration with the suggestion of possible scenarios and solutions.Identify, resolve and escalate supply chain risks including but not limited to, production disruptions and inventory shortagesProvide regular updates on supply status, risks and opportunities to all key internal partnersLead Inventory Management Process for designated BU. Collaborate with sites and business units to drive DIOH targetsManage inventory of new and phase out products with key business partners via product life cycle management processPlay a key role to E&O inventory reviews, root cause analysis and develop action plans to reduce excess inventory", "qualifications": {"required": "Bachelor’s degree6+ years of experience in Supply Chain functions of SIOP, Forecasting, Demand Planning, Supply Planning, Inventory Planning, Materials Management, Master Planning, or Scheduling", "preferred": "Bachelor’s degree in Business, Supply Chain, Industrial Engineering, Logistics,Strong Working knowledge of S&OE and S&amp;OP with implementation experienceMBA or master’s degreeAbility to build cross-functional relationships through strong communication and interpersonal skills.Experience with inventory optimization.Experience using and/or implementing advanced tools and system for planning and inventory management.Advanced capability in Microsoft Excel and PowerPointExperience with MTO/ETO manufacturing environments"}, "skills": ["SIOP", "Forecasting", "Demand Planning", "Supply Planning", "Inventory Planning", "Materials Management", "Master Planning", "Scheduling", "S&OE", "S&amp;OP", "Inventory Optimization", "Microsoft Excel", "PowerPoint", "MTO/ETO"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994364481"}