{"jobTitle": "Office Administrator", "company": {"name": "Athena Club", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "40,000.00/yr - 50,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Manufacturing", "description": "Hi there, we're Athena Club! When it comes to women's health and body care, we've been given \"good enough\" for decades. But we're here to change that. Our mission is to create the highest-quality products that address women's health from a 360-degree perspective. We are growing rapidly and are looking for someone with an entrepreneurial mindset who thrives in a fast-paced environment.\n\nThe Role:\nAthena Club is looking for an Office Administrator to join our Operations team at our New York Headquarters. Reporting directly to the Head of Special Projects, this team member will be pivotal in maintaining the flow of daily operations and actively fostering an uplifting environment supporting the AC Team. The ideal candidate is self-motivated, trustworthy, can work with little supervision, and is excellent at organizing and prioritizing. This is an on-site position, Monday through Friday.\n\nResponsibilities:\n* Plan and execute office events, meetings, and team-building activities that nourish our vibrant company culture.\n* Provide administrative support to team members as needed.\n* Manage agendas, travel arrangements, and appointments.\n* Maintain office efficiency by promptly and courteously responding to team inquiries and requests.\n* Organize and manage office operations and procedures, including but not limited to record-keeping, supply management, and office aesthetics.\n* Serve as the primary contact for office duties including maintenance, mailing, supplies, equipment, and errands.\n* Manage relationships with vendors and service providers, ensuring that all items are invoiced and paid on time.\n* Negotiate contracts and pricing with office vendors and service providers.\n* Liaise with executives to aid in onboarding new hires, including setup of workstations and processing necessary paperwork.\n* Greet and attend to visitors and guests.\n\nRequirements:\n* Bachelor’s Degree or equivalent work experience.\n* Minimum of 1 year in office management, administrative, or assistant experience.\n* Exceptional time management skills and the ability to multi-task and prioritize work.\n* High attention to detail and problem-solving skills.\n* Excellent written and verbal communication skills.\n* Proficiency in MS Office Suite.\n* Familiarity with office management systems and procedures.\n* Thrive in a fast-paced start-up environment.\n\nThe (+) Extras\n* Medical insurance\n* Vision\n* Life + Disability\n* HSA or FSA\n* Commuter benefits\n* 401K\n\nJoin us in our journey to revolutionize women's health and body care products. If you're eager to make a tangible impact in a thriving startup environment, Athena Club awaits you.\n\nOur Commitment to Diversity, Equity, and Inclusion\nAt Athena Club, we are committed to cultivating an inclusive workplace that promotes and values diversity. We believe that achieving diversity goes beyond physical appearances or statistics. It is about building a culture that embraces the unique contributions of each individual. We strive to create an environment where everyone, from any background, can do their best work. We are dedicated to promoting equity and eliminating barriers that have traditionally divided us. By fostering an inclusive culture, we aim to empower all individuals to contribute their unique perspectives and capabilities in achieving our collective goals.\n\nSocial and Environmental Performance\nAt Athena Club, we are dedicated to being responsible stewards of both our community and the environment. Our commitment to social and environmental performance is integral to our mission of enhancing women’s health and well-being. Here’s how we ensure our practices align with our values:\n\nSustainability Initiatives:\n* We prioritize the use of sustainable materials in our products and packaging to minimize our environmental footprint.\n* Our supply chain partners are selected based on their adherence to environmentally friendly practices and their commitment to reducing carbon emissions.\n\nCommunity Engagement:\n* We actively engage with and support communities through partnerships and initiatives that promote health and wellness.\n* Our programs are designed to provide education and resources to underserved populations, ensuring that everyone has access to quality health and body care products.\n\nEthical Practices:\n* All our products are cruelty-free, and we are committed to ethical sourcing and manufacturing processes.\n* We ensure fair labor practices across our supply chain, guaranteeing safe and fair working conditions for all individuals involved in the production of our products.\n\nContinuous Improvement:\n* We continuously evaluate and improve our social and environmental impact, setting ambitious goals and transparently reporting our progress.\n* Feedback from our customers and stakeholders is vital in shaping our sustainability and community initiatives, ensuring that we remain accountable and responsive to their needs.\n\nJoin us at Athena Club as we strive to make a positive impact on the world, one high-quality product at a time.", "responsibilities": "Plan and execute office events, meetings, and team-building activities that nourish our vibrant company culture.\nProvide administrative support to team members as needed.\nManage agendas, travel arrangements, and appointments.\nMaintain office efficiency by promptly and courteously responding to team inquiries and requests.\nOrganize and manage office operations and procedures, including but not limited to record-keeping, supply management, and office aesthetics.\nServe as the primary contact for office duties including maintenance, mailing, supplies, equipment, and errands.\nManage relationships with vendors and service providers, ensuring that all items are invoiced and paid on time.\nNegotiate contracts and pricing with office vendors and service providers.\nLiaise with executives to aid in onboarding new hires, including setup of workstations and processing necessary paperwork.\nGreet and attend to visitors and guests.", "qualifications": {"required": "Bachelor’s Degree or equivalent work experience.\nMinimum of 1 year in office management, administrative, or assistant experience.\nExceptional time management skills and the ability to multi-task and prioritize work.\nHigh attention to detail and problem-solving skills.\nExcellent written and verbal communication skills.\nProficiency in MS Office Suite.\nFamiliarity with office management systems and procedures.\nThrive in a fast-paced start-up environment.", "preferred": null}, "skills": ["Office Management", "Administrative Support", "Time Management", "Multitasking", "Prioritization", "Problem Solving", "Communication", "MS Office Suite", "Office Management Systems"], "postedDate": "1 week ago", "applicationDeadline": null, "benefits": "Medical insurance\nVision\nLife + Disability\nHSA or FSA\nCommuter benefits\n401K", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994351021"}