{"jobTitle": "Customer Success Specialist", "company": {"name": "Besty AI", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Besty AI is the #1 fastest growing applied AI solution in the short-term rental market. In 10 short months, we've gone from 0 to 500+ users, managing 20,000+ properties globally. Our customers are property managers (think Airbnbs VRBO etc) who manage 2-2,000+ units.\n\nWe are seeking a passionate and dedicated Founding Customer Success Specialist to join our team. The ideal candidate will own the entire customer experience journey, ensuring customer satisfaction from initial contact through resolution. This role requires someone who is highly organized, empathetic, and possesses excellent communication skills. You will be responsible for responding to customer tickets, managing feedback, and working with various teams to enhance the overall customer experience.\n\n**Key Responsibilities:**\n\n* **Own the Customer Experience**: Take full ownership of the customer journey, ensuring a seamless and positive experience from start to finish.\n* **Respond to Customer Tickets**: Efficiently manage and resolve customer tickets through various channels (email, phone, chat) in a timely manner.\n* **Customer Communication**: Maintain clear, empathetic, and professional communication with customers throughout their journey.\n* **Feedback Management**: Collect, analyze, and act on customer feedback to continually improve the customer experience.\n* **Problem Resolution**: Identify, troubleshoot, and resolve customer issues promptly, escalating when necessary.\n* **Collaboration**: Work closely with other departments (e.g., product, marketing, sales) to address customer concerns and improve processes.\n* **Documentation**: Keep accurate records of customer interactions, issues, and resolutions.\n\n**Qualifications:**\n\n* **Communication Skills**: Excellent written and verbal communication skills.\n* **Problem-Solving**: Strong analytical and problem-solving skills with a customer-first mindset.\n* **Technical Proficiency**: Familiarity with customer service software and basic technical troubleshooting.\n* **Empathy**: Ability to understand and relate to customer needs and concerns.\n* **Team Player**: Collaborative attitude with the ability to work effectively in a team environment.\n* **Adaptability**: Ability to adapt to changing priorities and handle multiple tasks simultaneously.\n\nOur team is tripling in size over the next 6 months, so the role will evolve over time as the business grows.\n\nOpen to gradual hybrid/remote over the long-term for team members that show exemplary performance and autonomy in their role, but we want to work with people that want to work together in person to build something massive.\n\nThe purpose of this role is to come in with ambition and positivity, willingness to learn, and determination to help us reach our revenue growth targets together as a team.\n\nAfter applying, please feel free to send our cofounder Sam Dundas a direct message on linkedin sharing more about your experience working in customer service. It could be anything from experience at another startup to working at a restaurant. Would love to hear more about what motivates you and why you'd be excited to work in this intersection between AI and hospitality.\n\nLearn more about our product and customers here: getbesty.ai", "industry": "Software Development", "postedDate": "2 weeks ago", "skills": ["Communication", "Problem Solving", "Technical Proficiency", "Empathy", "Team Player", "Adaptability"], "url": "https://www.linkedin.com/jobs/view/3994903749"}