{"jobTitle": "Customer Support Specialist", "company": {"name": "Kira Learning", "industry": "Software Development", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "65,000 - 78,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Software Development", "description": "New York, NY<br/><br/>Customer Success /<br/><br/>Full-time /<br/><br/>On-site<br/><br/><strong>About Kira Learning<br/><br/></strong>Kira Learning is creating curriculum and learning tools that empower teachers and prepare students for a world in which technology and science play pivotal roles in everyone's lives. By way of our expert-backed content and intuitive, integrated teaching platform, Kira is intent on transforming the way computer science and artificial intelligence is taught and learned.<br/><br/>We are backed by top-tier Venture Capital funds including New Enterprise Associates (NEA) and Andrew Ng’s AI Fund.<br/><br/><strong> Overview: <br/><br/></strong>We’re looking for a Customer Support Specialist to provide best-in-class service to our team and our customers. As our Customer Support Specialist, you’ll be expected to answer a variety of questions from our customers across multiple platforms. We’re looking for someone who has strong communication skills (both written and verbal), and can effectively triage issues, resolve problems and provide a high quality customer experience, all in a timely manner. The ideal candidate is also highly goal-oriented and always hoping to hit or exceed KPIs.<br/><br/><strong>Responsibilities &amp; Duties<br/><br/></strong><ul><li>Provide prompt and professional customer support and constantly look for solutions to ensure customer satisfaction.</li><li>Communicate in a clear, concise, and empathetic manner with customers and manage expectations. </li><li>Maintain timely and accurate record keeping and contact database.</li><li>Ensure timely resolution of customer issues by meeting SLA requirements and prioritizing issues for escalation.</li><li>Monitor customer feedback and identify recurring issues to recommend improvements to products and services. </li><li>Participate in regular team meetings to share insights and updates on customers issues and feedback. Identify areas of concern with accounts and proactively build a strategy to improve their experience with support of the Customer Success team. </li><li>Act as the voice of the customer within the organization. Advocate for customer needs, provide feedback to product team, and collaborate with cross-functional teams to address customer concerns and deliver solutions that drive customer success. </li><li>Build the deep product knowledge needed to draft product education materials for our Knowledge Base. <br/><br/></li></ul><strong>Experience &amp; Skills<br/><br/></strong><ul><li>1+ years of experience in a support or customer facing role.</li><li>Familiarity with support ticketing systems like zendesk, Hubspot (preferred), SalesForce or freshdesk </li><li>Technical aptitude and ability to learn new software quickly</li><li>Experience effectively triaging issues and resolving problemsStrong verbal and written communication skills; you can patiently, professionally and effectively communicate with a diverse and multicultural group of peers across time </li><li>Highly organized. You keep track of needs and priorities across a wide customer base and can juggle competing priorities </li><li>Nimble and adaptable. Can roll with the punches and thrive in a fast-paced, early-stage startup environmentA positive, can-do attitude. You’re not deterred by minor setbacks and are able to swiftly overcome ambiguity</li><li>You believe feedback is a gift. You can thoughtfully share feedback to others as needed, and you can receive feedback and grow from it</li><li>Will consistently cultivate a culture of inclusion where all team members feel a sense of belonging and can bring their authentic selves to work</li><li>Strong proficiency in Google Workspace programs, Microsoft Office Suite<br/><br/></li></ul>$65,000 - $78,000 a year<br/><br/>Competitive salary ($65,000 - $78,000) and equity package in a well-funded, high growth company. Compensation is based on a number of relevant factors such as location, professional experience and related skill sets.<br/><br/>Flexible PTO<br/><br/>Paid parental leave<br/><br/>Top-notch medical, dental and vision coverage<br/><br/>Company 401(k) plan<br/><br/><strong>Background Check: </strong> Kira Learning will make a conditional job offer in line with local, state and federal laws, and a subsequent criminal, education, and employment history background check will then be issued.<br/><br/><strong>Equal Employment Opportunity Employer: </strong> At Kira Learning, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Kira believes that diversity and inclusion among our employees are critical to our success as a company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. Selection for employment is decided on the basis of qualifications, merit, and business need.", "responsibilities": "Provide prompt and professional customer support and constantly look for solutions to ensure customer satisfaction.\nCommunicate in a clear, concise, and empathetic manner with customers and manage expectations. \nMaintain timely and accurate record keeping and contact database.\nEnsure timely resolution of customer issues by meeting SLA requirements and prioritizing issues for escalation.\nMonitor customer feedback and identify recurring issues to recommend improvements to products and services. \nParticipate in regular team meetings to share insights and updates on customers issues and feedback. Identify areas of concern with accounts and proactively build a strategy to improve their experience with support of the Customer Success team. \nAct as the voice of the customer within the organization. Advocate for customer needs, provide feedback to product team, and collaborate with cross-functional teams to address customer concerns and deliver solutions that drive customer success. \nBuild the deep product knowledge needed to draft product education materials for our Knowledge Base.", "qualifications": {"required": "1+ years of experience in a support or customer facing role.\nFamiliarity with support ticketing systems like zendesk, Hubspot (preferred), SalesForce or freshdesk \nTechnical aptitude and ability to learn new software quickly\nExperience effectively triaging issues and resolving problemsStrong verbal and written communication skills; you can patiently, professionally and effectively communicate with a diverse and multicultural group of peers across time \nHighly organized. You keep track of needs and priorities across a wide customer base and can juggle competing priorities \nNimble and adaptable. Can roll with the punches and thrive in a fast-paced, early-stage startup environmentA positive, can-do attitude. You’re not deterred by minor setbacks and are able to swiftly overcome ambiguity\nYou believe feedback is a gift. You can thoughtfully share feedback to others as needed, and you can receive feedback and grow from it\nWill consistently cultivate a culture of inclusion where all team members feel a sense of belonging and can bring their authentic selves to work\nStrong proficiency in Google Workspace programs, Microsoft Office Suite"}, "skills": ["Customer Support", "Customer Service", "Communication", "Problem Solving", "Zendesk", "Hubspot", "Salesforce", "Freshdesk", "Technical Aptitude", "Google Workspace", "Microsoft Office Suite"], "postedDate": "1 week ago", "benefits": "Competitive salary ($65,000 - $78,000) and equity package in a well-funded, high growth company. Compensation is based on a number of relevant factors such as location, professional experience and related skill sets.<br/><br/>Flexible PTO<br/><br/>Paid parental leave<br/><br/>Top-notch medical, dental and vision coverage<br/><br/>Company 401(k) plan", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3994281613"}