{"jobTitle": "Product Manager, Live Fulfillment", "company": {"name": "Netflix", "location": "Los Angeles, CA", "industry": "Entertainment Providers"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$240,000 - $725,000", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.<br/><br/><strong>The Role<br/><br/></strong>We are looking for a Product Manager to advance the infrastructure and supporting products that help supply live content to our almost 260 members worldwide. The Live Fulfillment PM will lead the product vision and strategy for the systems and services that enable our production partners, broadcast engineering teams, and operational users around the world to setup, plan, transmit, validate and distribute live video, audio, and accessibility files in a variety of languages.<br/><br/>You’ll develop innovative solutions to further scale content delivery for live events, including products that manage live stream capacity scheduling, planning logistics, and remote monitoring, as well as solutions for contingency planning and fallback remediation for high-profile events. You’ll develop a long-term strategy and standardize alternative feed management and distribution, including solutions that allow us to scale real-time editorial and promotional workflows. You’ll partner closely with Production, Promotional Media, Marketing Technology, Globalization, and our Live Streaming Pipeline and Broadcast Technology teams.<br/><br/>This will be a remote-friendly role, with the freedom to set a flexible work-from-home schedule. This role would be best for candidates located in the Pacific time zone, as bi-monthly in-person travel may be necessary to collaborate with stakeholders and partners in Los Angeles, CA, and Los Gatos, CA. That said, we can always make exceptions in location for the right candidate.<br/><br/><strong>About Our Team<br/><br/></strong>Content Promotion &amp; Distribution (CPD) sits at the intersection of the consumer experience and the Netflix Studio. Our team is integral to making the Netflix experience feel personal and relevant by developing innovative approaches to how we catalog, promote, localize, and distribute content. Because our products touch both members and content creators, we seek someone who can fluidly move between both worlds, applying strong product principles and strategic frameworks to the member experience while deeply empathizing with the art and craft required to create great content.<br/><br/>We innovate on a portfolio of products, services, and data models responsible for the setup, preparation, fulfillment, and distribution of titles. Our goal is to make launching titles on Netflix as easy as pressing a button on your remote. We work with diverse and globally-distributed groups of business users and vendors. We also build the foundational capabilities and technology for the next generation of Netflix experiences, like games, ads, and live.<br/><br/>Our team’s primary superpower is the ability to work creatively and collaboratively in highly technical environments – from core services that power Netflix search and discovery to industry-leading content management platforms.<br/><br/><strong><strong>What You Will Do<br/><br/></strong></strong><ul><li>Devise and communicate a vision and strategy for the domain broadly throughout the organization. </li><li>Own the live fulfillment portfolio of products and infrastructure that manage live feeds and orchestrate live workflows from production to playback. </li><li>Develop and deliver a roadmap that balances the needs of our partner teams and prioritizes what is most impactful for our members and the business.</li><li>Lead cross-functional teams, including design, engineering, and data science, to discover and execute opportunities through automation, including transforming workflows using ML and AI.</li><li>Partner with different teams responsible for producing live events, including Studio Production, Product Discovery &amp; Promotions, Encoding Technologies.</li><li>Author strategy memos and presentations and represent your team’s work to senior executives.</li><li>Operate with true transparency and autonomy. Our culture is unique and is key to how we innovate.<br/><br/></li></ul><strong><strong>What We’re Looking For<br/><br/></strong></strong><ul><li>6+ years of experience as a Product Manager within live streaming and/or media systems with a proven record of successfully prioritizing, ideating, and launching impactful products and solutions.</li><li>Exceptional analytical skills and ability to balance short-term goals and long-term vision. Deep experience using data and metrics to influence business decisions, inform priorities, and evaluate impact of initiatives.</li><li>Ability to inspire, motivate, and lead a cross-functional team - your ability to build strong relationships is critical to success.</li><li>A passion for live infrastructure and a deep technical acumen for how live content is produced, transmitted, and distributed - your innovative mindset will elevate our live content pipelines. </li><li>Demonstrated experience working effectively across different production and technical teams and with live streaming engineers, data scientists, machine learning engineers, etc. </li><li>Excellent communication skills; timely communication with clear expectations whether in written documents, small group discussions, large-scale presentations, or to executives. </li><li>An ideal candidate is a highly motivated, self-starter with the ability to work independently and drive alignment amid ambiguity<br/><br/></li></ul>Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $$240,000 - $725,000<br/><br/>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br/><br/>Netflix is a unique culture and environment. Learn more here<br/><br/>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.<br/><br/>Job is open for no less than 7 days and will be removed when the position is filled.", "responsibilities": "Devise and communicate a vision and strategy for the domain broadly throughout the organization. \nOwn the live fulfillment portfolio of products and infrastructure that manage live feeds and orchestrate live workflows from production to playback. \nDevelop and deliver a roadmap that balances the needs of our partner teams and prioritizes what is most impactful for our members and the business.\nLead cross-functional teams, including design, engineering, and data science, to discover and execute opportunities through automation, including transforming workflows using ML and AI.\nPartner with different teams responsible for producing live events, including Studio Production, Product Discovery &amp; Promotions, Encoding Technologies.\nAuthor strategy memos and presentations and represent your team’s work to senior executives.\nOperate with true transparency and autonomy. Our culture is unique and is key to how we innovate.", "qualifications": {"required": "6+ years of experience as a Product Manager within live streaming and/or media systems with a proven record of successfully prioritizing, ideating, and launching impactful products and solutions.\nExceptional analytical skills and ability to balance short-term goals and long-term vision. Deep experience using data and metrics to influence business decisions, inform priorities, and evaluate impact of initiatives.\nAbility to inspire, motivate, and lead a cross-functional team - your ability to build strong relationships is critical to success.\nA passion for live infrastructure and a deep technical acumen for how live content is produced, transmitted, and distributed - your innovative mindset will elevate our live content pipelines. \nDemonstrated experience working effectively across different production and technical teams and with live streaming engineers, data scientists, machine learning engineers, etc. \nExcellent communication skills; timely communication with clear expectations whether in written documents, small group discussions, large-scale presentations, or to executives. \nAn ideal candidate is a highly motivated, self-starter with the ability to work independently and drive alignment amid ambiguity"}, "skills": [], "postedDate": "1 week ago", "benefits": "Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3995359224"}