{"jobTitle": "Customer Care Representative", "company": {"name": "Integra Connect", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$15.00/yr - $18.00/yr", "currency": "USD"}, "jobFunction": "Administrative and Customer Service", "industry": "Hospitals and Health Care and Technology, Information and Media", "description": "<strong>Job Summary:</strong>\n<p>The Representative, Customer Care is responsible for handling customer telephone calls, both incoming and out-going as well as communication through fax, email, and mail. Incumbent is responsible for establishing the means by which an account will be paid, by either a third-party payer (insurance) or recommending an available payment plan or discount to the caller, if applicable.</p>\n<p><br/></p>\n<p><strong>Responsibilities:</strong></p>\n<p><br/></p>\n<ul><li>Answer incoming /outbound customer service telephone calls, verify and updating account demographics and taking appropriate action within the billing system to resolve the account/accounts during the initial (first) contact, while adhering to Compliance/HIPAA regulations and internal protocols.</li><li>Maintain a courteous and professional demeanor. Answer questions, process information obtained from the caller and process customer complaints appropriately within the AR management system.</li><li>Review recorded comments about the patient's account, and understand the trip's information, and billing history to provide guidance to the caller regarding past events.</li><li>Input information obtained and enter comments relating to an account and call into the AR management system.</li><li>Inbound/outbound call audits must score a minimum of 95% overall passing score, and an individual audit must score a minimum of 90%.</li><li>Reviews correspondence received by mail, by e-mails or through the website and take appropriate research and follow-up steps for resolution.</li><li>Assist with account billing review and follow-up on private pay billing plans and private pay aging.</li><li>Familiarize and follow corporate policy and procedures.</li></ul>\n<p><br/></p>\n<p><strong>Qualifications:</strong></p>\n<ul><li>High school diploma/GED</li><li>1 year of customer service or sales experience.</li><li>Type 40 wpm.</li><li>Demonstrated effective verbal and written communication skills.</li><li>Knowledge of medical billing processes/or health care billing guidelines is strongly preferred.</li><li>Pleasant Telephone etiquette.</li><li>Have a customer focused mindset.</li><li>General working knowledge of PCs and/or patient accounting computer systems. Working knowledge of Microsoft Word and Excel for Windows.</li><li>Able to handle a large volume of work.</li><li>Organized and detail oriented with ability to prioritize and perform multiple tasks at once.</li><li>Have a customer focused mindset.</li><li>General working knowledge of PCs and/or patient accounting computer systems. Working knowledge of Microsoft Word and Excel for Windows.</li></ul>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Benefits:</strong></p>\n<p><em>Integra Connect, LLC provides a comprehensive benefits plan</em></p>\n<ul><li>Medical/Dental/Vision Insurance beginning the 1st of the month following your date of hire</li><li>Paid Time Off</li><li>401k with employer match</li><li>Paid Holidays and Floating Holiday</li></ul>\n<p><em>Equal Opportunity Employer</em></p>\n<p><br/></p>\n<p><br/></p>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Please note that the deadline for submitting applications is September 7th, 2024. All applications must be received by this date to be considered.</strong></p>\n<p><br/></p>\n<p><br/></p>\n<p><br/></p>\n<p><br/></p>\n<p><strong>Important Notice:</strong></p>\n<p>At Integra Connect, we are committed to providing a safe and secure environment for our job applicants. Unfortunately, scammers may attempt to impersonate our company to deceive individuals seeking employment. We take this matter seriously and want to ensure your job search with us is free from any fraudulent activity.</p>\n<p>Integra Connect has become aware of recent, fraudulent recruitment activity being conducted by individuals or groups who claim to be third party recruiters and/or points of contact for our Company. Examples include sending candidates a request for personal information, conducting online interviews or meetings, making offers of employment, demanding money for employment related services and activities, or asking the applicant to purchase a laptop or other work-related equipment for the job. The aim of the fraud is to obtain personally identifying information (<em>e.g</em>., identity theft) and/or money. The Company’s name, as well as the names of employees, are used to try to convey authenticity.</p>\n<p>Here are some tips to help you identify and avoid job scams:</p>\n<p>1. Always Check the Source:</p>\n<p>Ensure that the job listing is on our official website or a reputable job board. Our official domain is https://www.integraconnect.com/resources/careers/. Be cautious of unsolicited emails, text messages, or social media messages offering job opportunities.</p>\n<p>2. Be Wary of Requests for Personal Information:</p>\n<p>We will never request sensitive personal information like your Social Security number, bank details, or payment for onboarding/equipment. If you encounter such requests, it's likely a scam.</p>\n<p>3. Verify Contact Information:</p>\n<p>Check that the contact information provided in the job posting, including email addresses and phone numbers, aligns with our official contact information. Scammers often use generic or non-company email addresses.</p>\n<ul><li>What is the sender’s email address? Is it consistent with other job postings from this company? Email addresses that are slightly different from any business’s primary contact information (Jane.Doe@IntegraConnect.org vs John.Doe@Integra Connect.com) are a common warning sign.</li><li>If you are contacted through LinkedIn, be sure to review the entire profile to verify their credentials.</li></ul>\n<p>If you suspect that a job offer is fraudulent, we recommend that you do not respond to it.</p>\n<p>If you believe you are the victim of any fraudulent activity, you can report it to the appropriate authorities at https://www.myfloridalegal.com/consumer-protection/how-to-protect-yourself-job-listing-and-job-search-firms (Florida Department of State) and/or https://consumer.ftc.gov/articles/job-scams#report (U.S. Federal Trade Commission).</p>\n<p>Integra Connect is not responsible for any fraudulent offers and advises prospective candidates to follow the guidance provided above.</p>\n<p>Thank you for your interest in a career with Integra Connect. We look forward to connecting with genuine, talented individuals like you.</p>\n<p></p>", "responsibilities": "The Representative, Customer Care is responsible for handling customer telephone calls, both incoming and out-going as well as communication through fax, email, and mail. Incumbent is responsible for establishing the means by which an account will be paid, by either a third-party payer (insurance) or recommending an available payment plan or discount to the caller, if applicable.", "qualifications": {"required": "High school diploma/GED, 1 year of customer service or sales experience., Type 40 wpm., Demonstrated effective verbal and written communication skills., Pleasant Telephone etiquette., Have a customer focused mindset., General working knowledge of PCs and/or patient accounting computer systems. Working knowledge of Microsoft Word and Excel for Windows., Able to handle a large volume of work., Organized and detail oriented with ability to prioritize and perform multiple tasks at once., Have a customer focused mindset., General working knowledge of PCs and/or patient accounting computer systems. Working knowledge of Microsoft Word and Excel for Windows.", "preferred": "Knowledge of medical billing processes/or health care billing guidelines"}, "skills": ["Customer Service", "Sales", "Communication", "Microsoft Word", "Microsoft Excel", "Telephone Etiquette", "Medical Billing", "Healthcare Billing"], "postedDate": "4 days ago", "benefits": "Integra Connect, LLC provides a comprehensive benefits plan\nMedical/Dental/Vision Insurance beginning the 1st of the month following your date of hire\nPaid Time Off\n401k with employer match\nPaid Holidays and Floating Holiday\nEqual Opportunity Employer", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3995579395"}