{"jobTitle": "InFlight Dining & Logistics Regional Manager (NJUS)", "company": {"name": "NetJets", "location": "West Palm Beach, FL"}, "location": "West Palm Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Airlines and Aviation and Aviation and Aerospace Component Manufacturing", "description": "<strong>Purpose of Position<br/><br/></strong>The InFlight Dining &amp; Logistics, Regional Manager is responsible for overseeing daily catering logistics operations and management of supplier performance for their assigned territory. Reporting to and collaborating with the NetJets Quality &amp; Standards Executive Chef, the InFlight Dining &amp; Logistics Regional Manager will continuously improve and execute an inflight catering supply chain strategy to elevate the NetJets InFlight Dining experience from infancy to execution. Through ongoing process, standards, and training improvement with the Quality &amp; Standards Executive Chef; the InFlight Dining &amp; Logistics Regional Manager will ensure execution throughout the supplier network from the supplier's kitchen through product delivery to our Owners and Crewmembers. Responsibilities will include safety compliance and quality auditing, training execution, supplier performance management, supply chain process solutions, and new initiative support. The InFlight Dining &amp; Logistics, Regional Manager will support the overall mission of the InFlight Dining strategy and successful delivery of catering for Owners and Crewmembers.<br/><br/><strong>Tasks And Responsibilities<br/><br/></strong><ul><li>Regional management of all catering suppliers within their respective territories </li><li>Development and enforcement of processes to ensure quality control and consistency within our daily operations and throughout the entire supply chain</li><li>Supplier management including supplier training, compliance, auditing, coaching, and development. This will include on-site support for suppliers when needed </li><li>Maintain an intimate knowledge of the aviation catering food and beverage supplier market, Proactively identifying efficiencies associated with all products and ingredients required to execute the NetJets InFlight Dining mission: providing unmatched cuisine and dining experiences at an exceptional value through a commitment to safety, quality, effective communication, performance excellence, process efficiency, and continuous improvement</li><li>Operate as a brand ambassador for the NetJets InFlight Dining program; providing knowledge and guidance to ultimately foster positive working relationships throughout our supplier network in an effort to drive accountability and quality on a daily basis</li><li>Partner with the Quality and Standards Executive Chef to evaluate product delivery for consistency; taking aesthetics, plating, quantity, and more into consideration</li><li>Using analyzed data and a defined strategy, provide proactive feedback to suppliers based on established requirements, specifications, and expectations set by Quality and Standards Executive Chef <br/><br/></li></ul><strong>Education<br/><br/></strong>Bachelor's in Hospitality<br/><br/><strong>Certifications and Licenses<br/><br/></strong><strong>Years Of Experience<br/><br/></strong>4-6 years of experience<br/><br/><strong>Core Competencies<br/><br/></strong>Service-Oriented<br/><br/>Curiosity<br/><br/>Collaboration<br/><br/>Adaptability<br/><br/>Strives For Positive Results<br/><br/><strong>Knowledge, Skills, Abilities And Other (KSAOs)<br/><br/></strong><ul><li>Ability to collaborate with multiple teams in complex operations</li><li>Demonstrated ability to solve complex problems</li><li>Inventory management experience</li><li>Ability to develop and manage training materials </li><li>Proven supplier management skills </li><li>In-depth understanding of business aviation &amp; associated operations</li><li>Demonstrated leadership skills with excellent interpersonal, oral, and written communication skills</li><li>Strong ability to successfully execute projects and programs</li><li>Excellent organizational skills and attention to detail</li><li>Ability to travel on a frequent basis 50-75%</li><li>Proficient with Microsoft Office Suite or related software</li><li>Culinary experience preferred but not mandatory</li><li>ServSafe Management certification preferred, obtained within 90 days of start date</li></ul>", "postedDate": "1 week ago", "skills": ["Inventory Management", "Supplier Management", "Training", "Communication", "Leadership", "Project Management", "Organizational Skills", "Microsoft Office", "Culinary", "ServSafe Management"], "url": "https://www.linkedin.com/jobs/view/3995977815"}