{"jobTitle": "Senior Director, AWS Strategic Alliance Partnerships", "company": {"name": "Rackspace Technology", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "IT Services and IT Consulting", "description": "Provides leadership, direction, and development for strategic partner alliances, driving relationship and  revenue growth between Rackspace and the AWS strategic alliance partnership. Collaborates with partner and internal  stakeholders to define and develop strategic alliance growth strategies and execute plans and programs  in support of strategic objectives. Owns the relationship with the Alliance partner, developing shared  support and eco-systems that drive positive mutual business outcomes.", "responsibilities": "Careel Level Summary\nEstablishes departmental goals and objectives ensuring alignment with business unit and  corporate strategic plans. • Role is engaged in leadership and strategy 100% of time. • Directs the activities of one or more broad functional areas. • Direct reports are directors, managers and/or senior managers. \nCritical Competencies\nStrategic Agility \nIs recognized as a savvy business leader, able to engage and hold credible commercial  and product/portfolio conversations that positively challenge and influence operational  board level decisions\nFilters various sources of information into functional strategic plans that deliver sustainable  growth and commercial competitive advantage for the business. \nInterprets multiple commercial concepts simultaneously and quickly filters relevant  information needed to make decisions that impact at marketplace and organizational  levels. \nSwitches between analytical thinking and creative problem solving, identifying trends,  needed outcomes and synergized solutions across multiple functions. \nUnderstands current and possible trends affecting the marketplace and adjusts/course  corrects strategy based on cross functional and organizational opportunities that maximize  collective results. \nDrive for Results \nCollaboratively develops the functional long-term plans needed to achieve divisional and  enterprise strategy, allowing team members to own the detail. Holds self and team  accountable for high performance. \nQuickly adopts new ways of thinking and leadership styles that lend to getting the best  results out of direct reports, teams, and C-Suite leaders. \nRegularly collaborates with “First Team” on anticipated resource needs, within and across  teams, based on business trends, and openly negotiates resources for growth/savings  opportunities. \nBuilds enthusiasm for enterprise change and coaches and enables leaders in effective  engagement strategies appropriate for a highly dynamic business. \nAligns functional dashboard that includes multiple team deliverables to divisional  measures of success, enabling early detection of risks and opportunities. \nCommunication \nAble to tell the Rackspace story and how we serve the marketplace to C- Suite audiences  using in-depth commercial business explanation and insight. Ignites passion across the function by communicating an inspiring vision and mission that  harnesses internal business dynamics and mobilizes Rackers, customers and partners in  a shared direction\nIlluminates company issues through effective storytelling, filtering appropriate information  to teams, peers and senior departmental leaders, and investing time in ensuring  messages are clearly understood. Ensures leaders role model high say-do ratio and holds others accountable for doing the  same. \nConfidently uses industry and business expertise to field and answer questions from  Rackers, customers, and vendors, remaining composed and articulate when pressed. \nGrowth Orientation \nDemonstrates strong self-awareness of capabilities as a leader of a department, regularly  gathering and acting upon feedback that strengthens leadership and commercial acumen. \nExhibits a growth mindset, role modeling the ability to shift ways of thinking and behaving  that drives necessary change. \nHolds self and direct reports accountable for developing Rackers across the function and  organization, allocating resources, actively identifying opportunities and serving as mentor  and coach. \nChallenges mindsets regarding what top talent looks like and is known for creating  opportunities for diverse talent to thrive and grow in the department. \nSets clear expectations of managers to prioritize learning as essential to organizational  success in order to anticipate and pivot in a continuously changing business environment. \nRelationship Building \nStrategically applies the most appropriate leadership style to influence, build partnerships,  and achieve mutual benefit. \nCreates an environment of trust by empowering team to follow through, leveraging  individual strengths, and expecting a duty of care for others. \nRole models and actively coaches direct reports in having courageous conversations in  order to gain resolution from all parties involved. \nSets partners and customers up for success, leveraging business experience and track  record to openly negotiate win-win solutions. \nBuilds comprehensive functional and industry networks, acting as a persuasive business  partner to strengthen Rackspace’s brand and reap clear business benefits. \nCollaboration \nStands behind the goals of the wider team and effectively leads brainstorming that  encourages a collective picture to play out. \nDemonstrates care and wider accountability for the goals of the team they belong to as  well as the team they lead. \nPrioritizes resources as a collective and allocates based on “First Team” imperatives,  articulating associated business benefits of these decisions to teams they lead. \nProactively learns peers’ business in order to set shared objectives that ensure the  achievement of the broader team’s goals. \nProvokes healthy debate and includes input in making hard decisions that rises above the  demands of one and strives for an optimal solution for the team and organization. Key Responsibilities \nProvides thought leadership and drives the utilization of best practices in the development,  implementation, and delivery of strategic alliance programs, education, and marketing activities. \nDevelops deep relationship with alliance executives and collaborates to develop strategies to  increase revenue through the alliance partnership. \nPursues global consistency in the growth and development of the alliance partnership. \nCollaborates with alliance operations and marketing to deliver effective programs. \nUnderstands the alliance product set and acts as an advocate for Rackspace in the product  development and delivery roadmap. \nOversees product enhancement and development teams for Alliance product sets. \nCollaborate with sales leadership to ensure go-to-market and Alliance program activities align to  the goals and objectives of the alliance partnership and the sales organization. \nOversees the development and delivery of educational and knowledge-sharing programs to  increase sales force knowledge of alliance products and strategies and associated sales  programs. \nExpert and thought leader on strategic alliance partner, driving deep relationships that provide  mutually beneficial revenue growth opportunities. \nDrives global alignment and consistency in the strategic partner ecosystem for sales development  and lead generation activities. \nDevelops, modifies and executes policies that have a company-wide effect. \nDevelops and administers departmental budget and schedules. \nAccountable for the performance and results of one or more of the following: \nA large strategically important function in an extremely large market \nDiverse disciplines within a large geography or division \nA large, strategically important discipline within a major region \nA medium sized global corporate discipline \nLeads a department towards strategic goals and objectives. \nProvides strategic planning for the department and contributes to strategic planning for the  division. \nDevelops, adapts and executes strategies to achieve key business objectives in area of  responsibility. \nDevelops, modifies and executes policies that have a company-wide effect. \nDevelops and administers departmental budget and schedules. \nConsistently works with abstract ideas or situations across functional areas of the business. \nErroneous decisions will have a long-term effect on the company's success. \nRegularly interacts with executives and intervenes with major customers when necessary. \nWorks with and influences senior leadership to develop and implement strategic objectives. \nActs as a servant-leader. Inspires others to creativity and autonomy. \nInfluences Senior Leadership on business decisions\nKnowledge\nAdvanced knowledge of alliance partnerships and partnership relationship development. \nAbility to turn strategic objectives into executable concrete objectives. \nAbility to apply innovative concepts and creative ideas and inspire others to achievement based  on future visions. \nAdvanced leadership skills. \nAbility to handle negotiations of extremely critical matters and deliver difficult information to  leadership. \nAbility to lead the resolution of critical issues and lead organizational change. \nAbility to drive success, loyalty, creativity, and vision in others. \nAbility to drive consensus and decisions in group environments, taking into account the business  needs and objectives and the impact to stakeholder organizations. \nAbility to champion new ideas, manage change, and execute on action plans. \nStrong analytical and problem-solving skills utilizing data and other impacts to drive decision making. \nStrong project management skills and the ability to manage and influence multiple projects  simultaneously. \nEducation\nBachelor’s degree in Business or a related field. \nAdvanced degree is common. \nHigh School diploma required\nExperience\nRequires 15+ years of professional experience in direct or channel/alliance sales, and alliance  partnerships, including significant experience in driving business growth through alliance  partnership and relationship management. \nMust have a minimum of 7 years of progressively responsible people management experience -  typically including a minimum of 3 years of director level experience\n Experience working closely with internal and external stakeholders to drive change in an  organization \nTravel\nOccasional travel domestic and international may be required, less than 20%\nDisclaimer\nDisclaimer The above information has been designed to indicate the general nature and level of work performed by  employees in this classification. It is not designed to contain or to be interpreted as a comprehensive  inventory of all duties, responsibilities, and qualifications required of the employee assigned to this job\nAre you a Racker?\nRackers thrive in fast-paced environments built to inspire learning, growing, and innovating. \n \nThey are mission-inspired, values-grounded, culture-focused, and dedicated to making a positive impact in everything they do. \n \nRackers are inherently wired to solve problems and share ideas in small, nimble teams. \n \nAs experts in what they do, Rackers are serious about delivering a Fanatical Experience™ to our customers. \nRackers are valued members of a winning team on an inspiring mission and we want you to join the Racker family!\nWhy work at Rackspace Technology?\nFind your fanatical. We deliver the best customer experience in the industry to businesses that perform life-saving research, power cities, and feed millions.\n \nCome as you are. Cultivating inclusion is not just the right thing to do, it enables us to win. Our Executive Inclusion Council and Racker Resource Groups (RRGs) partner to enable an inclusive workplace and drive initiatives such as Rackspace’s participation in the annual Texas Conference for Women.\n \nSatisfy your curiosity. No matter where you are going, we can help you get there. Our internal learning department, Rackspace University®, provides training and development to Rackers – from Microsoft™ certifications to effective leadership training – our goal is to help you grow.\n \nMake a difference. At the core of every Racker is a drive to leave the world better than we found it, and we are passionate about giving back to our communities across the globe. While Rackers can leverage paid volunteer time off for any cause, our Rack Gives Back program creates opportunities for Rackers to give their time and talent to others.\n \nLive life completely. We offer a well-rounded suite of health and wellness programs that help our Rackers achieve a healthy and balanced lifestyle. So while our Rackers are busy taking care of our customers, we take care of our Rackers.\n•        The following information is required by pay transparency legislation in the following states: CA, CO, HI, NY, and WA. This information applies only to individuals working in these states. \n•        The anticipated starting pay range for Colorado is: 218,400 – 384,120\n•        The anticipated starting pay range for the states of Hawaii and New York (not including NYC) is: 231,600 – 407,220\n•        The anticipated starting pay range for California, New York City and Washington is: 254,700 – 447,920\n•        Unless already included in the posted pay range and based on eligibility, the role may include variable compensation in the form of bonus, commissions, or other discretionary payments. These discretionary payments are based on company and/or individual performance and may change at any time. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, licenses and certifications, and specific work location. Information on benefits offered is here.", "qualifications": {"required": "Advanced knowledge of alliance partnerships and partnership relationship development. \nAbility to turn strategic objectives into executable concrete objectives. \nAbility to apply innovative concepts and creative ideas and inspire others to achievement based  on future visions. \nAdvanced leadership skills. \nAbility to handle negotiations of extremely critical matters and deliver difficult information to  leadership. \nAbility to lead the resolution of critical issues and lead organizational change. \nAbility to drive success, loyalty, creativity, and vision in others. \nAbility to drive consensus and decisions in group environments, taking into account the business  needs and objectives and the impact to stakeholder organizations. \nAbility to champion new ideas, manage change, and execute on action plans. \nStrong analytical and problem-solving skills utilizing data and other impacts to drive decision making. \nStrong project management skills and the ability to manage and influence multiple projects  simultaneously. ", "preferred": "Bachelor’s degree in Business or a related field. \nAdvanced degree is common. \nHigh School diploma required\nRequires 15+ years of professional experience in direct or channel/alliance sales, and alliance  partnerships, including significant experience in driving business growth through alliance  partnership and relationship management. \nMust have a minimum of 7 years of progressively responsible people management experience -  typically including a minimum of 3 years of director level experience\n Experience working closely with internal and external stakeholders to drive change in an  organization "}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "Find your fanatical. We deliver the best customer experience in the industry to businesses that perform life-saving research, power cities, and feed millions.\n \nCome as you are. Cultivating inclusion is not just the right thing to do, it enables us to win. Our Executive Inclusion Council and Racker Resource Groups (RRGs) partner to enable an inclusive workplace and drive initiatives such as Rackspace’s participation in the annual Texas Conference for Women.\n \nSatisfy your curiosity. No matter where you are going, we can help you get there. Our internal learning department, Rackspace University®, provides training and development to Rackers – from Microsoft™ certifications to effective leadership training – our goal is to help you grow.\n \nMake a difference. At the core of every Racker is a drive to leave the world better than we found it, and we are passionate about giving back to our communities across the globe. While Rackers can leverage paid volunteer time off for any cause, our Rack Gives Back program creates opportunities for Rackers to give their time and talent to others.\n \nLive life completely. We offer a well-rounded suite of health and wellness programs that help our Rackers achieve a healthy and balanced lifestyle. So while our Rackers are busy taking care of our customers, we take care of our Rackers.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996538123"}