{"jobTitle": "Future Product Management Opportunities", "company": {"name": "hims & hers", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Product Management and Marketing", "industry": "Wellness and Fitness Services", "description": "Hims & Hers Health, Inc. (better known as Hims & Hers) is the leading health and wellness platform, on a mission to help the world feel great through the power of better health. We are revolutionizing telehealth for providers and their patients alike. Making personalized solutions accessible is of paramount importance to Hims & Hers and we are focused on continued innovation in this space. Hims & Hers offers nonprescription products and access to highly personalized prescription solutions for a variety of conditions related to mental health, sexual health, hair care, skincare, heart health, and more.<br/><br/>Hims & Hers is a public company, traded on the NYSE under the ticker symbol “HIMS”. To learn more about the brand and offerings, you can visit hims.com and forhers.com, or visit our investor site. For information on the company’s outstanding benefits, culture, and its talent-first flexible/remote work approach, see below and visit www.hims.com/careers-professionals.<br/><br/>Join Hims & Hers as a Product Manager to help shape the future of digital healthcare. You'll lead key initiatives to grow our platform and improve user experiences across our telehealth services. If you're passionate about using technology to make healthcare more accessible and have a proven track record in product management, we want to hear from you.<br/><br/>If you’re interested in joining the Product Management team, but don't see an opportunity that interests you, please send us your resume by applying below.<br/><br/>We post new roles often, so continue to check back and feel free to apply to those too. We'll keep your information on file and reach out if we find a match!<br/><br/><em>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.<br/><br/></em><em>Hims is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Hims considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.<br/><br/></em><em>Hims & Hers is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@forhims.com. Please do not send resumes to this email address.<br/><br/></em><em>For our California-based applicants – Please see our California Employment Candidate Privacy Policy to learn more about how we collect, use, retain, and disclose Personal Information.</em>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3996296028"}