{"jobTitle": "Talent Acquisition Recruiter", "company": {"name": "SpreeAI", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Software Development", "description": "SpreeAI is a fast-growing, innovative AI technology company with a core focus on revolutionizing the ecommerce and fashion landscapes. We thrive in a dynamic, fast-paced environment where creativity meets technology. Our mission is to revolutionize the fashion industry by creating cutting-edge technology solutions that drive real impact. If you are passionate about technology, fashion, shaping the future, and have a knack for social media, your spot is here with us! We are proud to announce that the iconic Naomi Campbell has recently joined our board, marking a significant milestone in our journey.\n\nWe are seeking an energetic, resourceful, and passionate Talent Acquisition Recruiter with experience in sourcing, recruiting, and building out Talent Acquisition programs. The ideal candidate will be adept at developing recruitment strategies, establishing strong pipelines, creating engaging onboarding experiences, and thrive in a fast-paced start-up environment. We're looking for someone with a start-up mindset, an innovator, and a go-getter spirit who loves the challenge of creating something from the ground-up. If this sounds like you, we'd love to hear from you. This is an exciting time to join our growing team! This role will report to the HR Manager.\n\n\n\n**Responsibilities**\n\n* Build out scalable and strategic talent pipelines from the ground-up to source for top talents.\n* Create recruitment and onboarding processes and workflows that maximizes time, efficiency, and quality.\n* Proactively pioneer and identify ways to engage with top talents across various recruitment channels and platforms and utilize industry connections and networks (Linkedin, Workable ATS, college and industry specific career websites, etc.).\n* Collaborate closely with hiring managers and key stakeholders, align recruitment strategies and improve recruiting processes; foster a collaborative and high-performance environment.\n* Organize candidate documents, onboarding documents, and onboarding processes.\n* Partner closely and communicate effectively with various teams with excellent service, timeliness, and respect.\n* Pitch brilliant ideas and take into action innovative ways to enhance and manage our career web page, job descriptions, and build out onboarding materials.\n* Use data and metrics to track sourcing effectiveness, and report on recruiting progress on a weekly basis. \n<br/><br/>\n**Requirements**<br/><br/>\n* Minimum of 3 years of experience in recruitment. Proven track record of successfully recruiting high-profile talents and building strong talent pipelines. \n\n* Experience with high-volume environments utilizing sourcing tools such as LinkedIn, or technical forums (Boolean, etc.)\n* Passion and vision for emerging media and fashion.\n* Excellent interpersonal and communication skills, attention to detail, and the ability to work in a fast-paced and deadline-driven environment.\n* Strong communication and collaboration skills, with the ability to work effectively in a remote or onsite team setting.\n<br/><br/>\n**Benefits**<br/><br/>\n* Competitive salary and performance-based incentives.\n\n* Comprehensive health and wellness benefits.\n* Opportunities for professional development and growth.\n* Fully remote work environment.\n* Be at the forefront of revolutionizing the fashion and tech industries.\n* Work alongside industry leaders and influencers.", "responsibilities": "Build out scalable and strategic talent pipelines from the ground-up to source for top talents. Create recruitment and onboarding processes and workflows that maximizes time, efficiency, and quality. Proactively pioneer and identify ways to engage with top talents across various recruitment channels and platforms and utilize industry connections and networks (Linkedin, Workable ATS, college and industry specific career websites, etc.). Collaborate closely with hiring managers and key stakeholders, align recruitment strategies and improve recruiting processes; foster a collaborative and high-performance environment. Organize candidate documents, onboarding documents, and onboarding processes. Partner closely and communicate effectively with various teams with excellent service, timeliness, and respect. Pitch brilliant ideas and take into action innovative ways to enhance and manage our career web page, job descriptions, and build out onboarding materials. Use data and metrics to track sourcing effectiveness, and report on recruiting progress on a weekly basis.", "qualifications": {"required": "Minimum of 3 years of experience in recruitment. Proven track record of successfully recruiting high-profile talents and building strong talent pipelines.  Experience with high-volume environments utilizing sourcing tools such as LinkedIn, or technical forums (Boolean, etc.) Passion and vision for emerging media and fashion. Excellent interpersonal and communication skills, attention to detail, and the ability to work in a fast-paced and deadline-driven environment. Strong communication and collaboration skills, with the ability to work effectively in a remote or onsite team setting."}, "skills": ["LinkedIn", "Sourcing", "Recruiting", "Talent Acquisition", "Onboarding", "Recruitment", "Communication", "Collaboration"], "postedDate": "1 week ago", "benefits": "Competitive salary and performance-based incentives. Comprehensive health and wellness benefits. Opportunities for professional development and growth. Fully remote work environment. Be at the forefront of revolutionizing the fashion and tech industries. Work alongside industry leaders and influencers.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3996485635"}