{"jobTitle": "Associate Product Manager", "company": {"name": "Clerkie", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Product Management", "industry": "Financial Services, Software Development, and Technology, Information and Media", "description": "About **Clerkie**:\n\nClerkie is a fintech startup on a mission to democratize financial wellness using the power of artificial intelligence. Launched in 2018, Clerkie began with an app, aiming to help the nearly 123 million underserved Americans in need of financial guidance. Since its inception, the company has expanded its services and now pairs consumer guidance with cutting-edge B2B software. By pairing the two through the Clerkie network, these tools have become the go-to resource for creditors looking to manage loan losses while simultaneously helping millions of borrowers get out of debt.\n\nClerkie is a remote-first company, with nearly 30 employees spanning 4 time zones across the United States. To date, the company has raised $41 million, including a $33 million Series A round in early 2023. Investors include leading financial and venture institutions, including Citi Ventures, Left Lane Capital, Wellington Ventures, Flourish Ventures, and Vestigo Ventures.\n\nThe ideal Clerkie team member can pivot on the fly, fight through adversity, communicate effectively, and produce high-quality work on short timelines. Clerkie’s culture values working with a customer-first mindset and bias for action.\n\n**Role Overview**:\n\nTitle: Associate Product Manager (open to candidates at the PM-level)\n\nWe are seeking a talented and driven APM/PM to join our team. In this unique role, you will be responsible for bridging the gap between our B2B sales function and engineering team. You will work cross-functionally to rapidly define product requirements, tailor product demonstrations, and shape the development blueprint to clients' needs, playing a pivotal role in spearheading the introduction of new products.\n\n**Responsibilities**:\n• Coordinate with our sales, product, and engineering teams to build the strategy and roadmap for Clerkie product offerings.\n• Quickly grasp new industries and product requirements, translating those findings into tangible wireframes and prototypes.\n• Clearly define and communicate product vision and specifications to our design team.\n• Assist in identifying and preempting customer needs and market opportunities.\n• Gather and analyze feedback from customers, stakeholders, and other sources to inform development decisions.\n• Understand use cases for a variety of industry customers.\n• Evaluate and prioritize requirements in partnership with Clerkie’s GTM function.\n• Communicate product updates and progress to internal and external stakeholders.\n\n**Qualifications**:\n• Bachelor’s degree in Business, Economics, Engineering, Computer Science, or other relevant fields.\n• 3+ years of experience in product management for a CRM or similar SaaS product, preferably with a startup.\n• Exposure to Figma in a professional setting\n• Experience preparing software demos and tailored use cases.\n• Proven track record of working cross-functionally with sales teams to foster partner relationships.\n• Strong analytical and problem-solving skills.\n• Excellent communication and collaboration abilities.\n• Passion for technology and innovation.\n\n**Nice to Have**:\n• Previous exposure to consumer debt industry.", "responsibilities": "• Coordinate with our sales, product, and engineering teams to build the strategy and roadmap for Clerkie product offerings.\n• Quickly grasp new industries and product requirements, translating those findings into tangible wireframes and prototypes.\n• Clearly define and communicate product vision and specifications to our design team.\n• Assist in identifying and preempting customer needs and market opportunities.\n• Gather and analyze feedback from customers, stakeholders, and other sources to inform development decisions.\n• Understand use cases for a variety of industry customers.\n• Evaluate and prioritize requirements in partnership with Clerkie’s GTM function.\n• Communicate product updates and progress to internal and external stakeholders.", "qualifications": {"required": "• Bachelor’s degree in Business, Economics, Engineering, Computer Science, or other relevant fields.\n• 3+ years of experience in product management for a CRM or similar SaaS product, preferably with a startup.\n• Exposure to Figma in a professional setting\n• Experience preparing software demos and tailored use cases.\n• Proven track record of working cross-functionally with sales teams to foster partner relationships.\n• Strong analytical and problem-solving skills.\n• Excellent communication and collaboration abilities.\n• Passion for technology and innovation.", "preferred": "• Previous exposure to consumer debt industry."}, "skills": ["CRM", "SaaS", "Figma", "Product Management", "Software Demos", "Cross-functional Collaboration", "Analytical Skills", "Problem Solving", "Communication", "Collaboration", "Technology", "Innovation", "Consumer Debt"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3996492447"}