{"jobTitle": "Director/VP of Channels and Alliances", "company": {"name": "Accounting Seed", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "150,000.00/yr - $180,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development, Sales, and Customer Service", "industry": "Software Development and Accounting", "description": "<strong>Director/Vice President of Channels &amp; Alliances, N. America</strong> <p>Accounting Seed is looking for an experienced channels and alliances leader to build and execute our channel partnerships and unlock growth opportunities within the Salesforce ecosystem. This is an exciting opportunity to lead our growing channel sales efforts and shape the future growth of our organization. </p><p>Accounting Seed is on a mission to simplify and streamline financial operations for SMB companies by providing a single solution for CRM and Accounting. Built on the Salesforce platform, our users gain efficiencies by streamlining processes, reducing accounting cycles, and gaining a real-time view of business performance. </p><p><strong>Responsibilities:</strong> </p><ul><li>Develop and execute a comprehensive alliances channel strategy in alignment with overall business objectives for Solutions Implementation Partners (SI’s) and other partners within the Salesforce ecosystem </li><li>Establish and nurture strong relationships with all SI partners to drive revenue growth and expand market reach </li><li>Identify, onboard, and enable new System Integrator (SI) channel partners, ensuring they receive the necessary training and support to effectively sell and promote our software solutions </li><li>Collaborate with cross-functional teams, including marketing, customer experience and product, to create and implement channel-specific sales initiatives and programs. </li><li>Monitor and analyze market trends, competitor activities, and customer feedback to identify opportunities for product enhancements and market expansion. </li><li>Drive sales performance and revenue targets through effective sales forecasting, pipeline management, and performance evaluation. </li><li>Requirements: </li><li>Minimum 10+ years of professional experience in channel or software sales </li><li>5+ years in partner channel role with a proven track record of successfully managing partnerships </li><li>Previous experience working within the Salesforce ecosystem </li><li>Experience working with national partners preferred </li><li>Proven track record of exceeding sales targets and driving revenue -growth through channel sales partnerships </li><li>In-depth understanding of the Salesforce platform </li><li>Exceptional relationship-building and communication skills, with the ability to effectively engage and influence partners at all levels. </li><li>Strong leadership and people management skills, with experience in leading and motivating sales teams. </li><li>Demonstrated strategic thinking and problem-solving abilities to identify and capitalize on market opportunities. </li><li>Self-motivated, results-oriented, and able to thrive in a fast-paced, entrepreneurial environment. </li></ul><p> </p><p><strong>Skills and Requirements:</strong> </p><ul><li>Bachelor’s degree </li><li>Ideal candidates should possess B2B software sales and alliances experience </li><li>Operating in the Salesforce partner ecosystem </li><li>Relevant knowledge and experience in cloud computing - accounting, business processes a plus. </li><li>Ability to quickly learn new web-based technologies </li><li>Confidence, as well as strong verbal &amp; written communication skills when interacting with clients and partners </li><li>Flexibility, responsiveness, and professional agility to satisfy multiple, parallel opportunities </li><li>Ability to discover and understand partner goals </li><li>Excellent communication and highly developed social skills with a strong collaborative ability </li><li>Poised and polished </li><li>Strong writing and demonstrable presentation skills </li><li>Commitment to delivering outstanding customer and partner service </li></ul><p> </p><p>Job Type: Full-time</p>", "responsibilities": "Develop and execute a comprehensive alliances channel strategy in alignment with overall business objectives for Solutions Implementation Partners (SI’s) and other partners within the Salesforce ecosystem Establish and nurture strong relationships with all SI partners to drive revenue growth and expand market reach Identify, onboard, and enable new System Integrator (SI) channel partners, ensuring they receive the necessary training and support to effectively sell and promote our software solutions Collaborate with cross-functional teams, including marketing, customer experience and product, to create and implement channel-specific sales initiatives and programs. Monitor and analyze market trends, competitor activities, and customer feedback to identify opportunities for product enhancements and market expansion. Drive sales performance and revenue targets through effective sales forecasting, pipeline management, and performance evaluation.", "qualifications": {"required": "Minimum 10+ years of professional experience in channel or software sales 5+ years in partner channel role with a proven track record of successfully managing partnerships Previous experience working within the Salesforce ecosystem Experience working with national partners preferred Proven track record of exceeding sales targets and driving revenue -growth through channel sales partnerships In-depth understanding of the Salesforce platform Exceptional relationship-building and communication skills, with the ability to effectively engage and influence partners at all levels. Strong leadership and people management skills, with experience in leading and motivating sales teams. Demonstrated strategic thinking and problem-solving abilities to identify and capitalize on market opportunities. Self-motivated, results-oriented, and able to thrive in a fast-paced, entrepreneurial environment.", "preferred": "Bachelor’s degree Ideal candidates should possess B2B software sales and alliances experience Operating in the Salesforce partner ecosystem Relevant knowledge and experience in cloud computing - accounting, business processes a plus. Ability to quickly learn new web-based technologies Confidence, as well as strong verbal &amp; written communication skills when interacting with clients and partners Flexibility, responsiveness, and professional agility to satisfy multiple, parallel opportunities Ability to discover and understand partner goals Excellent communication and highly developed social skills with a strong collaborative ability Poised and polished Strong writing and demonstrable presentation skills Commitment to delivering outstanding customer and partner service"}, "skills": ["Salesforce", "Channel Sales", "Partner Management", "Sales Strategy", "Business Development", "Sales Operations", "Sales Management", "Market Analysis", "Relationship Building", "Communication", "Leadership", "Team Management", "Strategic Thinking", "Problem Solving", "Cloud Computing", "Accounting", "Business Processes"], "postedDate": "1 week ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3996530325"}