{"jobTitle": "HOME BASED INSURANCE SALES", "company": {"name": "The Jernigan Agency", "location": "Paradise, NV"}, "location": "Paradise, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Insurance Agencies and Brokerages", "description": "We are looking for individuals interested in working from home, remotely, as life insurance sales representatives. We are hiring coachable individuals comfortable with a 100% commission based income helping our clients who have asked for our help with life insurance backed products. Agents usually help 3 - 5 families each week, and average $300 - $500 for each family they help. You must be a US citizen to qualify for this position. SCHEDULE AN INTERVIEW TODAY!As this is a commission based income, there is no cap on your earnings. We use data driven systems and cutting edge lead generation that gets you connected with interested clients quickly.The candidate we are looking for is disciplined, honest, confident, and passionate about helping people achieve their financial goals. Occasional travel for work for in-person conferences. If you are not currently licensed but have a desire to learn this business, we will help guide you in that process.<br/><br/><strong>Sales Job Description<br/><br/></strong><ul><li>Call on our lead prospects to set up appointments.</li><li>Help each client to review their options and apply for that coverage.</li><li>See the application through the underwriting process and get our clients covered.<br/><br/></li></ul><strong>Requirements For Sales Position<br/><br/></strong><ul><li>Must be licensed in life products or willing to get licensed.</li><li>Must have a computer and phone to service the clients.</li><li>This is all online so internet connection is a must.</li><li>We provide all of the training.</li><li>We have warm leads available who have contacted us first. No COLD calling.</li><li>Must be a US citizen.<br/><br/></li></ul><strong>We Provide<br/><br/></strong><ul><li>Training</li><li>Mentorship</li><li>Lead system for getting in front of clients <br/><br/></li></ul>If you are interested in learning more about working with us, please SCHEDULE AN INTERVIEW TODAY!<br/><br/>Powered by JazzHR", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997701799"}