{"jobTitle": "Manager of Purchasing and Inventory", "company": {"name": "Randstad USA", "location": "Fort Lauderdale, FL"}, "location": "Fort Lauderdale, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Experienced", "salary": {"amount": "$80,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Machinery Manufacturing", "description": "Our client, a growing Manufacturing Company is looking for a Manager of Purchasing and Inventory. If you have at least 8 years of manufacturing, inventory and purchasing experience, please apply to this posting or email your resume to andrew.pober@randstadusa.com for consideration. MUST LIVE IN SOUTH FLORIDA TO BE CONSIDERED<br/><br/>salary: $80,000 - $90,000 per year<br/><br/>shift: First<br/><br/>work hours: 7:30 AM - 5:30 PM<br/><br/>education: Bachelors<br/><br/><strong>Responsibilities<br/><br/></strong>Responsible for the procurement process of materials and supplies<br/><br/><ul><li>Develop purchasing strategies, negotiate contracts, and evaluate vendors based on quality, price, and timeliness. </li><li>Maintain supplier database, purchase records, and related documentation.</li><li>Prepare forecasts to anticipate and manage inventory needs, schedule production and deliveries.</li><li>Examine the levels of materials and supplies to determine shortages</li><li>Assist controller with the processing of Accounts Payable, inventory budgets and forecasts<br/><br/></li></ul>Skills<br/><br/><ul><li>Materials Management</li><li>Purchasing/Procurement</li><li>MRP</li><li>Bookkeeping<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Years of experience: 8 years</li><li>Experience level: Experienced<br/><br/></li></ul>Randstad is a world leader in matching great people with great companies. Our experienced agents will listen carefully to your employment needs and then work diligently to match your skills and qualifications to the right job and company. Whether you're looking for temporary, temporary-to-permanent or permanent opportunities, no one works harder for you than Randstad.<br/><br/>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.<br/><br/>At Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.<br/><br/>Pay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).<br/><br/>This posting is open for thirty (30) days.", "responsibilities": "Responsible for the procurement process of materials and supplies<br/><br/><ul><li>Develop purchasing strategies, negotiate contracts, and evaluate vendors based on quality, price, and timeliness. </li><li>Maintain supplier database, purchase records, and related documentation.</li><li>Prepare forecasts to anticipate and manage inventory needs, schedule production and deliveries.</li><li>Examine the levels of materials and supplies to determine shortages</li><li>Assist controller with the processing of Accounts Payable, inventory budgets and forecasts<br/><br/></li></ul>", "qualifications": {"required": "8 years of manufacturing, inventory and purchasing experience", "preferred": ""}, "skills": ["Materials Management", "Purchasing/Procurement", "MRP", "Bookkeeping"], "postedDate": "6 days ago", "benefits": "Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997594664"}