{"jobTitle": "MATERIALS MANAGEMENT MANAGER", "company": {"name": "Lake Worth Beach", "location": "Lake Worth, FL"}, "location": "Lake Worth, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Government Administration", "description": "The City of Lake Worth invites qualified individuals to apply for the position Materials Management Manager.<br/><br/>Closing: Open Until Filled<br/><br/><strong>This position is part of the Professional Manager &amp; Supervisor Association (PMSA) union and is exempt with an annual salary $65,000-$110,000. This position will work at Utilities Building located at 1900 2nd Avenue North, Lake Worth, FL 33460.<br/><br/></strong><strong>In Addition, This Position Offers<br/><br/></strong><strong>Vacation and Sick Leave Accruals<br/><br/></strong><strong>14 Paid Holidays<br/><br/></strong><strong>City of Lake Worth Medical Benefits that include Life Insurance, Dental and Vision coverage<br/><br/></strong><strong>Retirement Plan <br/><br/></strong><strong>Summary<br/><br/></strong>The Materials Management Manager role exist to efficiently manage inventory of materials required to enable the Electric and Water Utility divisions to construct, operate, and maintain their respective utility infrastructure. Further, it is the responsibility of the person in this position to ensure that materials management activities in their assigned area of responsibility are conducted using best management practices as practicable for the City’s utilities and in in compliance with applicable Federal, State, and local requirements .<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Manages, directs, and evaluates warehouse personnel. </li><li>Develops and maintains adequate procedures and systems for safeguarding and accounting for inventory under his/her control.</li><li>Manages and conducts material counting activities with results reported monthly and annually in inventory accuracy reports and associated book adjustments are processed in a timely fashion.</li><li>Investigates and reports on inventory inaccuracies; identifies root causes of inaccuracies and implements necessary corrective measures.</li><li>Reorganizes and modifies material storage locations and systems as needed to effectively and safely operate the business.</li><li>Manages the sale/disposal of obsolete materials or excess quantities of materials; ensures that all transactions are documented for adjustment in the City’s inventory records.</li><li>Monitors and estimates usage of inventoried materials and develops replenishment strategies that yield optimal operational and financial benefits.</li><li>Participates in and manages materials management functions during storm events in support of City crews as well as mutual aid and/or contractor crews.</li><li>Develops and maintains operational and financial metrics, benchmarks, and scorecards of material management operations as needed to provide management with reports on the unit’s performance and measure performance.</li><li>Manages within a framework of continuous improvement demonstrable via the use of appropriate performance metrics consistent with best practices in materials management and warehouse operations.</li><li>Manages the development of and ensures adherence to safe work practices in materials management functions. </li><li>Effective collaboration and collaboration with City’s Purchasing and Finance Department to accomplish duties.</li><li>Works with City’s Purchasing Department to review procurement specifications for accuracy, quantity, and assurance that delivery schedules will meet user needs.</li><li>Researches vendors/sources to make procurement selections that maximize ROI.</li><li>Drafts RFQ/RFP’s in collaboration with City’s Purchasing Department, solicits and obtains quotations analyzes competitive bids to include; participating in pre-bid and other meetings consistent with Sunshine Laws, conducts bid openings, including chairing and/or participating in vendor selection committees.</li><li>Monitors and updates status of annual contracts listing.</li><li>Researches and helps obtain Florida State Contracts and Intergovernmental contracts as needed to deliver optimal efficiency to the materials management process.</li><li>In concert with Risk Management manages subrogation from insurance resulting from damages to departmental/city property related to Utilities.</li><li>Collaborates with fellow City Utility staff members in developing and fulfilling materials requirements for capital improvement projects, as well as processes for receiving, controlling, and distributing project materials.</li><li>Assist in preparation of the annual budget.</li><li>Other duties as assigned within the scope of this role.<br/><br/></li></ul><strong>Competencies <br/><br/></strong><ul><li>Experience with materials management and/or procurement best practices.</li><li>Working level knowledge and familiarity with sound financial management principles. </li><li>Warehouse management experience to include physical inventory counting, quantity verification, and reconciliation with book records. </li><li>Effective interpersonal, supervisory and leadership skills that enable the incumbent to accomplish work through others even in cases where a direct reporting relationship does not exist.</li><li>Ability to develop a working knowledge of business methods and purchasing practices to remain in compliance to applicable laws relating to public purchasing methods, markets and practices; private industry experience is acceptable.</li><li>Strong analytical, verbal and written communication skills</li><li>General knowledge of various grades and qualities of a variety of materials, supplies and equipment used in the electric and/or water utility industry.</li><li>The ability to multi-task, prioritize workload.</li><li>Intermediate to an advance skills with the Microsoft Office suite of products to include MS Word, Excel, Outlook, &amp; PowerPoint.</li><li>The ability to learn to learn and effectively utilize the City’s financial software (currently Naviline)<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily with or without reasonable accommodation. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Education And/or Experience<br/><br/></strong>Graduation from an accredited college or university with major course work in business administration, contract management, purchasing, or related field and multiple years of experience in warehouse/materials management functions, preferably in utility or durable goods entities. Post undergraduate education and/or professional certification are highly desired.<br/><br/><strong>Language Skills<br/><br/></strong>Ability to read, write technical procedural and routine documents, and communicate in the English language and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence.<br/><br/><strong>Mathematical Skills<br/><br/></strong>Ability to calculate figures and amounts such as gross and net quantity adjustments to inventory, discounts on purchase prices, proportions, percentages, area, circumference and volume.<br/><br/><strong>Reasoning Ability <br/><br/></strong>Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.<br/><br/><strong>Certificates, Licenses, Registrations <br/><br/></strong>Current driver’s license.<br/><br/><strong>Physical Demands <br/><br/></strong>While performing the duties of this job, the employee is regularly required to sit; use hands to finger, handle, or feel; reach with hands and arms; talk and hear. The employee is frequently required to stand and walk. The employee is occasionally required to climb or balance and stoop, kneel, crouch, or crawl. The employee must regularly lift and/or move up to 10 pounds. Specific vision abilities required by this job include close vision, distance vision, and color vision.<br/><br/><strong>Work Environment <br/><br/></strong>While the office location is indoors and climate controlled, in performing the duties of this job the employee is expected to daily supervise and inspect work activities in non-air conditioned indoor and outdoor warehouse areas as well as outdoor job-site material storage and staging areas. Exposure to moving mechanical equipment such as forklifts, trucks, cranes, warehouse equipment, etc. is routine. The noise level in the environment is usually moderate.", "responsibilities": "The Materials Management Manager role exist to efficiently manage inventory of materials required to enable the Electric and Water Utility divisions to construct, operate, and maintain their respective utility infrastructure. Further, it is the responsibility of the person in this position to ensure that materials management activities in their assigned area of responsibility are conducted using best management practices as practicable for the City’s utilities and in in compliance with applicable Federal, State, and local requirements .<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong><ul><li>Manages, directs, and evaluates warehouse personnel. </li><li>Develops and maintains adequate procedures and systems for safeguarding and accounting for inventory under his/her control.</li><li>Manages and conducts material counting activities with results reported monthly and annually in inventory accuracy reports and associated book adjustments are processed in a timely fashion.</li><li>Investigates and reports on inventory inaccuracies; identifies root causes of inaccuracies and implements necessary corrective measures.</li><li>Reorganizes and modifies material storage locations and systems as needed to effectively and safely operate the business.</li><li>Manages the sale/disposal of obsolete materials or excess quantities of materials; ensures that all transactions are documented for adjustment in the City’s inventory records.</li><li>Monitors and estimates usage of inventoried materials and develops replenishment strategies that yield optimal operational and financial benefits.</li><li>Participates in and manages materials management functions during storm events in support of City crews as well as mutual aid and/or contractor crews.</li><li>Develops and maintains operational and financial metrics, benchmarks, and scorecards of material management operations as needed to provide management with reports on the unit’s performance and measure performance.</li><li>Manages within a framework of continuous improvement demonstrable via the use of appropriate performance metrics consistent with best practices in materials management and warehouse operations.</li><li>Manages the development of and ensures adherence to safe work practices in materials management functions. </li><li>Effective collaboration and collaboration with City’s Purchasing and Finance Department to accomplish duties.</li><li>Works with City’s Purchasing Department to review procurement specifications for accuracy, quantity, and assurance that delivery schedules will meet user needs.</li><li>Researches vendors/sources to make procurement selections that maximize ROI.</li><li>Drafts RFQ/RFP’s in collaboration with City’s Purchasing Department, solicits and obtains quotations analyzes competitive bids to include; participating in pre-bid and other meetings consistent with Sunshine Laws, conducts bid openings, including chairing and/or participating in vendor selection committees.</li><li>Monitors and updates status of annual contracts listing.</li><li>Researches and helps obtain Florida State Contracts and Intergovernmental contracts as needed to deliver optimal efficiency to the materials management process.</li><li>In concert with Risk Management manages subrogation from insurance resulting from damages to departmental/city property related to Utilities.</li><li>Collaborates with fellow City Utility staff members in developing and fulfilling materials requirements for capital improvement projects, as well as processes for receiving, controlling, and distributing project materials.</li><li>Assist in preparation of the annual budget.</li><li>Other duties as assigned within the scope of this role.<br/><br/></li></ul>", "qualifications": {"required": "Graduation from an accredited college or university with major course work in business administration, contract management, purchasing, or related field and multiple years of experience in warehouse/materials management functions, preferably in utility or durable goods entities.", "preferred": "Post undergraduate education and/or professional certification are highly desired."}, "skills": ["Materials Management", "Procurement", "Financial Management", "Warehouse Management", "Inventory Control", "Supervisory Skills", "Leadership Skills", "Public Purchasing", "Analytical Skills", "Communication Skills", "Microsoft Office", "Financial Software"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3997820561"}