{"jobTitle": "Senior Account Executive, Small and Medium Businesses (SMBs)", "company": {"name": "Respiris", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Wireless Support provides a comprehensive suite of enterprise mobility management services, including Mobile Device Management (MDM), device protection, 7 days a week support, wireless expense management, GPS tracking solutions, and device lifecycle management from procurement to recycling. These services enhance technology, security, and network operations for businesses of all sizes.<br/><br/>Wireless Support is empowering businesses of all sizes to leverage the power of mobile/wireless technology securely and efficiently. Our comprehensive suite of services includes:<br/><br/><ul><li>Mobile Device Management (MDM): We ensure complete control and security over your company's mobile devices, including smartphones, tablets, and laptops</li><li>Device Protection: We safeguard your devices against loss, theft, and unauthorized access</li><li>7 days a week Support: Our dedicated support team is always available to assist your employees with any mobile/wireless device issues</li><li>Wireless Account Management: We optimize your wireless spending by providing real-time insights and cost-saving strategies</li><li>GPS Tracking Solutions: Gain real-time visibility into your mobile/wireless workforce, enhancing efficiency and safety</li><li>Device Lifecycle Management: We manage your entire device lifecycle, from procurement and deployment to secure data wiping and recycling<br/><br/></li></ul>In addition to these services, the company also offers Device Repair Plan, Ordering and Procurement, and Device Setup.<br/><br/><strong>ABOUT ROLE:<br/><br/></strong>We are seeking a driven and goal-oriented Account Executive to join our sales team. This role is crucial for nurturing leads, converting prospects into clients, and driving new client acquisition. The ideal candidate will possess strong sales skills, the ability to understand client needs, and a knack for building long-term relationships. You will be one of two account executives, reporting directly to the Vice President of Sales.<br/><br/>The Account Executive will engage Small and Medium Businesses (SMBs) leaders typically encompassing both Small Enterprises (SEs) and Medium Enterprises (MEs). These businesses will have relatively small numbers of employees and lower revenue compared to medium and large businesses. They are often characterized by a close-knit team and more personalized customer interactions. The Account Executive will need to influence companies with unstructured processes and demonstrate Wireless Support can add value.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>New Client Acquisition: Actively pursue and acquire new enterprise logos, focusing on small to medium-sized businesses to grow Wireless Support's footprint. Utilize strategic hunting and targeted outreach to identify and engage new prospects</li><li>Lead Nurturing: Work closely with the telesales team to qualify leads and move them through the sales funnel to conversion</li><li>Consultative Selling: Employ solution-based selling techniques to cultivate meaningful partnerships and achieve significant business impacts</li><li>Sales Excellence: Apply advanced sales force automation, funnel management, and prospecting tools to ensure a high level of engagement with CEO/COOs and improve sales efficiency</li><li>Sales Leadership and Analytics: Take a proactive leadership role in managing the sales funnel. Generate insightful analytics and accurate sales forecasts to support strategic decision-making and drive the sales process forward</li><li>Collaborative Integration: Work closely with internal teams to guarantee a smooth onboarding experience for customers, aligning all efforts to ensure successful business outcomes</li><li>Market Intelligence: Conduct detailed research to acquire deep insights into the business landscape, crafting sales strategies that are both impactful and tailored to specific client needs</li><li>Negotiation and Closure: Lead negotiations and finalize sales agreements with outstanding skills, ensuring Wireless Support's solutions are flawlessly aligned with the business objectives of large organizations</li><li>Client Relationship Management: Build and maintain strong relationships with decision-makers in target companies, particularly in the last-mile delivery sector</li><li>Revenue Generation: Contribute to both recurring revenue through service subscriptions and one-time activation commissions</li><li>Sales Strategy Implementation: Execute sales strategies and participate in refining the sales deck and consultation presentations<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Education: Bachelor's degree in Business, Marketing, or related field is preferred</li><li> Industry Experience: Proven track record in B2B sales, particularly in the wireless, telecom, or technology sectors</li><li> Sales Experience: 4-7 years of Acquisition sales experience and a demonstrated history of achievements in a commissioned environment. </li><li> Sales Conversion Skills: Strong ability to convert leads to clients, conduct effective meetings, and understand client needs; 2-4 years of Technology or Wireless Sales experience</li><li> Communication: Excellent verbal and written communication skills</li><li> Tech Savvy: Comfortable with technology and able to quickly learn new tools and systems</li><li> Personality: Positive, goal-oriented, coachable, and a good listener</li><li> Background: While specific industry background is not mandatory, experience in AT&amp;T B2B, T-Mobile B2B, Verizon B2B, or similar roles is highly desirable. <br/><br/><br/></li></ul><strong>Required Competencies<br/><br/></strong><ul><li> Empathy: Ability to understand and relate to client needs</li><li> Patience: Capable of handling longer sales cycles and nurturing relationships</li><li> Persuasion: Strong persuasive skills to give clients compelling reasons to choose Wireless Support</li><li> Coachability: Open to learning and applying new strategies and techniques</li><li> Adaptability: Ability to quickly adjust to changing market conditions and client needs</li><li> Analytical Skills: Proficient in using data to drive decision-making and sales strategies</li><li> Problem-Solving: Strong ability to identify and address client pain points with effective solutions</li><li> Resilience: Able to handle rejection and maintain a positive attitude through challenging sales cycles</li><li> Time Management: Excellent organizational skills to prioritize tasks and manage time efficiently</li><li> Customer Focus: Dedicated to providing exceptional service and building lasting client relationships</li><li> Negotiation Skills: Expert at negotiating terms and closing deals that benefit both the client and Wireless Support</li><li> Team Collaboration: Ability to work well within a team, sharing insights and strategies to improve overall sales performance<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>At Wireless Support, we believe in rewarding our Account Executives for their hard work and success. Our compensation structure is designed to provide competitive base pay along with attractive commission opportunities.<br/><br/>The base salary for this position is between $70,000 and $80,000.<br/><br/><strong>Minimum Quality Standard: </strong>A candidate meeting the minimum quality standard can expect to earn between $50,000 and $55,000 in commissions annually.<br/><br/><strong>Consistently Meeting Expectations: </strong>A candidate who consistently exceeds expectations, achieves set targets and helps build our sales processes can expect to earn closer to $90,000 in commissions annually.<br/><br/>Wireless Support also provides a comprehensive benefits package including health insurance, dental insurance, vision insurance, paid time off, etc.<br/><br/><strong>WHY JOIN US?<br/><br/></strong>You will be part of a dynamic team that's passionate about delivering efficient and secure wireless IT solutions. We offer a collaborative work environment where you can make a real impact on our business and our clients' success.", "responsibilities": "New Client Acquisition: Actively pursue and acquire new enterprise logos, focusing on small to medium-sized businesses to grow Wireless Support's footprint. Utilize strategic hunting and targeted outreach to identify and engage new prospects\nLead Nurturing: Work closely with the telesales team to qualify leads and move them through the sales funnel to conversion\nConsultative Selling: Employ solution-based selling techniques to cultivate meaningful partnerships and achieve significant business impacts\nSales Excellence: Apply advanced sales force automation, funnel management, and prospecting tools to ensure a high level of engagement with CEO/COOs and improve sales efficiency\nSales Leadership and Analytics: Take a proactive leadership role in managing the sales funnel. Generate insightful analytics and accurate sales forecasts to support strategic decision-making and drive the sales process forward\nCollaborative Integration: Work closely with internal teams to guarantee a smooth onboarding experience for customers, aligning all efforts to ensure successful business outcomes\nMarket Intelligence: Conduct detailed research to acquire deep insights into the business landscape, crafting sales strategies that are both impactful and tailored to specific client needs\nNegotiation and Closure: Lead negotiations and finalize sales agreements with outstanding skills, ensuring Wireless Support's solutions are flawlessly aligned with the business objectives of large organizations\nClient Relationship Management: Build and maintain strong relationships with decision-makers in target companies, particularly in the last-mile delivery sector\nRevenue Generation: Contribute to both recurring revenue through service subscriptions and one-time activation commissions\nSales Strategy Implementation: Execute sales strategies and participate in refining the sales deck and consultation presentations", "qualifications": {"required": "Proven track record in B2B sales, particularly in the wireless, telecom, or technology sectors\n4-7 years of Acquisition sales experience and a demonstrated history of achievements in a commissioned environment.\nStrong ability to convert leads to clients, conduct effective meetings, and understand client needs; 2-4 years of Technology or Wireless Sales experience\nExcellent verbal and written communication skills\nComfortable with technology and able to quickly learn new tools and systems\nPositive, goal-oriented, coachable, and a good listener\nWhile specific industry background is not mandatory, experience in AT&T B2B, T-Mobile B2B, Verizon B2B, or similar roles is highly desirable.", "preferred": "Bachelor's degree in Business, Marketing, or related field"}, "skills": ["Sales", "B2B", "Wireless", "Telecom", "Technology", "Lead Generation", "Sales Management", "Sales Strategy", "Client Relationship Management", "Sales Forecasting", "Market Research", "Negotiation", "Sales Process", "Customer Service", "Teamwork"], "postedDate": "1 week ago", "benefits": "Competitive base pay along with attractive commission opportunities.\nThe base salary for this position is between $70,000 and $80,000.\nA candidate meeting the minimum quality standard can expect to earn between $50,000 and $55,000 in commissions annually.\nA candidate who consistently exceeds expectations, achieves set targets and helps build our sales processes can expect to earn closer to $90,000 in commissions annually.\nWireless Support also provides a comprehensive benefits package including health insurance, dental insurance, vision insurance, paid time off, etc.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997822133"}