{"jobTitle": "Federal Programs Account Manager", "company": {"name": "SGS", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Retail Office Equipment, Consumer Services, and Oil and Gas", "description": "We are SGS – the world's leading testing, inspection and certification company. We are recognized as the global benchmark for sustainability, quality and integrity. Our 99,600 employees operate a network of 2,600 offices and laboratories, working together to enable a better, safer and more interconnected world.<br/><br/>This is a REMOTE opportunity!<br/><br/>Make an impact with SGS! Our Sales team makes a difference in the lives of our customers, colleagues and community. SGS works to ensure the health and safety of our environment and community as a key partner in the cleanup of contaminated sites, ensuring we all have safe drinking water and helping clients minimize their impact on the environment.<br/><br/>Our team’s goal is to provide above and beyond client service along with industry leading technical expertise and our Sales &amp; Business Development team is an important part of that objective. If you’re looking for an exciting opportunity in an incredible work environment with a team who is constantly looking for ways to exceed the needs of our clients, then this could be the role for you.<br/><br/>We’re looking for an individual with expertise in business development or client service and a passion for solution-based selling.<br/><br/>This position is responsible for the sale of environmental analytical services to existing and prospected federal program customers, as well as securing business opportunities to meet revenue targets specifically focused on PFAS.<br/><br/>Applying the sales process, the successful candidate will generate revenue for SGS environmental laboratories.<br/><br/>A day in the life of a Federal Programs Account Manager<br/><br/>The Federal Programs Account Manager collaborates with environmental consultants managing Federal programs to deliver on top line sales. The Federal Programs Account Manager pre-positions SGS in the marketplace with scientific leadership and technical differentiators which will be communicated through client meetings. The Federal Programs Account Manager continues to grow SGS position in the marketplace through participation with technical associations and committees.<br/><br/>Job Functions<br/><br/><ul><li>Responsible for top line revenue growth within assigned client portfolio.</li><li>Prioritizes new business development and prospecting of new accounts.</li><li>Project development and coordination with client and SGS Operations teams.</li><li>Positions SGS as thought leaders in the marketplace.</li><li>Pre-positions SGS for key projects.</li><li>Management of assigned account/portfolio in targeted geographical region.</li><li>Supports regional account managers in client meetings and presentations.</li><li>Represents SGS on industry working groups, committees and associations.</li><li>Provides market intelligence and client/industry feedback.</li><li>Monitors customer, market and competitor activity and provides feedback to leadership team.</li><li>Improves SGS market share via strategic account acquisition.</li><li>Manages customer expectations and contributes to a high level of customer satisfaction.</li><li>Represents SGS professionally and ethically in the marketplace.<br/><br/></li></ul>Qualifications<br/><br/><ul><li>Bachelor’s Degree in a related science field</li><li>Minimum 5 years of experience</li><li>Excellent communication and technology fluency</li><li>Ability to work under pressure and handle deadlines</li><li>Superior time management and organizational skills</li><li>Detailed knowledge of the industry and current events<br/><br/></li></ul>Additional Information<br/><br/>SGS is an Equal Opportunity Employer, and as such we recruit, hire, train, and promote persons in all job classifications without regard to race, color, religion, sex, national origin, disability, age, marital status, sexual orientation, gender identity or expression, genetics, status as a protected veteran, or any other characteristics protected by law.<br/><br/>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily with or without reasonable accommodations. The requirements listed above are representative of the knowledge, skills, and/or abilities required.<br/><br/>This job description should not be construed as an exhaustive statement of duties, responsibilities or requirements, but a general description of the job. Nothing contained herein restricts the company’s rights to assign or reassign duties and responsibilities to this job at any time.<br/><br/>If you are applying for a position within the United States and you have difficulty completing the on-line employment application because of a disability, please call 201-508-3149 for assistance and leave a message. You will receive a call back. Please note, this phone number is not for general employment information, but is only for individuals who are experiencing difficulty applying for a position due to a disability.", "postedDate": "1 week ago", "qualifications": {"required": "Bachelor’s Degree in a related science field, Minimum 5 years of experience, Excellent communication and technology fluency, Ability to work under pressure and handle deadlines, Superior time management and organizational skills, Detailed knowledge of the industry and current events"}, "skills": ["Sales", "Business Development", "Client Service", "Environmental Consulting", "Federal Programs", "PFAS", "Revenue Generation", "Market Intelligence", "Customer Satisfaction", "Industry Associations", "Technical Expertise", "Communication", "Technology Fluency", "Time Management", "Organizational Skills", "Industry Knowledge"], "url": "https://www.linkedin.com/jobs/view/3997630147"}