{"jobTitle": "Enterprise Open Source Sales Manager", "company": {"name": "Canonical", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Open source software is the new default in the enterprise, and Canonical is the new challenger to major enterprise software vendors.<br/><br/>We are profitable and growing our global enterprise sales organisation. We are hiring **regional sales managers** in Europe, Middle East, Africa, Latin America, Central America and North America, each of whom will lead a team of five to ten enterprise sales representatives.<br/><br/>We deliver better open source from the data center to cloud and edge. Our Linux distribution Ubuntu is now the leading platform for public cloud compute, and the favorite platform for software engineers, data scientists and AI developers. Our mission is to accelerate the adoption and quality of open source globally, and our goal is to ship the most software on the planet by cores. A tidal wave of open source innovation is the next phase of the entire enterprise software industry, and we aim to be the most compelling way to ride that wave.<br/><br/>Our customers include Global 500 enterprises and startups. We are expanding our product range from the base operating system - Ubuntu - to full enterprise solutions in infrastructure and applications. We can deliver software defined storage, private cloud solutions, container runtime environments, as well as databases, message queues, identity, observability, analytics, machine learning and web publishing capabilities. Customers love the idea that they can get security compliance and support for everything open source from a single company. Our goal is to have more solutions on tap than any other vendor, and we have built unique capabilities to make that possible across every cloud, every class of compute and every category of application.<br/><br/>Canonical provides licensed enterprise software products, commercial support, managed services, consulting and training services to customers who are deploying Ubuntu or open source applications on the cloud, in their data center, or to the connected device and IoT ecosystem. We are just over 1,000 colleagues in 70+ countries and over $250m in revenue, profitable, on a steady but relentless growth trajectory. We are almost entirely distributed, with leadership spread across many countries. We believe that talent is equally distributed across the globe, and we are excited to hire, develop, promote and ultimately trust a diverse group of exceptional leads to build the best, not biggest, enterprise software company.<br/><br/>We hire carefully and deliberately; our selection process is long and requires substantial work from applicants. It will take successful applicants three to six months to secure an offer. This is not a place to apply if you are in a rush to find a position, it is a worthwhile place to apply if you are ambitious and long-term in your thinking about your career and the dynamics which move the world forward. If you see clearly the rise of open source, and you understand the drivers of enterprise procurement and technical decision making, then you will understand why Canonical has such a tremendous long term advantage. You will also understand, given the ferocity of competition and the challenges of competing in a market of giants, that we have to set a very high bar for hiring and performance. In order to be a world leading company we select for exceptional ability as well as character, and then provide an environment which promotes teamwork and celebrates diligence, collaboration and effectiveness. All of those are easy to say but hard to do - at Canonical we are willing to be uncomfortable in pursuit of that excellence.<br/><br/>In building our sales team, we look for five things:<br/><br/><ul><li>Empathy for the customer - a real understanding of customer needs, industry-specific challenges, and a desire to help customers solve their business problems</li><li>High intellect - the ability to learn quickly, understand very complex subjects, and communicate clearly to build trust and confidence</li><li>Passion for technology - a fascination with the state of the art from brilliant people solving hard problems, and fierce competition for large prizes</li><li>Teamwork - a willingness to help others, to collaborate well with people from different disciplines, and to balance personal and team ambitions</li><li>Energy - the drive to motivate oneself and others to achieve the best result for the team and our customers<br/><br/></li></ul>Ubuntu is already very widely adopted which gives us a credible basis for conversations in the market. Nevertheless, it requires real work for sales professionals to build on that adoption to create trusted and profitable commercial relationships with the enterprises in their territory. Our product managers and marketing teams run campaigns to generate awareness, engagement and leads, but you will need to go beyond managing inbound interest to develop the potential of your territory. You will need judgement as to which industries and companies are ready to go deeper with open source and Canonical, and energy to develop relationships in advance of proven interest. We expect professional practice, territory and account planning, as well as clear, complete and continuous reporting on pipeline status and activity, using standard professional tools.<br/><br/>The successful candidate will carry an annual team bookings quota within their territory. They should be able to travel regionally for client engagement, industry conferences, and internationally for company events twice a year. They will be expected to demonstrate professionalism and effectiveness in managing their team. They will need to coach, mentor and lead by example. Their sales representatives are expected to prospect accounts for new business, maintain and develop existing relationships, and work with colleagues and partners on account strategy. They must be comfortable selling enterprise software, open source, cloud, virtualization, container technologies and technical software solutions to senior levels of the enterprise.<br/><br/><strong>Location:</strong> We are expanding our sales organisation globally and have open roles in every region.<br/><br/>What your day will look like<br/><br/><ul><li>Build and execute a territory plan to prioritize outreach and prospecting</li><li>Allocate portions of territory and accounts to sales representatives on your team</li><li>Identify and prioritise new logo accounts in your territory for account-based marketing and prospecting</li><li>Ensure that sales representatives have high quality account plans for existing accounts and priority prospects</li><li>Monitor new pipeline development by your team, through outreach, prospecting, local marketing, and industry events</li><li>Support contract closure to meet and exceed quarterly and annual bookings targets</li><li>Be mindful and proactive in achieving tactical and strategic objectives</li><li>Work with customer success to identify growth opportunities</li><li>Ensure your team maintain accurate pipeline data and forecasts within Salesforce</li><li>Represent the company, its solutions and software<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>Bachelor's level degree, preferably in engineering or computer science</li><li>Leadership and management skill</li><li>Experience of open source technology and solutions</li><li>Detail oriented with effective planning, organisation and reporting skill</li><li>Experience in enterprise software or technology sales planning and execution</li><li>Track record of achievement in sales targets and new account wins</li><li>Self-discipline and motivation to be successful in a distributed team</li><li>Professional written and spoken English, as well as any language that may be appropriate for your target market</li><li>Ability to travel for customer engagements, industry events and company events<br/><br/></li></ul><strong>Additional Skills Of Interest<br/><br/></strong><ul><li>Specific vertical experience, in particular finance, telco, health, energy, public sector, tech</li><li>Experience speaking at conferences or industry events<br/><br/></li></ul>What we offer you<br/><br/>We consider geographical location, experience, and performance when shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven commission structure. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>On-target earnings between USD 180k and USD 350k</li><li>Distributed work environment with twice-yearly team meetings in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Program</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a fully distributed company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/>Canonical is an equal opportunity employer<br/><br/>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "responsibilities": "Build and execute a territory plan to prioritize outreach and prospecting\nAllocate portions of territory and accounts to sales representatives on your team\nIdentify and prioritise new logo accounts in your territory for account-based marketing and prospecting\nEnsure that sales representatives have high quality account plans for existing accounts and priority prospects\nMonitor new pipeline development by your team, through outreach, prospecting, local marketing, and industry events\nSupport contract closure to meet and exceed quarterly and annual bookings targets\nBe mindful and proactive in achieving tactical and strategic objectives\nWork with customer success to identify growth opportunities\nEnsure your team maintain accurate pipeline data and forecasts within Salesforce\nRepresent the company, its solutions and software", "qualifications": {"required": "Bachelor's level degree, preferably in engineering or computer science\nLeadership and management skill\nExperience of open source technology and solutions\nDetail oriented with effective planning, organisation and reporting skill\nExperience in enterprise software or technology sales planning and execution\nTrack record of achievement in sales targets and new account wins\nSelf-discipline and motivation to be successful in a distributed team\nProfessional written and spoken English, as well as any language that may be appropriate for your target market\nAbility to travel for customer engagements, industry events and company events", "preferred": "Specific vertical experience, in particular finance, telco, health, energy, public sector, tech\nExperience speaking at conferences or industry events"}, "skills": ["Open Source", "Sales", "Enterprise Software", "Cloud", "Virtualization", "Container Technologies", "Technical Software Solutions", "Leadership", "Management", "Planning", "Organization", "Reporting", "Sales Planning", "Sales Execution", "Account Management", "Teamwork", "Communication", "English", "Travel"], "postedDate": "1 week ago", "benefits": "On-target earnings between USD 180k and USD 350k\nDistributed work environment with twice-yearly team meetings in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Program\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997388071"}