{"jobTitle": "Assistant Manager, CS Administration", "company": {"name": "Van Cleef & Arpels", "industry": "Retail Luxury Goods and Jewelry"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $85,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>Are you a good match? <br/><br/></strong>The ideal candidate for this role is required to have a bachelor’s degree or equivalent, along with a minimum of 3+ years of experience in customer service. This candidate should demonstrate the ability to respond quickly to changing workshop priorities, exhibit strong verbal, interpersonal and communication skills, and work effectively in a team while meeting deadlines. Experience with luxury consumer products is preferred, along with proficiency in SAP and Excel for data analysis and manipulation. Fluency in French would be considered an asset.<br/><br/><strong>What are we expecting from you? <br/><br/></strong>Our Workshop Team strives to maintain the Maison’s heritage of the finest Jewelry creations. We ensure that the aesthetics and craftsmanship of each creation meets the standards of the Maison’s rich history &amp; tradition. In addition, our Workshop works diligently to manage the timely, and safe delivery of our creations.<br/><br/>Reporting to the Senior Manager, Workshop Operations, you will be responsible for the daily flows of receiving and shipping after-sales and production. You will work in a team to guide the flow of product through its various processes in the most efficient and accurate way that will support the network of boutiques and external accounts for Van Cleef and Arpels.<br/><br/><strong>In This Role, You Will<br/><br/></strong><ul><li>Execute strategic processes to enforce repair lead times.</li><li>Communicate and collaborate with the CS Corporate team to meet customer expectations.</li><li>Evaluate service orders to identify the correct process for each repair.</li><li>Organize and appoint the next steps of each repair until it is ready to distribute for technical adjustments.</li><li>Arrange and execute the invoicing process of repairs for shipments. </li><li>Schedule and strategize the daily transfers and return to and from external subcontractors.</li><li>Prepare, analyze, and update anomaly reports from SAP daily.</li><li>Perform physical inventory against anomaly reports on a weekly basis.</li><li>Perform and inspect inventory counts to ensure accuracy monthly.<br/><br/></li></ul><strong>More than a role…we recruit for a career!<br/><br/></strong>By joining Van Cleef and Arpels, you will be part of a Maison where employee career development is at the heart of our ambition. Upon your arrival, you will be immersed in our enchanting world with trainings on our history, know-how as well as trainings about our creations.<br/><br/><strong>The Recruitment Process<br/><br/></strong>Please submit an application on-line. If your profile matches our search criteria, you will be contacted by the Talent Acquisition team for an interview. The recruitment process will consist of several interviews at various levels of the organization. Applicants must have valid work authorization for employment in the USA. Salary will be negotiated based on skills and prior work experience.<br/><br/>Richemont offers a generous compensation and benefits package for eligible employees.<br/><br/><strong>We Offer<br/><br/></strong>Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.<br/><br/>Expected Salary Range- $80K-$85K/yearly<br/><br/>This role is eligible for annual bonus<br/><br/>", "responsibilities": "Execute strategic processes to enforce repair lead times. Communicate and collaborate with the CS Corporate team to meet customer expectations. Evaluate service orders to identify the correct process for each repair. Organize and appoint the next steps of each repair until it is ready to distribute for technical adjustments. Arrange and execute the invoicing process of repairs for shipments. Schedule and strategize the daily transfers and return to and from external subcontractors. Prepare, analyze, and update anomaly reports from SAP daily. Perform physical inventory against anomaly reports on a weekly basis. Perform and inspect inventory counts to ensure accuracy monthly.", "qualifications": {"required": "The ideal candidate for this role is required to have a bachelor’s degree or equivalent, along with a minimum of 3+ years of experience in customer service. This candidate should demonstrate the ability to respond quickly to changing workshop priorities, exhibit strong verbal, interpersonal and communication skills, and work effectively in a team while meeting deadlines.", "preferred": "Experience with luxury consumer products is preferred, along with proficiency in SAP and Excel for data analysis and manipulation. Fluency in French would be considered an asset."}, "skills": ["Customer Service", "Communication", "Teamwork", "SAP", "Excel", "French"], "postedDate": "1 week ago", "benefits": "Richemont offers a generous compensation and benefits package for eligible employees. Employee wellbeing is a top priority at Richemont. We offer a comprehensive benefits program to support employees and their loved ones. Our core benefits include medical, dental, and vision programs. Health savings and flexible spending accounts are also available. The company offers income protection solutions including life insurance, disability benefits, and 401(k) with employer match. Understanding the importance of work-life balance, our total rewards include paid time off, a wellness reimbursement benefit, and access to the employee assistance program. Employees are encouraged to make a difference in their local communities with volunteer days off, supporting initiatives that drive change.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3997646065"}