{"jobTitle": "Agente de servicio al cliente PT JFK", "company": {"name": "avianca", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Part-time", "employmentType": "Part-time", "jobFunction": "Other, Administrative, and Customer Service", "industry": "Airlines and Aviation", "description": "<strong>Despega hacia tu próximo destino</strong><p><br/></p><p>En Avianca sabemos que <strong>¡VAMOS A GANAR! </strong>con personas talentosas, divertidas, que aprendan rápidamente, que se motivan frente a los retos y disfrutan trabajando en ambientes diversos e inclusivos.</p><p><br/></p><p>Los desafíos de la industria aérea y los resultados que nos hemos propuesto alcanzar a 2025, son el escenario perfecto para quienes se hayan propuesto desarrollar nuevas capacidades, afinar sus fortalezas y hacer parte del orgullo de ser Avianca.</p><p><br/></p><p><strong>Estos son los detalles de la vacante que te ofrecemos para hacer parte de nuestro equipo:</strong></p><p><br/></p><p><strong>Agente de Servicio al Cliente Part Time - JFK</strong></p><p><br/></p><p>Su objetivo es realizar y asegurar excelencia en el servicio, brindando un trato ágil y oportuno; con el fin de cumplir con los deberes y responsabilidades establecidos en los manuales operativos y del Sistema de Gestión Integral.</p><p><br/></p><p>La agilidad, adaptabilidad y autonomía son fichas esenciales en este desafío, las responsabilidades son:</p><p><br/></p><p>•Atender, orientar y direccionar al pasajero en cada punto de contacto, de acuerdo con lo establecido en los procedimientos; con el fin de garantizar que la operación de los vuelos se maneje de forma segura y así obtener calidad en el servicio.</p><p>•Asegurar un excelente servicio al cliente, a través de la satisfacción de las necesidades y requerimientos del mismo; con el fin de garantizar el mejoramiento continuo de la organización</p><p>•Apoyar al Supervisor, Agente Líder u otros colaboradores, en caso de retrasos, vuelos interrumpidos, sobreventa o cancelaciones, realizando las funciones que se le asignen; con el fin de garantizar el mejoramiento continuo de la organización.</p><p><br/></p><p>Los requisitos convenientes para el cargo son:</p><ul><li><strong>Formación académica: </strong>Highschool finalizado</li><li><strong>Experiencia laboral:</strong> experiencia en posiciones de servicio al cliente (deseable).</li><li><strong>Requisitos: </strong>flexibilidad de horarios y nocturnidad</li><li><strong>Idioma:</strong> inglés B2 intermedio</li></ul><p><br/></p><p><strong>Ubicación: </strong>JFK International Airport, USA.</p><p><br/></p><p>¿Quieres abordar?</p>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3997376572"}