{"jobTitle": "Product Manager", "company": {"name": "Learnosity", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Product Management and Marketing", "industry": "IT Services and IT Consulting", "description": "At Learnosity, we believe that education and learning opportunities should be equitable, inclusive, and accessible to all. Our mission is to advance education and learning worldwide with best-in-class technology.\n\nLearnosity is the global leader in assessment solutions, providing experiences that are digital, dynamic, and designed to fit modern lifestyles and learning habits.\n\nWe are looking for an Educator who is looking to transition into Product Management, who is passionate about transforming the learning landscape through digital assessment.\n\nBe at the forefront of educational innovation, and make a positive difference to millions of learners worldwide. With over 40 million active learners and delivering 19 billion questions annually this is a genuine opportunity to make a significant impact. If you are ready to make a difference and drive the future of education, we want you on our team!\n\n**What is the role?<br/><br/>**\n\nWe are looking for a STEM Educator with a degree and experience in teaching STEM subjects for K12 or Higher Education students, to help influence and grow our K12 and Higher Ed product offerings. \n\nReporting to the VP of Product you'll be working closely with the Learnosity and Questionmark Product teams, as well as colleagues from across the business. You'll be helping to define our Assessment APIs product future and evolution, while also assisting across a broader range of our Product lines, including Questionmark and our standalone AI offerings. \n\nYou will play a key role in managing product direction for K12 and Higher Ed markets, with an emphasis on STEM. Following the SAFe framework, you will triage inputs from Customers and Prospects, prioritize and analyze problems to solve, support Product Owners, Design and Engineering to develop solutions and be responsible for Go to Market of features, working with colleagues in Marketing, Sales, Customers Success and Support. \n\nThis is a permanent full-time, remote role open to candidates based in the West Coast of the US (working on Pacific time). You will be working very closely with a diverse team based in Sydney, Australia, as well as Customers and Customer facing colleagues across North America and sometimes in Europe. The ideal candidate will be willing to take calls out of standard working hours on a regular basis to accommodate the time zone difference between Australia, North America and Europe. \n\n**Who should apply?<br/><br/>**\n\nOur ideal candidate would be someone who has experience in studying and teaching mathematics or other STEM-related subjects, who is interested in moving their career into Product Management. While previous product management experience would be a bonus it is not mandatory for this role, we are looking for transferable skills which would enable a smooth transition into learning the skills required to be a Product Manager.\n\n \n\n**In this role you will<br/><br/>**\n<ul> <li>Be the voice of K12 and Higher Ed customers</li> <li>Stay abreast of market trends, emerging technologies, and customer needs, providing insights to inform strategic decision-making.</li> <li>Manage and groom a long term, market-aligned product roadmap</li> <li>Communicate the product vision and roadmap to the agile development teams.</li> <li>Define feature level success measures and track product metrics to evaluate performance and inform future iterations.</li> <li>Collaborate with stakeholders, customers, and the design and development teams to gather requirements, refine designs and features, and ensure a clear understanding of the product vision.</li> <li>Work with Agile teams to plan and schedule product releases, considering dependencies and constraints.</li> <li>Identify potential risks to product delivery and proactively address them to mitigate impact.</li> <li>Accept new features for release.</li> <li>Ensuring appropriate promotion for released features, to position new features for adoption or to learn for future iterations. Working with Marketing, Sales, Solutions, Customer Success and Support through the product and feature launch processes.</li> <li>Work closely with customers and internal stakeholders to ensure continuous feedback</li> <br/><br/></ul>\n\n**Requirements<br/><br/>**\n\n**To be considered, you will need<br/><br/>**\n<ul> <li>A degree in a STEM discipline (e.g. Math, Math Education, Physics, Chemistry)</li> <li>Teaching experience in STEM</li> <li>Sound understanding of students' and educators' online curriculum needs</li> <li>Reside on the West Coast of the United States in PST</li> </ul>\n\n**It would also be nice to have**\n<ul> <li>An understanding of Product Management or Product Management experience</li> <li>An understanding of Web Accessible product design</li> <li>Working knowledge of agile development methodologies</li> <li>A passion for Educational Technology (EdTech)</li> <li>An understanding of web technologies </li> <li>Experience working with technical teams</li> </ul>\n\n**Skills required to transition into Product Management<br/><br/>**\n\nFor those who have not had exposure with Product Management, we are seeking the following transferable skills which would enable a smooth transition. \n<ul> <li>A good collaborator who maintains harmonious working relationships with other people and teams </li> <li>Positive, respectful and have the ability to build trusting relationships</li> <li>Excellent communicator, able to deliver messages in a simple and effective way and tailor to different audiences</li> <li>A growth mindset, flexible and open to ongoing learning  </li> <li>Comfortable dealing with ambiguity and change</li> <li>An optimistic role model, projecting a positive and professional image both internally and externally</li> <li>The ability to work autonomously and under pressure</li> <li>Experience in setting direction and following through on it</li> <li>Well organised, efficient with sound documentation skills</li> <li>Experienced in researching, collating and interpreting data</li> <br/><br/></ul>\n\n**Benefits<br/><br/>**\n\n**Working with us<br/><br/>**\n\nBeing part of the Learnosity team is a commitment to push yourself and those around you to do better, constantly adapt and learn new methodologies, and be able to apply yourself to any challenge, whether you're just starting out or a veteran of the industry.\n\nWe are a values-based company, and our 4 core values are the basis for how we work and what we do every day. Being a part of the Learnosity team means that you'll get to join us in living out these values:\n<ul> <li>We live to learn</li> <li>We aim higher</li> <li>We do the right thing</li> <li>Our success is better shared</li> </ul>\n\nWe encourage staff to get involved in individual advancement and professional certification programmes and will sponsor certification exams where appropriate. \n\nWe are keen to try and maximise the value of your time and will design a schedule around your preferred working style, whether you need to accommodate a school or daycare run, avoid busy commute periods, a gym or sports club schedule, we'll do our best to accommodate you.<br/><br/>Learnosity's benefits package includes:\n<ul> <li>Working from home </li> <li>Flexible work practices</li> <li>Generous Health Care coverage</li> <li>401k Plan and match </li> <li>Access to annual learning and development fund</li> <li>Career support</li> <li>20 days annual leave</li> <li>+2 days milestone leave after 3 years, +3 after 5 years</li> <li>10 days paid sick leave</li> <li>Generous paid parental leave (primary and secondary carers)</li> <li>Uprise Employment Assistance Program</li> </ul>\n\n\n\nLearnosity is committed to ensuring equal employment opportunity to all qualified individuals. We believe a diverse workforce will enhance our ability to fulfil our mission of advancing education and ed-tech in general.\n\nFind out more about your career at Learnosity at learnosity.com/careers/\n\nPlease see our Recruitment Privacy Policy\n\n\nSalary &amp; package dependent on experience.\n\n\n**Please only contact us if you are a candidate interested in applying for this role. You must have the right to live and work in USA to apply - No Recruiters Please.**\n\n", "responsibilities": "Be the voice of K12 and Higher Ed customersStay abreast of market trends, emerging technologies, and customer needs, providing insights to inform strategic decision-making.Manage and groom a long term, market-aligned product roadmapCommunicate the product vision and roadmap to the agile development teams.Define feature level success measures and track product metrics to evaluate performance and inform future iterations.Collaborate with stakeholders, customers, and the design and development teams to gather requirements, refine designs and features, and ensure a clear understanding of the product vision.Work with Agile teams to plan and schedule product releases, considering dependencies and constraints.Identify potential risks to product delivery and proactively address them to mitigate impact.Accept new features for release.Ensuring appropriate promotion for released features, to position new features for adoption or to learn for future iterations. Working with Marketing, Sales, Solutions, Customer Success and Support through the product and feature launch processes.Work closely with customers and internal stakeholders to ensure continuous feedback", "qualifications": {"required": "A degree in a STEM discipline (e.g. Math, Math Education, Physics, Chemistry)Teaching experience in STEMSound understanding of students' and educators' online curriculum needsReside on the West Coast of the United States in PST", "preferred": "An understanding of Product Management or Product Management experienceAn understanding of Web Accessible product designWorking knowledge of agile development methodologiesA passion for Educational Technology (EdTech)An understanding of web technologies Experience working with technical teams"}, "skills": ["STEM", "Product Management", "Web Accessible product design", "Agile development methodologies", "Educational Technology (EdTech)", "Web technologies", "Technical teams"], "postedDate": "1 week ago", "benefits": "Working from home Flexible work practicesGenerous Health Care coverage401k Plan and match Access to annual learning and development fundCareer support20 days annual leave+2 days milestone leave after 3 years, +3 after 5 years10 days paid sick leaveGenerous paid parental leave (primary and secondary carers)Uprise Employment Assistance Program", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997302997"}