{"jobTitle": "Content Creator & Marketing Manager", "company": {"name": "Lucky Lab Coffee", "location": "Austin, Texas Metropolitan Area"}, "location": "Austin, Texas Metropolitan Area", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Food and Beverage Services", "description": "Lucky Lab is a lifestyle coffee shop brand that is quickly expanding in the Austin and surrounding area markets.  We have a serious passion for good coffee and happy pups! In growing our brand we are looking to add a social media manager + content creator to our talented team.  You will be responsible for creating effective and beautiful communication in a variety of media, including, but not limited to digital, video, photography, and whatever other crazy ideas you come up with. <br/><br/>A look at your day-to-day - after all YOU are running this department!<ul><li>Lead brainstorms, concept, collaborate and present innovative and exciting creative that garner buy-in while netting measurable results</li><li>Lead the creative on building out all social media channels, including creating a content calendar, sourcing content, finalizing content and copy, etc.</li><li>Be able to work collaboratively with the marketing team to create exciting and compelling campaigns</li><li>Be a steward of and maintain the Lucky Lab Coffee brand in all creative concepts created in-house</li><li>Must be a team player, able to work within budgets and tight deadlines on multiple campaigns in a fast-paced environment, while maintaining a service-oriented attitude</li><li>Creative evolution – stay up to date with branding, social and advertising in all mediums</li><li>Photography and video post-production and editing</li><li>Love dogs, people, coffee and community!</li></ul><br/><br/>Now for a little bit about you….<ul><li>Experienced with consumer product brands</li><li>Experienced with creative content on social media platforms</li><li>Experienced with content analytics - ability to interpret content analytics and apply takeaways that inform strategy</li><li>Experienced with writing compelling copy - a storyteller!</li><li>Experience in hosting, building an agenda and present concepts and campaigns to key stakeholders for final approval</li><li>Strategic thinker with the ability to solve problems, even when they are not fully defined</li><li>Video and photography skills</li><li>Ability to present and sell creative ideas</li><li>Expertise in Creative Suite, all social media platforms and ability to learn new software, as needed</li><li>Mac user with own computer/tablet</li><li>Mostly onsite position (~20-25 hrs a week onsite)</li><li>2 or more years of direct social media and content creation work</li><li>Goal oriented with high standards for excellence</li></ul><br/><br/>Please email your resume and portfolio to to courtney@luckylabcoffee.com.", "postedDate": "1 week ago", "skills": ["Social Media", "Content Creation", "Marketing", "Branding", "Photography", "Video Editing", "Creative Suite", "Social Media Platforms", "Content Analytics", "Copywriting", "Strategic Thinking", "Problem Solving", "Presentation Skills"], "url": "https://www.linkedin.com/jobs/view/3997536778"}