{"jobTitle": "Recruiting Lead", "company": {"name": "Tata Electronics Pvt. Ltd.", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Human Resources", "industry": "Semiconductor Manufacturing", "description": "There are more than one million of us. And counting ... you can be the next one.\nWe are Tata\nThe **Tata Group** is a group of companies headquartered in Mumbai, India Established in 1868, it is India's largest conglomerate, with products and services in over 150 countries, and operations in 100 countries.\n<br/>\n1868: A startup. Today: A global enterprise.\n66% of Tata Sons is owned by trusts\nThe Tata Trusts promote education, health, culture and livelihood initiatives in India.\nMore than $165 billion in revenues in 2023-24. The combined market cap of Tata companies was $365 billion as of March 31st, 2024.\n<br/>\nAbout Tata Electronics\nTata Electronics will bring to India a portfolio of cutting-edge semiconductor technologies, advanced skill set and talent, and a network of semiconductor manufacturing suppliers and ecosystem partners, resulting in foundational development of indigenous semiconductor ecosystem in India.\n<br/>\nAbout the role\n<ul><li>This position will play a significant role in sourcing, attracting, and hiring top talent to meet TEPL's hiring needs with people who represent our values and bring a richness of skills, talents, and diverse backgrounds.</li><li>You will build TEPL's Talent acquisition talent pipeline and key activities including executive and leadership-level candidate identification and engagement. This role is critical to TEPL's long-term success and will be a strategic partner with executive leaders at the company.</li></ul><br/>\nResponsibilities\n<ul><li>Develop and own search strategies and deliver research against those strategies for executive searches across various technical functions - Manufacturing, Global Supply Chain, Engineering, management, etc.</li><li>Provide effective project management, drive searches forward and create consistent equitable experiences for hiring managers/clients, applicants and colleagues</li><li>Develop and implement multi-channel pipeline strategies to meet hiring demand targets . Develop pipeline strategy best practices and continues to research and design new methods to advance the Sourcing function and meet the evolving changes in the market.</li><li>Identifies current and future talent needs through proactive exploration and analysis of market supply. Proactively consults leaders to provide clarity of talent market insights.</li><li>Assesses and defines talent gaps and hiring needs (e.g., skills, volume of hires) of a large-scale or complex/multi-discipline/multi-org. Presents this information to hiring managers and/or business leadership team, recommending and driving hiring plans and strategies to meet needs.</li><li>Brings critical or high level candidates/niche hard to find talent.</li><li>Performs deep analysis of external market data leveraging industry/market expertise, providing market and channel insights to the business to recommend and drive strategies and talent acquisition initiatives.</li><li>Contribute to continuous improvement and innovation in the efficiency and effectiveness of our systems, services, and processes.</li></ul><br/>\n<strong>The experience we’re looking to add to our team:</strong>\n<ul><li>15+ years of experience in research at an executive search or management consulting firm, or executive sourcing, recruiting within a corporate environment.</li><li>Experience in project and process management.</li><li>Ability to work in fast-paced environment and maintain a sense of urgency</li><li>Client-centered mentality and passion for customer service</li><li>Prior experience working in the Manufacturing or semiconductor space required.</li></ul><p></p>", "postedDate": "1 week ago", "skills": ["Research", "Executive Search", "Management Consulting", "Sourcing", "Recruiting", "Project Management", "Process Management", "Manufacturing", "Semiconductor"], "url": "https://www.linkedin.com/jobs/view/3997102527"}