{"jobTitle": "Account Executive", "company": {"name": "M&C Saatchi UK", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Not Applicable", "salary": {"amount": "$68,000 – $72,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "As an Account Executive at SS&K, you will serve as the primary point of contact for all internal tactical communications and basic project management on the business. This role provides support to mid-and-senior account leadership to ensure that all agency opportunities are leveraged and executed successfully and manages small projects with minimal oversight.", "responsibilities": "Take pride in creating an organized way of working for the account internally and with the client, with timelines and project management, budget and communication. You are a master of the details.\nYou are hungry to learn and take advantage of opportunities to learn about other disciplines to build your integrated marketing skills and broaden your perspective.\nYou demonstrate a can-do attitude and are resourceful, curious and not afraid to figure it out without always having a roadmap.\nYou are a strong communicator with excellent writing skills and the ability to craft a clear and persuasive argument.\nYou are a poised and effective presenter.\nYou take responsibility and are accountable for the quality and delivery of our work.\nYou are ambitious—for yourself, our clients, the agency and our work.\nYou believe that what we do is important, meaningful, and wherever possible, fun.", "qualifications": {"required": "Agency experience preferred\nExperience with integrated campaigns (strategic and creative development and production).\nAn effective communicator, both written and verbal\nA great listener, able to take in information and quickly sass out what’s next.\nOrganized and detail oriented.\nA multi-tasker that can handle the pressure of several assignments at once.\nResourceful and inquisitive\nPositive outlook and good people skills\nWell-versed in Microsoft Office, Google Workspace\nSome travel is required.", "preferred": null}, "skills": ["Communication", "Project Management", "Marketing", "Microsoft Office", "Google Workspace"], "postedDate": "1 month ago", "applicationDeadline": "Tuesday, 14th May 2024", "benefits": "We offer a competitive salary, a comprehensive employer subsidized benefits package which includes group medical, dental and vision coverage, Health Savings Account, 401k retirement plan with annual company match, employee wellness, commuter benefits and cellular phone allowance, generous paid time off and employee volunteer day to encourage social responsibility giving time to the non-profit, community service or charity of your choice.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3997919399"}