{"jobTitle": "Senior Account Executive", "company": {"name": "SADA, An Insight company", "industry": "Technology, Information and Internet", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100,000-150,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Join SADA as a Senior Account Executive!<br/><br/><strong>Your Mission <br/><br/></strong>As a <strong>Senior Account Executive</strong> at SADA, you will play a critical role in the Customer Growth Organization focusing on delivering solutions, services and customer outcomes. You will build trusted relationships with c-suite executives and sell business-transforming solutions and services that enable enterprise customers to operate at the cutting edge of cloud computing. You will be customer-centric, always searching for a way to unlock business value.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Demonstrate an understanding of Google Cloud Platform offerings and the business problems they solve</li><li>Demonstrate an understanding of the transfer of value that exists when selling professional services, and operate knowledgeably regarding the corresponding deal structures and purchase mechanics.</li><li>Establish and maintain strong co-sell relationships with key partners like Google Cloud and relevant ISVs</li><li>Be the CEO of the sales process by masterfully orchestrating internal resources, including Cloud Engineers, Solution Engineers, Customer Success Managers, Executive Sponsors, and more.</li><li>Effectively structure, write, deliver proposals and presentations, and overcome objections.</li><li>Lead the development and execution of overall long-term strategy for an account aligned to customer business objectives.</li><li>Share the WHY SADA value proposition for existing and/or new customers</li><li>Build executive relationships with customers to help influence their long-term technology and business decisions.</li><li>Be viewed as a trusted advisor by bringing compelling insights and ideas with follow-through execution.</li><li>Source, qualify, and close sales with both existing and greenfield accounts, leading with solutions and professional services</li><li>Build a robust pipeline consisting of large and medium size deals to ensure you achieve both your bookings and revenue targets.</li><li>Manage and effectively communicate your sales forecast, including sales pipeline status and potential to achieve target bookings, as well as upside and downside risks to achieving target bookings.</li><li>Build a sound knowledge of Google Cloud, passing your Cloud Digital Leader Certification within 3 months of joining SADA. </li><li>Be a team player, always strive to support your teammates and the wider SADA family. A can do attitude is key in this role. <br/><br/></li></ul><strong>Pathway to Success <br/><br/></strong><strong>#ChangeTheGame</strong>: At SADA, in the Customer Growth Organization (CGO), we are in the business of change. The Customer is at the center of everything we do. Companies that lead with the customer at the center always win. We are focused on delivering critical business outcomes with leading-edge technology that is ever-evolving. We embrace change enthusiastically and encourage agility. The CGO team is being asked to evolve in a number of ways to focus more on services, consumption growth, and outcome-based selling methods. Change is inevitable, and successful candidates embrace this change to continuously expand their skills, preparing for future customer needs.<br/><br/><strong>Expectations<br/><br/></strong>Required Travel - 25% travel to customer sites, conferences, and other related events.<br/><br/>Customer Facing - You will interact with customers on a regular basis, sometimes daily, other times weekly/bi-weekly. Common touchpoints occur when qualifying potential opportunities, at project kickoff, throughout the engagement as progress is communicated, and at project close. You can expect to interact with a range of customer stakeholders, including engineers, technical project managers, and executives.<br/><br/>Onboarding/Training - The first several weeks of onboarding are dedicated to learning and will encompass learning materials/assignments and compliance training, as well as meetings with relevant individuals. Details of the timeline are shared closer to the start date.<br/><br/><strong>Required Qualifications:<br/><br/></strong><ul><li>Bachelor's Degree or Equivalent Experience.</li><li>8+ years experience selling professional and/or managed services in the technology industry </li><li>Demonstrated record of consistently exceeding sales goals</li><li>Understanding outcome-based selling is critical</li><li>Ability to speak intellectually about GCP, Google Workspace, and managed/ professional services </li><li>Ability to negotiate contracts, deliverables, and price</li><li>Experience developing outcome-based sales proposals</li><li>Strong executive presence; great verbal communication and presentation skills<br/><br/></li></ul><strong>Preferred Experience <br/><br/></strong><ul><li>Experience selling Google Cloud products and services or other public cloud offerings. </li><li>Confident and comfortable in board-room scenarios, providing advice to senior leadership and secure trusted advisor status. </li><li>Experience in value selling. You will be able to run Discovery sessions with multiple lines of business to understand customer pain points and business objectives.</li><li>Work collaboratively with technical resources to align solutions and services to solve these problems and ultimately help transform and evolve their business.</li><li>Demonstrated success with large, complex commercial and legal negotiations working with procurement, legal, and business teams.<br/><br/></li></ul>The base salary range for this full-time position is $100,000-$150,000 + sales incentive (commission) + benefits. Within the range, individual pay is determined based on job-related skills, experience, relevant education/certification or training, and work location<br/><br/><strong>About SADA An Insight company<br/><br/></strong><strong>Values:</strong> SADA stands for inclusion, fairness, and doing the right thing. From our very beginning, we've championed a diverse workplace where we support and learn from each other, amplifying the impact we make with our customers. We're proud that our teams are composed of contributors who represent a wide array of backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer. Our five core values are the foundation of everything we do:<br/><br/><ul><li>Make Them Rave</li><li>Be Data Driven</li><li>Think One Step Ahead</li><li>Drive Purposeful Impact</li><li>Do The Right Thing<br/><br/></li></ul><strong>Work with the Best</strong>: SADA has been the largest Google Cloud partner in North America since 2016 and, for the seventh year in a row, has been named a Google Global Partner of the Year . This year, SADA was named a Google Cloud Global Partner of the year 2024. SADA has also been awarded Best Place to Work year after year by the Business Intelligence Group and Inc. Magazine, and was recognized as a Niche Player in the 2023 Gartner® Magic Quadrant™ for Public Cloud IT Transformation Services.<br/><br/><strong>Benefits</strong>: Unlimited PTO, paid parental leave, competitive and attractive compensation, performance-based bonuses, paid holidays, generous medical, dental, vision plans, life, short and long-term disability insurance, 401K/RRSP with match, as well as Google-certified training programs and a professional development stipend.<br/><br/><strong>Business Performance:</strong> SADA has been named to the INC 5000 Fastest-Growing Private Companies list for the last 10+ years in a row, garnering Honoree status. CRN has also named SADA on the Top 500 Global Solutions Providers list for the past 5 years. The overall culture continues to evolve with engineering at its core: <em>3200+ projects completed, 4000+ customers served, 10K+ workloads, and 30M+ users migrated to the cloud.<br/><br/></em><em>To request reasonable accommodation to participate in the job application or interview process, contact careers@sada.com. SADA complies with federal and state/provincial disability laws and makes reasonable accommodations for applicants and candidates with disabilities.</em>", "responsibilities": "As a Senior Account Executive at SADA, you will play a critical role in the Customer Growth Organization focusing on delivering solutions, services and customer outcomes. You will build trusted relationships with c-suite executives and sell business-transforming solutions and services that enable enterprise customers to operate at the cutting edge of cloud computing. You will be customer-centric, always searching for a way to unlock business value.", "qualifications": {"required": "Bachelor's Degree or Equivalent Experience.\n8+ years experience selling professional and/or managed services in the technology industry \nDemonstrated record of consistently exceeding sales goals\nUnderstanding outcome-based selling is critical\nAbility to speak intellectually about GCP, Google Workspace, and managed/ professional services \nAbility to negotiate contracts, deliverables, and price\nExperience developing outcome-based sales proposals\nStrong executive presence; great verbal communication and presentation skills", "preferred": "Experience selling Google Cloud products and services or other public cloud offerings. \nConfident and comfortable in board-room scenarios, providing advice to senior leadership and secure trusted advisor status. \nExperience in value selling. You will be able to run Discovery sessions with multiple lines of business to understand customer pain points and business objectives.\nWork collaboratively with technical resources to align solutions and services to solve these problems and ultimately help transform and evolve their business.\nDemonstrated success with large, complex commercial and legal negotiations working with procurement, legal, and business teams."}, "skills": ["Google Cloud Platform", "Google Workspace", "Sales", "Business Development", "Customer Relationship Management", "Negotiation", "Proposal Writing", "Presentation Skills", "Executive Presence", "Cloud Computing", "Managed Services", "Professional Services", "Value Selling", "Outcome-Based Selling"], "postedDate": "1 week ago", "benefits": "Unlimited PTO, paid parental leave, competitive and attractive compensation, performance-based bonuses, paid holidays, generous medical, dental, vision plans, life, short and long-term disability insurance, 401K/RRSP with match, as well as Google-certified training programs and a professional development stipend.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3997032881"}