{"jobTitle": "Account Executive, Men’s", "company": {"name": "Versace", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "60,000.00/yr - 84,000.00/yr", "currency": "USD"}, "jobFunction": "Sales, Analyst, and Other", "industry": "Retail Apparel and Fashion, Retail, and Retail Luxury Goods and Jewelry", "description": "<strong>Who You Are:</strong>\n<p>You are entrepreneurial, energetic, and have a can-do attitude. You are communicative, collaborative, and are results-driven. You are well organized, develop and manage relationships with our wholesale partners while simultaneously adapting to the ever-evolving retail landscape and needs. You are ambitious in finding solutions and a supportive team member.</p>\n<p><br/></p>\n<p><strong>What You’ll Do: </strong></p>\n<ul>\n<li><strong>Manage Daily Relationships:</strong> Develop and maintain strong relationships with accounts and license partners, with a focus on specialty, UW &amp; BW, SLG, Belts, and soft accessories categories. Ensure high levels of collaboration and service in partnership with the dedicated customer service team.</li>\n<li><strong>Collaborate with Senior Wholesale Team:</strong> Work closely with senior wholesale team members to support markets, plan budgets, develop sales strategies, analyze sales data, conduct market appointments, secure orders, and provide insightful collection feedback, all while meeting or exceeding budget targets.</li>\n<li><strong>Sales Analysis &amp; Strategy:</strong> Create detailed sales analyses (weekly, monthly, and end-of-season) using advanced Excel and analytical skills, ensuring strategies are data-driven and aligned with business goals.</li>\n<li><strong>Execute Sales Strategies:</strong> Implement and execute sales strategies as directed by leadership, ensuring smooth operations and alignment with broader company objectives.</li>\n<li><strong>Understanding Operations: </strong>Have a complete understanding of Department Store selling reports, EDI processes, RTV processes, data entry processes to ensure smooth operations between Versace and the stores.</li>\n<li><strong>Event Planning &amp; Coordination:</strong> Organize and execute in-store events such as trunk shows, clinics, selling days, and seminars, enhancing brand visibility and driving sales.</li>\n<li><strong>Seasonal Reporting:</strong> Create and update comprehensive seasonal reports, including market comments, analysis of slow and best sellers, and performance metrics for overseeing categories.</li>\n<li><strong>Regional Store Visits:</strong> Conduct store visits across the NAM region to monitor performance, gather insights, and strengthen relationships with retail partners.</li>\n<li><strong>New Business Development:</strong> Proactively identify and engage new business opportunities through targeted market research, store visits, and networking, expanding the client base within the showroom.</li>\n<li><strong>Support Merchandising &amp; Regional Needs:</strong> Provide ongoing support to the Men’s manager and merchandising teams, including regional pricing, markdowns, assortment planning, competitive landscape analysis, and regional product needs assessment.</li>\n<li><strong>Replenishment &amp; Growth Initiatives:</strong> Oversee replenishment and reorder processes within assigned categories, ensuring consistent inventory flow and contributing to growth initiatives alongside the Men’s manager.</li>\n<li><strong>Special Projects &amp; Product Knowledge:</strong> Assist with sales-driving special projects and create tailored buy books and product knowledge decks for partners by category each season.</li>\n</ul>\n<p><br/></p>\n<p><strong>You’ll Need to Have: </strong></p>\n<ul>\n<li>Bachelor's degree in business / fashion merchandising is preferred </li>\n<li>Minimum 3+ years of previous experience in a sales-driven environment</li>\n<li>Excellent analytical skills, strong command of Microsoft Excel, and an ability to multitask effectively</li>\n<li>Keen awareness of the customer and brand profile of the business</li>\n<li>Team-oriented mindset with excellent interpersonal skills for interacting and networking with customers and suppliers</li>\n<li>The ability to travel </li>\n<li>Superior oral and written communications skills</li>\n<li>Superior Presentation skills</li>\n</ul>\n<p><br/></p>\n<p><strong>Perks:</strong></p>\n<ul>\n<li>Generous Paid Time Off &amp; Holiday Schedule </li>\n<li>Summer Fridays</li>\n<li>Internal mobility across Versace, Jimmy Choo and Michael Kors </li>\n<li>Cross-brand Discount</li>\n<li>Exclusive Employee Sales</li>\n<li>Fav 5 Cards (MK Discount for friends and family)</li>\n<li>401k Match</li>\n<li>Paid Parental Leave</li>\n<li>Thrive Wellness Program </li>\n<li>Commuter Benefits</li>\n<li>Gym Discounts</li>\n</ul>\n<p><br/></p>\n<p><strong>At Capri, we are all responsible for creating a diverse and inclusive workplace. We try to inspire change and growth within each other and believe success is a result that comes from our differences. Capri is proud to be an equal opportunity employer committed to inclusivity regardless of age, sex, sexual orientation, gender identity, genetic characteristics, race, color, creed, religion, ethnicity, national origin, alienage, citizenship, disability, marital status, military status, pregnancy, or any other legally-recognized protected basis prohibited by applicable law. M/D/F/V</strong></p>\n<p><br/></p>\n<p><strong><em>In compliance with certain Pay Transparency laws, employers are required to disclose a salary range. The salary for this position will vary based on role requirements, skill set and years of experience.</em></strong></p><p></p>", "responsibilities": "Manage Daily Relationships: Develop and maintain strong relationships with accounts and license partners, with a focus on specialty, UW & BW, SLG, Belts, and soft accessories categories. Ensure high levels of collaboration and service in partnership with the dedicated customer service team.\nCollaborate with Senior Wholesale Team: Work closely with senior wholesale team members to support markets, plan budgets, develop sales strategies, analyze sales data, conduct market appointments, secure orders, and provide insightful collection feedback, all while meeting or exceeding budget targets.\nSales Analysis & Strategy: Create detailed sales analyses (weekly, monthly, and end-of-season) using advanced Excel and analytical skills, ensuring strategies are data-driven and aligned with business goals.\nExecute Sales Strategies: Implement and execute sales strategies as directed by leadership, ensuring smooth operations and alignment with broader company objectives.\nUnderstanding Operations: Have a complete understanding of Department Store selling reports, EDI processes, RTV processes, data entry processes to ensure smooth operations between Versace and the stores.\nEvent Planning & Coordination: Organize and execute in-store events such as trunk shows, clinics, selling days, and seminars, enhancing brand visibility and driving sales.\nSeasonal Reporting: Create and update comprehensive seasonal reports, including market comments, analysis of slow and best sellers, and performance metrics for overseeing categories.\nRegional Store Visits: Conduct store visits across the NAM region to monitor performance, gather insights, and strengthen relationships with retail partners.\nNew Business Development: Proactively identify and engage new business opportunities through targeted market research, store visits, and networking, expanding the client base within the showroom.\nSupport Merchandising & Regional Needs: Provide ongoing support to the Men’s manager and merchandising teams, including regional pricing, markdowns, assortment planning, competitive landscape analysis, and regional product needs assessment.\nReplenishment & Growth Initiatives: Oversee replenishment and reorder processes within assigned categories, ensuring consistent inventory flow and contributing to growth initiatives alongside the Men’s manager.\nSpecial Projects & Product Knowledge: Assist with sales-driving special projects and create tailored buy books and product knowledge decks for partners by category each season.", "qualifications": {"required": "Minimum 3+ years of previous experience in a sales-driven environment, Excellent analytical skills, strong command of Microsoft Excel, and an ability to multitask effectively, Keen awareness of the customer and brand profile of the business, Team-oriented mindset with excellent interpersonal skills for interacting and networking with customers and suppliers, The ability to travel, Superior oral and written communications skills, Superior Presentation skills", "preferred": "Bachelor's degree in business / fashion merchandising"}, "skills": ["Sales", "Excel", "Communication", "Presentation Skills", "Relationship Management", "Business Analysis", "Market Research", "Event Planning", "Customer Service", "Teamwork"], "postedDate": "6 days ago", "benefits": "Generous Paid Time Off & Holiday Schedule, Summer Fridays, Internal mobility across Versace, Jimmy Choo and Michael Kors, Cross-brand Discount, Exclusive Employee Sales, Fav 5 Cards (MK Discount for friends and family), 401k Match, Paid Parental Leave, Thrive Wellness Program, Commuter Benefits, Gym Discounts", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3998278473"}