{"jobTitle": "IT Systems Engineer 2", "company": {"name": "CDW", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "Bring your IT career and talents to CDW, where you can have a greater impact, be inspired by our mission and excited about your career and future.A Fortune 200 leader, we’re the driven professionals and technology experts companies turn to most to solve their IT challenges.<br/><br/>This is an onsite role at Patrick Space Force Base in Satellite Beach, FL. Given the requirements of this work, an active DoD Secret security clearance is required for this role.<br/><br/>Under supervision, performs systems engineering tasks required for providing IT capability and infrastructure to deliver IT solutions at both enterprise and local site levels within the DTAMM environment IAW DoD, USSF, SLD 30 WR, SLD 45 ER and DTAMM policies and procedures. Provides software systems engineering approaches for requirement development and Technical Requirements Documentation. Performs requirements traceability matrix development for verification and validation of requirements to be implemented using an Agile-based software development approach. Provides inputs for risks, impacts and potential changes to product quality and project scope, schedule, and costs during the Agile software development phase. Provides systems engineering, system mapping, and other technical services required to design, model, test, pilot, and implement the systems and infrastructure services, IAW established architectures and security standards. Employs a holistic approach to engineering the collective DTAMM effort, using impactful technology solutions and best practices, including risk management, control procedures, and lessons learned.<br/><br/>Duties and Responsibilities:<br/><br/><ul><li>Performs design and implementation of IT systems that require the integration of diverse and complex components.</li><li>Activities include creating a problem statement, defining operational requirements including integration with other systems or components, researching and modeling the system architecture and configuration, investigation alternatives, cost analysis and estimation, and decision analysis.</li><li>Ensures the logical ad systematic conversion of requirements into total systems solutions that acknowledge technical, schedule, and cost constraints.</li><li>Performs functional analysis, timeline analysis, requirements allocation and interface definition studies to translate requirements into hardware and software specification.</li><li>Provides specific, detailed information for selection, implementation techniques, and tools for the most efficient solution to meet business needs, including present and future capacity requirements, facility requirements (including floor layout, power cooling, network connectivity), data storage, backup, monitoring, operations systems, directory services, identity management, access management, and automation.</li><li>Translates requirements into specifications and plans. Researches and evaluates new cross-domain technologies and information management trends, initiating vendor engagements, when necessary, to chart potential technology and trend insertions to shape and expand the DTAMM IT capability.</li><li>Assists in planning near and long-term architecture objectives and supports acquisition strategies. Analyzes technical impacts to the baseline, and ensures technology insertion fit for purpose, compliance, and interoperability across functions within the enterprise to include cyber security and information protection, infrastructure, cloud, and software systems.</li><li>Supports technology demonstrations and Technology Roadmap maintenance. Develops test plans, conducts integration testing, and certifies solutions for introduction into the production environment.</li><li>Supports operations teams with troubleshooting and escalations.</li><li>Develops work and engineering plans, BOMs, estimates, site integration technical design packages, configuration documents, and other procedures and reports, as well as templates for deliverable artifacts, forms, and checklists.<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Active DoD Secret security clearance</li><li>Bachelor’s degree in related field</li><li>2 years’ experience<br/><br/><br/></li></ul><strong>Who we are:<br/><br/></strong>CDW is a leading technology solutions provider to business, government, education and healthcare organizations across the globe.Our fingerprints can be found on technology inworkplacesof more than 250,000companies;from fresh-faced start-ups to international conglomerates. With the breadth of products and services we offer, there is no request too big or too small.<br/><br/><strong>What you can expect from us: Culture, coworkers, careers.<br/><br/></strong>CDW is not only the People Who Get IT but the People who get People. Our relationships are fueled by our deep expertise and grounded in the CDW Way. Our empowering leadership makes things happen and inspires their teams to do the same. From the teammates beside us to the leaders who guide us, we move forward together. At CDW, you’ll work with people who inspire you. People with positive, success-driven attitudes who you will learn from and forge strong relationships with. Bring your best true self—and your best ideas—to CDW. Because diverse perspectives bring forth better problem solving—and better solutions for our customers on a rapidly evolving technology landscape.<br/><br/><strong>Equal Opportunity Employer, including disability and protected veteran status<br/><br/></strong>Benefits overview: https://cdw.benefit-info.com/", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998751935"}