{"jobTitle": "Area Customer Service Manager", "company": {"name": "Empire Today", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative and Sales", "industry": "Retail", "description": "<strong>Area Customer Service Manager</strong>\nReady to grow your career? Empire Today is seeking an <strong>Area Customer Service Manager</strong>. <strong>Area Customer Service Manager</strong> is responsible for managing the day-to-day activities, direct supervision of department personnel, and oversight of all aspects of customer service practices, objectives, and initiatives to ensure excellent service to our customers is achieved. This position reports directly to the Area Director.\n\n<strong>We offer:</strong>\n<ul><li> Health benefits.</li><li> 401K plan.</li><li> Paid time off and holiday pay.</li><li> Wellness program.</li><li> Professional development &amp; career advancement opportunities.</li><li> Lots of perks.</li></ul>\n\n<strong>Responsibilities:</strong>\n<ul><li> Assign newly entered customer service requests to appropriate team members.</li><li> Track and review Service Request reports daily to ensure on-time delivery and customer satisfaction.</li><li> Export data from database and input into an excel spreadsheet for assignment and prioritization.</li><li> Plan and disseminate daily assignments to employees.</li><li> Conduct bi-weekly one on one meetings with subordinates to review current productivity and any developmental opportunities.</li><li> Regularly spot check subordinate customer call activity and call quality as well as perform service request management audits, Coach team members on improvement strategies.</li><li> Monitor all SRs assigned to Area Customer Service Associates to ensure swift completion.</li><li> Execute the implementation of training activities to improve Customer Service Scores.</li><li> Conduct the daily Customer Meeting for each of the markets within their Area.</li><li> Complete bi-weekly Manager review guide (MRG) activities within Smartsheet’s for each of the markets within their Area.</li><li> Limit risk exposure by providing input and perspective on customer service legal matters and the settlement of disputes.</li><li> Make job related calls to customers and collect feedback from customers to ensure that they are pleased with their purchase (as needed). </li><li> Request and collect referrals from every satisfied customer during the post installation call process (as needed).</li><li> Provides feedback to the company regarding service failures or customer concerns.</li><li> Enforce performance standards to meet Customer Service Empire Operating System (EOS) key performance indicators.</li><li> Ensure the Customer Service Day In The Life Of (DILO) is being utilized by team.</li><li> Identify problems or concerns and expedite to appropriate Manager or Coordinator for resolution.</li><li> Regular communication with customers to solve complex service-related issues over the authority level of subordinate staff members.</li><li> Monitor the All-Promoter Score (APS) metric daily to evaluate the organization’s customer service ratings, trends, and customer comments to continually improve performance.</li><li> Address and solution all legal and escalated customer service-related issues (Better Business Bureau, Attorney letters, etc.).</li><li> Serve as a resource to staff in resolving customer service issues.</li><li> Supervises the daily operation of customer service personnel, to include hiring, discipline, coaching, training, and evaluating performance.</li><li> Assist the legal department in troubleshooting customer issues that require special handling.</li><li> Represent the organization at hearings and other state agencies as needed.</li><li> Perform other functions as necessary or as assigned.</li></ul>\n\n<strong> Qualifications:</strong>\n<ul><li> Minimum of three (3) years customer service or call center experience or related experience</li><li> Minimum of one (1) year management and/or training experience or equivalent combination of education and experience</li><li> Associate Degree or Bachelor’s Degree preferred</li><li> Flooring or home improvement industry experience preferred.</li><li> Virtual/Remote management experience is ideal</li><li> Proficient in MS Word, Excel, Outlook, and PowerPoint</li><li> Strong analytical, organizational, and problem-solving skills</li><li> Professional phone demeanor with the ability to relate to people in an open, friendly, and accepting manner</li><li> Strong ability to effectively communicate at all levels in written, verbal, and presentation formats</li><li> Demonstrated skill at communicating with and problem-solving for clients with challenging service issues</li><li> Excellent problem-solving skills demonstrated through a sense of urgency and solid judgment and reasoning ability</li><li> Must be flexible and comfortable working in a dynamic and interactive team environment<strong> </strong></li><li><strong> CS phone and email coverage must be from 8:00 am to 5:00 pm M-F, and 8:00 am-2:00 pm Saturday</strong></li></ul><p></p>", "responsibilities": "Assign newly entered customer service requests to appropriate team members. Track and review Service Request reports daily to ensure on-time delivery and customer satisfaction. Export data from database and input into an excel spreadsheet for assignment and prioritization. Plan and disseminate daily assignments to employees. Conduct bi-weekly one on one meetings with subordinates to review current productivity and any developmental opportunities. Regularly spot check subordinate customer call activity and call quality as well as perform service request management audits, Coach team members on improvement strategies. Monitor all SRs assigned to Area Customer Service Associates to ensure swift completion. Execute the implementation of training activities to improve Customer Service Scores. Conduct the daily Customer Meeting for each of the markets within their Area. Complete bi-weekly Manager review guide (MRG) activities within Smartsheet’s for each of the markets within their Area. Limit risk exposure by providing input and perspective on customer service legal matters and the settlement of disputes. Make job related calls to customers and collect feedback from customers to ensure that they are pleased with their purchase (as needed).  Request and collect referrals from every satisfied customer during the post installation call process (as needed). Provides feedback to the company regarding service failures or customer concerns. Enforce performance standards to meet Customer Service Empire Operating System (EOS) key performance indicators. Ensure the Customer Service Day In The Life Of (DILO) is being utilized by team. Identify problems or concerns and expedite to appropriate Manager or Coordinator for resolution. Regular communication with customers to solve complex service-related issues over the authority level of subordinate staff members. Monitor the All-Promoter Score (APS) metric daily to evaluate the organization’s customer service ratings, trends, and customer comments to continually improve performance. Address and solution all legal and escalated customer service-related issues (Better Business Bureau, Attorney letters, etc.). Serve as a resource to staff in resolving customer service issues. Supervises the daily operation of customer service personnel, to include hiring, discipline, coaching, training, and evaluating performance. Assist the legal department in troubleshooting customer issues that require special handling. Represent the organization at hearings and other state agencies as needed. Perform other functions as necessary or as assigned.", "qualifications": {"required": "Minimum of three (3) years customer service or call center experience or related experience Minimum of one (1) year management and/or training experience or equivalent combination of education and experience Proficient in MS Word, Excel, Outlook, and PowerPoint Strong analytical, organizational, and problem-solving skills Professional phone demeanor with the ability to relate to people in an open, friendly, and accepting manner Strong ability to effectively communicate at all levels in written, verbal, and presentation formats Demonstrated skill at communicating with and problem-solving for clients with challenging service issues Excellent problem-solving skills demonstrated through a sense of urgency and solid judgment and reasoning ability Must be flexible and comfortable working in a dynamic and interactive team environment  CS phone and email coverage must be from 8:00 am to 5:00 pm M-F, and 8:00 am-2:00 pm Saturday", "preferred": "Associate Degree or Bachelor’s Degree preferred Flooring or home improvement industry experience preferred. Virtual/Remote management experience is ideal"}, "skills": ["Customer Service", "Call Center", "Management", "Training", "MS Word", "Excel", "Outlook", "PowerPoint", "Analytical Skills", "Organizational Skills", "Problem Solving", "Communication", "Teamwork"], "postedDate": "6 days ago", "benefits": "Health benefits. 401K plan. Paid time off and holiday pay. Wellness program. Professional development & career advancement opportunities. Lots of perks.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3998422800"}