{"jobTitle": "Product Manager, Borrow", "company": {"name": "Cash App", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management", "industry": "Technology, Information and Internet", "description": "Company Description\n\nIt all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay/Clearpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible.\n\nToday, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.\n\nCheck out our locations, benefits, and more at cash.app/careers.\n\nJob Description\n\nThe Lending team’s mission is to expand access to credit for the 40M Americans with poor or thin credit. Our customers often only have horrendously predatory credit options available to them (ex. average APR in the payday loan space comes in at :390%). Borrow, our flagship product, is a simple, fair, and accessible micro-credit solution for Cash App customers.\n\nBorrow has grown >74% YoY and is one of our highest searched and asked for products. Borrow customers cite using it for everyday necessities (ex. groceries, gas, bills) when in a pinch. However, we’re just getting started. The majority of our existing Borrowers max out their credit limits, and often reach out asking for an increase in their credit line.\n\nWe’re looking for a gritty, driven Product Manager to own the experience and business metrics for repeat customers on our platform. We have millions of Monthly Actives today (and growing!). This includes:\n\n* Work with a full stack team that includes Machine Learning and Backend engineers, Designers, Data Scientists, Compliance, Product Counsel, and Customer Support\n* Build and integrate Machine Learning solutions to help customers grow their credit limit while managing losses. \n* Partner with Compliance and Legal counterparts to keep us compliant with rules and regulations. \n* Build simple, clear, and delightful customer experiences for Borrowers to grow engagement and reduce support inquiries\n* Work with different product teams to weave Borrow into the broader Cash App ecosystem\n\nQualifications\n\nLike us, you’ll be deeply committed to delivering positive outcomes for users and passionate about shaping the future of Cash App. Additionally, we’re looking for\n\n* 6+ years of product management delivering successful and innovative products and building/driving product roadmaps\n* A “Driver” mindset – You are biased toward action and get stuff done. No task is too big or too small for you\n* Comfort with ambiguity coupled with the ability to independently solve ambiguous problems\n* A high quality bar – for your own contributions and those of the people around you\n* Fluency with data – you’ve worked on ML (or data heavy) products in the past, and are comfortable running A/B tests. You know how to leverage data to make product decisions without getting stuck in analysis paralysis\n* Customer obsession – The ability to take on complex product challenges and find elegant, simplifying solutions to avoid making them our users and partner’s problems\n\nHighly preferred\n\n* Experience working in a high growth consumer business, whether FinTech or other\n* Experience leading and working with geographically dispersed teams\n\nAdditional Information\n\nBlock takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These base salary ranges may be modified in the future.\n\nZone A: USD $148,700 - USD $223,100\n\nZone B: USD $141,300 - USD $211,900\n\nZone C: USD $133,800 - USD $200,800\n\nZone D: USD $126,400 - USD $189,600\n\nTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.\n\nFull-time employee benefits include the following:\n\n* Healthcare coverage (Medical, Vision and Dental insurance)\n* Health Savings Account and Flexible Spending Account\n* Retirement Plans including company match \n* Employee Stock Purchase Program\n* Wellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance \n* Paid parental and caregiving leave\n* Paid time off (including 12 paid holidays)\n* Paid sick leave (1 hour per 26 hours worked (max 80 hours per calendar year to the extent legally permissible) for non-exempt employees and covered by our Flexible Time Off policy for exempt employees) \n* Learning and Development resources\n* Paid Life insurance, AD&D, and disability benefits \n\nThese benefits are further detailed in Block's policies. This role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n\nWe’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n\nWe believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. *Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our*I+D page*.\n\nBlock will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances. Because the material duties of this role involve direct or indirect access to sensitive personal or financial data, a criminal background check is required following a contingent offer of employment.\n\n*Block, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n\n*While there is no specific deadline to apply for this role, on average, U.S. open roles are posted for 70 days before being filled by a successful candidate.*", "responsibilities": "The Lending team’s mission is to expand access to credit for the 40M Americans with poor or thin credit. Our customers often only have horrendously predatory credit options available to them (ex. average APR in the payday loan space comes in at :390%). Borrow, our flagship product, is a simple, fair, and accessible micro-credit solution for Cash App customers.\n\nBorrow has grown >74% YoY and is one of our highest searched and asked for products. Borrow customers cite using it for everyday necessities (ex. groceries, gas, bills) when in a pinch. However, we’re just getting started. The majority of our existing Borrowers max out their credit limits, and often reach out asking for an increase in their credit line.\n\nWe’re looking for a gritty, driven Product Manager to own the experience and business metrics for repeat customers on our platform. We have millions of Monthly Actives today (and growing!). This includes:\n\n* Work with a full stack team that includes Machine Learning and Backend engineers, Designers, Data Scientists, Compliance, Product Counsel, and Customer Support\n* Build and integrate Machine Learning solutions to help customers grow their credit limit while managing losses. \n* Partner with Compliance and Legal counterparts to keep us compliant with rules and regulations. \n* Build simple, clear, and delightful customer experiences for Borrowers to grow engagement and reduce support inquiries\n* Work with different product teams to weave Borrow into the broader Cash App ecosystem", "qualifications": {"required": "6+ years of product management delivering successful and innovative products and building/driving product roadmaps\n* A “Driver” mindset – You are biased toward action and get stuff done. No task is too big or too small for you\n* Comfort with ambiguity coupled with the ability to independently solve ambiguous problems\n* A high quality bar – for your own contributions and those of the people around you\n* Fluency with data – you’ve worked on ML (or data heavy) products in the past, and are comfortable running A/B tests. You know how to leverage data to make product decisions without getting stuck in analysis paralysis\n* Customer obsession – The ability to take on complex product challenges and find elegant, simplifying solutions to avoid making them our users and partner’s problems", "preferred": "Experience working in a high growth consumer business, whether FinTech or other\n* Experience leading and working with geographically dispersed teams"}, "skills": [], "postedDate": "1 week ago", "benefits": "Full-time employee benefits include the following:\n\n* Healthcare coverage (Medical, Vision and Dental insurance)\n* Health Savings Account and Flexible Spending Account\n* Retirement Plans including company match \n* Employee Stock Purchase Program\n* Wellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance \n* Paid parental and caregiving leave\n* Paid time off (including 12 paid holidays)\n* Paid sick leave (1 hour per 26 hours worked (max 80 hours per calendar year to the extent legally permissible) for non-exempt employees and covered by our Flexible Time Off policy for exempt employees) \n* Learning and Development resources\n* Paid Life insurance, AD&D, and disability benefits \n\nThese benefits are further detailed in Block's policies. This role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3998190999"}