{"jobTitle": "Marketing and Communications Director", "company": {"name": "WaveHire", "location": "Buda, TX"}, "location": "Buda, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Human Resources Services", "description": "<strong>We are hiring for our client - PHCC Texas.<br/><br/></strong><strong>About Us:</strong> PHCC Texas is a leading professional association dedicated to advancing the plumbing, heating, and cooling industry through education, advocacy, and community support. We represent contractors, manufacturers, and suppliers throughout Texas, providing them with the tools and resources they need to succeed. We are seeking a dynamic and experienced Marketing and Communications Director to lead our marketing efforts and enhance our brand presence across the state.<br/><br/><strong>Job Summary:</strong> The Marketing and Communications Director will be responsible for developing and executing comprehensive marketing strategies that drive membership growth, enhance brand visibility, and support the organization’s mission. This role requires a creative thinker with strong leadership skills, a deep understanding of digital and traditional marketing, and the ability to effectively communicate PHCC Texas’s value proposition to various stakeholders.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Develop and implement a comprehensive marketing and communications strategy that aligns with the organization’s goals and objectives.</li><li>Identify key target audiences and create tailored marketing campaigns to engage and grow membership.</li><li>Oversee the development and management of the PHCC Texas brand, ensuring consistency across all marketing channels.</li><li>Lead efforts to enhance brand awareness and reputation within the industry and among the general public.</li><li>Create, manage, and distribute high-quality content across various platforms, including websites, social media, newsletters, and print materials.</li><li>Ensure all content is aligned with the organization’s voice, mission, and goals.</li><li>Lead the organization’s digital marketing efforts, including SEO/SEM, email marketing, social media management, and online advertising.</li><li>Analyze digital metrics and adjust strategies to optimize performance and engagement.</li><li>Membership Engagement:</li><li>Work closely with the Membership Director to create and implement campaigns that attract new members and retain existing ones.</li><li>Develop communication strategies that highlight the benefits of membership and showcase success stories.</li><li>Lead and mentor the marketing team, providing guidance, support, and professional development opportunities.</li><li>Collaborate with other departments, including education, advocacy, and operations, to ensure cohesive messaging and branding across all activities.</li><li>Develop and manage the marketing and communications budget, ensuring efficient use of resources to achieve organizational goals.</li><li>Track and report on marketing expenditures and campaign ROI to senior management.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in Marketing, Communications, Business, or a related field.</li><li>A minimum of 5-7 years of experience in marketing and communications, preferably within a trade association, nonprofit, or related industry.</li><li>Proven experience in developing and executing successful marketing campaigns across multiple channels.</li><li>Strong leadership and project management skills with the ability to manage multiple priorities and deadlines.</li><li>Excellent written and verbal communication skills, with a keen eye for detail.</li><li>Proficiency in digital marketing tools and platforms, including social media, email marketing, and analytics.</li><li>Experience with brand management and public relations.</li><li>Ability to work collaboratively with diverse teams and stakeholders.<br/><br/></li></ul><strong>Preferred Skills<br/><br/></strong><ul><li>Experience in the plumbing, heating, and cooling industry or a related field.</li><li>Familiarity with membership-based organizations and their unique marketing needs.</li><li>Certification in marketing or communications is a plus.<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Competitive salary and benefits package.</li><li>Opportunities for professional growth and career advancement.</li><li>A supportive and collaborative work environment.<br/><br/></li></ul>Skills: social media,public relations,digital marketing,organization,project management,communications,membership,brand management,digital,leadership,marketing strategy,communication", "responsibilities": "Develop and implement a comprehensive marketing and communications strategy that aligns with the organization’s goals and objectives. Identify key target audiences and create tailored marketing campaigns to engage and grow membership. Oversee the development and management of the PHCC Texas brand, ensuring consistency across all marketing channels. Lead efforts to enhance brand awareness and reputation within the industry and among the general public. Create, manage, and distribute high-quality content across various platforms, including websites, social media, newsletters, and print materials. Ensure all content is aligned with the organization’s voice, mission, and goals. Lead the organization’s digital marketing efforts, including SEO/SEM, email marketing, social media management, and online advertising. Analyze digital metrics and adjust strategies to optimize performance and engagement. Membership Engagement: Work closely with the Membership Director to create and implement campaigns that attract new members and retain existing ones. Develop communication strategies that highlight the benefits of membership and showcase success stories. Lead and mentor the marketing team, providing guidance, support, and professional development opportunities. Collaborate with other departments, including education, advocacy, and operations, to ensure cohesive messaging and branding across all activities. Develop and manage the marketing and communications budget, ensuring efficient use of resources to achieve organizational goals. Track and report on marketing expenditures and campaign ROI to senior management.", "qualifications": {"required": "Bachelor’s degree in Marketing, Communications, Business, or a related field. A minimum of 5-7 years of experience in marketing and communications, preferably within a trade association, nonprofit, or related industry. Proven experience in developing and executing successful marketing campaigns across multiple channels. Strong leadership and project management skills with the ability to manage multiple priorities and deadlines. Excellent written and verbal communication skills, with a keen eye for detail. Proficiency in digital marketing tools and platforms, including social media, email marketing, and analytics. Experience with brand management and public relations. Ability to work collaboratively with diverse teams and stakeholders.", "preferred": "Experience in the plumbing, heating, and cooling industry or a related field. Familiarity with membership-based organizations and their unique marketing needs. Certification in marketing or communications is a plus."}, "skills": ["social media", "public relations", "digital marketing", "organization", "project management", "communications", "membership", "brand management", "digital", "leadership", "marketing strategy", "communication"], "postedDate": "5 days ago", "benefits": "Competitive salary and benefits package. Opportunities for professional growth and career advancement. A supportive and collaborative work environment.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3998454450"}