{"jobTitle": "Life Insurance Sales - Remote", "company": {"name": "Get It Recruit - Marketing", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "Remote Sales Representative (All 50 States)\n\nAre you a high-quality sales professional looking for a remote opportunity? We are seeking motivated individuals to join our team, offering the flexibility to work either part-time or full-time and earn between $50,000 to $100,000+ in commissions.\n\nThis is an excellent chance to control your schedule and meet with clients virtually, over the phone, or in person.\n\nJob Details\n\nUnlimited Income Potential: Your earnings are uncapped!\n\nFully Remote: Work from anywhere.\n\nNew Agent Performance Bonus\n\nEarn up to a 20% cash bonus on placed business within your first three months.\n\nEarn a 15% raise in your first three months (5% per month).\n\nCommission-Based: This position is commission-only with bonuses.\n\nFrequent Raises: Raises are available every two months based on your performance.\n\nResponsibilities\n\nObtain a Life & Health Insurance license for your state (we provide support for the course if needed).\n\nEnsure you have a reliable computer and internet connection.\n\nExhibit self-discipline and a willingness to grow personally and professionally.\n\nDevelop leadership skills and grow into a leader within the organization.\n\nRequirements\n\nAbility to overcome challenges.\n\nStrong communication skills.\n\nSelf-discipline, grit, and fortitude.\n\nPositive growth mindset.\n\nDesire to grow into a leader worth following.\n\nAbout Us\n\nWe are dedicated to protecting families and individuals through every step of life's journey. We also focus on serving our communities and encouraging personal and professional development. As a leadership development company, we help families with financial services.\n\nOur staff and agents have access to an expansive growth network and the opportunity to give back to the organizations and causes that are important to them.\n\nWhy Work With Us?\n\nWork virtually from home.\n\nNo cap on commissions.\n\nOpportunities for advancement.\n\nAbility to scale your income and build your own agency.\n\nJoin us and take control of your career while making a difference in the lives of others!\n\nEmployment Type: Full-Time", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3998507175"}