{"jobTitle": "Director of Partnerships", "company": {"name": "Salesmsg", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Business Development and Sales", "industry": "Telecommunications", "description": "Who We Are At Salesmsg, we believe conversations are good for business. The fastest, easiest way to start those conversations is through text messages. That’s why we built a simple, scalable platform that makes two-way texting conversations possible for businesses. Our team of extremely talented people designed our Salesmsg app—our all-in-one text messaging and calling platform for sales, marketing and support teams. Salesmsg is also a fast-growing startup. For three years in a row, Inc. Magazine has named Salesmsg one of the fastest growing private companies in America as part of their prestigious Inc. 5000 list. Since we launched, Salesmsg has helped thousands of businesses attract, engage, convert, and care for customers with text messaging. Right now, we’re looking for an experienced, empathetic customer champion to be our next Director of Partnerships. (Could this be you? Keep reading to find out. But first…) Why Salesmsg? We’re a people first company. Easy to say, right? We really mean it. We love hiring remarkable, brilliant-but-humble people who are some of the kindest people you’ll meet. That includes everyone from our two co-founders to our just-started-this-week team members. We ALSO put our customers first. Our ultimate goal is our customers’ success. That goal drives every area of our business from our product team who created 157 new features in 2023 alone to our customer success team who responds to customers in an hour (or less). We’re a remote company. Why bother moving or driving to the office when you can work from home? That’s why our team is spread across the U.S., Europe and Asia (Florida, Minnesota, Georgia, Indiana, Colorado, Wisconsin, Texas, Utah, California, Bosnia Herzegovina, and Belarus). As long as you can show up to work on your computer, we’re happy to have you! We only build exceptional SaaS products. Our worldwide team built our best-in-class platform with simple, scalable features that we improve every single day. We give unlimited time off. We’re a startup, so we want to reward our dedicated employees by giving you real vacation time. That’s why we give unlimited time off, so you can take the time you need. We pile on the benefits. Besides a competitive salary, we offer all the benefits you need to take care of yourself and your family like health, vision and dental. Our Core Values 1. We Figure It Out. We're a startup. Stuff will break and things will not work as you want them to. You will hit barriers and blocks keeping you from getting done what you said you'd do. You are the type of person that 'come hell or high water' will figure it out. This is fun for you. 2. Seek Continuous Improvement. We pursue GREATNESS. There’s a wealth of knowledge in books, articles, videos, courses, training events, and everywhere you look. Just Google it. If you can’t “figure it out” yourself, trust me, someone else already has for you. We're resourceful and go deep to learn the best strategies. 3. Keep it Real &amp; Conversational. Seeing things for “how they truly are” gives us power. In fact, we have be real in order to survive and thrive. We have to speak truthfully and honestly because if we don't things go unsaid, animosity stirs, and resentment takes over. It's debilitating for high performance teams to win. Speak truthfully and keep it real. Call it like it is. Provide solutions, not problems. 4. People First Mindset. As we seek to constantly improve we realize that the best answers to many of the opportunities to grow, products to create, and partnerships to solidify come from our customers. Helping the customer achieve success is our ultimate goal and through that we find new ways to make our product and team better. 5. Be Flexible. The road is never straight and there will be twists and turns and bumps and stops. We all need to row in the same direction to work together and get things done. Don't make it harder than it has to be. If it takes a few minutes, hook a brother up. Don't battle. We win together, not apart. Okay, with that out of the way, let’s get into what this role will look like for you… Head of Partnerships: Is this you?<br/><br/><ul><li>Are you a seasoned B2B SaaS partnerships leader with a knack for forging strategic relationships that drive growth?</li><li>Are you a people-person that thrives on authentically building and nurturing relationships with agency partners, technology partners, and affiliates?</li><li>Do you already have a little black book of industry contacts and connections that love hearing from you, whenever you reach out?</li><li>Do you have a strategic mindset that allows you to identify, negotiate, and manage high-impact partnerships that align with a business’s goals?</li><li>Do you already have an understanding of the SMS industry?</li><li>Are you excited about reporting directly to the CEO in a fast-growing SaaS company where your contributions directly influence the success of the company?<br/><br/><br/></li></ul>If so, you could be the Head of Partnerships we’re looking for at Salesmsg.<br/><br/>As our new Head of Partnerships, you’ll be at the forefront of developing relationships and executing strategies that expand Salesmsg’s reach through meaningful and profitable partnerships.<br/><br/>(Sound like fun? Sound like you? Keep reading!)<br/><br/>What you’ll own in your role:<br/><br/><ul><li>Strategic Partnerships: Develop, enable, and monetize an expanding ecosystem of partners through relationships with key ISVs, technology partners, agencies, and affiliates</li><li>Primary Contact: Be the face of our partner program – the primary (and often first) point of contact as we build relationships with key partners, businesses and communities within our industry</li><li>Collaboration and Integration: Work closely with internal teams to ensure seamless integration and effective collaboration with partners, driving joint technology initiatives</li><li>Performance Monitoring: Define and track key performance indicators (KPIs) to measure the success of partnerships, providing regular reports and insights to senior management</li><li>Marketing Support: Develop and execute co-marketing campaigns with Salesmsg and its partners to maximize reach, build our brand, and drive engagement</li><li>Sales Support: Engage in sales conversations with Salesmsg partners, helping facilitate pipeline growth, and introductions that drive business for both parties</li><li>Training and Enablement: Equip partners with the necessary tools, resources, and training to effectively promote and support Salesmsg’s solutions</li><li>Negotiation and Agreement: Lead the negotiation process, ensuring mutually beneficial terms that align with Salesmsg’s strategic objectives</li><li>Market Analysis: Stay up on industry trends and market conditions that affect our partners and customers. Give recommendations based on what you’re seeing and hearing in our industry</li><li>Event Management: Represent Salesmsg at industry events, conferences, and partner meetings to strengthen existing relationships and develop new partnership opportunities<br/><br/><br/></li></ul>What you already have:<br/><br/><ul><li>Minimum of 3-4 years in a B2B SaaS partnerships role, with a proven track record of successfully managing and growing strategic partnerships</li><li>Familiarity with CRM systems (e.g., HubSpot, Salesforce) and the SaaS landscape, with knowledge of the business texting and calling markets a plus</li><li>Ability to identify and capitalize on partnership opportunities that align with business objectives, while working independently</li><li>Exceptional interpersonal and communication skills, with the ability to build strong, friendly, lasting relationships with partners and stakeholders</li><li>Strong negotiation skills with the ability to secure favorable terms and manage complex partnership agreements</li><li>Proficiency in analyzing partnership performance data to make informed decisions and optimize outcomes</li><li>Experience and a positive track record of working with marketing and development agencies, value-added resellers (VARs), and more<br/><br/><br/></li></ul>How success is measured:<br/><br/><ul><li>Complete Ownership: Take radical ownership of your Head of Partnerships role, while collaborating directly with the CEO</li><li>Partnership Growth: Increase the number and quality of strategic partnerships, whether technology, agency, or affiliate, all contributing to overall business growth</li><li>Revenue Impact: Directly influence revenue through successful partnerships, co-selling, co-marketing, and strategic joint initiatives</li><li>Partner Satisfaction: Maintain high satisfaction levels and friendly relationships among partners, ensuring long-term collaboration and mutual success</li><li>KPI Achievement: Meet or exceed established KPIs for partnership performance, including lead generation, partner sourced sales, strategic campaign success, and overall growth<br/><br/><br/></li></ul>To recap, you’ll enjoy<br/><br/><ul><li>Remote work: Work from anywhere</li><li>Medical, Dental, and Vision Insurance: Personal health, dental + vision 50% covered after 30 days</li><li>Team trips: We book at least one all-expenses-paid team trip per year</li><li>Unlimited PTO. Need time off, just let us know</li><li>Wellness Perks: Classpass access to 41,500+ studios worldwide (yoga, cycling, Pilates, Barre, running, strength training, dance, sports, videos and more.)</li><li>Books and Courses: A monthly budget of $100 to spend on books. Plus access to over 10 courses already across marketing, content creation, SEO, and more</li><li>Focused Time Blocks: We discourage meetings before noon so employees can have undistracted time to work</li><li>$250 Charity Donation: We will donate to any charity of their choice</li><li>Semi-Monthly Paychecks: Get paid on-time on the 15th and last day of the month</li><li>Swag: T-Shirts, stickers, and Salesmsg gear to kit you out!</li><li>Teledoc Virtual Health: Speak directly with a doctor anytime from anywhere</li><li>TalkSpace Online Mental Health Therapy: We've got you covered for when you need help</li><li>Incredible Growth and Promotion Opportunities: Ground floor opportunity to make your mark./<br/><br/><br/></li></ul><strong>Ready to get started?<br/><br/></strong>We hope you already clicked the button to apply.<br/><br/>But just in case, please know that we completely understand that not everyone will tick every box above. That is not as important as who you are. We’re looking for a remarkable person who’s willing to do the work to help us build something great.<br/><br/>Seriously, if this sounds like something you’d love to do—and you’re willing to take on this challenge—we want to talk with you.<br/><br/>Go for it. Click the button above to apply now!", "responsibilities": "Develop, enable, and monetize an expanding ecosystem of partners through relationships with key ISVs, technology partners, agencies, and affiliates\nBe the face of our partner program – the primary (and often first) point of contact as we build relationships with key partners, businesses and communities within our industry\nWork closely with internal teams to ensure seamless integration and effective collaboration with partners, driving joint technology initiatives\nDefine and track key performance indicators (KPIs) to measure the success of partnerships, providing regular reports and insights to senior management\nDevelop and execute co-marketing campaigns with Salesmsg and its partners to maximize reach, build our brand, and drive engagement\nEngage in sales conversations with Salesmsg partners, helping facilitate pipeline growth, and introductions that drive business for both parties\nEquip partners with the necessary tools, resources, and training to effectively promote and support Salesmsg’s solutions\nLead the negotiation process, ensuring mutually beneficial terms that align with Salesmsg’s strategic objectives\nStay up on industry trends and market conditions that affect our partners and customers. Give recommendations based on what you’re seeing and hearing in our industry\nRepresent Salesmsg at industry events, conferences, and partner meetings to strengthen existing relationships and develop new partnership opportunities", "qualifications": {"required": "Minimum of 3-4 years in a B2B SaaS partnerships role, with a proven track record of successfully managing and growing strategic partnerships\nFamiliarity with CRM systems (e.g., HubSpot, Salesforce) and the SaaS landscape, with knowledge of the business texting and calling markets a plus\nAbility to identify and capitalize on partnership opportunities that align with business objectives, while working independently\nExceptional interpersonal and communication skills, with the ability to build strong, friendly, lasting relationships with partners and stakeholders\nStrong negotiation skills with the ability to secure favorable terms and manage complex partnership agreements\nProficiency in analyzing partnership performance data to make informed decisions and optimize outcomes\nExperience and a positive track record of working with marketing and development agencies, value-added resellers (VARs), and more"}, "skills": ["CRM", "SaaS", "Partnerships", "Business Development", "Sales", "Negotiation", "Marketing", "Communication", "Relationship Management", "Strategic Planning", "Teamwork", "Leadership", "Problem Solving", "Analytical Skills", "Data Analysis", "CRM Systems", "HubSpot", "Salesforce", "SMS", "Business Texting", "Business Calling"], "postedDate": "1 week ago", "benefits": "Remote work: Work from anywhere\nMedical, Dental, and Vision Insurance: Personal health, dental + vision 50% covered after 30 days\nTeam trips: We book at least one all-expenses-paid team trip per year\nUnlimited PTO. Need time off, just let us know\nWellness Perks: Classpass access to 41,500+ studios worldwide (yoga, cycling, Pilates, Barre, running, strength training, dance, sports, videos and more.)\nBooks and Courses: A monthly budget of $100 to spend on books. Plus access to over 10 courses already across marketing, content creation, SEO, and more\nFocused Time Blocks: We discourage meetings before noon so employees can have undistracted time to work\n$250 Charity Donation: We will donate to any charity of their choice\nSemi-Monthly Paychecks: Get paid on-time on the 15th and last day of the month\nSwag: T-Shirts, stickers, and Salesmsg gear to kit you out!\nTeledoc Virtual Health: Speak directly with a doctor anytime from anywhere\nTalkSpace Online Mental Health Therapy: We've got you covered for when you need help\nIncredible Growth and Promotion Opportunities: Ground floor opportunity to make your mark.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999914468"}