{"jobTitle": "Junior Channel Sales Account Manager", "company": {"name": "Gusto", "location": "Las Vegas Metropolitan Area"}, "location": "Las Vegas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.04/hr - 29.00/hr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About Gusto<br/><br/>Gusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 300,000 businesses nationwide.<br/><br/>Our mission is to create a world where work empowers a better life, and it starts right here at Gusto. That’s why we’re committed to building a collaborative and inclusive workplace, both physically and virtually. Learn more about our Total Rewards philosophy.<br/><br/>About The Role<br/><br/>We are currently seeking a SMB Channel Sales Account Manager who will play a crucial role in assisting Channel Partners, such as Accounting Firms, and their Clients, including Small Business Owners, in selecting Gusto as their preferred platform. We are looking for someone who wants to break into the tech sales world and learn the ins and outs of account management within the channel space.<br/><br/>In this role, you will consult with and support current Channel Partners who have signed up on our website through phone and email communications. Your responsibilities will include educating Partners about Gusto Pro, matching our people platform offerings to the specific needs of their clients, and providing advisory sales guidance. Additionally, you will assist them in navigating the onboarding process, showcasing your expertise in customer success.<br/><br/>Here’s What You’ll Do Day-to-day<br/><br/>• Manage a high volume and velocity of emails and calls, both inbound and outbound, with Channel Partners and their Clients’ Customers at various stages of the customer journey including discovery, qualification, sales, decision/commitment, and onboarding. Approximately 70-75% of your talk time will be focused on sales-related activities<br/>• Maintain a clean and consistent record of notes in Salesforce for all Leads you work on. This will help ensure accurate and up-to-date information is available to better engage Customers<br/>• Leverage phone and email cadences, develop effective talk tracks, and employ other strategies to be a trusted advisor to Channel Partners and their Clients, assisting them in selecting Gusto as their preferred payroll and benefits platform<br/>• Educate Channel Partners about our partnership program, certification process, and guiding them to manage their Clients with GustoPro<br/>• Provide support to Clients through their account setup and onboarding process. This will comprise approximately 25-30% of your daily conversations<br/>• Exhibit Customer empathy and demonstrate a strong understanding of our product offerings to effectively address Customer needs and concerns<br/>• Exercise and refine your skills in advisory selling, presenting solutions to Channel Partners and their Small Business Clients <br/>• Participate in community and career development opportunities at Gusto, as we value growth and continuous learning within our organization.<br/><br/></li></ul>Here’s What We're Looking For<br/><br/>• Preferably working within renewals and/or retention<br/>• An ideal candidate will have at least 2 years of experience in Inside or Outside Sales, Insurance Sales, Retention, and/or Customer Success<br/>• Previous experience with making outbound dials and/or prospecting leads<br/>• Previous Salesforce experience<br/>• Track record of consistently meeting or exceeding targets and a desire to enhance your craft.<br/><br/></li></ul>Our cash compensation range for this role is offering hourly pay from $24.04 - $29.00 in the Denver, Detroit and Las Vegas locations. Final offer amounts are determined by multiple factors, including candidate experience and expertise, and may vary from the amounts listed above.<br/><br/>Gusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately 2-3 days per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto's subsidiary, whose physical office is in Scottsdale.<br/><br/>Note: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.<br/><br/>When approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.<br/><br/>Our customers come from all walks of life and so do we. We hire great people from a wide variety of backgrounds, not just because it's the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.<br/><br/>Gusto is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Gusto considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Gusto is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you require assistance in filling out a Gusto job application, please reach out to candidate-accommodations@gusto.com.", "responsibilities": "• Manage a high volume and velocity of emails and calls, both inbound and outbound, with Channel Partners and their Clients’ Customers at various stages of the customer journey including discovery, qualification, sales, decision/commitment, and onboarding. Approximately 70-75% of your talk time will be focused on sales-related activities\n• Maintain a clean and consistent record of notes in Salesforce for all Leads you work on. This will help ensure accurate and up-to-date information is available to better engage Customers\n• Leverage phone and email cadences, develop effective talk tracks, and employ other strategies to be a trusted advisor to Channel Partners and their Clients, assisting them in selecting Gusto as their preferred payroll and benefits platform\n• Educate Channel Partners about our partnership program, certification process, and guiding them to manage their Clients with GustoPro\n• Provide support to Clients through their account setup and onboarding process. This will comprise approximately 25-30% of your daily conversations\n• Exhibit Customer empathy and demonstrate a strong understanding of our product offerings to effectively address Customer needs and concerns\n• Exercise and refine your skills in advisory selling, presenting solutions to Channel Partners and their Small Business Clients \n• Participate in community and career development opportunities at Gusto, as we value growth and continuous learning within our organization.", "qualifications": {"required": "• Preferably working within renewals and/or retention\n• An ideal candidate will have at least 2 years of experience in Inside or Outside Sales, Insurance Sales, Retention, and/or Customer Success\n• Previous experience with making outbound dials and/or prospecting leads\n• Previous Salesforce experience\n• Track record of consistently meeting or exceeding targets and a desire to enhance your craft.", "preferred": ""}, "skills": ["Salesforce"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999940096"}