{"jobTitle": "Executive Assistant", "company": {"name": "SoFi", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$45.00/hr - $84.00/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Financial Services", "description": "Employee Applicant Privacy Notice<br/><br/><strong>Who we are:<br/><br/></strong>Shape a brighter financial future with us.<br/><br/>Together with our members, we’re changing the way people think about and interact with personal finance.<br/><br/>We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. <strong>Join us to invest in yourself, your career, and the financial world.<br/><br/></strong><strong>The role<br/><br/></strong>SoFi is looking for a highly organized and proactive Executive Assistant to support our Executive Vice President, Group Business Unit Leader for our Spend, Invest, Protect, and Save (SIPS) team. This person will help lead the charge as a culture carrier through seamless communication and execution. The ideal candidate is someone who:<br/><br/><br/><ul><li>Is a problem solver with excellent business acumen and proven organizational skills</li><li>Demonstrates an ability to juggle multiple critical requests autonomously and effectively</li><li>Demonstrates an ability to be proactive, take initiative, exercise good judgment, discretion, and confidentiality</li><li>Has proven experience managing demanding and complex calendars with strong execution and communication skills</li><li>Leads with SoFi Values, contributing to the positive work environment and further improving team engagement </li><li>Is excited about collaborating with other Executive Assistants to offer seamless executive support across the SoFi Executive Team</li><li>Thrives in a fast-paced, demanding environment and exhibits calmness and control under pressure<br/><br/><br/></li></ul><strong>What you’ll do:<br/><br/><br/></strong><ul><li>Plan, organize, and manage complex calendars (resolve overlapping commitments and protect time for priorities) and use sound judgment to map out the day-to-day “itinerary” of meetings, events, and responsibilities</li><li>Coordinate weekly travel arrangements</li><li>Manage logistics for special events such as team all-hands, off-sites and Board Meetings</li><li>Manage and reconcile expense reports, purchase and procurement requisitions, and contracts within time constraints</li><li>Assist with special projects and initiatives as assigned by the Executive, which may involve research, data analysis, and coordination with other departments</li><li>Draft, proofread, and edit documents, presentations, and reports as needed</li><li>Build and maintain positive relationships with internal stakeholders, including senior leadership, department heads, and team members</li><li>Support your leader in maintaining relationships with key stakeholders to ensure continuity in communications and to surface and pursue opportunities for collaboration<br/><br/><br/></li></ul><strong>What you’ll need:<br/><br/><br/></strong><ul><li>7 + years of experience providing administrative support to 1 or more executives; including calendar, travel, and expense report management</li><li>Excellent computer skills and a strong grasp of Google docs, Google calendar, and Outlook</li><li>Incredibly organized and detail-oriented</li><li>Able to prioritize multiple assignments and change direction quickly</li><li>Must be flexible and able to quickly react to last minute changes</li><li>Strong scheduling and calendar prioritization skills</li><li>Knowledgeable about organizing off-site events</li><li>Experience at a tech company<br/><br/><br/></li></ul><strong>Compensation And Benefits<br/><br/></strong>The base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.<br/><br/>To view all of our comprehensive and competitive benefits, visit our <strong>Benefits at SoFi </strong>page!<br/><br/>SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.<br/><br/>The Company hires the best qualified candidate for the job, without regard to protected characteristics.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/>New York applicants: Notice of Employee Rights<br/><br/>SoFi is committed to embracing diversity. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.<br/><br/>Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.<br/><br/><strong>Internal Employees<br/><br/></strong>If you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.", "responsibilities": "Plan, organize, and manage complex calendars (resolve overlapping commitments and protect time for priorities) and use sound judgment to map out the day-to-day “itinerary” of meetings, events, and responsibilities\nCoordinate weekly travel arrangements\nManage logistics for special events such as team all-hands, off-sites and Board Meetings\nManage and reconcile expense reports, purchase and procurement requisitions, and contracts within time constraints\nAssist with special projects and initiatives as assigned by the Executive, which may involve research, data analysis, and coordination with other departments\nDraft, proofread, and edit documents, presentations, and reports as needed\nBuild and maintain positive relationships with internal stakeholders, including senior leadership, department heads, and team members\nSupport your leader in maintaining relationships with key stakeholders to ensure continuity in communications and to surface and pursue opportunities for collaboration", "qualifications": {"required": "7 + years of experience providing administrative support to 1 or more executives; including calendar, travel, and expense report management\nExcellent computer skills and a strong grasp of Google docs, Google calendar, and Outlook\nIncredibly organized and detail-oriented\nAble to prioritize multiple assignments and change direction quickly\nMust be flexible and able to quickly react to last minute changes\nStrong scheduling and calendar prioritization skills\nKnowledgeable about organizing off-site events\nExperience at a tech company", "preferred": ""}, "skills": ["Google Docs", "Google Calendar", "Outlook", "Calendar Management", "Travel Arrangements", "Expense Report Management", "Event Planning", "Project Management", "Communication", "Relationship Building", "Problem Solving", "Organization", "Detail-Oriented", "Prioritization", "Flexibility", "Tech Company Experience"], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "The base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.<br/><br/>To view all of our comprehensive and competitive benefits, visit our <strong>Benefits at SoFi </strong>page!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999955286"}