{"jobTitle": "Client Service Representative", "company": {"name": "Teq", "location": "Huntington Station, NY"}, "location": "Huntington Station, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "50,000.00/yr - 60,000.00/yr", "currency": "USD"}, "jobFunction": "Other", "industry": "Internet Publishing", "description": "<em><strong>About us:<br/><br/></strong></em>Teq is an Educational Technology organization, dedicated to championing the evolution of the modern classroom. Our headquarters, based in Huntington Station, Long Island, is home to over 150 employees. For 52 years, we have provided the education community with solutions to improve student learning and support sustainable growth in 20 states across the U.S. We pride ourselves on supporting our schools with a unique blend of experienced service, innovative products, and incomparable support, while fostering passion and creativity in the 21st century learning environment.<br/><br/>We are currently hiring a <strong>Client Service Representative</strong>. In this role you will support our customers by ensuring orders are fulfilled quickly while maximizing customer satisfaction. As a CSR you will communicate lead times and all relevant information to the customer, coordinate with other departments on execution of purchase orders, delivery, installation and technical service. The ideal candidate will have a strong customer focused mindset, positive attitude and the ability to flourish in a team environment.<br/><br/><em><strong>Additional responsibilities in this role:<br/><br/></strong></em><ul><li>Process customer orders in an accurate and timely manner utilizing SAP accounting/CRM system - Order ownership from order entry through invoicing</li><li>Partner with sales department as needed to successfully complete all customer orders</li><li>Communicate with customers on key project details including inventory status, delivery/installation schedule and expected lead time for completion of orders</li><li>Daily interaction with various departments including but not limited to: Sales, Warehouse, Purchasing, Field Service Technicians, Professional Development, Technical Support, and Installation Team. In-person collaboration is mandatory</li><li>Monitoring large projects including planning, coordination of resources, progress reporting and issue resolution</li><li>Other responsibilities as needed<br/><br/></li></ul><em><strong>What you’ll bring to the team:<br/><br/></strong></em><ul><li>2-3 years of customer service or order management experience; Office experience preferred</li><li>Strong computer skills and proficiency in order management systems and Microsoft Office Suite</li><li>Excellent verbal and written skills, attention to detail with strong organizational and time-management skills</li><li>Ability to exercise good judgment, tact and diplomacy when interacting with customers, other employees and managers</li><li>Flexible to adapt to changing priorities with the ability to work under pressure in an evolving, fast-paced environment</li><li>Proactive attitude with a solid commitment to customer satisfaction and continuous improvement<br/><br/></li></ul><em><strong>What we offer:<br/><br/></strong></em><ul><li>$50,000-$60,000 annually</li><li>Generous PTO plus 14 paid holidays</li><li>We take work-life balance seriously! Defined workday (no evenings or weekends required)</li><li>Comprehensive insurance: medical, dental, vision, life, disability</li><li>401k savings plan with company matching</li><li>State-of-the-art facilities</li><li>Regular training and professional development opportunities</li><li>Fun company culture including in-office perks like daily snacks, holiday celebrations, sponsored lunches, discounted products, and much more!<br/><br/></li></ul><em>This position is onsite; there is no remote work available.<br/><br/></em><strong>Not sure if you qualify? Apply anyway!</strong>At Teq, we understand that success can take many forms. Whether you’re just starting out, a career changer, or looking to take the next step, we want to hear from you.<br/><br/><em>Teq is an equal opportunity employer committed to diversity, belonging, and inclusion. All applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans' status, or any other characteristic protected by law.<br/><br/></em>Powered by JazzHR<br/><br/>ER167pVDMy", "responsibilities": "In this role you will support our customers by ensuring orders are fulfilled quickly while maximizing customer satisfaction. As a CSR you will communicate lead times and all relevant information to the customer, coordinate with other departments on execution of purchase orders, delivery, installation and technical service. The ideal candidate will have a strong customer focused mindset, positive attitude and the ability to flourish in a team environment.", "qualifications": {"required": "2-3 years of customer service or order management experience; Office experience preferred, Strong computer skills and proficiency in order management systems and Microsoft Office Suite, Excellent verbal and written skills, attention to detail with strong organizational and time-management skills, Ability to exercise good judgment, tact and diplomacy when interacting with customers, other employees and managers, Flexible to adapt to changing priorities with the ability to work under pressure in an evolving, fast-paced environment, Proactive attitude with a solid commitment to customer satisfaction and continuous improvement"}, "skills": ["Customer Service", "Order Management", "Microsoft Office Suite", "SAP"], "postedDate": "1 week ago", "benefits": "$50,000-$60,000 annually, Generous PTO plus 14 paid holidays, We take work-life balance seriously! Defined workday (no evenings or weekends required), Comprehensive insurance: medical, dental, vision, life, disability, 401k savings plan with company matching, State-of-the-art facilities, Regular training and professional development opportunities, Fun company culture including in-office perks like daily snacks, holiday celebrations, sponsored lunches, discounted products, and much more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999976339"}