{"jobTitle": "Western Regional Sales Manager", "company": {"name": "Eatery Essentials ", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Packaging and Containers Manufacturing", "description": "<strong>Description:<br/><br/></strong><strong>Job Summary:<br/><br/></strong>We’re looking for a results-driven regional sales manager to actively seek out and engage customer prospects. You will provide complete and appropriate solutions for every customer to boost top-line revenue growth, customer acquisition levels and profitability.<br/><br/><strong><strong>Duties/ Responsibilities:<br/><br/></strong></strong><ul><li> Be knowledgeable about the product.</li><li> Identify prospective customers, lead generation and conversion.</li><li> Contact new and existing customers to discuss needs.</li><li> Emphasize the features of products to highlight how they solve customer problems.</li><li> Answer questions about the products.</li><li> Negotiate prices, terms and prepare sales agreements.</li><li> Collaborate with colleagues in many different sectors.</li><li> Maintain contact lists and follow up with customers to continue relationships.</li><li> Maintains knowledge of industry trends, best practices, regulatory changes, talent management, and employment law.</li><li> Customer service skills to listen to the concerns of a customer and be able to address their needs.</li><li> Interpersonal skills to work with a wide variety of people each day, build relationships and network.</li><li> Confidence and strong self-assuredness to succeed in cold-calling customers and making a sale.</li><li> Communication skills, especially persuasion, to clearly convey the benefits of a product to potential customers.</li><li> Physical endurance, as Regional Sales Manager you may need to be on your feet for long hours, spend a lot of time traveling between locations and carry heavy products.</li><li> Present, promote and sell products/services using solid arguments to existing and prospective customers.</li><li> Perform cost--benefit and needs analysis of existing/potential customers to meet their needs.</li><li> Establish, develop, and maintain positive business and customer relationships.</li><li> Reach out to customer leads through cold calls using email, phone, social media platforms and in person.</li><li> Expedite the resolution of customer problems and complaints to maximize satisfaction.</li><li> Achieve agreed upon sales targets and outcomes within schedule.</li><li> Coordinate sales effort with team members and other departments.</li><li> Analyze the multi-state territory/market’s potential, track sales and status reports.</li><li> Supply management with reports on customer needs, problems, interests, competitive activities, and potential for new products and services.</li><li> Keep abreast of best practices and promotional trends.</li><li> Continuously improve through feedback</li><li> Must be able to meet reporting deadlines with complete and thorough detailed analysis.</li><li> Must be able to problem solve, present solutions, and execute plans.</li><li> This position not only requires sales growth, but a conscientious drive to maximize profitability.</li><li> Must be a self-starter that can work independently to drive the required growth.</li><li> Must be able to work under pressure and meet sales goals.<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><strong>Required Skills/Abilities:<br/><br/></strong><ul><li> Proven work experience as a sales representative or regional sales manager with a proven track record of aggressive growth attainment.</li><li> Excellent knowledge of MS Office</li><li> Familiarity with BRM and CRM practices along with ability to build productive business professional relationships.</li><li> Highly motivated and target driven with a proven track record in sales.</li><li> Excellent selling, communication, and negotiation skills</li><li> Prioritizing, time management and organizational skills</li><li> Ability to create and deliver presentations tailored to the audience’s needs.</li><li> Relationship management skills and openness to feedback<br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Education and Experience:<br/><br/></strong><ul><li> Bachelor’s degree in communication, Marketing or related preferred.</li><li> Five years of Sales experience preferred.</li><li> Speak Spanish fluently is a plus.<br/><br/></li></ul><strong><strong>Physical Requirements:<br/><br/></strong></strong><ul><li> Prolonged periods of sitting at a desk and working on a computer.</li><li> Prolonged periods of standing and walking at trade shows.</li><li> Must be able to travel locally and throughout a multi-state region.</li><li> Must be able to lift up to 15 pounds at times.</li><li> Requires 75% travel and overnights.<br/><br/></li></ul><em>Eatery Essentials, Inc is an equal opportunity employer. All applicants will be considered for employment without regard to race, color, religion, gender, national origin, disability, protected Veteran status or any other characteristic protected by federal, state or local law.</em>", "postedDate": "1 week ago", "skills": ["MS Office", "BRM", "CRM", "Sales", "Communication", "Negotiation", "Prioritization", "Time Management", "Organizational Skills", "Presentations", "Relationship Management", "Feedback"], "url": "https://www.linkedin.com/jobs/view/3999998865"}