{"jobTitle": "Account Executive", "company": {"name": "Teads", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "80,000.00/yr - 120,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Advertising Services", "description": "Teads is seeking a motivated seller to join our growing sales team in New York City! As an Account Executive for Teads, your primary focus will be to promote the sale of our platform to key agency accounts throughout the East Coast.<br/><br/>Responsibilities Include But Are Not Limited To The Following<br/><br/>\n<ul><li>Prospecting and closing business with a targeted list of agency and advertiser accounts</li><li>Developing strong, mutually beneficial relationships with clients</li><li>Working closely with internal teams to ensure a united vision when corresponding with clients</li><li>Representing Teads in the online marketplace and becoming an active Brand Advocate</li><li>Working closely with Client Services, Ad Operations, and Sales Planning to ensure client campaign expectations are communicated internally</li><li>Ensuring a high level of client satisfaction to generate renewals and increase incremental revenue<br/><br/></li></ul>Skills &amp; Expertise<br/><br/>\n<ul><li>Prior digital media sales experience is required, ideally within mobile or video</li><li>Strong programmatic knowledge/experience</li><li>Previous tech platform experience</li><li>Deep relationships with contacts at top-tier agencies and advertisers</li><li>Understanding of the digital video marketplace</li><li>Desire to work in a changing, fast-paced start up</li><li>Outstanding communication and presentation skills</li><li>Driven, passionate, and an ultimate team player</li><li>BS/BA degree or equivalent work experience <br/><br/></li></ul><em>The base salary range is $80K-$120K; Salary does not include other forms of compensation or benefits offered in connection with this role. This role is eligible for a discretionary quarterly bonus and/or commission payments based, in part, individual and company performance relative to pre-established targets. Pay is based on various non-discriminatory factors including but not limited to experience, education, and skills.<br/><br/></em><strong>===== ABOUT TEADS ======<br/><br/></strong><em>Teads operates a leading, cloud-based, omnichannel platform that enables programmatic digital advertising across a global ecosystem of quality digital media. As an end-to-end solution, Teads’ modular platform allows partners to leverage buy-side, sell-side, creative, data and AI optimization technologies.<br/><br/></em><em>For advertisers and their agencies, Teads offers a single access point to buy the inventory of many of the world's best publishers and content providers. Through exclusive global media partnerships, Teads enables advertisers and agencies to reach billions of unique monthly users in brand safe, responsible advertising environments, while improving the effectiveness and efficiency of digital ad transactions.<br/><br/></em><em>Teads partners with the leading marketers, agencies and publishers through a team of 1,200+ people in 50 offices across more than 30 countries.<br/><br/></em>", "responsibilities": "Prospecting and closing business with a targeted list of agency and advertiser accounts, Developing strong, mutually beneficial relationships with clients, Working closely with internal teams to ensure a united vision when corresponding with clients, Representing Teads in the online marketplace and becoming an active Brand Advocate, Working closely with Client Services, Ad Operations, and Sales Planning to ensure client campaign expectations are communicated internally, Ensuring a high level of client satisfaction to generate renewals and increase incremental revenue", "qualifications": {"required": "Prior digital media sales experience is required, ideally within mobile or video, Strong programmatic knowledge/experience, Previous tech platform experience, Deep relationships with contacts at top-tier agencies and advertisers, Understanding of the digital video marketplace, Desire to work in a changing, fast-paced start up, Outstanding communication and presentation skills, Driven, passionate, and an ultimate team player, BS/BA degree or equivalent work experience"}, "skills": ["Digital Media Sales", "Programmatic", "Tech Platform", "Digital Video", "Communication", "Presentation Skills"], "postedDate": "1 week ago", "benefits": "The base salary range is $80K-$120K; Salary does not include other forms of compensation or benefits offered in connection with this role. This role is eligible for a discretionary quarterly bonus and/or commission payments based, in part, individual and company performance relative to pre-established targets. Pay is based on various non-discriminatory factors including but not limited to experience, education, and skills.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999737595"}