{"jobTitle": "Supply Chain Inventory Control Administrator, Boca Raton Supply Chain, FT, 7:30A-4P", "company": {"name": "Baptist Health", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.32 - 26.42", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "Baptist Health South Florida is the region’s largest not-for-profit healthcare organization with 12 hospitals, more than 27,000 employees, 4,000 physicians, and 200 outpatient centers, urgent care facilities, and physician practices spanning across Miami-Dade, Monroe, Broward, and Palm Beach counties. Baptist Health has internationally renowned centers of excellence in cancer, cardiovascular care, orthopedics and sports medicine, and neurosciences. Baptist Health is supported by philanthropy and committed to its faith-based charitable mission of medical excellence.<br/><br/>Our mission, vision, and values make us who we are at Baptist Health and are at the center of everything we do. At Baptist Health, we positively impact the human experience for patients, employees, and physicians. Our success comes from a culture of quality and dedication that is instilled into every member of the Baptist Health family.<br/><br/>This year, and for 24 years, we’ve been named one of Fortune’s 100 Best Companies to Work For, based on employee feedback. We’ve also been recognized as one of America’s Most Innovative Companies and People Magazine included us in 50 Companies That Care. Based on the U.S. News &amp; World Report 2023-2024 Best Hospital Rankings, Baptist Health is the most awarded healthcare system in South Florida, with its hospitals and institutes earning 45 high-performing honors.<br/><br/>But really, the reason we’re excited to come to work is the people.<br/><br/>Working together, we form personal connections with our colleagues that are stronger than most of us have experienced at other jobs. We develop caring relationships with our patients and their families that go beyond just delivering healthcare. After all, we know what it’s like to be in their shoes. Many of us have been patients here and have had family members as patients here. We’re committed to delivering quality care in the most compassionate way possible because we feel a personal stake in the outcomes. When it comes to caring for people, we’re all in.<br/><br/><strong>Description<br/><br/></strong>The Supply Chain Inventory Control Technician is responsible for the accurate monitoring, ordering, and storage of inventory supplies in a warehouse / storeroom setting. Responsible for verifying all inventory reports, correcting errors after researching the source of the error, and auditing inventory transactions. Planning, organizing, and prioritizing daily work assignments while completing them in a timely manner. Works effectively as a team member while providing direction to Supply Technicians. This individual must have effective communication and interpersonal skills. Computer skills are required, must be proficient with Microsoft Word, Excel, and Outlook. Knowledge of business intelligence software and data analytics. Proven ability to multi-task, work well under pressure and in a fast-paced environment. Estimated pay range for this position is $20.32 - $26.42 / hour depending on experience.<br/><br/><strong>Qualifications<br/><br/></strong>Degrees: Associates Licenses &amp; Certifications: Drivers License from Florida Additional Qualifications: Valid drivers license and clean driving record required for daily use of a company vehicle to transport supplies between facilities. Minimum Required Experience:<br/><br/>EOE", "responsibilities": "The Supply Chain Inventory Control Technician is responsible for the accurate monitoring, ordering, and storage of inventory supplies in a warehouse / storeroom setting. Responsible for verifying all inventory reports, correcting errors after researching the source of the error, and auditing inventory transactions. Planning, organizing, and prioritizing daily work assignments while completing them in a timely manner. Works effectively as a team member while providing direction to Supply Technicians. This individual must have effective communication and interpersonal skills. Computer skills are required, must be proficient with Microsoft Word, Excel, and Outlook. Knowledge of business intelligence software and data analytics. Proven ability to multi-task, work well under pressure and in a fast-paced environment.", "qualifications": {"required": "Valid drivers license and clean driving record required for daily use of a company vehicle to transport supplies between facilities."}, "skills": [], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999959733"}