{"jobTitle": "Senior Director of Partnerships and Business Development", "company": {"name": "Xage Security", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Business Development and Sales", "industry": "Computer and Network Security", "description": "About Xage Xage is the first and only zero trust real-world security company. Powered by the Xage Fabric, the company’s Identity & Access Management, remote access, and dynamic data security solutions allow customers to secure, manage, and transform operations. With its distributed, scalable, and easy-to-operate Fabric, Xage solves the complex digitization challenges of the real-world operations we rely on. Xage customers include leaders in manufacturing, energy, O&G, utilities, space, logistics, and transportation. About the Role Seeking a highly experienced and strategic Vice President of Partnership and Business Development to drive our go-to-market (GTM) strategy through strategic alliances and sales channels. The ideal candidate will have a proven track record of forming new partnerships and driving business growth through these relationships. This role requires strong experience working with global industrial OEMs such as Honeywell, Rockwell, Siemens, ABB, and Yokogawa, ideally with a focus on cybersecurity. Experience with cybersecurity integrators and resellers like Optiv, GuidePoint, and Cyderes also helpful Key Responsibilities<br/><br/><ul><li>Identify, negotiate, and establish strategic alliances with global industrial OEMs and cybersecurity integrators to enhance our GTM strategy</li><li>Develop and execute partnership strategies that align with our business goals and objectives</li><li>Foster and maintain strong relationships with partners to drive mutual business growth</li><li>Expand sales channels by identifying and developing new opportunities with resellers and integrators</li><li>Collaborate with sales and marketing teams to ensure alignment and execution of partnership initiatives</li><li>Drive contracts, sales enablement, and incentive programs to maximize partner performance</li><li>Develop and implement sales enablement strategies to empower partners with the tools and resources they need to succeed</li><li>Create and manage partner training programs to ensure they are knowledgeable about our products and solutions</li><li>Monitor and analyze partner performance metrics to identify areas for improvement and growth</li><li>Lead contract negotiations with partners, ensuring favorable terms and compliance with company policies</li><li>Manage and oversee the execution of partnership agreements and contracts</li><li>Ensure all partnerships are structured to deliver maximum value to both parties</li><li>Conduct market research to identify trends and opportunities within the industrial and cybersecurity sectors</li><li>Provide insights and recommendations to senior leadership on potential partnerships and business development strategies</li><li>Stay abreast of industry developments and competitor activities to inform strategic decision-making<br/><br/><br/></li></ul>What you need to succeed<br/><br/><ul><li>Bachelor’s degree in Business, Marketing, or a related field; MBA or advanced degree preferred</li><li>Minimum of 10 years of experience in business development, partnership management, or a related field</li><li>Proven track record of success in forming and managing strategic partnerships, particularly with global industrial OEMs and preferably also cybersecurity integrators and resellers</li><li>Strong network within the industrial and cybersecurity sectors</li><li>Excellent negotiation, communication, and interpersonal skills</li><li>Ability to think strategically and execute tactically</li><li>Strong analytical and problem-solving skills</li><li>Ability to travel as needed to meet with partners and attend industry events<br/></li></ul>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999551233"}