{"jobTitle": "Director, Strategic Partnerships", "company": {"name": "Future", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$75,000 - $100,000", "currency": "USD"}, "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "Future PLC is a global, multi-platform media company and leading digital publisher, with scalable brands and diversified revenue streams. We are dedicated to connecting over 300 million people worldwide with their passions through expert content, world-class events, and cutting-edge proprietary technology. We have big ambitions to transform media and change people's lives.<br/><br/>Future B2B, a Division of Future PLC, delivers unparalleled client and audience experience across newsletters, advertising, lead generation, content creation, webinars and live events. Future B2B includes SmartBrief's extensive network of targeted industry newsletters, ActualTech Media's tech webinars, ITPro's in-depth technology insights and specialty content brands like Tech &amp; Learning, AVNetwork and more.<br/><br/><strong>What You'll Be Doing...<br/><br/></strong>Future's B2B division is going through a transformation, and the team is seeking an experienced Director, Strategic Partnerships to join a thriving team of strategic sales-minded professionals. This is an excellent opportunity for someone looking to join an innovative and dynamic media organization.<br/><br/>As the Director, Strategic Partnerships, you will focus on business development activities and partnership strategy to secure new publishing partners as well as seek to identify unique commercial partnership opportunities across the B2B division, working closely with trade associations, professional societies, and nonprofits in all industries and verticals. The Director, Strategic Partnerships will develop new partner leads, manage the business development pipeline, actively pursue qualified prospects and manage the contracting process through signature. Collaboration is key in this role as you will partner across various brands and teams (sales, editorial, product) to ensure that new business and partner prospects are actively vetted for quality, sustainability and profitability. This role will work collaboratively with the VP Global Head of Content while reporting to the Head of Partnerships.<br/><br/>You will be a dynamic, but thoughtful team player who is seeking a fast-paced, high growth opportunity. This position presents incredible upward mobility, while operating on a highly collaborative team. Working in partnership with leading B2B content brands, trade associations, professional societies, nonprofits and corporations, our mission is to equip influential professionals with the content, data and technology they need to succeed in an ever-changing world.<br/><br/>Job responsibilities and functions include{{{{:}}}}<br/><br/><ul><li>Actively maintain and manage a robust pipeline of new partners for both ad-based and fee-based models</li><li>Present creative packages of Future B2B product offerings, based on prospect needs</li><li>Develop executive-level relationships within the Association community to ensure SmartBrief grows and retains its reputation and presence </li><li>Consistently be able to communicate the status of outbound partner sales efforts - to include active proposals, contract negotiations, etc</li><li>Be results-driven, inquisitive and competitive by nature</li><li>Possess a proven track record of academic and sales/business development success</li><li>Have experience in business development, sales and consulting</li><li>Write well and exhibit exceptional verbal communication skills</li><li>Demonstrate a solution-oriented attitude and strong work ethic</li><li>Be self-motivated to achieve personal and team objectives</li><li>Understand the value of effective collaboration and communication<br/><br/></li></ul><strong>Experience That'll Put You Ahead Of The Curve...<br/><br/></strong><ul><li>Minimum of 5 years experience in a business development, sales, or consulting role. </li><li>Bachelor's degree with strong academic record</li><li>Excellent written, verbal, and interpersonal communication skills</li><li>A keen interest in publishing, media, or advertising</li><li>Association, nonprofit or professional society experience, either in-house or in a consulting capacity, is preferred </li><li>Strong sense of organization and attention to detail</li><li>Demonstrated ability to manage multiple tasks, think creatively to solve problems, and work effectively in a fast-paced media/technology business</li><li>Computer savvy with proficiency with in basic business software suites, including Salesforce, Microsoft Excel, Word, PowerPoint and G-suite</li><li>Team-oriented and professional attitude<br/><br/></li></ul><strong>What's In It For You...<br/><br/></strong>We have a number of awesome perks available to our staff. We offer huge opportunities to learn and develop, whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues. We have a fantastic culture where we really do care about our people and want everyone to succeed. Varied roles mean you're not pigeonholed into one finite area but get the opportunity to develop a wide range of skills and experience.<br/><br/>Additional benefits include health Insurance; ranging from medical to dental and even vision care,<br/><br/>401k match and monthly munchies, bagel Fridays, fresh fruit &amp; snacks and coffee and tea on tap.<br/><br/>And to top it all off, not only do we offer unlimited holiday because we trust you to manage your workload and time but we also offer a share in our success whereby every colleague is eligible to join our profit pool bonus scheme - if Future hits their performance targets all colleagues may receive a bonus.<br/><br/><strong>Internal job family level P4<br/><br/></strong><strong>Please note, the salary range for this position is $75,000 - $100,000<br/><br/></strong><strong>This is a Remote based role<br/><br/></strong><strong>Who Are We...<br/><br/></strong>We're Future. We're 3000+ colleagues over 250+ brands speaking to 400 million people every month across the globe through websites, events and magazines. We've got ambitious plans that build on our growth momentum and unlock new opportunities and we're looking for talented people who want to be a part of it.<br/><br/><strong>Our Future, Our Responsibility - Inclusion and Diversity at Future<br/><br/></strong>We have a voice and we're going to use it. We promote diversity and inclusion not just in our recruitment processes, but everything we do. We're an equal opportunity employer and we will continue to ensure our recruitment process is free of bias and our workplaces are inclusive, positive, free of discrimination and respecting of all backgrounds and beliefs. Our culture is underpinned by our values and employees - current and future - are treated with respect and fairness.<br/><br/><strong>Please let us know if you need any reasonable adjustments made so we can give you the best experience!<br/><br/></strong>Find out more about Our Future, Our Responsibility on our website.<br/><br/>", "responsibilities": "<ul><li>Actively maintain and manage a robust pipeline of new partners for both ad-based and fee-based models</li><li>Present creative packages of Future B2B product offerings, based on prospect needs</li><li>Develop executive-level relationships within the Association community to ensure SmartBrief grows and retains its reputation and presence </li><li>Consistently be able to communicate the status of outbound partner sales efforts - to include active proposals, contract negotiations, etc</li><li>Be results-driven, inquisitive and competitive by nature</li><li>Possess a proven track record of academic and sales/business development success</li><li>Have experience in business development, sales and consulting</li><li>Write well and exhibit exceptional verbal communication skills</li><li>Demonstrate a solution-oriented attitude and strong work ethic</li><li>Be self-motivated to achieve personal and team objectives</li><li>Understand the value of effective collaboration and communication<br/><br/></li></ul>", "qualifications": {"required": "Minimum of 5 years experience in a business development, sales, or consulting role.  \nBachelor's degree with strong academic record\nExcellent written, verbal, and interpersonal communication skills\nA keen interest in publishing, media, or advertising\nStrong sense of organization and attention to detail\nDemonstrated ability to manage multiple tasks, think creatively to solve problems, and work effectively in a fast-paced media/technology business\nComputer savvy with proficiency with in basic business software suites, including Salesforce, Microsoft Excel, Word, PowerPoint and G-suite\nTeam-oriented and professional attitude", "preferred": "Association, nonprofit or professional society experience, either in-house or in a consulting capacity, is preferred"}, "skills": ["Salesforce", "Microsoft Excel", "Word", "PowerPoint", "G-suite"], "postedDate": "6 days ago", "benefits": "We have a number of awesome perks available to our staff. We offer huge opportunities to learn and develop, whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues. We have a fantastic culture where we really do care about our people and want everyone to succeed. Varied roles mean you're not pigeonholed into one finite area but get the opportunity to develop a wide range of skills and experience.<br/><br/>Additional benefits include health Insurance; ranging from medical to dental and even vision care,<br/><br/>401k match and monthly munchies, bagel Fridays, fresh fruit &amp; snacks and coffee and tea on tap.<br/><br/>And to top it all off, not only do we offer unlimited holiday because we trust you to manage your workload and time but we also offer a share in our success whereby every colleague is eligible to join our profit pool bonus scheme - if Future hits their performance targets all colleagues may receive a bonus.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999088361"}