{"jobTitle": "Executive Assistant/Office Manager", "company": {"name": "Sony Music Entertainment", "industry": "Music", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "60,000.00—70,000.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Musicians", "description": "About Sony Music Entertainment<br/><br/>At Sony Music Entertainment, we fuel the creative journey. We’ve played a pioneering role in music history, from the first-ever music label to the invention of the flat disc record. We’ve nurtured some of music’s most iconic artists and produced some of the most influential recordings of all time.<br/><br/>Today, we work in more than 70 countries, supporting a diverse roster of international superstars, developing and independent artists, and visionary creators. From our position at the intersection of music, entertainment, and technology, we bring imagination and expertise to the newest products and platforms, embrace new business models, employ breakthrough tools, and provide powerful insights that help our artists push creative boundaries and reach new audiences. In everything we do, we’re committed to artistic integrity, transparency, and entrepreneurship.<br/><br/>Sony Music Entertainment is a member of the Sony family of global companies.<br/><br/>As the Executive Assistant/Office Manager at Ultra Records you will provide administrative support to the President of Ultra Records handling a wide range of administrative and executive support related tasks as well as oversee the overall operations of the office for the label.<br/><br/>What you'll do:<br/><br/>\n<ul><li>Calendar management, including scheduling of appointments across multiple time zones, arranging rooms, video conferences, and audio facilities, routing meeting agendas and key documents</li><li>Screen incoming calls and greet guests </li><li>Manage domestic and international travel schedules for President of Ultra</li><li>Complete monthly T&amp;E reports in Concur, pay department invoices, and reconcile AMEX Travel statements.</li><li>Order office supplies for the label</li><li>Oversee the overall operations and efficiency of the office for Ultra</li><li>Provide key executive administrative support to the President of Ultra - anticipate needs, follow-through on all details and handle all confidential situations</li><li>Plan and manage events for Ultra including NY-based and international meetings, artist showcases, concert outings, and all staff teambuilding events. Work with finance to establish a budget, research options (venues, location sites, transportation, catering, permits as necessary, etc.), develop proposal and make recommendations, select vendors and sign contracts ensuring competitive pricing and oversee execution</li><li>Manage office floor plans – ensure accuracy of allocation charges, manage space allocations and create setup for all new employees. Oversee and manage all aspects of employee moves</li><li>Serve as point of contact for NY and LA-based staff as relates to Sony facilities regarding building policies and work to be done or maintenance issues; IT &amp; Telecommunications regarding purchased employee equipment; other vendors as needed</li><li>Work with the President of Sony Ultra on the annual business plan presentation requiring strong PowerPoint and Microsoft Excel skills</li><li>Assist the President of Ultra and finance on drafting and distributing monthly financial reports<br/><br/></li></ul>Who you are:<br/><br/>\n<ul><li>2 plus years administrative experience required (music industry experience a plus)</li><li>Bachelor’s Degree preferred</li><li>Requires knowledge of Microsoft Office Programs (Word, Outlook, PowerPoint)</li><li>Ability to multi-task and meet pressure deadlines</li><li>Flexibility with hours</li><li>Knowledge and interest in electronic music and culture</li><li>Highly Organized</li><li>Fast learner</li><li>Excellent written and verbal communication skill<br/><br/></li></ul>What we give you:<br/><br/>\n<ul><li>You join an inclusive, collaborative and global community where you have the opportunity to channel your passion every day </li><li>A modern office environment designed to foster productivity, creativity, and teamwork empowering you to bring your best </li><li>An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching </li><li>Voluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans </li><li>Investment in your professional growth and development enabling you to thrive in our vibrant community. </li><li>The space to accelerate progress, positively disrupt, and create what happens next </li><li>Time off for a winter recess<br/><br/></li></ul><em>Sony Music is committed to providing equal employment opportunity for all persons regardless of age, disability, national origin, race, color, religion, sex, sexual orientation, gender, gender identity or expression, pregnancy, veteran or military status, marital and civil partnership/union status, alienage or citizenship status, creed, genetic information or any other status protected by applicable federal, state, or local law.<br/><br/></em>The anticipated annual base salary does not include any other compensation components or other benefits that an individual may be eligible for. The actual base salary offered depends on a variety of factors, which may include as applicable, the qualifications of the individual applicant for the position, years of relevant experience, specific and unique skills, level of education attained, certifications or other professional licenses held, and the location in which the applicant lives and/or from which they will be performing the job.<br/><br/>New York Pay Range<br/><br/>$60,000—$70,000 USD", "responsibilities": "As the Executive Assistant/Office Manager at Ultra Records you will provide administrative support to the President of Ultra Records handling a wide range of administrative and executive support related tasks as well as oversee the overall operations of the office for the label.", "qualifications": {"required": "2 plus years administrative experience required (music industry experience a plus)", "preferred": "Bachelor’s Degree preferred"}, "skills": ["Microsoft Office", "Calendar Management", "Travel Arrangements", "Concur", "Event Planning", "Office Management", "Communication", "Organization", "Microsoft Excel", "PowerPoint"], "postedDate": "5 days ago", "benefits": "An attractive and comprehensive benefits package including medical, dental, vision, life &amp; disability coverage, and 401K + employer matching \nVoluntary benefits like company-paid identity theft protection and resources for pets, mental health and meditation resources, industry-leading fertility coverage, fully paid leave for childbirth or bonding, fully paid leave for caregivers, programs for loved ones with developmental disabilities and neurodiversity, subsidized back-up child and elder care, and reimbursement for adoption, surrogacy, tuition, and student loans", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999392860"}