{"jobTitle": "Call Center Survey Interviewer - Work from home!", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Part-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$14.00 and $16.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Do you have experience conducting surveys or with customer service and would like to work from home? I/H/R Research Group LLC, a leading marketing research firm established in 1976, is seeking intelligent, talented, experienced and energetic people to work as a Marketing Research Telephone Survey Interviewer. As a Telephone Survey Interviewer, you will make phone calls to consumers and businesses across the nation to conduct important surveys about a variety of interesting topics.<br/><br/>New interviewers start between $14.00 and $16.00 per hour, depending upon your qualifications, education, languages spoken, and years of experience as a marketing research telephone survey interviewer or supervisor. College students welcome! If you have no experience, no problem -- we will teach you how to be a great interviewer and start great career in research!<br/><br/>Spanish speaking bilingual interviewers begin at $15 per hour. Spanish speakers must be fluent with both reading and speaking English and Spanish. A reading and speaking test will be done during the interview.<br/><br/>To apply you must:<br/><br/><ul><li>Live in the State of Nevada (we are NOT hiring outside the State of Nevada)</li><li>Possess excellent communication skills and a great phone voice.</li><li>Have excellent reading skills (bilinguals must read English and Spanish fluently). You must read well aloud with clear voice quality, good pace, tone, enunciation, fluidity, and enthusiastic professional telephone mannerisms.</li><li>All applicants must pass a reading assessment and complete our training sessions with a passing grade.</li><li>Be proficient at using a computer and possess excellent typing skills (40+ WPM preferred). A typing test will be given for both speed and accuracy.</li><li>Possess a professional demeanor and great/positive attitude.</li><li>Have a private, quiet space to work from with no background noise or interruptions.</li><li>Be available to work 3 to 5 days (4 to 5 days preferred) Monday thru Friday, and most Saturdays (as needed). Shifts typically run from 2:30pm until 9pm during the week, and Saturdays starting at 9am. Note: these hours are NOT guaranteed but are simply examples of what hours we typically work. Hours depend on the project the employee is assigned to. Day shift hours are also available after 3 to 6 months of experience and training, depending upon education, qualifications, and other factors.<br/><br/></li></ul>To apply, you must possess the following equipment:<br/><br/><ul><li>A computer or laptop (Windows, Mac, Chromebook, etc.). A mouse is required to efficiently run our software.</li><li>A reliable fast internet connection with WIFI. All work is done from home using your own computer, which MUST be connected to high speed internet. High speed internet is REQUIRED - please have internet speeds of at least 50 Mbps DOWN and more than 10 Mbps UP. Slow internet connections will not be acceptable.</li><li>A smartphone in good working condition. You will make phone calls by connecting your own cell phone to your internet WIFI which will connect you to our cloud-based calling solution. Note: only an I/H/R Research Group caller ID is displayed.</li><li>You must be able to install apps on your smartphone.</li><li>Web camera for interview, training, and meetings as needed.</li><li>A good quality corded headset that plugs into your smartphone is required (no bluetooth headsets will be allowed).<br/><br/></li></ul>There are opportunities for both growth and advancement within our company as well. As we continue to expand, we are in need of supervisory personnel, monitors, etc.<br/><br/>Job Type: Part-time, starting within 1 to 2 weeks based on training schedules.<br/><br/>Company Description<br/><br/>At I/H/R Research Group LLC, we provide the highest quality public opinion polling, marketing research, sampling, and survey services. We conduct survey research using a variety of methodologies including telephone surveys (CATI), online surveys (CAWI), mail surveys, face-to-face (CAPI), and intercepts. The company has considerable experience with academic and government studies and offers a full range of services, including survey programming. The company was established in 1976 and is based in Henderson Nevada, with a satellite office in Orange County, CA.<br/><br/>Company Description<br/><br/>At I/H/R Research Group LLC, we provide the highest quality public opinion polling, marketing research, sampling, and survey services. We conduct survey research using a variety of methodologies including telephone surveys (CATI), online surveys (CAWI), mail surveys, face-to-face (CAPI), and intercepts. The company has considerable experience with academic and government studies and offers a full range of services, including survey programming. The company was established in 1976 and is based in Henderson Nevada, with a satellite office in Orange County, CA.", "responsibilities": "As a Telephone Survey Interviewer, you will make phone calls to consumers and businesses across the nation to conduct important surveys about a variety of interesting topics.", "qualifications": {"required": "Live in the State of Nevada (we are NOT hiring outside the State of Nevada)\nPossess excellent communication skills and a great phone voice.\nHave excellent reading skills (bilinguals must read English and Spanish fluently). You must read well aloud with clear voice quality, good pace, tone, enunciation, fluidity, and enthusiastic professional telephone mannerisms.\nAll applicants must pass a reading assessment and complete our training sessions with a passing grade.\nBe proficient at using a computer and possess excellent typing skills (40+ WPM preferred). A typing test will be given for both speed and accuracy.\nPossess a professional demeanor and great/positive attitude.\nHave a private, quiet space to work from with no background noise or interruptions.\nBe available to work 3 to 5 days (4 to 5 days preferred) Monday thru Friday, and most Saturdays (as needed). Shifts typically run from 2:30pm until 9pm during the week, and Saturdays starting at 9am. Note: these hours are NOT guaranteed but are simply examples of what hours we typically work. Hours depend on the project the employee is assigned to. Day shift hours are also available after 3 to 6 months of experience and training, depending upon education, qualifications, and other factors.<br/><br/>\nA computer or laptop (Windows, Mac, Chromebook, etc.). A mouse is required to efficiently run our software.\nA reliable fast internet connection with WIFI. All work is done from home using your own computer, which MUST be connected to high speed internet. High speed internet is REQUIRED - please have internet speeds of at least 50 Mbps DOWN and more than 10 Mbps UP. Slow internet connections will not be acceptable.\nA smartphone in good working condition. You will make phone calls by connecting your own cell phone to your internet WIFI which will connect you to our cloud-based calling solution. Note: only an I/H/R Research Group caller ID is displayed.\nYou must be able to install apps on your smartphone.\nWeb camera for interview, training, and meetings as needed.\nA good quality corded headset that plugs into your smartphone is required (no bluetooth headsets will be allowed).<br/><br/>"}, "skills": ["Customer Service", "Survey", "Communication", "Telephone", "Research", "Marketing", "Spanish", "English", "Computer", "Typing", "Internet", "WIFI", "Smartphone", "Web Camera", "Headset"], "postedDate": "6 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999049402"}