{"jobTitle": "System Engineer", "company": {"name": "Air Force Nuclear Weapons Center", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "86,962 to $134,435", "currency": "USD"}, "jobFunction": "Engineering", "industry": "Engineering Services", "description": "<strong>Come be a part of something big! Smart Minds, Cool Jobs, and Awesome Rewards! Fueled by innovation, talent and ambition, the Air Force Nuclear Weapons Center (AFNWC) is seeking civilian professionals prepared to deploy war-winning capabilities on behalf of the United States Air Force.</strong><p><br/></p><p>The Air Force Nuclear Weapons Center (AFNWC) is currently seeking to fill one<strong> </strong>full-time <strong>Systems Development Engineer</strong> <strong>(Systems Reliability Engineer) </strong>009144611M<strong> </strong>to<strong> </strong>work in the Design for Reliability and Manufacturing IPT of the Long-Range Standoff (LRSO) Cruise Missile Program Office, Nuclear Weapons Acquisition Division, Eglin AFB FL.</p><p><br/></p><p><strong>CLOSES: 28 Aug 2024</strong></p><p><br/></p><p>This position is a <strong>NH-801-03</strong> which has a typical 2024 salary range of $86,962 to $134,435 (locality included).</p><p><br/></p><p>The primary purpose of this position is to provide <strong>the senior systems development engineer in support of assigned nuclear acquisition programs during all phases of the weapon system acquisition cycle</strong>. Assignment involves complex design, cyber/IA, system safety and engineering problems encountered in the development of new weapon systems or major modifications to existing systems/weapon system programs. Conducts assessments of the modeling and simulation environment and provides technical recommendations to enhance system design, development, and performance.</p><p><br/></p><p><strong>The ideal candidates will have an engineering background in one or more of the following areas: reliability, maintainability, mechanical or systems engineering.</strong></p><p><br/></p><p>This position is <strong>n</strong>ot eligible for remote or full-time telework; situational-based agreements may be available at the discretion of the hiring manager.</p><p><br/></p><p>Permanent Change of Station (PCS) and / or Relocation Incentives may be offered.</p><p>This position <strong>may be eligible for a retention incentive</strong>. Contact the hiring manager for eligibility.</p><p><br/></p><p><strong>DUTIES:</strong></p><ul><li>Serves as reliability engineer/analyst providing guidance on reliability and maintainability engineering for organizational program.</li><li>Plans, organizes, and performs reliability and maintainability engineering analysis activities for his/her assigned area</li><li>Recommends design and/or test methods and statistical analysis approaches for achieving required and verifying levels of product reliability.</li><li>Conducts reliability and maintainability engineering analyses of hardware and software and makes recommendations to resolve deficiencies to ensure reliability has been appropriately incorporated into design.</li><li>Performs statistical data analysis, regression modeling, Weibull Analysis, hazard analysis, subsystem/system reliability growth assessment and prediction.</li><li>Prepare reliability growth assessment of likelihood of meeting reliability and maintainability requirements.</li><li>Provides direct communication with contractors and will be responsible to help manage contractor performance against cost and schedule.</li><li>Participates in failure review boards, determine root cause failure analysis, and drive corrective actions forward to completion.</li><li>Reviews and makes recommendations to test plans to ensure reliability and maintainability requirements are met.</li><li>Assesses Engineering Change Proposals (ECPs) and other system change requests to identify and quantify reliability and maintainability risks and impacts.</li><li>Represents Reliability IPT at program office Configuration Control Boards, Risk Review Boards and Technical Reviews.</li></ul><p><strong>Skills:</strong></p><ul><li>Experience conducting system availability and mission readiness analysis and related relevant reliability and maintainability activities.</li><li>Experience operating, maintaining, testing, or analyzing weapons systems or complex systems.</li><li>Strong background on reliability and maintainability modeling, prediction, and design improvement.</li><li>Familiar with and have knowledge of reliability and maintainability digital modeling tools.</li><li>Systems Engineering experience with weapon systems.</li><li>Experience preparing technical reports and briefs.</li><li>Nuclear weapon experience highly desired.</li><li>Five or more years of relevant technical experience is desired.</li></ul><p><strong> REQUIREMENTS FOR THE POSITION:</strong></p><ul><li>U.S. CITIZENSHIP</li><li>Employee must meet Defense Acquisition Workforce Improvement Act (DAWIA) requirements, which includes achieving Engineering and Technical Management “Practitioner” certification category within required timeframe after appointment.</li><li>In accordance with the Ethics in Government Act, 1978, employee may be required to file an OGE Form 450, Confidential Financial Disclosure Report, upon appointment and will be required to file annually.</li><li>Work may occasionally require travel away from the normal duty station on military or commercial aircraft.</li><li>This is a drug testing designated position and is subject to random drug testing.</li><li>Required to handle and safeguard sensitive and classified information in accordance with regulations to reduce potential compromise; employee must obtain and maintain Top Secret clearance with SCI eligibility.</li><li>To qualify as an engineer, employee must meet the education and specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards, <em>Group Coverage Qualification Standard for Professional and Scientific Positions</em>: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf</li></ul><p><br/></p><p><strong>HOW TO APPLY:</strong></p><p><strong>When applying at the link below, please use Microsoft Edge or Google Chrome. Click the apply button to complete an application and upload resume (PDF or Word Doc) and/or additional documents (Transcripts, certifications, Vet Docs (DD214), SF-50).</strong></p><p><br/></p><p>To receive additional information about current and future job openings with AFCS via email notification, please register at www.Afciviliancareers.com/linkedin-careers and sign up to “Get Career Updates.”</p><p><br/></p><p><strong>Equal Opportunity Employer. U.S. citizenship required. Must be of legal working age.</strong></p>", "responsibilities": "Serves as reliability engineer/analyst providing guidance on reliability and maintainability engineering for organizational program. Plans, organizes, and performs reliability and maintainability engineering analysis activities for his/her assigned area Recommends design and/or test methods and statistical analysis approaches for achieving required and verifying levels of product reliability. Conducts reliability and maintainability engineering analyses of hardware and software and makes recommendations to resolve deficiencies to ensure reliability has been appropriately incorporated into design. Performs statistical data analysis, regression modeling, Weibull Analysis, hazard analysis, subsystem/system reliability growth assessment and prediction. Prepare reliability growth assessment of likelihood of meeting reliability and maintainability requirements. Provides direct communication with contractors and will be responsible to help manage contractor performance against cost and schedule. Participates in failure review boards, determine root cause failure analysis, and drive corrective actions forward to completion. Reviews and makes recommendations to test plans to ensure reliability and maintainability requirements are met. Assesses Engineering Change Proposals (ECPs) and other system change requests to identify and quantify reliability and maintainability risks and impacts. Represents Reliability IPT at program office Configuration Control Boards, Risk Review Boards and Technical Reviews.", "qualifications": {"required": "U.S. CITIZENSHIP Employee must meet Defense Acquisition Workforce Improvement Act (DAWIA) requirements, which includes achieving Engineering and Technical Management “Practitioner” certification category within required timeframe after appointment. In accordance with the Ethics in Government Act, 1978, employee may be required to file an OGE Form 450, Confidential Financial Disclosure Report, upon appointment and will be required to file annually. Work may occasionally require travel away from the normal duty station on military or commercial aircraft. This is a drug testing designated position and is subject to random drug testing. Required to handle and safeguard sensitive and classified information in accordance with regulations to reduce potential compromise; employee must obtain and maintain Top Secret clearance with SCI eligibility. To qualify as an engineer, employee must meet the education and specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards, <em>Group Coverage Qualification Standard for Professional and Scientific Positions</em>: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/files/all-professional-engineering-positions-0800.pdf", "preferred": "Experience conducting system availability and mission readiness analysis and related relevant reliability and maintainability activities. Experience operating, maintaining, testing, or analyzing weapons systems or complex systems. Strong background on reliability and maintainability modeling, prediction, and design improvement. Familiar with and have knowledge of reliability and maintainability digital modeling tools. Systems Engineering experience with weapon systems. Experience preparing technical reports and briefs. Nuclear weapon experience highly desired. Five or more years of relevant technical experience is desired."}, "skills": ["Reliability Engineering", "Maintainability Engineering", "Systems Engineering", "Modeling and Simulation", "Statistical Data Analysis", "Regression Modeling", "Weibull Analysis", "Hazard Analysis", "Reliability Growth Assessment", "Technical Reporting", "Nuclear Weapons", "Defense Acquisition Workforce Improvement Act (DAWIA)"], "postedDate": "5 days ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k), Pension plan, Paid maternity leave, Paid paternity leave, Tuition assistance, Student loan assistance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999363920"}