{"jobTitle": "Customer Experience Consultant", "company": {"name": "Zillow", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.80 - 30.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Real Estate", "description": "About The Team\n\nAt ShowingTime, we are the industry leader in scheduling and managing real estate showings across the United States and Canada. With over 1 million real estate agents relying on our products and services, we play a vital role in maximizing their understanding and usage of our platforms. As a Customer Experience Consultant, you will be an integral part of our Customer Support team, providing exceptional service to our customers and helping them achieve success in their real estate endeavors.\n\nAbout The Role\n\n<ul><li> Learn and master the features and functionalities of ShowingTime products and services. </li><li> Utilize various support tools simultaneously to effectively assist customers. </li><li> Resolve customer inquiries and issues through phone, email, and chat channels. </li><li> Follow a standardized process while customizing the troubleshooting experience for individual needs. </li><li> Prioritize and complete pending callbacks to ensure timely resolution. </li><li> Create and document cases accurately and efficiently. </li><li> Meet performance and productivity metrics to deliver high-quality customer support. </li><li> Maintain a high rating for calls graded on quality. </li><li> Collaborate with internal and external customer support teams. </li><li> Attend continued training sessions to stay updated on product and service enhancements. </li><li> Promote additional ShowingTime products and services to customers. <br/><br/></li></ul>This role has been categorized as a Remote position. “Remote” employees do not have a permanent corporate office workplace and, instead, work from a physical location of their choice, which must be identified to the Company. U.S. employees may live in any of the 50 United States, with limited exceptions.\n\nIn California, Colorado, Connecticut, Hawaii, Nevada, New York, Washington state, and Washington DC the standard base pay range for this role is $18.80 - $30.00 Hourly. This base pay range is specific to California, Colorado, Connecticut, Hawaii, Nevada, New York, Washington state, and Washington DC and may not be applicable to other locations.\n\nIn addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location. Actual amounts will vary depending on experience, performance and location.\n\nWho you are\n\n<ul><li> Minimum of 1 year of experience in customer service or equivalent role. </li><li> Strong track record in resolving customer escalations. </li><li> Ability to maintain cooperative relationships with all types of personalities. </li><li> Excellent multitasking and attention to detail. </li><li> Exceptional patience and active listening skills. </li><li> Ability to thrive in a fast-paced, high-pressure environment. </li><li> Capable of working independently or within a team. </li><li> Clear and articulate communication skills, both verbal and written. </li><li> Excellent punctuality and attendance record. </li><li> Comfortable sitting for long periods of time. </li><li> Basic computer skills, including typing and data entry. <br/><br/></li></ul>Get to know us\n\nZillow is reimagining real estate to make home a reality for more and more people.\n\nAs the most-visited real estate website in the United States, Zillow® and its affiliates help movers find and win their home through digital solutions, first class partners, and easier buying, selling, financing and renting experiences. Millions of people visit Zillow Group sites every month to start their home search, and now they can rely on Zillow to help make it easier to move. The work we do helps people get home and no matter what job you're in, you will play a critical role in making home a reality for more and more people.\n\nOur efforts to streamline the real estate transaction are supported by a deep-rooted culture of innovation, our passion to redefine the employee experience, a fundamental commitment to Equity and Belonging, and world-class benefits. These benefits include comprehensive medical, dental, vision, life, and disability coverages as well as parental leave, family benefits, retirement contributions, and paid time off. We’re also setting the standard for work experiences of the future, where our employees are supported in doing their best work and living a flexible, well-balanced life. But don’t just take our word for it. Read recent reviews on Glassdoor and recent recognition from multiple organizations, including: the 100 Best Companies to Work For, Glassdoor Employees’ Choice Award, Bloomberg Gender-Equality Index, Human Rights Campaign (HRC) Corporate Equity Index, and TIME 100 Most Influential Companies list.\n\n<em>Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact your recruiter directly.<br/><br/></em><em>Applicants who receive job offers from Zillow Group will be asked to sign a Proprietary Rights Agreement which includes confidentiality, intellectual property assignment, customer and employee non-solicitation, and non-competition provisions. If you are contacted for a role at Zillow Group and wish to review a copy of the Proprietary Rights Agreement prior to receiving an offer, you may request a copy from your Recruiter.</em>", "responsibilities": "<ul><li> Learn and master the features and functionalities of ShowingTime products and services. </li><li> Utilize various support tools simultaneously to effectively assist customers. </li><li> Resolve customer inquiries and issues through phone, email, and chat channels. </li><li> Follow a standardized process while customizing the troubleshooting experience for individual needs. </li><li> Prioritize and complete pending callbacks to ensure timely resolution. </li><li> Create and document cases accurately and efficiently. </li><li> Meet performance and productivity metrics to deliver high-quality customer support. </li><li> Maintain a high rating for calls graded on quality. </li><li> Collaborate with internal and external customer support teams. </li><li> Attend continued training sessions to stay updated on product and service enhancements. </li><li> Promote additional ShowingTime products and services to customers. <br/><br/></li></ul>", "qualifications": {"required": "Minimum of 1 year of experience in customer service or equivalent role. \nStrong track record in resolving customer escalations. \nAbility to maintain cooperative relationships with all types of personalities. \nExcellent multitasking and attention to detail. \nExceptional patience and active listening skills. \nAbility to thrive in a fast-paced, high-pressure environment. \nCapable of working independently or within a team. \nClear and articulate communication skills, both verbal and written. \nExcellent punctuality and attendance record. \nComfortable sitting for long periods of time. \nBasic computer skills, including typing and data entry. <br/><br/>"}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "comprehensive medical, dental, vision, life, and disability coverages as well as parental leave, family benefits, retirement contributions, and paid time off.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999976674"}