{"jobTitle": "Full Time Customer Service Representative", "company": {"name": "OMI", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Maritime", "description": "We are a dynamic marketing and sales firm servicing the New Hyde Park area. We specialize in customer acquisition and retention for multi-billion dollar companies in the telecommunication, fiber optic, and entertainment industries.<br/><br/>Our company is going at an expedited rate and we are looking to bring on a Customer Service Representative role that will be a long-term position. The Customer Service Representative will involve sales and customer service skills and working with our customers directly daily to add value to our clients. We handle all the business-to-consumer sales and retention efforts for clients in some of the fastest-growing industries in the country.<br/><br/><strong>Customer Service Representative Responsibilities<br/><br/></strong><ul><li>Help Support and Provide quality assurance with current customers</li><li>Setting and keeping sales appointments</li><li>Assist the sales managers</li><li>Create and hit weekly and monthly goals</li><li>Training of new sales representatives<br/><br/></li></ul>A strong motivation for advancing in a career is key because our managers are always hired from within the team, we provide a management training program and career advice to all of our customer service and sales representatives. Energetic, hard-working, people who are willing to learn and accept constructive criticism will excel in this position.<br/><br/><strong>What We’re Looking For<br/><br/></strong><ul><li>1-2 years in a customer facing role </li><li>Motivated, energetic, hard-working candidates who are willing to learn and accept constructive criticism to excel in this position.</li><li>Exceptional customer service and people skills</li><li>Sports minded or a competitive nature</li><li>Have acquired the ability to multitask and prioritize</li><li>Worked in a fast-paced based environment<br/><br/></li></ul><strong><em>This is an in-office position that is set to start immediately, so we are looking for an individual that is local to New Hyde Park and able to start in 1-2 weeks.<br/><br/></em></strong><strong>Hours Of Operation: 10:00am - 6:00pm<br/><br/></strong>Powered by JazzHR<br/><br/>", "postedDate": "6 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3999034031"}