{"jobTitle": "Production Planner", "company": {"name": "CELSIUS Holdings, Inc.", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Analyst and Strategy/Planning", "industry": "Food and Beverage Manufacturing and Food and Beverage Retail", "description": "Celsius Holdings, Inc. is a global consumer packaged goods company with a proprietary, clinically proven formula for its master brand CELSIUS®, based in Boca Raton, FL. A lifestyle energy drink born in fitness and a pioneer in the rapidly growing energy category. Celsius offers proprietary, functional, essential energy formulas clinically proven to offer significant health benefits to its users. At CELSIUS we pride ourselves in providing our employees a culture and atmosphere of inclusiveness that challenges individuals to be thought leaders, innovators, and game changers as every employee is an owner of the CELSIUS Brand upon joining the organization.\n\nIf you are looking for an exciting opportunity to join a fast-growing team in a role that provides professional and personal growth, we encourage you to apply to our *Production Planner* opening.\n\n*We promptly review all applications. Highly qualified candidates will be contacted for interviews.*\n\n*This is an in office, full time position at the CELSIUS HQ in Boca Raton, Florida.*\n\n**DESCRIPTION**\n\nThe Production Planner is the primary point of contact for Celsius manufacturing facilities. This individual will ensure that the production process goes smoothly by ensuring all the required materials for the production run are placed in accordance with the lead time to meet production dates.\n\n**RESPONSIBILITIES**\n\n* Determine the raw material needs for multiple beverages and/or powder production manufacturing facilities based on finished good inventory target.\n* Create purchase orders within lead time to support production requirements.\n* Follow up with each vendor on the delivery of the materials required for each production.\n* Manage inventory and safety stock for raw and packaging materials for each manufacturing facility.\n* Build and track the production schedules for each facility daily.\n* Promptly address and resolve production issues to avoid or minimize delays or extra costs.\n* Validate the production planned is executed promptly during the requested period.\n* Reconcile production executed by SKU and enter final production numbers in Celsius system (Great Plains) in a timely manner.\n* Analyze facilities performance for each period (production reliability).\n* Manage with each facility and Celsius Quality Team the setup of new items and SKUs properly in the system.\n* Coordinate the qualification of new manufacturers and vendors when needed in collaboration with Celsius Quality Team.\n\n**QUALIFICATIONS**\n\n* Degree in business, supply chain, or logistics, or more than 2 years of experience in this field.\n* Advanced math, analytical, and problem-solving skills.\n* Intermediate knowledge of manufacturing processes, inventory management, and planning.\n* Intermediate to Advanced skills in Excel – able to create Pivot Tables, perform XLOOKUPS (or VLOOKUPS), dynamic tables, conditionals (IF, SUMIFS, COUNTIFS, AVERAGEIFS), and data management (cleaning, maintenance, etc.).\n* Proficiency in the MS Office Suite applications (Outlook, Word, and SharePoint).\n* Excellent organizational, communication (written and verbal), and time management skills.\n* Experience with ERP systems is preferred.\n\n*The above information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.*\n\n*Celsius Holdings, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity, or gender expression. We believe strongly in fostering a safe, fair, and respectful work environment.*", "responsibilities": "Determine the raw material needs for multiple beverages and/or powder production manufacturing facilities based on finished good inventory target. Create purchase orders within lead time to support production requirements. Follow up with each vendor on the delivery of the materials required for each production. Manage inventory and safety stock for raw and packaging materials for each manufacturing facility. Build and track the production schedules for each facility daily. Promptly address and resolve production issues to avoid or minimize delays or extra costs. Validate the production planned is executed promptly during the requested period. Reconcile production executed by SKU and enter final production numbers in Celsius system (Great Plains) in a timely manner. Analyze facilities performance for each period (production reliability). Manage with each facility and Celsius Quality Team the setup of new items and SKUs properly in the system. Coordinate the qualification of new manufacturers and vendors when needed in collaboration with Celsius Quality Team.", "qualifications": {"required": "Degree in business, supply chain, or logistics, or more than 2 years of experience in this field. Advanced math, analytical, and problem-solving skills. Intermediate knowledge of manufacturing processes, inventory management, and planning. Intermediate to Advanced skills in Excel – able to create Pivot Tables, perform XLOOKUPS (or VLOOKUPS), dynamic tables, conditionals (IF, SUMIFS, COUNTIFS, AVERAGEIFS), and data management (cleaning, maintenance, etc.). Proficiency in the MS Office Suite applications (Outlook, Word, and SharePoint). Excellent organizational, communication (written and verbal), and time management skills.", "preferred": "Experience with ERP systems is preferred."}, "skills": ["Supply Chain", "Inventory Management", "Manufacturing", "Excel", "MS Office", "ERP"], "postedDate": "1 week ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999792631"}