{"jobTitle": "Database Design Engineer with Security Clearance", "company": {"name": "ClearanceJobs", "location": "Eglin Air Force Base, FL"}, "location": "Eglin Air Force Base, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75510 - 128340", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Defense and Space Manufacturing", "description": "Job Description Specific duties include but are not limited to:<br/><br/><ul><li>Design and create database architectures that align with our business requirements and data needs</li><li>Responsible for working with Database Administrator to support day to day database maintenance</li><li>Develop and implement updates and maintain operation and physical design of the databases</li><li>Build and maintain various reports and queries on technical requirements</li><li>Support database configuration management and integration functions to assist with the implementation of quality control processes and procedures, including related process/procedure documentation</li><li>Responsible for working with cross-functional teams to gather data and support automation initiatives and import utilities</li><li>Create accounts for authorized users and assist with daily activity and updates</li><li>Coordinate with staff to develop solutions to complex problems and ensure solutions are consistent with program specifications</li><li>Review database design and integration of systems</li><li>Provide backup recovery and make recommendations for enhancements and/or improvements</li><li>Maintain security and integrity controls for the database and supporting documents Required Education, Experience, &amp; Skills - Bachelor's degree in Computer Science, Information Technology, or a related field</li><li> Expertise in database design tools and technologies, such as SQL Server, Oracle, MySQL, or similar</li><li> Experience in designing relational databases and building flexible normalized databases</li><li> Comprehensive knowledge in design and development of user friendly graphically based interfaces</li><li> Require the regular use of ingenuity and creativity to develop technical solutions to complex problems - Capacity and desire to continuously learn new tools, technologies and methodologies is necessary</li><li> Good organizational skills and be detail oriented while staying solution focused</li><li> Ability to perform data quality audits/verification</li><li> Ability to perform Configuration Management of data</li><li> Hands-on use of core Microsoft Office applications, primarily MS Access</li><li> Expertise with COTS database software (MS Access)</li><li> Expertise with VBA scripting/programming</li><li> Well-developed communication, critical thinking, prioritization and organizational skills are required</li><li> Systems &amp; software engineering and/or database development experience</li><li> Ability to create Access SQL queries and reports Preferred Education, Experience, &amp; Skills - Expertise with Jira and Confluence</li><li> Familiarity with the Joint Strike Fighter (JSF) program</li><li> Knowledge of training delivery and Instructional System Design (ISD)</li><li> Knowledge of International Traffic in Arms Regulations (ITAR)</li><li> Familiarity with Java Pay Information<br/><br/></li></ul>Full-Time Salary Range: $75510 - $128340 Please note: This range is based on our market pay structures. However, individual salaries are determined by a variety of factors including, but not limited to: business considerations, local market conditions, and internal equity, as well as candidate qualifications, such as skills, education, and experience. Employee Benefits: At BAE Systems, we support our employees in all aspects of their life, including their health and financial well-being. Regular employees scheduled to work 20+ hours per week are offered: health, dental, and vision insurance; health savings accounts; a 401(k) savings plan; disability coverage; and life and accident insurance. We also have an employee assistance program, a legal plan, and other perks including discounts on things like home, auto, and pet insurance. Our leave programs include paid time off, paid holidays, as well as other types of leave, including paid parental, military, bereavement, and any applicable federal and state sick leave. Employees may participate in the company recognition program to receive monetary or non-monetary recognition awards. Other incentives may be available based on position level and/or job specifics. About BAE Systems Intelligence &amp; Security BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it's what we do at BAE Systems. Working here means using your passion and ingenuity where it counts - defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team-making a big impact on a global scale. At BAE Systems, you'll find a rewarding career that truly makes a difference. Intelligence &amp; Security (I&amp;S), based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we do-from intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. Our Commitment to Diversity, Equity, and Inclusion:<br/><br/>At BAE Systems, we work hard every day to nurture an inclusive culture where employees are valued and feel like they belong. We are conscious of the need for all employees to see themselves reflected at every level of the company and know that in order to unlock the full potential of our workforce, everyone must feel confident being their best, most sincere self and be equipped to thrive. We provide impactful professional development experiences to our employees and invest in social impact partnerships to uplift communities and drive purposeful change. Here you will find significant opportunities to do meaningful work in an environment intentionally designed to be one where you will learn, grow and belong.", "responsibilities": "Specific duties include but are not limited to:<br/><br/><ul><li>Design and create database architectures that align with our business requirements and data needs</li><li>Responsible for working with Database Administrator to support day to day database maintenance</li><li>Develop and implement updates and maintain operation and physical design of the databases</li><li>Build and maintain various reports and queries on technical requirements</li><li>Support database configuration management and integration functions to assist with the implementation of quality control processes and procedures, including related process/procedure documentation</li><li>Responsible for working with cross-functional teams to gather data and support automation initiatives and import utilities</li><li>Create accounts for authorized users and assist with daily activity and updates</li><li>Coordinate with staff to develop solutions to complex problems and ensure solutions are consistent with program specifications</li><li>Review database design and integration of systems</li><li>Provide backup recovery and make recommendations for enhancements and/or improvements</li><li>Maintain security and integrity controls for the database and supporting documents</li></ul>", "qualifications": {"required": "Bachelor's degree in Computer Science, Information Technology, or a related field\nExpertise in database design tools and technologies, such as SQL Server, Oracle, MySQL, or similar\nExperience in designing relational databases and building flexible normalized databases\nComprehensive knowledge in design and development of user friendly graphically based interfaces\nRequire the regular use of ingenuity and creativity to develop technical solutions to complex problems - Capacity and desire to continuously learn new tools, technologies and methodologies is necessary\nGood organizational skills and be detail oriented while staying solution focused\nAbility to perform data quality audits/verification\nAbility to perform Configuration Management of data\nHands-on use of core Microsoft Office applications, primarily MS Access\nExpertise with COTS database software (MS Access)\nExpertise with VBA scripting/programming\nWell-developed communication, critical thinking, prioritization and organizational skills are required\nSystems &amp; software engineering and/or database development experience\nAbility to create Access SQL queries and reports", "preferred": "Expertise with Jira and Confluence\nFamiliarity with the Joint Strike Fighter (JSF) program\nKnowledge of training delivery and Instructional System Design (ISD)\nKnowledge of International Traffic in Arms Regulations (ITAR)\nFamiliarity with Java"}, "skills": ["SQL Server", "Oracle", "MySQL", "MS Access", "VBA", "Jira", "Confluence", "Joint Strike Fighter", "Instructional System Design", "International Traffic in Arms Regulations", "Java"], "postedDate": "6 days ago", "benefits": "At BAE Systems, we support our employees in all aspects of their life, including their health and financial well-being. Regular employees scheduled to work 20+ hours per week are offered: health, dental, and vision insurance; health savings accounts; a 401(k) savings plan; disability coverage; and life and accident insurance. We also have an employee assistance program, a legal plan, and other perks including discounts on things like home, auto, and pet insurance. Our leave programs include paid time off, paid holidays, as well as other types of leave, including paid parental, military, bereavement, and any applicable federal and state sick leave. Employees may participate in the company recognition program to receive monetary or non-monetary recognition awards. Other incentives may be available based on position level and/or job specifics.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3999032045"}