{"jobTitle": "Director, Partner Alliances", "company": {"name": "Cloud for Good", "industry": "IT Services and IT Consulting", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales, Marketing, and Strategy/Planning", "industry": "Higher Education", "description": "Cloud for Good is the leading Salesforce implementation partner in the impact ecosystem. Our sophisticated approach to the partner ecosystem has led to a Summit level Salesforce partnership with multiple Partner of the Year and Partner Innovation awards. We are looking for a Director, Partner Alliances to lead our growing Alliances team which includes nonprofit, education, public sector and ISVs.  \n\nIn this role you will be working within key partnerships to drive new revenue, provide enablement, and evangelize Cloud for Good’s value and capabilities, both internally and externally. This role will lead the Alliances team and also work closely with our Marketing, Sales, and Services leaders.  \n\n**Location: **Virtual: Home-based office in the US or Canada  \n\n**Travel: **20-25%  \n\n**Leadership and Team Management**  \n<ul><li>Lead the Alliances team, including staff engagement and retention </li><li>Conduct hiring, onboarding, coaching, performance management and mentoring for Alliances team members </li><li>Serve as a member of the leadership team </li></ul>\n**Strategic Planning and Direction**  \n<ul><li>Set vision and direction for Partner Alliances work </li><li>Coordinate alliances go-to-market conversations and plans </li><li>Work across the Cloud for Good leadership team to ensure the growth of the partnership with Salesforce </li></ul>\n**Relationship Management and Networking**  \n<ul><li>Build and maintain relationships with multiple teams within the Salesforce ecosystem </li><li>Maintain and grow the partner network to support Cloud for Good industry alignment </li><li>Collaborate with Sales and Marketing teams </li><li>Deliver enablement sessions to partner teams on Cloud for Good projects and capabilities </li><li>Develop and maintain competitive documentation about the SI ecosystem </li></ul>\n**Revenue Growth and Performance**  \n<ul><li>Drive revenue by utilizing relationships to find new joint opportunities </li><li>Drive revenue by designing and executing targeted campaigns </li><li>Grow joint and sourced ACV with Salesforce </li><li>Drive key performance indicators for our Salesforce partnership, including our partner value score </li></ul>\n\n**Qualifications**  *  \n<ul><li>Strong understanding of the Salesforce ecosystem or a similar large-scale ecosystem. </li><li>5+ years of experience in partner, alliance, or channel management roles. </li><li>3-5 years of leadership experience in a relevant field. </li><li>Preferred experience in Cloud for Good industries, including public sector (state, local, and/or federal DoD), higher education, or nonprofit sectors. </li><li>Experience in building new partnerships to support growth into new markets. </li><li>Ability to work effectively both as part of a team and independently, with excellent time management and organizational skills. </li><li>Exceptional communication skills, both verbal and written, with comfort in representing Cloud for Good to Salesforce, including senior leadership. </li><li>Proven ability to execute targeted business development campaigns across joint sales teams, including both Cloud for Good and Salesforce resources, and to drive new pipeline through joint partner campaigns. </li><li>Capability to collaborate across various departments, including Sales, Marketing, and Services, and to mobilize resources that do not directly report to you. </li><li>Strong time management and organizational skills, with the ability to handle multiple competing deadlines and objectives in a fast-paced, dynamic environment. </li></ul>\n\n**Disclaimers**  \n\nDiversity and Equal Opportunity Commitment  \n<ul><li>At Cloud for Good, we adhere to the principles of Equal Employment Opportunity (EEO) and extend these principles to all our employees and prospective candidates. We do not discriminate based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, ancestry, age, sex, disability, genetic information, marital status, pregnancy status, amnesty, veteran status, medical condition, or any other legally protected characteristics as defined by federal, state, and local laws. Our commitment to non-discrimination applies across every location in which our company operates, and it encompasses all aspects of employment. </li><li>Cloud for Good strongly encourages individuals from diverse backgrounds and identities to submit their applications. Our unwavering commitment to fostering diversity not only enhances our workplace but also enhances the outcomes we deliver to our clients. See our full diversity statement here. </li><li>We value inclusivity and want applicants who may require special assistance or accommodation during the interview process to know we’re here to assist you. </li></ul>\nUse of AI in Interviewing  \n<ul><li>At Cloud for Good, we believe in conducting interviews that are fair, equitable, and designed to evaluate candidates based on their qualifications and experience, with the organization. To ensure that all candidates are given an equal opportunity to demonstrate their abilities, we prohibit the use of AI or any other type of machine learning tools during the interview process. </li><li>Candidates are expected to participate in the interview process remotely using video conferencing. Any attempt to use AI or similar technology to respond to interview questions, analyze or provide feedback on the interview process, or perform any other interview-related tasks is strictly prohibited and will be considered a violation of our policy and may result in disqualification from the interview process. </li><li>We understand that some candidates may have disabilities or other circumstances that require accommodation during the interview process. In such cases, we will make reasonable accommodations to enable candidates to participate in the interview process to the best of their ability. However, we do not permit the use of AI or similar technology as a substitute for direct participation in the interview.</li></ul>", "postedDate": "1 week ago", "benefits": "Medical insurance, Dental insurance, Vision insurance, 401(k), Paid maternity leave, Paid paternity leave, Disability insurance", "remoteWork": "Yes", "skills": ["Salesforce", "Partner Management", "Channel Management", "Business Development", "Strategic Planning", "Relationship Management", "Team Management", "Leadership", "Sales", "Marketing", "Services", "Communication", "Time Management", "Organizational Skills", "Nonprofit", "Education", "Public Sector", "Federal DoD", "Higher Education", "Salesforce Ecosystem", "Joint Sales", "Partner Campaigns", "Pipeline Development", "Diversity", "Equal Opportunity", "AI", "Machine Learning", "Video Conferencing", "Disability Accommodation"], "url": "https://www.linkedin.com/jobs/view/3999927465"}