{"jobTitle": "Customer Service Manager", "company": {"name": "Macy's", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$64,200-$107,280", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Retail", "description": "Manager, Sales and Customer Service-Beauty Special Events\nNew York, NY, United States\nFull time Schedule\n<br/>\n$64,200-\n$107,280\nAnnually*\n<br/>\n<br/>\n<br/>\n* based on job, location, and schedule\n<br/>\nJob Description\n<strong><u>Bring Your Amazing Self to Work</u></strong>\nAt Macy's, Inc. we're on a mission to create a brighter future with bold representation for all. This is our Mission Every One. We know that each person here is unique. So we respect and invest in each individual to create growth, pride, and satisfaction. If we are able to bring our whole selves to work, it translates into a more abundant and wider array of ideas and energy for all to benefit from. Our success will be built on amazing colleagues, working together.\n\n<strong><u>Job Overview</u></strong>\nThe Manager, Sales &amp; Customer Service ensures that the very best of Macy's is always on display. They see the store through the customers' eyes, leading initiatives to increase shopper loyalty while upholding Macy’s standards for customer service. Their passion for the perfect customer experience drives the service team to maintain a welcoming and ready sales floor. Macy’s fun and inclusive environment is ideal for someone who enjoys connecting with people and sharing knowledge and enthusiasm with the team through training and coaching.\n\n<strong><u>What You Will Do</u></strong>\n<ul><li>Build a productive, enthusiastic team eager to engage with customers and create memorable shopping experiences.</li><li>Exceed sales goals by leading Macy's initiatives through coaching and recognition, optimizing productivity and efficiency.</li><li>Review and utilize Sales and Star Rewards data to recognize colleagues and develop strategies to improve results.</li><li>Manage selling support, including the stockroom, signing, equipment, and merchandising.</li><li>Support other operational areas such as OMNI, Style, and Asset Protection.</li><li>Conduct ongoing talent analysis of colleagues and establish career progression plans for key positions to retain top talent and reduce turnover.</li><li>Actively fill open positions, prioritizing internal colleagues in Customer Experience, Commission, and Specialized Selling areas.</li><li>Interview, hire, train, coach, develop, coordinate, evaluate, and discipline direct and indirect reports; manage the team to meet or exceed performance and behavioral expectations; address complaints and resolve problems with colleagues.</li><li>Work a flexible retail schedule, including days, evenings, holidays, and weekends.</li></ul>\n\n<strong><u>Skills You Will Need</u></strong>\n<strong>Leadership and Team Building</strong>: Ability to build, lead, and motivate a productive, enthusiastic team.\n<strong>Customer Service Excellence</strong>: Passion for delivering exceptional customer experiences and maintaining a welcoming sales floor.\n<strong>Sales and Performance Management</strong>: Proven ability to exceed sales goals through coaching, recognition, and optimizing productivity and efficiency.\n<strong>Analytical Skills</strong>: Ability to review and utilize sales and rewards data to recognize colleagues and develop improvement strategies.\n<strong>Operational Management</strong>: Experience managing selling support activities, including stockroom, signing, equipment, and merchandising.\n<strong>Cross-functional Support</strong>: Capability to support other operational areas such as OMNI, Style, and Asset Protection.\n<strong>Talent Development</strong>: Proficient in conducting talent analysis, establishing career progression plans, and retaining top talent.\n<strong>Conflict Resolution</strong>: Effective in addressing complaints and resolving problems with colleagues.\n<strong>Communication Skills</strong>: Consistently clear and effective communicator, writer, and presenter.\n<strong>Technical Proficiency</strong>: Strong skills in Microsoft suite, computers, and handheld devices.\n\n<strong><u>Who You Are</u></strong>\n<ul><li>Dedicated to fulfilling ideals of diversity, inclusion, and respect that Macy’s aspires to achieve every day in every way.</li><li>Candidates with a bachelor’s degree or equivalent work experience in a related field are encouraged to apply. </li><li>Candidates with a High School diploma or equivalent are encouraged to apply. 3-5 years of management experience in retail. </li><li>This position requires heavy lifting, constant moving, standing, and reaching with arms and hands. Involves standing for at least two consecutive hours, lifting at least 30 lbs. stooping, kneeling, crouching, and climbing ladders. May involve reaching above eye level. Requires close vision, color vision, depth perception, and focus adjustment.</li><li>Able to work a flexible schedule based on department and company needs.</li></ul>\n\n<strong><u>What We Can Offer You</u></strong>\n<ul><li>An inclusive, challenging, and refreshingly fun work environment</li><li>Competitive pay and benefits rooted in principles of equity</li><li>Performance incentives and annual merit review</li><li>Merchandise discounts</li><li>Health and Wellness Benefits across medical, dental, vision, and additional insurance</li><li>Retirement Savings Plan with 401k match opportunity</li><li>Employee Assistance Program (mental health counseling and legal/financial advice)</li><li>Resources for continuous learning, career growth, and leadership development</li><li>8 paid holidays</li><li>Paid Time Off (first year prorated depending on start date)</li><li>Tuition reimbursement program</li><li>Guild education benefit funds 100% of tuition, books, and fees in designated programs</li><li>Colleague Resource Groups (CRGs) and give-back/volunteer opportunities</li><li>Empowerment and autonomy to perform impactful work with tangible results</li></ul>\n\n<strong><u>About Macy’s</u></strong>\nNow is an exciting time for a Macy's career as we continue to focus on creating exciting and memorable experiences for every Macy's customer, whether their journey starts online or in the store. Our opportunities in Sales, Merchandise, Operations, Customer Service, Warehouse, Marketing, and other areas let you express your creativity and commitment to excellence, grow your career and make a difference to your Macy's colleagues and customers.\n\nBring your creativity, energy, and ideas to the Macy's team – Apply Today!", "responsibilities": "<ul><li>Build a productive, enthusiastic team eager to engage with customers and create memorable shopping experiences.</li><li>Exceed sales goals by leading Macy's initiatives through coaching and recognition, optimizing productivity and efficiency.</li><li>Review and utilize Sales and Star Rewards data to recognize colleagues and develop strategies to improve results.</li><li>Manage selling support, including the stockroom, signing, equipment, and merchandising.</li><li>Support other operational areas such as OMNI, Style, and Asset Protection.</li><li>Conduct ongoing talent analysis of colleagues and establish career progression plans for key positions to retain top talent and reduce turnover.</li><li>Actively fill open positions, prioritizing internal colleagues in Customer Experience, Commission, and Specialized Selling areas.</li><li>Interview, hire, train, coach, develop, coordinate, evaluate, and discipline direct and indirect reports; manage the team to meet or exceed performance and behavioral expectations; address complaints and resolve problems with colleagues.</li><li>Work a flexible retail schedule, including days, evenings, holidays, and weekends.</li></ul>", "qualifications": {"required": "Candidates with a High School diploma or equivalent are encouraged to apply. 3-5 years of management experience in retail. This position requires heavy lifting, constant moving, standing, and reaching with arms and hands. Involves standing for at least two consecutive hours, lifting at least 30 lbs. stooping, kneeling, crouching, and climbing ladders. May involve reaching above eye level. Requires close vision, color vision, depth perception, and focus adjustment. Able to work a flexible schedule based on department and company needs.", "preferred": "Candidates with a bachelor’s degree or equivalent work experience in a related field are encouraged to apply."}, "skills": ["Leadership", "Team Building", "Customer Service", "Sales", "Performance Management", "Analytical Skills", "Operational Management", "Cross-functional Support", "Talent Development", "Conflict Resolution", "Communication", "Technical Proficiency", "Microsoft Suite", "Computers", "Handheld Devices"], "postedDate": "1 week ago", "benefits": "An inclusive, challenging, and refreshingly fun work environment\nCompetitive pay and benefits rooted in principles of equity\nPerformance incentives and annual merit review\nMerchandise discounts\nHealth and Wellness Benefits across medical, dental, vision, and additional insurance\nRetirement Savings Plan with 401k match opportunity\nEmployee Assistance Program (mental health counseling and legal/financial advice)\nResources for continuous learning, career growth, and leadership development\n8 paid holidays\nPaid Time Off (first year prorated depending on start date)\nTuition reimbursement program\nGuild education benefit funds 100% of tuition, books, and fees in designated programs\nColleague Resource Groups (CRGs) and give-back/volunteer opportunities\nEmpowerment and autonomy to perform impactful work with tangible results", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999789591"}