{"jobTitle": "Senior Enterprise Account Executive (West)", "company": {"name": "Salesloft", "location": "Washington County, OR"}, "location": "Washington County, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$96,000.00 - $165,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "Senior Enterprise Account Executive<br/><br/><strong>Territory: Oregon | Washington | Idaho | NorCal - Candidates must live within geography to be considered.<br/><br/></strong><strong>THE OPPORTUNITY:<br/><br/></strong>We are seeking a results-oriented, motivated, and strategic enterprise ‘hunter’ who is laser-focused on generating net-new business within North America. Specifically, you will play a pivotal role in solidifying our position as an anchor technology company within the U.S. by winning high-visibility deals and crushing your annual quota.<br/><br/>On a day-to-day basis, you will be responsible for educating the market about the power of SalesLoft. You must be able to forecast sales activity and revenue achievement accurately while creating satisfied and referenceable customers. To thrive in this role, you will keep up with industry trends, competitive landscape, and customer needs. As a top-performer, you will have immense growth potential and unlimited opportunity to make an impact. And did we mention, there is no cap on commission?<br/><br/>If you’re passionate about sales technology, providing a world-class customer experience, and thrive in a fast-paced, hyper-growth startup environment, then becoming <strong>a Senior Enterprise Account Executive </strong>is the career path for you!<br/><br/><strong>THE TEAM:<br/><br/></strong>Our SalesLoft enterprise sales team is comprised of seasoned and up-and-coming sales professionals who are all aligned on one mission: to redefine the Sales Engagement space and activate the authentic seller in all of us.<br/><br/>The enterprise sales team consists of results-oriented SaaS sales professionals with a strong hunter mentality and a desire to win. In addition, they share a few common traits: they are self-motivated, ambitious, and passionate about evangelizing the future of sales innovation. They are the epitome of our core values - Customers First. Team Over Self. Focus on Results. Bias Towards Action. Glass Half Full.<br/><br/><strong>THE SKILL SET:<br/><br/></strong><ul><li>Bachelor's degree or equivalent experience preferred</li><li>7+ years of proven hunting &amp; closing experience in an enterprise software environment</li><li>Experience establishing strategic C-level relationships within major software accounts</li><li>Ability to run a full sales lifecycle, start to finish, within the enterprise segment</li><li>Experience executing detailed product presentations and web demonstrations of our software capabilities to C-level executives, VPs, directors, and sales managers</li><li>Adept at identifying and utilizing internal resources (Sales Development, Sales Engineers, etc.) to build SalesLoft brand awareness, assist in sales cycles, and close deals</li><li>Superb listening skills; you must understand objections and defeat them by turning skeptics into ecstatic new customers</li><li>High level of empathy - it’s important for our sales executive’s to be a good person to peers and prospects</li><li>Experience hunting net-new customers in greenfield territory </li><li>Consistent history of quota attainment &amp; overachievement <br/><br/></li></ul>WITHIN ONE MONTH, YOU’LL:<br/><br/><ul><li>Attend SalesLoft’s New Hire Orientation, where you will learn our SalesLoft story and understand what makes our “Lofters” unique</li><li>Join our 3-week Sales Bootcamp, where you will learn our software and all the skills necessary to set you up for success, allowing you to make an impact in the market quickly</li><li>Begin 1:1’s with your manager, understand your 30-60-90 plan, meet &amp; shadow current members of the SalesLoft team, and delve into your territory</li><li>Set your OKRs (Objectives and Key Results) with your manager and develop an action plan to achieve them</li><li>Meet key partners in Account Management, Finance, Marketing, Executives etc. - they will be key relationships for you throughout your deal cycle</li><li>Become demo certified<br/><br/></li></ul>WITHIN THREE MONTHS, YOU’LL:<br/><br/><ul><li>Be a product expert and feel comfortable demoing and closing your first deal</li><li>Hit the phones confidently with prospects from self-sourced and SDR generated efforts</li><li>Execute detailed product presentations and web demonstrations of our software capabilities to C-level executives, directors, and sales managers</li><li>Consistently achieve your activity goals<br/><br/></li></ul>WITHIN SIX MONTHS, YOU’LL:<br/><br/><ul><li>Consistently meet or exceed your quota</li><li>Complete your Lessonly training to ensure you are up-to-date on negotiation best practices, new releases and more</li><li>Continue to focus on your OKRs<br/><br/></li></ul>WITHIN TWELVE MONTHS, YOU’LL:<br/><br/><ul><li>Be considered a top-performing SE on the team by consistently exceeding your goals</li><li>Set an example for new SEs, and assist in training, onboarding and motivating new Lofters<br/><br/></li></ul>IS THIS ROLE NOT AN EXACT FIT? Keep an eye on our Careers Page for other positions!<br/><br/>WHY SHOULD YOU WORK AT SALESLOFT:<br/><br/><ul><li>You will become part of an amazing culture with a supportive CEO and smart teammates who actually care</li><li>You will work with an amazing team you can learn from and teach</li><li>You will experience joining a high-growth/high-traction organization</li><li>You will hear “Yes, let’s do that!” and then have the opportunity to successfully execute on your ideas</li><li>We have a vibrant, open office that utilizes modern technology</li><li>You will grow more here than you would anywhere else, that is a promise<br/><br/></li></ul>It is Salesloft’s intent to pay all Lofters competitive wages and salaries that are motivational, fair and equitable. The goal of Salesloft’s compensation program is to be transparent, attract potential employees, meet the needs of all current employees and encourage employees to stay with our organization.<br/><br/>Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location.<br/><br/>The total compensation package for this position may also include performance bonus, stock, benefits and/or other applicable incentive compensation plans.<br/><br/>Salesloft embraces diversity and invites applications from people of all walks of life. We are proud to be an Equal Opportunity Employer and provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex, age, national origin, disability, veteran status, pregnancy, sexual orientation, or any other characteristic protected by law.<br/><br/>Base Pay Range<br/><br/>$96,000—$165,000 USD<br/><br/>", "responsibilities": "We are seeking a results-oriented, motivated, and strategic enterprise ‘hunter’ who is laser-focused on generating net-new business within North America. Specifically, you will play a pivotal role in solidifying our position as an anchor technology company within the U.S. by winning high-visibility deals and crushing your annual quota.<br/><br/>On a day-to-day basis, you will be responsible for educating the market about the power of SalesLoft. You must be able to forecast sales activity and revenue achievement accurately while creating satisfied and referenceable customers. To thrive in this role, you will keep up with industry trends, competitive landscape, and customer needs. As a top-performer, you will have immense growth potential and unlimited opportunity to make an impact. And did we mention, there is no cap on commission?", "qualifications": {"required": "7+ years of proven hunting &amp; closing experience in an enterprise software environment, Experience establishing strategic C-level relationships within major software accounts, Ability to run a full sales lifecycle, start to finish, within the enterprise segment, Experience executing detailed product presentations and web demonstrations of our software capabilities to C-level executives, VPs, directors, and sales managers, Adept at identifying and utilizing internal resources (Sales Development, Sales Engineers, etc.) to build SalesLoft brand awareness, assist in sales cycles, and close deals, Superb listening skills; you must understand objections and defeat them by turning skeptics into ecstatic new customers, High level of empathy - it’s important for our sales executive’s to be a good person to peers and prospects, Experience hunting net-new customers in greenfield territory, Consistent history of quota attainment &amp; overachievement", "preferred": "Bachelor's degree or equivalent experience"}, "skills": ["Sales", "Enterprise Software", "Sales Management", "Sales Development", "Sales Engineering", "Customer Relationship Management (CRM)", "Account Management", "Business Development", "Lead Generation", "Negotiation", "Product Demonstration", "Sales Process", "Quota Attainment", "Sales Strategy", "Sales Forecasting", "Customer Success", "Sales Enablement", "Sales Operations", "Sales Training", "Sales Leadership", "Sales Technology", "SaaS", "Hunter Mentality", "Sales Innovation", "Customer Experience", "Startup Environment"], "postedDate": "6 days ago", "benefits": "You will become part of an amazing culture with a supportive CEO and smart teammates who actually care, You will work with an amazing team you can learn from and teach, You will experience joining a high-growth/high-traction organization, You will hear “Yes, let’s do that!” and then have the opportunity to successfully execute on your ideas, We have a vibrant, open office that utilizes modern technology, You will grow more here than you would anywhere else, that is a promise", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999867418"}