{"jobTitle": "Customer Support Specialist - US Remote", "company": {"name": "Experian", "industry": "Financial Services", "location": "Van Buren, AR"}, "location": "Van Buren, AR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$29,677 - $48,537", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Financial Services", "description": "Job Posting - Salary Range: $29,677 - $48,537<br/><br/><strong>Company Description<br/><br/></strong>Experian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions of people to work towards their financial goals and help them save time and money.<br/><br/>We operate across a range of markets, from financial services to healthcare, automotive, agribusiness, insurance, and many more industry segments.<br/><br/>We invest in people and new advanced technologies to unlock the power of data. As a FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 22,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com.<br/><br/><strong>Job Description<br/><br/></strong>Experian Customer Care organization's purpose is to support our ever-growing population of customers by providing top-notch customer service and technical support assistance. We unlock the power of data to help create opportunities for consumers, businesses, and society during life's big moments – from buying a home or car, to sending a child to college, to growing a business exponentially. You are passionate about providing excellent customer service, can interpret consumers' written or verbal grievances or disputes. The Customer Care Specialists will report to the Supervisor, Customer Care and work remotely in Van Buren, AR.<br/><br/><strong>You Will<br/><br/></strong><ul><li>Take In-Bound calls to assist with credit-related memberships, services, and product offerings; and advocate for solutions that will help consumers improve their creditworthiness.</li><li>Help consumers understand credit bureau processes and educate them on appropriate steps to request corrections.</li><li>Receive customer requests for assistance; identify support needed, and either help or forward requests to the appropriate functional area.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>You have high-speed internet service (minimum 25 mbps download/ 5 mbps upload). You can test your home internet speed by using this link: https://speedtest.net/</li><li>Training will be remote so you will be on camera using your computer's webcam.</li><li>You have experience interpreting and responding to customer requests and can put yourself in the mind of the customer.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>High School Diploma or GED.</li><li>At least one year of customer service experience.</li><li>You are comfortable using a computer to perform operations.</li><li>Can pass a criminal background check, employment verification, education verification, credit check and a drug screen.</li><li>Flexible work environment: ability to work remotely, but you must be a US resident living within 45-60 minutes of our State Hwy 59, Van Buren, AR office.<br/><br/></li></ul><strong>Benefits/Perks<br/><br/></strong><ul><li>This role is eligible for a $1,500 performance bonus which is paid out after completing 90 and 180 days of employment. Details will be provided during interview process.</li><li>Core benefits including full medical, dental, vision, and matching 401K</li><li>Flexible time off including volunteer time off, vacation, sick and 12-paid holidays<br/><br/></li></ul><strong>Additional Information<br/><br/></strong>Our uniqueness is that we celebrate yours. Experian's culture and people are important differentiators. We take our people agenda very seriously and focus on what matters; DEI, work/life balance, development, authenticity, engagement, collaboration, wellness, reward &amp; recognition, volunteering... the list goes on. Experian's people first approach is award-winning; Great Place to Work™ in 24 countries, FORTUNE Best Companies to work and Glassdoor Best Places to Work (globally 4.4 Stars) to name a few. Check out Experian Life on social or our Careers Site to understand why.<br/><br/>Experian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is an important part of Experian's DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, irrespective of their gender, ethnicity, religion, color, sexuality, physical ability or age. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity.<br/><br/>All your information will be kept confidential according to EEO guidelines.<br/><br/>", "responsibilities": "<ul><li>Take In-Bound calls to assist with credit-related memberships, services, and product offerings; and advocate for solutions that will help consumers improve their creditworthiness.</li><li>Help consumers understand credit bureau processes and educate them on appropriate steps to request corrections.</li><li>Receive customer requests for assistance; identify support needed, and either help or forward requests to the appropriate functional area.<br/><br/></li></ul>", "qualifications": {"required": "<ul><li>You have high-speed internet service (minimum 25 mbps download/ 5 mbps upload). You can test your home internet speed by using this link: https://speedtest.net/</li><li>Training will be remote so you will be on camera using your computer's webcam.</li><li>You have experience interpreting and responding to customer requests and can put yourself in the mind of the customer.<br/><br/></li></ul>", "preferred": "<ul><li>High School Diploma or GED.</li><li>At least one year of customer service experience.</li><li>You are comfortable using a computer to perform operations.</li><li>Can pass a criminal background check, employment verification, education verification, credit check and a drug screen.</li><li>Flexible work environment: ability to work remotely, but you must be a US resident living within 45-60 minutes of our State Hwy 59, Van Buren, AR office.<br/><br/></li></ul>"}, "skills": ["Customer Service"], "postedDate": "1 week ago", "benefits": "<ul><li>This role is eligible for a $1,500 performance bonus which is paid out after completing 90 and 180 days of employment. Details will be provided during interview process.</li><li>Core benefits including full medical, dental, vision, and matching 401K</li><li>Flexible time off including volunteer time off, vacation, sick and 12-paid holidays<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3999946875"}