{"jobTitle": "Executive Administrative Assistant", "company": {"name": "Four Seasons Hotels and Resorts", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$85,000-$90,000", "currency": "USD"}, "jobFunction": "Management", "industry": "Travel Arrangements and Hospitality", "description": "<strong>About Four Seasons<br/><br/></strong>Four Seasons is powered by our people. We are a collective of individuals who crave to become better, to push ourselves to new heights and to treat each other as we wish to be treated in return. Our team members around the world create amazing experiences for our guests, residents, and partners through a commitment to luxury with genuine heart. We know that the best way to enable our people to deliver these exceptional guest experiences is through a world-class employee experience and company culture.<br/><br/>At Four Seasons, we believe in recognizing a familiar face, welcoming a new one and treating everyone we meet the way we would want to be treated ourselves. Whether you work with us, stay with us, live with us or discover with us, we believe our purpose is to create impressions that will stay with you for a lifetime. It comes from our belief that life is richer when we truly connect to the people and the world around us.<br/><br/><strong>About the location:<br/><br/></strong>An architectural icon in the heart of Lower Manhattan. Diverse, inspiring and vibrant – where art meets architecture in the heart of TriBeCa, Four Seasons Hotel New York Downtown is steps away from the city’s most authentic neighbourhoods. Come and discover a new kind of urban chic with us, whether you choose to rejuvenate in our globally inspired Spa with a heated indoor pool, or dine at CUT by renowned celebrity chef Wolfgang Puck. We look forward to welcoming you.<br/><br/><strong>FOUR SEASONS HOTEL NEW YORK DOWNTOWN<br/><br/></strong><strong>Our Vision<br/><br/></strong>We are New York’s Luxury Lifestyle Icon.<br/><br/><strong>Our Mission<br/><br/></strong>To inspire meaningful connections…<br/><br/>To curate exceptional experiences…<br/><br/>To deliver passionate service…<br/><br/>…with kindness, care and a commitment to excellence<br/><br/>Our value proposition is to provide our guests with a catalog of experiences for a life well lived, in addition to the Four Seasons service excellence promise.<br/><br/><strong>Our Purpose<br/><br/></strong>To Enrich the Lives of Employees, Guests and the Community around us<br/><br/><strong>Our Values<br/><br/></strong>We think differently<br/><br/>We are client obsessed<br/><br/>We have passion<br/><br/>We own it<br/><br/><strong>We Truly Care About Each Other<br/><br/></strong>We have integrity<br/><br/><strong>JOIN OUR TEAM<br/><br/></strong>The Four Seasons Hotel New York Downtown is looking for an Executive Assistant to the General Manager who fully embodies our values, shares a passion for excellence, and infuses enthusiasm into everything they do. As Executive Assistant, you will be accountable for shaping the client experience by providing exceptional service in support of our world-renowned hotel. FSNYD is recognized as a Forbes 5 Star Hotel; Forbes 5 Star Spa and AAA 5 Diamond Hotel.<br/><br/>This position reports to the General Manager.<br/><br/>Salary range: $85,000-$90,000<br/><br/>Four Seasons Hotel New York Downtown is diverse, inspiring and vibrant. As Executive Assistant you will be part of a team that prides itself on excellent service, driving inclusion &amp; belonging, working collaboratively, demonstrating mutual respect and having a passion for providing exceptional client experiences. Your role is vital to the success of Four Seasons New York Downtown. You will be able to shape your work environment by contributing to new ideas, offer solutions and find ways to collaborate with all departments being at the heart of the operation. In return you will be provided with the same level of care that we expect to be shared with our employees and all backed by our impressive Employee Value Proposition.<br/><br/><strong>The Role Of Executive Assistant To General Manager<br/><br/></strong>Reporting into our General Manager, you will manage secretarial responsibilities and coordinate the activities of the Executive Office in matters pertaining to appointments, transportation, mail, coordinating VIP guest bookings, arrivals, and experiences, assisting in the operation when needed and other general affairs. You will also be responsible for handling issues that may require sensitivity and use of sound independent judgment, as well as for managing a complex schedule and dealing with shifting priorities.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Perform administrative skills such as typing, filing, copying, faxing, opening and sorting mail, coordinating appointments for General Manager and Hotel Manager and answer telephones according to Four Seasons standards.</li><li>Prepare written correspondence on behalf of General Manager and Hotel Manager for approval.</li><li>Compile monthly guest comment analysis and ensure proper distribution of results.</li><li>Handle travel arrangements and reservations for managers and VIP guests.</li><li>Comply with Four Seasons’ Category One and Category Two Work Rules and Standards of Conduct while maintaining the confidentiality of the Executive Office as set forth in EmPact.</li><li>Maintain a clean, neat and organized work area and file storage system</li><li>Work harmoniously and professionally with co-workers and supervisors.</li><li>Maintain master list of donations made to charities on behalf of the hotel.</li><li>Offer support for the other operational departments.</li><li>Perform a daily follow-up on Medallia/Guest Comments and correspond to appropriate Department and Division Heads.</li><li>Handle complaints in the absence of the General Manager and inform him/her as to action taken and follow up required.</li><li>Assist with Glitch follow up to guests on behalf of Executive Office.<br/><br/></li></ul><strong>Preferred Qualifications And Skills<br/><br/></strong><ul><li>Associate or Bachelor's degree in related field preferred</li><li>3-5 years prior administrative experience in related position</li><li>High proficiency in Microsoft Suite and Opera</li><li>Ability to read, write, and speak English</li><li>Ability to compose business correspondence</li><li>Solid work ethic, high level of integrity, and a concern for quality, cross cultural sensitivity, and customer service orientation.</li><li>Hours required: Eight hour shift; scheduled days and times may vary based on need.</li><li>You will be the Cultural Advocate of the Golden Rule in every employee action in your hotel; creating a great workplace for all great people to deliver great experiences.<br/><br/></li></ul><strong>What to Expect: You Will…<br/><br/></strong><ul><li>Be part of a cohesive team with opportunities to build a successful career with global potential</li><li>Have access to a robust benefit plan</li><li>Have the opportunity to engage in diverse and challenging work</li><li>Derive a sense of pride in work well done</li><li>Be recognized for excellence<br/><br/></li></ul>Learn more about what it is like to work at Four Seasons – visit us:<br/><br/>http://jobs.fourseasons.com<br/><br/>http://www.linkedin.com/company/four-seasons-hotels-and-resorts<br/><br/>https://twitter.com/fsnydowntown<br/><br/>https://www.facebook.com/FourSeasonsHotelNewYorkDowntown<br/><br/>We look forward to receiving your application.<br/><br/><ul><li>Please note that due to the large number of responses we receive, only candidates being considered for the above position will be contacted for an interview.******<br/><br/></li></ul>Four Seasons is an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans, and individuals with disabilities are encouraged to apply. To access the 'EEOC is The Law' Information poster please visit this website - https://eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf", "responsibilities": "<ul><li>Perform administrative skills such as typing, filing, copying, faxing, opening and sorting mail, coordinating appointments for General Manager and Hotel Manager and answer telephones according to Four Seasons standards.</li><li>Prepare written correspondence on behalf of General Manager and Hotel Manager for approval.</li><li>Compile monthly guest comment analysis and ensure proper distribution of results.</li><li>Handle travel arrangements and reservations for managers and VIP guests.</li><li>Comply with Four Seasons’ Category One and Category Two Work Rules and Standards of Conduct while maintaining the confidentiality of the Executive Office as set forth in EmPact.</li><li>Maintain a clean, neat and organized work area and file storage system</li><li>Work harmoniously and professionally with co-workers and supervisors.</li><li>Maintain master list of donations made to charities on behalf of the hotel.</li><li>Offer support for the other operational departments.</li><li>Perform a daily follow-up on Medallia/Guest Comments and correspond to appropriate Department and Division Heads.</li><li>Handle complaints in the absence of the General Manager and inform him/her as to action taken and follow up required.</li><li>Assist with Glitch follow up to guests on behalf of Executive Office.<br/><br/></li></ul>", "qualifications": {"preferred": "<ul><li>Associate or Bachelor's degree in related field preferred</li><li>3-5 years prior administrative experience in related position</li><li>High proficiency in Microsoft Suite and Opera</li><li>Ability to read, write, and speak English</li><li>Ability to compose business correspondence</li><li>Solid work ethic, high level of integrity, and a concern for quality, cross cultural sensitivity, and customer service orientation.</li><li>Hours required: Eight hour shift; scheduled days and times may vary based on need.</li><li>You will be the Cultural Advocate of the Golden Rule in every employee action in your hotel; creating a great workplace for all great people to deliver great experiences.<br/><br/></li></ul>", "required": ""}, "skills": ["Microsoft Suite", "Opera"], "postedDate": "1 week ago", "benefits": "<ul><li>Be part of a cohesive team with opportunities to build a successful career with global potential</li><li>Have access to a robust benefit plan</li><li>Have the opportunity to engage in diverse and challenging work</li><li>Derive a sense of pride in work well done</li><li>Be recognized for excellence<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3999400406"}