{"jobTitle": "Inventory Analyst", "company": {"name": "Cosmetic Solutions Innovation Labs", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Who we are:<br/><br/>Cosmetic Solutions is a leader in the development and manufacturing of scientifically proven, innovative personal care products. With a focus on, face, body, hair, OTC, and professional use formulations, we create some of the most cost effective, high quality and powerful products on the market.<br/><br/>Providing world class services to up and coming businesses, large established brands, physicians, estheticians and other skin care professionals; we specialize in research &amp; development, custom formulization, graphic design, manufacturing, packaging and delivery.<br/><br/>Job Title: Inventory Analyst<br/><br/>Summary:<br/><br/>The Inventory Analyst will be responsible for driving productivity improvement projects that increase capacity, safeguard inventory assets and improve efficiency. This responsibility will begin with process improvements in the flow of materials from receiving to shipment. The process must improve inventory accuracy, delineate clear process transactions (handoffs between areas), and provide accurate location of material at all times.<br/><br/>Organizational Relationships:<br/><br/><ul><li> Reports to: Chief Financial and Supply Chain Officer<br/><br/><br/></li></ul>Responsibilities:<br/><br/><ul><li> Inventory Accuracy throughout the process</li><li> Own, design and administer the Board Scorecard and Key Performance Indicators (KPI’s) for the Company</li><li> Apply process improvement tools including statistical process control, process mapping, control charts, design of experiments Lean Methodology and process capabilities.</li><li> Lead adherence/improvement to FIFO and inventory aging management in S&amp;OP managing across manufacturing, logistics, R&amp;D, Supply Chain Planning and other functions</li><li> Lead physical inventory, cycle counts, ensure clear location accuracy</li><li> Process improvements that drive efficiency in labor without sacrificing inventory controls</li><li> Defining capacity and warehouse constraints</li><li> Continually re-evaluate work process for productivity improvements.<br/><br/><br/></li></ul>Requirements:<br/><br/><ul><li> 3-5 years in inventory or warehousing leadership</li><li> 3-5 years prior experience in manufacturing environment</li><li> Knowledge and understanding of SKU analysis to optimize Inventory levels</li><li> Knowledge and understanding of inventory accuracy dynamics</li><li> Strong troubleshooting, identification of material flow problems with the use of Netsuite system data</li><li> Broad understanding of material flow processes</li><li> Ability to problem solve quickly and accurately</li><li> Strong interpersonal skills with the ability to effectively communicate with a broad range of individuals from factory workers to Senior Management</li><li> Excellent to strong leadership, written and verbal communication skills</li><li> Proven Project Management skills</li><li> Lean trained or certified</li><li> Bilingual English Spanish a plus</li><li> Proficiency in Microsoft Office, Business ERP systems and other necessary applications.<br/><br/><br/></li></ul>Cosmetic Solutions LLC. is committed to equal employment opportunity for all employees and applicants for employment without regard to age, color, creed, disability status, gender, national origin, race, religion, sexual orientation or veteran status, or any other legally protected status.", "postedDate": "1 week ago", "skills": ["SKU analysis", "Inventory accuracy", "Netsuite", "Process improvement", "Lean Methodology", "Project Management", "Microsoft Office", "Business ERP systems"], "url": "https://www.linkedin.com/jobs/view/3999138116"}