{"jobTitle": "Product Manager", "company": {"name": "iVisa", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and General Business", "industry": "Information Technology & Services", "description": "We’re growing! Don't miss the opportunity to be part of our global team as our Product Manager. \n\nAbout us:\nAt iVisa we believe that traveling should be simple. That’s why over 1 million travelers have chosen us to facilitate their passports, visas, and other travel documents. We are the easiest, fastest, and simplest solution in the market. Our company is growing 80% year on year. We know our biggest strength is our people and we’re looking for the right new team members to help propel our culture and achieve our goals. Above all else, we always have fun!\n\nWhy iVisa?\n* Collaborative, friendly, and diverse culture: We foster an inclusive and vibrant atmosphere, featuring a dynamic and international environment with flat hierarchies and exceptionally amiable colleagues.\n* Work from anywhere: We embrace a remote-first approach, yet we offer the opportunity for periodic in-person gatherings.\n* Mental wellness sessions: Our sessions are led by certified psychologists to support your mental health.\n* Training Allowance: Access an outstanding learning platform to facilitate your professional growth.\n* Extended Family Leave policy: Our policy covers all birthing parents, non-birthing parents, and adopting parents.\n* Thrive in a highly tech-savvy company equipped with cutting-edge tools and the power to make a substantial impact.\n* Join us in our commitment to the planet and sustainability: For every iViser, we plant one tree, allowing you to contribute to our environmental initiatives.\n* Rest and Relaxation: We offer PTO for all employees and Unlimited PTO for managers and above.\n\nAs a Product Manager, you’ll be responsible for:\n* Taking a higher percentage of users from landing pages to applications and increasing step-by-step funnel conversion through to checkout.\n* Ensure pre-application Content Infrastructure, Quality, Accuracy, Usability, and conversion to application start is constantly improving.\n* Continuously improve application Usability, and step-by-step Conversion rates to increase application completion rates.\n* Improving the user experience to reduce friction along the user journey.\n* Work closely with BI/Data products to ensure data and insights are available and actioned upon routinely.\n* Manage the full lifecycle of product development (from concept to execution, including A/B Testing and Metrics Tracking).\n\nWhat will make us choose you?\n* 2+ years working as a Product Manager or Associate Product Manager.\n* Ability to clearly articulate intent and strategic rationale.\n* Battle-tested product management skills like story and PRD writing, QA, data analysis, and wireframing.\n* Highly skilled ability to benchmark against existing world-class experiences and adapt them to our products.\n* Experience with A/B experimentation; scoping, setup, tracking, and analysis of results.\n* Familiarity and experience with standard prototyping tools, such as Figma, Miro, Whimsical, and Invision.\n* User-driven mindset while driving company objectives.\n\niVisa ensures equal employment opportunity to all employees and applicants without discrimination or harassment based on race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, marital status, or medical condition.", "responsibilities": "Taking a higher percentage of users from landing pages to applications and increasing step-by-step funnel conversion through to checkout. Ensure pre-application Content Infrastructure, Quality, Accuracy, Usability, and conversion to application start is constantly improving. Continuously improve application Usability, and step-by-step Conversion rates to increase application completion rates. Improving the user experience to reduce friction along the user journey. Work closely with BI/Data products to ensure data and insights are available and actioned upon routinely. Manage the full lifecycle of product development (from concept to execution, including A/B Testing and Metrics Tracking).", "qualifications": {"required": "2+ years working as a Product Manager or Associate Product Manager. Ability to clearly articulate intent and strategic rationale. Battle-tested product management skills like story and PRD writing, QA, data analysis, and wireframing. Highly skilled ability to benchmark against existing world-class experiences and adapt them to our products. Experience with A/B experimentation; scoping, setup, tracking, and analysis of results. Familiarity and experience with standard prototyping tools, such as Figma, Miro, Whimsical, and Invision. User-driven mindset while driving company objectives."}, "skills": ["Product Management", "Story Writing", "PRD Writing", "QA", "Data Analysis", "Wireframing", "A/B Testing", "Metrics Tracking", "Figma", "Miro", "Whimsical", "Invision"], "postedDate": "1 week ago", "benefits": "Collaborative, friendly, and diverse culture, Work from anywhere, Mental wellness sessions, Training Allowance, Extended Family Leave policy, Thrive in a highly tech-savvy company equipped with cutting-edge tools and the power to make a substantial impact, Join us in our commitment to the planet and sustainability, Rest and Relaxation, 401(k), Medical insurance, Vision insurance, Dental insurance, Paid maternity leave, Paid paternity leave", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000505954"}