{"jobTitle": "Recruitment Specialist", "company": {"name": "Retalent Agency", "location": "Bolivia, IL"}, "location": "Bolivia, IL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "🌍  **Join Our Global Recruitment Team as a Recruitment Specialist!** 🌟<br/><br/>We're an international recruitment agency specializing in matching entrepreneurs with top-notch virtual professionals for remote work. Our mission? To save time and money for businesses while embracing the freedom of remote work. If you're passionate about people, love digging deep into psychology, and have a knack for organization, this could be the perfect role for you!<br/><br/>**Why You'll Love It Here:<br/><br/>**<ul><li> 100% Remote: Work from anywhere, just like the amazing professionals you'll be recruiting!</li><li> Growth Opportunities: Start as a Recruiter Specialist and pave your way to becoming a department lead</li><li> Flexible Hours: Enjoy a full-time job with a flexible schedule, short Fridays, and weekends off</li><li> Learning &amp; Development: We support your continuous growth with training, books, and paid courses</li><li> Global Connections: Communicate with people from all over the world and learn from their diverse experiences<br/><br/><br/></li></ul>**What You'll Be Doing:<br/><br/>**<ul><li> Market Research: Analyze employment trends, define salary ranges, and stay ahead of the curve</li><li> Candidate Communication: Conduct interviews, chat with candidates, assess their English skills, and check references</li><li> Interview Prep: Create tailored interview questions for each candidate</li><li> Content Creation: Write job descriptions for postings and blog posts to boost our SEO</li><li> Digital Marketing Support: Assist our director with various marketing tasks<br/><br/><br/></li></ul>**Requirements<br/><br/>**<strong>Who We're Looking For:<br/><br/></strong><ul><li> English Proficiency: C1/C2 level—this is crucial!</li><li> Recruitment Experience: You've got a few years of experience in interviewing, screening, and sourcing</li><li> Empathetic &amp; Curious: You love understanding people and enjoy meaningful conversations</li><li> Organized &amp; Punctual: You thrive in well-structured environments and never miss a deadline</li><li> Flexible &amp; Positive: You're adaptable, optimistic, and a great team player</li><li> Analytical Thinker: Strong research and critical thinking skills are your forte</li><li> Bonus Points: Experience or education in recruitment, HR, psychology, or marketing<br/><br/><br/></li></ul>**Benefits<br/><br/>**<strong>What's In It For You:<br/><br/></strong><ul><li> Competitive Salary: Earn between 600-850 EURO with growth potential</li><li> Skill Development: Hone your psychology, analysis, business, and communication skills</li><li> Project Management: Gain hands-on experience working alongside our Project Manager</li><li> Paid Vacation: After your training period, enjoy 20 days of paid vacation to recharge</li><li> All English, All the Time: Perfect your English skills daily in our 100% English-speaking environment<br/><br/></li></ul>Ready to make a difference in the lives of professionals around the world? Apply now and join a team that's as passionate about remote work as you are! 🚀", "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "1 month ago", "skills": ["English", "Recruitment", "Psychology", "Organization", "Remote Work", "Marketing", "Communication", "Research", "Analysis", "Project Management"], "url": "https://www.linkedin.com/jobs/view/4000347287"}