{"jobTitle": "Account Executive, Field Sales - Northeast US", "company": {"name": "TATCHA", "location": "West New York, NJ"}, "location": "West New York, NJ", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Personal Care Product Manufacturing", "description": "<strong>Who We Are<br/><br/></strong>TATCHA from Japan with love. We are redefining skincare with high quality, nutrient-dense ingredients harvested from renowned sources in Japan, our formulas are gentle yet effective. The knowledge that the skin affects and reflects our well-being, we take a holistic approach for health and radiance from skin to soul. Believing that beauty begins in the heart and the mind, we are invested in making quality education accessible to all. In 2014, we created the Beautiful Faces, Beautiful Futures fund to keep girls in school to reach their potential through Room to Read’s Girls’ Education Program.<br/><br/><strong>What We Need<br/><br/></strong>A highly organized, hands-on Account Executive to join our dynamic, fast-paced North American Retail Field Sales team. In this role the Account Executive is consistently achieving or exceeding retail sales goals and fostering business growth in their assigned territory. This leader is a fantastic collaborator and relationship builder who also engages closely with cross functional internal teams, store management/staff, and freelance teams. An Account Executive exhibits a strong business acumen, strategic planning, executing retail events, outstanding selling skills, and exceptional product knowledge. They are committed to education, training and development while embodying TATCHA culture and values.<br/><br/>This position is responsible for a strategic call cycle that includes 4-5 days a week in stores with the ability to be flexible to the ever changing needs of our business.<br/><br/>Each Day At TATCHA Is Different With New Challenges To Conquer And Tasks To Tackle, But Here Is An Idea Of Some Of The Things You Will Work On<br/><br/><ul><li>Developing and executing business plans, consistently surpassing KPIs &amp; financial objectives.</li><li>Utilizing weekly business analysis to determine opportunities for growth.</li><li>Generating sell-through via selling and training.</li><li>Emulating and reinforcing brand image/culture - bringing the spirit of partnership to all interactions</li><li>Hiring, training, developing, scheduling and overseeing a freelancer(s).</li><li>Coordinating and identifying store locations best suited for retail events to maximize profitability.</li><li>Conducting store &amp; district trainings within the region.</li><li>Performing one-on-one training for individuals on an ad-hoc basis.</li><li>Driving growth by leveraging consumer/sales insights, continuously analyzing sales data for growth opportunities and partnering closely with your Regional Manager.</li><li>Adhering to company guidelines while maintaining and managing all relevant budgets and expenses.</li><li>Facilitating events, in store selling, developing customer relationships.</li><li>Supporting logistics when necessary.<br/><br/></li></ul><strong>Principal Accountabilities<br/><br/></strong>Sales<br/><br/><ul><li>Drive sales to meet metrics as outlined by leadership</li><li>Develop territory strategy with input from Regional Manager to maximize sell-through </li><li>Coordinate and execute events to achieve or exceed sales goals</li><li>Review and analyze daily, weekly, and monthly sales</li><li>Ability to impact and work with remote stores to drive sales volume</li><li>Create and execute plans to grow brand ranking in an assigned territory<br/><br/></li></ul>Education<br/><br/><ul><li>Educate and train store teams on TATCHA brand knowledge and product demonstrations.</li><li>Plan and execute consistent meetings with Store Management, District Managers and other Leadership and Trainers to ensure consistent brand awareness and messaging.</li><li>Effective presenter to engage audience.</li><li>Ability to adapt training to individual skill sets and multi world selling environments.</li><li>Partner with RM to ensure all Tatcha EDU materials are executed as needed.</li><li>Train, develop, educate freelancer(s) on TATCHA product knowledge and sales.<br/><br/></li></ul>Communication, Relationships, And Time Management<br/><br/><ul><li>Self-motivated to lead and represent TATCHA with retail partners.</li><li>Communicate season presentation to Store Management and In store Teams.</li><li>Communicate sales and ranking with store leadership during visits, calls, and meetings.</li><li>Collect and report any out-of-stock situation to Regional Managers.</li><li>Prepare and actively participate in weekly conference calls, touch bases, and meetings. </li><li>Responsible for thoughtful appropriate spending and accurate submission of the T&amp;E expenses.</li><li>Support execution and follow up regarding merchandising according to guidelines and Retail Planograms.</li><li>Manages freelancer(s) and budget ethically to support the business,</li><li>Communicates effectively and in a timely manner to the Regional Manager. <br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li>5+ years industry experience or a minimum of 2 years Cosmetic Account Executive or 5 years Account Coordinator experience (or equivalent position.)</li><li>Strong Administration skills is non-negotiable for this role. </li><li>Preferred experience working with Sephora/Ulta - experience with large retail accounts or multiple retailers a plus.</li><li>Familiarity in working with Google platforms, slides, docs, sheets etc. Familiar with MS Word and Excel.</li><li>Superior training and motivational abilities.</li><li>Thrives in a fast paced environment, excels in agility and ability to adapt to business needs.</li><li>Team Player, positive attitude, resilient in nature.</li><li>Ability to focus and work autonomously and be accountable for a given market.</li><li>Analysis of sales results, sales forecasts and promotional impact.</li><li>Capable of managing multiple priorities.</li><li>Exhibit effective communication skills with customers, peers and management.</li><li>Overnight travel required, the percentage of time will vary by market.</li><li>Ability to travel. work weekends, evenings and holidays as needed.</li><li>Valid driver’s license is required. Must have a car and reliable transportation to and from work.<br/><br/></li></ul>Physical Demands Of The Job<br/><br/><ul><li>Must be able to stand for up to 8 hours a day</li><li>Flexible with work schedule 5 days per week, at least 2 Saturday’s a month</li><li>Must be able to lift up to 50lbs<br/><br/></li></ul>THE DETAILS<br/><br/>The expected base salary range for this position is $70,000 to $80,000. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget.<br/><br/>This position is also eligible for participation in the company discretionary bonus plan, based on personal performance and company results. This role is also eligible for car, phone, and internet allowances.<br/><br/>In addition to base salary, Tatcha offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, and paid holidays.<br/><br/>Tatcha is an Equal Opportunity Employer and does not discriminate on the basis of race, color, gender identity, religion, sex, age, national origin, disability, veteran status, sexual orientation, genetic information or any other classification protected by Federal, State or Local law.<br/><br/>We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce. All employment is decided on the basis of qualifications, experience and business need.<br/><br/>Tatcha will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.<br/><br/>", "responsibilities": "Developing and executing business plans, consistently surpassing KPIs &amp; financial objectives. Utilizing weekly business analysis to determine opportunities for growth. Generating sell-through via selling and training. Emulating and reinforcing brand image/culture - bringing the spirit of partnership to all interactions Hiring, training, developing, scheduling and overseeing a freelancer(s). Coordinating and identifying store locations best suited for retail events to maximize profitability. Conducting store &amp; district trainings within the region. Performing one-on-one training for individuals on an ad-hoc basis. Driving growth by leveraging consumer/sales insights, continuously analyzing sales data for growth opportunities and partnering closely with your Regional Manager. Adhering to company guidelines while maintaining and managing all relevant budgets and expenses. Facilitating events, in store selling, developing customer relationships. Supporting logistics when necessary.", "qualifications": {"required": "5+ years industry experience or a minimum of 2 years Cosmetic Account Executive or 5 years Account Coordinator experience (or equivalent position.) Strong Administration skills is non-negotiable for this role. ", "preferred": "Preferred experience working with Sephora/Ulta - experience with large retail accounts or multiple retailers a plus. Familiarity in working with Google platforms, slides, docs, sheets etc. Familiar with MS Word and Excel. Superior training and motivational abilities. Thrives in a fast paced environment, excels in agility and ability to adapt to business needs. Team Player, positive attitude, resilient in nature. Ability to focus and work autonomously and be accountable for a given market. Analysis of sales results, sales forecasts and promotional impact. Capable of managing multiple priorities. Exhibit effective communication skills with customers, peers and management. Overnight travel required, the percentage of time will vary by market. Ability to travel. work weekends, evenings and holidays as needed. Valid driver’s license is required. Must have a car and reliable transportation to and from work."}, "skills": ["Sales", "Retail", "Training", "Business Development", "Marketing", "Customer Service", "Communication", "Teamwork", "Leadership", "Management", "Event Planning", "Product Knowledge", "Google Suite", "Microsoft Office", "Sales Forecasting", "Budgeting", "Time Management", "Travel"], "postedDate": "6 days ago", "benefits": "The expected base salary range for this position is $70,000 to $80,000. The exact base salary is determined by various factors including experience, skills, education, geographic location, and budget. This position is also eligible for participation in the company discretionary bonus plan, based on personal performance and company results. This role is also eligible for car, phone, and internet allowances. In addition to base salary, Tatcha offers a competitive benefits package to eligible employees, including medical insurance, dental insurance, vision insurance, life insurance, accident insurance, critical illness insurance, disability insurance, retirement savings plans and company match, paid family leave, education-related programs, and paid holidays.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000946309"}