{"jobTitle": "Junior Marketing & Sales Manager", "company": {"name": "A2I Enterprise", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "A2I is a sales and marketing firm, located in the Austin area. We specialize in taking a direct approach for customer retention and client acquisition for service-based Fortune 500 companies. Currently, we are looking to fill a Junior Marketing & Sales Manager position in our Austin location.<br/><br/>We provide the opportunity for those looking to excel in the field of marketing, sales, and management by utilizing a hands-on approach in management training. We focus on developing and enhancing the competitive nature and willingness to lead within every potential candidate. This is a valuable opportunity for those who have experience in marketing, advertising, team leadership, management, sales, entrepreneurship, and anybody with a competitive mindset.<br/><br/>We start everyone in our business at the entry level for the sole purpose of developing a strong management team from within; with the mentality that everyone can get from an entry-level position to a management position. We do not believe in tenure or seniority, we promote to management those who get the job done.<br/><br/><strong>Junior Marketing & Sales Manager team enjoys:<br/><br/></strong><ul><li>An excellent work environment where fun meets success</li><li>Support and backing from Fortune 500 clients</li><li>Upward mobility with a personal business mentor provided to each crew member</li><li>Weekly leadership development meetings</li><li>Team nights</li><li>Travel opportunities<br/><br/></li></ul><strong>Responsibilities for the Junior Marketing & Sales Manager position include:<br/><br/></strong><ul><li>Training in management for customer service, marketing, and sales consultants</li><li>Assisting in the daily operations of the client</li><li>Assisting in customer retention</li><li>Assisting in new business acquisition and increasing market share</li><li>Developing strong leadership skills to build a high performance, cross-functional team environment<br/><br/></li></ul><strong>Characteristics we are looking for in the Junior Marketing & Sales Manager:<br/><br/></strong><ul><li>Competitive individuals with a winning mentality to move up into management</li><li>Sports minded and Energetic team players</li><li>Team captains ready to lead and train</li><li>Superior student mentality</li><li>Candidates who are serious about a long term career with a growing industry</li><li>Candidates who are ready to grow from the ground up<br/><br/></li></ul>Powered by JazzHR<br/><br/>sUWBNnVs1p<br/><br/>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000853481"}