{"jobTitle": "Product Manager", "company": {"name": "Tech Mahindra", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Hospitals and Health Care and Health and Human Services", "description": "Qualifications:\n\n - Bachelor’s degree in Business, Healthcare Management, Computer Science, or a related field.\n - 5+ years of experience as a Product Manager, with a focus on healthcare payer products.\n - Strong understanding of the healthcare payer industry, including claims processing, eligibility, billing, and regulatory requirements.\n - Proven track record of managing products through the entire lifecycle, from ideation to launch and beyond.\n - Experience working with cross-functional teams and managing stakeholder relationships.\n - Strong analytical skills and the ability to translate complex business needs into actionable product requirements.\n - Excellent communication and presentation skills, with the ability to convey complex ideas to both technical and non-technical audiences.\n - Familiarity with Agile and Scrum methodologies.\n - Experience with product management tools (e.g., Jira, Aha!, Confluence) and data analysis tools (e.g., Excel, Tableau).\n\n\n Preferred Qualifications:\n\n - Advanced degree in Business, Healthcare Management, or a related field.\n - Experience in launching products that address healthcare payer pain points, such as cost management, compliance, or patient engagement.\n - Knowledge of healthcare IT standards (e.g., HIPAA, EDI) and interoperability challenges.\n - Experience with data analytics and reporting tools used in the healthcare payer industry.\n\n<br/>\n\n<em>Tech Mahindra is an Equal Employment Opportunity employer. We promote and support a diverse workforce at all levels of the company. All qualified applicants will receive consideration for employment without regard to race, religion, color, sex, age, national origin, or disability. All applicants will be evaluated solely based on their ability, competence, and performance of the essential functions of their positions with or without reasonable accommodations. Reasonable accommodations also are available in the hiring process for applicants with disabilities. Candidates can request a reasonable accommodation by contacting the company ADA Coordinator at ADA_Accomodations@TechMahindra.com.</em>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000555441"}