{"jobTitle": "Commercial Lines Account Manager - Insurance - REMOTE", "company": {"name": "WAHVE LLC", "location": "Vancouver, WA"}, "location": "Vancouver, WA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Finance and Sales", "industry": "Staffing and Recruiting", "description": "<strong><em>Put your Insurance Experience to work - FROM HOME!<br/><br/></em></strong>At <strong>WAHVE,</strong> we value significant insurance experience and want to revolutionize the way people think about <strong><em>phasing into</em> <em>retirement</em></strong> by offering qualified candidates the opportunity to continue their career working from home. As we say - <strong><em>retire from the office but not from work. </em></strong>Our unique platform provides you with <em>real</em> work/life balance and allows you to customize your own work schedule while continuing to utilize your insurance expertise in <strong><em>a flexible, remote, long-term position which includes company benefits!<br/><br/></em></strong><strong>What You’ll Love About Wahve<br/><br/></strong>We created a welcoming place to work with friendly and professional leadership. We are known for the great care we take with our staff and our clients. We are passionate and determined about delivering the best customer service, preserving insurance industry knowledge, and making a difference by the work that we do.<br/><br/><strong>What We Are Seeking<br/><br/></strong>We have assignments available to help our <em>Property &amp; Casualty independent retail broker </em>clients in <strong>Commercial Lines for Account Manager positions. Responsibilities may include:<br/><br/></strong><ul><li>Manage Commercial Lines client accounts with the focus on building and/or strengthening relationships by providing exceptional customer service. </li><li>Prepare applications, and market new and renewal risks. </li><li>Responsible for contract review and issuance of Certificates of Insurance (COI’s). </li><li>Obtain and/or review quotes. </li><li>Bind and/or check policies. </li><li>Request endorsements. </li><li>Experience using ANY independent agency management system is preferred (high demand for EPIC, AMS360, Sagitta and Hawksoft). <br/><br/></li></ul><strong>TO BECOME A WORK-AT-HOME VINTAGE EXPERT, WE REQUIRE<br/><br/></strong><ul><li>25 years of full-time work experience</li><li>10 most current years of Commercial Lines Property &amp; Casualty insurance experience<br/><br/></li></ul><strong>Benefits Of Becoming a Wahve Vintage Expert<br/><br/></strong><ul><li>Health insurance based on eligibility. </li><li>401(k) with a 4% match. </li><li>Retire from the office but not from work. </li><li>Eliminate the office stress and the commute. </li><li>Choose the work you would like to do now. </li><li>Customize your schedule - full or part time. </li><li>Utilize your years of insurance industry knowledge. </li><li>Be part of our dynamic yet virtual team environment and connect with other experienced insurance professionals like yourself!<br/><br/></li></ul><strong>How To Get Started<br/><br/></strong>Click <strong><em>APPLY NOW</em></strong> to complete our simple preliminary profile. Be sure to include your preferred contact information as one of our Qualification Specialists will connect with you promptly.<br/><br/><strong>WE LOOK FORWARD TO MEETING YOU!</strong>", "postedDate": "1 week ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000591876"}