{"jobTitle": "Product Manager", "company": {"name": "Experian", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "77,900.00/yr - 135,027.00/yr", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Financial Services", "description": "Job Posting - Salary Range: $77,900 - $135,027<br/><br/><strong>Company Description<br/><br/></strong>Discover the Unexpected - Our 22k amazing employees in 30+ countries believe the possibilities for you and the world are growing. We're investing in the future through new technologies, accomplished people, and innovation to help create a better tomorrow. To do this, we employ 'big-thinkers' that share our purpose #uniquelyexperian<br/><br/><strong>Job Description<br/><br/></strong>You are the CEO of your product. You will manage the Account Management suite - Experian's Commercial Alerts, Portfolio Management, and Commercial Collections products. You will collaborate with partners across the company to promote understanding of all aspects of your product. You will work with clients, industry experts, your UX Manager, and other teams to understand the market's needs, translating those needs into roadmap items and user stories to develop your product's capabilities. You will create operational efficiencies for your product and work with client implementation specialists and technical support to create and advocate for a delightful user experience. Additionally, this role is remote and may be located anywhere in the United States.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Work directly with other product managers, product owners, architects and contribute to the development of a product vision, ensuring that it aligns with the broader vision and goals.</li><li>Acquire client feedback and serve as the spokesperson for the voice of the market</li><li>Be the main Product Owner for the development team for your product, ensuring they have clarity on the vision, goals, and priorities.</li><li>Work with Tech Leads and the development teams to create user stories needed to implement the product vision including documenting acceptance criteria. This requires an understanding of architectural decisions, performance considerations, security issues, and data management as it relates to the success of these products.</li><li>Work with the scrum teams to identify needs and translate into user stories and to create a clear roadmap for implementation.</li><li>Help analyze our competitive landscape to ensure our product's technical edge.</li><li>Manage the product backlog with a focus on delivering solutions that maximize value and fulfill our strategic goals.</li><li>You will be reporting to our Sr. Director of Product<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's degree or equivalent practical experience</li><li>3+ years of experience in a product owner role</li><li>Experience as a Product Owner, very comfortable working with the technology team during the entire software development lifecycle</li><li>Passionate about GenAI. Prior working experience innovating or creating GenAI products</li><li>Experience with the Agile methodologies, software development lifecycle, and modern software practices and technologies.</li><li>Ability to explain complex technical concepts to non-technical stakeholders</li><li>Leadership and agreement-building abilities with experience coordinating and mobilizing resources productively.<br/><br/></li></ul><strong>What You'll Bring<br/><br/></strong>Small businesses are our economy. Here at Experian Commercial, our mission is to give every small business the best chance to succeed and get access to capital to help them grow and realize their dreams by creating financial inclusion through better data, analytics, and technology. Your contributions to your product will help our clients manage their customers and find new opportunities for expanding access to capital for these small businesses.<br/><br/><strong>Additional Information<br/><br/></strong>Perks and Benefits<br/><br/><ul><li>15 days PTO</li><li>5 days Sick Time</li><li>401K with employer match</li><li>Health, Dental, Vision Benefits, among others</li><li>12 company paid holidays<br/><br/></li></ul>Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.<br/><br/><em>All your information will be kept confidential according to EEO guidelines. Experian is proud to be an Equal Opportunity and Affirmative Action employer. Anyone needing accommodation to complete the interview process should notify the talent acquisition partner.<br/><br/></em><em>The word \"Experian\" is a registered trademark in the EU and other countries and is owned by Experian Ltd. and/or its associated companies.<br/><br/></em><em>EOE including Disability/Veterans<br/><br/></em>", "responsibilities": "You are the CEO of your product. You will manage the Account Management suite - Experian's Commercial Alerts, Portfolio Management, and Commercial Collections products. You will collaborate with partners across the company to promote understanding of all aspects of your product. You will work with clients, industry experts, your UX Manager, and other teams to understand the market's needs, translating those needs into roadmap items and user stories to develop your product's capabilities. You will create operational efficiencies for your product and work with client implementation specialists and technical support to create and advocate for a delightful user experience. Additionally, this role is remote and may be located anywhere in the United States.", "qualifications": {"required": "Bachelor's degree or equivalent practical experience, 3+ years of experience in a product owner role, Experience as a Product Owner, very comfortable working with the technology team during the entire software development lifecycle, Passionate about GenAI. Prior working experience innovating or creating GenAI products, Experience with the Agile methodologies, software development lifecycle, and modern software practices and technologies., Ability to explain complex technical concepts to non-technical stakeholders, Leadership and agreement-building abilities with experience coordinating and mobilizing resources productively."}, "skills": ["GenAI", "Agile", "Software Development Lifecycle", "Product Management", "Product Ownership"], "postedDate": "1 week ago", "benefits": "15 days PTO, 5 days Sick Time, 401K with employer match, Health, Dental, Vision Benefits, among others, 12 company paid holidays", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000867211"}