{"jobTitle": "Partner Sales Manager - Dell", "company": {"name": "Canonical", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.<br/><br/>The company is founder led, profitable and growing.<br/><br/>We are hiring a Partner Sales Manager to be a key contributing team member within the growing Dell alliances organization. Large OEM or Independent Hardware Vendor (IHV) brands - Dell, HPE, IBM, Lenovo, Ericsson, Cisco, Fujitsu and many more - are major partners for Canonical. These companies build software-defined solutions to capitalize on global open source mandates and associated macro trends. Canonical's flagship product, Ubuntu, and its broader open source portfolio are key ingredients for these partners to realize their aspirations. Canonical represents the best platform for rapid open source innovation.<br/><br/>Reporting to the Senior Director of Global Alliances - Dell, the Partner Sales Manager will work closely with Dell and Canonical teams in various geographies to enable Dell teams, generate and transact opportunities, drive a Canonical agenda within Dell, and achieve targeted results. They are responsible to build trusted relationships with Dell, increase Canonical market share and attach rate, evangelize the partnership and drive business interactions from across persona - from engineer to CxO. They will often run customer workshops focused on particular initiatives at that customer, attend sales events, give public presentations and participate in executive engagements as coordinated by the Senior Director.<br/><br/><strong>Location: This role will be based remotely in America or APAC regions.<br/><br/></strong>The role entails<br/><br/><ul><li>Build strategic relationships and enable Dell teams on the partnership</li><li>Build pipeline and transact opportunities through Dell </li><li>Grow Dell's awareness of open source capabilities on Canonical Ubuntu</li><li>Demonstrate a deep understanding of the Linux and cloud software ecosystem</li><li>Deliver on targets, objectives and provide a voice of the partner</li><li>Travel regularly - sometimes internationally - to drive partnerships in person</li><li>Align and support internal canonical field teams - identify, support, grow, transact</li><li>Expand existing footprint with Dell customers with an aim to upsell to broader portfolio</li><li>Support and contribute to broader strategy, initiatives and key campaigns as defined by the Senior Director<br/><br/></li></ul>What we are looking for in you<br/><br/><ul><li>Experience in alliance or indirect sales management roles</li><li>Autonomous, disciplined, hands-on, get-it-done mentality</li><li>Ability to capture customer requirements, evaluate gaps, identify and create opportunities</li><li>Passionate about Ubuntu products and mission</li><li>Comfortable in fast-paced and high pressure environments with measurable goals</li><li>Experience with Linux, virtualization, containers, and other cloud technologies</li><li>Excellent communication and presentation skills</li><li>Team player with superior accountability and customer support skills</li><li>Credibility and working knowledge of Dell - its products, go-to-market motion, and field</li><li>Experience managing cross-functional teams and track record of operational excellence</li><li>Willingness to travel up to 4 times a year for internal events</li><li>Hands on experience with SalesForce.com and Google Suite a plus<br/><br/></li></ul>What we offer colleagues<br/><br/>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul><strong>About Canonical<br/><br/></strong>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.<br/><br/>Canonical is an equal opportunity employer<br/><br/>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br/><br/>", "responsibilities": "The role entails<br/><br/><ul><li>Build strategic relationships and enable Dell teams on the partnership</li><li>Build pipeline and transact opportunities through Dell </li><li>Grow Dell's awareness of open source capabilities on Canonical Ubuntu</li><li>Demonstrate a deep understanding of the Linux and cloud software ecosystem</li><li>Deliver on targets, objectives and provide a voice of the partner</li><li>Travel regularly - sometimes internationally - to drive partnerships in person</li><li>Align and support internal canonical field teams - identify, support, grow, transact</li><li>Expand existing footprint with Dell customers with an aim to upsell to broader portfolio</li><li>Support and contribute to broader strategy, initiatives and key campaigns as defined by the Senior Director<br/><br/></li></ul>", "qualifications": {"required": "Experience in alliance or indirect sales management roles, Autonomous, disciplined, hands-on, get-it-done mentality, Ability to capture customer requirements, evaluate gaps, identify and create opportunities, Passionate about Ubuntu products and mission, Comfortable in fast-paced and high pressure environments with measurable goals, Experience with Linux, virtualization, containers, and other cloud technologies, Excellent communication and presentation skills, Team player with superior accountability and customer support skills, Credibility and working knowledge of Dell - its products, go-to-market motion, and field, Experience managing cross-functional teams and track record of operational excellence, Willingness to travel up to 4 times a year for internal events, Hands on experience with SalesForce.com and Google Suite a plus", "preferred": ""}, "skills": ["Sales Management", "Alliance Management", "Linux", "Virtualization", "Containers", "Cloud Technologies", "Communication", "Presentation Skills", "Teamwork", "Customer Support", "Dell", "SalesForce.com", "Google Suite"], "postedDate": "6 days ago", "benefits": "We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.<br/><br/><ul><li>Distributed work environment with twice-yearly team sprints in person</li><li>Personal learning and development budget of USD 2,000 per year</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Maternity and paternity leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues</li><li>Priority Pass, and travel upgrades for long haul company events<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000948274"}