{"jobTitle": "Customer Service Remote", "company": {"name": "Octane Co.", "location": "St Charles, MO"}, "location": "St Charles, MO", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "Join Our Legacy: Become a Remote Representative<br/><br/>Be a part of our esteemed tradition of serving working-class families since 1951. We specialize in providing essential life, accident, and supplemental health products tailored for labor unions, credit unions, associations, and their valued families. Were seeking dedicated representatives who excel in building lasting client relationships and delivering exceptional service.<br/><br/>About Us:<br/><br/><ul><li>Proven Growth: Achieved over 20% growth last year, demonstrating our resilience and continued relevance even during challenging times.</li><li>Location: United States<br/><br/><br/></li></ul>Qualities We Value:<br/><br/><ul><li>Outstanding Communication: Ensure effective and engaging client interactions.</li><li>Tech-Savvy: Basic computer skills for smooth virtual engagement.</li><li>Strong Work Ethic: Dedication to delivering excellent service.</li><li>Charismatic Personality: An outgoing demeanor that makes a positive impact.</li><li>Time Management: Ability to manage time effectively and work productively.<br/><br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Leadership Experience: Previous experience in leadership roles, with pathways for career growth and advancement.<br/><br/><br/></li></ul>Job Benefits:<br/><br/><ul><li>Remote Flexibility: Enjoy the comfort and convenience of 100% remote work.</li><li>Competitive Compensation: Receive weekly pay based on a schedule designed to set you up for success.</li><li>Performance Bonuses: Unlock opportunities for additional earnings through exceptional performance.</li><li>Health Insurance Reimbursement: Gain peace of mind with health insurance reimbursement.</li><li>Flexible Scheduling: Tailor your schedule to fit your personal needs.</li><li>Retirement Plan: Benefit from a strong retirement plan to prepare for your future.</li><li>Renewal Rewards: Earn additional rewards through long-term commitment and renewals.<br/><br/><br/></li></ul>Join us in our mission to protect and support families, and be a part of our proud tradition. Apply today to embark on a rewarding remote career with a legacy of excellence!", "jobFunction": "Other", "industry": "Business Consulting and Services", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4000607509"}