{"jobTitle": "Order Fulfillment Specialist", "company": {"name": "Brilliance.com", "industry": "Retail Luxury Goods and Jewelry", "location": "Boynton Beach, FL"}, "location": "Boynton Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Are you someone who excels in a fast-paced environment and loves the satisfaction of meeting fulfillment targets? Do you have a sharp eye for detail and enjoy working collaboratively in a team? If so, we have the perfect opportunity for you as a Receiving/Shipping/Fulfillment Clerk! We’re not just any jewelry retailer; we’re a global brand known for our exquisite diamonds, engagement rings, and fine jewelry. While many local retailers are closing their doors, we’re expanding and want you to be part of our success story.\n\nWhat You'll Do\n\n* Efficient Order Processing: Use our management system to receive, pick, pack, and ship orders with precision.\n* Team Collaboration: Work closely with team members to achieve daily shipping and receiving goals.\n* Station Organization: Maintain a clean and organized work environment.\n* General Duties: Assist with various tasks in shipping management as needed.\n\nWhat's In It for You?\n\n* Competitive Compensation: Attractive hourly wage reflecting your experience and skills.\n* Skill Development: Hands-on training in order processing, inventory management, equipment operation, and quality control from experienced professionals.\n* Job Security: Join a thriving company that manufactures its products in-house and supports US workers, ensuring a stable and secure job environment. We’ve been on the market for over 35 years.\n* Positive Workplace: Enjoy a collaborative and supportive atmosphere where your dedication to quality and craftsmanship is valued.\n\nWhat We're Looking For\n\n* Experience: Prior experience with warehouse management systems and order fulfillment processes is a plus but not required.\n* Skills: Strong organizational skills and attention to detail.\n* Physical Ability: Comfortable with manual labor and able to handle stock efficiently.\n* Team Player: Excellent communication skills and a collaborative spirit.\n\nWhy Brilliance.com?\n\nAt Brilliance.com, we're committed to offering exceptional training and career opportunities in a rapidly growing industry. We're passionate about creating beautiful jewelry that brings joy to our customers worldwide. If you're eager to learn, grow, and be part of a company that values its employees, we want to hear from you!\n\nReady to start your journey in the world of fine jewelry? Join our team today and become a part of something brilliant. Learn more about us here.", "responsibilities": "Efficient Order Processing: Use our management system to receive, pick, pack, and ship orders with precision.\nTeam Collaboration: Work closely with team members to achieve daily shipping and receiving goals.\nStation Organization: Maintain a clean and organized work environment.\nGeneral Duties: Assist with various tasks in shipping management as needed.", "qualifications": {"required": "Prior experience with warehouse management systems and order fulfillment processes is a plus but not required.\nStrong organizational skills and attention to detail.\nComfortable with manual labor and able to handle stock efficiently.\nExcellent communication skills and a collaborative spirit.", "preferred": ""}, "skills": ["Order Processing", "Inventory Management", "Teamwork", "Communication", "Organization"], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "Competitive Compensation: Attractive hourly wage reflecting your experience and skills.\nSkill Development: Hands-on training in order processing, inventory management, equipment operation, and quality control from experienced professionals.\nJob Security: Join a thriving company that manufactures its products in-house and supports US workers, ensuring a stable and secure job environment. We’ve been on the market for over 35 years.\nPositive Workplace: Enjoy a collaborative and supportive atmosphere where your dedication to quality and craftsmanship is valued.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000197479"}