{"jobTitle": "Receptionist", "company": {"name": "Pieces of HR", "location": "Jersey City, NJ"}, "location": "Jersey City, NJ", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Business Consulting and Services", "description": "Pieces of HR is a leading HR service provider specializing in supporting small business and startups with expert HR and recruiting solutions.<br/><br/>Our client is seeking a skilled and friendly Front Office Ambassador to join the team.<br/><br/>The Receptionist will be the first point of contact for clients, customers, and visitors. They will play a critical role in creating a great first impression.<br/><br/>In this role, the Receptionist will be expected to serve as the initial point of contact for clients, customers, and visitors, while providing excellent customer service.<br/><br/><strong>This is a long term contract role. <br/><br/></strong><strong>Industry: Financial Services<br/><br/></strong><strong>Overview<br/><br/></strong>The Receptionist plays a crucial role as the first point of contact for our clients organization. This individual is responsible for creating a positive first impression for all visitors and providing exceptional customer service. The Receptionist also manages various administrative tasks and supports the overall functionality of the office.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Greet and welcome visitors in a professional and friendly manner</li><li>Answer and direct phone calls efficiently</li><li>Maintain a clean and organized reception area</li><li>Manage incoming and outgoing mail and deliveries</li><li>Assist with scheduling appointments and managing calendars</li><li>Coordinate and schedule meetings and appointments</li><li>Manage office supplies and inventory</li><li>Assist with basic bookkeeping tasks, such as tracking expenses</li><li>Assist with coordination of office events and meetings</li><li>Provide support to other administrative staff as needed</li><li>Ensure security and confidentiality of visitor and employee information</li><li>Respond to inquiries and provide information to visitors and employees</li><li>Assist with facility and office equipment maintenance</li><li>Adhere to all company policies and procedures<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong><ul><li>College degree preferred </li><li>Prior experience in a customer service or administrative role</li><li>Proficiency in Microsoft Office (Word, Excel, Outlook)</li><li>Excellent communication and interpersonal skills</li><li>Strong organizational and multitasking abilities</li><li>Ability to maintain a professional and courteous demeanor at all times</li><li>Basic bookkeeping skills and familiarity with office equipment</li><li>Ability to handle confidential information with discretion</li><li>Strong attention to detail and accuracy</li><li>Ability to work effectively in a fast-paced environment</li><li>Knowledge of multi-line phone systems</li><li>Ability to prioritize and manage tasks efficiently</li><li>Flexibility to adapt to changing priorities and tasks</li><li>Understanding of office etiquette and professionalism<br/><br/></li></ul>For more information about this role or Pieces of HR, please visit www.piecesofhr.com.<br/><br/>Skills: office equipment maintenance,phone systems,fast-paced environment,computer skills,professionalism,office etiquette,organization,task management,confidentiality,communication,interpersonal skills,bookkeeping,organizational skills,multitasking,administrative,microsoft office,customer service", "responsibilities": "The Receptionist plays a crucial role as the first point of contact for our clients organization. This individual is responsible for creating a positive first impression for all visitors and providing exceptional customer service. The Receptionist also manages various administrative tasks and supports the overall functionality of the office.", "qualifications": {"required": "College degree preferred, Prior experience in a customer service or administrative role, Proficiency in Microsoft Office (Word, Excel, Outlook), Excellent communication and interpersonal skills, Strong organizational and multitasking abilities, Ability to maintain a professional and courteous demeanor at all times, Basic bookkeeping skills and familiarity with office equipment, Ability to handle confidential information with discretion, Strong attention to detail and accuracy, Ability to work effectively in a fast-paced environment, Knowledge of multi-line phone systems, Ability to prioritize and manage tasks efficiently, Flexibility to adapt to changing priorities and tasks, Understanding of office etiquette and professionalism", "preferred": ""}, "skills": ["office equipment maintenance", "phone systems", "fast-paced environment", "computer skills", "professionalism", "office etiquette", "organization", "task management", "confidentiality", "communication", "interpersonal skills", "bookkeeping", "organizational skills", "multitasking", "administrative", "microsoft office", "customer service"], "postedDate": "4 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000251069"}