{"jobTitle": "Regional Sales Manager", "company": {"name": "Terra Sonic International LLC", "industry": "Machinery Manufacturing", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Machinery Manufacturing", "description": "<strong>Job Title:</strong> Regional Sales Manager\n<p><strong>Company:</strong> Terra Sonic International LLC (TSI)</p><p><strong>Location:</strong> Remote (with extensive travel in assigned region)</p><p><br/></p><p><strong>Who We Are:</strong> Terra Sonic International LLC (TSI) is at the forefront of Sonic Drilling Technology, catering to diverse markets such as Minerals, Mining, Environmental, Geothermal, Geotechnical &amp; Geo-Construction, and Water Exploration. We design, engineer, and manufacture cutting-edge Sonic Drill Rigs, Oscillators, Tooling, and Support Equipment, and provide comprehensive training and support for the deployment of our proprietary Sonic Technology.</p><p><br/></p><p><strong>About the Role:</strong> We are seeking an energetic and customer-focused Regional Sales Manager to join our dynamic team. In this role, you will be responsible for identifying and executing sales opportunities to achieve the company’s sales and profit goals. You will manage regional sales channels and drive growth strategies across all products and markets. As the technical subject matter expert, you will engage in customer demonstrations and support the sales process from start to finish.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Achieve sales targets for new products and services.</li><li>Grow TSI’s customer base by selling to both new and existing key/target accounts.</li><li>Travel extensively within your territory to support sales goals and provide exceptional customer support, including on-site presentations, cold calls, and working with representatives and strategic partners.</li><li>Offer technical support to customers with innovative and cost-effective design proposals.</li><li>Utilize Salesforce and other sales tools to manage accounts and identify new opportunities.</li><li>Manage a territory of accounts, serving as the primary contact for prospecting new accounts and developing existing ones. Act as project manager from product selection through order shipment.</li><li>Work from your home office approximately 25% of the time for planning, target marketing, customer satisfaction, and communication.</li><li>Travel in your territory at least 50% of the time, with an estimated 100 overnight stays per year.</li><li>Maintain an aggressive travel schedule to meet sales objectives.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>3+ years of experience in industrial and/or heavy equipment retail sales.</li><li>5+ years of experience in the drilling industry.</li><li>Proficiency in MS Office, Google platform, and Salesforce.</li><li>Ability to travel extensively within your territory and work flexible hours in various environmental conditions.</li><li>Strong interpersonal skills with the ability to communicate effectively and maintain positive relationships with customers and leaders at all levels.</li><li>Proven ability to market products, negotiate terms, and close deals.</li><li>Self-starter with a proactive approach, strategic thinking, and resourcefulness.</li><li>Excellent organizational, time management, and priority-setting skills to manage multiple tasks under tight deadlines.</li><li>Valid driver’s license and ability to meet insurance driving requirements.</li><li>Physical ability to climb in and out of vehicles and equipment used for demonstration purposes.</li></ul><p><br/></p><p><strong>Why Join Us:</strong> At Terra Sonic International, you'll be part of a team that's pioneering innovative drilling technology. We offer a dynamic work environment with opportunities for growth and advancement. If you are a motivated sales professional with a passion for technology and customer satisfaction, we want to hear from you!</p><p><br/></p><p><strong>How to Apply:</strong> Interested candidates should submit their resume and a cover letter outlining their relevant experience and qualifications.</p><p></p>", "responsibilities": "Achieve sales targets for new products and services. Grow TSI’s customer base by selling to both new and existing key/target accounts. Travel extensively within your territory to support sales goals and provide exceptional customer support, including on-site presentations, cold calls, and working with representatives and strategic partners. Offer technical support to customers with innovative and cost-effective design proposals. Utilize Salesforce and other sales tools to manage accounts and identify new opportunities. Manage a territory of accounts, serving as the primary contact for prospecting new accounts and developing existing ones. Act as project manager from product selection through order shipment. Work from your home office approximately 25% of the time for planning, target marketing, customer satisfaction, and communication. Travel in your territory at least 50% of the time, with an estimated 100 overnight stays per year. Maintain an aggressive travel schedule to meet sales objectives.", "qualifications": {"required": "3+ years of experience in industrial and/or heavy equipment retail sales. 5+ years of experience in the drilling industry. Proficiency in MS Office, Google platform, and Salesforce. Ability to travel extensively within your territory and work flexible hours in various environmental conditions. Strong interpersonal skills with the ability to communicate effectively and maintain positive relationships with customers and leaders at all levels. Proven ability to market products, negotiate terms, and close deals. Self-starter with a proactive approach, strategic thinking, and resourcefulness. Excellent organizational, time management, and priority-setting skills to manage multiple tasks under tight deadlines. Valid driver’s license and ability to meet insurance driving requirements. Physical ability to climb in and out of vehicles and equipment used for demonstration purposes."}, "skills": ["Sales", "Sales Management", "Business Development", "Customer Service", "Salesforce", "Drilling", "Heavy Equipment", "Technical Support", "Project Management", "Communication", "Interpersonal Skills", "Negotiation", "Time Management", "Organization"], "postedDate": "6 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000804081"}