{"jobTitle": "Commercial Lines Account Manager (REMOTE-Must have California P&C license)", "company": {"name": "Jobot", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Finance and Sales", "industry": "Human Resources Services, Technology, Information and Internet, and Hospitals and Health Care", "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!<br/><br/>Job details<br/><br/>This Jobot Job is hosted by Dana Stark<br/><br/>Are you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.<br/><br/>Salary $90,000 - $100,000 per year<br/><br/><strong>A Bit About Us<br/><br/></strong>We are one of the fastest growing brokers globally.<br/><br/><strong><br/><br/><strong>Why join us?<br/><br/><br/></strong></strong>We have been in business for over 20 years and are growing like crazy!<br/><br/><strong>Job Details<br/><br/></strong>Are you a dynamic, self-motivated professional with a passion for commercial insurance? Do you thrive on building lasting relationships and delivering superior client service? If so, you might be the perfect fit for our Commercial Lines Account Manager position. This role is a remote work for optimum flexibility. Our company is a leading insurance broker, and we are looking for an experienced commercial lines expert to join our team. You will be responsible for managing and nurturing our commercial lines portfolio, ensuring our clients receive top-notch service and support.<br/><br/><strong>Responsibilities<br/><br/></strong>As a Commercial Lines Account Manager, your primary duties will include<br/><br/><ul><li> Managing and growing a general book of commercial lines business, ensuring client satisfaction and retention.</li><li> Developing and maintaining strong relationships with clients, understanding their unique needs, and providing tailored insurance solutions.</li><li> Collaborating with underwriters and brokers to negotiate policy terms, rates, and coverage.</li><li> Reviewing policy documents for accuracy and completeness, and resolving any discrepancies or issues.</li><li> Providing prompt, accurate, and friendly customer service, including responding to inquiries, processing policy changes, and resolving claims or billing issues.</li><li> Staying current on industry trends, regulations, and product offerings to provide informed, expert advice to clients.</li><li> Participating in ongoing professional development and training opportunities to continually enhance your insurance knowledge and skills.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>To be considered for the Commercial Lines Account Manager position, you will need<br/><br/><ul><li> A minimum of 3 years of experience in commercial lines insurance, preferably in an account management or client service role.</li><li> A strong understanding of commercial insurance products, terms, and coverages.</li><li> Exceptional customer service skills, with the ability to build and maintain strong client relationships.</li><li> Excellent communication and interpersonal skills, with the ability to effectively communicate complex insurance concepts to clients.</li><li> Strong negotiation skills, with the ability to work effectively with underwriters and brokers to secure the best terms for clients.</li><li> Proficiency in insurance management systems and Microsoft Office Suite.</li><li> A proactive, problem-solving mindset, with the ability to quickly and effectively resolve client issues.</li><li> A commitment to ongoing professional development and learning in the insurance field.</li><li> A current insurance license, or the ability to obtain one within a specified timeframe.<br/><br/></li></ul>If you are a driven, detail-oriented professional with a passion for commercial insurance, we want to hear from you. Apply today and take the next step in your insurance career with our dynamic, growing company.<br/><br/>Interested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.<br/><br/><strong>Want to learn more about this role and Jobot?<br/><br/></strong>Click our Jobot logo and follow our LinkedIn page!<br/><br/>", "responsibilities": "As a Commercial Lines Account Manager, your primary duties will include<br/><br/><ul><li> Managing and growing a general book of commercial lines business, ensuring client satisfaction and retention.</li><li> Developing and maintaining strong relationships with clients, understanding their unique needs, and providing tailored insurance solutions.</li><li> Collaborating with underwriters and brokers to negotiate policy terms, rates, and coverage.</li><li> Reviewing policy documents for accuracy and completeness, and resolving any discrepancies or issues.</li><li> Providing prompt, accurate, and friendly customer service, including responding to inquiries, processing policy changes, and resolving claims or billing issues.</li><li> Staying current on industry trends, regulations, and product offerings to provide informed, expert advice to clients.</li><li> Participating in ongoing professional development and training opportunities to continually enhance your insurance knowledge and skills.<br/><br/></li></ul>", "qualifications": {"required": "A minimum of 3 years of experience in commercial lines insurance, preferably in an account management or client service role., A strong understanding of commercial insurance products, terms, and coverages., Exceptional customer service skills, with the ability to build and maintain strong client relationships., Excellent communication and interpersonal skills, with the ability to effectively communicate complex insurance concepts to clients., Strong negotiation skills, with the ability to work effectively with underwriters and brokers to secure the best terms for clients., Proficiency in insurance management systems and Microsoft Office Suite., A proactive, problem-solving mindset, with the ability to quickly and effectively resolve client issues., A commitment to ongoing professional development and learning in the insurance field., A current insurance license, or the ability to obtain one within a specified timeframe.<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "5 days ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000736825"}