{"jobTitle": "Executive Assistant I, Amazon", "company": {"name": "Amazon", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "50,000.00/year - 107,100.00/year", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Software Development", "description": "Amazon Advertising is on the lookout for exceptional Executive Assistants who are eager to work on a fast-paced and growing team, within a constantly evolving industry. These roles can support multiple leaders and will require an individual with flexibility, strong business acumen, superior attention to detail, desire to learn, and a sense of humor.<br/><br/>These positions require high attention to detail, solid organizational skills, and the ability to meet tight deadlines while juggling multiple critical requests across global teams while working closely with other Executive Assistants throughout the organization. The individual in these roles must understand business priorities, demonstrate the ability to proactively anticipate needs and drive improvements.<br/><br/>The successful candidate will possess the ability to complete complex tasks quickly with little to no guidance, react with appropriate urgency to situations that require a quick turnaround, and take effective action without having the whole picture. We are looking for someone motivated, with a proven history of high performance and the ability to operate effectively under pressure. The ideal candidate is confident, enthusiastic, resourceful, tech-savvy, forward-thinking, self-motivated, and a creative problem solver. They are not content with the status quo and aim to invent and simplify processes and programs, seeking out areas of improvement and solutions. A relentless bias for action and effective communication at all levels is a must. This person will have a high level of integrity and discretion in handling confidential information and professionalism in dealing with senior executives internal and external to Amazon.<br/><br/>These positions will work closely with a team of Executive Assistants to facilitate key team activities and projects. The ability to work independently and collaboratively with a strong sense of ownership, bias for action, and customer obsession is highly valued. These roles require three or more days a week working from the assigned office.<br/><br/>Key job responsibilities<br/><br/><ul><li> Managing fluid calendar requests, meeting invites, conference room logistics, and floor access</li><li> Planning travel and all related accommodations including lodging, transportation, visa processing and building access.</li><li> Improving morale, helping recognize outstanding efforts, having fun at work, and encouraging others to do the same</li><li> Attending key meetings, tracking and helping drive completion of key deliverables, and following up on outstanding items</li><li> Driving team activities (e.g., staff meeting agendas, weekly business reviews, All Hands events, snacks and supply ordering, team-building events, launch events and recognition posters)</li><li> Updating team organizational charts</li><li> Managing workflows that require approvals</li><li> Processing expense reports</li><li> Managing large event logistics, catering, accommodations, and support materials (e.g., business writing courses, All Hands events, etc.)</li><li> Acting as Space Administrator for the team, responsible for space planning, coordination and execution of office moves<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li> 2+ years of professional or military experience</li><li> Experience with executive level calendar management</li><li> Experience with domestic or international travel coordination</li><li> Experience with Microsoft Office products and applications<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li> Experience in a fast-paced, high-tech company</li><li> Experience managing multiple calendars<br/><br/></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br/><br/>Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $50,000/year in our lowest geographic market up to $107,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.<br/><br/><br/><strong>Company</strong> - Amazon.com Services LLC<br/><br/>Job ID: A2730769", "responsibilities": "Managing fluid calendar requests, meeting invites, conference room logistics, and floor access\nPlanning travel and all related accommodations including lodging, transportation, visa processing and building access.\nImproving morale, helping recognize outstanding efforts, having fun at work, and encouraging others to do the same\nAttending key meetings, tracking and helping drive completion of key deliverables, and following up on outstanding items\nDriving team activities (e.g., staff meeting agendas, weekly business reviews, All Hands events, snacks and supply ordering, team-building events, launch events and recognition posters)\nUpdating team organizational charts\nManaging workflows that require approvals\nProcessing expense reports\nManaging large event logistics, catering, accommodations, and support materials (e.g., business writing courses, All Hands events, etc.)\nActing as Space Administrator for the team, responsible for space planning, coordination and execution of office moves", "qualifications": {"required": "2+ years of professional or military experience\nExperience with executive level calendar management\nExperience with domestic or international travel coordination\nExperience with Microsoft Office products and applications", "preferred": "Experience in a fast-paced, high-tech company\nExperience managing multiple calendars"}, "skills": ["Calendar Management", "Travel Coordination", "Microsoft Office", "Event Management", "Space Planning"], "postedDate": "1 week ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000323768"}