{"jobTitle": "Systems Engineer", "company": {"name": "Canvas, Inc.", "location": "Niceville, FL"}, "location": "Niceville, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing", "description": "<strong>Job Title: </strong>Systems Engineer - VENOM<br/><br/><strong>Location</strong>: Eglin AFB, FL (On-Site)<br/><br/>Canvas provides engineering services and technical solutions for customers in federal and commercial markets. We are recognized by our customers and industry partners for our ethical standards, world-class technical expertise, and dedication to accomplish the mission in a responsive, efficient, and affordable manner.<br/><br/><strong>Duties<br/><br/></strong><ul><li>Act as lead point of contact for customer requirements on behalf of the organization and coordinate with program engineers and SMEs for information and collaboration. </li><li>Gather requirements from the customer and the organization regarding integrating the systems under test. </li><li>Work with other engineers and subject matter experts (SMEs), of multiple disciplines, to meet the customer's and organizations requirements for mission support. </li><li>Coordination and control of meetings with any/all pertinent stakeholders. </li><li>Communicate program status and schedule to unit leadership and customers. </li><li>Understand the overall project requirements to facilitate and program deliverables, documents, briefings, and translate requirements to associated tasks.</li><li>Contribute to software project planning activities by translating business requirements, specifications, and system user needs into usable and software and data products.<br/><br/></li></ul><strong>Requirements</strong> <br/><br/><ul><li>Must have a Bachelor's degree (Computer Science or related field); Mater's degree desired.</li><li>Minimum of 3 years of progressive, relevant experience.</li><li>Understand large scale networking systems and data transport between organizations, facilities and/or familiarity with IP based network infrastructure.</li><li>Be familiarity with networking and integration of software in Live, Virtual, Constructive (LVC) environments.</li><li>Understand time, space, position information (TSPI), and telemetry data.</li><li>Have familiarity with Authorities to Operate (ATO).</li><li>Understand system networking and systems of systems.</li><li>Must have excellent verbal and written communication skills along with customer interaction and presentation capability.</li><li>The ability to work alone, individually, and without supervision, and provide timely update on progress to customer and test team leadership.</li><li>Multidisciplinary background in the design and integration of a complex systems with application of systems engineering, project management for IT, and knowledge of cyber security and network integration desired.</li><li>Experience in the following desired:</li><ul><li>DoD Test and Systems integration</li><li>Security controls, cybersecurity understanding</li></ul><li>PMP Certification desired.<br/></li></ul><strong>Security Clearance: </strong>Must have and be able to maintain a Secret security clearance.<br/><br/><strong>About Us<br/><br/></strong>Founded in 2007, Canvas connects a passion for going beyond the expected with the knowledge and expertise to deliver what our clients need now and in the future. Canvas has been recognized as a Great Place to Work Certified ™, Fortune Best Small Workplace ™, Fortune Best Workplace for Millennials ™ (2022), Best Place for Working Parents (2022 &amp; 2023), HIRE Vets Gold Medallion Awardee (2021 &amp; 2022), Best Places to Work Awardee, 2019 Government Contracting - Technology Business of the Year, and Woman-Owned Small Business of the Year (2018) by the Huntsville/Madison Chamber of Commerce.<br/><br/><strong>Benefits Of Working With Canvas<br/><br/></strong>To reflect our company culture, Canvas offers an exciting array of benefits that makes up our employees' total rewards package. Those benefits may include:<br/><br/><ul><li>Competitive Wages*</li><li>Medical, Rx, Dental &amp; Vision Insurance</li><li>Generous company-funded Basic Life Insurance</li><li>Company-funded Short-Term &amp; Long-Term Disability</li><li>11 Paid Federal Holidays</li><li>Generous Paid Time Off (PTO)</li><li>Dependent Care and Medical Flexible Spending Accounts</li><li>401(k) retirement plan with company match and 100% immediate vesting</li><li>Tuition Reimbursement for ongoing training, continuing education, or advanced degree programs</li><li>Robust Employee Assistance Program</li><li>Employee Referral Bonus Program</li><li>Corporate Sponsored Events &amp; Community Outreach</li><li>Spot Awards for exemplary individual performance</li><li>Discretionary performance-based bonuses</li><li>And many more!</li><li>Final compensation for this position is determined by a variety of factors, such as a candidate's relevant work experience, skills, certifications, and geographic location.<br/><br/></li></ul><strong>Canvas is an Equal Opportunity Employer<br/><br/></strong>Canvas is an equal opportunity employer and a VEVRAA federal contractor who affords equal employment opportunity to protected veterans and people with disabilities.<br/><br/>Canvas has equal employment opportunities that are based upon a candidate's qualifications and capabilities to perform the essential functions of a particular job and are free from discrimination based on race, color, religion, national origin, sex, sexual orientation, gender identity, age, disability, protected veteran status, genetic information, or any other characteristic protected by law. For our complete EEO/AA and Pay Transparency statement, please visit our Careers page. U.S. citizenship is required for most positions.<br/><br/>Canvas is committed to expanding access to employment for people with disabilities and disabled veterans. If you are a qualified individual with a disability or a disabled veteran, and your disability prevents you from applying, please advise what reasonable accommodation Canvas can provide to assist you in applying for one of our open positions. You may contact us by sending an email to talent@canvas-inc.com.<br/><br/>Reasonable accommodations are considered on a case-by-case basis. Please note that only those inquiries concerning a request for reasonable accommodation for applying for a specific posted position will be responded to. Requests will be kept confidential and shared strictly on a need-to-know basis. Please be aware, scammers may try to impersonate our company by reaching out regarding job opportunities. We will never ask you for bank account information, checks, or other sensitive information as part of our hiring process. If you're unsure, please email talent@canvas-inc.com with questions.<br/><br/>For further information on Canvas including more information on employee benefits and our company culture, visit our website.<br/><br/><em>If an offer of employment is extended, applicant must have the ability to pass a background check. Offer of Employment is contingent upon the results.</em>", "responsibilities": "Duties<br/><br/>", "qualifications": {"required": "Must have a Bachelor's degree (Computer Science or related field); Mater's degree desired.\nMinimum of 3 years of progressive, relevant experience.\nUnderstand large scale networking systems and data transport between organizations, facilities and/or familiarity with IP based network infrastructure.\nBe familiarity with networking and integration of software in Live, Virtual, Constructive (LVC) environments.\nUnderstand time, space, position information (TSPI), and telemetry data.\nHave familiarity with Authorities to Operate (ATO).\nUnderstand system networking and systems of systems.\nMust have excellent verbal and written communication skills along with customer interaction and presentation capability.\nThe ability to work alone, individually, and without supervision, and provide timely update on progress to customer and test team leadership.\nMultidisciplinary background in the design and integration of a complex systems with application of systems engineering, project management for IT, and knowledge of cyber security and network integration desired.\nExperience in the following desired:\nDoD Test and Systems integration\nSecurity controls, cybersecurity understanding\nPMP Certification desired.", "preferred": ""}, "skills": ["Systems Engineering", "Project Management", "Cyber Security", "Network Integration", "DoD Test", "Systems Integration", "Security Controls", "Cybersecurity"], "postedDate": "5 days ago", "benefits": "To reflect our company culture, Canvas offers an exciting array of benefits that makes up our employees' total rewards package. Those benefits may include:\nCompetitive Wages*\nMedical, Rx, Dental &amp; Vision Insurance\nGenerous company-funded Basic Life Insurance\nCompany-funded Short-Term &amp; Long-Term Disability\n11 Paid Federal Holidays\nGenerous Paid Time Off (PTO)\nDependent Care and Medical Flexible Spending Accounts\n401(k) retirement plan with company match and 100% immediate vesting\nTuition Reimbursement for ongoing training, continuing education, or advanced degree programs\nRobust Employee Assistance Program\nEmployee Referral Bonus Program\nCorporate Sponsored Events &amp; Community Outreach\nSpot Awards for exemplary individual performance\nDiscretionary performance-based bonuses\nAnd many more!\nFinal compensation for this position is determined by a variety of factors, such as a candidate's relevant work experience, skills, certifications, and geographic location.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4000494727"}