{"jobTitle": "Manager, Sales Engineering", "company": {"name": "Affirm", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.<br/><br/>As a Manager of Sales Engineering, you’ll combine your People Come First management experience, outstanding communication skills, and creative problem solving to support implementation of the Affirm solution with our growing network of enterprise merchant partners. You will grow and develop a group of talented Sales Engineers, and collectively ensure that prospective clients can understand and integrate our products simply and effectively. You will lead by example, and help with pre-sale activities, analyze requirements, and identify solutions with the team.<br/><br/>Sales Engineers are a part of the Partner Engineering team and work closely with Affirm’s Revenue, Engineering, and Product teams. You will work cross-functionally to develop novel integration solutions, identify product enhancements, and build internal processes that scale.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Lead, mentor and grow a team of passionate Sales Engineers and Technical Writers </li><li>Collaborate with Affirm’s Engineering, Product, and Revenue teams to develop best-in-class merchant solutions to close new business </li><li>Foster a respectful and supportive environment for all team members that effectively leverages the diversity of the team </li><li>Own Affirm's external developer documentation strategy <br/><br/></li></ul><strong>What We Look For<br/><br/></strong><ul><li>Passion and drive to change consumer banking for the better </li><li>BA/BS degree in business/technology </li><li>4-6+ years working as a sales engineer, solutions engineer, or developer evangelist, and 3 - 4 years managing teams </li><li>World-class communicator with excellent instincts for empathetic messaging </li><li>Keen technical mind comfortable writing scripts in at least one programming language </li><li>Proven track record of managing multiple teams simultaneously, and effectively crafting custom performance management standards for each discrete function <br/><br/></li></ul><strong>Base Pay Grade</strong> - M<br/><br/><strong>Equity Grade</strong> - 8<br/><br/>Employees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.<br/><br/>Base pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)<br/><br/>For sales roles, the range provided is the role’s On Target Earnings (“OTE”) range, which includes the annual base pay and the sales incentive target.<br/><br/>USA On Target Earnings (CA, WA, NY, NJ, CT) per year: $225,000 - $287,500<br/><br/>USA On Target Earnings (all other U.S. states) per year: $200,000 - $262,500<br/><br/>Please note that visa sponsorship is not available for this position.<br/><br/>Affirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.<br/><br/><strong>Benefits<br/><br/></strong>We’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:<br/><br/><ul><li>Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents </li><li>Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses</li><li>Time off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge</li><li>ESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount<br/><br/></li></ul>We believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.<br/><br/>[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.<br/><br/>By clicking \"Submit Application,\" you acknowledge that you have read the Affirm Employment Privacy Policy for applicants within the United States, the EU Employee Notice Regarding Use of Personal Data (Poland) for applicants applying from Poland, the EU Employee Notice Regarding Use of Personal Data (Spain) for applicants applying from Spain, or the Affirm U.K. Limited Employee Notice Regarding Use of Personal Data for applicants applying from the United Kingdom, and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.<br/><br/>", "postedDate": "3 days ago", "skills": ["Sales Engineering", "Technical Writing", "Communication", "Empathetic Messaging", "Scripting", "Programming Languages", "Team Management", "Performance Management", "Consumer Banking", "Business/Technology", "Developer Evangelism", "Solutions Engineering"], "benefits": "We’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:<br/><br/><ul><li>Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents </li><li>Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses</li><li>Time off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge</li><li>ESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4000275716"}