{"jobTitle": "Product Manager", "company": {"name": "EV.com", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Sales, and Product Management", "industry": "Technology, Information and Internet, Internet Marketplace Platforms, and Technology, Information and Media", "description": "EV.com is a pioneering electric vehicle (EV) marketplace with a mission to promote zero-emission mobility. We offer a comprehensive platform for consumers to explore, compare, and purchase electric vehicles. Our efforts are focused on educating about charging infrastructure, incentives, rebates, and other aspects of EV ownership to facilitate the adoption of sustainable transportation solutions.\n\nRole Overview:\nAs a Product Manager, you will play a critical role in defining and driving the vision, strategy, and roadmap for our products. You will collaborate closely with cross-functional teams to ensure that our product offerings meet market needs and deliver exceptional value to our customers.\n\nKey Responsibilities:\n- Conduct detailed market research to understand consumer preferences and identify opportunities for product innovation and improvement.\n- Work closely with the development team to define product requirements and ensure timely and high-quality product releases.\n- Create and maintain a comprehensive product roadmap that aligns with our strategic goals and customer needs.\n- Oversee product lifecycle management from ideation to launch, including feature prioritization, release planning, and go-to-market strategies.\n\nQualifications:\n- Bachelor’s degree or equivalent experience in a related field.\n- At least 4 years of experience in product management.\n- Strong skills in verbal and written communication, as well as presentation abilities.\n- Proven ability to lead cross-functional teams and manage complex projects.\n\nWhy Join EV.com?\n- Competitive salary and stock options from our US-based parent company.\n- Fully paid Medical, Dental, and Vision Benefits.\n- Flexible work arrangements with a Remote/Hybrid First Policy.\n- Opportunity to collaborate with industry leaders and innovative thinkers.\n- Continuous mentorship and support for career development.\n- A chance to play a key role in the evolution of EV retail.\n\nApplication Note:\nAt EV.com, we recognize that not all candidates will meet every qualification. We value passion, diverse backgrounds, and a commitment to learning. If you're driven and believe in our mission but don't meet every requirement, we still encourage you to apply. We offer a competitive total compensation package that is customized to your skills, experiences, and location. This may include equity, sign-on bonuses, and other forms of compensation, in addition to our comprehensive benefits package.\n\nJoin Our Team:\nBe a part of a dynamic team leading the charge in transforming the EV retail landscape at EV.com!", "postedDate": "2 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001025300"}