{"jobTitle": "Director of North America Marketing", "company": {"name": "Udemy", "location": "Austin, TX", "industry": "E-Learning Providers"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$150,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "E-Learning Providers", "description": "About Us\n\nAt Udemy, we’re on a mission to transform lives through learning. Through our intelligent skills platform and a global community of instructors, we’ve helped over 70 million learners and 16,000 organizations achieve their goals. Come join us in ensuring everyone, everywhere has access to the skills they need to unlock their potential and create possibilities for themselves and others.\n\n<em><strong>This hybrid position requires two days per week in our Denver, CO or Austin, TX office.\n\n</strong></em>About This Role\n\nWe are seeking a strategic and results-driven Head of North America Marketing to lead our regional marketing efforts. This role will be responsible for developing and executing regional marketing strategies that drive demand generation, customer engagement, and revenue growth across North America. The ideal candidate will have a strong background in B2B SaaS marketing, exceptional leadership skills, and an understanding of how to tailor marketing plans for different sales segments from SMB to Enterprise. **Travel:** Willingness to travel as needed to support field marketing activities and events (up to 20%).\n\nWhat you'll be doing\n\n<ul><li>Strategy Development: Partner with sales and marketing peers to develop and implement a comprehensive marketing strategy aligned with the company’s overall marketing and sales objectives. Focus on driving awareness, demand generation, and customer retention across North America. </li><li>Campaign Management: Design, execute, and optimize multi-channel marketing campaigns, including events, webinars, email marketing, and account-based marketing (ABM) initiatives. Ensure campaigns are data-driven and targeted to achieve maximum impact leveraging teams across marketing to execute and deliver. </li><li>Team Leadership: Develop a small team of field marketing professionals. Foster a collaborative and high-performance culture, encouraging professional growth and development within the team and showing ROI to grow the team over time. </li><li>Sales Collaboration: Partner closely with the sales and customer success teams to align marketing activities with sales goals. Develop and maintain strong relationships with sales and customer success leaders to ensure effective lead handoff and follow-up.</li><li>Event Management: Plan and execute regional events, including trade shows, conferences, and user groups. Ensure events are well-organized and deliver a high return on investment (ROI).</li><li>Performance Measurement: Track and analyze key performance metrics for all regional marketing activities. Provide regular reports and insights to senior management, highlighting successes, areas for improvement, and recommendations for future strategies.</li><li>Budget Management: Develop and manage the regional marketing budget and work with team and peers to ensure effective allocation of resources to maximize ROI and achieve business objectives.<br/><br/></li></ul>What you'll have\n\nWhile this work is based more on the skills a person has than what they have done, we think a typical profile could include the following:\n\nAbout Your Skills\n\n<ul><li>Strong strategic thinking and problem-solving skills.</li><li>Excellent communication and interpersonal skills.</li><li>Proven track record of developing and executing successful marketing campaigns.</li><li>Proficiency in marketing automation platforms (e.g., Marketo, 6sense) and CRM systems (e.g., Salesforce).</li><li>Strong analytical skills and experience with data-driven decision-making.</li><li>Leadership: Demonstrated ability to lead, mentor, and inspire a high-performing team. Ability to work effectively in a matrixed marketing organization and partner with peers across sales and marketing to deliver outcomes.<br/><br/></li></ul>About Your Experience\n\n<ul><li>Minimum of 10 + years of experience in B2B marketing, with at least 3 years in a leadership role. </li><li>Experience in the B2B SaaS and/or education sector is highly preferred.</li><li>Experience in SaaS </li><li>Experience in growth companies and within scaling teams <br/><br/></li></ul>We understand that not everyone will match each of the above qualifications. However, we also realize that everyone has unique experiences that can add value to our company. Even if you think your background might not perfectly align, we'd love to hear from you!\n\nLife at Udemy\n\nWe aspire to be as vibrant and dynamic as the communities we serve, as inquisitive as those who use our platform, and as revolutionary as the future we strive to open for everyone. Here are some of the things we love about life at Udemy:\n\n<ul><li>We’re invested in creating an inclusive environment that welcomes a diverse range of backgrounds and experiences. From creating employee resource groups, ensuring we’re a Fair Pay Workplace, and building a flexible work culture, our belonging, equity, diversity, and inclusion (BEDI) initiatives always put our people first. We want you to be able to bring your authentic self to work because when we all do, we’re better for it. </li><li>Learning is what we do – inside and out. Our Learning &amp; Development team is second to none, helping ensure your journey is one of continuous progression. You’ll also have unlimited access to Udemy courses, monthly UDays (meeting-free professional development days), and a generous annual professional development stipend.</li><li>Our reason to exist is to revolutionize learning – that calls for taking risks and learning from failures. Whether it’s our hackathons (a company-wide effort to envision new possibilities for our product) or sharing our prototypes, we see experimentation as a crucial step on the path to success.</li><li>We’re committed to creating world-class employee experiences and are proud of the recognition of this by Great Place to Work. <br/><br/></li></ul>Of course, the best thing about being part of Udemy is knowing your work makes a difference for people and organizations around the world. You’ve got the skills; why not use them to help others develop theirs?\n\nAt Udemy, we value diversity and inclusion and consider qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition, or disability. We will consider for employment qualified applicants with arrest and conviction records.\n\nOur Benefits Start With U\n\nOur benefits package at Udemy “starts with U” and is grounded in mission-driven benefits that intentionally align with our core values. Here’s a sneak peek at just a few highlighted benefits if you’re a full-time Udemate based in the United States:\n\n<ul><li>Core Benefits: Comprehensive medical, dental, vision, life/AD&amp;D, and disability coverage</li><li>HSA/FSA/Commuter: Pre-tax savings/spending plans, including HSA employer contributions</li><li>Transgender Benefits: Expanded medical coverage for gender-affirming care</li><li>Parental Benefits: Financial assistance for fertility (including egg-freezing), adoption, and surrogacy expenses; twelve weeks of paid family bonding for birth, surrogacy, adoption, and foster placement (plus up to six to ten weeks of paid disability leave for birthing parents) as well as a two-week “ease-back” program that enables parents to return part-time at full pay</li><li>Whole U: Fully paid memberships for meditation/mindfulness, therapy/coaching visits, financial planning, virtual family care, reproductive health, breastmilk shipping, and caregiving support</li><li>Learning: Free access to Udemy and Udemy Business plus a yearly stipend to spend on professional development</li><li>Retirement: Pre-tax and Roth 401(k) plan with an employer contribution</li><li>Charitable Giving: Corporate charitable match for eligible nonprofits and charities</li><li>Vacation: Flexible vacation for salaried Udemates and fifteen days per year for hourly</li><li>Holidays: Twelve paid holidays throughout the year<br/><br/></li></ul><strong><em>Information regarding data privacy is available within the</em><em> Udemy Careers Privacy Notice</em><em>.<br/><br/></em></strong>At Udemy, we strive to be transparent around compensation. Actual compensation for this role is based on several factors, including but not limited to job-related skills, qualifications, experience, and specific work location due to differences in the cost of labor. In addition to a base salary, this role is also eligible for benefits, equity and a bonus.\n\nHiring Compensation Range\n\n$150,000—$200,000 USD", "responsibilities": "Strategy Development: Partner with sales and marketing peers to develop and implement a comprehensive marketing strategy aligned with the company’s overall marketing and sales objectives. Focus on driving awareness, demand generation, and customer retention across North America. \nCampaign Management: Design, execute, and optimize multi-channel marketing campaigns, including events, webinars, email marketing, and account-based marketing (ABM) initiatives. Ensure campaigns are data-driven and targeted to achieve maximum impact leveraging teams across marketing to execute and deliver. \nTeam Leadership: Develop a small team of field marketing professionals. Foster a collaborative and high-performance culture, encouraging professional growth and development within the team and showing ROI to grow the team over time. \nSales Collaboration: Partner closely with the sales and customer success teams to align marketing activities with sales goals. Develop and maintain strong relationships with sales and customer success leaders to ensure effective lead handoff and follow-up.\nEvent Management: Plan and execute regional events, including trade shows, conferences, and user groups. Ensure events are well-organized and deliver a high return on investment (ROI).\nPerformance Measurement: Track and analyze key performance metrics for all regional marketing activities. Provide regular reports and insights to senior management, highlighting successes, areas for improvement, and recommendations for future strategies.\nBudget Management: Develop and manage the regional marketing budget and work with team and peers to ensure effective allocation of resources to maximize ROI and achieve business objectives.", "qualifications": {"required": "Strong strategic thinking and problem-solving skills.\nExcellent communication and interpersonal skills.\nProven track record of developing and executing successful marketing campaigns.\nProficiency in marketing automation platforms (e.g., Marketo, 6sense) and CRM systems (e.g., Salesforce).\nStrong analytical skills and experience with data-driven decision-making.\nLeadership: Demonstrated ability to lead, mentor, and inspire a high-performing team. Ability to work effectively in a matrixed marketing organization and partner with peers across sales and marketing to deliver outcomes.", "preferred": "Minimum of 10 + years of experience in B2B marketing, with at least 3 years in a leadership role. \nExperience in the B2B SaaS and/or education sector is highly preferred.\nExperience in SaaS \nExperience in growth companies and within scaling teams"}, "skills": ["Marketing", "Sales", "Strategy", "Leadership", "Campaign Management", "Team Leadership", "Sales Collaboration", "Event Management", "Performance Measurement", "Budget Management", "B2B Marketing", "SaaS Marketing", "Marketing Automation", "CRM", "Data Analysis", "Data-Driven Decision Making"], "postedDate": "6 days ago", "benefits": "Core Benefits: Comprehensive medical, dental, vision, life/AD&D, and disability coverage\nHSA/FSA/Commuter: Pre-tax savings/spending plans, including HSA employer contributions\nTransgender Benefits: Expanded medical coverage for gender-affirming care\nParental Benefits: Financial assistance for fertility (including egg-freezing), adoption, and surrogacy expenses; twelve weeks of paid family bonding for birth, surrogacy, adoption, and foster placement (plus up to six to ten weeks of paid disability leave for birthing parents) as well as a two-week “ease-back” program that enables parents to return part-time at full pay\nWhole U: Fully paid memberships for meditation/mindfulness, therapy/coaching visits, financial planning, virtual family care, reproductive health, breastmilk shipping, and caregiving support\nLearning: Free access to Udemy and Udemy Business plus a yearly stipend to spend on professional development\nRetirement: Pre-tax and Roth 401(k) plan with an employer contribution\nCharitable Giving: Corporate charitable match for eligible nonprofits and charities\nVacation: Flexible vacation for salaried Udemates and fifteen days per year for hourly\nHolidays: Twelve paid holidays throughout the year", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001767582"}