{"jobTitle": "Product Manager, Webinars", "company": {"name": "Future", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $100,000.00", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet", "description": "The Product Management team is the product, market, and marketing experts across Future's B2B portfolio, which includes SmartBrief, ActualTech, Tech &amp; Learning, AVTech/TVTech, and more. Product Management transforms ideas into products and owns the success of our product line through all stages of its life cycle. Product Managers maintain a solid understanding of the marketplace and align our products to what clients demand today. This is a cross-functional role that connects multiple internal teams, including sales, operations, content, partner development, and tech to enable the company to identify new revenue opportunities and efficiently roll out new products to internal and external customers.<br/><br/><strong>What You'll Be Doing...<br/><br/></strong>This Product Manager role will oversee the webinar product roadmap and lead the evolution of Future B2B's webinar tech stack. This role will conduct an ongoing review of opportunities in the market and manage vendor partnerships. In addition, the Product Manager will regularly communicate product improvements and spearhead the go-to-market strategy for new product launches.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Own the webinar product roadmap and become the internal expert on webinars</li><li>Run product trainings, create and manage documentation, FAQ's, including user guides and specifications</li><li>Deliver quarterly reports around product performance, engagement and enhancements</li><li>Consistently run competitive analysis to ensure product market fit and implement strategies to maintain an edge over competitors</li><li>Develop marketing collateral, including one-pagers, product guides, and other original marketing content needed to generate demand</li><li>Collaborate with the delivery team to detail the execution process to ensure a smooth client experience</li><li>Provide recommendations for product pricing, profitability, and packaging strategy</li><li>Continually monitor the custom content market to ensure packaging and pricing are consistent with market demands<br/><br/></li></ul><strong>Experience That Will Put You Ahead Of The Curve...<br/><br/></strong><ul><li>5-7 years of experience in product marketing, product management or advertising role, preferably at a digital/advertising/publishing company</li><li>Exceptional leadership skills and proven track record working cross-functionally across multiple departments and teams</li><li>Results-driven self-starter who can manage multiple projects simultaneously, while driving measurable results</li><li>Excellent written, verbal and interpersonal skills</li><li>Comfortable presenting ideas to internal and external clients</li><li>Thrives in a team-oriented, entrepreneurial environment<br/><br/></li></ul><strong>What's In It For You...<br/><br/></strong>We have a number of awesome perks available to our staff. We offer huge opportunities to learn and develop, whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues. We have a fantastic culture where we really do care about our people and want everyone to succeed. Varied roles mean you're not pigeonholed into one finite area but get the opportunity to develop a wide range of skills and experience.<br/><br/>Additional benefits include 401k match and health Insurance; ranging from medical to dental and even vision care.<br/><br/>And to top it all off, not only do we offer unlimited holiday because we trust you to manage your workload and time but we also offer a share in our success whereby every colleague is eligible to join our profit pool bonus scheme - if Future hits their performance targets all colleagues may receive a bonus.<br/><br/><strong>Internal job family C5<br/><br/></strong><strong>Please note, the salary range for this position is $90,000 - $100,000<br/><br/></strong><strong>This is a Remote based role. Future US is currently eligible to hire in 34 states</strong> - Alabama, Arizona, California, Colorado, Connecticut, District of Columbia, Florida, Georgia, Illinois, Indiana, Iowa, Kansas, Maryland, Massachusetts, Michigan, Minnesota, Missouri, Nebraska, New Hampshire, New Jersey, New York, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, South Carolina, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Kentucky.<br/><br/><strong>Who Are We...<br/><br/></strong>We're Future. We're 3000+ colleagues over 250+ brands speaking to 400 million people every month across the globe through websites, events and magazines. We've got ambitious plans that build on our growth momentum and unlock new opportunities and we're looking for talented people who want to be a part of it.<br/><br/><strong>Our Future, Our Responsibility - Inclusion and Diversity at Future<br/><br/></strong>We have a voice and we're going to use it. We promote diversity and inclusion not just in our recruitment processes, but everything we do. We're an equal opportunity employer and we will continue to ensure our recruitment process is free of bias and our workplaces are inclusive, positive, free of discrimination and respecting of all backgrounds and beliefs. Our culture is underpinned by our values and employees - current and future - are treated with respect and fairness.<br/><br/><strong>Please let us know if you need any reasonable adjustments made so we can give you the best experience!<br/><br/></strong>Find out more about Our Future, Our Responsibility on our website.<br/><br/>", "responsibilities": "Own the webinar product roadmap and become the internal expert on webinars\nRun product trainings, create and manage documentation, FAQ's, including user guides and specifications\nDeliver quarterly reports around product performance, engagement and enhancements\nConsistently run competitive analysis to ensure product market fit and implement strategies to maintain an edge over competitors\nDevelop marketing collateral, including one-pagers, product guides, and other original marketing content needed to generate demand\nCollaborate with the delivery team to detail the execution process to ensure a smooth client experience\nProvide recommendations for product pricing, profitability, and packaging strategy\nContinually monitor the custom content market to ensure packaging and pricing are consistent with market demands", "qualifications": {"required": "5-7 years of experience in product marketing, product management or advertising role, preferably at a digital/advertising/publishing company\nExceptional leadership skills and proven track record working cross-functionally across multiple departments and teams\nResults-driven self-starter who can manage multiple projects simultaneously, while driving measurable results\nExcellent written, verbal and interpersonal skills\nComfortable presenting ideas to internal and external clients\nThrives in a team-oriented, entrepreneurial environment"}, "skills": ["Product Management", "Marketing", "Digital Marketing", "Product Marketing", "Advertising", "Leadership", "Cross-functional", "Project Management", "Communication", "Presentation Skills", "Teamwork", "Entrepreneurship"], "postedDate": "4 days ago", "benefits": "We have a number of awesome perks available to our staff. We offer huge opportunities to learn and develop, whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues. We have a fantastic culture where we really do care about our people and want everyone to succeed. Varied roles mean you're not pigeonholed into one finite area but get the opportunity to develop a wide range of skills and experience.<br/><br/>Additional benefits include 401k match and health Insurance; ranging from medical to dental and even vision care.<br/><br/>And to top it all off, not only do we offer unlimited holiday because we trust you to manage your workload and time but we also offer a share in our success whereby every colleague is eligible to join our profit pool bonus scheme - if Future hits their performance targets all colleagues may receive a bonus.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001572643"}