{"jobTitle": "Talent Acquisition Assistant - Temp", "company": {"name": "Fingerpaint Group", "location": "United States"}, "location": "United States", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Advertising Services", "description": "Reset your expectations of a health and wellness agency. From our inception, Fingerpaint has been driven by an unstoppable collective spirit of possibility. It’s that curiosity that’s at the heart of everything we do. From our legendary people-first culture to the hundreds of Fingerpainters who define us, we’ve reimagined what it means to be a healthcare and wellness advertising agency. Here, creativity happens naturally—we attract top talent and give them a space to grow and collaborate.<br/><br/>Fingerpaint Group is seeking a motivated and detail-oriented Entry-Level Recruiting Assistant to join our HR team. This role offers a fantastic opportunity to gain hands-on experience in the recruitment process and develop a foundation for a successful career in talent acquisition.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Maintain the applicant tracking system (ATS) with up-to-date candidate information.</li><li>Schedule and coordinate interviews between candidates and hiring managers, ensuring a smooth and professional process.</li><li>Serve as a point of contact for candidates, providing updates on their application status and answering any inquiries.</li><li>Help post job descriptions on company websites, job boards, and social media platforms.</li><li>Provide general administrative support to the recruiting team, including managing calendars, organizing documents, and assisting with onboarding tasks.</li><li>Maintain accurate records of recruitment activities in our ATS<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Education: High school diploma or equivalent required; Associate's or Bachelor's degree in Human Resources, Business, or a related field preferred.<br/><br/></li></ul><strong>Skills<br/><br/></strong><ul><li>Strong organizational skills and attention to detail.</li><li>Excellent written and verbal communication skills.</li><li>Proficiency in Microsoft Office Suite (Word, Excel, Outlook).</li><li>Ability to multitask and prioritize in a fast-paced environment.</li><li>A proactive attitude with a willingness to learn and take on new challenges.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Previous experience or internships in human resources, recruiting, or administrative roles.</li><li>Familiarity with applicant tracking systems (ATS) or HR software. <br/><br/></li></ul>Don’t meet every single requirement? That’s okay! Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Fingerpaint, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role but your experience doesn’t align perfectly, we encourage you to apply anyway. You may be just the right candidate for this or other roles! Our team of qualified recruiters can match you with the right opportunity. Fingerpaint Group provides equal employment [and affirmative action] opportunities to all applicants and employees. We are proud to recruit qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, protected veteran status, physical or mental disability, sexual orientation, gender identity, marital status, or citizenship status.", "responsibilities": "Maintain the applicant tracking system (ATS) with up-to-date candidate information. Schedule and coordinate interviews between candidates and hiring managers, ensuring a smooth and professional process. Serve as a point of contact for candidates, providing updates on their application status and answering any inquiries. Help post job descriptions on company websites, job boards, and social media platforms. Provide general administrative support to the recruiting team, including managing calendars, organizing documents, and assisting with onboarding tasks. Maintain accurate records of recruitment activities in our ATS", "qualifications": {"required": "Education: High school diploma or equivalent required; Associate's or Bachelor's degree in Human Resources, Business, or a related field preferred.", "preferred": "Previous experience or internships in human resources, recruiting, or administrative roles. Familiarity with applicant tracking systems (ATS) or HR software."}, "skills": ["ATS", "Microsoft Office Suite", "Communication", "Organization", "Detail-Oriented", "Multitasking", "Prioritization", "Proactive", "Learning", "Challenges"], "postedDate": "3 days ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001910853"}