{"jobTitle": "Executive Assistant", "company": {"name": "iHeartMedia", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$24.80 - $31.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Broadcast Media Production and Distribution", "description": "iHeartMedia<br/><br/>Current employees and contingent workers click here <strong>to apply and search by the Job Posting Title.<br/><br/></strong>The audio revolution is here – and iHeart is leading it! iHeartMedia, <strong>the number one audio company in America</strong>, reaches 90% of Americans every month -- a monthly audience that’s <strong>twice the size of any other audio company </strong>– almost three times the size of the largest TV network – and almost 4 times the size of the largest ad-supported music streaming service. In fact, we have:<br/><br/><ul><li>More #1 rated markets than the next two largest radio companies combined;</li><li>We’re the largest podcast publisher, with more monthly downloads than the second- and third-largest podcast publishers combined. Podcasting, the fastest-growing new media, today has more monthly users than streaming music services or Netflix;</li><li>iHeart is the home of many of the country’s most popular and trusted on-air personalities and podcast influencers, who build important connections with hundreds of communities across America;</li><li>We create and produce some of the most popular and well-known branded live music events in America, including the iHeartRadio Music Festival, the iHeartRadio Music Awards, the iHeartCountry Festival, iHeartRadio Fiesta Latina and the iHeartRadio Jingle Ball Tour;</li><li>iHeartRadio is the #1 streaming radio digital service in America;</li><li>Our social media footprint is 7 times larger than the next largest audio service; and</li><li>We have the only complete audio ad technology stack in the industry for all forms of audio, from on demand to broadcast radio, digital streaming radio and podcasting, which bring data, targeting and attribution to all forms of audio at an unparalleled scale. As a result, we’re able to combine our strong leadership position in audience reach, usage and ad tech with powerful tools and insights for our sales organizations to help them build success for their clients at a more efficient cost than any other option. <br/><br/><br/></li></ul>Because we reach almost every community in America, we’re committed to providing a range of programming that reflects the diversity of the many communities we serve – and our company reflects that same kind of diversity. Our company values stress collaboration, curiosity, welcoming dissent, accepting mistakes in the pursuit of new ideas, and respect for everyone.<br/><br/>Only one company in America has the #1 position in everything audio: iHeartMedia!<br/><br/>If you’re excited about this role but don’t feel your experience aligns perfectly with the job description, we encourage you to apply anyway. At iHeartMedia we are dedicated to building a diverse, inclusive, and authentic workplace and are looking for teammates passionate about what we do!<br/><br/><strong>What We Need:<br/><br/></strong>iHeartMedia is seeking a dynamic Executive Assistant to assist a top-level executive by providing administrative support (mostly calendar and light travel/expenses), frequently involving confidential matters.<br/><br/><strong>What You'll Do:<br/><br/></strong><ul><li>Prepare correspondence, reports, and other administrative tasks, e.g., booking travel and scheduling.</li><li>Screen telephone calls, greet visitors, and respond to general inquiries.</li><li>Schedule appointments, plan meetings, keep phone logs, maintain calendars, coordinate travel arrangements, and process expenses.</li><li>Coordinate events for corporate groups and management meetings.</li><li>Develop and maintain management and reporting systems.</li><li>Handle confidential matters with absolute trustworthiness; ensures interactions and transactions are ethical and convey integrity.</li><li>Anticipate and interprets the needs of management staff without direction.</li><li>Arrange for back-up when not at the desk.<br/><br/><br/></li></ul><strong>What You'll Need:<br/><br/></strong><ul><li>Proficiency in Microsoft Office suite, social media platforms, and search tools Graphic design skills and ability to use Adobe Illustrator and Photoshop a plus</li><li>Trustworthy when dealing with confidential and private matters</li><li>Professionalism: makes a good 1st impression; demonstrates respectful, friendly, and welcoming behavior; exhibits speech, appearance, body language, mannerisms, and dress appropriate to the environment; maintains professional work surroundings</li><li>Proven ability to set the standard of performance excellence for self assumes responsibility &amp; accountability for assignments or tasks, goes beyond what is expected</li><li>Stress tolerance: composure when faced with difficult/demanding situations and/or personalities and shifts in priorities and/or tasks</li><li>Excellent oral and written communication skills, excellent grasp of grammar; actively listens; clearly and effectively conveys information; uses professional telephone skills</li><li>High degree of collaboration with all levels in the organization</li><li>Can work independently without close supervision</li><li>Time management: uses appropriate tools to manage time; focuses on urgent and important tasks; shows strong attention to detail; meets deadlines</li><li>Ability to multi-task in a fast-paced environment</li><li>1-3 years experience as an Executive Assistant</li><li>Media experience preferred<br/><br/><br/></li></ul><strong>What You'll Bring:<br/><br/></strong><ul><li>Respect for others and a strong belief that others should do this in return</li><li>Full proficiency to perform work with limited supervision and to take a broad perspective resolving problems of infrequent/atypical nature</li><li>Comfort acting as a resource for less experienced colleagues</li><li>Commitment to process improvement for overall team effectiveness</li><li>Strong written and verbal communication and ability to explain details and complex information<br/><br/><br/></li></ul><strong>Compensation:<br/><br/></strong>Salary to be determined by multiple factors including but not limited to relevant experience, knowledge, skills, other job-related qualifications, and alignment with market data.<br/><br/>$24.80 - $31.00<br/><br/><strong>Location:<br/><br/></strong>New York, NY: 125 West 55th Street, 10019<br/><br/><strong>Position Type:<br/><br/></strong>Regular<br/><br/><strong>Time Type:<br/><br/></strong>Full time<br/><br/><strong>Pay Type:<br/><br/></strong>Hourly<br/><br/><strong>Benefits:<br/><br/></strong>iHeartMedia’s benefits offering is flexible and offers a variety of choices to meet the diverse needs of our changing workforce, including the following:<br/><br/><ul><li>Employer sponsored medical, dental and vision with a variety of coverage options</li><li>Company provided and supplemental life insurance</li><li>Paid vacation and sick time</li><li>Paid company holidays, including a floating holiday that enable our employees to celebrate the holiday of their choosing</li><li>A Spirit day to encourage and allow our employees to more easily volunteer in their community</li><li>A 401K plan</li><li>Employee Assistance Program (EAP) at no cost – services include telephonic counseling sessions, consultation on legal and financial matters, emotional well-being, family and caregiving</li><li> A range of additional voluntary programs, such as spending accounts, student loan refinancing, accident insurance and more!<br/><br/><br/></li></ul>We are accepting applications for this role on an ongoing basis.<br/><br/>The Company is an equal opportunity employer and will not tolerate discrimination in employment on the basis of race, color, age, sex, sexual orientation, gender identity or expression, religion, disability, ethnicity, national origin, marital status, protected veteran status, genetic information, or any other legally protected classification or status.<br/><br/>Non-Compete will be required for certain positions and as allowed by law.<br/><br/>Our organization participates in E-Verify. Click here to learn about E-Verify.<br/><br/>", "responsibilities": "<ul><li>Prepare correspondence, reports, and other administrative tasks, e.g., booking travel and scheduling.</li><li>Screen telephone calls, greet visitors, and respond to general inquiries.</li><li>Schedule appointments, plan meetings, keep phone logs, maintain calendars, coordinate travel arrangements, and process expenses.</li><li>Coordinate events for corporate groups and management meetings.</li><li>Develop and maintain management and reporting systems.</li><li>Handle confidential matters with absolute trustworthiness; ensures interactions and transactions are ethical and convey integrity.</li><li>Anticipate and interprets the needs of management staff without direction.</li><li>Arrange for back-up when not at the desk.<br/><br/><br/></li></ul>", "qualifications": {"required": "Proficiency in Microsoft Office suite, social media platforms, and search tools Graphic design skills and ability to use Adobe Illustrator and Photoshop a plus\nTrustworthy when dealing with confidential and private matters\nProfessionalism: makes a good 1st impression; demonstrates respectful, friendly, and welcoming behavior; exhibits speech, appearance, body language, mannerisms, and dress appropriate to the environment; maintains professional work surroundings\nProven ability to set the standard of performance excellence for self assumes responsibility &amp; accountability for assignments or tasks, goes beyond what is expected\nStress tolerance: composure when faced with difficult/demanding situations and/or personalities and shifts in priorities and/or tasks\nExcellent oral and written communication skills, excellent grasp of grammar; actively listens; clearly and effectively conveys information; uses professional telephone skills\nHigh degree of collaboration with all levels in the organization\nCan work independently without close supervision\nTime management: uses appropriate tools to manage time; focuses on urgent and important tasks; shows strong attention to detail; meets deadlines\nAbility to multi-task in a fast-paced environment\n1-3 years experience as an Executive Assistant\nMedia experience preferred<br/><br/><br/>", "preferred": null}, "skills": ["Microsoft Office", "Social Media", "Adobe Illustrator", "Adobe Photoshop", "Communication", "Collaboration", "Time Management"], "postedDate": "6 days ago", "applicationDeadline": null, "benefits": "iHeartMedia’s benefits offering is flexible and offers a variety of choices to meet the diverse needs of our changing workforce, including the following:<br/><br/><ul><li>Employer sponsored medical, dental and vision with a variety of coverage options</li><li>Company provided and supplemental life insurance</li><li>Paid vacation and sick time</li><li>Paid company holidays, including a floating holiday that enable our employees to celebrate the holiday of their choosing</li><li>A Spirit day to encourage and allow our employees to more easily volunteer in their community</li><li>A 401K plan</li><li>Employee Assistance Program (EAP) at no cost – services include telephonic counseling sessions, consultation on legal and financial matters, emotional well-being, family and caregiving</li><li> A range of additional voluntary programs, such as spending accounts, student loan refinancing, accident insurance and more!<br/><br/><br/></li></ul>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4001791806"}