{"jobTitle": "Remote Wedding Planner", "company": {"name": "Adventure Awaits Travel", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "A remote wedding and honeymoon travel coordinator plays a pivotal role in ensuring that a couple's destination wedding and honeymoon dreams come to life. Their responsibilities encompass a wide range of tasks, including researching and proposing suitable wedding and honeymoon destinations, meticulously planning travel itineraries, coordinating with local vendors and handling logistical aspects, such as booking flights and accommodations. They guide couples through the often complex process of meeting legal requirements for marrying in a foreign locale and offer expert advice on budget management and travel insurance. Throughout the entire planning process, these coordinators maintain open lines of communication with the couple, manage emergency planning, and handle all the intricate details to create a memorable and seamless experience, both for the wedding day and the honeymoon. Their expertise ensures that couples can focus on celebrating their love while leaving the intricacies of remote destination events in capable hands. Profitable earning potential through a business opportunity with commissions<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Follow a turn-key business model</li><li>Attend regular trainings in order to maintain skill and knowledge of the industry and reach sales goals</li><li>Conduct comprehensive research for sales and marketing</li><li>Organize and coordinate special occasions for customers</li><li>Communicate with customers and provide support as needed</li><li>Answer incoming calls and emails to address customer questions, requests and issues<br/><br/></li></ul>Requirements:<br/><br/><ul><li>1-2 years proven experience in supporting client success</li><li>Excellent written and verbal communication skills</li><li>Ability to address complaints and issues with effective solutions and a positive attitude</li><li>Passion for delighting customers with above and beyond service</li><li>Excellent time-management and prioritization skills<br/><br/></li></ul>Benefits:<br/><br/><ul><li>Full Training Provided</li><li>Flexible Schedule</li><li>No experience necessary</li><li>Travel Perks</li><li>Licensed &amp; Bonded</li><li>Professional Certification</li><li>US, Mexico, Australia Applicants Only<br/><br/></li></ul>Powered by JazzHR<br/><br/>KsbjA6K1d1", "responsibilities": "Follow a turn-key business modelAttend regular trainings in order to maintain skill and knowledge of the industry and reach sales goalsConduct comprehensive research for sales and marketingOrganize and coordinate special occasions for customersCommunicate with customers and provide support as neededAnswer incoming calls and emails to address customer questions, requests and issues", "qualifications": {"required": "1-2 years proven experience in supporting client successExcellent written and verbal communication skillsAbility to address complaints and issues with effective solutions and a positive attitudePassion for delighting customers with above and beyond serviceExcellent time-management and prioritization skills"}, "skills": [], "postedDate": "6 days ago", "benefits": "Full Training ProvidedFlexible ScheduleNo experience necessaryTravel PerksLicensed & BondedProfessional CertificationUS, Mexico, Australia Applicants Only", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001462061"}