{"jobTitle": "EPSDT Coordinator LVN or Social Worker (Must reside in NEVADA)", "company": {"name": "Molina Healthcare", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.60/hr - 46.81/hr", "currency": "USD"}, "jobFunction": "Other", "industry": "Hospitals and Health Care", "description": "This position’s primary responsibility is for tracking and deploying interventions to improve child/adolescent health outcomes. Facilitates members accessing well child visits, immunizations, and awareness of benefits through Early Periodic Diagnostic and Treatment (EPSDT).<br/><br/>Excellent computer skills and attention to detail are very important to multitask between systems, talk with members on the phone, and enter accurate contact notes. Excellent skillset working with EMR's and Microsoft Office.<br/><br/>Home office with internet connectivity of high speed required. You must provide your own home office including desk and chair.<br/><br/>Schedule: Monday thru Friday 8:00AM to 5:00PM PACIFIC<br/><br/>Candidates must live in the state of NEVADA<br/><br/>Job Description<br/><br/>Job Summary<br/><br/>The EPSDT Coordinator oversees all EPSDT activities for the Health Plan and is responsible for identifying gaps in or barriers to care; assisting Members with scheduling transportation to appointments; reviewing EPSDT and HEDIS data to inform targeted interventions to increase utilization of well-child visits, screenings, exams, and associated services; and improving communication and collaboration among Members, Providers, school health services, CBOs, and other program stakeholders.<br/><br/>Knowledge/Skills/Abilities<br/><br/><ul><li>Provide education and outreach initiatives to include:</li><ul><li>Various one-on-one supports such as EPSDT education services, HNAS, and appointment and transportation assistance.</li><li>Community events such as back-to-school fairs and community baby showers, using them as opportunities to educate communities about the importance of preventive healthcare and how to access EPSDT services.</li><li>May use MyHealth Mobile stationed near homeless shelters, food banks, community centers, and public social service offices to improve access to preventive services in diverse communities that struggle with disparities in health outcomes.</li><li>Participate in Molina Days. Promote a healthy lifestyle at events at Provider offices and FQHCs for Members to receive well-child/well-baby exams, vaccinations, and other EPSDT services. The events are also opportunities to educate Members on the importance of healthy eating, physical activity, and preventive care.</li><li>Provides members with a variety of options for accessing preventive services.</li></ul><li>The EPSDT Coordinator identifies Members who are out of compliance with the Bright Futures periodicity schedule.</li><li>Generates lists of Members with open preventive care gaps to prioritize outreach and support quality initiatives for those Members and their PCPs.</li><li>Maintains dashboards of EPSDT measures, including trends and gaps in services. Oversees design and implementation of campaigns and programs to address gaps at Member, Provider, and system levels related to the EPSDT program.<br/></li></ul>Job Qualifications<br/><br/>REQUIRED EDUCATION:<br/><br/>Completion of an accredited Licensed Vocational Nurse (LVN) or Licensed Practical Nurse (LPN) Program OR Bachelor's or Master's Degree (preferably in a social science, psychology, gerontology, public health or social work or related field)<br/><br/>Required Experience/Knowledge, Skills &amp; Abilities<br/><br/>1-3 years in case management, disease management, managed care or medical or behavioral health settings.<br/><br/>Required License, Certification, Association<br/><br/><ul><li>If licensed, license must be active, unrestricted and in good standing.</li><li>Must have valid driver’s license with good driving record and be able to drive within applicable state or locality with reliable transportation.<br/><br/></li></ul>Preferred Experience<br/><br/>3-5 years in case management, disease management, managed care or medical or behavioral health settings.<br/><br/>Preferred License, Certification, Association<br/><br/>Any of the following:<br/><br/>Licensed Clinical Social Worker (LCSW), Advanced Practice Social Worker (APSW), Certified Case Manager (CCM), Certified in Health Education and Promotion (CHEP), Licensed Professional Counselor (LPC/LPCC), Respiratory Therapist, or Licensed Marriage and Family Therapist (LMFT).<br/><br/>To all current Molina employees: If you are interested in applying for this position, please apply through the intranet job listing.<br/><br/>Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V.<br/><br/>Pay Range: $21.6 - $46.81 / HOURLY<br/><br/><ul><li>Actual compensation may vary from posting based on geographic location, work experience, education and/or skill level.</li></ul>", "responsibilities": "This position’s primary responsibility is for tracking and deploying interventions to improve child/adolescent health outcomes. Facilitates members accessing well child visits, immunizations, and awareness of benefits through Early Periodic Diagnostic and Treatment (EPSDT).", "qualifications": {"required": "Completion of an accredited Licensed Vocational Nurse (LVN) or Licensed Practical Nurse (LPN) Program OR Bachelor's or Master's Degree (preferably in a social science, psychology, gerontology, public health or social work or related field)<br/><br/>1-3 years in case management, disease management, managed care or medical or behavioral health settings.<br/><br/>If licensed, license must be active, unrestricted and in good standing.<br/><br/>Must have valid driver’s license with good driving record and be able to drive within applicable state or locality with reliable transportation.", "preferred": "3-5 years in case management, disease management, managed care or medical or behavioral health settings.<br/><br/>Licensed Clinical Social Worker (LCSW), Advanced Practice Social Worker (APSW), Certified Case Manager (CCM), Certified in Health Education and Promotion (CHEP), Licensed Professional Counselor (LPC/LPCC), Respiratory Therapist, or Licensed Marriage and Family Therapist (LMFT)."}, "skills": ["EMR", "Microsoft Office", "Case Management", "Disease Management", "Managed Care", "Medical", "Behavioral Health", "Outreach", "Education", "Transportation", "Data Analysis", "Communication", "Collaboration"], "postedDate": "6 days ago", "benefits": "Molina Healthcare offers a competitive benefits and compensation package.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001490990"}