{"jobTitle": "Account Executive", "company": {"name": "Paperchase", "industry": "Accounting"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00/yr - 150,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Accounting", "description": "<strong>Company Description:</strong><p>Paperchase is a global restaurant finance company, headquartered in NYC with offices across the United States, UK, Middle East, and Asia. We provide accounting expertise, software solutions, and business development and analysis for hospitality operators like Zuma, Cipriani, Five Guys, and Dishoom. We are lucky to work with some amazing restaurants, and our client base boasts a total of 30 Michelin stars across the globe. We treat our client relationships with the same degree of care as our clients take with their guests. We also pride ourselves on building a diverse and inclusive company, with a culture that prizes smart work and teamwork equally. .</p><p><br/></p><p>Role Description</p><p>We are looking for an experienced and motivated Account Executive to join our team. The ideal candidate will have a proven track record of success in sales, excellent communication skills, and the ability to think strategically and creatively. We are looking for a self-starter, who can strategize ways to book meetings for themselves and also close them. This role is located in the New York City Metropolitan Area and will be Hybrid with two to three days in our Midtown office. </p><p><br/></p><p>Responsibilities: </p><ul><li>Work with Head of US Sales and Sales Development team to identify and sell into new accounts </li><li>Generating pipeline that leads to closed revenue and quota attainment </li><li>Selling on value and return on investment vs. features &amp; functions </li><li>Uncovering pain points and business impact that maps back to our solutions </li><li>Demonstrating adaptability and flexibility as part of an ever-growing team </li><li>Manage entire sales cycle from self-sourcing new opportunities to close in addition to Sales Development created leads</li><li><span>Follow up with customers to generate referrals </span></li><li><span>Maintain accurate pipeline and forecast </span></li><li>In-depth knowledge of the Paperchase services to present to prospective clients </li><li>Continual industry research to identify new restaurants </li><li>Build and maintain a long-lasting business relationship </li><li>Other duties as assigned </li></ul><p><br/></p><p>Position Qualifications: </p><ul><li>Bachelor’s degree strongly preferred </li><li>2+ years of closing experience</li><li>Proven Account Management/Sales experience and strong record of success (software sales preferred) </li><li>Experience with Hubspot or similar CRM </li><li>Strong presentation skills </li><li>Excellent interpersonal and communication skills, verbal and written </li><li>Ability to adopt and follow a sales process </li><li>Ability to network and build relationships </li><li>Ability to negotiate and problem-solve </li><li>Organization and time management skills </li><li>Enthusiasm and passion! </li><li>Accounting or Restaurant Management experience (huge plus!) </li></ul><p><br/></p><p>Benefits: </p><ul><li>Hybrid work environment, with 2-3 days required in office </li><li>Commuter benefits </li><li>Generous health coverage including medical, dental, vision, and short- and long-term disability coverage </li><li>PTO, with added days based on experience </li></ul><p><br/></p><p><br/></p><p>Salary: </p><p>Base $75,000 // $150,000 OTE uncapped. </p><p><br/></p><p> </p>", "responsibilities": "Work with Head of US Sales and Sales Development team to identify and sell into new accounts Generating pipeline that leads to closed revenue and quota attainment Selling on value and return on investment vs. features & functions Uncovering pain points and business impact that maps back to our solutions Demonstrating adaptability and flexibility as part of an ever-growing team Manage entire sales cycle from self-sourcing new opportunities to close in addition to Sales Development created leadsFollow up with customers to generate referrals Maintain accurate pipeline and forecast In-depth knowledge of the Paperchase services to present to prospective clients Continual industry research to identify new restaurants Build and maintain a long-lasting business relationship Other duties as assigned ", "qualifications": {"required": "2+ years of closing experienceProven Account Management/Sales experience and strong record of success (software sales preferred) Experience with Hubspot or similar CRM Strong presentation skills Excellent interpersonal and communication skills, verbal and written Ability to adopt and follow a sales process Ability to network and build relationships Ability to negotiate and problem-solve Organization and time management skills Enthusiasm and passion!", "preferred": "Bachelor’s degree"}, "skills": ["Sales", "CRM", "Business Development", "Account Management", "Communication", "Negotiation", "Problem Solving", "Relationship Building", "Time Management", "Hubspot"], "postedDate": "3 days ago", "benefits": "Hybrid work environment, with 2-3 days required in office Commuter benefits Generous health coverage including medical, dental, vision, and short- and long-term disability coverage PTO, with added days based on experience ", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001908603"}