{"jobTitle": "Replenishment Manager", "company": {"name": "Insight Global", "location": "Deerfield Beach, FL"}, "location": "Deerfield Beach, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $130,000.00/yr", "currency": "USD"}, "jobFunction": "General Business", "industry": "Wholesale Building Materials", "description": "<strong>About the Role:</strong> <p>The Replenishment Manager will play a crucial role in ensuring that internal and external customers are supplied with the right products at the right time. You will be responsible for optimizing inventory levels, implementing effective replenishment strategies, and collaborating with various departments, interface with carriers and suppliers to maximize efficiency. You will oversee order fulfillment operations, ensuring efficient and accurate order processing and delivery.</p><p><br/></p><p><strong>Responsibilities:</strong> </p><ul><li>Develop and maintain inventory replenishment plans to meet customer demand</li><li>Tender loads to the carriers based on requirements and control the execution of the transportation plan</li><li>Monitor inventory levels and make data-driven decisions</li><li>Manage and optimize all aspects of order fulfillment</li></ul><p><br/></p><p> <strong>Qualifications:</strong> </p><p>Bachelor’s degree in Business Administration, Engineering, or a similar field</p><p><br/></p><p><strong>Required Skills:</strong> </p><ul><li>Relative experience/industry knowledge in Replenishment, inventory planning, transportation planning, fulfillment, S&amp;OP, Demand planning, network design</li></ul><p><br/></p><p> <strong>Preferred Skills:</strong> </p><ul><li>Industry knowledge in building materials, perishable goods, quick moving materials</li><li>MBA</li><li>Lean Six Sigma</li><li>Supply Chain Certification or relevant certifications</li></ul><p><br/></p><p> <strong>Pay range and compensation package:</strong> </p><p>Salary will be commensurate with experience and qualifications.</p><p><br/></p><p><strong>Equal Opportunity Statement:</strong> </p><p>We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><p></p>", "responsibilities": "Develop and maintain inventory replenishment plans to meet customer demandTender loads to the carriers based on requirements and control the execution of the transportation planMonitor inventory levels and make data-driven decisionsManage and optimize all aspects of order fulfillment", "qualifications": {"required": "Relative experience/industry knowledge in Replenishment, inventory planning, transportation planning, fulfillment, S&OP, Demand planning, network design", "preferred": "Industry knowledge in building materials, perishable goods, quick moving materialsMBALean Six SigmaSupply Chain Certification or relevant certifications"}, "skills": ["Replenishment", "Inventory Planning", "Transportation Planning", "Fulfillment", "S&OP", "Demand Planning", "Network Design", "Building Materials", "Perishable Goods", "Quick Moving Materials", "MBA", "Lean Six Sigma", "Supply Chain Certification"], "postedDate": "6 days ago", "benefits": "Medical insuranceVision insuranceDental insurance401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001484707"}