{"jobTitle": "Customer Service Support Agent", "company": {"name": "Fox Advantage", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Join our team to support our non-profit initiatives by assisting donors through excellent customer service. Your role will be crucial in helping us achieve our mission and making a difference in the community. If you are self-motivated and thrive in a dynamic environment, this is the perfect role for you. Pledge Drive Support Agents work for our clients provide phone-based support to receive donations, document accounts, and sometimes make transfers. We believe that customer success is at the heart of our growth. If you're eager to join a remote team that values innovation, customer-centricity, and commitment to excellence, apply now and embark on an exciting customer success journey with us!<br/><br/><strong>Click here to apply<br/><br/></strong><strong>Requirements<br/><br/></strong><ul><li>Personal Computer (Mac computers not be accepted) </li><li>High Speed Internet </li><li>Phone Service with a smart phone </li><li>Valid photo ID </li><li>Secluded space in your home away from noise such as children, pets, construction, or other background noises. </li><li>A genuine passion for helping and connecting with people </li><li>Outstanding verbal and written communication skills </li><li>Ability to multitask and problem-solve in a fast-paced environment </li><li>Empathy and patience to handle diverse customer needs </li><li>Previous customer service experience is a plus, but not required </li><li>Pass a background check  <br/><br/></li></ul>BenefitsHow much can you earn?<br/><br/>The average pay is $13.00 per hour (this is a .25 cent per-talk-minute client), and the higher the call volume, the more you are paid. Check out some of the peak-time earnings of our agents per pay period:<br/><br/><strong>SRodri**** $1,024.75<br/><br/></strong><strong>MNel*** $623.98<br/><br/></strong><strong>DBe** $1,179.98<br/><br/></strong><strong>LAnde*** $993.69<br/><br/></strong><strong>LAndr*** $1,512.05<br/><br/></strong><strong>CGlo** $659.58<br/><br/></strong><strong>PWeb**** $615.59<br/><br/></strong><ul><li>Work remotely from the comfort of your home or preferred location </li><li> Competitive compensation with performance-based bonuses  </li><li> Extensive training and ongoing professional development opportunities </li><li> Collaborative team culture that celebrates your achievements </li><li> Flexible hours with 24/7 availability </li><li> Set your own schedule </li><li> Pay rate of $0.20 to $0.32 per talk minute</li></ul>", "jobFunction": "Customer Service", "industry": "Telecommunications", "postedDate": "5 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001825490"}