{"jobTitle": "Territory Sales Manager - Las Vegas, NV", "company": {"name": "Victaulic", "industry": "Industrial Machinery Manufacturing"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Industrial Machinery Manufacturing", "description": "Since 1919, Victaulic has led the industry and continues to grow our outside sales team. At Victaulic, we don't sit back and enjoy success. We move forward and strive to grow.\n\nVictaulic, the global leader in mechanical pipe joining innovations, has the most tenured, largest and best-trained sales team in the industry. We continue to add high-powered sales representatives to our organization, and help them build a successful career with an industry leader.\n\nVictaulic sales representatives are out on the road every day, meeting with valued customers, visiting job sites and building relationships with key stakeholders to ensure continued success. Our sales team consists of team players who are self-starters with strong problem solving skills, mechanical aptitude and a drive to succeed and communicate effectively with a diverse customer base.\n\nOur rewards package consists of a competitive base salary, incentive compensation plan, company automobile and comprehensive benefit and retirement plans.\n\nIn this outside sales role, you will:\n\nBECOME THE EXPERT\n\nLearn the Products\n\nFirst, you'll need to learn all about Victaulic's products and the many ways that we can provide solutions for our customers and help them get their projects done on time and within budget. You'll be happy to know, we have an excellent training program! There's a lot to learn!\n\nKnow the Industry\n\nIn sales training, we'll teach you not only about grooved mechanical pipe joining methods, but also about the competitive methods of joining pipe, such as welding and flanging. With this knowledge, you can feel confident that you'll be able to overcome any objections you may face in the field from customers who are used to the more traditional ways of joining pipe.\n\nAs a territory manager, you'll also need to understand construction cycles, find and follow major construction, expansion or retrofit projects, and keep current with market trends and competitor activity. You'll be expected to integrate into local trade organizations and professional associations while striving to become part of the fabric of the industry within your territory.\n\nUnderstand the Business\n\nYou'll work with your Regional Sales Manager to develop a business plan, including opportunity mapping, sales goals, product promotion plans, and strategies to maximize your sales potential. You'll be responsible for executing all phases of project pursuit and project management to secure a purchase order ' from project inception through design, specifications, drawings, bidding phase, job site training and support, final commissioning and after-sale follow up. You'll need to gain complete information for all quotation requisitions including application, specification, pricing and timing requirements, and lead the inside sales team, engineering and other support staff to ensure good teamwork to meet customer requirements.\n\nBUILD STRONG RELATIONSHIPS\n\nAs a territory manager, developing relationships and building trust will be key to your success in this role, so it's essential that you work to build lasting relationships with the mechanical contractors, engineers, and building/project owners in your territory. Maintaining meaningful relationships requires spending time with your customers, and that's a big part of your job. Sometimes, time spent with clients extends beyond 'normal business hours' and you'll be expected to take customers out in the evenings or weekends for dinners, sporting events, and other social events.\n\nIn addition to maintaining relationships with your customers, you'll also need to partner with the Victaulic distributors in your territory and manage a balanced distribution network. You'll need to exercise teamwork to coordinate activities with other Victaulic representatives and regional market specialists who could influence or have any dealings with the project or account to ensure the best customer experience.\n\nEDUCATE AND INFLUENCE\n\nDuring your work day as a sales specialist, you'll seek to learn about your customers' needs and educate them about the overall value utilizing Victaulic can bring to their project. At Victaulic, we know our products are the best, and we want our customers to know it, too! Our sales reps work hard to educate our customers. For example, you may find yourself on a job site early in the morning dressed in jeans, boots, and a hard hat, while meeting with some contractors performing a tool demo or conducting a training on proper installation techniques. While, later that day, you may be doing a lunch and learn presentation for a group of engineers to educate them on our cutting edge products.\n\nYour ultimate goal is to educate customers on why they can feel confident about our products, show the overall value Victaulic products bring to their project, and influence the decision-makers, so you can maximize your sales potential.\n\nQUALITIES WE SEEK IN YOU AS A TERRITORY MANAGER:\n\nWe are advocates of lifelong learning at Victaulic, and even offer assistance with tuition reimbursement, but prefer you have a Bachelor's degree walking in the door! Previous sales experience selling 'value added' products/services; preferably related to the commercial construction industry, PVF industry (pipes, valves, fittings) or mechanical products will always make your transition a smooth one, but with our training program those from all backgrounds have experienced great success. Having demonstrated achievements in sales, and showing you have a history of developing and nurturing long standing relationships is also beneficial. Possessing a competitive nature, and showing both flexibility and resiliency will assist you in growing business in your territory year over year.\n\nBecause our territory managers work remote with minimal supervision, you should be self-motivated and self-driven to achieve success. When meeting with customers, you should exude confidence, a professional image, and present an engaging, affable personality. Having strong problem solving skills, the ability to be resourceful, and the ability to exercise creative thinking will help you in your daily interactions. Having strong organization and time management skills, as well as solid project management skills will help elevate your game to the next level!\n\nSome territories require heavier overnight travel than others, so your willingness to travel is required. While you are in the field, you may run into adverse weather conditions such as snow, heat, mud, rain ' we get dirty around here, and some of our equipment can weigh up to 50+ pounds!\n\n_Victaulic is an Equal Employment Opportunity (EOE/M/F/Vets/Disabled) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, gender, color, religion, national origin, age, disability, veteran status, sexual orientation, genetic data, or other legally protected status. (Background checks are required as part of our pre-employment process._", "responsibilities": "In this outside sales role, you will:\n\nBECOME THE EXPERT\n\nLearn the Products\n\nFirst, you'll need to learn all about Victaulic's products and the many ways that we can provide solutions for our customers and help them get their projects done on time and within budget. You'll be happy to know, we have an excellent training program! There's a lot to learn!\n\nKnow the Industry\n\nIn sales training, we'll teach you not only about grooved mechanical pipe joining methods, but also about the competitive methods of joining pipe, such as welding and flanging. With this knowledge, you can feel confident that you'll be able to overcome any objections you may face in the field from customers who are used to the more traditional ways of joining pipe.\n\nAs a territory manager, you'll also need to understand construction cycles, find and follow major construction, expansion or retrofit projects, and keep current with market trends and competitor activity. You'll be expected to integrate into local trade organizations and professional associations while striving to become part of the fabric of the industry within your territory.\n\nUnderstand the Business\n\nYou'll work with your Regional Sales Manager to develop a business plan, including opportunity mapping, sales goals, product promotion plans, and strategies to maximize your sales potential. You'll be responsible for executing all phases of project pursuit and project management to secure a purchase order ' from project inception through design, specifications, drawings, bidding phase, job site training and support, final commissioning and after-sale follow up. You'll need to gain complete information for all quotation requisitions including application, specification, pricing and timing requirements, and lead the inside sales team, engineering and other support staff to ensure good teamwork to meet customer requirements.\n\nBUILD STRONG RELATIONSHIPS\n\nAs a territory manager, developing relationships and building trust will be key to your success in this role, so it's essential that you work to build lasting relationships with the mechanical contractors, engineers, and building/project owners in your territory. Maintaining meaningful relationships requires spending time with your customers, and that's a big part of your job. Sometimes, time spent with clients extends beyond 'normal business hours' and you'll be expected to take customers out in the evenings or weekends for dinners, sporting events, and other social events.\n\nIn addition to maintaining relationships with your customers, you'll also need to partner with the Victaulic distributors in your territory and manage a balanced distribution network. You'll need to exercise teamwork to coordinate activities with other Victaulic representatives and regional market specialists who could influence or have any dealings with the project or account to ensure the best customer experience.\n\nEDUCATE AND INFLUENCE\n\nDuring your work day as a sales specialist, you'll seek to learn about your customers' needs and educate them about the overall value utilizing Victaulic can bring to their project. At Victaulic, we know our products are the best, and we want our customers to know it, too! Our sales reps work hard to educate our customers. For example, you may find yourself on a job site early in the morning dressed in jeans, boots, and a hard hat, while meeting with some contractors performing a tool demo or conducting a training on proper installation techniques. While, later that day, you may be doing a lunch and learn presentation for a group of engineers to educate them on our cutting edge products.\n\nYour ultimate goal is to educate customers on why they can feel confident about our products, show the overall value Victaulic products bring to their project, and influence the decision-makers, so you can maximize your sales potential.", "qualifications": {"required": "Previous sales experience selling 'value added' products/services; preferably related to the commercial construction industry, PVF industry (pipes, valves, fittings) or mechanical products will always make your transition a smooth one, but with our training program those from all backgrounds have experienced great success. Having demonstrated achievements in sales, and showing you have a history of developing and nurturing long standing relationships is also beneficial. Possessing a competitive nature, and showing both flexibility and resiliency will assist you in growing business in your territory year over year.\n\nBecause our territory managers work remote with minimal supervision, you should be self-motivated and self-driven to achieve success. When meeting with customers, you should exude confidence, a professional image, and present an engaging, affable personality. Having strong problem solving skills, the ability to be resourceful, and the ability to exercise creative thinking will help you in your daily interactions. Having strong organization and time management skills, as well as solid project management skills will help elevate your game to the next level!", "preferred": "We are advocates of lifelong learning at Victaulic, and even offer assistance with tuition reimbursement, but prefer you have a Bachelor's degree walking in the door!"}, "skills": [], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Our rewards package consists of a competitive base salary, incentive compensation plan, company automobile and comprehensive benefit and retirement plans.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001490631"}