{"jobTitle": "Junior Account Executive, Consumer Lifestyle", "company": {"name": "Sunshine Sachs Morgan & Lylis", "industry": "Public Relations and Communications Services", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000 - 50,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Public Relations and Communications Services", "description": "Sunshine Sachs Morgan & Lylis is proud to represent clients across many industries including entertainment, social good, tech and lifestyle and we tell their stories through a variety of mediums. We know that even during the toughest times, our responsibility to our clients and each other can bring meaningful and long-lasting impact for those affected the most. We’re proud of each and every campaign we execute, but you may be wondering why we don’t have more than a landing page as our website. While many of our clients are household names (you know them, we’re sure of it), our digital footprint is purposefully small. We fly under the radar and we like it that way.<br/><br/>If you are fired up and ready to do good, join us!<br/><br/>We have an opening for a Junior Account Executive on our Consumer/Lifestyle Team  based out of our  New York Office . What does this mean? You have a strong foundation, and a clear understanding of what PR is, but most importantly, you love this work! We are seeking a highly motivated individual who is interested in learning the ins and outs of working with a variety of consumer brands in lifestyle, tech and pop culture. The ideal candidate has media relations experience and can make relevant media connections. If you are exceptionally detail-oriented, a creative thinker and can expertly coordinate across projects on the backend then we want to hear from you.<br/><br/>Responsibilities Include<br/><br/>\n<ul><li>Willingness and an interest to soak it all in; learn the ins and outs of integrated communications (talent/influencer integration, media relations, social media, creative and brand integration).</li><li>Assisting in developing and executing comprehensive public relations strategies.</li><li>Drafting, editing and proofreading talent/influencer materials including travel itineraries, creative briefs, client materials, memos, agendas, blog content, pitches, fact sheets, FAQs, briefing notes, and client correspondence.</li><li>Scheduling and providing logistical support for client meetings and events.</li><li>Supporting senior managers in achieving deliverables for a full roster of clients (average of 4 – 6).</li><li>Monitoring news cycles and flagging latest “pop culture moments”, competitor news, for clients.</li><li>Creating and maintaining lists! Lots of lists! Specifically, media lists. </li><li>Communicating effectively with senior staff on status of requested tasks and projects.</li><li>Assisting in planning and executing integrated events</li><li>Working with senior management to respond to client requests and ensure requests are taken care of in an efficient manner.</li><li>Support administration of accounts including developing agendas, meeting recaps, activity reports, client status reports, budget trackers, etc.<br/><br/></li></ul>You Should Apply If<br/><br/>\n<ul><li>You have 2+ years of experience in this industry (communications, media, public relations, etc.) </li><li>You are eager and open to learning all aspects of integrated communications (media relations, social media, creative, brand integration, talent integration)</li><li>You are a strong writer – persuasive, concise, creative, and quick!</li><li>You are eager to network and build connections in the media industry.</li><li>You are a strategic thinker, bring new ideas to the table, and love a good brainstorm.</li><li>You have strong decision-making abilities and accountability</li><li>You have an innate curiosity and an entrepreneurial spirit.</li><li>You are incredibly organized, detail oriented and able to excel at managing multiple projects simultaneously.</li><li>You’re willing to work select evenings/weekends and travel when necessary.</li><li>You enjoy overdelivering rather than meeting expectations and take genuine pride in being part of something good.<br/><br/></li></ul>$50,000 - $50,000 a year<br/><br/>Benefits x Perks<br/><br/>We go well beyond the benefits that you’re looking for like medical, dental, and vision plans, 401(k) with matching, annual merit-based bonuses, PTO, fertility, FSA for medical, childcare, and commuter expenses. Sunshine Sachs Morgan & Lylis offers those benefits and many perks including, a flexible work schedule, Work from Anywhere program, Summer Fridays, Wellness Days, and a 4-week sabbatical or trip to celebrate select anniversaries. We love to socialize so, we have collaborative workspaces, some offices even have rooftops, celebrations, networking opportunities, and community volunteering. We frequently mark opportunities to listen, learn and act throughout the year (Juneteenth, Election Day, International Women’s Day, etc.).<br/><br/>SSM&L is committed to diversity, equity, inclusion, and ability. We are an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, identity and expression, national origin, disability status, protected veteran status, or any other characteristic protected by law.<br/><br/>There’s more!<br/><br/>From day one, employees are carefully matched with a mentor to guide them on their path to success. Training and mentoring are a big deal here and since we are into promoting from within, we make sure to provide more than enough tools for you to learn and grow. We are proud to offer training throughout the year on topics for professional growth as well as personal growth. We have also developed a series of teaching workshops that are structured for each level of the company. Sunshiners also take love to take advantage of the monthly Meet the Media series where media contacts provide valuable insider info for pitching them and their colleagues.", "responsibilities": "Willingness and an interest to soak it all in; learn the ins and outs of integrated communications (talent/influencer integration, media relations, social media, creative and brand integration).\nAssisting in developing and executing comprehensive public relations strategies.\nDrafting, editing and proofreading talent/influencer materials including travel itineraries, creative briefs, client materials, memos, agendas, blog content, pitches, fact sheets, FAQs, briefing notes, and client correspondence.\nScheduling and providing logistical support for client meetings and events.\nSupporting senior managers in achieving deliverables for a full roster of clients (average of 4 – 6).\nMonitoring news cycles and flagging latest “pop culture moments”, competitor news, for clients.\nCreating and maintaining lists! Lots of lists! Specifically, media lists. \nCommunicating effectively with senior staff on status of requested tasks and projects.\nAssisting in planning and executing integrated events\nWorking with senior management to respond to client requests and ensure requests are taken care of in an efficient manner.\nSupport administration of accounts including developing agendas, meeting recaps, activity reports, client status reports, budget trackers, etc.", "qualifications": {"required": "You have 2+ years of experience in this industry (communications, media, public relations, etc.) \nYou are eager and open to learning all aspects of integrated communications (media relations, social media, creative, brand integration, talent integration)\nYou are a strong writer – persuasive, concise, creative, and quick!\nYou are eager to network and build connections in the media industry.\nYou are a strategic thinker, bring new ideas to the table, and love a good brainstorm.\nYou have strong decision-making abilities and accountability\nYou have an innate curiosity and an entrepreneurial spirit.\nYou are incredibly organized, detail oriented and able to excel at managing multiple projects simultaneously.\nYou’re willing to work select evenings/weekends and travel when necessary.\nYou enjoy overdelivering rather than meeting expectations and take genuine pride in being part of something good."}, "skills": [], "postedDate": "5 days ago", "benefits": "We go well beyond the benefits that you’re looking for like medical, dental, and vision plans, 401(k) with matching, annual merit-based bonuses, PTO, fertility, FSA for medical, childcare, and commuter expenses. Sunshine Sachs Morgan & Lylis offers those benefits and many perks including, a flexible work schedule, Work from Anywhere program, Summer Fridays, Wellness Days, and a 4-week sabbatical or trip to celebrate select anniversaries. We love to socialize so, we have collaborative workspaces, some offices even have rooftops, celebrations, networking opportunities, and community volunteering. We frequently mark opportunities to listen, learn and act throughout the year (Juneteenth, Election Day, International Women’s Day, etc.).", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4001797459"}