{"jobTitle": "Account Manager", "company": {"name": "ADLIB Recruitment | B Corp™", "location": "Washington County, OR"}, "location": "Washington County, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Join an award-winning eCommerce agency as Account Manager. Incredible perks from paid for certifications to annual bonuses and fast progression. Choice of working remote, hybrid or office-based working (Must be UK based).<br/><br/>This is a brand-new opportunity for a talented Account Manager who would love nothing more than to get their teeth stuck into a range of world-renowned clients to help strategize and deliver Adobe Commerce development projects.<br/><br/>Whilst 100% remote working is available, please note you must be a UK resident, located in the UK.<br/><br/><strong>What You’ll Be Doing<br/><br/></strong>You’ll be joining a well-established, experienced, and friendly team to utilise your proven client management skills and eCommerce experience to build best-in-class websites.<br/><br/>You will be part of the Client Services team which comprises Account Managers and Project Managers reporting to the Delivery Director and Client Services Director. You will have previous experience of web technologies or eCommerce, working in a fast-paced agile environment, with incredible communication skills to liaise with technical and non-technical stakeholders as well as manage expectations across the board.<br/><br/>As a Midweight or Senior Account Manager, the role will require you to manage your own clients, on-going retainers, and full eCommerce website builds. You’ll help advise on your client’s overall eCommerce strategy, grow relationships, prioritise, organise, and deliver your clients work using this eCommerce agencies award winning design, strategy, and development teams.<br/><br/>This isn’t a sales or business development based role, you will be managing new and existing enterprise level accounts a clients.<br/><br/>For remote working you’ll be pleased to know that the onboarding process here is superb, with regular virtual and face to face activities as well as sound day to day processes and procedures in place. What’s more, you will be invited to client meetings/visits, networking events, conferences and meet ups.<br/><br/>In terms of training and development, budget is in place for additional learning and qualifications and regular reviews will take place to discuss salary and that next promotion.<br/><br/><strong>What Experience You’ll Need<br/><br/></strong><ul><li>Previous experience as an Account Manager or similar.</li><li>Previous experience in an agency or eCommerce focused business.</li><li>Exposure to web/digital/eCommerce projects.</li><li>Understanding of Adobe Commerce would be incredibly helpful. Understanding other platforms such as Shopify or BigCommerce for example could be beneficial.</li><li>Superb client management skills with outstanding stakeholder management skills.</li><li>An ability to work cross-functionally in a multi-skilled agency.</li><li>Calm under pressure, with a knack of managing multiple tasks simultaneously without compromising on quality or quantity of service.</li><li>Commercially and strategically aware considering the “bigger picture”.</li><li>Positive, enthusiastic and friendly mentality.<br/><br/></li></ul><strong>What You’ll Get In Return For Your Talents<br/><br/></strong>True flexible working including remote and flexi-time policies in place in league with a competitive salary, industry leading training and development, a clear path to promotion and generous annual bonus based on company performance.<br/><br/><strong>What’s next?<br/><br/></strong>To be considered please submit a CV ASAP or contact Aaron Drury at ADLIB Recruitment for more info. We are conducting interviews promptly.", "postedDate": "3 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4001000297"}