{"jobTitle": "Executive/Admin Assistant", "company": {"name": "American Express", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24.05 to 48.10 hourly", "currency": "USD"}, "jobFunction": "Other", "industry": "Financial Services", "description": "<strong>You Lead the Way. We’ve Got Your Back.<br/><br/></strong>With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.<br/><br/>At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.<br/><br/>Join Team Amex and let's lead the way together.<br/><br/>Launched in 2012, Amex Offers is a digital advertising platform that connects Merchants and brands with the tens of millions of American Express Card Members across the globe. The Amex Offers team develops strategic marketing partnerships that deliver unique differentiated value for Merchants and Advertisers to reach these high-spending Card Members in the digital channels where they engage with American Express, delivering deep insights and maximizing results.<br/><br/><strong>How will you make an impact in this role?<br/><br/></strong>Executive Assistant to the VP, AmEx Offers Analytics &amp; Merchant Insights and VP, AmEx Offer Sales &amp; Sourcing will be responsible for providing an exceptional standard of support for VP and team, will work autonomously and efficiently, anticipating the leader’s needs and ‘connecting the dots’ behind the scenes. This role is a critical member of the broader team who provides organizational support and ensures that the team’s logical needs are met and helps to promote a positive atmosphere and work culture.<br/><br/>Looking for candidate that is highly energetic, organized, flexible and credible and used to work in a fast, and at times high pressure environment with numerous conflicting priorities.<br/><br/><ul><li>Managing complex calendar management using high levels of integrity, managing across senior business partners, dispersed locations and differing time zones. </li><li>Managing overall logistical management including arranging meeting rooms, video and audio conferencing as well as coordinating team meetings, activities, ticketing events and other events. </li><li>Booking complex international travel itinerary with knowledge of AMEX travel booking tools, preferred vendors, and associated policies. </li><li>Ensuring timely preparation and processing of expense reports; tracking and processing of invoices; review expenses submitted to leader and highlight any out of policy spend. </li><li>Organizing new start first days (in NYC), workstation, stationery, and all HR/PeopleSoft administration. Helping to co-ordinate recruitment and development activities. This extends to handling organization charts and team rosters. </li><li>In conjunction with other Executive Assistants, organize and coordinate activities associated with Town Halls, Senior leader updates and other related analytic &amp; sourcing projects. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Excellent communication skills, both written and oral; strong interpersonal, influencing, and collaborating skills. </li><li>Ability to work under pressure, to tight deadlines and with strong attention to detail. </li><li>Strong maturity with ability to effectively prioritize multiple VP office responsibilities. </li><li>Ability to work under minimal direction, manage multiple priorities, make sound decisions, and maintain discretion and confidentiality of sensitive information. </li><li>Team player who is dependable and enthusiastic. </li><li>Proficiency in Microsoft outlook and Microsoft Office, including Word, Excel and PowerPoint. Strong working knowledge of virtual meeting tools and platforms preferred. </li><li>Proficiency in American Express applications included but not limited to Concur Expense Management, Ariba Buyer, her, Payroll, and the IT Service Catalog. <br/><br/></li></ul>Salary Range: $24.05 to $48.10 hourly + bonus + benefits<br/><br/>The above represents the expected hourly pay range for this job requisition. Ultimately, in determining your pay, we’ll consider your location, experience, and other job-related factors.<br/><br/>We back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:<br/><br/><ul><li>Competitive base salaries </li><li>Bonus incentives </li><li>6% Company Match on retirement savings plan </li><li>Free financial coaching and financial well-being support </li><li>Comprehensive medical, dental, vision, life insurance, and disability benefits </li><li>Flexible working model with hybrid, onsite or virtual arrangements depending on role and business need </li><li>20+ weeks paid parental leave for all parents, regardless of gender, offered for pregnancy, adoption or surrogacy </li><li>Free access to global on-site wellness centers staffed with nurses and doctors (depending on location) </li><li>Free and confidential counseling support through our Healthy Minds program </li><li>Career development and training opportunities<br/><br/></li></ul>For a full list of Team Amex benefits, visit our Colleague Benefits Site.<br/><br/>American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.<br/><br/>We back our colleagues with the support they need to thrive, professionally and personally. That's why we have Amex Flex, our enterprise working model that provides greater flexibility to colleagues while ensuring we preserve the important aspects of our unique in-person culture. Depending on role and business needs, colleagues will either work onsite, in a hybrid model (combination of in-office and virtual days)<br/><br/>Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for this position.<br/><br/>US Job Seekers/Employees - Click here to view the “Know Your Rights” poster and the Pay Transparency Policy Statement.<br/><br/>If the links do not work, please copy and paste the following URLs in a new browser window: https://www.dol.gov/agencies/ofccp/posters to access the three posters.", "responsibilities": "Executive Assistant to the VP, AmEx Offers Analytics &amp; Merchant Insights and VP, AmEx Offer Sales &amp; Sourcing will be responsible for providing an exceptional standard of support for VP and team, will work autonomously and efficiently, anticipating the leader’s needs and ‘connecting the dots’ behind the scenes. This role is a critical member of the broader team who provides organizational support and ensures that the team’s logical needs are met and helps to promote a positive atmosphere and work culture.<br/><br/>Looking for candidate that is highly energetic, organized, flexible and credible and used to work in a fast, and at times high pressure environment with numerous conflicting priorities.<br/><br/><ul><li>Managing complex calendar management using high levels of integrity, managing across senior business partners, dispersed locations and differing time zones. </li><li>Managing overall logistical management including arranging meeting rooms, video and audio conferencing as well as coordinating team meetings, activities, ticketing events and other events. </li><li>Booking complex international travel itinerary with knowledge of AMEX travel booking tools, preferred vendors, and associated policies. </li><li>Ensuring timely preparation and processing of expense reports; tracking and processing of invoices; review expenses submitted to leader and highlight any out of policy spend. </li><li>Organizing new start first days (in NYC), workstation, stationery, and all HR/PeopleSoft administration. Helping to co-ordinate recruitment and development activities. This extends to handling organization charts and team rosters. </li><li>In conjunction with other Executive Assistants, organize and coordinate activities associated with Town Halls, Senior leader updates and other related analytic &amp; sourcing projects. <br/><br/></li></ul>", "qualifications": {"required": "Excellent communication skills, both written and oral; strong interpersonal, influencing, and collaborating skills. <br/>Ability to work under pressure, to tight deadlines and with strong attention to detail. <br/>Strong maturity with ability to effectively prioritize multiple VP office responsibilities. <br/>Ability to work under minimal direction, manage multiple priorities, make sound decisions, and maintain discretion and confidentiality of sensitive information. <br/>Team player who is dependable and enthusiastic. <br/>Proficiency in Microsoft outlook and Microsoft Office, including Word, Excel and PowerPoint. Strong working knowledge of virtual meeting tools and platforms preferred. <br/>Proficiency in American Express applications included but not limited to Concur Expense Management, Ariba Buyer, her, Payroll, and the IT Service Catalog. <br/><br/>"}, "skills": ["Communication", "Microsoft Office", "Microsoft Outlook", "Time Management", "Organization", "Travel", "Expense Reports", "Meeting Coordination", "Calendar Management", "Teamwork", "Problem Solving", "Confidentiality", "Integrity", "Prioritization", "Collaboration", "Virtual Meeting Tools", "Concur Expense Management", "Ariba Buyer", "Payroll", "IT Service Catalog"], "postedDate": "6 days ago", "benefits": "Competitive base salaries <br/>Bonus incentives <br/>6% Company Match on retirement savings plan <br/>Free financial coaching and financial well-being support <br/>Comprehensive medical, dental, vision, life insurance, and disability benefits <br/>Flexible working model with hybrid, onsite or virtual arrangements depending on role and business need <br/>20+ weeks paid parental leave for all parents, regardless of gender, offered for pregnancy, adoption or surrogacy <br/>Free access to global on-site wellness centers staffed with nurses and doctors (depending on location) <br/>Free and confidential counseling support through our Healthy Minds program <br/>Career development and training opportunities<br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4001764995"}