{"jobTitle": "HR Assistant", "company": {"name": "Trispoke Managed Services Pvt. Ltd.", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Outsourcing and Offshoring Consulting", "description": "<strong>Job Description<br/><br/></strong><ul><li>The HR Services team performs tens of thousands of transactions a year and is currently seeking an energetic person, who can perform tens of thousands of transactions a year with excellence, autonomy, flexibility, and accuracy.</li><li>Someone who thrives in a fast-paced, high volume, short deadline environment</li><li>Someone who enjoys data entry and transactional work.</li><li>Someone who feels accomplished when delivering accurate and complete responses.</li><li>Someone who takes pride in being responsive and organized.</li><li>Someone who can follow written and verbal instructions.</li><li>Someone who is detail oriented and has the ability to self-audit.</li><li>A flexible work environment, remote work &gt;100% of the time. Ability to work on-site as needed (not expected to be very often).</li><li>Accommodating work schedules to create a work/life balance.</li><li>Remote training with team Technical Lead.</li><li>Cross-training with Sr. Specialists</li><li>90-day planning for work assignments to accommodate Ad Hoc work.</li><li>Experience partnering with cross-functional teams and all HR Centers of Excellence (COE)</li><li>A dynamic team of professional HR Specialists who perform the same work.</li><li>100% inclusion to bring 100% of yourself to work.<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Demonstrated attention to detail while completing large volume transactions with a low error rate.</li><li>Exhibited growth mindset/continuous process improvement.</li><li>Virtual Customer Service experience.</li><li>Capability to perform data analysis/interpretation.</li><li>Displayed prioritization, organization, planning, and communication skills.</li><li>Must Have previous experience working with Represented Labor contracts (Unions)</li><li>Minimum Intermediate level Excel experience (Pivot tables, vertical look ups, basic formulas)</li><li>Desire and attention to detail for Data Entry and manual transaction execution</li><li>Previous experience in large enterprise environment</li><li>Previous Microsoft Office 365 (Teams, Excel, PowerPoint, Word, One Note) Specifically.<br/><br/></li></ul><strong>Desired Qualifications<br/><br/></strong><ul><li>Human Resources/Labor Relations Experience</li><li>Experience working with cross-functional teams and/or stakeholders virtually and across multiple sites.</li><li>Demonstrated knowledge of Peoplesoft tool (HRMS) and/or SAP Success Factors.</li><li>Knowledge of working in a large-scale Union environment.</li><li>Ability to function with accuracy during extensive, on-going, changes in the way the work is completed.<br/><br/></li></ul>#nowhiring #Americanjobs #For more jobs visit https://www.linkedin.com/company/trispoke-managed-services-pvt-ltd/jobs/?viewAsMember=true", "responsibilities": null, "qualifications": {"required": "Demonstrated attention to detail while completing large volume transactions with a low error rate. Exhibited growth mindset/continuous process improvement. Virtual Customer Service experience. Capability to perform data analysis/interpretation. Displayed prioritization, organization, planning, and communication skills. Must Have previous experience working with Represented Labor contracts (Unions) Minimum Intermediate level Excel experience (Pivot tables, vertical look ups, basic formulas) Desire and attention to detail for Data Entry and manual transaction execution Previous experience in large enterprise environment Previous Microsoft Office 365 (Teams, Excel, PowerPoint, Word, One Note) Specifically.", "preferred": "Human Resources/Labor Relations Experience Experience working with cross-functional teams and/or stakeholders virtually and across multiple sites. Demonstrated knowledge of Peoplesoft tool (HRMS) and/or SAP Success Factors. Knowledge of working in a large-scale Union environment. Ability to function with accuracy during extensive, on-going, changes in the way the work is completed."}, "skills": ["Excel", "Microsoft Office 365", "Peoplesoft", "SAP Success Factors", "Data Analysis", "Customer Service", "Communication", "Organization", "Prioritization", "Planning"], "postedDate": "5 days ago", "applicationDeadline": null, "benefits": null, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4001775527"}