{"jobTitle": "Customer Experience Consultant", "company": {"name": "Zillow", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18.80 - 30.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Real Estate", "description": "About The Team<br/><br/>Listing Media Services is an innovative company in the real estate photography industry, providing agents with a straightforward, efficient, and credible way to schedule and receive outstanding media for their listings. Our service encompasses professional photography, aerial photography, interactive floor plans, virtual tours, and more. Improving the ample media resources of Listing Media Services, Listing Showcase is a premium marketing solution that enables agents and teams to craft impressive listings that stand out in the market. By applying Listing Showcase and Listing Media Services, agents can tailor their listings, promote their brand, and differentiate themselves on Zillow.com.<br/><br/>About The Role<br/><br/>As a Listing Media Services and Showcase Customer Experience Consultant, you will play a crucial role in delivering magnificent customer service to our valued clients. Your responsibilities will include:<br/><br/><ul><li>Providing efficient and high-quality customer service through multiple channels (phone and email). </li><li>Mentoring customers and offering effective solutions to meet their needs. </li><li>Ensuring excellent customer satisfaction and prioritizing customer happiness. </li><li>Assisting customers with appointment scheduling, billing inquiries, media delivery, and technical troubleshooting. </li><li>Accurately documenting customer interactions in our CRM software, Salesforce. </li><li>Providing valuable feedback to our product team to enhance the customer experience. </li><li>Collaborating and building relationships with both internal and external customers. <br/><br/></li></ul>This role has been categorized as a Remote position. “Remote” employees do not have a permanent corporate office workplace and, instead, work from a physical location of their choice, which must be identified to the Company. U.S. employees may live in any of the 50 United States, with limited exceptions.<br/><br/>In California, Colorado, Connecticut, Hawaii, Nevada, New York, Washington state, and Washington DC the standard base pay range for this role is $18.80 - $30.00 Hourly. This base pay range is specific to California, Colorado, Connecticut, Hawaii, Nevada, New York, Washington state, and Washington DC and may not be applicable to other locations.<br/><br/>In addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location. Actual amounts will vary depending on experience, performance and location.<br/><br/>Who you are<br/><br/>To be successful in this role, you should possess the following qualifications:<br/><br/><ul><li>At least one year of experience in a customer service role. </li><li>Experience in a contact center role is helpful. </li><li>A proven track record of independently managing a high volume of customer cases. </li><li>Proficiency in web-based products, MS Office, and Salesforce (or a similar CRM system). </li><li>A dedicated, driven, and open approach. </li><li>The ability to thrive in a fast-paced and dynamic environment. </li><li>Strong self-motivation and the ability to work without constant supervision. <br/><br/></li></ul>Get to know us<br/><br/>Zillow is reimagining real estate to make home a reality for more and more people.<br/><br/>As the most-visited real estate website in the United States, Zillow® and its affiliates help movers find and win their home through digital solutions, first class partners, and easier buying, selling, financing and renting experiences. Millions of people visit Zillow Group sites every month to start their home search, and now they can rely on Zillow to help make it easier to move. The work we do helps people get home and no matter what job you're in, you will play a critical role in making home a reality for more and more people.<br/><br/>Our efforts to streamline the real estate transaction are supported by a deep-rooted culture of innovation, our passion to redefine the employee experience, a fundamental commitment to Equity and Belonging, and world-class benefits. These benefits include comprehensive medical, dental, vision, life, and disability coverages as well as parental leave, family benefits, retirement contributions, and paid time off. We’re also setting the standard for work experiences of the future, where our employees are supported in doing their best work and living a flexible, well-balanced life. But don’t just take our word for it. Read recent reviews on Glassdoor and recent recognition from multiple organizations, including: the 100 Best Companies to Work For, Glassdoor Employees’ Choice Award, Bloomberg Gender-Equality Index, Human Rights Campaign (HRC) Corporate Equity Index, and TIME 100 Most Influential Companies list.<br/><br/><em>Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact your recruiter directly.<br/><br/></em><em>Applicants who receive job offers from Zillow Group will be asked to sign a Proprietary Rights Agreement which includes confidentiality, intellectual property assignment, customer and employee non-solicitation, and non-competition provisions. If you are contacted for a role at Zillow Group and wish to review a copy of the Proprietary Rights Agreement prior to receiving an offer, you may request a copy from your Recruiter.</em>", "responsibilities": "As a Listing Media Services and Showcase Customer Experience Consultant, you will play a crucial role in delivering magnificent customer service to our valued clients. Your responsibilities will include:<br/><br/><ul><li>Providing efficient and high-quality customer service through multiple channels (phone and email). </li><li>Mentoring customers and offering effective solutions to meet their needs. </li><li>Ensuring excellent customer satisfaction and prioritizing customer happiness. </li><li>Assisting customers with appointment scheduling, billing inquiries, media delivery, and technical troubleshooting. </li><li>Accurately documenting customer interactions in our CRM software, Salesforce. </li><li>Providing valuable feedback to our product team to enhance the customer experience. </li><li>Collaborating and building relationships with both internal and external customers. <br/><br/></li></ul>", "qualifications": {"required": "At least one year of experience in a customer service role. <br/>Experience in a contact center role is helpful. <br/>A proven track record of independently managing a high volume of customer cases. <br/>Proficiency in web-based products, MS Office, and Salesforce (or a similar CRM system). <br/>A dedicated, driven, and open approach. <br/>The ability to thrive in a fast-paced and dynamic environment. <br/>Strong self-motivation and the ability to work without constant supervision. <br/><br/>", "preferred": ""}, "skills": ["Customer Service", "Salesforce", "CRM", "MS Office", "Phone", "Email"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "comprehensive medical, dental, vision, life, and disability coverages as well as parental leave, family benefits, retirement contributions, and paid time off.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002919051"}