{"jobTitle": "Senior Technical Recruiter", "company": {"name": "Fieldguide", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Software Development", "description": "About Us:\n\nFieldguide is establishing a new state of trust for global commerce and capital markets through automating and streamlining the work of assurance and audit practitioners specifically within cybersecurity, privacy, and ESG (Environmental, Social, Governance). Put simply, we build software for the people who enable trust between businesses.\n\nWe’re based in San Francisco, CA, but built as a remote-first company that enables you to do your best work from anywhere. We're backed by top investors including 8VC, Floodgate, Y Combinator, DNX Ventures, Global Founders Capital, Justin Kan, Eric Ries, and more.\n\nWe value diversity — in backgrounds and in experiences. We need people from all backgrounds and walks of life to help build the future of audit and advisory. Fieldguide’s team is inclusive, driven, humble and supportive. We are deliberate and self-reflective about the kind of team and culture that we are building, seeking teammates that are not only strong in their own aptitudes but care deeply about supporting each other's growth.\n\nAs an early stage start-up employee, you’ll have the opportunity to build out the future of business trust. We make audit practitioners’ lives easier by eliminating up to 50% of their work and giving them better work-life balance. If you share our values and enthusiasm for building a great culture and product, you will find a home at Fieldguide.\n\nAbout the Role:\n\nAs the Senior Technical Recruiter at Fieldguide, you'll have a major impact in building our engineering, product, and design (EPD) organization through a significant period of growth. You will own full-cycle technical recruiting, from developing sourcing strategies to closing top-tier technical talent. You are someone who loves building strong partnerships with candidates and stakeholders, and takes a feedback-oriented and data-driven approach to ensure a seamless recruiting process and a world-class candidate experience.\n\nWhat You'll Do:\n\n* Partner with our CTO/Co-Founder and engineering, product, and design (EPD) hiring managers to understand EPD teams and hiring needs, and act as a trusted advisor in developing and executing hiring plans and strategies. \n* Own the full-cycle recruitment process including: sourcing, screening, and closing top technical talent through various channels, as well as coordination. \n* Develop creative sourcing strategies and messaging to identify, attract, and hire top technical talent, building a strong talent pipeline for current and future hiring needs through online channels, networking, and events. \n* Conduct thorough interviews to effectively evaluate a candidate’s technical skills and cultural alignment. \n* Maintain a positive candidate experience with timely feedback and clear communication throughout the hiring process. \n* Be an advocate for a data-driven recruitment process. Have a deep understanding of recruiting pipelines, use recruiting metrics to influence and fine-tune the hiring process, and develop reports and dashboards. \n* Enhance recruiting processes, including interviewer training, documentation, and other process improvement initiatives. \n* Possess strong business acumen to develop trusting partnerships with stakeholders and candidates. \n\nAbout You:\n\n* 7+ years of experience as a full-cycle in-house Technical Recruiter, preferably in growth-stage SaaS startups. \n* Strong understanding of engineering, product, and design roles in a product-focused SaaS startup, with the ability to assess candidate technical skills and experience. \n* These roles include but are not limited to software engineers, data scientists, machine learning engineers, platform engineers, product managers, product designers, and EPD leadership. \n* Proven track record of sourcing and hiring top technical talent in a competitive market. \n* Experience negotiating complex offers, including equity packages, and closing candidates. \n* Proficiency in recruiting metrics - able to use conversion rates, passthrough rates, time-to-hire, offer acceptance rates, and other metrics to drive the recruiting process and fine-tune searches. \n* Experience in a modern Applicant Tracking System (ATS) like Ashby, Greenhouse, or Lever. \n* Excited by a startup environment and has a desire to contribute to defining recruiting processes and structure as we scale. \n* Bachelor's degree or related experience. \n\nBonus If You Have:\n\n* Experience in Ashby. \n* Experience in Gem or any sequencing tool for sourcing campaigns. \n* Experience developing recruiting dashboards & reports. \n\nMore about Fieldguide:\n\nFieldguide is a values-based company. Our values are:\n\n* Fearless - Inspire & break down seemingly impossible walls. \n* Fast - Launch fast with excellence, iterate to perfection. \n* Lovable - Deliver happiness & 11 star experiences. \n* Owners - Execute & run the business with ownership. \n* Win-win - Create mutual value & earn trust for life. \n* Inclusive - Scale the best ideas with inclusive teams. \n\nSome of our benefits include: \n\n* Competitive compensation packages with meaningful ownership\n* Unlimited PTO\n* 401k\n* Wellness benefits, including a bundle of free therapy sessions\n\nCompensation Range: $120K - $150K\n\n", "responsibilities": "Partner with our CTO/Co-Founder and engineering, product, and design (EPD) hiring managers to understand EPD teams and hiring needs, and act as a trusted advisor in developing and executing hiring plans and strategies. \nOwn the full-cycle recruitment process including: sourcing, screening, and closing top technical talent through various channels, as well as coordination. \nDevelop creative sourcing strategies and messaging to identify, attract, and hire top technical talent, building a strong talent pipeline for current and future hiring needs through online channels, networking, and events. \nConduct thorough interviews to effectively evaluate a candidate’s technical skills and cultural alignment. \nMaintain a positive candidate experience with timely feedback and clear communication throughout the hiring process. \nBe an advocate for a data-driven recruitment process. Have a deep understanding of recruiting pipelines, use recruiting metrics to influence and fine-tune the hiring process, and develop reports and dashboards. \nEnhance recruiting processes, including interviewer training, documentation, and other process improvement initiatives. \nPossess strong business acumen to develop trusting partnerships with stakeholders and candidates.", "qualifications": {"required": "7+ years of experience as a full-cycle in-house Technical Recruiter, preferably in growth-stage SaaS startups. \nStrong understanding of engineering, product, and design roles in a product-focused SaaS startup, with the ability to assess candidate technical skills and experience. \nThese roles include but are not limited to software engineers, data scientists, machine learning engineers, platform engineers, product managers, product designers, and EPD leadership. \nProven track record of sourcing and hiring top technical talent in a competitive market. \nExperience negotiating complex offers, including equity packages, and closing candidates. \nProficiency in recruiting metrics - able to use conversion rates, passthrough rates, time-to-hire, offer acceptance rates, and other metrics to drive the recruiting process and fine-tune searches. \nExperience in a modern Applicant Tracking System (ATS) like Ashby, Greenhouse, or Lever. \nExcited by a startup environment and has a desire to contribute to defining recruiting processes and structure as we scale. \nBachelor's degree or related experience.", "preferred": "Experience in Ashby. \nExperience in Gem or any sequencing tool for sourcing campaigns. \nExperience developing recruiting dashboards & reports."}, "skills": ["Sourcing", "Recruiting", "Technical Recruiting", "Talent Acquisition", "Talent Management", "Hiring", "Sourcing Strategies", "Candidate Experience", "Interviewing", "Data-Driven Recruiting", "Recruiting Metrics", "Applicant Tracking Systems", "Ashby", "Greenhouse", "Lever", "Gem", "Recruiting Dashboards", "Recruiting Reports"], "postedDate": "5 days ago", "benefits": "Competitive compensation packages with meaningful ownership\nUnlimited PTO\n401k\nWellness benefits, including a bundle of free therapy sessions", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002013766"}