{"jobTitle": "Mid Market Account Executive, LinkedIn Sales Solutions", "company": {"name": "LinkedIn", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "125,000.00/yr - 180,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "Company Description<br/><br/>LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.<br/><br/>Join us to transform the way the world works.<br/><br/>Job Description<br/><br/>At LinkedIn, we trust each other to do our best work where it works best for us and our teams. This role offers a hybrid work option, meaning you can both work from home and commute to a LinkedIn office, depending on what’s best for you and when it is important for your team to be together.<br/><br/>LinkedIn’s Sales Solutions team is dedicated to changing the world of sales through the use of Sales Navigator, our flagship product that connects and builds mutually beneficial relationships between buyers and sellers. As an Account Executive, you will use your strategic social selling skills to educate prospective customers on the benefits and value of Sales Navigator. You will serve as a trusted adviser, share insights and continually seek opportunities for growth to make your customers as strong and successful as possible.<br/><br/>Responsibilities: <br/><br/>\n<ul><li>Leverage your skills and your customers’ experience to continually evolve our product and the sales process </li><li>Manage full-cycle sales processes from sourcing an opportunity to closure </li><li>Develop and execute strategic plans for your territory and create reliable forecasts </li><li>Consistently over achieve the business and revenue objectives set forth in your plan </li><li>Drive revenue by connecting with customers and building opportunities that will make all parties more successful </li><li>Work to develop and circulate a set of best practices that will be the foundation of this growing team </li><li>Listen to the needs of the market and share them with the Product and Marketing team </li><li>Approach the role with a growth-oriented, learning, entrepreneurial mindset <br/><br/><br/></li></ul>Qualifications<br/><br/>Basic Qualifications : <br/><br/>\n<ul><li>4+ years in sales role including direct selling, business development or sales development </li><li>3+ years of full cycle quota carrying experience <br/><br/><br/></li></ul>Preferred Qualifications : <br/><br/>\n<ul><li>Experience in a SaaS-based environment </li><li>Experience using LinkedIn as a sales professional </li><li>Proven history of overachieving quota and results in a high-growth company </li><li>Demonstrated ability to source, manage and close high-level business-to-business sales </li><li>Ability to assess customer challenges, align solutions and read prospective buyers </li><li>Ability to predictably forecast and execute on business goals </li><li>Ability to use insights and data-driven decisions in the sales process </li><li>Ability to effectively build trust-based relationships with senior-level sales professionals </li><li>Ability to build consensus at speed among multiple, cross-functional decision makers and influencers in a single company </li><li>Ability to simultaneously manage a high volume of opportunities and transactions <br/><br/><br/></li></ul>Suggested Skills :  <br/><br/>\n<ul><li>Critical Thinking </li><li>Intellectually Curious </li><li>Goal Setting </li><li>Overcome Obstacles </li><li>Discovery Process <br/><br/><br/></li></ul><em>LinkedIn is committed to fair and equitable compensation practices. <br/><br/></em><em>The pay range for this role is $125,000 to $180,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor. <br/><br/></em><em>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.<br/><br/></em>Additional Information<br/><br/>Equal Opportunity Statement<br/><br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: EEO Statement_2020 - Signed.pdf.<br/><br/>Please reference the following information for more information: https://legal.linkedin.com/content/dam/legal/LinkedIn_EEO_Statement_2020.pdf.<br/><br/>Please reference the following information for more information: https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf and<br/><br/>https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/><br/>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.<br/><br/>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.<br/><br/>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:<br/><br/><ul><li>Documents in alternate formats or read aloud to you</li><li>Having interviews in an accessible location</li><li>Being accompanied by a service dog</li><li>Having a sign language interpreter present for the interview<br/><br/><br/></li></ul>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br/><br/>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>San Francisco Fair Chance Ordinance <br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pay Transparency Policy Statement <br/><br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates <br/><br/>Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.<br/><br/><br/>Equal Opportunity Statement<br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/> <br/>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response.<br/> <br/>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days.<br/> <br/> LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>Pay Transparency Policy Statement<br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates<br/>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice<br/>", "responsibilities": "Leverage your skills and your customers’ experience to continually evolve our product and the sales process \nManage full-cycle sales processes from sourcing an opportunity to closure \nDevelop and execute strategic plans for your territory and create reliable forecasts \nConsistently over achieve the business and revenue objectives set forth in your plan \nDrive revenue by connecting with customers and building opportunities that will make all parties more successful \nWork to develop and circulate a set of best practices that will be the foundation of this growing team \nListen to the needs of the market and share them with the Product and Marketing team \nApproach the role with a growth-oriented, learning, entrepreneurial mindset", "qualifications": {"required": "4+ years in sales role including direct selling, business development or sales development \n3+ years of full cycle quota carrying experience", "preferred": "Experience in a SaaS-based environment \nExperience using LinkedIn as a sales professional \nProven history of overachieving quota and results in a high-growth company \nDemonstrated ability to source, manage and close high-level business-to-business sales \nAbility to assess customer challenges, align solutions and read prospective buyers \nAbility to predictably forecast and execute on business goals \nAbility to use insights and data-driven decisions in the sales process \nAbility to effectively build trust-based relationships with senior-level sales professionals \nAbility to build consensus at speed among multiple, cross-functional decision makers and influencers in a single company \nAbility to simultaneously manage a high volume of opportunities and transactions"}, "skills": ["Critical Thinking", "Intellectually Curious", "Goal Setting", "Overcome Obstacles", "Discovery Process"], "postedDate": "4 days ago", "benefits": "LinkedIn is committed to fair and equitable compensation practices. \nThe pay range for this role is $125,000 to $180,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor. \nThe total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002933199"}