{"jobTitle": "Brand Partnerships Manager", "company": {"name": "TikTok", "industry": "Entertainment Providers, Internet Marketplace Platforms, and Advertising Services", "location": "Austin, Texas Metropolitan Area"}, "location": "Austin, Texas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Sales", "industry": "Entertainment Providers, Internet Marketplace Platforms, and Advertising Services", "description": "TikTok is the leading destination for short-form mobile video. At TikTok, our mission is to inspire creativity and bring joy. TikTok's global headquarters are in Los Angeles and Singapore, and its offices include New York, London, Dublin, Paris, Berlin, Dubai, Jakarta, Seoul, and Tokyo.\n\nWhy Join Us?\n\nCreation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible.\n\nTogether, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day.\n\nTo us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. S\n\ntatus quo? Never. Courage? Always.\n\nAt TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve.\n\nJoin us.\n\nAt TikTok, our Global Business Solutions (advertising) team plays a crucial role in generating revenue by promoting our advertising solutions, onboarding new clients, driving effective ad campaigns, and more. As the TikTok community grows at an unprecedented speed worldwide, our GBS team leads groundbreaking projects that are changing the landscape of the advertising industry in real-time.\n\nThis position sits within the SMB Growth team, which is a mid-market sales team that is part of the broader SMB sales team. The focus of this team is to connect TikTok's vibrant and growing creators and users with the brands and businesses they know and love. The Brand Partnerships Manager position is directly responsible for building relationships and helping advertising clients drive business results on TikTok through consultation, education, and support. We are searching for an advertising sales professional to enable Fortune 1000 marketers to exceed their potential through innovative growth strategies on TikTok. You will combine an exceptional ability to provide consultative selling; a passion for growing revenue; an outstanding ability to set strategic vision; and a willingness to execute the tactics. Success in this position requires strong sales (including prospecting new business), problem-solving skills, attention to detail, and the ability to thrive in an ever-changing environment. TikTok currently observes a hybrid working policy of 4 days in the office each week and 1 day working remotely. This position is full-time and based out of our Austin, TX office.\n\nResponsibilities: \n\n* Identify, prioritize, and secure business opportunities\n* Drive revenue for TikTok Advertising by seeking partnerships with various direct clients and agencies\n* Ensure that our clients receive the highest level of sales and operational customer service\n* Use a consultative approach by offering strategic advertising solutions to all clients\n* Create compelling sales propositions utilizing internal and external data for respective regions\n* Liaise with cross-functional teams on structuring and executing operational and strategic initiatives\n* Develop and implement best practices for client interaction, sales, and services\n* Create persuasive sales presentations using market trends and case studies\n* Ensure that our clients receive the highest level of sales and operational customer service\n* Update clients on TikTok products and developments and educate clients and agencies on best practices.\n\nQualifications\n\nMinimum Qualification:\n\n* Experience in digital advertising sales\n\nPreferred Qualifications:\n\n* Expert knowledge of social media, mobile apps, and digital and mobile marketing\n* Knowledge of the self-serve platform, auction, and biddable form of digital advertising buying\n* Proven performance winning the support of key stakeholders\n* Proven track record of reaching and exceeding sales goals\n* Ability to perform well in a rapidly changing environment\n* Creative, outside-the-box thinker, and strategist\n* Excellent communication and presentation skills\n* A team player and collaborator\n* Passion for TikTok marketing, and up for the challenge of building something from the bottom up\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\n\nTikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/cdpT2", "responsibilities": "Identify, prioritize, and secure business opportunities\nDrive revenue for TikTok Advertising by seeking partnerships with various direct clients and agencies\nEnsure that our clients receive the highest level of sales and operational customer service\nUse a consultative approach by offering strategic advertising solutions to all clients\nCreate compelling sales propositions utilizing internal and external data for respective regions\nLiaise with cross-functional teams on structuring and executing operational and strategic initiatives\nDevelop and implement best practices for client interaction, sales, and services\nCreate persuasive sales presentations using market trends and case studies\nEnsure that our clients receive the highest level of sales and operational customer service\nUpdate clients on TikTok products and developments and educate clients and agencies on best practices.", "qualifications": {"required": "Experience in digital advertising sales", "preferred": "Expert knowledge of social media, mobile apps, and digital and mobile marketing\nKnowledge of the self-serve platform, auction, and biddable form of digital advertising buying\nProven performance winning the support of key stakeholders\nProven track record of reaching and exceeding sales goals\nAbility to perform well in a rapidly changing environment\nCreative, outside-the-box thinker, and strategist\nExcellent communication and presentation skills\nA team player and collaborator\nPassion for TikTok marketing, and up for the challenge of building something from the bottom up"}, "skills": ["Digital Advertising", "Social Media", "Mobile Apps", "Digital Marketing", "Mobile Marketing", "Sales", "Strategic Vision", "Problem Solving", "Communication", "Presentation Skills", "Teamwork", "TikTok Marketing"], "postedDate": "1 day ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002158263"}