{"jobTitle": "Product Manager II, Curation", "company": {"name": "Pinterest", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet, Software Development, and IT Services and IT Consulting", "description": "About Pinterest<br/><br/>Millions of people across the world come to Pinterest to find new ideas every day. It’s where they get inspiration, dream about new possibilities and plan for what matters most. Our mission is to help those people find their inspiration and create a life they love. In your role, you’ll be challenged to take on work that upholds this mission and pushes Pinterest forward. You’ll grow as a person and leader in your field, all the while helping Pinners make their lives better in the positive corner of the internet.<br/><br/>Creating a life you love also means finding a career that celebrates the unique perspectives and experiences that you bring. As you read through the expectations of the position, consider how your skills and experiences may complement the responsibilities of the role. We encourage you to think through your relevant and transferable skills from prior experiences.<br/><br/><em>Our new progressive work model is called PinFlex, a term that’s uniquely Pinterest to describe our flexible approach to living and working. Visit our </em><em>PinFlex</em><em> landing page to learn more. <br/><br/></em>The Curation team at Pinterest is seeking a Product Manager to drive experiences that allow Pinners to meaningfully engage with their favorite content to help navigate the inspiration to realization journey. This role will drive some of the most critical investments on Pinterest and will get to work on some of the most loved features on Pinterest that are used by 10s of millions of Piners everyday. The experiences you envision and build with a world class team of engineers, designers, and researchers will directly drive engagement and shopping on Pinterest. Come join the team that’s at the heart of the Pinterest experience, and make your mark on how Pinners enrich their lives and make their dreams a reality!<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Work on product strategy, development, and execution for curation experiences at Pinterest, such as the Boards surface</li><li>Deliver an engaging, cohesive, and frictionless experience for hundreds of millions of Pinners who are looking to get more out of their saved content</li><li>Partner closely with engineering, design, research and analytics to define, measure, and drive execution: understand diverse Pinner needs to create experiences that match our wide breadth of audiences and business objectives</li><li>Collaborate across product teams to drive alignment and resolve dependencies, creating a unified vision for the Boards experience and how teams come together to create that experience<br/><br/><br/></li></ul><strong>What We’re Looking For<br/><br/></strong><ul><li>Demonstrated success in product management or related experience at fast-growing companies</li><li>Experience developing full-stack consumer-facing experiences at scale and advocating for your vision of these experiences</li><li>Proven ability to work cross-functionally and cross-team/org to deliver great user experiences on time in a highly collaborative environment, influencing, escalating, and establishing working models where needed to move quickly across teams</li><li>Ability to move quickly and make appropriate trade-offs based on data analysis and qualitative feedback from Pinners<br/><br/><br/></li></ul><strong>Relocation Statement:<br/><br/></strong><ul><li>This position is not eligible for relocation assistance. Visit our PinFlex page to learn more about our working model.<br/><br/><br/></li></ul><strong>In-Office Requirement Statement<br/><br/></strong><ul><li>We let the type of work you do guide the collaboration style. That means we're not always working in an office, but we continue to gather for key moments of collaboration and connection.</li><li>This role will need to be in the office for in-person collaboration 1-2 times/quarter and therefore can be situated anywhere in the country.<br/><br/><br/></li></ul>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<br/><br/><em>Information regarding the culture at Pinterest and benefits available for this position can be found here.<br/><br/></em>US based applicants only<br/><br/>$101,382—$209,296 USD<br/><br/><strong>Our Commitment To Diversity<br/><br/></strong>Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require an accommodation during the job application process, please notify accessibility@pinterest.com for support.<br/><br/>", "postedDate": "4 days ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002284028"}