{"jobTitle": "Product Manager", "company": {"name": "WISEcode", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management", "industry": "Data Infrastructure and Analytics", "description": "Job Title: Product Manager\nLocation: Remote \nCompany: WISEcode\n\nAbout WISEcode:\nWISEcode is on a mission to increase transparency around what's in the food we eat by offering innovative applications powered by a comprehensive nutrition database. At the forefront of revolutionizing the food industry, our advanced mobile app measures how processed packaged food is, providing consumers with the insights they need to make healthier choices. We're committed to leveraging cutting-edge technology, including data engineering, analytics, machine learning, and AI, to transform how people make food decisions and ensure everyone can access the information they need for a healthier lifestyle.\n\nWe're building the world's most comprehensive food database, offering unparalleled insights into packaged foods' nutritional and processing aspects. Using advanced technology, AI, and data analytics empowers consumers to make informed decisions. As a rapidly growing tech company, we seek ambitious, data-driven individuals passionate about AI and data science to join our dynamic team.\n\nPosition Overview:\nWe are seeking an experienced and data-driven Product Manager with a deep passion for data engineering, data analytics, and artificial intelligence to lead our product development efforts.\nThe ideal candidate will have a strong background in building and managing data-centric products, with a proven ability to drive innovation in AI and machine learning applications. As a Product Manager at WISEcode, you will play a key role in shaping the future of our products, working closely with cross-functional teams to bring our vision to life.\n\nKey Responsibilities:\n\n* Lead the development and enhancement of data-driven products, focusing on data engineering, analytics, machine learning, and AI.\n* Define and prioritize features that leverage data to deliver actionable insights to consumers.\n* Collaborate with data scientists, engineers, and designers to create and refine our comprehensive food database.\n* Utilize data analytics and user feedback to inform product strategy and continuous improvement.\n* Oversee the integration of AI and machine learning algorithms to enhance product capabilities.\n* Develop detailed product specifications, user stories, and data models to guide development teams.\n* Drive product testing, quality assurance, and validation to ensure data accuracy and performance.\n* Monitor product performance, analyzing key metrics to drive data-informed decisions.\n* Mentor and guide Associate Product Managers, fostering growth within the team.\n\nQualifications:\n\n* Proven experience as a Product Manager, particularly in data-driven environments.\n* Strong technical background in data engineering, data analytics, machine learning, and AI.\n* Demonstrated ability to build and manage large-scale databases and data-centric products.\n* Experience with AI and machine learning applications, with a focus on consumer-facing products.\n* Excellent problem-solving skills, with a strategic and analytical mindset.\n* Strong communication skills, both written and verbal, with the ability to convey complex data concepts clearly.\n* Ability to thrive in a fast-paced, dynamic environment and manage multiple projects simultaneously.\n* Passion for health, wellness, and using data to make a positive impact through technology.\n\nWhy Join WISEcode:\n\n* Opportunity to lead in a fast-paced, innovative environment focused on data and AI.\n* Be part of a mission-driven company making a positive impact on consumers' health and wellness.\n* Collaborative and supportive team culture with opportunities for professional growth and development.\n* Competitive salary and benefits package.\n\nIf you are an experienced Product Manager with a passion for data engineering, analytics, and AI, and a desire to drive meaningful change in the food industry ,we want to hear from you.\nApply now to join our team at WISEcode and help us transform how people make food choices!\n\nHow to Apply:\nPlease submit your resume and a cover letter detailing your relevant experience and why you are interested in the Product Manager role at WISEcode to <u>jobs@wisecode.a</u>i", "responsibilities": "Lead the development and enhancement of data-driven products, focusing on data engineering, analytics, machine learning, and AI.Define and prioritize features that leverage data to deliver actionable insights to consumers.Collaborate with data scientists, engineers, and designers to create and refine our comprehensive food database.Utilize data analytics and user feedback to inform product strategy and continuous improvement.Oversee the integration of AI and machine learning algorithms to enhance product capabilities.Develop detailed product specifications, user stories, and data models to guide development teams.Drive product testing, quality assurance, and validation to ensure data accuracy and performance.Monitor product performance, analyzing key metrics to drive data-informed decisions.Mentor and guide Associate Product Managers, fostering growth within the team.", "qualifications": {"required": "Proven experience as a Product Manager, particularly in data-driven environments.Strong technical background in data engineering, data analytics, machine learning, and AI.Demonstrated ability to build and manage large-scale databases and data-centric products.Experience with AI and machine learning applications, with a focus on consumer-facing products.Excellent problem-solving skills, with a strategic and analytical mindset.Strong communication skills, both written and verbal, with the ability to convey complex data concepts clearly.Ability to thrive in a fast-paced, dynamic environment and manage multiple projects simultaneously.Passion for health, wellness, and using data to make a positive impact through technology."}, "skills": ["Data Engineering", "Data Analytics", "Machine Learning", "AI", "Product Management"], "postedDate": "5 days ago", "benefits": "Competitive salary and benefits package.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002211199"}