{"jobTitle": "Senior Technical Account Manager", "company": {"name": "New Relic", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development and Technology, Information and Internet", "description": "<strong>Your opportunity<br/></strong>The Technical Success Manager (TSM) will be responsible for the technical relationship with our largest commercial customers, acting as their technical champion with accountability to drive customer adoption and value realization with our platform. You will be explicitly driving consumption through the usage of our platform. This role involves close collaboration with Account Executives to articulate and demonstrate the technical benefits of New Relic’s solutions, ensuring customers understand the value and efficiency our platform brings to their operations. As a TSM, you will lead the customer journey, taking the customer from onboarding adoption to value realization and beyond, ensuring a high level of customer satisfaction.<br/><br/><strong>What you'll do<br/><br/></strong><ul><li>Guiding Customer to Initial Committed Consumption: Work alongside customers during the onboarding process, understanding their needs and guiding them through onboarding best practices. Monitor adoption and address any hurdles to ensure prompt achievement of committed usage levels. Through value-based activities, TSMs will plan and proactively drive consumption and usage across our customer accounts. Their actions will improve customer experience with the New Relic platform, increasing adoption and consumption. <br/><br/><br/></li></ul>Owning User Success through Training and Enablement: Lead personalized training sessions and create resources like documentation, videos, and articles to empower users to fully leverage New Relic solutions. Promote a culture of continuous learning and development.<br/><br/><ul><li>Managing Mutual Activity Plan Milestones: Designs and executes Mutual Activity Plans tied to Value/Outcomes. Set and oversee clear project milestones, adjust plans as necessary, celebrate customer achievements and moments of value, and address deviations in a timely manner.</li><li>Providing Customer Business Review Inputs: Utilize insights from customer interactions and data analytics to contribute valuable information for business reviews and identify successes, challenges, and growth opportunities.</li><li>Maintaining Committed Consumption Levels: Engage proactively with customers to mitigate churn risks, demonstrating ongoing value and addressing concerns promptly.</li><li>Owning Technical Relationships: Build strong connections with technical stakeholders, understand their challenges and goals, and advocate for them within New Relic.</li><li>Facilitating Ongoing User Training: Keep users informed about new features and enhancements and provide refresher training to ensure continued proficiency and satisfaction.</li><li>Supporting Business Case Development for New Opportunities: Work with sales to identify and develop expansion opportunities, using success stories and ROI evidence to support business cases.</li><li>Supporting Measuring and Communicating Value to Technical Stakeholders: Work closely with technical decision-makers. Quantify the impact of New Relic's solutions on their business. Provide regular reports and dashboards showcasing value metrics.<br/><br/><br/></li></ul><strong>This role requires<br/><br/></strong><ul><li>BS or equivalent in Computer Science or Computer Engineering plus 4 + years of experience as Principal Technical Support, Solutions Engineering, or Technical Account Management for a SaaS enterprise software company</li><li>Certified or equivalent experience in Cloud technology (AWS, Azure, or Google Cloud Platform)</li><li>Deep understanding working with containerized applications (K8) </li><li>2 + years of experience with Java or another programming language (javascript, node.js, Python, Ruby, Go) </li><li>Experience with supporting SaaS products focused on Observability (New Relic, Dynatrace, DataDog, Sumo)</li><li>Excellent English verbal and written communications</li><li>Experienced with orientation and excellent interpersonal skills</li><li>Excellent analytical and problem solving skills</li><li>Mastery at mapping technical solutions to meet customer business needs.</li><li>Proven ability to cultivate relationships and becoming a trusted advisor</li><li>Excellent client management skills, bias for action, taking accountability, a validated ability to perform hands on technical work, and ability to lead projects and global teams.<br/><br/><br/></li></ul><strong>Bonus points if you have<br/><br/></strong><ul><li>Experience with Software Application requirement gathering, design, and product development</li><li>Experience with Continuous Deployment and Deliver tools; Chef, Puppet, Ansible</li><li>Experience with Continuous integration tools: CI Server, VCS, Artifactory, Jenkins, And, Hudson, Maven, Chef, Docker, Gradle, NPM</li><li>An uncompromising desire to learn</li><li>Experience with customer success and sales frameworks (medpic, meddipicc)</li><li>Proficient verbal and written skills in Portuguese or Spanish language<br/><br/><br/></li></ul>Fostering a diverse, welcoming and inclusive environment is important to us. We work hard to make everyone feel comfortable bringing their best, most authentic selves to work every day. We celebrate our talented Relics’ different backgrounds and abilities, and recognize the different paths they took to reach us – including nontraditional ones. Their experiences and perspectives inspire us to make our products and company the best they can be. We’re looking for people who feel connected to our mission and values, not just candidates who check off all the boxes.<br/><br/>If you require a reasonable accommodation to complete any part of the application or recruiting process, please visit https://newrelic.avature.net/accommodations to submit your request.<br/><br/>We believe in empowering all Relics to achieve professional and business success through a flexible workforce model. This model allows us to work in a variety of workplaces that best support our success, including fully office-based, fully remote, or hybrid.<br/><br/><strong>Our hiring process<br/><br/></strong>Please note that visa sponsorship is not available for this position.<br/><br/>In compliance with applicable law, all persons hired will be required to verify identity and eligibility to work and to complete employment eligibility verification. Note: Our stewardship of the data of thousands of customers’ means that a criminal background check is required to join New Relic.<br/><br/>We will consider qualified applicants with arrest and conviction records based on individual circumstances and in accordance with applicable law including, but not limited to, the San Francisco Fair Chance Ordinance.<br/><br/>Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. New Relic does not accept unsolicited headhunter and agency resumes, and will not pay fees to any third-party agency or company that does not have a signed agreement with New Relic.<br/><br/>New Relic is proud to be an equal opportunity employer. We foster a diverse, equitable, and inclusive environment, free from all types of discrimination, so our Relics can thrive. We hire people with different backgrounds, experiences, abilities and perspectives.<br/><br/>Candidates are evaluated based on qualifications, regardless of race, religion, ethnicity, national origin, sex, sexual orientation, gender expression or identity, age, disability, neurodiversity, veteran or marital status, political viewpoint, or other legally protected characteristics.<br/><br/>Review our Applicant Privacy Notice at https://newrelic.com/termsandconditions/applicant-privacy-policy.<br/><br/>Estimated On-Target Earnings Range: $ 196000 - $ 244000<br/><br/>The pay range above represents a reasonable estimate of the on target earnings (salary plus target sales incentives) for the listed position. This role is eligible for a commission plan (as defined in the sales incentive plan document). Pay within this range varies by work location and may also depend on job-related factors such as an applicant’s skills, qualifications, and experience.<br/><br/>New Relic provides a variety of benefits for this role, including healthcare, dental, vision, parental leave and planning, mental health benefits, a 401(k) plan and match, flex time-off, 11 paid holidays, volunteer time off, and other competitive benefits designed to improve the lives of our employees.<br/><br/>", "responsibilities": "<ul><li>Guiding Customer to Initial Committed Consumption: Work alongside customers during the onboarding process, understanding their needs and guiding them through onboarding best practices. Monitor adoption and address any hurdles to ensure prompt achievement of committed usage levels. Through value-based activities, TSMs will plan and proactively drive consumption and usage across our customer accounts. Their actions will improve customer experience with the New Relic platform, increasing adoption and consumption. <br/><br/><br/></li></ul>Owning User Success through Training and Enablement: Lead personalized training sessions and create resources like documentation, videos, and articles to empower users to fully leverage New Relic solutions. Promote a culture of continuous learning and development.<br/><br/><ul><li>Managing Mutual Activity Plan Milestones: Designs and executes Mutual Activity Plans tied to Value/Outcomes. Set and oversee clear project milestones, adjust plans as necessary, celebrate customer achievements and moments of value, and address deviations in a timely manner.</li><li>Providing Customer Business Review Inputs: Utilize insights from customer interactions and data analytics to contribute valuable information for business reviews and identify successes, challenges, and growth opportunities.</li><li>Maintaining Committed Consumption Levels: Engage proactively with customers to mitigate churn risks, demonstrating ongoing value and addressing concerns promptly.</li><li>Owning Technical Relationships: Build strong connections with technical stakeholders, understand their challenges and goals, and advocate for them within New Relic.</li><li>Facilitating Ongoing User Training: Keep users informed about new features and enhancements and provide refresher training to ensure continued proficiency and satisfaction.</li><li>Supporting Business Case Development for New Opportunities: Work with sales to identify and develop expansion opportunities, using success stories and ROI evidence to support business cases.</li><li>Supporting Measuring and Communicating Value to Technical Stakeholders: Work closely with technical decision-makers. Quantify the impact of New Relic's solutions on their business. Provide regular reports and dashboards showcasing value metrics.<br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>BS or equivalent in Computer Science or Computer Engineering plus 4 + years of experience as Principal Technical Support, Solutions Engineering, or Technical Account Management for a SaaS enterprise software company</li><li>Certified or equivalent experience in Cloud technology (AWS, Azure, or Google Cloud Platform)</li><li>Deep understanding working with containerized applications (K8) </li><li>2 + years of experience with Java or another programming language (javascript, node.js, Python, Ruby, Go) </li><li>Experience with supporting SaaS products focused on Observability (New Relic, Dynatrace, DataDog, Sumo)</li><li>Excellent English verbal and written communications</li><li>Experienced with orientation and excellent interpersonal skills</li><li>Excellent analytical and problem solving skills</li><li>Mastery at mapping technical solutions to meet customer business needs.</li><li>Proven ability to cultivate relationships and becoming a trusted advisor</li><li>Excellent client management skills, bias for action, taking accountability, a validated ability to perform hands on technical work, and ability to lead projects and global teams.<br/><br/><br/></li></ul>", "preferred": "<ul><li>Experience with Software Application requirement gathering, design, and product development</li><li>Experience with Continuous Deployment and Deliver tools; Chef, Puppet, Ansible</li><li>Experience with Continuous integration tools: CI Server, VCS, Artifactory, Jenkins, And, Hudson, Maven, Chef, Docker, Gradle, NPM</li><li>An uncompromising desire to learn</li><li>Experience with customer success and sales frameworks (medpic, meddipicc)</li><li>Proficient verbal and written skills in Portuguese or Spanish language<br/><br/><br/></li></ul>"}, "skills": ["AWS", "Azure", "Google Cloud Platform", "K8", "Java", "javascript", "node.js", "Python", "Ruby", "Go", "New Relic", "Dynatrace", "DataDog", "Sumo", "Chef", "Puppet", "Ansible", "CI Server", "VCS", "Artifactory", "Jenkins", "Hudson", "Maven", "Docker", "Gradle", "NPM", "medpic", "meddipicc", "Portuguese", "Spanish"], "postedDate": "1 day ago", "benefits": "New Relic provides a variety of benefits for this role, including healthcare, dental, vision, parental leave and planning, mental health benefits, a 401(k) plan and match, flex time-off, 11 paid holidays, volunteer time off, and other competitive benefits designed to improve the lives of our employees.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002182628"}