{"jobTitle": "Talent Acquisition Specialist", "company": {"name": "Mendocino Farms", "location": "San Francisco Bay Area"}, "location": "San Francisco Bay Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "75,000.00 - 95,000.00", "currency": "USD"}, "jobFunction": "Administrative and Human Resources", "industry": "Restaurants and Hospitality", "description": "<strong>Filed Recruiter - FULL-TIME – Remote</strong><p><br/></p><p><strong>San Francisco (Bay Area)</strong></p><p><br/></p><p><strong>$75,000 - $95,000 per year, based on experience</strong></p><p><br/></p><p>We’re not just selling sandwiches and salads. We’re selling Happy!</p><p><br/></p><p><strong>Perks and Benefits:</strong></p><ul><li>Health, Dental, Vision, Life Insurance</li><li>401(k) Match and other ancillary benefits</li><li>Paid Sick Leave</li><li>Employee assistance program</li><li>Bonus Program</li><li>Parking &amp; Transit Reimbursement</li><li>Discounted tickets through Working Advantage</li><li>Pet Insurance</li><li>Free and delicious Mendo Meals</li><li>Clear path for growth and development</li></ul><p><br/></p><p><strong>Position Summary:</strong> </p><p>The Field Recruiter will play a critical role in driving Mendocino Farms' growth and success by sourcing, attracting, and hiring top talent for our restaurant locations. This position requires a proactive, results-driven professional with high-volume recruiting experience, particularly in the fast-casual or hospitality industry. The Field Recruiter will partner and work closely with our Directors of Operations to identify staffing needs, develop recruiting strategies, and ensure a smooth and efficient hiring process.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Proactively source, screen, and interview candidates for various restaurant management and hourly positions, ensuring alignment with Mendocino Farms’ values and culture.</li><li>Partner with Regional Directors of Operations and General Managers to understand specific staffing needs and develop targeted recruiting strategies.</li><li>Build and maintain a robust pipeline of qualified candidates through networking, job fairs, community events, social media, and other creative sourcing strategies.</li><li>Track and report on key recruiting metrics, such as time-to-fill, candidate quality, and hire-to-interview ratios, and use data to continuously improve the recruiting process.</li><li>Promote Mendocino Farms as an employer of choice by actively engaging with candidates and maintaining a positive candidate experience throughout the recruitment process.</li><li>Ensure compliance with all relevant employment laws and regulations, as well as company policies and procedures, during the recruitment and hiring process.</li><li>Collaborate with HR and Operations teams to ensure a smooth onboarding process for new hires, including coordination of orientation and training programs.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>Minimum of 3-5 years of recruiting experience, preferably within the fast-casual, hospitality, or restaurant industry.</li><li>Strong sourcing, interviewing, and candidate assessment skills, with a proven track record of successfully filling high-volume, high-impact positions.</li><li>Excellent verbal and written communication skills, with the ability to build relationships and influence stakeholders at all levels.</li><li>Proficiency in applicant tracking systems (ATS) and recruiting tools, as well as strong knowledge of social media recruiting strategies.</li><li>Willingness to travel as needed to various restaurant locations within the assigned region.</li><li>A passion for people, food, and community, with a strong alignment to Mendocino Farms’ mission and values.</li></ul><p><br/></p><p><br/></p><p><strong>There is no “I” in Mendo.</strong></p><p>Mendocino Farms is an equal-opportunity employer that values diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. Mendocino Farms will consider qualified applicants with criminal histories for employment in a manner consistent with the requirements of the Fair Chance Initiative for Hiring.</p><p><br/></p><p><em>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.</em></p><p></p>", "responsibilities": "Proactively source, screen, and interview candidates for various restaurant management and hourly positions, ensuring alignment with Mendocino Farms’ values and culture. Partner with Regional Directors of Operations and General Managers to understand specific staffing needs and develop targeted recruiting strategies. Build and maintain a robust pipeline of qualified candidates through networking, job fairs, community events, social media, and other creative sourcing strategies. Track and report on key recruiting metrics, such as time-to-fill, candidate quality, and hire-to-interview ratios, and use data to continuously improve the recruiting process. Promote Mendocino Farms as an employer of choice by actively engaging with candidates and maintaining a positive candidate experience throughout the recruitment process. Ensure compliance with all relevant employment laws and regulations, as well as company policies and procedures, during the recruitment and hiring process. Collaborate with HR and Operations teams to ensure a smooth onboarding process for new hires, including coordination of orientation and training programs.", "qualifications": {"required": "Minimum of 3-5 years of recruiting experience, preferably within the fast-casual, hospitality, or restaurant industry. Strong sourcing, interviewing, and candidate assessment skills, with a proven track record of successfully filling high-volume, high-impact positions. Excellent verbal and written communication skills, with the ability to build relationships and influence stakeholders at all levels. Proficiency in applicant tracking systems (ATS) and recruiting tools, as well as strong knowledge of social media recruiting strategies. Willingness to travel as needed to various restaurant locations within the assigned region. A passion for people, food, and community, with a strong alignment to Mendocino Farms’ mission and values."}, "skills": [], "postedDate": "7 hours ago", "benefits": "Health, Dental, Vision, Life Insurance, 401(k) Match and other ancillary benefits, Paid Sick Leave, Employee assistance program, Bonus Program, Parking & Transit Reimbursement, Discounted tickets through Working Advantage, Pet Insurance, Free and delicious Mendo Meals, Clear path for growth and development", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002818630"}