{"jobTitle": "Customer Support Specialist - Remote | WFH", "company": {"name": "Get It Recruit - Marketing", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Human Resources Services", "description": "Remote Customer Support Specialist<br/><br/>Are you passionate about helping others and solving technical issues? We're looking for a Remote Customer Support Specialist to join our team and provide top-notch assistance to our customers as they navigate our products and services.<br/><br/><strong>About The Role<br/><br/></strong>As a Customer Support Specialist, you'll be the go-to person for our customers, helping them resolve their queries, guiding them through features, and recommending the best solutions. Your role is crucial in building trust and ensuring a positive experience for our users.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Customer Assistance: Respond promptly to customer inquiries via phone, email, or chat, ensuring a positive and supportive experience.<br/><br/>Feature Guidance: Understand customer needs and assist them in utilizing specific product features effectively.<br/><br/>Troubleshooting: Investigate and report any product malfunctions by testing various scenarios and replicating user issues.<br/><br/>Database Management: Keep our internal databases updated with details of technical issues and helpful customer interactions.<br/><br/>Social Media Monitoring: Keep an eye on customer feedback on social media and proactively reach out to offer support.<br/><br/>Collaboration: Share customer feature requests and successful solutions with your team, fostering a collaborative environment.<br/><br/>Customer Education: Inform customers about new features and functionalities to enhance their user experience.<br/><br/>Follow-Up: Ensure all technical issues are fully resolved by following up with customers.<br/><br/>Feedback Gathering: Collect valuable customer feedback and relay it to our Product, Sales, and Marketing teams to drive improvements.<br/><br/>Mentorship: Support the training and development of junior Customer Support team members.<br/><br/><strong>What We're Looking For<br/><br/></strong>To thrive in this role, you should be an excellent communicator who can build trust with our customers. Familiarity with help desk software and a strong problem-solving mindset are essential for success.<br/><br/>Why Join Us?<br/><br/>You'll play a key role in shaping the customer experience and our company's reputation for exceptional support throughout the sales and after-sales processes. If you're excited about making a difference and helping customers succeed, we'd love to hear from you!<br/><br/>Employment Type: Full-Time", "postedDate": "22 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002162483"}