{"jobTitle": "Supply Chain Manager", "company": {"name": "Confidential Company", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Supply Chain, Purchasing, and Analyst", "industry": "Transportation, Logistics, Supply Chain and Storage and Hospitals and Health Care", "description": "We are seeking an analytically charged, highly experienced Supply Chain Manager to oversee and optimize supply chain operations at a tech manufacturing and distribution company in Boca Raton, FL. In this new role, the ideal candidate will be responsible for organizing and maximizing efficiency and productivity of the supply chain function.", "responsibilities": "- Run and manage a steady-state supply chain department that ultimately enhances operational efficiency\n- Collaborate with on and offsite manufacturing, warehousing and distribution teams to ensure the obtainment and timely coordination of critical manufacturing materials\nIdentify excess inventory, supply gaps, potential supply disruptions and work with local Supply Chain team to mitigate any possible risk. \n Provide training and support on inventory tools and objectives.\n \nS&OP inventory process owner, including but not limited to: \n-Assess SSL on a dynamic basis, based on business trends and operational needs. \n-Drive cost saving initiatives and assess potential business opportunities, such as inventory rebalancing between manufacturing sites. \n-Support sites recovery plans from an inventory standpoint. \n \n- Utilize data analytics tools like SAP, Access, SQL, etc. to use supply chain data to make informed decisions that make positive impacts on the overall business\n- Lead and manage continuous improvement initiatives for the supply chain team: such as Lean, Kaizen, and Root Cause Analysis to streamline processes\n- Manage relationships with suppliers and vendors to ensure timely delivery of materials\n- Oversee inventory management to ensure critical supplies are on hand, as needed\n- Manage and develop associates within the department\n- Lead cross-functional teams to drive material success on projects and initiatives; seeks to advance self through experiential learning, process improvement and team development", "qualifications": {"required": "Bachelor's degree in Business Administration, or a related field; MBA preferred.\n- 10 or more years of purchasing, supply chain and inventory management is required\n-Previous supply chain management experience is required including purchasing, inventory accuracy and logistics\n- Strong analytical skills with the ability to interpret complex data sets; must be adept at presenting complex information and ideas to employees and management\n- Excellent communication and interpersonal with proven abilities to collaborate effectively across departments\n- Experience managing a team; demonstrate a positive influence on others outside of the department", "preferred": "*** Ability to work onsite is required; this is an ONSITE ROLE ***"}, "skills": ["Supply Chain", "Inventory Management", "Purchasing", "Logistics", "Data Analysis", "SAP", "Access", "SQL", "Lean", "Kaizen", "Root Cause Analysis", "Team Management", "Communication", "Interpersonal Skills"], "postedDate": "21 hours ago", "benefits": "401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nEmployee discount\nHealth insurance\nLife insurance\nPaid time off\nProfessional development assistance\nReferral program\nRelocation assistance\nRetirement plan\nVision insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002140132"}