{"jobTitle": "Marketing Manager", "company": {"name": "Solomon Page", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Marketing", "industry": "Technology, Information and Media", "description": "Our client, a large ecommerce company in Austin, is looking for a Marketing Manager for an 11-month contract position. In this role, you will drive marketing programs aimed at building brand awareness and increasing product adoption. You will work closely with sales teams to provide them with necessary marketing collateral and tools to help them achieve their targets. Additionally, you will be responsible for planning, executing, and optimizing online campaigns, including email and web campaigns, as well as digital placements.", "responsibilities": "Develop and implement marketing strategies to drive brand awareness and product adoption.\nCollaborate with sales teams to provide collateral, tools, and resources to support direct sales efforts.\nPlan, execute, and manage digital marketing campaigns, including email marketing and web placements.\nTrack and analyze campaign performance, including metrics such as conversion rates, ROI, and engagement.\nPresent data-driven insights to improve ongoing marketing initiatives and identify areas of opportunity.\nManage relationships with external vendors, partners, and agencies to ensure the successful execution of marketing programs.\nEnsure that marketing campaigns are aligned with brand guidelines and business goals.\nConduct market research and competitor analysis to identify trends and inform strategic decisions.\nStay up-to-date with digital marketing trends, tools, and best practices.", "qualifications": {"required": "3-5 years of experience in marketing, with a focus on digital and content marketing.\nProven experience in managing successful online marketing campaigns, including email, web, and paid media.\nStrong analytical skills with the ability to interpret data and generate actionable insights.\nProficiency with marketing automation tools, CRM platforms, and analytics software (e.g., Google Analytics, HubSpot).\nExcellent communication and presentation skills.\nAbility to manage multiple projects simultaneously and meet deadlines in a fast-paced environment.\nCreative thinker with strong problem-solving skills and attention to detail.\nTeam player with experience collaborating across departments such as sales, product, and creative teams."}, "skills": ["Marketing", "Digital Marketing", "Content Marketing", "Email Marketing", "Web Marketing", "Paid Media", "Marketing Automation", "CRM", "Google Analytics", "HubSpot", "Communication", "Presentation Skills", "Project Management", "Problem Solving", "Teamwork"], "postedDate": "1 day ago", "benefits": "Solomon Page offers a comprehensive benefit program for hourly employees. We pride ourselves on offering medical, dental, 401(k), direct deposit and commuter benefits to our employees, including freelancers - which sets us apart in the industries we serve.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4002119368"}