{"jobTitle": "Customer Care Representative", "company": {"name": "BLANCO America", "location": "Colorado, United States"}, "location": "Colorado, United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "industry": "Manufacturing", "description": "BLANCO America is currently seeking Customer Care Representatives to join our team for the Central and Mountain Time Zones. In this role, you will be responsible for providing a premium service experience for all <em>BLANCO</em> customers throughout the product lifecycle. Your duties will include answering phone calls and emails, resolving customer inquiries and complaints, and ensuring customer satisfaction.", "responsibilities": "Provide a premium experience through all customer interactions (emails, phones, social media)\nProvide accurate and complete information to the customer to resolve issues in a timely and efficient manner\nProvide accurate information about BLANCO products\nBecome a product expert &amp; function actively as a brand ambassador\nActively participate in creating a customer centric culture to deliver a premium level of service\nCollaborate with third party agents, gather customer feedback, and drive continuous improvement within the BLANCO team and within our agencies\nBecome market &amp; channel champions with a clear focus on account ownership\nDevelop deep customer relationships to drive brand loyalty\nMaintain a professional, friendly manner at all times\nActively participate in the company’s revenue growth by upselling and product consulting", "qualifications": {"required": "High school diploma or equivalent\nMust possess a minimum of 3 years of customer service experience\nStrong data-entry skills\nProficient computer skills and experience with SAP, customer service software, Microsoft Office Suite, digitalization (Phones, etc.)\nExcellent phone etiquette and active listening\nConsumer centric mind-set (go above and beyond)\nSuperior interpersonal, verbal and written communication skills\nAbility to adapt/respond to different personalities in a friendly, competent manner\nWork with internal departments to meet customer needs, self-driven and team oriented\nAbility to multi-task, prioritize and manage time effectively\nStrong analytical skills and continuous improvement mindset \nPrevious experience in CRM implementation an asset ", "preferred": null}, "skills": ["SAP", "Customer Service", "Microsoft Office", "CRM", "Phone Etiquette", "Active Listening", "Communication", "Data Entry"], "postedDate": "4 days ago", "applicationDeadline": null, "benefits": "BLANCO offers a wide range of benefits, designed to help our employees thrive professionally and personally. In addition to highly competitive pay, we offer 401(k) with company match, comprehensive medical, dental and vision benefits, including a robust wellness program; paid time off for vacation, holidays, and sick days; and much more.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002065176"}