{"jobTitle": "Director of Partnerships", "company": {"name": "Stelfox Tech Recruitment", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "postedDate": "4 days ago", "description": "<strong>GTM Cloud Partnerships Director</strong><p><br/></p><p>My client specializes in using advanced Machine Learning and Artificial Intelligence to classify and secure unstructured data in real-time. Their platform is designed to discover, categorize, and classify documents and emails across an entire environment, both on-premises and in the cloud. These classifications are critical for enforcing protection on sensitive data, while also providing comprehensive risk and compliance assessments.</p><p><br/></p><p><strong>About the Role:</strong></p><p>As they continue to expand their influence in the cloud data security sector, they are in search of a highly experienced professional to take on the role of GTM Director, Partnership Lead. This pivotal role focuses on developing and executing strategic go-to-market plans while spearheading key partnerships with leading cloud providers. The ideal candidate will have extensive experience working with top-tier DSPM providers, coupled with a proven ability to drive and manage successful partnerships within the cloud ecosystem.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><p><br/></p><ul><li>Strategic GTM Leadership: Develop and implement go-to-market strategies for our cloud products, with a particular emphasis on platforms like Google Cloud Platform (GCP) and Amazon Web Services (AWS).</li><li>Partnership Development: Identify and establish new business opportunities in the cloud market, aligning with our core competencies in data security and governance.</li><li>Stakeholder Engagement: Cultivate and maintain strong relationships with key stakeholders at cloud service providers and within client organizations to enhance and expand business opportunities.</li><li>Product Collaboration: Work closely with the product development team to communicate market demands and customer feedback, thereby influencing the roadmap and feature enhancements of our cloud offerings.</li><li>Marketing Collaboration: Partner with marketing teams to create compelling campaigns and materials that effectively communicate the value and uniqueness of our cloud solutions.</li><li>Deal Leadership: Lead negotiations and close high-profile deals, ensuring alignment with the company's revenue targets and strategic objectives.</li><li>Sales Enablement: Provide continuous training and support to the sales team, enhancing their ability to effectively sell and support our cloud-based products.</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><p><br/></p><ul><li>Minimum of 5 years of experience in sales or business development, specifically within the cloud computing sector.</li><li>Demonstrated success in generating revenue through cloud services and consistently achieving or exceeding sales targets.</li><li>In-depth understanding of data security or data governance products, with substantial experience in these areas.</li><li>Exceptional relationship-building skills with a well-established network in cloud computing and experience managing significant customer accounts.</li><li>Strong analytical and strategic thinking abilities, with a proven capability to craft and implement comprehensive business strategies.</li><li>Excellent communication and presentation skills, with the ability to convey complex technical concepts in a clear and persuasive manner.</li><li>Bachelor’s degree in Business, Marketing, IT, or a related field; a Master’s degree is preferred.</li></ul><p><br/></p><p>If interested please apply for a confidential chat.</p>", "jobFunction": "Engineering, Business Development, and Strategy/Planning", "industry": "Staffing and Recruiting, Software Development, and Data Infrastructure and Analytics", "skills": [], "url": "https://www.linkedin.com/jobs/view/4002467664"}