{"jobTitle": "Director, Key Account", "company": {"name": "Sol de Janeiro", "industry": "Technology, Information and Internet", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "165,000—$180,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Launched in 2015, SOL DE JANEIRO is an award-winning, fast-growing premium global lifestyle beauty brand inspired by the beauty rituals and attitude of the beaches of Rio. Our brand purpose is to spark endless self-celebration and joy through the power and warmth of the Brazilian spirit. This philosophy extends from our products to our corporate culture. We are leaders, permanently inquisitive, category obsessed, incredibly diverse, self-demanding, true team players, and we are all Brazilian in Spirit.<br/><br/>Headquartered in New York and launched as a digitally native brand, we have expanded globally with teams in Rio, Paris, London, and Germany. Our commitment to excellence has earned us prestigious honors, including TIME100's 2024 Most Influential Company, Fast Company's 2024 World's Most Innovative Companies and 2023 Brands that Matter, Allure's 2024 Readers' Choice Awards, and WWD's 2023 Beauty Inc Award in the Prestige category. These accolades highlight our dedication to being a leading brand in the beauty industry and an exceptional workplace.<br/><br/>The Director, Key Account role will lead Sol de Janeiro's account management for Ulta Beauty. We are seeking a candidate who is excited to be a part of building a rapidly growing brand and to lead our key account business through long-term strategic planning as well as day-to-day execution. This role is responsible for omnichannel account leadership with a focus on best-in-class retail partnership, fostering excellent working relationships with all members of the retailer's cross-functional teams. This individual will build omnichannel launch plans and strategies. This role will work alongside sales, marketing, digital, operations, and finance teams on key projects to build brand passion and awareness while driving retail sales growth and net shipments.<br/><br/>The position will report to the **VP, Wholesale - Americas** and will lead our wholesale business in continued growth.<br/><br/>**Responsibilities:** <br/><br/>**Wholesale Account Leadership and Relationship-Building<br/><br/>**<ul><li>Manage key account business at Ulta Beauty for Sol de Janeiro and build strong, collaborative relationship with retailer teams.</li><li>Grow the wholesale businesses in alignment with shared performance goals, remaining competitive and maintaining top rankings. Drive strong revenue and profitability growth, achieving aggressive sales goals while expanding market share and supporting omnichannel plans.</li><li>Advocate for Sol de Janeiro brand positioning and point of difference with our retailer counterparts.</li><li>Identify risks and opportunities to sell-in and sell-through plan and propose and execute innovative solutions.<br/><br/></li></ul>**Retailer Marketing Exposure Planning<br/><br/>**<ul><li>Manage 360 omnichannel opportunity planning in partnership with retailer and internal Sol de Janeiro team, including digital and in-store exposures for both permanent gondola/wall fixturing and temporary locations, sell-in sales, dot.com, media and social strategy, and sampling and loyalty/CRM initiatives, optimizing key levers and being best-in-class partners.<br/><br/></li></ul>**Core and Launch Strategic Support<br/><br/>**<ul><li>Partner with retailer to identify key market trends and focus categories to drive collaborative product development and best-in-class digital strategy.</li><li>Work closely with cross-functional teams to build new go-to-market strategies and 360 support elements to maximize launches and brand potential tailored to our retail partners' needs.</li><li>Partner with education and events internal resources to align on strategy, planning and execution to support core and new launches.<br/><br/></li></ul>**Inventory Analysis<br/><br/>**<ul><li>Partner with internal planner to develop and communicate detailed plans and ensure adequate inventory support in-store and online. Responsible for the overall stock levels and ensuring that appropriate product mix of stock is available in the stores/online by assuring timely ordering, proactively monitoring and resolving low or out-of-stock conditions.</li><li>Monitor and accurately project weekly, monthly and quarterly gross shipment expectations based on upcoming programming, launch plans, and weeks of supply.<br/><br/></li></ul>**Visual Merchandising<br/><br/>**<ul><li>Partner with visual merchandising, marketing, retailer and vendor teams to execute instore visual merchandising deliverables including design, planograms, timelines, (endcaps/towers/gondola) and corresponding inventory planning and support.<br/><br/></li></ul>**Sales Reporting and Analysis<br/><br/>**<ul><li>Report and communication sales weekly, identifying opportunities, amplifying successes, tracking rankings, and sharing insights and learnings.<br/><br/></li></ul>**Budget Management** <br/><br/><ul><li></li><ul><li>Responsible for account omnichannel promotional budget planning and tracking, in partnership with internal marketing and finance teams.<br/></li></ul></ul>**Qualifications:** <br/><br/><ul><li>Bachelor's degree required minimum</li><li>6+ years in Sales/Account Management, Category Management or Retail Management. Experience working directly with prestige cosmetics retailer corporate teams is required.</li><li>Strong analytical ability; attention to detail and organizational/time management skills.</li><li>Ability to work with data from multiple sources and interpret the data to provide actionable conclusions.</li><li>Advanced Microsoft Excel and PowerPoint skills required.</li><li>Desire to work in a strong team environment. Well-developed interpersonal and communication skills.</li><li>Ability to build relationships to drive results, and can present regularly to small-medium size groups.</li><li>Ability to balance priorities across multiple internal and external stakeholders.</li><li>Ability to learn new systems quickly and leverage systems and information to influence others.</li><li>Role is remote, however candidates based in the NYC metro area are preferred.<br/><br/></li></ul>Salary Range<br/><br/>$165,000—$180,000 USD<br/><br/>In addition to base salary, this position is eligible for participation in a highly competitive bonus program with the possibility for overachievement based on performance and company results.<br/><br/>The information contained herein is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee, as these may change or new ones may be assigned at any time.<br/><br/>Sol de Janeiro is committed to diversity and inclusion in the workplace. We are an equal opportunity employer and do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.<br/><br/>https://soldejaneiro.com/pages/privacy-policy-sol-de-janeiro<br/><br/>", "responsibilities": "Manage key account business at Ulta Beauty for Sol de Janeiro and build strong, collaborative relationship with retailer teams. Grow the wholesale businesses in alignment with shared performance goals, remaining competitive and maintaining top rankings. Drive strong revenue and profitability growth, achieving aggressive sales goals while expanding market share and supporting omnichannel plans. Advocate for Sol de Janeiro brand positioning and point of difference with our retailer counterparts. Identify risks and opportunities to sell-in and sell-through plan and propose and execute innovative solutions. Manage 360 omnichannel opportunity planning in partnership with retailer and internal Sol de Janeiro team, including digital and in-store exposures for both permanent gondola/wall fixturing and temporary locations, sell-in sales, dot.com, media and social strategy, and sampling and loyalty/CRM initiatives, optimizing key levers and being best-in-class partners. Partner with retailer to identify key market trends and focus categories to drive collaborative product development and best-in-class digital strategy. Work closely with cross-functional teams to build new go-to-market strategies and 360 support elements to maximize launches and brand potential tailored to our retail partners' needs. Partner with education and events internal resources to align on strategy, planning and execution to support core and new launches. Partner with internal planner to develop and communicate detailed plans and ensure adequate inventory support in-store and online. Responsible for the overall stock levels and ensuring that appropriate product mix of stock is available in the stores/online by assuring timely ordering, proactively monitoring and resolving low or out-of-stock conditions. Monitor and accurately project weekly, monthly and quarterly gross shipment expectations based on upcoming programming, launch plans, and weeks of supply. Partner with visual merchandising, marketing, retailer and vendor teams to execute instore visual merchandising deliverables including design, planograms, timelines, (endcaps/towers/gondola) and corresponding inventory planning and support. Report and communication sales weekly, identifying opportunities, amplifying successes, tracking rankings, and sharing insights and learnings. Responsible for account omnichannel promotional budget planning and tracking, in partnership with internal marketing and finance teams.", "qualifications": {"required": "Bachelor's degree required minimum 6+ years in Sales/Account Management, Category Management or Retail Management. Experience working directly with prestige cosmetics retailer corporate teams is required. Strong analytical ability; attention to detail and organizational/time management skills. Ability to work with data from multiple sources and interpret the data to provide actionable conclusions. Advanced Microsoft Excel and PowerPoint skills required. Desire to work in a strong team environment. Well-developed interpersonal and communication skills. Ability to build relationships to drive results, and can present regularly to small-medium size groups. Ability to balance priorities across multiple internal and external stakeholders. Ability to learn new systems quickly and leverage systems and information to influence others. Role is remote, however candidates based in the NYC metro area are preferred.", "preferred": ""}, "skills": ["Sales", "Account Management", "Category Management", "Retail Management", "Analytical Skills", "Organizational Skills", "Time Management", "Data Analysis", "Microsoft Excel", "PowerPoint", "Teamwork", "Interpersonal Skills", "Communication Skills", "Relationship Building", "Presentation Skills", "Prioritization", "Problem Solving", "System Learning"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "In addition to base salary, this position is eligible for participation in a highly competitive bonus program with the possibility for overachievement based on performance and company results.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4002276402"}