{"jobTitle": "Talent Partner", "company": {"name": "Alloy", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Human Resources", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "Alloy’s at a critical stage of growth and building our GTM and engineering teams to support our continued success and looking to bring on a Talent Partner on a contract basis (potential for full time). You’ll play a crucial role in hiring our new team of sales reps, marketers, engineers and more along with our Head of People. If you’re interested in a role at an early stage, high growth startup, where you can see the immediate impact of your work and help take Alloy to the next level, keep reading.<br/><br/><strong>What You'll Be Doing<br/><br/></strong><ul><li>Lead the candidate lifecycle: Manage the full-cycle recruitment process by sourcing fantastic candidates</li><li>Partner with the business: Liaise with leaders in the company to scope out roles, understand what 10X talent looks like for us, coordinate interviews and other processes for candidates and hiring managers through Lever</li><li>Deliver a great experience: Think outside the box to create experiences that wow and amaze our candidates whether they get an offer or not</li><li>Pitch the opportunity: Learn about the business, value prop for people joining and sell the amazing opportunity we have here and the story to prospective candidates</li><li>Propose improvements: Contribute to the ongoing development of our sourcing and recruitment strategy. There’s lots to do and lots to improve so we’re looking for someone with great experience and a strong voice</li><li>Close the deal: Ensure that candidates are eager to join us and get the close against potential competing offers<br/><br/><br/><br/><br/></li></ul><strong>Skills &amp; Experience We're Excited About<br/><br/></strong><ul><li>Experience: 5+ years of full-cycle GTM and tech recruitment experience at a fast growing tech startup, ideally in B2B SaaS and even better with technical products e.g. API products or developer tools (since that’s the space we often recruit from). </li><li>Business acumen: Able to develop a strong understanding of our tech stacks and business in order to then articulate the value of joining Alloy. Understands what’s needed from a talent perspective for teams to be successful and achieve their goals, then find the right talent for us</li><li>Agility: Competitive attitude, bias toward action, love to dive in and get stuff done, and great energy that people gravitate toward. Able to seamlessly alternate between various tasks, context switch and roll with the punches when things change. Part of the norm here</li><li>Organization: Able to move quickly, but also set the right structure, keep organized and move efficiently. Time management is second nature. Able to context-shift and pivot when working on several projects and priorities at the same time. </li><li>Scrappy builder: Come with a builder’s mentality and a willingness to become an expert, paired with the ability to operate within gray zones and find creative, out-of-the-box solutions when faced with ambiguity</li><li>Negotiation: Expert with negotiation to influence others and guide towards alternatives paths, being creative and eloquent in discussions. </li><li>Team player: Recruitment is a team sport. Come with a positive and open-minded attitude, able to help others before it’s asked and contribute to and collaborate with the team on projects<br/><br/><br/><br/><br/></li></ul>", "postedDate": "1 day ago", "skills": ["Sourcing", "Recruitment", "B2B SaaS", "Technical Products", "API Products", "Developer Tools", "Business Acumen", "Agility", "Organization", "Time Management", "Negotiation", "Team Player"], "url": "https://www.linkedin.com/jobs/view/4002134005"}