{"jobTitle": "Strategic Account Manager (SAM)", "company": {"name": "INFICON", "location": "Portland, OR"}, "location": "Portland, OR", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Strategy/Planning", "industry": "Semiconductors", "description": "<strong>Company Description<br/><br/></strong>INFICON is a leading provider of innovative instrumentation, critical sensor technologies, and Smart Manufacturing/Industry 4.0 software solutions that enhance productivity and quality of tools, processes, and complete factories. These analysis, measurement and control products are essential for gas leak detection in air conditioning/refrigeration and automotive manufacturing. They are vital to equipment manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells and industrial vacuum coating applications. Other users of our vacuum-based processes include the life sciences, research, aerospace, packaging, heat treatment, laser cutting and many other industrial processes. We also leverage our expertise in vacuum technology to provide unique, toxic chemical analysis products for emergency response, security, and environmental health and safety.<br/><br/>With an already leading position our future aspirations are high as we strongly believe there is significant further potential to expand our position and offering in the market especially with our strategic accounts by developing even closer relationships and contribute to their business success in a more strategic way.<br/><br/><strong>Job Description<br/><br/></strong>On this journey the SAM will play a strategic and vital role in unlocking INFICON potential and in achieving the company’s long term strategic goals. The SAM will be responsible for managing the relationship with one of INFICONs strategic and most important customers.<br/><br/>As a SAM for this specific role your overall responsibility is to orchestrate all interactions and development with our customer, Intel, with a long-term business (P&amp;L) view and enabling delivery of consistent, predictable and repeatable business results towards 2030 – and beyond.<br/><br/><strong>About The Customer - Intel<br/><br/></strong>Intel Corporation is an American multinational technology company that designs, manufactures, and sells computer components and related products for both consumers and businesses. As the world's largest manufacturer of central processing units (CPUs) and semiconductors, Intel also offers graphics processing units (GPUs), networking accelerators, and communications and security products. The company foresees significant growth in their upcoming foundry business, particularly with the rise of AI and other emerging technologies. The recent CHIPS act has contributed to expanding Intel's presence in the United States, with new upcoming fabs in Arizona and plans for new factories near Columbus Ohio.<br/><br/>Intel is set to provide foundry services for complete chip manufacturing. All front-end R&amp;D activities take place at their Hillsboro sites. Once development is completed, the process transitions to High Volume Manufacturing (HVM) sites in Arizona, Ireland, and Israel. Their back-end Foveros process is an innovative 3D packaging technology that enables the vertical stacking of logic chips, integrating components such as CPUs and memory within a single package. This process is developed at their NM facility, with high-volume production conducted at their Penang, Malaysia site.<br/><br/><strong>Main Activities And Responsibilities<br/><br/></strong>As a SAM your overall responsibility is to orchestrate all interactions and development with the customer, Intel, where the main activities and responsibilities are:<br/><br/><ul><li>Leadership: Strategic Account Management </li><ul><li>Understand the customers business, their market and organizational needs. </li><li>Define long-term bold account aspiration and strategy, set short term goals to drive impact. </li><li>Create and maintain and execute the strategic account plan, updated when relevant with input from the SA Team. </li><li>Conduct regular account coordination activities with the INFICON strategic account team and other important INFICON stakeholders. </li><li>Review the global strategic account plan with the executive sponsor and senior management to continuously align with overall INFICON strategy. </li></ul><li>Growth: Scouting for/capturing opportunities</li><ul><li>Early identification of global growth opportunities from all potential revenue streams at the account including expanding our share of wallet, creating new applications, services, consumables and new business areas. </li><li>Support the local sales and application teams following the customer’s buying cycle. </li><li>Coach and provide input to opportunity plans owned by local Sales Managers</li><li>Drive towards aligning customer and INFICON R&amp;D roadmaps and establishing integrated partnerships across functions from the beginning to end of the product cycle. </li><li>Facilitate early entry into new application areas and fab locations within this account. </li></ul><li>Communication &amp; Information</li><ul><li>Drive our agenda and strategy on a continuous and proactive level. Create and set the narrative that moves forward the account strategy. </li><li>Ensure the relevant customer buying center members know the business impact of INFICON’s latest solutions (e.g., innovation roadmap sharing, modular design, new supplier partners…) and facilitate similar sharing from customer to INFICON. </li><li>Ensure all relevant opportunities, activities, and relevant information are visible in the chosen communication channel (Teams/CRM…)</li><li>Encourage cross-region and cross-functional interaction between INFICON and the customer organization. Ensure omni-channel consistency and quick responses. </li></ul><li>Relationship management: Strengthening the relationship </li><ul><li>Map, build, and strengthen relationships to strategic stakeholders in the customers’ organization. </li><li>Establishing the SAM Diamond: multi-level relationships between INFICON and the customer. </li><li>Conducting Scheduled Business reviews with the customer and INFICON account</li><li>Organize the right meeting with the right people to discuss the topics that matters most (e.g., executive meetings, engineering workshops, technical roadmap presentations). </li></ul><li>Deal making: Negotiate Profitable and Fair Deals</li><ul><li>Drive holistic value creating and value capture for the account, long-term and short-term. </li><li>Close deals by using creativity and by mastering the art and science of negotiation. </li><li>Master all elements of business contracts, including solid understanding of legal aspects. </li><li>Proactively initiate and facilitate global framework agreement, H&amp;S and CSR activities (if applicable) to ensure INFICON solutions are fully approved as Tier 1 supplier by the customer. </li><li>Ensure consistency between T&amp;Cs offered in individual markets. <br/></li></ul></ul><strong><em>Cognitive attributes and competencies <br/><br/></em></strong>As a SAM is a strategic role and is operating simultaneously on inter-organizational, intra-organizational and interpersonal level it is a challenging role that require strong cognitive attributes and competences.<br/><br/><strong>Cognitive Attributes As<br/><br/></strong><ul><li>reflective, careful listener and open to new ideas. </li><li>Pertain to diplomacy and analytic mindsets. </li><li>Able to connect people and information and get things done, primarily based on sound analysis, experience, out-of-the-box-thinking and creative strategies. </li><li>Able to recognize and attend to multiple points of view simultaneously. <br/><br/></li></ul><strong>Competences As<br/><br/></strong><ul><li>Strategic thinking and planning allowing you to create line of sight between INFICON’s 2030 aspirations, the strategy and the activities with the customer. </li><li>Exceptional presentation skills providing timely and relevant data to inform and solicit decision making or consensus inside INFICON as well as with the customer. </li><li>Conflict resolution inside INFICON as well as with the customer in a way that does not damage the relationship but drives growth and fair deals. </li><li>Ability to lead complex contract negotiations and is very strong in contract management. </li><li>Strong financial and business acumen and able to use it for the benefits of INFICON as well as for the customer. </li><li>Deeply developed interpersonal competences enabling you to build strong relationships on all levels with the customer, to act comfortably in social business meetings and to use verbal and nonverbal communications and affect the mood of individuals and groups. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Besides being able to handle the mentioned responsibilities and carry out the main activities at a high level consistently and to a large extent possess the cognitive attributes and competences, following qualifications apply for the SAM role:<br/><br/><em>Education and Experience<br/><br/></em><ul><li>Minimum Bachelor’s degree in Business, Marketing, Engineering, Computer Science, or related field. Master’s degree is a plus. </li><li>+10-15 years of experience in sales, account management, or business development within the industry. </li><li>Experience negotiator incl. contracts</li><li>Proven track record of managing and growing strategic accounts. </li><li>Experience working with cross-functional teams (e.g., Sales, Product Development, Supply Chain). <br/><br/></li></ul><em>Technical Skills<br/><br/></em><ul><li>Strong understanding of the industry, including current trends, technologies, and key players. </li><li>Technical proficiency with CRM software, MS Office Suite, and other sales enablement tools. </li><li>Familiarity with the product development lifecycle and the ability to grasp complex technical products and solutions. <br/><br/></li></ul><strong>Other Requirements<br/><br/></strong><ul><li>Willingness to travel as required to meet business needs</li><li>Demonstrated ability to work independently, prioritize effectively, and manage multiple tasks simultaneously. </li><li>High level of integrity, professionalism, and drive, with a strong commitment to excellence and accountability to take active part in supporting the INFICON journey beyond your own Strategic Account. <br/><br/></li></ul><strong>Additional Information<br/><br/></strong>For New York, the expected salary range for this position is between $100k and $150k per year, plus commission. The actual compensation will be determined based on experience, location, and other factors permitted by law.<br/><br/>INFICON provides a dynamic work environment that promotes diversity, equity, and inclusion. Our employees experience ongoing green initiatives, flexible work hours, and a variety of health and wellness programs.<br/><br/>INFICON’s forward-thinking approach offers countless opportunities to design, support, and manufacture a diverse product portfolio that expands globally. Our Lean and Agile work environment offers competitive compensation, relocation assistance, a discretionary bonus, and generous employee benefits; major medical, dental, health, vision, 401K, vacation and sick time, tuition reimbursement, and more!<br/><br/>INFICON is committed to ensuring that our online application process provides an equal opportunity to all job seekers that apply without regard to race, religion, ethnicity, national origin, citizenship, gender, age, protected veteran status, disability status, genetic information, sexual orientation, or any other protected characteristic. A notice describing Federal equal employment opportunity laws is available here and here to reaffirm this commitment.<br/><br/>INFICON, Inc. strictly complies with all aspects of the Export Administration Regulations ('EAR'), including those sections dealing with deemed exports to foreign nationals.", "responsibilities": "As a SAM your overall responsibility is to orchestrate all interactions and development with the customer, Intel, where the main activities and responsibilities are:<br/><br/><ul><li>Leadership: Strategic Account Management </li><ul><li>Understand the customers business, their market and organizational needs. </li><li>Define long-term bold account aspiration and strategy, set short term goals to drive impact. </li><li>Create and maintain and execute the strategic account plan, updated when relevant with input from the SA Team. </li><li>Conduct regular account coordination activities with the INFICON strategic account team and other important INFICON stakeholders. </li><li>Review the global strategic account plan with the executive sponsor and senior management to continuously align with overall INFICON strategy. </li></ul><li>Growth: Scouting for/capturing opportunities</li><ul><li>Early identification of global growth opportunities from all potential revenue streams at the account including expanding our share of wallet, creating new applications, services, consumables and new business areas. </li><li>Support the local sales and application teams following the customer’s buying cycle. </li><li>Coach and provide input to opportunity plans owned by local Sales Managers</li><li>Drive towards aligning customer and INFICON R&amp;D roadmaps and establishing integrated partnerships across functions from the beginning to end of the product cycle. </li><li>Facilitate early entry into new application areas and fab locations within this account. </li></ul><li>Communication &amp; Information</li><ul><li>Drive our agenda and strategy on a continuous and proactive level. Create and set the narrative that moves forward the account strategy. </li><li>Ensure the relevant customer buying center members know the business impact of INFICON’s latest solutions (e.g., innovation roadmap sharing, modular design, new supplier partners…) and facilitate similar sharing from customer to INFICON. </li><li>Ensure all relevant opportunities, activities, and relevant information are visible in the chosen communication channel (Teams/CRM…)</li><li>Encourage cross-region and cross-functional interaction between INFICON and the customer organization. Ensure omni-channel consistency and quick responses. </li></ul><li>Relationship management: Strengthening the relationship </li><ul><li>Map, build, and strengthen relationships to strategic stakeholders in the customers’ organization. </li><li>Establishing the SAM Diamond: multi-level relationships between INFICON and the customer. </li><li>Conducting Scheduled Business reviews with the customer and INFICON account</li><li>Organize the right meeting with the right people to discuss the topics that matters most (e.g., executive meetings, engineering workshops, technical roadmap presentations). </li></ul><li>Deal making: Negotiate Profitable and Fair Deals</li><ul><li>Drive holistic value creating and value capture for the account, long-term and short-term. </li><li>Close deals by using creativity and by mastering the art and science of negotiation. </li><li>Master all elements of business contracts, including solid understanding of legal aspects. </li><li>Proactively initiate and facilitate global framework agreement, H&amp;S and CSR activities (if applicable) to ensure INFICON solutions are fully approved as Tier 1 supplier by the customer. </li><li>Ensure consistency between T&amp;Cs offered in individual markets. <br/></li></ul></ul>", "qualifications": {"required": "Minimum Bachelor’s degree in Business, Marketing, Engineering, Computer Science, or related field. Master’s degree is a plus. \n+10-15 years of experience in sales, account management, or business development within the industry. \nExperience negotiator incl. contracts\nProven track record of managing and growing strategic accounts. \nExperience working with cross-functional teams (e.g., Sales, Product Development, Supply Chain).", "preferred": "Strong understanding of the industry, including current trends, technologies, and key players. \nTechnical proficiency with CRM software, MS Office Suite, and other sales enablement tools. \nFamiliarity with the product development lifecycle and the ability to grasp complex technical products and solutions."}, "skills": ["CRM", "MS Office Suite", "Sales", "Account Management", "Business Development", "Negotiation", "Contract Management", "Strategic Account Management", "Cross-functional Teams", "Product Development", "Supply Chain", "Industry Knowledge", "Technical Proficiency", "Product Development Lifecycle"], "postedDate": "1 day ago", "benefits": "INFICON’s forward-thinking approach offers countless opportunities to design, support, and manufacture a diverse product portfolio that expands globally. Our Lean and Agile work environment offers competitive compensation, relocation assistance, a discretionary bonus, and generous employee benefits; major medical, dental, health, vision, 401K, vacation and sick time, tuition reimbursement, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4003147471"}