{"jobTitle": "Recruiter Assistant - Remote | WFH", "company": {"name": "Get.It Recruit - Administrative", "location": "Myrtle Beach, SC"}, "location": "Myrtle Beach, SC", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Human Resources Services", "description": "Are you a motivated self-starter looking for a flexible job with unlimited earning potential? We are looking for enthusiastic individuals to join our team as Recruiter Assistants. This remote position allows you to set your own hours and earn based on your performance.<br/><br/><strong>Job Overview<br/><br/></strong>As a Recruiter Assistant, you will play a key role in connecting with candidates who have already shown interest in our job opportunities. Your main responsibilities will include engaging with candidates over the phone, evaluating their qualifications, and scheduling further interviews or assessments with our hiring team. This role is commission-based, so your earnings will directly reflect your success in recruiting qualified candidates.<br/><br/><strong>Key Responsibilities<br/><br/></strong>Candidate Outreach: Reach out to candidates who have applied for our job openings via phone.<br/><br/>Screening: Conduct brief phone screenings to assess candidates' qualifications and interest.<br/><br/>Scheduling: Coordinate and arrange interviews between candidates and our hiring team.<br/><br/>Follow-Up: Maintain ongoing communication with candidates to keep them informed and engaged throughout the hiring process.<br/><br/>Reporting: Track and document interactions and progress with candidates accurately.<br/><br/><strong>Requirements<br/><br/></strong>Communication Skills: Excellent verbal communication skills and a confident phone presence.<br/><br/>Self-Motivated: Ability to work independently and effectively manage your time in a remote setting.<br/><br/>Sales-Oriented: Results-driven with a focus on achieving goals and maximizing commissions.<br/><br/>Tech-Savvy: Comfortable using basic computer programs and virtual communication tools.<br/><br/>Experience: Previous experience in recruitment, sales, or customer service is a plus, but not required.<br/><br/><strong>Compensation<br/><br/></strong>Commission-Based: Earn 100% commission for each candidate you successfully schedule for an interview and who progresses through the hiring process. Your earning potential is directly linked to your success in recruiting.<br/><br/>Why Join Us?<br/><br/>Flexibility: Work from anywhere and create a schedule that fits your lifestyle.<br/><br/>Earning Potential: Enjoy unlimited commission-based earnings based on your performance.<br/><br/>Support: Benefit from access to training and resources to help you thrive in your role.<br/><br/>If you are excited about the opportunity to use your communication skills in a flexible, performance-based role, we encourage you to apply!<br/><br/>Employment Type: Contractor", "postedDate": "1 day ago", "remoteWork": "Yes", "skills": ["Communication", "Sales", "Customer Service", "Recruitment", "Tech-Savvy"], "url": "https://www.linkedin.com/jobs/view/4003201300"}