{"jobTitle": "Customer Service Sales Remote North Las Vegas, NV", "company": {"name": "RemoteWorker US", "location": "North Las Vegas, NV"}, "location": "North Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/><strong>Overview:<br/><br/></strong>We are a rapidly growing company actively searching for dedicated and driven individuals from across North America &amp; Canada to join us as life insurance benefits advisors in providing outstanding customer service and support to our client base.<br/><br/>You will work remotely to serve clients and offer valuable advice and protection to individuals and their families.<br/><br/>This full-time position offers flexible work hours and ample opportunities for advancement into management roles.<br/><br/><strong>What We Offer:<br/><br/></strong><ul><li>Remote, work from home career.</li><li>Average 1st yr $55-70K / Avg 2nd yr $115K commission + bonuses.</li><li>Life-long residual income through renewals.</li><li>Unionized position with stock options.</li><li>Excellent benefits package medical, dental, and prescription coverage.</li><li>Exceptional training with experienced agents and managers.</li><li>High-quality leads provided: no calling family or friends.</li><li>Flexible hours: this is a fulltime career, but you can choose when you work.</li><li>Opportunities for advancement and recognition as we promote from within.</li><li>Dynamic Team Environment: Our virtual workplace thrives on a vibrant team atmosphere While this position is remote, you will have lots of support. <br/><br/></li></ul><strong>Qualities We Value:<br/><br/></strong><ul><li>Willingness to learn and be coached as we provide comprehensive training.</li><li>Outgoing and Friendly Personality: a positive and approachable demeanor.</li><li>A strong desire to help others: provide valuable advice and services.</li><li>Effective Communication Skills: your ability to connect with others is crucial.</li><li>Sales or customer service experience is advantageous but not mandatory. <br/><br/></li></ul><strong>Your Qualifications:<br/><br/></strong><ul><li>Laptop or computer with camera is required.</li><li>Possession of, or willingness to obtain an LLQP license.</li><li>Basic computer literacy is essential.</li><li>Must reside in North America. <br/><br/></li></ul><strong>Your Job Responsibilities:<br/><br/></strong><ul><li>Contact the leads we provide to schedule virtual meetings with clients.</li><li>Present benefit programs to enroll new clients and cultivate relationships with them.</li><li>Collaborate with your manager to define clear objectives and goals, then achieve them through dedicated effort and determination.<br/><br/></li></ul>Powered by JazzHR<br/><br/>SzqbSMJeAE", "postedDate": "1 day ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003248420"}