{"jobTitle": "Sales Manager - Remote | WFH", "company": {"name": "Get It Recruit - Marketing", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "50,000.00/yr - 500,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Human Resources Services", "description": "Are You Ready for a Rewarding Career?<br/><br/>Are you looking to build a thriving business with a reliable income stream?<br/><br/>Do you want a proven system that supports your growth and helps you reach your full potential?<br/><br/>Are you committed to working hard to create a bright future for yourself and your loved ones?<br/><br/>This Could Be the Opportunity You've Been Searching For!<br/><br/>We are seeking ambitious individuals to join our dynamic team. Our mission is to provide American families with essential services such as life insurance, mortgage protection, burial policies, wealth accumulation, retirement solutions, and financial advice.<br/><br/><strong>About The Role<br/><br/></strong>This is a commission-based position with unlimited earning potential, with commissions paid daily.<br/><br/>What Sets Us Apart?<br/><br/>Engaged Clients: Work with individuals who have actively requested information—no cold calling involved.<br/><br/>Uncapped Income: Enjoy 100% commission with daily pay, plus opportunities for additional earnings through bonuses and overrides.<br/><br/>Agency Ownership: Build and lead your own agency without the high costs of a traditional franchise. We provide the training and support you need.<br/><br/>Work-Life Balance: Choose between full-time or part-time, work from home, and be your own boss.<br/><br/>Personalized Mentorship: Receive one-on-one coaching, daily meetings, and ongoing training.<br/><br/>Supportive Culture: Enjoy the benefits of working independently with the support of a dedicated team.<br/><br/>Top Insurance Partners: Collaborate with over 60 A+ rated insurance companies, including Mutual of Omaha, Transamerica, and more.<br/><br/><strong>Compensation<br/><br/></strong>Start at 80% commission with potential to increase to 130%<br/><br/>Access to various bonuses, including producer and capital bonuses<br/><br/>Part-time agents can earn $50,000+ in the first year<br/><br/>Full-time agents have the potential to earn $100,000+ in the first year<br/><br/>Agency Owners can achieve system-driven incomes of $200K - $500K+ per year, with the opportunity to become an Agency Owner within 2-4 years. Highly motivated individuals have achieved this in less than 18 months.<br/><br/><strong>Requirements<br/><br/></strong>Life Insurance License: A license is required. We will assist you in obtaining one if you don't already have it.<br/><br/><strong>Successful Traits<br/><br/></strong>Disciplined and Self-Motivated<br/><br/>Consistent and Driven to Improve<br/><br/>Humble and Coachable<br/><br/>Committed to Personal Growth<br/><br/>Eager to Reach Your Full Potential<br/><br/>Discover why we have been recognized as one of the fastest-growing companies and celebrated for our exceptional company culture.<br/><br/>12th Annual Best Biz 2022 Company of the Year<br/><br/>12th Annual Best Biz 2022 Philanthropist of the Year<br/><br/>2022 Insurance Company of the Year<br/><br/>2024 Forbes #9 Top Company Hiring for High-Paying Jobs<br/><br/>Note: Success varies based on individual effort, adherence to our training, and engagement with our systems. No specific results are guaranteed.<br/><br/>Employment Type: Full-Time", "responsibilities": null, "qualifications": {"required": "Life Insurance License: A license is required. We will assist you in obtaining one if you don't already have it.", "preferred": null}, "skills": [], "postedDate": "1 day ago", "applicationDeadline": null, "benefits": null, "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003095682"}