{"jobTitle": "Supply Chain and Operations - Health - Senior Manager - Consulting", "company": {"name": "EY", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "IT Services and IT Consulting", "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better. Join us and build an exceptional experience for yourself, and a better working world for all.<br/><br/>The exceptional EY experience. It's yours to build.<br/><br/>EY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities.<br/><br/>Our clients operate in a world where achieving and sustaining performance is more difficult than ever. EY's Health Sciences and Wellness – Health and Supply Chain (SC) Consulting Services team assists clients with SC improvements as a differentiator to drive value for internal and external stakeholders.<br/><br/><strong>The opportunity<br/><br/></strong>EY has a robust Health Sciences and Wellness - Provider Health and SC practice, helping clients with strategic growth, business, clinical and technology transformations. This senior role within our Consulting practice will have the opportunity to lead engagement teams, build solutions, and innovate in the market. Our practice works with Academic Medical Centers (AMCs), Large Health Systems, and Health Payors. You will be an integral member of our Health and SC consulting team, and spend most of your time focused on providing client services in the following areas: Clinical business transformation, ions, commercial data and analytics, commercial strategy, growth strategy, operating model optimization, technology implementation and enterprise transformation.<br/><br/><strong>Your Key Responsibilities<br/><br/></strong>As a Senior Manager in our Health group focused on Supply Chain, you'll spend most of your time teaming with our supply chain team working with a broad spectrum of not-for-profit and for-profit healthcare clients, including hospitals, healthcare systems, and academic medical centers, to assess and redesign supply chain processes and optimize technology across all areas of the Supply Chain, including:<br/><br/><ul><li>Value Analysis / Clinical Supply Chain</li><li>Clinical Utilization/Consumption</li><li>Procurement</li><li>Logistics / Distribution</li><li>Inventory management</li><li>Operations</li><li>Strategy<br/><br/></li></ul><strong>Skills And Attributes For Success<br/><br/></strong><ul><li>Effectively manage and motivate client engagement teams with diverse skills and backgrounds</li><li>Leading large scale client engagements and consistently delivering quality client services</li><li>Monitoring progress, managing risk and ensuring key stakeholders are kept informed about progress and expected outcomes</li><li>Managing expectations of client service delivery and staying abreast of current business and industry trends relevant to the client's business</li><li>Fostering an innovative and inclusive team-oriented work environment by playing an active role in counselling and mentoring junior consultants within the organization</li><li>Developing and maintaining long-term client relationships and networks</li><li>Developing relationships with team members across all EY practices to serve client needs</li><li>Remaining current on new developments in the life sciences consulting services capabilities and industry knowledge<br/><br/></li></ul><strong>To qualify for the role, you must have<br/><br/></strong><ul><li>At least 7 years of progressive experience as a clinician and consultant</li><li>A bachelor's degree and approximately 10 years of related work experience; or a graduate degree and approximately 7 years of related work experience in a clinical program such as nursing</li><li>Health care provider, clinical experience in areas such as surgical services, cardiac services and experience providing consulting services in these clinical services</li><li>Experience leading transformation efforts in areas such as surgical supply chains, value analysis, digital transformation and analytics of clinical consumption of resources</li><li>The executive presence to interact with the C-Suite of Academic Health Systems (AMCs), and other health systems</li><li>Experience in selling and delivering projects that cover the full life cycle of assessment, design and implementation support; demonstrated record of driving revenue within existing healthcare clients and in developing new prospects at the \"C\" level of large healthcare companies</li><li>Ability to lead a team of consulting professionals on multiple projects and implement them w/in budget</li><li>Additionally, we seek candidates with specific subject matter expertise in Physician Alignment (preferably an MSN, JD or MD) including clinical variation, resource utilization and physician engagement strategies</li><li>A willingness to travel to meet client needs - travel is estimated at 30-50%</li><li>Significant advisory/consulting experience with health care providers, academic institutions (e.g., Schools of Medicine) and/or life sciences is required<br/><br/></li></ul><strong>Ideally, you'll also have<br/><br/></strong><ul><li>Clinical background and experience and consulting experience in business transformation, data analytics and clinical services</li><li>Experience working to optimize patient experience and physician experience (for example working on the transformation of clinical services and product solutions, including technology and workflow design)</li><li>Experience working within clinical practice and medical utilization</li><li>Certifications based on prior clinical experience related to clinical operations<br/><br/></li></ul><strong>What We Look For<br/><br/></strong>We're interested in passionate leaders with a strong vision, those who enjoying working collaboratively to solve problems, and a desire to stay on top of trends in the Health industry. If you have a strong passion for helping providers develop innovative services and solutions as a strategic differentiator for patient care – then this role is for you. If you have clinical experience and consulting expertise, we want to hear from you<br/><br/><strong>What We Offer<br/><br/></strong>We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $148,900 to $340,200. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $178,700 to $386,600. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.<br/><br/><ul><li>Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.</li><li>Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.</li><li>Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.</li><li>Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.<br/><br/></li></ul>EY accepts applications for this position on an on-going basis. <strong>If you can demonstrate that you meet the criteria above, please contact us as soon as possible.<br/><br/></strong>EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.<br/><br/>Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.<br/><br/>Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.<br/><br/>For those living in California, please click here for additional information.<br/><br/>EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. <br/><br/>EY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ssc.customersupport@ey.com", "responsibilities": "As a Senior Manager in our Health group focused on Supply Chain, you'll spend most of your time teaming with our supply chain team working with a broad spectrum of not-for-profit and for-profit healthcare clients, including hospitals, healthcare systems, and academic medical centers, to assess and redesign supply chain processes and optimize technology across all areas of the Supply Chain, including:<br/><br/><ul><li>Value Analysis / Clinical Supply Chain</li><li>Clinical Utilization/Consumption</li><li>Procurement</li><li>Logistics / Distribution</li><li>Inventory management</li><li>Operations</li><li>Strategy<br/><br/></li></ul>", "qualifications": {"required": "At least 7 years of progressive experience as a clinician and consultant\nA bachelor's degree and approximately 10 years of related work experience; or a graduate degree and approximately 7 years of related work experience in a clinical program such as nursing\nHealth care provider, clinical experience in areas such as surgical services, cardiac services and experience providing consulting services in these clinical services\nExperience leading transformation efforts in areas such as surgical supply chains, value analysis, digital transformation and analytics of clinical consumption of resources\nThe executive presence to interact with the C-Suite of Academic Health Systems (AMCs), and other health systems\nExperience in selling and delivering projects that cover the full life cycle of assessment, design and implementation support; demonstrated record of driving revenue within existing healthcare clients and in developing new prospects at the \"C\" level of large healthcare companies\nAbility to lead a team of consulting professionals on multiple projects and implement them w/in budget\nAdditionally, we seek candidates with specific subject matter expertise in Physician Alignment (preferably an MSN, JD or MD) including clinical variation, resource utilization and physician engagement strategies\nA willingness to travel to meet client needs - travel is estimated at 30-50%\nSignificant advisory/consulting experience with health care providers, academic institutions (e.g., Schools of Medicine) and/or life sciences is required<br/><br/>", "preferred": "Clinical background and experience and consulting experience in business transformation, data analytics and clinical services\nExperience working to optimize patient experience and physician experience (for example working on the transformation of clinical services and product solutions, including technology and workflow design)\nExperience working within clinical practice and medical utilization\nCertifications based on prior clinical experience related to clinical operations<br/><br/>"}, "skills": ["Supply Chain", "Consulting", "Healthcare", "Clinical", "Transformation", "Data Analytics", "Business Transformation", "Physician Alignment", "Leadership", "Teamwork", "Problem Solving", "Innovation", "Strategic Thinking", "Patient Experience", "Physician Experience", "Technology", "Workflow Design", "Clinical Practice", "Medical Utilization", "Certifications"], "postedDate": "22 hours ago", "benefits": "We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $148,900 to $340,200. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $178,700 to $386,600. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.<br/><br/><ul><li>Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.</li><li>Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.</li><li>Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.</li><li>Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.<br/><br/></li></ul>", "remoteWork": "No", "salary": {"amount": "148,900.00 - 340,200.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4003589438"}