{"jobTitle": "Associate Product Manager", "company": {"name": "Raptive", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "80,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Product Management", "industry": "Advertising Services and Technology, Information and Media", "description": "We’re looking for an Associate Product Manager who is passionate about leveraging data to help create new features and products for our team.\n\nAt Raptive, we’re already the leader in helping creators monetize their websites through digital advertising, with massive scale in verticals like food, home, family, and travel. Now we’re building complementary capabilities so those same creators can effortlessly leverage their expertise, authority, and passion to make more money via affiliate commerce.\n\nAs an associate product manager on our affiliate team, you’ll play an instrumental role in collaboratively shaping and delivering a platform that supports the open web at scale. You’ll run tests, analyze available data to write new features, and help implement and bring those features to our creators and their readers.\n\n**What you’ll be doing:**\n\n* Monitor and analyze product performance metrics to optimize product efficacy and provide recommendations for new features.\n* Working in conjunction with creators and internal stakeholders to identify problems, opportunities, and with the support of your manager refine product strategy and drive adoption.\n* Drive features and functionality with guidance and coaching of product lead and feedback of stakeholders.\n* Implementing tests of new features, delivering minimum viable products to creators and reporting on outcomes of those tests to dive the business forward.\n* Write well defined user stories, product requirement documents, and business cases for creators to leverage our technology.\n\n**The skills and experience you bring to the job:**\n\n* 1-2 years of experience in product management or analytics\n* Passion for data and analytics and drive to understand every detail.\n* You enjoy running experiments and learning from them quickly, setting KPIs and creating hypotheses to maximize outcomes of each test.\n* Ability to take ownership and initiative, driving successful outcomes even amidst ambiguity.\n* You enjoy collaborating with engineering teams and stakeholders to rapidly deliver and iterate on new product features and to scale adoption.\n* Experience in the affiliate marketing space is a bonus and some level of performance marketing is preferred.\n\n**About Raptive**\n\nRaptive’s mission is to power creator independence. We’re a creator company that provides revenue, audience, business solutions, and much more for creators and enterprise publishers. Since the very beginning of digital content creation, we’ve been allies and advocates for every kind of creator and charted the uncharted to help creators grow their businesses through it all.\n\nToday we are the catalyst for 5,000+ of the world’s most premium creators on the open web and rank as the tenth-largest digital property in the U.S. Creators who choose Raptive are premium content creators, trendsetters, iconic brands, and charismatic personalities, captivating more than 78% of U.S. audiences on their sites alone with the power to move and disrupt culture. They collectively rank #1 in Food, Family, Home, and Lifestyle--with a reach of more than 182M monthly unique visitors and more than half a billion followers across social platforms.\n\nCreators are the future of media. And together, the future is ours to create.\n\nThe base salary range for this position is $80,000-$95,000. The range provided is Raptive’s reasonable estimate of the annualized base compensation for this role. The actual amount may be higher or lower, based on non-discriminatory factors such as experience, geographic location, knowledge, skills and abilities. This role is eligible for additional incentive compensation that isn’t included in the posted range.\n\nFor more information, visit www.Raptive.com or follow us on LinkedIn or Instagram.\n\n*Raptive is committed to diversity, equity, and inclusion. We believe we are most impactful when people with a wide range of backgrounds, experiences, and identities come together with a common purpose. We encourage candidates from all backgrounds to apply. Raptive is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please reach out to a member of our recruiting team.*", "responsibilities": "Monitor and analyze product performance metrics to optimize product efficacy and provide recommendations for new features.\nWorking in conjunction with creators and internal stakeholders to identify problems, opportunities, and with the support of your manager refine product strategy and drive adoption.\nDrive features and functionality with guidance and coaching of product lead and feedback of stakeholders.\nImplementing tests of new features, delivering minimum viable products to creators and reporting on outcomes of those tests to dive the business forward.\nWrite well defined user stories, product requirement documents, and business cases for creators to leverage our technology.", "qualifications": {"required": "1-2 years of experience in product management or analytics\nPassion for data and analytics and drive to understand every detail.\nYou enjoy running experiments and learning from them quickly, setting KPIs and creating hypotheses to maximize outcomes of each test.\nAbility to take ownership and initiative, driving successful outcomes even amidst ambiguity.\nYou enjoy collaborating with engineering teams and stakeholders to rapidly deliver and iterate on new product features and to scale adoption.", "preferred": "Experience in the affiliate marketing space is a bonus and some level of performance marketing is preferred."}, "skills": ["Product Management", "Analytics", "Data Analysis", "Experimentation", "KPI", "Collaboration", "Affiliate Marketing", "Performance Marketing"], "postedDate": "4 days ago", "applicationDeadline": "", "benefits": "The base salary range for this position is $80,000-$95,000. The range provided is Raptive’s reasonable estimate of the annualized base compensation for this role. The actual amount may be higher or lower, based on non-discriminatory factors such as experience, geographic location, knowledge, skills and abilities. This role is eligible for additional incentive compensation that isn’t included in the posted range.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4003143590"}