{"jobTitle": "Client Success Associate (Entry level, Remote)", "company": {"name": "RemoteWorker US", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Finance and Sales", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/><strong>OUR HIRING PROCESS:<br/><br/></strong><ul><li>We will review your application against our job requirements. We do not employ machine learning technologies during this phase as we believe every human deserves attention from another human. We do not think machines can evaluate your application quite like our seasoned recruiting professionals—every person is unique. We promise to give your candidacy a fair and detailed assessment.</li><li>We may then invite you to submit a video interview for the review of the hiring manager. This video interview is often followed by a test or short project that allows us to determine whether you will be a good fit for the team.</li><li>At this point, we will invite you to interview with our hiring manager and/or the interview team. Please note: We do not conduct interviews via text message, Telegram, etc. and we never hire anyone into our organization without having met you face-to-face (or via Zoom). You will be invited to come to a live meeting or Zoom, where you will meet our INFUSE team.</li><li>From there on, it's decision time! If you are still excited to join INFUSE and we like you as much, we will have a conversation about your offer. We do not make offers without giving you the opportunity to speak with us live. After all, we consider our team members our family, and we want you to feel comfortable and welcomed.<br/><br/></li></ul>The Client Success is responsible for developing customer relationships that promote retention and loyalty. Works closely with customers to ensure that they are satisfied with the services they receive and to improve upon areas of dissatisfaction.<br/><br/><strong>Responsibilities And Duties<br/><br/></strong><ul><li>Develop and maintain relationships with a select group of named accounts to ensure campaign success</li><li>Serve as a trusted advisor for our clients and be an expert in INFUSEmedia offerings</li><li>Collaborate with internal subject matter experts to deliver campaign leads and ensure clients are happy with the outcome</li><li>Collaborate with the Sales team from proposal to delivery, including identifying and ensuring delivery options, integrations, and other operational aspects</li><li>Create and coordinate account documentation including reports, RFPs, and other recommendations</li><li>Accountable for post-sale account management and driving account growth through excellent customer service and delivery, communication and on-boarding<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Minimum two years of account management and/or customer success/service experience preferred</li><li>Organized, detail-oriented, and able to manage 30+ clients at once</li><li>Demonstrated ability to work both collaboratively as part of a team and independently with minimal supervision</li><li>Strong problem resolution skills and proven ability to engage and interact with internal teams to resolve client issues</li><li>Work logically to diagnose and resolve basic to intermediate issues and recognize circumstances that require escalation</li><li>Comfortable using and learning software: MS Office (Excel), custom-built software, CRM, ticketing/tracking systems, etc.</li><li>Outstanding written and verbal communication skills, coupled with strong empathy for customers and their success</li></ul>", "responsibilities": "The Client Success is responsible for developing customer relationships that promote retention and loyalty. Works closely with customers to ensure that they are satisfied with the services they receive and to improve upon areas of dissatisfaction.<br/><br/><strong>Responsibilities And Duties<br/><br/></strong><ul><li>Develop and maintain relationships with a select group of named accounts to ensure campaign success</li><li>Serve as a trusted advisor for our clients and be an expert in INFUSEmedia offerings</li><li>Collaborate with internal subject matter experts to deliver campaign leads and ensure clients are happy with the outcome</li><li>Collaborate with the Sales team from proposal to delivery, including identifying and ensuring delivery options, integrations, and other operational aspects</li><li>Create and coordinate account documentation including reports, RFPs, and other recommendations</li><li>Accountable for post-sale account management and driving account growth through excellent customer service and delivery, communication and on-boarding<br/><br/></li></ul>", "qualifications": {"required": "Minimum two years of account management and/or customer success/service experience preferred, Organized, detail-oriented, and able to manage 30+ clients at once, Demonstrated ability to work both collaboratively as part of a team and independently with minimal supervision, Strong problem resolution skills and proven ability to engage and interact with internal teams to resolve client issues, Work logically to diagnose and resolve basic to intermediate issues and recognize circumstances that require escalation, Comfortable using and learning software: MS Office (Excel), custom-built software, CRM, ticketing/tracking systems, etc., Outstanding written and verbal communication skills, coupled with strong empathy for customers and their success"}, "skills": ["Account Management", "Customer Success", "Customer Service", "CRM", "Excel"], "postedDate": "1 day ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003249349"}