{"jobTitle": "Educational Sales Representative (Work from Home)", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$12,000.00/yr - $41,600.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Are you ready to be part of something transformative? Nerdy is revolutionizing education with cutting-edge technology and a comprehensive suite of learning products tailored to every learner's needs. We're on the hunt for dynamic Educational Sales Representatives to join our team and help shape the future of learning!<br/><br/><strong>About the Role:</strong> As an Educational Sales Representative, you'll engage in meaningful conversations with prospective students and families who are eager to explore our high-quality, personalized learning products and services. Using a consultative approach, you'll dive deep to understand each student's unique needs, recommend customized solutions, and guide them to success by securing sales and payments via a comprehensive Learning Program. This is a remote, full-time position with the potential for significant bonus compensation based on overall performance related to meeting and exceeding sales goals. Come join our fast-growing team and help fulfill our mission of helping people learn!<br/><br/><strong>Why Nerdy?<br/><br/></strong><ul><li> Innovative Technology: Be a part of a company that's changing the game in education with innovative, tech-driven learning solutions.</li><li> Growth Opportunities: This is a fully remote, seasonal position with the potential for full-time employment based on your performance. Show us what you've got, and the sky's the limit!</li><li> Uncapped Earning Potential: Enjoy competitive base compensation with generous commission structures that reward your success. The more you sell, the more you earn—there's no cap on your potential income!</li><li> Lucrative Bonuses: Achieve and surpass your sales targets to unlock exciting performance bonuses and incentives.</li><li> Make a Difference: Help students achieve their learning goals and make a real impact on their educational journey.<br/><br/></li></ul><strong>About Nerdy:<br/><br/></strong>Nerdy (NYSE: NRDY) is a leading platform for live online learning, with a mission to transform the way people learn through technology. The Company's purpose-built proprietary platform leverages technology, including AI, to connect learners of all ages to experts, delivering superior value on both sides of the network. Nerdy's comprehensive learning destination provides learning experiences across 3,000+ subjects and multiple formats—including one-on-one instruction, small group classes, large format group classes, and adaptive self-study. Their proprietary platform leverages AI to personalize the experience for Learners of all ages —from kindergarten to professional—in academic, test prep, enrichment, and certification subjects. Nerdy's flagship business, Varsity Tutors, is one of the nation's largest platforms for live online tutoring and classes. Its solutions are available directly to students and consumers, as well as through schools and other institutions.<br/><br/><strong>Nerdy's shareholder letters below explain the product and strategy and are the most effective way to learn about what the company is building.<br/><br/></strong><ul><li>Q1-2024 Shareholder Letter</li><li>Q4-2023 Shareholder Letter</li><li>Q3-2023 Shareholder Letter<br/><br/></li></ul><strong>Pay/Benefits:</strong> This role offers a competitive compensation package, including:<br/><br/><ul><li>$41,600 base salary</li><li>$12,000 annualized variable compensation target, with uncapped bonus potential. Top earners exceed $100K in total cash compensation!</li><li>Comprehensive benefits package which includes health insurance, 4% 401K matching plan with no vesting, paid time off and company paid holidays, equipment (MacBook and headphones), and a free Varsity Tutors Learning Membership for you and your household (1-1 tutoring hours for you and your family, unlimited use of our on-demand learning services, and access to our online classes).<br/><br/></li></ul><strong>Location:</strong> Fully Remote Position<br/><br/><strong>Upcoming Start Dates/Trainings:</strong> Paid virtual training program will take place over the course of five weeks, Monday - Friday, 9am-6pm CDT.<br/><br/><strong>Qualifications:<br/><br/></strong><ul><li>Education, teaching, or tutoring experience is preferred.</li><li>Bachelor's degree strongly preferred.</li><li>High empathy and emotional intelligence, with the ability to understand families' educational needs and make</li><li>product/service recommendations.</li><li>Comfortable asking for sale and payment for mutually agreed on solution.</li><li>Strong interpersonal skills and ability to adapt quickly in a high phone volume environment.</li><li>Strong desire to help customers achieve learning outcomes and passionate belief in the value of high-quality online learning.</li><li>Confidence in communicating via phone with potential clients.</li><li>Ability to work independently, troubleshoot technical issues, and multi-task in a fast-paced environment. 35-40 hours per week, including some evenings and weekends.</li><li>Understand and appreciate that Nerdy is an apolitical company and that we can have the largest impact if we are united in our focus on helping people learn and not divided or distracted by advancing unrelated causes.<br/><br/></li></ul><strong>Responsibilities:<br/><br/></strong><ul><li>Outbound call-backs to potential customers who have requested tutoring, course or homeschool support.</li><li>Facilitate a consultative conversation to understand potential customer needs and recommend a customized solution.</li><li>Influence prospective student / family to complete purchase for services and/or schedule a follow-up conversation.</li><li>Achieve monthly performance targets (sales targets) by utilizing educational experience and top-notch VT-provided training.</li><li>Attend paid live training facilitated remotely via Zoom and pre-recorded modules.</li><li>Ability to work some evenings and weekends after the completion of our 5-week training ramp. </li><li>Adhere to our proven sales guidelines/prompts to ensure consistent customer experience and sales achievement.<br/><br/></li></ul><strong>Benefits/Training:<br/><br/></strong><ul><li>Fully Remote Position.</li><li>Company-issued Macbook, headphones, and latest software.</li><li>Once in a lifetime opportunity to help revolutionize how the world learns!</li><li>To support both the consultative and sales requirements of the position, we offer a training program with ongoing career development and opportunities for growth.</li><li>Learn industry-leading communication and sales techniques that will enable you to find solutions for families.</li><li>Become an expert in educational products and programs, including 1-on-1 tutoring, online classes, adaptive assessments, and homeschooling.<br/><br/></li></ul><em>Nerdy is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. </em><em>(INDHP)</em>", "responsibilities": "<ul><li>Outbound call-backs to potential customers who have requested tutoring, course or homeschool support.</li><li>Facilitate a consultative conversation to understand potential customer needs and recommend a customized solution.</li><li>Influence prospective student / family to complete purchase for services and/or schedule a follow-up conversation.</li><li>Achieve monthly performance targets (sales targets) by utilizing educational experience and top-notch VT-provided training.</li><li>Attend paid live training facilitated remotely via Zoom and pre-recorded modules.</li><li>Ability to work some evenings and weekends after the completion of our 5-week training ramp. </li><li>Adhere to our proven sales guidelines/prompts to ensure consistent customer experience and sales achievement.<br/><br/></li></ul>", "qualifications": {"required": "Education, teaching, or tutoring experience is preferred.", "preferred": "Bachelor's degree strongly preferred."}, "skills": ["Sales", "Education", "Teaching", "Tutoring", "Customer Service", "Communication", "Sales Management", "Consultative Selling", "Relationship Building", "Lead Generation", "Sales Process", "Sales Strategy", "Sales Operations", "Sales Training", "Sales Development", "Sales Management", "Sales Leadership", "Sales Coaching", "Sales Enablement", "Sales Pipeline Management", "Sales Forecasting", "Sales Reporting", "Sales Analytics", "Sales Automation", "CRM", "Salesforce", "Microsoft Dynamics", "HubSpot", "Salesforce", "Microsoft Dynamics", "HubSpot", "Zoom", "Microsoft Office", "Google Suite", "Microsoft Office", "Google Suite"], "postedDate": "1 day ago", "benefits": "This role offers a competitive compensation package, including:<br/><br/><ul><li>$41,600 base salary</li><li>$12,000 annualized variable compensation target, with uncapped bonus potential. Top earners exceed $100K in total cash compensation!</li><li>Comprehensive benefits package which includes health insurance, 4% 401K matching plan with no vesting, paid time off and company paid holidays, equipment (MacBook and headphones), and a free Varsity Tutors Learning Membership for you and your household (1-1 tutoring hours for you and your family, unlimited use of our on-demand learning services, and access to our online classes).<br/><br/></li></ul>", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003252171"}