{"jobTitle": "Immediate Openings - Remote Customer Service Representative - 19 plus Hourly", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/><strong>Remote Customer Support Specialist - Start at $19+/hr, No Degree Required<br/><br/></strong>Are you driven by a desire to help others and solve problems efficiently? We are seeking enthusiastic individuals to join our team as Remote Customer Support Specialists. You will play a crucial role in delivering outstanding service and creating memorable experiences for a diverse client base from the comfort of your home.<br/><br/><strong>What You Will Do:<br/><br/></strong><ul><li>Handle customer inquiries and issues with empathy and efficiency</li><li>Resolve challenges professionally, ensuring customer satisfaction</li><li>Communicate clearly and persuasively in both oral and written forms</li><li>Maintain a positive and approachable demeanor throughout customer interactions<br/><br/></li></ul><strong>Ideal Candidate Traits:<br/><br/></strong><ul><li>Strong passion for and commitment to exceptional customer service</li><li>Excellent communication and interpersonal skills</li><li>Ability to multitask and operate independently</li><li>Skilled in various computer systems and software applications<br/><br/></li></ul><strong>Benefits of Joining Our Team:<br/><br/></strong><ul><li>Fully remote work: Experience the freedom to work from anywhere</li><li>Flexible hours: Design your own work schedule to fit your lifestyle</li><li>Competitive pay: Earn at least $19 per hour, with potential for more</li><li>Growth opportunities: Enhance your skills and advance your career<br/><br/></li></ul><strong>Get Started With Us:<br/><br/></strong>Additional Information: No prior experience or educational qualifications are necessary. Candidates must have a quiet work environment and reliable internet access. A background check is required for all applicants. We celebrate diversity and are proud to be an equal opportunity employer, welcoming all applicants regardless of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/>#ZR", "postedDate": "1 day ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4003250341"}