{"jobTitle": "Event Manager", "company": {"name": "Derflan, Inc.", "location": "United States"}, "location": "United States", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management", "industry": "Business Consulting and Services and Technology, Information and Media", "description": "<strong>Job Overview:</strong> Derflan is seeking a skilled and experienced <strong>part-time </strong>Event Manager to oversee the planning, coordination, and execution of both regional and homegrown events across the United States. This role is crucial in aligning event objectives with business goals, managing event budgets, and ensuring successful execution. This is an excellent opportunity for a detail-oriented and organized professional to contribute to high-impact events that drive business success.", "responsibilities": "<strong>Key Responsibilities:</strong><ul><li><strong>Event Calendar Management:</strong> Oversee and manage the comprehensive event calendars, including both regional and homegrown events. This includes coordinating with various stakeholders to ensure that all event dates, venues, and logistics are strategically planned and aligned with broader business goals.</li><li><strong>Logistics Coordination:</strong> Take charge of all logistics associated with events, from initial planning to final execution. This involves ensuring that all elements such as registration processes, attendee management, venue arrangements, event content, and on-site logistics are meticulously planned and executed. The Event Manager will ensure that all logistical details are confirmed and locked down well in advance.</li><li><strong>Budget Management:</strong> The Event Manager will be responsible for managing and tracking the event budget, ensuring that all expenses are accounted for and within the allocated budget. This includes making strategic decisions to optimize resources, negotiating with vendors, and providing regular budget updates to stakeholders. The ability to manage the budget effectively is crucial to ensuring the financial success of each event.</li><li><strong>Support Local Events:</strong> In addition to managing larger regional events, the Event Manager will also support the planning and execution of one-off or homegrown events, such as client or partner events, dinners, and conferences. This requires a strong focus on ensuring all events meet the same high standards as larger-scale events.</li></ul>", "qualifications": {"required": "<strong>Experience:</strong> 2-4 years of experience in corporate event management and planning, with a track record of successfully coordinating a variety of events ranging from small meetings to large conferences. The ideal candidate will have experience managing the entire event lifecycle, from conception to post-event analysis.", "preferred": "<strong>Logistics Expertise:</strong> A demonstrated ability to manage complex event logistics with precision and efficiency. The Event Manager should be capable of handling multiple events simultaneously, ensuring that all details are meticulously planned and executed. Experience in coordinating with multiple stakeholders, including vendors, venues, and internal teams, is essential.\n\n<strong>Budget Management:</strong> Proven experience in managing event budgets, including the ability to track expenses, negotiate with vendors, and ensure that all events are delivered within budget constraints. The Event Manager should be comfortable with financial reporting and providing regular budget updates to stakeholders.\n\n<strong>Microsoft Experience:</strong> While prior experience working with Microsoft or in a similar tech environment is a plus, it is not a requirement for this role. The key is a strong understanding of corporate event planning and the ability to adapt to different environments and client needs."}, "skills": ["Event Management", "Logistics", "Budget Management", "Microsoft"], "postedDate": "4 days ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003126676"}