{"jobTitle": "Director of Business Development", "company": {"name": "Fairmatic", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Business Development and Sales", "industry": "Insurance", "description": "At Fairmatic we're on a mission to make roads safer, one fleet at a time. Fairmatic is revolutionizing the auto insurance industry by using data and AI to personalize options and incentivize safe driving with savings. Our predictive risk models have been trained with 200 billion miles of driving data and tested with hundreds of thousands of paying drivers. Fairmatic's leadership team includes serial entrepreneurs, insurance industry innovators, and startup veterans who have raised over $88M in funding in less than a year. Join our global team of curious, adaptable technologists and problem solvers who are passionate about creating a positive impact on the world! We're looking for a hungry, motivated and talented Business Development Director to report to our CEO. This individual contributor role will be responsible for developing and executing strategic partnership initiatives to drive business growth, key partnerships and enhance market presence. You’ll be cultivating and maintaining strong relationships with key partners, negotiating and managing commercial agreements, and collaborating with internal teams to ensure alignment with overall business objectives. The skills you'll bring to Fairmatic:<br/><br/><ul><li>Partnership Strategy Development: Develop and implement a comprehensive partnership strategy to drive business growth and expand market presence. This includes but is not limited to working with:</li><li>Strategic partners, such as mobile navigation / routing apps, transportation safety providers, telematics providers, and GenAI platforms</li><li>Others in the insurance ecosystem: MGAs, Carriers, and other non-broker channels</li><li>Large entities and PE-backed businesses: identifying large businesses that Fairmatic could partner with on holistic insurance needs</li><li>Relationship Management: Cultivate and maintain strong relationships with existing and potential partners, ensuring mutual benefit and long-term collaboration</li><li>Negotiation and Contract Management: Lead negotiations with partners, drafting, reviewing, and managing partnership agreements with great attention to detail and quick turnaround to ensure favorable terms and compliance with company policies</li><li>Event Participation: Represent the company at industry events, conferences, and networking functions to promote the brand and establish new partnerships</li><li>Cross-functional Collaboration: Work closely with internal teams, including marketing, sales, and product, to align partnership activities with overall business objectives<br/><br/><br/></li></ul>The skills you'll bring to Fairmatic:<br/><br/><ul><li>Extensive Business Development experience in an enterprise environment</li><li>Exposure to the insurance industry. You don't have to have worked at a top 50 insurer, but exposure to the industry (an ideally others) is a must! </li><li>Proven strategic negotiation skills</li><li>A solid track record in partnertship management and new channel/partnership development</li><li>You’re independent and reliable and know how to get things done within and between organizations</li><li>You love to learn and find better ways to do things</li><li>You’re a people person: chatting with people gives you a buzz and you love sharing your infectious energy with others</li><li>You’re a hustler and a shrewd negotiator: you're always looking for opportunities to add value, and are known by your peers as being proactive, having great agency and ownership and “going after it” </li><li>You like to solve problems and get things done with no drama or ego</li><li>You’re a strategic thinker: you are able to develop, implement, and manage strategic plans and are able to drive a holistic partnership management strategy</li><li>You are interested in the insurance industry: you either have an understanding of the insurance market, or a hunger to learn and ability to do so quickly and thoroughly <br/><br/><br/></li></ul>Some of our US Benefits &amp; Perks: Unlimited PTO! Medical, dental, and vision coverage Life and disability insurance Learning and development program and stipend Stipends for wellness and entertainment Fully remote work supplemented with fun in-person events Awesome Fairmatic gifts and swag! We are always on the hunt for talented individuals! Join us and let’s fulfill our mission to make roads safer, one fleet at a time.", "postedDate": "1 day ago", "benefits": "Unlimited PTO! Medical, dental, and vision coverage Life and disability insurance Learning and development program and stipend Stipends for wellness and entertainment Fully remote work supplemented with fun in-person events Awesome Fairmatic gifts and swag!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4003560795"}