{"jobTitle": "Shift Manager", "company": {"name": "The Wendy's Company", "location": "Miami, FL"}, "location": "Miami, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "WHY WENDY’S?<br/><br/>Families come in all shapes and sizes, that includes the Wendy’s family - the people you will work with as a Shift Manager.<br/><br/>We get you. We got you. Here’s what you can expect as a Shift Manager on our team:<br/><br/><ul><li>Perks - Healthcare benefits for full-time shift managers, paid time off, 401(k) with employer match and employee assistance program available for ALL employees</li><li>Career Growth - Wanna move up? We have opportunities to grow within and beyond our restaurants</li><li>Paid Training - We’re invested in you, and excited to teach you what you need to know to lead the Wendy’s Way<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><strong>What We Expect From You<br/><br/></strong>What you bring to the table:<br/><br/><ul><li>You enjoy problem solving, customer service and decision making</li><li>You want to be a leader and you’re committed to teaching and growing your team</li><li>A commitment to promoting proper procedures and a culture of food safety</li><li>Flexible work availability<br/><br/></li></ul><strong>You Must Be Willing And Able To<br/><br/></strong><ul><li>Stand and move for most - if not all - of your shift</li><li>Use restaurant equipment such as a headset, register or grill</li><li>Follow brand standards and guidelines to prepare great food, serve our customers and maintain a clean restaurant that you’re proud to work in</li><li>Secure reliable transportation to travel to your home store and other locations (restaurants, area office, etc.) occasionally for training and other tasks<br/><br/></li></ul>For more information on specific equipment or job requirements, see the job description or talk to the hiring manager.<br/><br/><strong>Real food. Real people.<br/><br/></strong>We are a proud equal opportunity employer all ages, races, religions, nationalities, genders and the LGBTQ+ community are welcome. We provide reasonable accommodations in order to enable people with disabilities to perform the essential functions of their jobs.", "postedDate": "18 hours ago", "benefits": "Healthcare benefits for full-time shift managers, paid time off, 401(k) with employer match and employee assistance program available for ALL employees", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004469132"}