{"jobTitle": "Recruiter", "company": {"name": "Maxonic", "location": "United States"}, "location": "United States", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Human Resources, Other, and Education", "industry": "Broadcast Media Production and Distribution and Entertainment Providers", "description": "Maxonic maintains a close and long-term relationship with our direct client. In support of their needs, we are looking for a Recruiter.\nJob Description:\n\nJob Title: Recruiter\nJob Type: Contract\nWork Schedule: Remote\n\nJob Description - \n<ul><li>Strategically plan and foster a strong talent pipeline of Software Engineering, Machine Learning and Data Science candidates.</li><li>Plan and execute virtual campus recruiting events in an effort to build and maintain relationships with key universities and student organizations.</li><li>Manage the recruitment process end-to-end for both university grad and intern hiring mainly for students, ensuring a smooth and positive candidate experience.</li><li>Use our data and tools to continuously improve our overall effectiveness.</li><li>Provide support across our University programs including on-boarding, events, mentoring, various training and much more.</li><li>Roll your sleeves up and get involved wherever needed.</li></ul>\n\nSkills - \n\n<ul><li>3-5 years of full-cycle recruiting experience (university or industry), Machine Learning, Data Science experience a plus</li><li>Knowledge of major applicant tracking systems (Greenhouse) and sourcing tools (LinkedIn, Gem, Canvas)</li><li>Ability to proactively network and establish effective working relationships with hiring managers.</li><li>Driven to build and source a solid pipeline of qualified applicants all while providing a great experience for candidates.</li><li>Detail oriented, ability to multi-task and results driven</li><li>Ability to prioritize, flex, and work in a fast paced, ever-changing environment</li></ul>\n\nAbout Maxonic:\nSince 2002 Maxonic has been at the forefront of connecting candidate strengths to client challenges. Our award winning, dedicated team of recruiting professionals are specialized by technology, are great listeners, and will seek to find a position that meets the long-term career needs of our candidates. We take pride in the over 10,000 candidates that we have placed, and the repeat business that we earn from our satisfied clients.\n\nInterested in Applying?\n\nPlease apply with your most current resume. Feel free to contact Neha Dhiman (neha.d@maxonic.com / (408) 400-2309) for more details\n", "postedDate": "1 hour ago", "skills": ["Machine Learning", "Data Science", "Greenhouse", "LinkedIn", "Gem", "Canvas"], "url": "https://www.linkedin.com/jobs/view/4004473932"}