{"jobTitle": "Remote Medical Scribe", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Job Description<br/><br/><strong>Description<br/><br/></strong><em>Become a Medical Scribe First<br/><br/></em><strong>Scribe-X offers unparalleled clinical experience and preparation for medical school. <br/><br/></strong><ul><li> Work from home and gain clinical experience!</li><li>Receive extensive paid training that will help you master EMR systems and patient documentation procedures. </li><li>Develop professional mentorships as you work one-on-one with providers.</li><li>Gain patient contact hours and letters of recommendation that will make your applications stand out. </li><li>Work for a company that understands the med school application process and supports your healthcare goals. <br/><br/></li></ul><em>Anyone looking to begin a career in medicine (MD, DO, PA, NP, or RN) should consider becoming a medical scribe first!<br/><br/></em><strong>Scribe Pay Structure:<br/><br/></strong>$11/hour – No scribe experience<br/><br/>$12/hour – 6+ months scribe experience<br/><br/>$14-17/hour – Lead scribe (1+ year scribe experience required)<br/><br/><ul><li>$1/hour for fluent Spanish-speaking candidates <br/><br/></li></ul><strong>Summary of Position Description:<br/><br/></strong>The Scribe-X medical scribe is a critical member of the patient care team. Medical scribes will work side-by-side a healthcare provider to document patient encounters in real-time. Medical scribe training is provided to all scribes to assure they are prepared to support their assigned provider(s).<br/><br/>Duties of a Medical Scribe<br/><br/><ul><li>Perform chart preparation per clinic protocol</li><li>Accompany the provider in all scheduled patient visits</li><li>Document the patient history, physical exam, procedures, and patient plan, as performed by the provider</li><li>Remind provider of relevant quality metrics when appropriate, documenting to support quality metrics</li><li>Enter laboratory and radiographic studies, as ordered by the provider</li><li>Enter in medication orders, as dictated by the provider</li><li>Document and print instructions for the patient</li><li>Review completed charts with the provider between patients or at the completion of shift</li><li>Update provider preference and clinic preference documents as necessary<br/><br/></li></ul>Education and Skills<br/><br/><ul><li>Excellent verbal and written English skills</li><li>Strong computer skills with the ability to learn and navigate new software quickly</li><li>Healthcare track (e.g. pre-med, pre-PA, pre-nursing) is preferred</li><li>Bachelor’s degree strongly preferred with a GPA of 3.00 or greater</li><li>If no college degree, 1+ years of full time work experience as a scribe</li><li>Most assignments require a typing speed of at least 60 WPM </li><li>Opportunities for experienced scribes making up to $16/hr<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Opportunity for letters of recommendation from providers</li><li>Gain patient contact hours</li><li>Paid time-off on an accrual basis</li><li>Up to $150/month reimbursement for a healthcare plan <br/><br/></li></ul><strong><em>$200 REFERRAL BONUS IF YOUR FRIENDS JOIN SCRIBE-X!</em></strong>", "jobFunction": "Health Care Provider", "industry": "Staffing and Recruiting", "postedDate": "11 hours ago", "skills": [], "benefits": "Opportunity for letters of recommendation from providers, Gain patient contact hours, Paid time-off on an accrual basis, Up to $150/month reimbursement for a healthcare plan", "url": "https://www.linkedin.com/jobs/view/4004246551"}