{"jobTitle": "Sales Rep - Remote, no cold callling with great mentoring", "company": {"name": "RemoteWorker US", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "150,000.00/yr - 300,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>Notice: We are not considering international candidates.<br/><br/>Join Our Trailblazing Team and Elevate Your Sales Career!<br/><br/>Are you ready to join a dynamic organization that has consistently ranked among the Inc. 5000 list of fastest-growing companies for six consecutive years? Recently featured in Forbes, our company is experiencing unprecedented growth and is seeking enthusiastic, driven individuals to help manage our burgeoning client demands.<br/><br/>This isn't just a job; it's an opportunity for rapid career advancement. We're dedicated to fostering talent, and we're seeking quick learners who can embrace our proven sales process. Our first-year representatives, leveraging our straightforward strategy, typically earn over $150,000 annually. By your second or third year, you could be earning between $250,000 to $300,000!<br/><br/>Responsibilities:<br/><br/>Working 1-on-1 with a mentor, and also as part of a team, our sales rep's role is very simple:Our company receives in-bound requests from people across the country requesting information about various types of insurance coverage. Our agents call that prospect, get qualifying information about their needs over the phone, and sets an appointment to meet them virtually (zoom or phone call). The agent then uses our proprietary tools to generate quotes for the prospect based on their qualifications and presents/sell that solution in the virtual meeting.<br/><br/>The typical sales cycle from initial contact to commission payment is 72 hours.There are 3 MUST HAVE qualities we look for in someone when considering adding them to our team:<br/><br/><ul><li> Strong Character (One of our core values is: we do the right thing when nobody's looking.)</li><li> Strong Work Ethic (Are you committed to getting better?)</li><li> Humility (Can you set your ego aside and be coachable?)If you are a professional, go-getter, we have an opportunity that will blow you away.Apply with your resume / why you think you would be a good fit, and we will get back to you with interview availability.DISCLAIMER: This position is a 1099 independent contractor commission-based sales position.<br/><br/></li></ul>DISCLAIMER: This position is a 1099 independent contractor commission-based sales position.<br/><br/>Powered by JazzHR<br/><br/>JU1BZ1L3eB", "postedDate": "12 hours ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004250293"}