{"jobTitle": "VEHICLE COORDINATOR", "company": {"name": "Jacksonville Sheriff's Office", "location": "Jacksonville, FL"}, "location": "Jacksonville, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Law Enforcement", "description": "8/20/2024<br/><br/><strong> Post End Date <br/><br/></strong>9/3/2024<br/><br/><strong>Job Description<br/><br/></strong>This is technical work in coordinating, inspecting, and expediting the day-to-day repair, servicing, and testing of vehicles and equipment, which includes issuing vehicles and equipment; and maintaining applicable records. Work requires knowledge of the techniques, methods, standards, regulations and procedures for vehicle and equipment operation and preventive maintenance service requirements and the use of specialized skills in compiling, preparing, and maintaining records and reports which is learned on the job or through specialized training. Contacts require skills in understanding and influencing people and are important in coordinating activities including skills of persuasiveness, assertiveness, and sensitivity to others point of view that are required to influence behavior, change an opinion, or turn a situation around. The work is standardized in that tasks are covered by substantially diversified procedures and specialized standards, and because of the changing priorities, or different situations, incumbents have the latitude to consider which of the many procedures or standards should be followed and in what sequence. The work involves differing situations requiring use of judgment in search for solutions or new applications within ones' known experiences. The work is performed in both a garage shop and field environment, where the risks and hazards are minimal, known, predictable and controllable, and where there is exposure to noise, dust, dirt, or other unpleasant conditions. Physical demands consist of visually inspecting vehicles and associated equipment; sitting, standing, or walking for extended periods; and occasionally lifting objects weighing 30 pounds or more. Operates a vehicle, two-way radio, and standard office equipment such as personal computer. The work is performed under general supervision where the work assignments are varied, and although subject to standard practices, methods and procedures, the worker is permitted some latitude to set own priorities subject to superior's approval.<br/><br/><strong> Examples of Work <br/><br/></strong><ul><li>Coordinates, inspects, and expedites the day-to-day repair, servicing and testing of vehicles and associated equipment with vendors or applicable City Agencies. </li><li>Issues vehicles and equipment. </li><li>Compiles, prepares, and maintains reports and records on equipment maintenance, assignment, fuel consumption and related activities. </li><li>Conducts frequent inspections and reports on the state of maintenance activities. </li><li>Examines and verifies repair order charges and reports recommended corrections. </li><li>Inspects equipment usage in the field for correct and safe operation. </li><li>Delivers or coordinates the delivery of vehicles and associated equipment to the repair center or work location. </li><li>Monitors pool vehicles to ensure that vehicles are accounted for, serviced, and repaired. </li><li>Provides feedback on necessary changes for vehicle and equipment specifications. </li><li> Operates standard office equipment such as personal computer using word processing, spreadsheet, database, and other related software. </li><li>Operates vehicles and associated equipment to diagnose basic maintenance problems. </li><li>Performs related work as required. <br/><br/></li></ul><strong>Knowledge, Skills And Abilities<br/><br/></strong><ul><li>Knowledge of the techniques, methods, standards, regulations, and procedures governing vehicle and equipment operation and preventive maintenance service requirements. </li><li>Knowledge of policies and procedures pertaining to vehicle and equipment assignment, inspections and inventory and maintenance record keeping. </li><li>Skill in coordinating, inspecting, and expediting the day-to-day repair, servicing, and testing of vehicles and equipment with vendors or applicable City Agencies. </li><li>Skill in compiling, preparing, and maintaining vehicle and equipment records and reports. </li><li>Ability to monitor repairs and servicing of equipment and report areas of concern for the purposes of cost effectiveness and efficiency. </li><li>Ability to operate vehicles and equipment and diagnose basic maintenance problems. </li><li>Ability to operate standard office equipment such as personal computer using word processing, spreadsheet, database, and other related software. </li><li>Ability to perform arithmetic computations. </li><li>Ability to review data and reports and recommend corrective action. </li><li>Ability to communicate effectively both verbally and in writing. <br/><br/></li></ul><strong>Open Requirements/Supplemental Information<br/><br/></strong><strong>OPEN REQUIREMENTS</strong><strong>: </strong> Must have two years of experience in coordinating vehicle or equipment maintenance, assignment, or related logistical support functions.<br/><br/><strong>LICENSING/CERTIFICATION/REGISTRATION</strong><strong>:</strong> A valid driver’s license is requirement prior to appointment and must be maintained during employment in this class. Must qualify for prior to appointment, obtain and maintain during employment in this class a City of Jacksonville Public Driver Certification.<br/><br/><strong> The City of Jacksonville is an Equal Opportunity/Equal Access Employer and will provide equal opportunity to all employees and applicants in compliance with all applicable federal and state employment laws and the current interpretation of employment discrimination by the United States Equal Employment Opportunity Commission, as set forth in Directive 0528 . There shall be no discrimination or harassment against any person with regard to race, color, sex (including pregnancy), sexual orientation, gender identity or expression, religion, political affiliation, national origin, disability, age, marital status, veteran status, or any other impermissible factor in recruitment, hiring, compensation, training, placement, promotion, discipline, demotion, transfers, layoff, recall, termination, working conditions and related terms and conditions of employment. <br/><br/></strong><strong> Min <br/><br/></strong>USD $3,481.77/Mo.<br/><br/><strong> Max <br/><br/></strong>USD $3,481.77/Mo.", "postedDate": "1 hour ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004466294"}