{"jobTitle": "Production Assistant", "company": {"name": "Madison Square Garden Entertainment Corp.", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Temporary", "employmentType": "Temporary", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Entertainment", "description": "Madison Square Garden Entertainment Corp. (MSG Entertainment) is a leader in live entertainment, delivering unforgettable experiences while forging deep connections with diverse and passionate audiences. The Company’s portfolio includes a collection of world-renowned venues – New York’s Madison Square Garden, The Theater at Madison Square Garden, Radio City Music Hall, and Beacon Theatre; and The Chicago Theatre – that showcase a broad array of sporting events, concerts, family shows, and special events for millions of guests annually. In addition, the Company features the original production, the Christmas Spectacular Starring the Radio City Rockettes, which has been a holiday tradition for 90 years. More information is available at www.msgentertainment.com. <br/><br/><strong>Who are we hiring? <br/><br/></strong><em>This is a temporary position supporting the Productions Talent Management department with special event and appearance tracking and pre-production during the production season. <br/><br/></em><strong>What will you do? <br/><br/></strong><ul><li>Responsible for tracking and communicating all changes and updates to Rockettes event requests with Productions Talent Management, PR, Productions, Rockettes creative director, wardrobe, stage management (when applicable), and any other supporting staff.</li><li>Responsible for creating a daily report of changes/updates sent to all departments and reviewed in person with Prod. Talent Management and wardrobe, both in the daily report and in real-time.</li><li>Role will need to be aware of all dry clean schedules and potential wardrobe scheduling conflicts, earmark and alert the necessary parties including Rockettes Admin., PR and RCMH staff with any conflicts.</li><li>Tasked with making sure the on-duty RCMH wardrobe representative is made aware of changes that affect prep and scheduling.</li><li>Create simplified tracking procedure to communicate with PR department on event statuses</li><li>Develop understanding of events to assist all related departments in preparing for events and appearances as well as serving as team representative for on-site and off-site events.<br/><br/></li></ul><strong>What do you need to succeed?<br/><br/></strong><ul><li>Ability to demonstrate success in managing multiple tasks while under tight deadlines and financial constraints.</li><li>Ability to work weekends and holidays in addition to working regular afternoon/evening shifts.</li><li>Must possess excellent verbal and written communication, organizational, and time management skills.</li><li>Must be highly responsive to emergencies in a fast-paced, time-sensitive environment.</li><li>Possess exceptional attention to detail and strong follow-up skills necessary.</li><li>Must have the ability to work independently when necessary and use sound business judgment.</li><li>Experience in logistics in the live entertainment or sports environment or similar industry.</li><li>Able to work under pressure and meet deadlines, while managing multiple tasks.<br/><br/></li></ul><strong>Special Requirements<br/><br/></strong><ul><li>Must be able to lift 25 lbs. without difficulty</li><li>Must be flexible to schedule some shifts around the constantly changing production schedule.</li><li>Must be available to work at least 30 hours per week, with afternoon, evening and nighttime availability.</li><li>Must be proficient in Microsoft Office suite, specifically Excel (basic formulas &amp; formatting)<br/><br/></li></ul>Hourly Pay Range<br/><br/>$26—$28 USD<br/><br/>At MSG, we recognize the importance of upskilling employees’ talents and strengths so they can drive their careers forward. We are proud to offer a robust set of tools and resources to help employees understand their interests and purpose, harness their talents and obtain the skills they need to reach the next step in their careers. Growth and longevity for our employees are top priorities here.<br/><br/>We value diversity and are looking for extraordinary employees of all backgrounds! MSG is an Equal Opportunity Employer and provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, sexual and reproductive health choices, national origin, citizenship, age, genetic information, disability, or veteran status. In addition to federal law mandates, MSG complies with all applicable state and local laws governing nondiscrimination in all locations and will consider requests for reasonable accommodations as required.<br/><br/>", "responsibilities": "<ul><li>Responsible for tracking and communicating all changes and updates to Rockettes event requests with Productions Talent Management, PR, Productions, Rockettes creative director, wardrobe, stage management (when applicable), and any other supporting staff.</li><li>Responsible for creating a daily report of changes/updates sent to all departments and reviewed in person with Prod. Talent Management and wardrobe, both in the daily report and in real-time.</li><li>Role will need to be aware of all dry clean schedules and potential wardrobe scheduling conflicts, earmark and alert the necessary parties including Rockettes Admin., PR and RCMH staff with any conflicts.</li><li>Tasked with making sure the on-duty RCMH wardrobe representative is made aware of changes that affect prep and scheduling.</li><li>Create simplified tracking procedure to communicate with PR department on event statuses</li><li>Develop understanding of events to assist all related departments in preparing for events and appearances as well as serving as team representative for on-site and off-site events.<br/><br/></li></ul>", "qualifications": {"required": "Ability to demonstrate success in managing multiple tasks while under tight deadlines and financial constraints. Ability to work weekends and holidays in addition to working regular afternoon/evening shifts. Must possess excellent verbal and written communication, organizational, and time management skills. Must be highly responsive to emergencies in a fast-paced, time-sensitive environment. Possess exceptional attention to detail and strong follow-up skills necessary. Must have the ability to work independently when necessary and use sound business judgment. Experience in logistics in the live entertainment or sports environment or similar industry. Able to work under pressure and meet deadlines, while managing multiple tasks.<br/><br/>", "preferred": "Must be able to lift 25 lbs. without difficulty Must be flexible to schedule some shifts around the constantly changing production schedule. Must be available to work at least 30 hours per week, with afternoon, evening and nighttime availability. Must be proficient in Microsoft Office suite, specifically Excel (basic formulas &amp; formatting)<br/><br/>"}, "skills": ["Communication", "Time Management", "Organization", "Logistics", "Microsoft Office", "Excel"], "salary": {"amount": "26—$28 USD", "currency": "USD"}, "postedDate": "1 hour ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004474556"}