{"jobTitle": "Print Production Coordinator", "company": {"name": "Tag", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Administrative and Advertising", "industry": "Media Production", "description": "At Tag, we love what we do and pride ourselves on an authentic culture built on our core values of integrity, innovation, sustainability, growth, and accountability<br/>\nWe are a leading creative production and sourcing partner to brands and agencies and we have over 50 years of marketing execution experience, working with the world’s best brands. We are creative directors, graphic designers, CGI artists, writers, photographers, producers, linguists, operations experts, and account managers, coming together to deliver impactful content with craft, scale, and speed.<br/>\nOur marketing expertise digs deep into industry sectors and marketing channels, to help our clients stand out and sell more, everywhere.<br/>\nAs people, we are collaborators and makers, learners, and listeners, with a strong commitment to diversity, equity and inclusion, service, and work-life harmony.<br/>\nAs a Production Coordinator we’re looking for you to bring a strong willingness to learn and coordinate print and vendor management. Primary responsibility will be to monitor, management and handle production related functions of direct mail campaigns. Knowledge of lettershop, mailing and the postal service is a plus, as well as experience in an agency environment. We service a wide variety of marketing verticals (pharmaceutical, financial and banking, retail, travel, and entertainment), Production experience in one of these verticals is desired.<br/>\nExperience:<br/>\n• Minimum of 1-2 years of print production and / or direct mail experience<br/>\n• Experience coordinating deliverables of third party suppliers (i.e. printers, letter shops).<br/>\n• Familiarity with USPS regulations.<br/>\n• Self-motivated to learn all aspects of targeted, multi-channel direct marketing. <br/>\n• Coordinate the print production activities of one or more clients, primarily direct mail, including: estimating, scheduling, project management, vendor management, pre-press, printing/personalization and lettershop services<br/>\n• Coordinate projects that may include: versioning, data segmentation, multiple mail drops, multi-lingual translations and more<br/>\n• Coordinate the vendor relationship with skill, diplomacy, an eye for detail and a sense of urgency as you schedule and manage the outsourced production to vendors. Research and select vendors who can provide the best-in-class capabilities and creative options.<br/>\n• Work with Production Managers to create job specifications that best fit the Creative strategy, budget and objectives.<br/>\n• Estimate projects – work with Production Managers on budgets and negotiate with external vendors to obtain best pricing.<br/>\n• Work with Production Managers to review estimates to ensure the company’s profit goals are met while achieving customer satisfaction.<br/>\n• Meet tight deadlines while successfully coordinating programs.<br/>\n• Maintain a high level of fiscal responsibility by coordinating project budgets, generating purchase orders; making the reconciliation of monthly projects and client billings a top priority.<br/>\n• Work with Production Managers to implement a production evaluation process to identify opportunities for increased efficiencies and profitability.<br/>\n• Willingness to learn Postal regulations is a must – domestic, standard and non-profit mail.<br/>\n<br/>\n<br/>\n<em> The salary range for this position is 52K minimum - $57K maximum per annum depending upon experience. Compensation varies depending on location, and job-related factors such as experience, responsibilities, and business needs.</em><br/>\n<br/>\n<em>This is the opportunity to work in an environment that best suits your needs, fueled by flexible hours and locations, strong supportive benefits, career training and development, and, most importantly, an inclusive environment that eliminates barriers and elevates voices, giving every member of the Tag team an opportunity to be seen and heard.</em><br/>\n<br/>\n<em>We’ve made a strong commitment to diversity and inclusion and are taking a stance on equality in the workplace. We support sustainability, in our organization and with our network of partners and suppliers.</em><br/>\n<br/>\n<em>As an ethical employer, Tag will never ask job applicants to provide private, sensitive information upfront or make offers of employment contingent on financial requests or responsibilities from any candidate.</em>", "postedDate": "2 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004458165"}