{"jobTitle": "Sales Representative (Remote and No Experience Needed)", "company": {"name": "RemoteWorker US", "location": "Las Vegas, NV"}, "location": "Las Vegas, NV", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Staffing and Recruiting", "description": "Job Description<br/><br/>PLEASE NO INTERNATIONAL CANDIDATES AT THIS TIME. WE WILL NOT SPONSOR VISA (H1-2-2b)<br/><br/>Stratford Davis Staffing is proud to bring this opportunity to the Sales community.<br/><br/>From Our Partner:<br/><br/>Our company has been consecutively honored as a Top Company Culture by Entrepreneur Magazine, and consistently earns high employee ratings on Glassdoor and Indeed. We've also been favorably reviewed by the Better Business Bureau (BBB), Trust Pilot, Google, Yelp, and more and have maintained a presence on the Inc. list of fastest-growing companies for six years.<br/><br/>This role operates as a 1099 independent contractor position. Following our established system, our sales representatives have historically achieved earnings surpassing $100,000 within their initial year. Additionally, we offer a Training Bonus, which has the potential to provide new representatives with up to $30,000 in cash bonuses during their first 120 days, in addition to their commissions, contingent on performance benchmarks.<br/><br/>Key features that distinguish us include:<br/><br/><ul><li>A comprehensive, free online interactive training and support system.</li><li>Our in-house warm lead generation, eliminating the need for cold calls.</li><li>Daily commission payouts (Commission-Only position).</li><li>State-of-the-art technology tools for sales, provided at no cost.</li><li>Continuous mentoring from accomplished business partners.</li><li>Annual all-expenses-paid incentive trips around the world.<br/><br/></li></ul>Our innovative approach eliminates traditional demands such as physical offices, commutes, and mandatory meetings. We promote a flexible workflow that optimizes productivity and work-life balance.<br/><br/>Roles and Responsibilities:<br/><br/><ul><li>Collaborating closely with mentors and functioning as part of a team, our sales representatives.</li><li>Respond to inbound requests spanning diverse insurance coverage types. Collect qualifying information, arrange virtual appointments, generate customized quotes, and present solutions.<br/><br/></li></ul>We value candidates who embody:<br/><br/><ul><li>Integrity</li><li>A dedication to continuous enhancement.</li><li>Humility and a willingness to receive coaching.<br/><br/></li></ul>For those who seek professional excellence, we present an unparalleled opportunity. If you're interested, please submit your resume, and we'll coordinate an interview.<br/><br/>DISCLAIMER: This position falls under the category of an independent contractor commission-based sales role (1099).<br/><br/>Powered by JazzHR<br/><br/>ghMVdrgjUR", "postedDate": "12 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004244734"}