{"jobTitle": "Administrative Assistant", "company": {"name": "J.Crew", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "26.83/yr - 33.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Retail", "description": "<strong>Our Story</strong><p>We make modern classics with character. We believe in true timelessness, the integrity of well-made clothes, and since our inception, great quality at a great price. That’s in our DNA.</p><p>But, we know it’s not only about the clothes—it’s about the<em> feeling</em>it gives the people who wear them<em>,</em> whether they’re confidently giving a presentation in a well-tailored suit; basking in long salty beach days in vibrant, colorful sun-soaked swimsuits, or joyfully re-discovering their favorite Rollneck sweater in their closet again and again, season after season.</p><p><br/></p><p>And ultimately, it’s about helping our customers be the best, most authentic versions of themselves. And <em>that’s</em> what we’re after, to inspire people’s lives and style.</p><p><br/></p><p>Our dedication to Diversity, Equity, Belonging &amp; Sustainability has been celebrated with industry recognition, reflecting our commitment to fostering an inclusive and sustainable workplace.</p><p><br/></p><p>J.Crew is seeking an Administrative Assistant to help support our Men's Merchandising teams.</p><p><br/></p><p><strong>The Role + Purpose:</strong></p><ul><li>Heavy calendar management</li><li>Supporting SVP and VP leaders</li><li><strong>This role is expected to be onsite 3 days a week</strong></li><li>Answer and direct emails</li><li>Coordinate travel arrangements</li><li>Administer expense reports and process departmental invoices</li><li>Order supplies</li><li>Coordinate internal meetings pertaining to a number of cross functional departments</li><li>Prioritize the day-to-day efficiency of the team and cross functional partners, often working with other assistants and teams across the organization</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>BS/BA degree or equivalent combination of education and experience sufficient to successfully perform essential functions of the job</li><li>2+ years of EA or Administrative Assistance</li><li>Extremely detail oriented and able to multitask</li><li>Has an extreme sense of urgency</li><li>Able to be resilient when dealing with high- pressure situations</li><li>Must be able to maintain the highest level of confidentiality</li><li>Proficient in Microsoft Office suite</li></ul><p><br/></p><p>We welcome you to apply, even if you don't check all the boxes. Our passion is scouting life-long learners who are driven by curiosity, and who feel connected to our brands and share our desire to make an impact. We’re always seeking bright new talent who leverage their unique experiences to discover, grow and evolve with our teams.</p><p><br/></p><p><strong>Benefits + Perks</strong></p><ul><li>Health &amp; Well-being - Eligible associates and family members receive medical, dental, prescription and vision insurance, family planning (fertility, adoption &amp; surrogacy support), fitness discounts, medical travel and more.</li><li>Associate Discount - We love our products just as much as you do! That’s why we offer a great associate discount across all of our brands (J.Crew, J.Crew Factory, and Madewell).</li><li>Flex Fridays - In addition to our hybrid work model, we also close our office at 1:00 PM every Friday year-round.</li><li>Community Impact - We support the communities where we live and work through our philanthropic efforts and the J.Crew Cares Program.</li><li>Winter Break - In addition to our PTO package, J.Crew Group offers a winter break at the end of December to eligible full-time associates at the Home Office to provide time to refresh and recharge.</li></ul><p><br/></p><p>Note: Availability of these benefits and perks may be subject to work location &amp; employment type and may have certain eligibility requirements.</p><p><br/></p><p><br/></p><p>At J.Crew Group (JCG) we aim to pay competitively for our company’s size and industry. The base salary offered will take into account internal equity and may vary depending on the candidate’s geographic region of work premises, job-related knowledge, skills, and experience among other factors. The base salary is just one component of J.Crew Group’s competitive total rewards strategy that also includes the opportunity for bonus, competitive benefits and perks.</p><p>One of our core focuses here at JCG is creating a community and culture that builds belonging. We are deeply committed to our Diversity, Equity and Inclusion efforts, and we warmly welcome job applicants of all backgrounds.</p><p><br/></p><p>JCG is proud to affirmatively provide equal opportunity to all associates and qualified applicants without regard to race, color, religion, national origin or citizenship, age, sex, marital status, ancestry, legally protected physical or mental disability, veteran status, gender identity, sexual orientation or any other basis protected under applicable law.</p><p></p>", "responsibilities": "Heavy calendar management\nSupporting SVP and VP leaders\nThis role is expected to be onsite 3 days a week\nAnswer and direct emails\nCoordinate travel arrangements\nAdminister expense reports and process departmental invoices\nOrder supplies\nCoordinate internal meetings pertaining to a number of cross functional departments\nPrioritize the day-to-day efficiency of the team and cross functional partners, often working with other assistants and teams across the organization", "qualifications": {"required": "BS/BA degree or equivalent combination of education and experience sufficient to successfully perform essential functions of the job\n2+ years of EA or Administrative Assistance\nExtremely detail oriented and able to multitask\nHas an extreme sense of urgency\nAble to be resilient when dealing with high- pressure situations\nMust be able to maintain the highest level of confidentiality\nProficient in Microsoft Office suite", "preferred": ""}, "skills": ["Microsoft Office"], "postedDate": "1 day ago", "benefits": "Health & Well-being - Eligible associates and family members receive medical, dental, prescription and vision insurance, family planning (fertility, adoption & surrogacy support), fitness discounts, medical travel and more.\nAssociate Discount - We love our products just as much as you do! That’s why we offer a great associate discount across all of our brands (J.Crew, J.Crew Factory, and Madewell).\nFlex Fridays - In addition to our hybrid work model, we also close our office at 1:00 PM every Friday year-round.\nCommunity Impact - We support the communities where we live and work through our philanthropic efforts and the J.Crew Cares Program.\nWinter Break - In addition to our PTO package, J.Crew Group offers a winter break at the end of December to eligible full-time associates at the Home Office to provide time to refresh and recharge.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004822326"}