{"jobTitle": "Remote Wedding Coordinator", "company": {"name": "LC EXCLUSIVE", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "We are seeking a passionate and detail-oriented Wedding Coordinator to join our team. As a Wedding Specialist, you will play a vital role in helping couples plan and coordinate their dream weddings. You will work closely with clients to ensure that every aspect of their special day runs smoothly and exceeds their expectations, all while working remotely to accommodate our clients' needs.<br/><br/><strong>Key Responsibilities:<br/><br/></strong><ul><li>Conduct initial consultations with engaged couples to understand their wedding vision, preferences, and requirements</li><li>Collaborate with clients to create customized wedding plans, including selecting venues, vendors, and creating detailed event timelines</li><li>Identify and recommend suitable vendors for services like catering, photography, decor, entertainment, and more. Negotiate contracts and manage vendor relationships</li><li>Assist clients in creating and managing wedding budgets, ensuring financial objectives are met</li><li>Develop and manage wedding day schedules and logistics, ensuring a seamless flow of events from ceremony to reception</li><li>Be prepared to address any issues that may arise before or during the wedding and find effective solutions to ensure and stress-free event</li><li>Be available for remote support on the wedding day to coordinate and troubleshoot any last-minute issues</li><li>Collect feedback from clients and vendors to assess and improve wedding planning services for future events<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Previous experience in wedding planning, event coordination, or a related field is preferred</li><li>Strong organizational and time management skills</li><li>Excellent interpersonal and communication abilities</li><li>Creativity and an eye for design, with the ability to translate a couple's vision into reality</li><li>Proficiency with wedding planning software and tools is a plus</li><li>A passion for making couples' dreams come true<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Flexible schedule</li><li>Agents Discounts</li><li>On-the-job training</li><li>Company Perks</li><li>Work from home opportunity</li><li>Generous commissions and incredible business opportunity!</li><li>If you are a creative and dedicated Wedding Coordinator who is enthusiastic about creating unforgettable wedding experiences, we invite you to apply<br/><br/></li></ul>Powered by JazzHR<br/><br/>7GKtLU6f9j", "responsibilities": "Conduct initial consultations with engaged couples to understand their wedding vision, preferences, and requirementsCollaborate with clients to create customized wedding plans, including selecting venues, vendors, and creating detailed event timelinesIdentify and recommend suitable vendors for services like catering, photography, decor, entertainment, and more. Negotiate contracts and manage vendor relationshipsAssist clients in creating and managing wedding budgets, ensuring financial objectives are metDevelop and manage wedding day schedules and logistics, ensuring a seamless flow of events from ceremony to receptionBe prepared to address any issues that may arise before or during the wedding and find effective solutions to ensure and stress-free eventBe available for remote support on the wedding day to coordinate and troubleshoot any last-minute issuesCollect feedback from clients and vendors to assess and improve wedding planning services for future events", "qualifications": {"preferred": "Previous experience in wedding planning, event coordination, or a related field is preferredStrong organizational and time management skillsExcellent interpersonal and communication abilitiesCreativity and an eye for design, with the ability to translate a couple's vision into realityProficiency with wedding planning software and tools is a plusA passion for making couples' dreams come true", "required": ""}, "skills": [], "postedDate": "1 day ago", "benefits": "Flexible scheduleAgents DiscountsOn-the-job trainingCompany PerksWork from home opportunityGenerous commissions and incredible business opportunity!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4004113762"}