{"jobTitle": "Brand Manager", "company": {"name": "Intellyk Inc.", "location": "New York, United States"}, "location": "New York, United States", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Management", "industry": "Entertainment Providers", "description": "<strong>Role: US - Brand and Creative Specialist II</strong><p><strong>Location: New York (Remote - Some travel may be required)</strong></p><p><strong> </strong></p><p><strong>Description:</strong></p><p>Brand Manager (Contract)</p><p>As a member of the Brand team, you’ll aid in the development and execution of marketing and creative strategies and campaigns that drive the brand forward and shape consumers’ connection with it.</p><p>This position requires experience in identifying interesting and not traditional ways for brand integrations, organizing and leading creative teams to deliver integrated brand stories, and driving execution, production, and delivery of creative assets. This position will manage and guide internal and external project teams, end-to-end campaign development, and delivery of work.</p><p>Candidates should be passionate about people, music, creativity, entertainment, culture, and brands. They should have experience collaborating with cross-functional teams and driving production of creative work, including managing budgets, resources, and timelines.</p><p>Note: this is a contract role that will run through the end of December 2024 with the possibility to extend by a few months depending on projects.</p><p><br/></p><p><strong>What you’ll do</strong></p><ul><li>Directly brief, manage, and lead campaign development for client marketing initiatives</li><li>Partner with Brand Strategy and Creative to distill marketing briefs and translate them into creative briefs, narratives, and campaigns that deliver on business/brand objectives.</li><li>Develop strong relationships with key cross functional partners and stakeholders to develop effective marketing campaigns that meet business objectives.</li><li>Manage production process and trafficking of assets, including budgets and resources.</li><li>Develop tools and guidelines to articulate, guide and enable Brand consistency across all communications and touch-points.</li><li>Understand channel planning across widely used and emerging media to provide insight to working teams.</li><li>Create and deliver presentations to effectively inform and influence teams.</li><li>Leverage human, cultural, and audience insights to develop strategies for the creative team to deliver against.</li><li>Understand category and competitive environments.</li></ul><p><br/></p><p><strong>Who you are</strong></p><ul><li>4+ years’ experience, ideally working at or with a culturally driven brand; direct experience working with creative teams to develop campaigns that drive a brand and business is a must</li><li>Possess a strong brand and creative sensibility and point of view; able to share and sell work.</li><li>Able to build strong, trusting and honest working relationships</li><li>Thrive in a fast-paced, dynamic, environment; able to prioritize to meet deadlines</li><li>Comfortable working with ambiguity and flexible enough to adapt to change</li><li>Highly self-motivated problem solver with a “no job too small” mentality</li><li>Strong communicator, writer, and presenter.</li><li>Passionate about music, podcasts, entertainment, brand building, creativity, and culture</li><li>Knowledgeable of channel planning, marketing strategy, and creative production processes</li><li>Experience bringing digital experiences + working with creators preferred</li></ul><p><br/></p><p>This position reports into a Brand Lead and is remote eligible. Some travel may be required.</p><p>We strongly believe that diversity of experience, perspectives, and background will lead to a better workplace for our employees and a better product for our users and our creators. This is something we value deeply and we encourage everyone to come be a part of changing the way the world listens.</p>", "postedDate": "2 hours ago", "skills": ["Brand Management", "Marketing Strategy", "Creative Direction", "Campaign Development", "Cross-Functional Collaboration", "Budget Management", "Resource Management", "Timeline Management", "Presentation Skills", "Communication Skills", "Writing Skills", "Digital Marketing", "Channel Planning", "Creative Production", "Music Industry", "Entertainment Industry", "Culture", "Brand Building", "Creativity", "Problem Solving", "Team Leadership"], "url": "https://www.linkedin.com/jobs/view/4004467846"}