{"jobTitle": "Senior Data Engineer", "company": {"name": "Lumenalta (formerly Clevertech)", "location": "Valparaiso, FL"}, "location": "Valparaiso, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering, Information Technology, and Consulting", "industry": "IT Services and IT Consulting", "description": "Experience Remote done Right. With over 20 years of remote experience, all 500+ staff are 100% remote, and we still grow vibrant relationships and provide exceptional opportunities for career growth while working with stellar clients on ambitious projects.\n<br/>\nWhat we're working on:\nEnterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve daily are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. To grasp the scale of problems we face, ideally, you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries.\nThis position is 100% remote. Contract hiring is over not C2C - Overlap with EST timezone will be required.\n<br/>\nAll candidates must have legal authorization to work in the US or Canada. (w2/t4)\n<br/>\nRequirements\n7+ years experience in a senior developer role using Python; ideally, you have delivered business-critical software to large enterprises\nYou are comfortable manipulating large data sets and handling raw SQL\nExperience using technologies such as Pyspark/AWS/Databricks\nExperience creating ETL Pipeline from scratch\nE-commerce and Financial Services industry experience preferred\nEnglish fluency, verbal and written\nPersonality traits: Professional, problem solver, proactive, passionate, team player.\n<br/>\nWhy Lumenalta is an amazing place to work at\nAt Lumenalta, you can expect that you will:\nBe 100% dedicated to one project at a time so that you can innovate and grow.\nBe a part of a team of talented and friendly senior-level developers.\nWork on projects that allow you to use leading tech.\n<br/>\nThe result? We produce meaningful outcomes for our clients that break barriers in their industries.\n<br/>\nThe job is 100% Remote; please ensure you have a comfortable office set at your desired work location.\n<br/>\nLumenalta is committed to hiring exceptional talent from a wide variety of diverse backgrounds. If you share our values and enthusiasm for digital transformation, we encourage you to apply", "postedDate": "1 day ago", "skills": ["Python", "SQL", "Pyspark", "AWS", "Databricks", "ETL Pipeline", "E-commerce", "Financial Services", "English"], "url": "https://www.linkedin.com/jobs/view/4004151520"}