{"jobTitle": "Senior Buyer", "company": {"name": "CIRCA", "location": "Dallas-Fort Worth Metroplex"}, "location": "Dallas-Fort Worth Metroplex", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "85,000.00/yr - $105,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Purchasing", "industry": "Retail Luxury Goods and Jewelry", "description": "<strong>Please note, you must have the ability to participate and complete a three-month training period in New York City.</strong><br/><br/><strong>Our business is here to remake the world of pre-owned luxury jewelry. We use our expertise, technology and connections to get jewelry sellers the absolute most for their jewelry. We are passionate about quality, sustainability, and the valuation of finely crafted jewels.</strong><br/><br/><strong>We are a group of people that are not only passionate about our work but about each other and our customers. Our flat hierarchy and organizational structure create an open environment where all feel comfortable to voice ideas, and we love the smart, creative minds of people who take pride in what they do.</strong><br/><br/><strong>What You’ll Do</strong><ul><li>Meet with clients, evaluate jewelry items for purchase both virtually and in-person.</li><li>Manage a schedule of physical and virtual appointments.</li><li>Make offers to clients to purchase their jewelry.</li><li>Take part in ongoing training with the buying team on new and existing trends.</li><li>Follow up with clients to produce results gaining insight into client experience through</li></ul><p> various proprietary software programs.</p><ul><li>Manage inventory entries and shipments for the purchased product.</li><li>Report purchase activity to municipal authorities.</li></ul><br/><br/><strong>Who You Are</strong><ul><li>Strategic thinker, capable of conceptualizing, developing and articulating strategic vision and influencing an organization to move toward that vision</li><li>Proven track record of delivering results in a dynamic, high-growth environment</li><li>Drives toward goals, takes initiative</li><li>A strong, and kind communicator with professional direct verbal &amp; written skills</li><li>Ability to work cross functionally with different teams and company stakeholders</li><li>Highly organized with the ability adapt to changing business needs and ability to manage multiple moving parts</li><li>Self-motivated and results-oriented, strategic thinker with an ability to learn, contribute, and are willing to take full ownership over Seller Support</li></ul><br/><br/><strong>What You Have</strong><ul><li><strong>Ability to participate and complete a three-month training period in New York City.</strong></li><li>Ability to travel 10-15x per year to other office locations.</li><li>Completed coursework from the GIA or other relevant trade associations; GG certification preferred.</li><li>Experience in the luxury goods industry required.</li><li>Excellent interpersonal skills with the ability to cultivate good working relationships both</li></ul><p> internally and externally.</p><ul><li>Strong analytical and organizational skills with knowledge of Microsoft Office and other relevant applications.</li><li>Passionate about social media and marketing, as well as a strong understanding of the</li></ul><p> latest trends and best practices in the industry.</p><br/><br/><strong>What We’ll Give You</strong><ul><li>A supportive, inclusive culture in an organization that values your contributions</li><li>Opportunities for personal and professional growth through work experience and mentorship</li><li>An attractive and equitable compensation package, including salary and stock options</li><li>A generous benefits program featuring generous PTO, comprehensive medical, dental, vision and other health benefits, 401K plan, commuter program, learning &amp; development resources, health &amp; wellness perks (i.e. free therapy sessions, discounted pet insurance) and so much more</li></ul><p></p>", "responsibilities": "What You’ll Do<ul><li>Meet with clients, evaluate jewelry items for purchase both virtually and in-person.</li><li>Manage a schedule of physical and virtual appointments.</li><li>Make offers to clients to purchase their jewelry.</li><li>Take part in ongoing training with the buying team on new and existing trends.</li><li>Follow up with clients to produce results gaining insight into client experience through</li></ul><p> various proprietary software programs.</p><ul><li>Manage inventory entries and shipments for the purchased product.</li><li>Report purchase activity to municipal authorities.</li></ul>", "qualifications": {"required": "Ability to participate and complete a three-month training period in New York City., Ability to travel 10-15x per year to other office locations., Completed coursework from the GIA or other relevant trade associations; GG certification preferred., Experience in the luxury goods industry required., Excellent interpersonal skills with the ability to cultivate good working relationships both internally and externally., Strong analytical and organizational skills with knowledge of Microsoft Office and other relevant applications., Passionate about social media and marketing, as well as a strong understanding of the latest trends and best practices in the industry.", "preferred": "Strategic thinker, capable of conceptualizing, developing and articulating strategic vision and influencing an organization to move toward that vision, Proven track record of delivering results in a dynamic, high-growth environment, Drives toward goals, takes initiative, A strong, and kind communicator with professional direct verbal &amp; written skills, Ability to work cross functionally with different teams and company stakeholders, Highly organized with the ability adapt to changing business needs and ability to manage multiple moving parts, Self-motivated and results-oriented, strategic thinker with an ability to learn, contribute, and are willing to take full ownership over Seller Support"}, "skills": ["GIA", "Luxury Goods", "Microsoft Office", "Social Media", "Marketing"], "postedDate": "1 hour ago", "benefits": "A supportive, inclusive culture in an organization that values your contributions, Opportunities for personal and professional growth through work experience and mentorship, An attractive and equitable compensation package, including salary and stock options, A generous benefits program featuring generous PTO, comprehensive medical, dental, vision and other health benefits, 401K plan, commuter program, learning &amp; development resources, health &amp; wellness perks (i.e. free therapy sessions, discounted pet insurance) and so much more", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004474325"}