{"jobTitle": "Executive Recruiter", "company": {"name": "Tiffany & Co.", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "117,810.00/yr - 166,320.00/yr", "currency": "USD"}, "jobFunction": "General Business, Management, and Human Resources", "industry": "Retail Apparel and Fashion, Retail Luxury Goods and Jewelry, and Retail", "description": "<strong>Job Description<br/><br/></strong>The Executive Recruiter attracts and recruits world-class executive talent to join Tiffany &amp; Co. in its pursuit for luxury excellence. This position will focus on Corporate talent and utilize inclusion, partnership, innovation, strategy as well as a growth mindset to create an elevated candidate and hiring manager experience resulting in placement of the highest caliber talent. The Executive Recruiter will take proactive actions to develop this talent pipeline and Executive Recruitment program. This individual will report to the Director, Corporate Groups Talent Acquisition &amp; Human Resources Business Partner and be based at 200 Fifth Ave., New York, NY.<br/><br/><strong>Executive recruitment process<br/><br/></strong><ul><li>Create and implement executive recruitment process including elevated candidate experience, standards, key milestones, and metrics</li><li>Deliver regular updates on the market, competitor analysis and industry news for Director and specialized talent</li><li>Lead hiring management recruitment search kick-off meetings, progress update meetings, communications and share best practice techniques</li><li>Become an expert and brand ambassador of Tiffany history, employer brand, culture and business goals/priorities</li><li>Learn the business and sector(s) to understand and communicate key business drivers and strategy to internal partners, external partners and executive candidates</li><li>Talent advisor to leaders, leveraging market knowledge and external network to build a pipeline of near-term and long-term talent needs</li><li>Ensure inclusive practices are integrated throughout the recruitment processes<br/><br/><br/></li></ul><strong>Sourcing and strategic candidate generation<br/><br/></strong><ul><li>Conduct research and build talent networks to develop a map of targeted talent, companies and geographies. This includes continuous industry trend research and developing innovative ways to attract executive talent</li><li>Source active and passive candidates through strategic and creative sourcing methods</li><li>Identify meaningful searches and gaps in the talent pipeline at the Director and present solutions to support those recruitment efforts</li><li>Partner with management and cross-functional partners to verify priorities and proactively build candidate networks. This includes internal talent pipeline building for mobility within Tiffany and across the LVMH maisons<br/><br/><br/></li></ul><strong>Candidate Experience And Full-cycle Recruitment<br/><br/></strong><ul><li>Serve as a key recruiter for Director and specialized corporate focused positions, leading the full life-cycle recruitment effort for each role. Positions may include global and regional roles</li><li>Flawlessly execute searches, effectively balancing multiple searches and projects/workstreams simultaneously</li><li>Partner with hiring managers as a talent advisor and deliver insight on market trends</li><li>Communicate with hiring managers regularly and provide feedback on active candidates</li><li>Build influential candidate relationships and ensure a positive candidate experience throughout the recruitment process<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>8+ years work experience as a Recruiter inclusive of 3 years of executive level recruitment (either an in-house or agency executive recruiter)</li><li>Significant successful experience within a leading executive search firm and/or an in-house executive recruitment function</li><li>Extensive experience using diplomatic negotiation skills</li><li>Experience using complex applicant tracking systems, recruitment databases and willingness to maximize systems for sourcing</li><li>Proven ability to attract candidates through various sources and methods</li><li>Commitment to recruiting diverse talent</li><li>Consultative approach and talent advisor mindset with the ability to influence senior executives</li><li>Business acumen and comfort level with ambiguity</li><li>Solid ability to conduct different types of interviews (structured, competency-based, etc.)</li><li>Excellent communication and interpersonal skills</li><li>Strong decision-making skills</li><li>Talent Acquisition experience with global positions and candidates</li><li>Experience at a global organization<br/><br/><br/></li></ul>The hiring range for this position ranges from $117,810 - $166,320. The rate of pay offered will be dependent upon candidates’ relevant skills and experience. Management is also eligible for bonus.", "responsibilities": "The Executive Recruiter attracts and recruits world-class executive talent to join Tiffany &amp; Co. in its pursuit for luxury excellence. This position will focus on Corporate talent and utilize inclusion, partnership, innovation, strategy as well as a growth mindset to create an elevated candidate and hiring manager experience resulting in placement of the highest caliber talent. The Executive Recruiter will take proactive actions to develop this talent pipeline and Executive Recruitment program. This individual will report to the Director, Corporate Groups Talent Acquisition &amp; Human Resources Business Partner and be based at 200 Fifth Ave., New York, NY.", "qualifications": {"required": "8+ years work experience as a Recruiter inclusive of 3 years of executive level recruitment (either an in-house or agency executive recruiter), Significant successful experience within a leading executive search firm and/or an in-house executive recruitment function, Extensive experience using diplomatic negotiation skills, Experience using complex applicant tracking systems, recruitment databases and willingness to maximize systems for sourcing, Proven ability to attract candidates through various sources and methods, Commitment to recruiting diverse talent, Consultative approach and talent advisor mindset with the ability to influence senior executives, Business acumen and comfort level with ambiguity, Solid ability to conduct different types of interviews (structured, competency-based, etc.), Excellent communication and interpersonal skills, Strong decision-making skills, Talent Acquisition experience with global positions and candidates, Experience at a global organization"}, "skills": [], "postedDate": "58 minutes ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4004478101"}