{"jobTitle": "1st and 2nd Shift Assemblers Needed Immediately", "company": {"name": "JobsInLogistics.com", "location": "Greencastle, IN"}, "location": "Greencastle, IN", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "13.50 - 18.75 / hour", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "With Staff Management - SMX, you'll get a weekly paycheck, learn new skills, meet new people, and work with a great management team in a clean and safe environment.<br/><br/>Join Us at Heartland Automotive in Greencastle Indiana, a growing manufacturer of automotive parts. We are currently offering multiple assembly entry level positions with immediate start. These are Temp-To-Hire positions with room for advancement. We Offer: Around The Clock Onsite Service Team, Health Insurance Benefits, Weekly Paychecks -Direct Deposit or Pay Card options, and a Travel Bonus of $0.75 per mile up to 40 hours (per eligibility requirements). A great opportunity!<br/><br/>Perks &amp; Benefits: Casual Dress Code, Other on the spot perks, Paid Training, Weekly paychecks, Direct Deposit or Cash Card pay options, Medical / Dental Insurance.<br/><br/>Shifts: 1st Shift, 2nd Shift.<br/><br/>Employment Types: Full Time, Temp to Hire, Long Term.<br/><br/>Pay Rate: $13.50 - $18.75 / hour<br/><br/><br/><strong>Duties<br/><br/></strong>Automotive Assembly Associates assist in the manufacturing of interior and exterior automotive parts.<br/><br/><ul><li>Will assemble small automotive parts</li><li>Could operate machinery and use small tools</li><li>Must stand for duration of shift.<br/><br/></li></ul>Join our team today!!<br/><br/>Requirements: Background Check, Drug Test, Stand for Shift Duration, Must be at least 18 years old.Able to Lift 20 pounds., required education: No Education Requirement.<br/><br/>Recruiting Center: Staff Management SMX, 1360 Indianapolis Rd, Suite L, Greencastle, IN 46135.<br/><br/>Work Location: Heartland / Greencastle, IN-7604, Heartland AutomotiveWarren Drive , Greencastle, IN 46135.<br/><br/>Job Types: Assembly, General Labor, General Production, Light Industrial, Manufacturing, Material Handler, Production.<br/><br/>Industry: Manufacturing.<br/><br/>The hourly rate for this position is anticipated between $13.50 - $18.75 per hour. This range is a good-faith estimate, based on the shift you work and other considerations permitted by law. An employee''s pay history will not be a contributing factor where prohibited by local law. In addition to monetary compensation, we offer medical, dental, vision, life, and more. More details about benefits can be found at https://flimp.live/trueblueassociates#home.<br/><br/>SMX, LLC is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, sexual orientation, age, gender identification, protected veteran status, or any other characteristic protected by law.<br/><br/>Accommodations are available on request for candidates taking part in the selection process. If you require disability-related accommodation during the recruitment process, please contact your Recruiter or Employee Relations at HR-Advice@trueblue.com or 1-800-610-8920. TrueBlue, Inc. and its brands will consult with all applicants who request disability-related accommodation during the recruitment process to ensure that the accommodation provided takes into account the applicant's individual accessibility needs.", "responsibilities": "Automotive Assembly Associates assist in the manufacturing of interior and exterior automotive parts.<br/><br/><ul><li>Will assemble small automotive parts</li><li>Could operate machinery and use small tools</li><li>Must stand for duration of shift.<br/><br/></li></ul>", "qualifications": {"required": "Background Check, Drug Test, Stand for Shift Duration, Must be at least 18 years old.Able to Lift 20 pounds., required education: No Education Requirement."}, "skills": ["Assembly", "General Labor", "General Production", "Light Industrial", "Manufacturing", "Material Handler", "Production"], "postedDate": "1 hour ago", "benefits": "Around The Clock Onsite Service Team, Health Insurance Benefits, Weekly Paychecks -Direct Deposit or Pay Card options, and a Travel Bonus of $0.75 per mile up to 40 hours (per eligibility requirements). A great opportunity!<br/><br/>Perks &amp; Benefits: Casual Dress Code, Other on the spot perks, Paid Training, Weekly paychecks, Direct Deposit or Cash Card pay options, Medical / Dental Insurance.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4004469020"}