{"jobTitle": "Customer Service Representative", "company": {"name": "MasterBrand, Inc.", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "For nearly 70 years, MasterBrand has been shaping the places where people come together, enriching lives and creating meaningful memories for our customers. That, combined with our stylish products, expansive dealer and retail network, and dedicated associates, has helped make us the number one North American residential cabinet business. Our unique culture of continuous improvement is based on trusting the tools, empowering the team and moving forward, and is kept alive by our more than 14,000 associates across 20 plus manufacturing facility and offices. Visit www.masterbrand.com to learn more and join us in building great experiences together!<br/><br/><strong>Job Description<br/><br/></strong><strong>Organizational Relationship<br/><br/></strong>This position reports directly to the Supervisor Customer Service.<br/><br/><strong>Accountabilities<br/><br/></strong><ul><li>Answers incoming calls emails faxes and other inquiries according to department standards and provides appropriate and timely response</li><li>Processes orders product returns credits and bills for multiple brands with a high level of speed and accuracy</li><li>Effectively communicates with internal and external customers including service agents sales representatives and management</li><li>Serves as key contact to MLLC customers in responding to inquiries including but not limited to order status product information claims/returns order processing account status programs and processes</li><li>Assesses problems or issues to determine and implement appropriate resolutions to both internal and external customers</li><li>Ensures familiarity with the full breadth of products from stock to custom</li><li>Consistently demonstrates the Six for Success: Be Trustworthy Commit to your Team Listen to Understand Serve your Customer Prepare and Plan and Drive Results</li><li>Performs other duties as may be assigned at management’s discretion<br/><br/><br/></li></ul><strong>Characteristics &amp; Attributes<br/><br/></strong><ul><li>Promotes a \"customer first\" mentality</li><li>Possesses a positive upbeat attitude</li><li>Demonstrates strong communications skills - listening verbal and written</li><li>Proficiency in computer skills including Microsoft Word Excel Access Outlook or Lotus Notes as well as working with databases</li><li>Solid organizational skills including multi-tasking and follow-up</li><li>Ability to handle negativity and remain positive</li><li>Strong understanding of basic product knowledge</li><li>Demonstrates abilities in successfully applying continuous improvement principles</li><li>Strong analytical reasoning and problem-solving skills</li><li>Self-motivated</li><li>Team-oriented<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>A high school diploma or equivalent is minimally required</li><li>College experience and/or a 2-year degree is preferred</li><li>Prior customer service experience is required<br/><br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong>Equal Employment Opportunity<br/><br/></strong>MasterBrand Cabinets LLC is an equal opportunity employer. MasterBrand Cabinets LLC’s policy is not to discriminate against any applicant or employee based on race, color, religion, sex, gender identity or expression, national origin, ancestry, age, disability/handicap status, marital status, military status, sexual orientation, genetic history or information, or any other basis protected by federal, state or local laws. MasterBrand Cabinets LLC also prohibits harassment of applicants or employees based on any of these protected categories. It is also MasterBrand Cabinets LLC’s policy to comply with all applicable federal, state and local laws respecting consideration of unemployment status in making hiring decisions.<br/><br/><strong>Reasonable Accommodations<br/><br/></strong>MasterBrand Cabinets LLC is committed to working with and providing reasonable accommodations to individuals with disabilities. If you have a disability and wish to discuss potential accommodations related to applying for employment, please contact us at staffing@masterbrand.com.<br/><br/><ul><li>Actual pay will vary based on qualifications and other factors<br/></li></ul>", "jobFunction": "Other", "industry": "Consumer Goods", "postedDate": "2 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4004486029"}