{"jobTitle": "Talent Partner", "company": {"name": "Lindus Health", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Research Services", "description": "🍊Our mission <br/><br/>All new medicines need to undergo clinical trials to show they’re safe and effective. But <strong>today’s clinical trial infrastructure is stuck in the past</strong>, and the cost of developing new medicines has skyrocketed as a result. Patients have to wait longer and pay more for new treatments.<br/><br/>Our mission is to fix this; <strong>we use software to help innovative companies run faster, more reliable, and patient-friendly clinical trials</strong>. We’re still a young company, but we’ve already had a big impact. Since founding the company in March 2021 we’ve helped run over 80 clinical trials involving tens of thousands of patients, with a customer NPS of 100.<br/><br/>We recently raised a $18m Series A round from some great investors including Creandum, Peter Thiel and Firstminute to power the next stage of our growth.<br/><br/><strong>🍊About The Role<br/><br/></strong>We’re looking for a Talent Partner to increase the velocity at which we hire.<br/><br/>This role is important because building high talent density is the fundamental driving force in realising Lindus Health’s mission. With direct accountability for sourcing exceptional talent, the Talent Partner is a key driver of unlocking our potential as a team.<br/><br/>You’ll work closely with our Talent team, People team and hiring managers across the business.<br/><br/><strong>🍊About You<br/><br/></strong>We’d like to hear from you if…<br/><br/><ul><li>You have high agency and an aptitude for learning quickly. </li><li>You’re a self-starter. </li><li>You demonstrate excellent written and verbal communication. </li><li>You’ve had sourcing experience across a spectrum of seniority levels in Clinical Operations, SaaS or DeepTech roles. </li><li>You are passionate and curious about our mission; changing how the healthcare industry operates and how new treatments are developed </li><li>You want to make a meaningful impact at a high-growth, mission-driven VC funded startup. <br/><br/></li></ul>You belong here! If your experience and interests match with some of the above, we want you to apply.<br/><br/><strong>🍊What You’ll Focus On<br/><br/></strong><ul><li>Sourcing candidates across a spectrum of seniority levels and specialisms. We’re pretty open on where you’d fit in here, but our hiring forecast is heavily weighted towards Clinical Operations and Product, so a focus on one of these areas will be essential. Successfully hiring into these teams means increasing our outbound hiring activity. </li><li>Delivering an exceptional candidate experience. Our hiring activity increased massively in the second half of 2023 and will be moving up a couple of gears again this year. We’d love for someone to help us deliver an exceptional candidate experience and mitigate the risk of increased hiring activity negatively impacting our Candidate NPS. </li><li>Some interesting data points to get you thinking:</li><ul><li>We hired 28 new staff in H2 last year. </li><li>We received 7000 job applications in H2 last year, ranging from 200 to 900 per open role. </li><li>We dialled up weekly interviewing activity from ~10 to ~70 interviews in H2 last year. </li><li>Our offer acceptance rate in 2024 is 92%</li><li>Our interview hours per hire is 20 hours across all teams and seniority levels. <br/></li></ul></ul><strong>🍊What We Offer<br/><br/></strong><ul><li>Make an impact across all areas of our business and fix one of the world’s most broken industries </li><li>Competitive salary, plus meaningful stock options</li><li>Flexible working - You will be based out of our London office and we encourage you to spend at least 60% of your time per month (averaging 3 days a week) in the office and the remaining time at home. </li><li>Unlimited holidays; everyone is encouraged to take off at least 28 days each year</li><li>Health &amp; wellbeing - cashback scheme with Medicash (unlimited virtual GP appointments, medical, dental, optician, physio, mental health + more!)</li><li>Gympass membership; flexible access to gyms, studios, classes and wellness apps</li><li>Enhanced Parental Leave - 12 weeks full pay for primary care giver &amp; 4 weeks full pay for secondary care giver</li><li>Cycle to work scheme</li><li>Regular team events; recently we've been to Legoland, a Bake Off competition, and a Millwall FC home game (decided by popular vote)</li><li>Up to £1,000 per year towards courses, certifications and development<br/><br/></li></ul><strong>🍊Our hiring process <br/><br/></strong><ul><li>Initial conversation with our Talent team (30 minutes)</li><li>Functional interview with Gina (Talent Partner) and George (Director, Talent) (60 minutes) </li><li>Culture and values interview with 2 members of the Founding team (30 minutes). We also use standardised testing as a complement to our final values interviews. <br/><br/></li></ul>We try to arrange for at-least one interview to be in-person so you can see our office and meet more of the team.<br/><br/>", "responsibilities": "This role is important because building high talent density is the fundamental driving force in realising Lindus Health’s mission. With direct accountability for sourcing exceptional talent, the Talent Partner is a key driver of unlocking our potential as a team.<br/><br/>You’ll work closely with our Talent team, People team and hiring managers across the business.", "qualifications": {"required": "You have high agency and an aptitude for learning quickly. You’re a self-starter. You demonstrate excellent written and verbal communication. You’ve had sourcing experience across a spectrum of seniority levels in Clinical Operations, SaaS or DeepTech roles. You are passionate and curious about our mission; changing how the healthcare industry operates and how new treatments are developed You want to make a meaningful impact at a high-growth, mission-driven VC funded startup.", "preferred": null}, "skills": ["Sourcing", "Clinical Operations", "SaaS", "DeepTech", "Talent Acquisition", "Hiring", "Outbound Hiring", "Candidate Experience", "Candidate NPS", "Interviewing", "Data Analysis", "Stock Options", "Flexible Working", "Unlimited Holidays", "Health & Wellbeing", "Gympass", "Parental Leave", "Cycle to Work Scheme", "Team Events", "Development"], "postedDate": "23 hours ago", "applicationDeadline": null, "benefits": "Competitive salary, plus meaningful stock options Flexible working - You will be based out of our London office and we encourage you to spend at least 60% of your time per month (averaging 3 days a week) in the office and the remaining time at home. Unlimited holidays; everyone is encouraged to take off at least 28 days each year Health &amp; wellbeing - cashback scheme with Medicash (unlimited virtual GP appointments, medical, dental, optician, physio, mental health + more!) Gympass membership; flexible access to gyms, studios, classes and wellness apps Enhanced Parental Leave - 12 weeks full pay for primary care giver &amp; 4 weeks full pay for secondary care giver Cycle to work scheme Regular team events; recently we've been to Legoland, a Bake Off competition, and a Millwall FC home game (decided by popular vote) Up to £1,000 per year towards courses, certifications and development", "remoteWork": "Partial Remote", "url": "https://www.linkedin.com/jobs/view/4004855641"}