{"jobTitle": "Manager Employee Culture Oversight", "company": {"name": "Duke Energy Corporation", "location": "Charlotte Metro"}, "location": "Charlotte Metro", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Utilities", "description": "This position is responsible for the comprehensive management and coordination of the Employee Concerns program, ensuring a proactive and responsive approach to employee concerns and regulatory requirements. The ideal candidate will possess exceptional leadership skills, a thorough understanding of regulatory frameworks, and a commitment to fostering a strong nuclear safety culture within the organization. This includes managing the Employee Concerns Consultants and providing oversight of the responses to employee concerns received. In addition, the Manager – Employee Culture Oversight oversees the investigation and response to NRC Requests for Information related to NRC-referred allegations. Additional responsibilities include providing oversight and direction for other investigations conducted by the Employee Culture Oversight (ECO) organization, support for Nuclear Safety Culture assessments across the fleet, and on-going engagement with all levels of the Nuclear organization as part of the continuous safety culture monitoring process. Additionally, the ECO manager is a member of the Enterprise Investigative Team and ensures standardized investigative tools and processes are employed as appropriate.", "responsibilities": "Program Management:\nOversee the Employee Concerns program, ensuring effective handling and resolution of employee concerns. Develop and implement policies and procedures to streamline processes and improve efficiency. Analyze trends and patterns in employee concerns data to identify areas for improvement. Prepare detailed reports and presentations for senior management, highlighting key findings and recommendations. Utilize data to drive decision-making and strategic planning.\n\nTeam Leadership:\nLead and manage a team of Employee Concerns Consultants, providing guidance, support, and professional development opportunities to ensure high-quality responses to employee issues. Foster a collaborative and inclusive team environment. Develop and deliver training programs for employees and managers on topics related to the Employee Concerns program, regulatory requirements, and safety culture. Ensure that all staff are knowledgeable about the processes and maintain awareness of evolving or significant regulatory actions.\n\nRegulatory Engagement:\nServe as the primary point of contact for the Nuclear Regulatory Commission (NRC) regarding Requests for Information related to NRC-referred allegations. Ensure timely, accurate, and transparent communication with the NRC, and maintain comprehensive records of all interactions and responses.\n\nInvestigation Oversight:\nSupervise all investigations conducted by the Employee Culture Oversight (ECO) organization. Ensure that investigations are thorough, unbiased, and conducted in accordance with established protocols. Review and approve investigation reports, and supports identification of corrective actions as needed, including closure quality reviews.\n\nSafety Culture and Performance Trending Support:\nSupport and enhance Nuclear Safety Culture assessments and Performance Trending across the fleet. Collaborate with various departments to develop and implement initiatives that promote a strong safety culture. Monitor the effectiveness of these initiatives and make recommendations for\nimprovement.\n\nLeadership Engagement:\nMaintain continuous engagement with all levels of the Nuclear leadership team to monitor and improve the nuclear safety culture. Provide regular updates on the status of employee concerns and related initiatives. Advise leadership on best practices and emerging trends in employee concerns or culture.", "qualifications": {"required": "Bachelor’s degree and 5 years of work-related experience or High School diploma / GED and 10 years of work-related experience.", "preferred": "Ability to engage with all levels of the leadership team\nEffective communication skills (written and oral)\nInvestigation experience\nRegulatory experience (engagement with the NRC)\nProject management experience\nManaging multiple priorities\nExperience in handling private and confidential material associated with personnel or regulatory investigations.\nPrevious supervisory experience"}, "skills": ["Leadership", "Communication", "Investigation", "Regulatory", "Project Management"], "postedDate": "4 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005853026"}