{"jobTitle": "Regional Sales Manager Western USA", "company": {"name": "Meveca", "industry": "Food and Beverage Services, Furniture and Home Furnishings Manufacturing, and Hospitality", "location": "Las Vegas Metropolitan Area"}, "location": "Las Vegas Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "description": "We create and distribute, sustainable and energy-efficient OS&amp;E for the luxury hospitality industry. In this niche, we are among the leading suppliers across Asia, MENA and the Americas. In 2020 we expanded our business to the USA. We are looking for an experienced Regional Sales Manager Western USA to strengthen our US sales team.\n\nYou are result oriented with a proven sales record in the hospitality industry (hotel, catering or supply)? Do you have a competitive and proactive mindset? Are you well organized (familiar with CRM systems) and hard-working?\n\n**Your tasks**\n<ul><li>Actively promote our front-of-the-house cooking and M&amp;E equipment to kitchen planners, designers, catering companies, hotel chains or owner groups based on your profound knowledge in F&amp;B and M&amp;E</li><li>Review market analyses and develop sales campaigns</li><li>Provide regular sales reports and document sales activities in our CRM</li><li>Represent us at regional shows as well as industry and customer events</li><li>Meet regional sales objectives</li></ul>\n\n**Qualifikation**\nIdeally, you'll have some or all of the following competencies and experience we're looking for:\n\n<ul><li>Education in hotel administration, catering, culinary or F&amp;B</li><li>At least 3 years of sales experiences in the hospitality supply industry</li><li>Profound understanding of the US luxury hospitality and catering market</li><li>Excellent English language skills are a must and German and Spanish a plus</li><li>Team player with excellent communication, interpersonal and presentation skills Passionate sales, hard-working with result-driven and self-motivated mindset</li></ul>\n\n**Benefits**\n<ul><li>We offer you an unlimited working agreement and a long-term career path</li><li>We'll reward all your hard work with competitive salary and a great commission</li><li>Join the team for our annual meetings around the world and frequent team-building activities</li></ul>", "jobFunction": "Sales, Business Development, and Marketing", "industry": "Food and Beverage Services, Furniture and Home Furnishings Manufacturing, and Hospitality", "postedDate": "10 hours ago", "qualifications": {"required": "At least 3 years of sales experiences in the hospitality supply industry, Profound understanding of the US luxury hospitality and catering market, Excellent English language skills are a must and German and Spanish a plus, Team player with excellent communication, interpersonal and presentation skills Passionate sales, hard-working with result-driven and self-motivated mindset", "preferred": "Education in hotel administration, catering, culinary or F&amp;B"}, "skills": [], "benefits": "We offer you an unlimited working agreement and a long-term career path, We'll reward all your hard work with competitive salary and a great commission, Join the team for our annual meetings around the world and frequent team-building activities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005555849"}