{"jobTitle": "Assistant Manager, Visual Merchandising", "company": {"name": "Maison Francis Kurkdjian", "location": "Miami, FL"}, "location": "Miami, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Personal Care Product Manufacturing", "description": "<strong>Job Description<br/><br/></strong>The Assistant Manager, Visual Merchandising will support the creation, planning and implementation of visual merchandising through the US, Canada, and Mexico in adherence to the Maison Francis Kurkdjian visual standards. The Assistant Manager, Visual Merchandising will support the VM production of outposts, campaign or repush creative, and events (VIC, Press, KOL, Friends of the Maison, in-store experience). Ensure the visual standards of Maison Francis Kurkdjian are exemplified through planning and production results, while working closely with Production Vendors, Retailer partners, Sr. Manager Visual Merchandising, and Visual Team at HQ. The Assistant Manager, Visual Merchandising reports directly to the Sr. Manager, Visual Merchandising.<br/><br/><strong>Description &amp; Accountabilities<br/><br/></strong><ul><li>Support the Sr. Manager, Visual Merchandising in the creation of the design layout, formal proposal presentations, and VM production for Events, VIC, KOL, and in-store experiences.</li><li>Support the Sr. Manager, Visual Merchandising on reviewing production material and prototypes with Vendors as needed for campaigns, repushes, pop-ups, outposts, and window production.</li><li>Support and partner with Sales team, Marketing team, Events and Training team on singular and small scaled visual merchandising requests, while working closely with Sr. Manager, Visual Merchandising, HQ, production teams, and retailers.</li><li>Support and partner with Operations Manager, Store Design and Visual Merchandising on POSM forecasting for future campaigns, re-pushes, new store openings.</li><li>Support and partner with production vendors on VM tool forecasting and ordering for future campaigns, re-pushes, new store openings, and semi-customization.</li><li>Ability to create VM distribution lists per campaign or repush for US, Canada, and Mexico.</li><li>Support Sr Manager, Visual Merchandising on design process to make sure the projects deliver on time, on budget and results are qualitatively.</li><li>Ability to create visual presentations recapping projects for HQ, North America team, and retailers.</li><li>Ability to create visual merchandising design proposal presentations for HQ, North America team, and retailers to support Sr, Visual Merchandising Manager.</li><li>Ability to create and adapt visual merchandising schematic designs to the US, Canada, and Mexico market needs, using Adobe Suite software skills.</li><li>Ability to create and layout VM schematics for new store openings and semi-customization locations, using sketchup software skills.</li><li>Partner with Sr. Manager, Visual Merchandising on travel schedule to support production prototypes with vendors, business needs or production installations as needed.</li><li>Self-manage travel expenses and travel budgets.</li><li>Ability to travel domestically and internationally as needed, average of 20% quarterly.</li></ul>", "postedDate": "5 hours ago", "skills": ["Visual Merchandising", "Adobe Suite", "Sketchup", "Production", "Retail", "Sales", "Marketing", "Events", "Training", "Operations", "Store Design", "POSM Forecasting", "VM Tool Forecasting", "Distribution Lists", "Project Management", "Presentation Skills", "Travel"], "url": "https://www.linkedin.com/jobs/view/4005857594"}