{"jobTitle": "Onboarding Engagement Consultant", "company": {"name": "RE/MAX", "location": "Denver, CO"}, "location": "Denver, CO", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "55,000.00 - 67,000.00", "currency": "USD"}, "jobFunction": "Consulting, General Business, and Legal", "industry": "Real Estate and Business Consulting and Services", "description": "https://franchise.remax.com/brokerage-support/<br/>\n<strong><u>Job Summary:</u></strong><br/>\nThis role will be instrumental in providing guidance and support to our network of new brokers/owners during the onboarding stage. The position will focus on ensuring that our brokers are equipped with the necessary skills and knowledge to leverage technology effectively in their business. Additionally, this role will require a strong understanding of real estate processes, excellent communication skills, and the ability to train and guide individuals with varying levels of technological proficiency.<br/>\n<br/>\n<strong><u>Essential Functions:</u></strong><br/>\n• Conducts training sessions and workshops to educate brokers/owners and agents on the effective use of company technology tools and platforms, including but not limited to CRM systems, mobile apps, online marketing platforms, and transaction management software. Offers ongoing support and troubleshooting assistance to resolve any technical issues or challenges agents and brokers face.<br/>\n• Collaborates with internal teams to develop comprehensive onboarding strategies for new tools and platforms. Creates training materials, documentation, and video tutorials to facilitate self-paced learning and ensure a smooth transition for real estate professionals.<br/>\n• Provides one-on-one consulting sessions to address specific technology-related needs, goals, and challenges faced by our broker/owners. Conducts group sessions to address common issues, share best practices, and foster a collaborative learning environment.<br/>\n• Continuously evaluates the effectiveness of technology onboarding and training programs. Collects feedback from agents, brokers, and stakeholders to identify areas for improvement and implement enhancements to streamline the onboarding process.<br/>\n• Tracks and monitors technology adoption rates within the company network. Identify offices that may require additional support or intervention to ensure optimal utilization of available technology tools.<br/>\n• Stays up-to-date with the latest technology trends and innovations within the real estate industry. Conducts research to identify emerging tools and platforms that could enhance the productivity and efficiency of real estate professionals.<br/>\n• Travel required to our broker/owner offices.<br/>\n• Other Duties as assigned.<br/>\n<br/>\n<strong><u>Minimum Qualifications:</u></strong><br/>\nEducation: Bachelor's Degree or Equivalent experience<br/>\nYears of Experience: 2-4 Years<br/>\nYears of Management: No Experience Needed<br/>\n<br/>\n<strong><u>Preferred Licensing, Certifications and Skills:</u></strong><br/>\n• Experience in the real estate industry, preferably in customer success, technology training, or support roles<br/>\n<br/>\n<strong><u>Standard Knowledge, Skills, and Abilities:</u></strong><br/>\n•Technical/Functional Expertise: Has knowledge of the job, function, department, and its impact on customers, continues to learn and grow, stays current on changes in process, policy, and function, and fulfills responsibilities of the job<br/>\n•Customer &amp; Relationship Focus: Anticipates and delivers on customer needs, manages internal/external relationships, respectful of team, resolves problems, responds with tact and diplomacy, shares pride of the brand with customers, preserves the culture<br/>\n•Decision Quality: Makes sound decisions quickly, gathers information, considers long-term repercussions of decisions, is accountable for decisions<br/>\n•Drives for Results and Quality: Takes ownership of job assignments and productivity, takes initiative, focuses on the quality and quantity of results, sets priorities and meets deadlines, and keeps management apprised of progress<br/>\n<br/>\n<strong>Hire Range/Rate:</strong><br/>\n$55,000 - $67,000<br/>\nActual compensation offered to candidate will be finalized at offer and may be above or below the posted range due to skill level, experience, industry specific knowledge, education/certifications, or geographic location. The offer rate represents one component of the RE/MAX Holdings total compensation package. Employees will also receive a number of benefits as listed below. Other compensation for this position may include bonus eligibility.<br/>\n<ul><li>Competitive Medical, Dental, and Vision benefits</li><li>Retirement plans with optimal company match</li><li>Annual bonus/merit opportunity</li><li>Educational Assistance</li><li>Medical Health support program</li><li>M.O.R.E. Events offered in-person and virtually</li><li>Mentorship program</li><li>Employee Resource Groups</li><li>Community Engagement</li><li>Diversity, Equity, and Inclusion</li><li>Parenting</li><li>Remote</li><li>Woman at RE/MAX</li></ul><br/>\n<strong>RE/MAX, LLC./Motto Mortgage</strong><br/>\nNow is your chance to become part of a world-class, industry leading organization. RE/MAX Holdings, Inc. is a business that builds businesses. We provide the tools, training, and tech to our real estate network, which includes RE/MAX and Motto Mortgage franchises, agents, brokers, and consumers. Join us and build a career where your contribution is heard, your innovative ideas are valued, and hard work and collaboration truly makes a difference. Nobody in the world sells more real estate than RE/MAX!*<br/>\n<br/>\nRE/MAX Holdings, Inc. is proudly headquartered in Denver, Colorado. Certain roles may be location specific, however in addition to Colorado, we welcome qualified candidates in the following states: Arkansas, California, Florida, Georgia, Illinois, Massachusetts, Michigan, Ohio, and Texas!<br/>\n<br/>\nRE/MAX Holdings, Inc. is proud to be an equal opportunity employer committed to diversity and inclusion, as well as non-discrimination in employment. All qualified applicants receive consideration without regard to race, color, religion, gender, sexual orientation, national origin, age, veteran status, disability unrelated to performing the essential task of the job or other legally protected categories. All persons shall be afforded equal employment opportunity.<br/>\n*As measured by transactions slides<br/>\n<br/>\nApplication Deadline: September 15, 2024", "responsibilities": "• Conducts training sessions and workshops to educate brokers/owners and agents on the effective use of company technology tools and platforms, including but not limited to CRM systems, mobile apps, online marketing platforms, and transaction management software. Offers ongoing support and troubleshooting assistance to resolve any technical issues or challenges agents and brokers face.\n• Collaborates with internal teams to develop comprehensive onboarding strategies for new tools and platforms. Creates training materials, documentation, and video tutorials to facilitate self-paced learning and ensure a smooth transition for real estate professionals.\n• Provides one-on-one consulting sessions to address specific technology-related needs, goals, and challenges faced by our broker/owners. Conducts group sessions to address common issues, share best practices, and foster a collaborative learning environment.\n• Continuously evaluates the effectiveness of technology onboarding and training programs. Collects feedback from agents, brokers, and stakeholders to identify areas for improvement and implement enhancements to streamline the onboarding process.\n• Tracks and monitors technology adoption rates within the company network. Identify offices that may require additional support or intervention to ensure optimal utilization of available technology tools.\n• Stays up-to-date with the latest technology trends and innovations within the real estate industry. Conducts research to identify emerging tools and platforms that could enhance the productivity and efficiency of real estate professionals.\n• Travel required to our broker/owner offices.\n• Other Duties as assigned.", "qualifications": {"required": "Education: Bachelor's Degree or Equivalent experience\nYears of Experience: 2-4 Years\nYears of Management: No Experience Needed", "preferred": "• Experience in the real estate industry, preferably in customer success, technology training, or support roles"}, "skills": ["CRM", "Technology", "Training", "Real Estate", "Communication", "Customer Success", "Technical Support", "Onboarding", "CRM Systems", "Mobile Apps", "Online Marketing", "Transaction Management Software", "Training Materials", "Video Tutorials", "Consulting", "Problem Solving", "Technology Adoption", "Industry Trends", "Research", "Travel"], "postedDate": "2 hours ago", "applicationDeadline": "September 15, 2024", "benefits": "Competitive Medical, Dental, and Vision benefits\nRetirement plans with optimal company match\nAnnual bonus/merit opportunity\nEducational Assistance\nMedical Health support program\nM.O.R.E. Events offered in-person and virtually\nMentorship program\nEmployee Resource Groups\nCommunity Engagement\nDiversity, Equity, and Inclusion\nParenting\nRemote\nWoman at RE/MAX", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005890964"}