{"jobTitle": "Executive Assistant", "company": {"name": "hims & hers", "location": "Brooklyn, NY"}, "location": "Brooklyn, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$115,000.00 - $140,000.00", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Wellness and Fitness Services", "description": "Hims & Hers Health, Inc. (better known as Hims & Hers) is the leading health and wellness platform, on a mission to help the world feel great through the power of better health. We are revolutionizing telehealth for providers and their patients alike. Making personalized solutions accessible is of paramount importance to Hims & Hers and we are focused on continued innovation in this space. Hims & Hers offers nonprescription products and access to highly personalized prescription solutions for a variety of conditions related to mental health, sexual health, hair care, skincare, heart health, and more.<br/><br/>Hims & Hers is a public company, traded on the NYSE under the ticker symbol “HIMS”. To learn more about the brand and offerings, you can visit hims.com and forhers.com, or visit our investor site. For information on the company’s outstanding benefits, culture, and its talent-first flexible/remote work approach, see below and visit www.hims.com/careers-professionals.<br/><br/><strong>About The Role<br/><br/></strong>We are seeking an adept C-level Executive Assistant to join our dynamic and forward-thinking organization. In this pivotal role, you will collaborate closely with a senior executive and their team, ensuring smooth operations and empowering our leaders to concentrate on strategic priorities. The ideal candidate will excel at problem-solving, and optimizing the executive's schedule for maximum productivity. We seek someone exceptionally organized, professional, resourceful, and adaptable, thriving in a fast-paced setting. This position supports our Chief Design Officer and Chief Medical Officer.<br/><br/><strong>You Will<br/><br/></strong><ul><li>Represents the Executive with poised and highly professional written and verbal communication, both internally and externally. A high level of integrity and discretion is a must.</li><li>Manages and organizes the complex and demanding calendars by actively responding to meeting requests, coordinating with others (or their Executive Assistants) involved in senior-level meetings to achieve alignment of often packed leadership schedules, and promptly engaging directly with the Executive when questions arise that require their input.</li><li>Coordinates logistics for a variety of meetings, including arranging catering, securing conference space, and communicating with attendees. Additionally, partner with our internal events team on larger-scale events. </li><li>Coordinates domestic and international travel to ensure smooth execution of air travel, accommodations, and logistics.</li><li>Process expense reports and review/approve other expense reports with a strong knowledge of travel and expense policies to ensure compliance.</li><li>Assists with the onboarding of new team members by ensuring they are enabled with the required set-up, supplies, and resources.</li><li>You will be a culture carrier and highly instrumental to this organization.</li><li>Partner with other Executive Assistants to provide additional support or backup when needed</li><li>Ability to travel: 15%<br/><br/></li></ul><strong>You Have<br/><br/></strong><ul><li>5+ years of experience as an Executive Assistant</li><li>Experience with Executive-Level calendar management, including working across multiple time zones and domestic and/or international travel coordination</li><li>Proficiency in Microsoft Office and G-suite products</li><li>Impeccable attention to detail, strong organizational and problem-solving skills with a team-oriented philosophy, and the ability to work effectively with minimal supervision</li><li>Ability to prioritize and handle multiple assignments while maintaining a commitment to deadlines</li><li>Be approachable and collaborative with all team members/peers </li><li>Ability to maintain composure and switch tasks efficiently in a rapidly changing environment</li><li>Takes initiative in researching, implementing, and improving systems and processes. </li><li>Ability to quickly learn organizational structure and the objectives of the team</li><li>Ability to build a strong internal network<br/><br/></li></ul><strong>Our Benefits (there are more but here are some highlights):<br/><br/></strong><ul><li>Competitive salary &amp; equity compensation for full-time roles</li><li>Unlimited PTO, company holidays, and quarterly mental health days</li><li>Comprehensive health benefits including medical, dental &amp; vision, and parental leave</li><li>Employee Stock Purchase Program (ESPP)</li><li>Employee discounts on hims &amp; hers &amp; Apostrophe online products</li><li>401k benefits with employer matching contribution</li><li>Offsite team retreats<br/><br/></li></ul>Outlined below is a reasonable estimate of H&amp;H’s compensation range for this role for <strong>US-based candidates</strong>. If you're based outside of the US, your recruiter will be able to provide you with an estimated salary range for your location.<br/><br/>The actual amount will take into account a range of factors that are considered in making compensation decisions including but not limited to skill sets, experience and training, licensure and certifications, and location. H&amp;H also offers a comprehensive Total Rewards package that may include an equity grant.<br/><br/>Consult with your Recruiter during any potential screening to determine a more targeted range based on location and job-related factors.<br/><br/>An estimate of the current salary range for US-based employees is<br/><br/>$115,000—$140,000 USD<br/><br/><em>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.<br/><br/></em><em>Hims is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Hims considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.<br/><br/></em><em>Hims &amp; hers is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at accommodations@forhims.com. Please do not send resumes to this email address.<br/><br/></em><em>For our California-based applicants – Please see our California Employment Candidate Privacy Policy to learn more about how we collect, use, retain, and disclose Personal Information.</em>", "responsibilities": "You Will<br/><br/>\n<ul><li>Represents the Executive with poised and highly professional written and verbal communication, both internally and externally. A high level of integrity and discretion is a must.</li><li>Manages and organizes the complex and demanding calendars by actively responding to meeting requests, coordinating with others (or their Executive Assistants) involved in senior-level meetings to achieve alignment of often packed leadership schedules, and promptly engaging directly with the Executive when questions arise that require their input.</li><li>Coordinates logistics for a variety of meetings, including arranging catering, securing conference space, and communicating with attendees. Additionally, partner with our internal events team on larger-scale events. </li><li>Coordinates domestic and international travel to ensure smooth execution of air travel, accommodations, and logistics.</li><li>Process expense reports and review/approve other expense reports with a strong knowledge of travel and expense policies to ensure compliance.</li><li>Assists with the onboarding of new team members by ensuring they are enabled with the required set-up, supplies, and resources.</li><li>You will be a culture carrier and highly instrumental to this organization.</li><li>Partner with other Executive Assistants to provide additional support or backup when needed</li><li>Ability to travel: 15%<br/><br/></li></ul>", "qualifications": {"required": "5+ years of experience as an Executive Assistant\nExperience with Executive-Level calendar management, including working across multiple time zones and domestic and/or international travel coordination\nProficiency in Microsoft Office and G-suite products\nImpeccable attention to detail, strong organizational and problem-solving skills with a team-oriented philosophy, and the ability to work effectively with minimal supervision\nAbility to prioritize and handle multiple assignments while maintaining a commitment to deadlines\nBe approachable and collaborative with all team members/peers \nAbility to maintain composure and switch tasks efficiently in a rapidly changing environment\nTakes initiative in researching, implementing, and improving systems and processes. \nAbility to quickly learn organizational structure and the objectives of the team\nAbility to build a strong internal network<br/><br/>", "preferred": null}, "skills": ["Microsoft Office", "G-suite", "Calendar Management", "Travel Coordination", "Problem Solving", "Organization", "Communication"], "postedDate": "20 hours ago", "applicationDeadline": null, "benefits": "Competitive salary &amp; equity compensation for full-time roles\nUnlimited PTO, company holidays, and quarterly mental health days\nComprehensive health benefits including medical, dental &amp; vision, and parental leave\nEmployee Stock Purchase Program (ESPP)\nEmployee discounts on hims &amp; hers &amp; Apostrophe online products\n401k benefits with employer matching contribution\nOffsite team retreats<br/><br/>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/4005297614"}