{"jobTitle": "Medical Assistant (Fully Remote)", "company": {"name": "Green Key Resources", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "Length of time:<em> </em><strong><em>90 days</em></strong></p><p>Location or remote:<em> </em><strong><em>Remote</em></strong></p><p>Hours/Days:<em> Monday through Friday - 7am - 8pm EST. 40 hours a week within this timeframe. </em></p><p><br/></p><p>*Need Google Workspace experience*</p><p><br/></p><p>Interview process - Hiring Manager then Panel; language and other potential assessments</p><p>Any must haves on skill set or certifications &amp; licenses: </p><p><br/></p><p><em>*Medical Assistant certification of completion</em></p><p><em>*Excellent time management skills and ability to multitask and prioritize work</em></p><p><em>*Knowledge of medical office management systems and procedures</em></p><p><em>*Excellent written and verbal communication skills</em></p><p><em>*Internet speeds must be above 25 Mbps at home</em></p><p><em>*Must be able to comply with all work from home policies, such as having a quiet, private dedicated workspace.</em></p><p><em>*At least 1 year of experience working as a Medical Assistant in an ambulatory setting</em></p><p><em>*Must be proficient in Google Workspace; experience using Adobe, Slack, Docusign a plus.</em></p><p><em>-Provide live video virtual check in and check out support for patients</em></p><p><em>-Provide live phone and messaging support for patients.</em></p><p><em>-Provide support for your Care Team, including Virtual MDs, Advanced Practitioners and Registered Nurses</em></p><p><em>-Be proactive in planning for each patient's medical needs from initial outreach to solution</em></p><p><em>-Build trust and relationships with patients by setting clear expectations and following up with action</em></p><p>-Assist with the order process, including sending requisition forms, and coordinating referrals</p><p>-Close the loop with providers after referrals are made, including collecting patient notes from providers </p><p>-Schedule appointments with patients for follow up care</p><p><em>-Call providers and facilities to clarify information and help solve complex cases</em></p><p><em>-Coordinate with internal departments to facilitate patient care</em></p><p><em>-Coordinate with external providers and facilities to ensure patient needs are met (Laboratories, Imaging Facilities, Pharmacies, Vendors)</em></p><p><em>-Be an active participant with camera on, during team meetings, huddles and rounds</em></p><p><em>-Empower our patients to be proactive in their own healthcare</em></p><p><em>-Perform all other tasks or additional responsibilities as necessary</em></p><p><br/></p><p>This is a remote role, you are able to work remotely in one of the following states: </p><p>ALABAMA</p><p>ARIZONA</p><p>COLORADO</p><p>CONNECTICUT</p><p>DISTRICT OF COLUMBIA</p><p>FLORIDA</p><p>GEORGIA</p><p>ILLINOIS</p><p>IOWA</p><p>KENTUCKY</p><p>MARYLAND</p><p>MASSACHUSETTS</p><p>MICHIGAN</p><p>NEW HAMPSHIRE</p><p>NEW JERSEY</p><p>NEW MEXICO</p><p>NEW YORK</p><p>NORTH CAROLINA</p><p>OHIO </p><p>OREGON </p><p>PENNSYLVANIA</p><p>RHODE ISLAND</p><p>TENNESSEE</p><p>TEXAS</p><p>UTAH</p><p>VIRGINIA</p><p>WASHINGTON</p>", "postedDate": "5 hours ago", "skills": ["Google Workspace", "Medical Assistant", "Time Management", "Multitasking", "Prioritization", "Medical Office Management Systems", "Communication", "Adobe", "Slack", "Docusign"], "url": "https://www.linkedin.com/jobs/view/4005855057"}