{"jobTitle": "Virtual Event Specialist (Remote)", "company": {"name": "FeyerINC", "location": "Cedar Rapids, IA"}, "location": "Cedar Rapids, IA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "Entry-Level Virtual Event Specialist<br/><br/>**Job Description:**<br/><br/>Are you a dynamic and enthusiastic individual with a passion for planning and executing virtual events? Do you thrive in a remote work environment and have a knack for coordinating with various vendors? If so, we have the perfect opportunity for you!<br/><br/>**Position Overview:**<br/><br/>We are seeking an Entry-Level Virtual Event Specialist to join our growing team. In this role, you will assist in planning, coordinating, and executing virtual events for our diverse client base. This is a remote position, offering you the flexibility to work from the comfort of your home. Additionally, enjoy exciting travel perks and the chance to collaborate with a variety of vendors to create memorable virtual experiences.<br/><br/>**Key Responsibilities:**<br/><br/><ul><li> Assist in the planning and execution of virtual events, including webinars, online conferences, and virtual trade shows</li><li> Coordinate with various vendors such as AV providers, virtual platform providers, and content creators to ensure seamless event delivery</li><li> Manage event logistics, including registration, attendee communication, and technical support</li><li> Support the development of event agendas, schedules, and promotional materials</li><li> Provide on-the-day support to ensure smooth event operation, including troubleshooting technical issues</li><li> Collect and analyze event feedback to contribute to continuous improvement<br/><br/></li></ul>**Qualifications:**<br/><br/><ul><li> Must be at least 18 years old</li><li> Strong internet connection and a reliable Wi-Fi setup</li><li> Excellent communication and organizational skills</li><li> Ability to multitask and manage time effectively</li><li> Tech-savvy with a basic understanding of virtual event platforms and tools</li><li> Enthusiasm for learning and a proactive attitude</li><li> Previous experience in event planning or customer service is a plus but not required<br/><br/></li></ul>**Perks and Benefits:**<br/><br/><ul><li> Work remotely from anywhere with a reliable Wi-Fi connection</li><li> Enjoy travel perks and opportunities to attend in-person events and conferences</li><li> Gain hands-on experience and develop skills in virtual event planning</li><li> Collaborate with a diverse and supportive team</li><li> Access to professional development and training resources</li><li> Competitive entry-level salary and potential for growth within the company<br/><br/></li></ul>**How to Apply:**<br/><br/>If you are excited about the prospect of launching your career in virtual event planning and meet the qualifications listed above, we would love to hear from you!<br/><br/>Powered by JazzHR<br/><br/>DBIaGJs5Xq", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "postedDate": "4 hours ago", "qualifications": {"required": "Must be at least 18 years old, Strong internet connection and a reliable Wi-Fi setup, Excellent communication and organizational skills, Ability to multitask and manage time effectively, Tech-savvy with a basic understanding of virtual event platforms and tools, Enthusiasm for learning and a proactive attitude", "preferred": "Previous experience in event planning or customer service is a plus but not required"}, "skills": [], "benefits": "Work remotely from anywhere with a reliable Wi-Fi connection, Enjoy travel perks and opportunities to attend in-person events and conferences, Gain hands-on experience and develop skills in virtual event planning, Collaborate with a diverse and supportive team, Access to professional development and training resources, Competitive entry-level salary and potential for growth within the company", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005868177"}