{"jobTitle": "Senior Manager Learning and Development", "company": {"name": "J.Crew", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources and Training", "industry": "Retail", "description": "<strong>Our Story</strong><p>We make modern classics with character. We believe in true timelessness, the integrity of well-made clothes, and since our inception, great quality at a great price. That’s in our DNA.</p><p>But, we know it’s not only about the clothes—it’s about the<em> feeling</em>it gives the people who wear them<em>,</em> whether they’re confidently giving a presentation in a well-tailored suit; basking in long salty beach days in vibrant, colorful sun-soaked swimsuits, or joyfully re-discovering their favorite Rollneck sweater in their closet again and again, season after season.</p><p><br/></p><p>And ultimately, it’s about helping our customers be the best, most authentic versions of themselves. And <em>that’s</em> what we’re after, to inspire people’s lives and style.</p><p><br/></p><p>Our dedication to Diversity, Equity, Belonging &amp; Sustainability has been celebrated with industry recognition, reflecting our commitment to fostering an inclusive and sustainable workplace.</p><p><br/></p><p>The Learning &amp; Development Senior Manager will play a critical role in enhancing our organization's Learning &amp; Talent experience by providing subject matter expertise, support and training. The Learning &amp; Talent Administrator is responsible for coordinating and administering learning and development programs within the organization and through the Workday platform. They work closely with various business partners to ensure that training initiatives meet organizational objectives and contribute to associate growth and development.</p><p><br/></p><p><strong>Requirements</strong></p><p>The Learning &amp; Development Senior Manager is responsible for designing, implementing, and overseeing comprehensive training and development programs that enhance employee skills, performance, productivity, and overall engagement. This role involves collaborating with various departments to assess training needs, developing learning initiatives, and evaluating their effectiveness.</p><p><br/></p><p><strong>Training Program Development:</strong></p><ul><li>Design and implement learning journeys, training programs, workshops, and seminars that align with organizational goals and individual development needs.</li><li>Develop curriculum and course materials, ensuring they are engaging, relevant, and up-to-date with industry trends.</li></ul><p><strong>Project Planning and Coordination:</strong></p><ul><li>Develop a comprehensive project plan for the rollout of learning activities, including timelines, resource allocation, and budget management.</li><li>Coordinate with various stakeholders, including department heads, trainers, and external vendors, to ensure smooth execution of learning programs.</li></ul><p><strong>Implementation and Execution:</strong></p><ul><li>Oversee the implementation of training programs, workshops, and other learning initiatives, ensuring they are delivered effectively and meet the organization's standards.</li><li>Manage logistics, including scheduling, venue booking, equipment setup, and communication with participants.</li><li>Facilitate training sessions, both in-person and online, using various instructional techniques such as lectures, group discussions, and hands-on exercises.</li></ul><p><strong>Needs Assessment:</strong></p><ul><li>Conduct training needs assessments through surveys, interviews, and consultation with managers and employees to identify skills gaps and development opportunities.</li><li>Analyze data to determine the most effective training methods and content.</li></ul><p><strong>Program Evaluation:</strong></p><ul><li>Monitor and evaluate the effectiveness of training programs through assessments, surveys, and feedback.</li><li>Implement improvements and updates based on feedback and assessment results.</li></ul><p><strong>Learning Management System (LMS):</strong></p><ul><li>Oversee and maintain the LMS, ensuring all training materials and records are up-to-date and accessible.</li><li>Track and report on training activities, participation, and outcomes.</li><li>Support leadership development initiatives and succession planning efforts.</li></ul><p><strong>Budget Management:</strong></p><ul><li>Prepare and manage the L&amp;D budget, ensuring cost-effective use of resources.</li><li>Monitor expenses related to training programs and materials.</li></ul><p><strong>Compliance and Reporting:</strong></p><ul><li>Ensure training programs comply with regulatory requirements and industry standards.</li><li>Prepare and present reports on training activities, outcomes, and metrics to senior management.</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>A bachelor’s degree– preferred professional certifications is a plus <em>(Certified Professional in Learning and Performance)</em></li><li><strong>East Coast + NYC Applicants Preferred</strong></li><li>6+ years of Training/Learning Management</li><li>Self-motivated individual comfortable speaking with all levels of management</li><li>Interprets data analytics.</li><li>Excellent interpersonal, verbal, and written communication skills</li><li>Intermediate to advanced knowledge of Excel is required, including use of lookups and pivot tables as well as MS office suite.</li><li>Ability to create training materials: eLearning courses, facilitator guides and participant workbooks.</li><li>Desire to thrive in a dynamic and growing environment.</li><li>Adapts well to fast-paced environments with changing circumstances, direction, and strategy.</li><li>Demonstrates ability to operate independently while meeting deadlines with limited supervision.</li></ul><p><br/></p><p>We welcome you to apply, even if you don't check all the boxes. Our passion is scouting life-long learners who are driven by curiosity, and who feel connected to our brands and share our desire to make an impact. We’re always seeking bright new talent who leverage their unique experiences to discover, grow and evolve with our teams.</p><p><br/></p><p><strong>Benefits + Perks</strong></p><ul><li>Health &amp; Well-being - Eligible associates and family members receive medical, dental, prescription and vision insurance, family planning (fertility, adoption &amp; surrogacy support), fitness discounts, medical travel and more.</li><li>Associate Discount - We love our products just as much as you do! That’s why we offer a great associate discount across all of our brands (J.Crew, J.Crew Factory, and Madewell).</li><li>Flex Fridays - In addition to our hybrid work model, we also close our office at 1:00 PM every Friday year-round.</li><li>Community Impact - We support the communities where we live and work through our philanthropic efforts and the J.Crew Cares Program.</li><li>Winter Break - In addition to our PTO package, J.Crew Group offers a winter break at the end of December to eligible full-time associates at the Home Office to provide time to refresh and recharge.</li></ul><p><br/></p><p>Note: Availability of these benefits and perks may be subject to work location &amp; employment type and may have certain eligibility requirements.</p><p><br/></p><p>At J.Crew Group (JCG) we aim to pay competitively for our company’s size and industry. The base salary offered will take into account internal equity and may vary depending on the candidate’s geographic region of work premises, job-related knowledge, skills, and experience among other factors. The base salary is just one component of J.Crew Group’s competitive total rewards strategy that also includes the opportunity for bonus, competitive benefits and perks.</p><p>One of our core focuses here at JCG is creating a community and culture that builds belonging. We are deeply committed to our Diversity, Equity and Inclusion efforts, and we warmly welcome job applicants of all backgrounds.</p><p><br/></p><p>JCG is proud to affirmatively provide equal opportunity to all associates and qualified applicants without regard to race, color, religion, national origin or citizenship, age, sex, marital status, ancestry, legally protected physical or mental disability, veteran status, gender identity, sexual orientation or any other basis protected under applicable law.</p>", "responsibilities": "The Learning &amp; Development Senior Manager is responsible for designing, implementing, and overseeing comprehensive training and development programs that enhance employee skills, performance, productivity, and overall engagement. This role involves collaborating with various departments to assess training needs, developing learning initiatives, and evaluating their effectiveness.", "qualifications": {"required": "A bachelor’s degree– preferred professional certifications is a plus <em>(Certified Professional in Learning and Performance)</em>\n\nEast Coast + NYC Applicants Preferred\n\n6+ years of Training/Learning Management\n\nSelf-motivated individual comfortable speaking with all levels of management\n\nInterprets data analytics.\n\nExcellent interpersonal, verbal, and written communication skills\n\nIntermediate to advanced knowledge of Excel is required, including use of lookups and pivot tables as well as MS office suite.\n\nAbility to create training materials: eLearning courses, facilitator guides and participant workbooks.\n\nDesire to thrive in a dynamic and growing environment.\n\nAdapts well to fast-paced environments with changing circumstances, direction, and strategy.\n\nDemonstrates ability to operate independently while meeting deadlines with limited supervision.", "preferred": null}, "skills": ["Learning Management", "Training", "Data Analytics", "Communication", "Excel", "eLearning", "Curriculum Development", "Project Management", "Needs Assessment", "Program Evaluation", "LMS", "Budget Management", "Compliance", "Reporting", "Leadership Development", "Succession Planning"], "postedDate": "1 hour ago", "benefits": "Health &amp; Well-being - Eligible associates and family members receive medical, dental, prescription and vision insurance, family planning (fertility, adoption &amp; surrogacy support), fitness discounts, medical travel and more.\n\nAssociate Discount - We love our products just as much as you do! That’s why we offer a great associate discount across all of our brands (J.Crew, J.Crew Factory, and Madewell).\n\nFlex Fridays - In addition to our hybrid work model, we also close our office at 1:00 PM every Friday year-round.\n\nCommunity Impact - We support the communities where we live and work through our philanthropic efforts and the J.Crew Cares Program.\n\nWinter Break - In addition to our PTO package, J.Crew Group offers a winter break at the end of December to eligible full-time associates at the Home Office to provide time to refresh and recharge.", "remoteWork": null, "salary": {"amount": "120,000.00/yr - 135,000.00/yr", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/4005889856"}