{"jobTitle": "Operations Integration Manager", "company": {"name": "Wingstop Restaurants Inc.", "location": "Dallas-Fort Worth Metroplex"}, "location": "Dallas-Fort Worth Metroplex", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management", "industry": "Restaurants", "description": "<strong><u>WHO WE ARE</u></strong><p>We’re not in the wing business. We’re in the flavor business. It’s been our mission to Serve the World Flavor since we first opened in 1994, and we’re just getting started. 1997 saw the opening of our first brand partner-operated Wingstop location, and by 2002, we had served the world one billion wings. It’s a flavor that defines us and has made Wingstop one of the fastest-growing brands in the restaurant industry.</p><p>Above all else – our success is largely due to our people and our core values, or what we call The Wingstop Way of being entrepreneurial, service-minded, fun, and authentic. We believe having a strong people foundation centered on these collective values creates a crave-worthy culture and talented team and ensures our brand is poised for accelerated growth. We all win together.</p><p><br/></p><p><strong><u>WHAT WE’LL NEED</u></strong></p><p>The Manager of Operations Integration will provide strategic leadership and direction to various company projects and initiatives. This individual will serve as a project manager to the development and execution of all franchise and field related projects and initiatives. The Manager of Operations Integration will integrate, coordinate and communicate with other departments and multiple third parties to develop solutions to all pre ad post rollout initiatives.</p><p><br/></p><p><strong><u>WHAT YOU’LL DO</u></strong></p><ul><li>Work with cross-functional teams to solve complex problems such as improving operations consistency</li><li>For the first 6-9 months, support the testing, training, implementation, and feedback loop for KDS</li><li>Serve as the voice of operations at the GSC to ensure operations are considered in major projects</li><li>Develop relationships with strategic internal partners and Brand Partners </li><li>Leverage data to identify operations trends to drive improvement in key metrics</li><li>Provide weekly communications to the Field Operations team to ensure consistent communication throughout the organization</li><li>Contribute to the development of new tools, processes and technology which make our teams more efficient and effective</li><li>Assist with monitoring operational performance through dashboards across Cost, Quality and Guest Experience, and surface insights to stay ahead of opportunities</li><li>Help to think through analyses with other team members and serve as a thought leader on projects</li><li>Work on numerous projects simultaneously with the ability to push \"quick wins\" to execution.</li><li>May require in person restaurants visits to evaluate new procedures and or equipment</li><li>Project manage cross-functional initiatives to execution</li></ul><p><br/></p><p><strong><u>WHAT YOU’LL NEED</u></strong></p><ul><li>3 – 5 years of restaurant ops experience</li><li>Proficient in Microsoft Applications (Word, Excel, Outlook, PowerPoint)</li><li>Ability to travel locally to both our test kitchen and corporate restaurants</li><li>Ability to travel 20% - 25%</li><li>Frequent use of mental energy while gathering, documenting, analysing, and communicating information with cross-functional peers, vendors, and Wingstop teams.</li><li>Routine need to shift priorities among simultaneous projects, while uploading quality and sense of urgency.</li></ul><p><br/></p><p><strong><u>WHO YOU ARE </u></strong></p><p><strong>HUMBLE: </strong>Embracing humbleness fosters a collaborative and inclusive environment where individuals prioritize the success of the team over personal recognition, ultimately contributing to a more cohesive and effective workplace.</p><p><strong>HUNGRY: </strong>There’s a fire in you to keep pursuing excellence. You actively seek out challenges, set ambitious goals, and consistently demonstrate a proactive approach to tasks. You have a desire to support Wingstop in our goal to become a Top 10 Global Restaurant Brand.</p><p><strong>SMART: </strong>Not solely based on intellectual prowess, but rather on emotional intelligence and interpersonal skills. A keen understanding of others, communicating effectively and collaborating seamlessly.</p><p><strong>SERVICE-MINDED: </strong>A selfless and dedicated focus on helping others succeed. Consistently prioritizes the needs of colleagues and the organization, willingly offering support and contributing to the overall well-being of the team. </p><p><strong>ENTREPRENEURIAL: </strong>Takes initiative, a willingness to take calculated risks, and constantly searching for opportunities to improve processes or contribute to new ideas.</p><p><br/></p><p><strong><u>BENEFITS</u></strong></p><p><strong>FLAVOR PERKS:</strong></p><ul><li>Unlimited paid time off for exempt employees</li><li>One paid volunteer day of your choice</li><li>Competitive bonus structure for eligible roles</li><li>Team member stock purchase plan</li><li>Health savings or flexible spending account options</li><li>401k – (dollar for dollar on the first 3% and then 50 cents on the dollar for the next 2% for team member contributions up to 5% of eligible compensation)</li><li>Comprehensive medical, dental, and vision benefits</li><li>Basic life and AD&amp;D insurance provided</li><li>Pet insurance</li><li>Education Assistance</li><li>Wellness reimbursement program</li><li>Paid maternity and paternity leave</li></ul><p><strong>FUN IS THE BEST FLAVOR:</strong></p><ul><li>Lunch provided every Tuesday and Thursday in the office</li><li>Work from home Fridays</li><li>Discount on Wingstop gift cards</li><li>Discounted onsite dry cleaning</li><li>Discounted onsite car detailing</li><li>Onsite game room and patio</li></ul><p><br/></p><p><em>Wingstop provides equal opportunities for everyone that works for us and everyone that applies to join our team, without regard to sex or gender, gender identity, gender expression, age, race, religious creed, color, national origin, ancestry, pregnancy, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, any service, past, present, or future, in the uniformed services of the United States (military or veteran status), or any other consideration protected by federal, state, or local law.</em></p>", "responsibilities": "The Manager of Operations Integration will provide strategic leadership and direction to various company projects and initiatives. This individual will serve as a project manager to the development and execution of all franchise and field related projects and initiatives. The Manager of Operations Integration will integrate, coordinate and communicate with other departments and multiple third parties to develop solutions to all pre ad post rollout initiatives.", "qualifications": {"required": "3 – 5 years of restaurant ops experience\nProficient in Microsoft Applications (Word, Excel, Outlook, PowerPoint)\nAbility to travel locally to both our test kitchen and corporate restaurants\nAbility to travel 20% - 25%\nFrequent use of mental energy while gathering, documenting, analysing, and communicating information with cross-functional peers, vendors, and Wingstop teams.\nRoutine need to shift priorities among simultaneous projects, while uploading quality and sense of urgency."}, "skills": ["Microsoft Applications", "Project Management", "Communication", "Data Analysis", "Restaurant Operations"], "postedDate": "2 hours ago", "benefits": "Unlimited paid time off for exempt employees\nOne paid volunteer day of your choice\nCompetitive bonus structure for eligible roles\nTeam member stock purchase plan\nHealth savings or flexible spending account options\n401k – (dollar for dollar on the first 3% and then 50 cents on the dollar for the next 2% for team member contributions up to 5% of eligible compensation)\nComprehensive medical, dental, and vision benefits\nBasic life and AD&amp;D insurance provided\nPet insurance\nEducation Assistance\nWellness reimbursement program\nPaid maternity and paternity leave\nLunch provided every Tuesday and Thursday in the office\nWork from home Fridays\nDiscount on Wingstop gift cards\nDiscounted onsite dry cleaning\nDiscounted onsite car detailing\nOnsite game room and patio", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005888763"}