{"jobTitle": "Senior Director/VP Sales Operations", "company": {"name": "The Mullings Group", "location": "Miami-Fort Lauderdale Area"}, "location": "Miami-Fort Lauderdale Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Sales", "industry": "Medical Equipment Manufacturing", "description": "About:\n\nWe are seeking a skilled Senior Director/VP of Sales Operations, responsible for architecting and leading our client's sales operations and commercial analytics. Priorities include the definition, strategic oversight and implementation of all commercial-touching systems- CRM, ERP integration, territory planning, sales quotas, forecasting and compensation. \n\nReporting the the CCO, the Director of Sales Operations sits on the Commercial Leadership Team (CLT) along with sales, marketing and training/commercial development leadership to support the overall success of our client's commercial efforts.\n\nResponsibilities:\n\n* Manage the sales operations function and team, including sales planning, forecasting, budgeting, quota allocation and achievement, and compensation planning and achievement.\n* In collaboration with the CLT and select other functions (finance, IT, operations), architect and establish systems (CRM, ERP, sales reporting, etc.) for US commercialization; manage ongoing OUS sales operations.\n* Collaborate with the CLT, Finance and other functions to support sales initiatives.\n* Analyze sales data to provide actionable insights and recommendations to the CLT.\n* Along with the CLT, develop and implement sales strategies that align with the company’s objectives.\n* Manage sales reporting and metrics to track performance against targets.\n* Drive continuous improvement in sales processes and methodologies.\n\nQualifications:\n\n* Minimum of ten (10) years’ experience in sales operations or a related field with at least five (5) years in a leadership role; medical device experience strongly preferred.\n* Startup or new division experience building systems necessary for comprehensive sales operations; ability to thrive in fast-paced, dynamic environment and manage multiple priorities.\n* Strong analytical skills with the ability to interpret complex data and make data-driven decisions, while also balancing the science with the art of sales operations.\n* Educational degree (BS) in a business or STEM discipline; MBA preferred.\n* Excellent teamwork and people skills.\n* Excellent listening, verbal and written communication skills.\n\nFor more information, visit: https://briefs.mullingsgroup.com/position/inspiremd-senior-director-of-sales-operations/", "postedDate": "2 hours ago", "skills": ["Sales Operations", "CRM", "ERP", "Sales Forecasting", "Sales Planning", "Sales Strategy", "Data Analysis", "Sales Management", "Team Leadership", "Medical Device", "Startup Experience", "Commercialization", "Budgeting", "Quota Allocation", "Compensation Planning", "Sales Reporting", "Process Improvement", "Teamwork", "Communication"], "url": "https://www.linkedin.com/jobs/view/4005881477"}