{"jobTitle": "Supply Chain Analyst", "company": {"name": "HairClub", "location": "Boca Raton, FL"}, "location": "Boca Raton, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Product Management", "industry": "Retail", "description": "HairClub seeks to be the trusted leader in total hair solutions for all, helping people discover their true confidence and achieve their goals. The Supply Chain Analyst primary organizing and monitoring supply and demand of inventories. Provides analysis and manages the entire inventories and order cycles to enhance business development and ensure sustainability and stake holder satisfaction, both internally and externally.", "responsibilities": "Ensure reliable, accurate and accessible product stock keeping unit (“SKU”) data that drive corporate-wide processes\nDevelop and maintain reports including but not limited to out of stock, inventory aging, forecast accuracy, days on hand and inventory turn\nUtilize data mining discovery techniques and search for insights to uncover key business drivers\nResearch and troubleshoot problems and questions related to deployed analytic solutions\nPerform all required analytics pertaining to inventory supply and demand; oversee procurement including but not limited to consumption levels and product life cycle. Develop and report key performance indicators (“KPI’s”) related to Inventory Levels, Values, COG’s for quarterly review.\nAnalyzes and forecasts inventory levels for purchasing needs \nPerform other related duties as assigned\nWork with Operations, Product Development, Procurement, Distribution Center and Finance to identify areas of opportunity\nSupports Center audits by maintaining and updating processes, reports, findings, documentation, and ensure proper data entry as well as working on individual center audits to look for growth opportunities\nSupports the Corporate Operations Department in various projects including but not limited to one time or recurring analytical information and findings/proposals.", "qualifications": {"required": "4-6 years relevant experience\nDegree in Operations and/in Supply Chain Management and Analytics\nExcellent Microsoft Office Suite skills, especially Word and Excel\nExperience with Operations, Procurement, Compliance and/or project management preferred\nStrong analytical skills and use a fact-based/data driven approach to drive continuous improvement\nSolid understanding of data quality issues and provide recommendations for ensuring/validating data quality\nUnderstands data modeling and data management\nAbility to work under pressure and handle multiple priorities\nAttention to detail"}, "skills": ["Supply Chain", "Inventory Management", "Data Analysis", "Microsoft Excel", "Microsoft Word", "Operations", "Procurement", "Compliance", "Project Management"], "postedDate": "3 hours ago", "benefits": "Paid paternity leave, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Medical insurance, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005877071"}