{"jobTitle": "Executive Administrative Assistant", "company": {"name": "Compunnel Inc.", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Administrative", "industry": "Office Administration", "description": "<strong>Executive Administrative Assistant</strong><br/><strong>Description:</strong><ul><li>Calendaring or Assisting with creating meetings, moving meetings, sending invites for events, and other adjustments in schedule</li><li>Working with other assistants to find times that work for all higher level leaders o Managing conflicts that may arise on the calendar</li><li>Event/Meeting Planning</li><li>Assist with planning events, group meetings, offsites, etc.</li><li>Working with senior leadership to plan details of meetings and outings including all travel arrangements, transportation options, food plans, presentation ideas, timeline/schedule, etc.</li><li>Creating calendar invites, managing attendance for the events, organizing catering orders, setting up the conference rooms with audio, catering, and visual as needed</li><li>Arranging welcome lunches, welcome breakfasts, and other lunch or breakfast meetings</li><li>Expenses : Track and manage all expenses from the corporate credit card o Create expense reports, managing receipts from leadership travel, submitting reports weekly/monthly (as needed) for non-corporate card charges</li><li>Keep track of all fees related to corporate card</li><li>Special projects include assisting with document review and edits, applying signatures to documents other teams provide, power point editing and formatting, etc.</li><li>Assist when possible during urgent technical issues that may arise, including issues with calendars, or accessing applications. This includes also getting in touch with IT –</li><li>Expenses via OKTA /Concur</li></ul>", "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "responsibilities": "Calendaring or Assisting with creating meetings, moving meetings, sending invites for events, and other adjustments in scheduleWorking with other assistants to find times that work for all higher level leaders o Managing conflicts that may arise on the calendarEvent/Meeting PlanningAssist with planning events, group meetings, offsites, etc.Working with senior leadership to plan details of meetings and outings including all travel arrangements, transportation options, food plans, presentation ideas, timeline/schedule, etc.Creating calendar invites, managing attendance for the events, organizing catering orders, setting up the conference rooms with audio, catering, and visual as neededArranging welcome lunches, welcome breakfasts, and other lunch or breakfast meetingsExpenses : Track and manage all expenses from the corporate credit card o Create expense reports, managing receipts from leadership travel, submitting reports weekly/monthly (as needed) for non-corporate card chargesKeep track of all fees related to corporate cardSpecial projects include assisting with document review and edits, applying signatures to documents other teams provide, power point editing and formatting, etc.Assist when possible during urgent technical issues that may arise, including issues with calendars, or accessing applications. This includes also getting in touch with IT –Expenses via OKTA /Concur", "qualifications": {"required": "", "preferred": ""}, "skills": [], "url": "https://www.linkedin.com/jobs/view/4005873771"}