{"jobTitle": "Event Manager", "company": {"name": "Dexian", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60.00/hr - $67.56/hr", "currency": "USD"}, "jobFunction": "Other and Business Development", "industry": "IT Services and IT Consulting and Technology, Information and Media", "description": "<em>The Events Manager will be a crucial member of the for Education team, focusing on end to end logistics execution and project management of events (student and teacher events, finlit workshops, NIL workshops, Hour of Finance, Food Truck) and projects aimed at enhancing financial literacy among students and educators in middle school, high school and higher education. This role will prepare and deliver concise event briefs summarizing key information, insights, and recommendations; Track and report on success metrics. The role is cross-functional and involves close collaboration with multiple teams and external vendors to ensure seamless event and program management and execution. Domestic travel is expected as a part of fulfilling role responsibilities.</em><ul><li>Experience in event coordination and project management. </li><li>Experience working in a corporate work environment is preferred but not required. </li><li>Experience working with a fast-paced, cross-functional team environment.</li><li>Strong project management, organizational skills and attention to detail. </li><li>Excellent written and verbal communication skills. </li><li>Proven experience in event planning, logistics coordination and execution and managing multiple events at the same time. </li><li>Strong negotiation skills </li><li>Passion for financial literacy and education is a plus.</li></ul><p><br/></p><p><br/></p><p><br/></p><p><strong><em>Dexian is a leading provider of staffing, IT, and workforce solutions with over 12,000 employees and 70 locations worldwide. As one of the largest IT staffing companies and the 2nd largest minority-owned staffing company in the U.S., Dexian was formed in 2023 through the merger of DISYS and Signature Consultants. Combining the best elements of its core companies, Dexian's platform connects talent, technology, and organizations to produce game-changing results that help everyone achieve their ambitions and goals.</em></strong></p><p><strong><em>Dexian's brands include Dexian DISYS, Dexian Signature Consultants, Dexian Government Solutions, Dexian Talent Development and Dexian IT Solutions. Visit https://dexian.com/ to learn more.</em></strong></p><p><strong><em>Dexian is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status.</em></strong></p><p></p>", "responsibilities": "The Events Manager will be a crucial member of the for Education team, focusing on end to end logistics execution and project management of events (student and teacher events, finlit workshops, NIL workshops, Hour of Finance, Food Truck) and projects aimed at enhancing financial literacy among students and educators in middle school, high school and higher education. This role will prepare and deliver concise event briefs summarizing key information, insights, and recommendations; Track and report on success metrics. The role is cross-functional and involves close collaboration with multiple teams and external vendors to ensure seamless event and program management and execution. Domestic travel is expected as a part of fulfilling role responsibilities.", "qualifications": {"required": "Experience in event coordination and project management. Experience working in a corporate work environment is preferred but not required. Experience working with a fast-paced, cross-functional team environment. Strong project management, organizational skills and attention to detail. Excellent written and verbal communication skills. Proven experience in event planning, logistics coordination and execution and managing multiple events at the same time. Strong negotiation skills Passion for financial literacy and education is a plus."}, "skills": ["Project Management", "Event Management", "Communication", "Negotiation"], "postedDate": "2 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005892247"}