{"jobTitle": "Enterprise Account Executive, LinkedIn Marketing Solutions", "company": {"name": "LinkedIn", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "162,000.00/yr - 246,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "Company Description<br/><br/>LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.<br/><br/>Join us to transform the way the world works.<br/><br/>Job Description<br/><br/>This role will be based in New York City or Chicago.<br/><br/>At LinkedIn, we trust each other to do our best work where it works best for us and our teams. This role offers a hybrid work option, meaning you can both work from home and commute to a LinkedIn office, depending on what’s best for you and when it is important for your team to be together.<br/><br/>We are looking for an Enterprise Account Executive to join our Marketing Solutions team in showcasing LinkedIn as the premier place for brands to market to the world’s professionals. As an Enterprise Account Executive, you will take a collaborative approach to developing and delivering a sales marketing strategy to our clients across the enterprise technology sector. You will be leading a pod where you focus on prospecting into new buying groups, building relationships with both new and existing buyers, and developing future pipeline while the CSM focuses on growing and expanding existing buying groups and executing on campaign strategy and optimization. The impact of the combined efforts and strength in collaboration will result in hitting growth targets and delivering customer value.<br/><br/>Responsibilities :<br/><br/><ul><li>Identify, engage and strategize with senior-level executives at client companies or agencies to deeply understand their business and marketing objectives and demonstrate how LinkedIn can drive results in support of those objectives </li><li>Develop and cultivate deep and trusted relationships with senior executive clients at Director, VP and CMO levels </li><li>Plan and prioritize book of business to identify net new buying groups and budget holders and grow pipeline to deepen and expand client investment </li><li>Fully embrace and foster a culture of diversity, inclusion and belonging and collaborate across our global footprint of offices </li><li>Partner with cross-functional teams across the business</li><li>Develop joint business plans, business cases, investment recommendations and commercial agreements in collaboration with revenue and cross-functional teams to deepen successful client partnerships </li><li>Proactively leverage research, industry trends, and insights to identify important customer-centric signals, provide value, and broker strategic dialogue with clients </li><li>Conceive and pitch creative and solution-oriented marketing solutions across LMS products and services to advertising agencies and direct clients </li><li>Command, report and forecast sales and pipeline development activity—from prospecting target accounts and contacts to closing deals and renewals—and closely monitor KPIs to adjust pursuit plans dynamically </li><li>Generate revenue and hit target quota <br/><br/><br/></li></ul>Qualifications<br/><br/>Basic Qualifications :<br/><br/><ul><li>5+ years of experience in sales, business development, and/or marketing. <br/><br/><br/></li></ul>Preferred Qualifications :<br/><br/><ul><li>Experience working with Consulting clients </li><li>Experience in media/advertising sales </li><li>Ability to develop authentic relationships, remove pressure for key decision makers, and outline strategic recommendations for national Fortune 1000 companies and top agencies. </li><li>Experience preparing sales proposals, forecasts, joint business plans and account plans </li><li>Demonstrates understanding of internet advertising technology and marketing automation. </li><li>Knowledge and understanding of marketing buyers and marketing jobs to be done </li><li>Ability to achieve results by understanding the needs of the customer and connecting a customer’s pressures with business and product solutions. </li><li>Experience working with senior marketing leaders in technology companies <br/><br/><br/></li></ul>Suggested Skills:<br/><br/><ul><li>Paid Media </li><li>Performance Marketing </li><li>Driving Revenue </li><li>Selling <br/><br/><br/></li></ul>LinkedIn is committed to fair and equitable compensation practices.<br/><br/>The pay range for this role is $162,000 to $246,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor.<br/><br/>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.<br/><br/>Additional Information<br/><br/>Equal Opportunity Statement<br/><br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: EEO Statement_2020 - Signed.pdf.<br/><br/>Please reference the following information for more information: https://legal.linkedin.com/content/dam/legal/LinkedIn_EEO_Statement_2020.pdf.<br/><br/>Please reference the following information for more information: https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf and<br/><br/>https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/><br/>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.<br/><br/>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.<br/><br/>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:<br/><br/><ul><li>Documents in alternate formats or read aloud to you</li><li>Having interviews in an accessible location</li><li>Being accompanied by a service dog</li><li>Having a sign language interpreter present for the interview<br/><br/><br/></li></ul>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br/><br/>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>San Francisco Fair Chance Ordinance <br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pay Transparency Policy Statement <br/><br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates <br/><br/>Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.<br/><br/><br/>Equal Opportunity Statement<br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/> <br/>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response.<br/> <br/>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days.<br/> <br/> LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>Pay Transparency Policy Statement<br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates<br/>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice<br/>", "responsibilities": "Identify, engage and strategize with senior-level executives at client companies or agencies to deeply understand their business and marketing objectives and demonstrate how LinkedIn can drive results in support of those objectives \nDevelop and cultivate deep and trusted relationships with senior executive clients at Director, VP and CMO levels \nPlan and prioritize book of business to identify net new buying groups and budget holders and grow pipeline to deepen and expand client investment \nFully embrace and foster a culture of diversity, inclusion and belonging and collaborate across our global footprint of offices \nPartner with cross-functional teams across the business\nDevelop joint business plans, business cases, investment recommendations and commercial agreements in collaboration with revenue and cross-functional teams to deepen successful client partnerships \nProactively leverage research, industry trends, and insights to identify important customer-centric signals, provide value, and broker strategic dialogue with clients \nConceive and pitch creative and solution-oriented marketing solutions across LMS products and services to advertising agencies and direct clients \nCommand, report and forecast sales and pipeline development activity—from prospecting target accounts and contacts to closing deals and renewals—and closely monitor KPIs to adjust pursuit plans dynamically \nGenerate revenue and hit target quota", "qualifications": {"required": "5+ years of experience in sales, business development, and/or marketing.", "preferred": "Experience working with Consulting clients \nExperience in media/advertising sales \nAbility to develop authentic relationships, remove pressure for key decision makers, and outline strategic recommendations for national Fortune 1000 companies and top agencies. \nExperience preparing sales proposals, forecasts, joint business plans and account plans \nDemonstrates understanding of internet advertising technology and marketing automation. \nKnowledge and understanding of marketing buyers and marketing jobs to be done \nAbility to achieve results by understanding the needs of the customer and connecting a customer’s pressures with business and product solutions. \nExperience working with senior marketing leaders in technology companies"}, "skills": ["Paid Media", "Performance Marketing", "Driving Revenue", "Selling"], "postedDate": "2 hours ago", "applicationDeadline": "", "benefits": "LinkedIn is committed to fair and equitable compensation practices.<br/><br/>The pay range for this role is $162,000 to $246,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor.<br/><br/>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005874852"}