{"jobTitle": "VP of HR", "company": {"name": "Augment Jobs", "location": "Atlanta, GA"}, "location": "Atlanta, GA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$80,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Financial Services and IT Services and IT Consulting", "description": "<strong>Job Title: VP of HR<br/><br/></strong><strong>Company: Augmentjobs<br/><br/>Salary Range: $80,000 - $120,000<br/><br/>Experience Level: 2 - 5 years<br/><br/></strong><strong>Job Description<br/><br/></strong><strong>As the Vice President of Human Resources (VP of HR) at Augmentjobs, you will play a crucial role in shaping and executing our HR strategy. You will lead the HR team and work closely with senior management to drive organizational growth and ensure a positive work environment. Your responsibilities will include overseeing HR functions, developing policies, and managing employee relations.<br/><br/></strong><strong>Key Responsibilities<br/><br/></strong><ul><li>Strategic HR Leadership: Develop and implement HR strategies aligned with the company’s goals. Partner with senior leaders to drive organizational change and enhance performance. </li><li>Talent Acquisition: Oversee recruitment strategies and processes to attract top talent. Ensure that hiring practices align with company culture and goals. </li><li>Employee Relations: Manage employee relations, addressing concerns and resolving conflicts. Foster a positive workplace culture and maintain employee engagement. </li><li>Compensation and Benefits: Design and implement competitive compensation and benefits programs. Ensure compliance with legal requirements and industry standards. </li><li>Performance Management: Develop and execute performance management processes. Provide guidance on performance appraisals and career development. </li><li>Training and Development: Identify training needs and oversee the creation of development programs. Promote continuous learning and professional growth. </li><li>HR Policies and Compliance: Develop and enforce HR policies and procedures. Ensure compliance with labor laws and regulations. </li><li>HR Metrics and Reporting: Monitor HR metrics and prepare reports for senior management. Use data to drive decision-making and improve HR practices. </li><li>Organizational Development: Lead initiatives to improve organizational structure and processes. Support change management efforts to enhance organizational effectiveness. <br/><br/></li></ul><strong>Skills And Qualifications<br/><br/></strong><ul><li>Education: Bachelor’s degree in Human Resources, Business Administration, or a related field. A Master’s degree or HR certification (e.g., SHRM-SCP, SPHR) is preferred. </li><li>Experience: 2 - 5 years of experience in senior HR roles, with a proven track record of managing HR functions and leading a team. </li><li>Leadership: Strong leadership and management skills. Ability to inspire and motivate the HR team and influence senior leaders. </li><li>Strategic Thinking: Ability to develop and execute HR strategies that align with business objectives. Proficiency in strategic planning and execution. </li><li>Communication: Excellent verbal and written communication skills. Ability to effectively interact with employees at all levels of the organization. </li><li>Problem-Solving: Strong problem-solving and conflict resolution skills. Ability to handle sensitive and complex issues with discretion. </li><li>Technical Skills: Proficiency in HR software and systems. Experience with HR analytics and reporting tools. </li><li>Knowledge: In-depth understanding of HR laws, regulations, and best practices. Knowledge of compensation and benefits, performance management, and employee relations. <br/><br/></li></ul><strong>Additional Requirements<br/><br/></strong><ul><li>Ability to work in a fast-paced environment and manage multiple priorities. </li><li>Strong interpersonal skills and a collaborative approach to leadership. </li><li>Commitment to fostering a diverse and inclusive workplace. <br/><br/></li></ul><strong>About Augmentjobs<br/><br/></strong><strong>Augmentjobs is a leading company dedicated to providing innovative HR solutions and talent management services. We are committed to creating a positive and dynamic work environment where our employees can thrive.</strong>", "responsibilities": "As the Vice President of Human Resources (VP of HR) at Augmentjobs, you will play a crucial role in shaping and executing our HR strategy. You will lead the HR team and work closely with senior management to drive organizational growth and ensure a positive work environment. Your responsibilities will include overseeing HR functions, developing policies, and managing employee relations.", "qualifications": {"required": "Bachelor’s degree in Human Resources, Business Administration, or a related field. A Master’s degree or HR certification (e.g., SHRM-SCP, SPHR) is preferred. 2 - 5 years of experience in senior HR roles, with a proven track record of managing HR functions and leading a team. Strong leadership and management skills. Ability to inspire and motivate the HR team and influence senior leaders. Ability to develop and execute HR strategies that align with business objectives. Proficiency in strategic planning and execution. Excellent verbal and written communication skills. Ability to effectively interact with employees at all levels of the organization. Strong problem-solving and conflict resolution skills. Ability to handle sensitive and complex issues with discretion. Proficiency in HR software and systems. Experience with HR analytics and reporting tools. In-depth understanding of HR laws, regulations, and best practices. Knowledge of compensation and benefits, performance management, and employee relations. Ability to work in a fast-paced environment and manage multiple priorities. Strong interpersonal skills and a collaborative approach to leadership. Commitment to fostering a diverse and inclusive workplace.", "preferred": "A Master’s degree or HR certification (e.g., SHRM-SCP, SPHR) is preferred."}, "skills": [], "postedDate": "4 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005868968"}