{"jobTitle": "Product Manager", "company": {"name": "Adecco", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$60.00/hr - $65.00/hr", "currency": "USD"}, "jobFunction": "Information Technology and Design", "industry": "Banking and Financial Services", "description": "Adecco Creative & Marketing specializes in connecting talented professionals with leading companies across various industries. We are currently recruiting for a Digital Product Manager who will play a pivotal role in shaping the digital experience for small business customers.\n\nAbout the Role:\nAs a Digital Product Manager, you will be responsible for overseeing and enhancing the digital experience for small business customers. You will work closely with cross-functional teams, including design, research, and architecture partners, to develop and refine business dashboards and other digital products currently in the discovery and design phases. Your role will require a blend of strategic thinking, hands-on collaboration, and effective communication to ensure that products meet the needs of our customers and align with business objectives.\n\nKey Responsibilities:\n* Small Business Focus: Drive the development of customer-facing digital products tailored to the needs of small businesses.\n* Communication: Create and deliver presentations, data analyses, and project updates to peers and stakeholders using tools like Google Slides and Sheets.\n* Team Collaboration: Engage with partner teams in a collaborative, team-oriented manner using platforms such as Slack, Lucid, and during meetings.\n* Problem Solving: Address challenges and roadblocks related to digital product development, ensuring a seamless customer experience.\n* Business Dashboard Development: Lead the discovery and design process for business dashboards, working closely with design and research teams to create intuitive and effective digital solutions.\n* Hands-on Involvement: Actively participate in design and research efforts, coordinating with architecture partners to ensure alignment with product goals.\n* Project Management: Utilize tools like Confluence and Jira to manage project documentation, track progress, and facilitate communication across teams.\n\nQualifications:\n* Proven experience as a Digital Product Manager or similar role, with a focus on customer-facing digital products.\n* Strong communication skills, with the ability to effectively present data and insights to various stakeholders.\n* Experience working with cross-functional teams in a collaborative environment.\n* Proficiency in tools such as Google Slides, Sheets, Slack, Lucid, Confluence, and Jira.\n* Familiarity with the design and research process, particularly in the context of digital product development.\n* Problem-solving skills with a customer-centric approach to product management.\n* Experience working on business dashboards or similar digital experiences is a plus.\n\nPreferred Qualifications:\n* Experience in the small business sector or a related industry.\n* Background in digital product development with a focus on user experience and customer satisfaction.", "responsibilities": "As a Digital Product Manager, you will be responsible for overseeing and enhancing the digital experience for small business customers. You will work closely with cross-functional teams, including design, research, and architecture partners, to develop and refine business dashboards and other digital products currently in the discovery and design phases. Your role will require a blend of strategic thinking, hands-on collaboration, and effective communication to ensure that products meet the needs of our customers and align with business objectives.", "qualifications": {"required": "Proven experience as a Digital Product Manager or similar role, with a focus on customer-facing digital products.\nStrong communication skills, with the ability to effectively present data and insights to various stakeholders.\nExperience working with cross-functional teams in a collaborative environment.\nProficiency in tools such as Google Slides, Sheets, Slack, Lucid, Confluence, and Jira.\nFamiliarity with the design and research process, particularly in the context of digital product development.\nProblem-solving skills with a customer-centric approach to product management.\nExperience working on business dashboards or similar digital experiences is a plus.", "preferred": "Experience in the small business sector or a related industry.\nBackground in digital product development with a focus on user experience and customer satisfaction."}, "skills": ["Google Slides", "Google Sheets", "Slack", "Lucid", "Confluence", "Jira", "Digital Product Management", "Customer-facing Digital Products", "Cross-functional Team Collaboration", "Communication", "Problem Solving", "Business Dashboard Development", "Design and Research", "Project Management", "Small Business", "User Experience", "Customer Satisfaction"], "postedDate": "2 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005894359"}