{"jobTitle": "Influencer Marketing Manager", "company": {"name": "Yellowbird®", "location": "Austin, TX"}, "location": "Austin, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing", "industry": "Food Manufacturing", "description": "Are you obsessed with social media influencers and creators, brand collaborations, and creating buzz-worthy partnerships? Do you have a passion for building authentic relationships and strategically leveraging influencers to drive brand awareness and engagement? If so, we want to talk to you!<br/><br/>Yellowbird® is on the lookout for an Influencer Marketing Manager to join our team and take our influencer marketing efforts to new heights. As an integral member of our marketing department, you will play a pivotal role in creating and implementing influencer campaigns that align with our brand values and objectives, while contributing to the growth and success of our beloved Yellowbird brand.<br/><br/>You will be responsible for identifying, engaging, and nurturing relationships with influencers across various social media platforms, negotiating unique partnerships, and tracking the success of each campaign. Your creative flair, strong communication skills, and innate ability to spot influential voices in the digital landscape will be key to amplifying the Yellowbird brand and enhancing our presence within the market.<br/><br/><strong>What you'll be doing:<br/><br/></strong><ul><li>Developing influencer marketing strategies and campaigns that align with Yellowbird's brand voice and objectives, from concept to execution. </li><li>Researching and identifying relevant influencers within the food, health and wellness, and creative entertainment space</li><li>Initiating, fostering, and managing influencer relationships, including day-to-day communication and negotiation of short-term and long-term partnerships</li><li>Managing and developing Product Seeding Program as a tool to drive awareness, foster relationships, and test potential for influencer partnerships</li><li>Collaborating with internal teams to ensure seamless integration of influencer marketing with other marketing activities</li><li>Analyzing and reporting on campaign success, utilizing data-driven insights to inform and refine future influencer marketing strategies</li><li>Monitoring industry trends, competitive landscape, and best practices to stay ahead of the curve in influencer marketing<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Here are the skills you'll need:<br/><br/></strong><ul><li>Proven experience working directly with a range of influential creators, from micro to macro</li><li>Experience with influencer marketing tools and platforms</li><li>Proven experience with day-to-day management of influencer budgets, content, and tracking ROI</li><li>Experience with day-to-day management of influencer relationships. </li><li>A deep understanding of social media platforms, influencers and creators, and digital marketing trends</li><li>Proven track record of successfully executing influencer marketing campaigns from start to finish</li><li>Strong negotiation and communication skills, with the ability to build and maintain relationships with influencers</li><li>An eye for spotting relevant and impactful influencer creators within the food, health and wellness, and entertainment space</li><li>Highly creative with a keen eye for identifying engaging and authentic content</li><li>Analytical mindset, capable of analyzing content data and deriving actionable insights</li><li>Ability to work collaboratively and cross-functionally with various teams</li><li>Proven experience with content creation and design software (e.g. Adobe Creative Suite) is a plus!</li><li>Ability to flex and pivot when it comes to influencer strategy<br/><br/></li></ul><strong>Here are the qualifications you'll need:<br/><br/></strong><ul><li>Bachelor's degree in Journalism, Filmmaking, Marketing, Communications, or related field</li><li>3+ years of experience in influencer marketing or related roles.Self-motivated with excellent time management and organizational skills</li><li>Experience in the packaged food industry is a plus</li><li>Passion for the Yellowbird brand and the plant-based, real food revolution<br/><br/></li></ul>If you are ready to make an impact in the world of influencer marketing and join a passionate team that is changing the hot sauce game, bring the heat and apply now.<br/><br/><strong>Benefits<br/><br/></strong>Yellowbird is proud to be an Equal Opportunity Employer.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>Competitive Compensation (commensurate with experience)</li><li>Health Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>Flexible PTO (flexible means you can take PTO for any reason—mental health, vacation time, sick day, anything goes ;)</li><li>Paid parental leave<br/><br/></li></ul><strong>Industry<br/><br/></strong><ul><li>Food Manufacturing</li><li>Retail/CPG</li><li>Brand Advertising<br/><br/></li></ul><strong>Location &amp; Travel<br/><br/></strong><ul><li>4 days/week in-office &amp; 1 day/week work from home</li><li>Travel up to 20% for brand/industry events and marketing initiatives</li></ul>", "responsibilities": "Developing influencer marketing strategies and campaigns that align with Yellowbird's brand voice and objectives, from concept to execution. Researching and identifying relevant influencers within the food, health and wellness, and creative entertainment space Initiating, fostering, and managing influencer relationships, including day-to-day communication and negotiation of short-term and long-term partnerships Managing and developing Product Seeding Program as a tool to drive awareness, foster relationships, and test potential for influencer partnerships Collaborating with internal teams to ensure seamless integration of influencer marketing with other marketing activities Analyzing and reporting on campaign success, utilizing data-driven insights to inform and refine future influencer marketing strategies Monitoring industry trends, competitive landscape, and best practices to stay ahead of the curve in influencer marketing", "qualifications": {"required": "Proven experience working directly with a range of influential creators, from micro to macro Experience with influencer marketing tools and platforms Proven experience with day-to-day management of influencer budgets, content, and tracking ROI Experience with day-to-day management of influencer relationships. A deep understanding of social media platforms, influencers and creators, and digital marketing trends Proven track record of successfully executing influencer marketing campaigns from start to finish Strong negotiation and communication skills, with the ability to build and maintain relationships with influencers An eye for spotting relevant and impactful influencer creators within the food, health and wellness, and entertainment space Highly creative with a keen eye for identifying engaging and authentic content Analytical mindset, capable of analyzing content data and deriving actionable insights Ability to work collaboratively and cross-functionally with various teams Proven experience with content creation and design software (e.g. Adobe Creative Suite) is a plus! Ability to flex and pivot when it comes to influencer strategy", "preferred": "Bachelor's degree in Journalism, Filmmaking, Marketing, Communications, or related field 3+ years of experience in influencer marketing or related roles.Self-motivated with excellent time management and organizational skills Experience in the packaged food industry is a plus Passion for the Yellowbird brand and the plant-based, real food revolution"}, "skills": ["social media", "influencer marketing", "brand partnerships", "digital marketing", "content creation", "relationship management", "negotiation", "communication", "data analysis", "adobe creative suite"], "postedDate": "3 weeks ago", "benefits": "Competitive Compensation (commensurate with experience) Health Insurance Dental Insurance Vision Insurance Flexible PTO (flexible means you can take PTO for any reason—mental health, vacation time, sick day, anything goes ;) Paid parental leave", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005859349"}