{"jobTitle": "Customer Engagement Specialist", "company": {"name": "Hearth", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "description": "<strong>About Hearth</strong><p><br/></p><p>Hearth exists because 50-80% of small businesses in the trades (Roofers, Plumbers, etc.) fail within their first five years. Our mission is to change that forever, and empower small business contractors to build and grow successful companies.</p><p><br/></p><p>In the last few years, we’ve built an all-in-one platform that helps SMBs grow sales, protect profits, and save time. With over 10,000 customers, Hearth is a vertical SaaS platform powered by a financial services layer that is currently powering billions in home improvement projects. We are growing, profitable in our base case, and are working to disrupt a fragmented, underserved, $600B market. </p><p><br/></p><p>Backed by the same investors as SpaceX, Stripe, Palantir, Airbnb, Rippling, Affirm, Brex, and OpenAI (Founders Fund, 8VC, Human Capital), we aim to protect small business entrepreneurship in America, redefine what is possible in running a trades business in today’s rapidly changing world, and bring forth a future where every small business owner in the trades can succeed, despite not having a fancy pedigree, special connections, or access to deep pockets.</p><p><br/></p><p><strong>The Opportunity</strong></p><p>We’ve learned that our technology helps contractors grow faster, but when paired with strategic guidance, contractors win even bigger. Your role will be to partner with small business owners and guide them with an obsessive focus on results.</p><p>Home improvement contractors are often taken advantage of by marketers and big banks, and while excellent craftspeople, often welcome help with business operations, strategy, and accountability.</p><p>As such, your focus will be to identify opportunities and help implement Hearth’s software within customers' operations, which includes training, accountability, and problem-solving, while serving as a trusted advisor.</p><p>You will join a team of high-performing, data-driven Customer Engagement Specialists who are creative, driven, and highly collaborative. As we are a young startup, you will be expected to drive the development and improvement of our team.</p><p><br/></p><p><strong>What you'll do:</strong></p><ul><li>Monitor support channels and quickly respond to inbound customer requests via phone, text and email.</li><li>Implement Hearth’s platform and product solutions into the business operations of our customers</li><li>Drive engagement, activity, and accountability through meaningful outreach including phone, text, and email</li><li>Share valuable customer feedback and ideas with internal product and engineering teams to make our product everything our customers need and more.</li><li>Resolve customer issues, questions, or concerns quickly and with empathy.</li><li>Identify, troubleshoot and escalate issues pertaining to customer education and product functionality.</li><li>Compose thoughtful and accurate messages to customers and create prepared responses to customer emails and texts.</li><li>Manage and control numerous concurrent tasks in tandem.</li></ul><p><br/></p><p><strong>What we're looking for:</strong></p><ul><li>Customer-obsessed with a track record of going above and beyond for the customer</li><li>Impeccable attention to detail</li><li>Desire to help our customers and be their advocate</li><li>Ability to customize the support experience to the needs of individual customers</li><li><strong>You are highly results oriented.</strong> You focus on outcomes and do whatever’s needed to get there.</li><li><strong>You are a skilled problem solver</strong>.</li><li>You have <strong>impeccable written and verbal communication skills. </strong></li><li>You have are <strong>reliable</strong> and have <strong>excellent time-management </strong></li><li>You are a <strong>strong team player</strong> and <strong>self-starter</strong>. This is a<strong> hybrid/remote role</strong>; we are looking for folks who do not need to be babysat.</li><li>You have <strong>strong multi-tasking skills</strong></li><li>You are highly <strong>coachable</strong></li><li>Ability to thrive in a fast-paced environment</li><li><strong>Ideal: past experience with Salesforce.com </strong></li><li><strong>Ideal</strong>: <strong>past experience in home improvement</strong></li><li><strong>Ideal: past experience with lending/credit</strong></li><li><strong>Ideal: past startup experience</strong> - you thrive in a fast-paced environment with frequent change</li><li><strong>Ideal</strong>: <strong>experience in SaaS customer service or sales </strong></li></ul><p><br/></p><p><strong>Benefits</strong></p><ul><li>Mission-driven, values-based culture.</li><li>Competitive pay.</li><li>Unmatched opportunities to learn and develop; front-row seat at a fast-growing tech startup</li><li>Unlimited PTO, plus paid company holidays.</li><li>Meaningful equity</li><li>Medical, dental, and vision options.</li><li>401(k)</li><li>Free Employee Assistance Program</li><li>Parental Leave Program</li><li>Pet Insurance</li></ul><p><br/></p><p><strong>Our Core Values</strong></p><ul><li><strong>Truth. </strong>We value honesty and data. We seek to understand what is reality, so we can effectively respond to it.</li><li><strong>Slope.</strong> Rate of change over time. We hire and reward based on a team member’s potential, capacity, and growth-mindset, rather than a fancy resume. </li><li><strong>Mutual Benefit. </strong>The best outcomes happen when everyone wins - customers, team members, and the company. We seek to understand each other’s aspirations and create alignment to get there. </li><li><strong>Competitive Greatness. </strong>We desire an opportunity and environment from which to pull the greatest versions of ourselves out into the world, rather than just a “job”. </li></ul><p><br/></p><p><strong>Compensation</strong></p><p>Our total annual compensation structure includes a base and OTE/commission structure. The base for this role is $40,000 with a $10,000 OTE.</p><p><br/></p><p>The expected compensation range for this position is displayed in compliance with all local/state regulations. The expected compensation range for this position is based on a number of factors, including but not limited to: individual education, qualifications, and prior work experience. The total annual compensation package will consist of a base salary and eligibility to participate in our sales commission structure.</p><p><br/></p><p><strong>Location</strong></p><p>Remote</p><p><br/></p><p><strong>More About Us</strong></p><p>Hearth embraces diversity. We are proud to be an equal opportunity workplace and do not discriminate on the basis of sex, race, color, age, sexual orientation, gender identity, religion, national origin, citizenship, marital status, veteran status, or disability status. We consider for employment qualified applicants with arrest and conviction records.</p>", "jobFunction": "Customer Service", "industry": "Software Development", "benefits": "Mission-driven, values-based culture.\nCompetitive pay.\nUnmatched opportunities to learn and develop; front-row seat at a fast-growing tech startup\nUnlimited PTO, plus paid company holidays.\nMeaningful equity\nMedical, dental, and vision options.\n401(k)\nFree Employee Assistance Program\nParental Leave Program\nPet Insurance", "responsibilities": "Monitor support channels and quickly respond to inbound customer requests via phone, text and email.\nImplement Hearth’s platform and product solutions into the business operations of our customers\nDrive engagement, activity, and accountability through meaningful outreach including phone, text, and email\nShare valuable customer feedback and ideas with internal product and engineering teams to make our product everything our customers need and more.\nResolve customer issues, questions, or concerns quickly and with empathy.\nIdentify, troubleshoot and escalate issues pertaining to customer education and product functionality.\nCompose thoughtful and accurate messages to customers and create prepared responses to customer emails and texts.\nManage and control numerous concurrent tasks in tandem.", "qualifications": {"required": "Customer-obsessed with a track record of going above and beyond for the customer\nImpeccable attention to detail\nDesire to help our customers and be their advocate\nAbility to customize the support experience to the needs of individual customers\nYou are highly results oriented.\nYou are a skilled problem solver.\nYou have impeccable written and verbal communication skills. \nYou have are reliable and have excellent time-management \nYou are a strong team player and self-starter. This is a hybrid/remote role; we are looking for folks who do not need to be babysat.\nYou have strong multi-tasking skills\nYou are highly coachable\nAbility to thrive in a fast-paced environment", "preferred": "past experience with Salesforce.com \npast experience in home improvement\npast experience with lending/credit\npast startup experience - you thrive in a fast-paced environment with frequent change\nexperience in SaaS customer service or sales "}, "skills": ["Salesforce", "Customer Service", "Communication", "Problem Solving", "Time Management", "Teamwork", "Multitasking", "Coaching"], "postedDate": "2 hours ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005925234"}