{"jobTitle": "Cyber Security Analyst - Remote", "company": {"name": "Campus4Tech", "location": "Malvern, PA"}, "location": "Malvern, PA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Associate", "jobFunction": "Information Technology", "industry": "Professional Training and Coaching", "description": "Remote position- preferable in PA area but not required. This role will be 30 hours a week, some weeks might require 40 hours.<br/><br/>Soft Skills:  Understands cyber security, attention detail.<br/><br/>Education: BA in cyber security or in process of getting it.<br/><br/>Years of experience: 0-2 years<br/><br/>Responsibilities<br/><br/>This is a role well suited to an ambitious professional, looking for the next step in their career. As a Cybersecurity Analyst, you will be responsible for:<br/><br/><ul><li> Analyze our products’ cybersecurity features</li><li> Discuss and answer questions about cybersecurity with our customers</li><li> Coordinate with experts on answering customer cybersecurity questions</li><li> Produce customer asset analyses for use in asset planning sessions<br/><br/></li></ul>This position may suit you best if you are familiar with what is below, and would like to develop your career<br/><br/><ul><li> You have a strong interesting in starting your career in cybersecurity.</li><li> You have a good understanding of networking and cybersecurity concepts, such as VPNs, vlans, AD/LDAP, firewalls, encryption, whitelisting.</li><li> You will be working with a broad range of technology and therefore you are willing to learn about new software and hardware solutions</li><li> Since you are interacting with customers, excellent English skills (ideally as native language, spoken and written) are necessary</li><li> Ability to work well in a team, strong communication skills and customer orientation<br/><br/></li></ul>Required skills to have for the success of this role<br/><br/><ul><li> Personal or professional experience with networking and/or Windows system administration</li><li> Must feel comfortable working in a fully virtual environment</li><li> Must have permanent work authorization</li></ul>", "postedDate": "4 hours ago", "skills": ["Cybersecurity", "Networking", "Windows System Administration", "VPN", "VLAN", "AD/LDAP", "Firewalls", "Encryption", "Whitelisting", "English", "Communication", "Customer Orientation"], "url": "https://www.linkedin.com/jobs/view/4005852675"}