{"jobTitle": "business systems analyst, Shared Services Business Systems (Remote)", "company": {"name": "Starbucks", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$108,000.00/yr - $169,000.00/yr", "currency": "USD"}, "jobFunction": "Analyst", "industry": "Retail", "description": "<strong>Now Brewing – business systems analyst! #tobeapartner</strong><br/><br/>From the beginning, Starbucks set out to be a different kind of company. One that not only celebrated coffee and the rich tradition, but that also brought a feeling of connection. We are known for developing extraordinary leaders who share this passion and are guided by their service to others.<br/><br/>The business systems analyst will assist the business and technology teams to understand the data in our HIRS. They will identify patterns and trends to develop technical solutions to improve our systems and operations procedures.<br/><br/><strong>As a business systems analyst, you will…</strong><br/><br/>* Collaborate with business and technology teams to gather requirements, build, test and establish processes to maintain data in our HRIS.<br/>* Collect and analyze data to inform users and project members about the data to make recommendations to improve system design and business procedures.<br/>* Document and communicate to business partners about system enhancements and process changes.<br/>* Acts as contact for all users on system issues or problems. Troubleshoots, identifies and tracks software and hardware issues to ensure resolution and keep systems operational.<br/>* Develops recommendations and coordinates issue resolution with Information Technology (IT) and outside service providers based on business unit priorities.<br/>* Documents and communicates problem resolution.<br/>* Analyzes current processes, tools, system or database and makes recommendations for development, improvement or simplification.<br/>* Acts as a subject matter expert in cross-functional teams to provide recommendations on new initiatives or projects.<br/>* Assesses benefits to be derived from systems improvements and quantifies impact to business unit.<br/>* Collaborates with business group management to develop appropriate training materials to support the needs of the functional area. Provides on-going end-user systems training to ensure continued and correct use of application and to roll out new tools and procedures.<br/>* Gathers and documents business requirements. Helps design and develop new and improved processes, tools and system enhancements to support business unit requirements.<br/>* Participates with IT developers in testing for system fixes, new releases and enhancements, changes and implementations, in order to ensure functionality and user acceptance.<br/>* Maintains the integrity and the functionality of business unit systems by performing system and database maintenance. Monitors system performance; analyzes problems and recommends solutions. Monitors usage, practices, trends to identify potential problems. Maintains systems configurations, documentation and procedures, such as user setups and interface administration for departmental computing or non-enterprise systems.<br/>* Research, design and schedules standardized reports or create adhoc reports or data queries to support the business unit.<br/>* Maintains standardized reports currently in production. Maintains a log of completed and ongoing system changes.<br/>* Works with IT partners, functional analysts and vendors on medium projects to coordinate system enhancements.<br/>* Tracks project progress and provides updates to impacted parties. Communicates new system functionality to department and assists users in understanding implications<br/><br/><strong>We’d Love To Hear From People With</strong><br/><br/>* End-user support and training 3 years<br/>* Functional experience in relevant area 3 years<br/>* Systems design, testing and implementation 3 years<br/>* Project management 2 years<br/>* Script development and application testing 2 years<br/><br/>As a Starbucks partner, you (and your family) will have access to medical, dental, vision, basic and supplemental life insurance, and other voluntary insurance benefits. Partners have access to short-term and long-term disability, paid parental leave, family expansion reimbursement, paid vacation from date of hire*, sick time (accrued at 1 hour for every 25 hours worked), eight paid holidays, and two personal days per year. Starbucks also offers eligible partners participation in a 401(k) retirement plan with employer match, a discounted company stock program (S.I.P.), Starbucks equity program (Bean Stock), incentivized emergency savings, and financial well-being tools. Additionally, Starbucks offers 100% upfront tuition coverage for a first-time bachelor’s degree through Arizona State University’s online program via the Starbucks College Achievement Plan, student loan management resources, and access to other educational opportunities. You will also have access to backup care and DACA reimbursement. Starbucks will comply with any applicable state and local laws regarding employee leave benefits, including, but not limited to providing time off pursuant to the Colorado Healthy Families and Workplaces Act, and in accordance with its plans and policies. This list is subject to change depending on collective bargaining in locations where partners have a certified bargaining representative. For additional information regarding partner perks and more detailed information about benefits, go to starbucksbenefits.com.<br/><br/>* If you are working in CA, CO, IL, LA, ME, MA, NE, ND or RI, you will accrue vacation up to a maximum of 120 hours (190 in CA) for roles below director and 200 hours (316 in CA) for roles at director or above. For roles in other states, you will be granted vacation time starting at 120 hours annually for roles below director and 200 hours annually for roles director and above.<br/><br/><em>The actual base pay offered to the successful candidate will be based on multiple factors, including but not limited to job-related knowledge/skills, experience, geographical location, and internal equity. At Starbucks, it is not typical for an individual to be hired at the high end of the range for their role, and compensation decisions are dependent upon the facts and circumstances of each position and candidate.</em><br/><br/>If you live in the greater Seattle area, we offer a flexible workplace that allows for hybrid work. Partners can work remotely up to two days per week<br/><br/><strong>Join us and inspire with every cup. Apply today!</strong><br/><br/><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, physical or mental disability, sexual orientation, marital status, military or veteran status, gender identity and expression, genetic information, or any other factor protected by law.</em><br/><br/><em>We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.</em><br/><br/><em>Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at applicantaccommodation.</em>", "responsibilities": "The business systems analyst will assist the business and technology teams to understand the data in our HIRS. They will identify patterns and trends to develop technical solutions to improve our systems and operations procedures.", "qualifications": {"required": "End-user support and training 3 years, Functional experience in relevant area 3 years, Systems design, testing and implementation 3 years, Project management 2 years, Script development and application testing 2 years"}, "skills": [], "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "As a Starbucks partner, you (and your family) will have access to medical, dental, vision, basic and supplemental life insurance, and other voluntary insurance benefits. Partners have access to short-term and long-term disability, paid parental leave, family expansion reimbursement, paid vacation from date of hire*, sick time (accrued at 1 hour for every 25 hours worked), eight paid holidays, and two personal days per year. Starbucks also offers eligible partners participation in a 401(k) retirement plan with employer match, a discounted company stock program (S.I.P.), Starbucks equity program (Bean Stock), incentivized emergency savings, and financial well-being tools. Additionally, Starbucks offers 100% upfront tuition coverage for a first-time bachelor’s degree through Arizona State University’s online program via the Starbucks College Achievement Plan, student loan management resources, and access to other educational opportunities. You will also have access to backup care and DACA reimbursement. Starbucks will comply with any applicable state and local laws regarding employee leave benefits, including, but not limited to providing time off pursuant to the Colorado Healthy Families and Workplaces Act, and in accordance with its plans and policies. This list is subject to change depending on collective bargaining in locations where partners have a certified bargaining representative. For additional information regarding partner perks and more detailed information about benefits, go to starbucksbenefits.com.<br/><br/>* If you are working in CA, CO, IL, LA, ME, MA, NE, ND or RI, you will accrue vacation up to a maximum of 120 hours (190 in CA) for roles below director and 200 hours (316 in CA) for roles at director or above. For roles in other states, you will be granted vacation time starting at 120 hours annually for roles below director and 200 hours annually for roles director and above.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005865920"}