{"jobTitle": "IT Specialist (SYSADMIN)", "company": {"name": "US Environmental Protection Agency (EPA)", "location": "San Francisco, CA"}, "location": "San Francisco, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Government Administration", "description": "Help Help<br/><br/><strong>Requirements<br/><br/></strong>Conditions of Employment<br/><br/><ul><li>You must be a U.S. citizen.</li><li>You must submit a resume and required documents--see How to Apply section.<br/><br/></li></ul>This position is designated as High Risk and requires a background investigation. Unless an appropriate background investigation is already on record with the Office of Personnel Management, you must undergo a background investigation. All conditions of the pre-employment security process must be met before an official letter of employment can be issued with a report for duty date.<br/><br/>If you are selected, you may be required to complete a one-year probationary period.<br/><br/><strong>Qualifications<br/><br/></strong>NOTE: You must meet qualification requirements, including any requirements described in the Education section, by the closing date of this announcement.<br/><br/>In addition to the basic education requirements, you must have specialized experience and/or directly related education as described below:<br/><br/>To qualify for the GS-11 level, you need to have at least one year of full-time experience equivalent to the GS-09 level defined as installing and maintaining hardware and/or software; diagnosing failed systems and proposing solutions; assisting in managing hardware and/or software installation projects. - OR Ph.D. or equivalent doctoral degree; or 3 full years of progressively higher level graduate education leading to such a degree; degree in an academic discipline described below.<br/><br/>NOTE: 1 full academic year of graduate education is the number of credit hours that the school attended has determined to represent 1 year of full-time study; if that information cannot be obtained from the school, 18 semester or 27 quarter hours is considered 1 year of study.<br/><br/>To qualify for the GS-12 level, you need to have at least one year of full-time experience equivalent to the GS-11 level defined as optimizing the functionality of hardware and/or software systems; diagnosing and recovering failed systems; developing and implementing migration strategies and continuity of operations during deployments..<br/><br/>Your answers to the online assessment will be used to evaluate your competencies in the following areas:<br/><br/><ul><li>Skill in researching specifications and proposing recommendations to acquire new IT systems and software.</li><li>Skill in using tools to assess server performance, availability, capacity or configuration problems, and install software and hardware, systems fixes, updates and enhancements.</li><li>Knowledge of information technology operating systems, database systems, hardware, local area networks, and software applications.</li><li>Skill in oral communications to represent the organization on intra-agency/inter-agency workgroups or committees involving systems administration issues or changes.</li><li>Skill in written communications to prepare presentations, systems documentation, and reports.</li><li>Knowledge of contract management sufficient to oversee requirements of IT contracts in accordance with terms, conditions, and specifications.<br/><br/></li></ul>Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.<br/><br/><ul><li>If you have part-time work experience, read this: EPA Announcement Policies and Procedures.<br/><br/></li></ul>Education<br/><br/><strong>2210 Series Information Technology Management<br/><br/></strong>You must have one of the following:<br/><br/><ul><li>bachelor's or higher degree from an accredited or pre-accredited college or university in computer science, engineering, information science, information systems management, mathematics, operations research, statistics, or technology management or degree that provided a minimum of 24 semester hours in one or more of the fields identified above and required the development or adaptation of applications, systems, or networks;<br/><br/></li></ul>OR<br/><br/><ul><li>IT-related experience demonstrating each of these four competencies: 1) Attention to Detail - Is thorough when performing work and conscientious about attending to detail; 2) Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services; 3) Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately; 4) Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.<br/><br/></li></ul>Additional information<br/><br/>Diversity, equity, and inclusion are core values at EPA. Our excellence can only be fully realized by staff who share our commitment to these values. Successful candidates are committed to advancing equity and inclusion in the Agency’s workplace and mission. We encourage applications from candidates with a variety of personal experiences, values, and worldviews that arise from differences of culture and circumstance. At EPA, diversity is a vital element in bringing a balance of perspectives to bear on every challenge we face. We are committed to creating a diverse workforce because we know that the individual strengths and abilities of our employees make us a stronger organization. The more inclusive our employee base is, the greater the variety of ideas that are generated, and the more representative we are of the nation we serve. To learn more about how EPA values and supports our diverse workforce, visit Equal Opportunity Employment at EPA.<br/><br/>EPA participates in E-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees. For additional information: EPA Announcement Policies and Procedures.<br/><br/>Except in special circumstances, those new to the federal government will be hired at the starting salary (step 1) of the applicable grade range listed in the Overview section.<br/><br/>Are you a Displaced Federal Employee? If so, please read the Required Documents section and visit the EPA website for additional information on the Career Transition Assistance Plan (CTAP) and Interagency Career Transition Assistance Plan (ICTAP): EPA Announcement Policies and Procedures<br/><br/>NOTE: To be entitled to selection priority, you must be rated well-qualified (i.e., you must fall into the Well Qualified category or higher--see the How You Will Be Evaluated section).<br/><br/>If you are selected, travel, transportation, and relocation expenses will not be paid by EPA. Any travel, transportation, and relocation expenses associated with reporting to work in this position will be your responsibility.<br/><br/>This position is in the bargaining unit.<br/><br/>Read more<br/><br/><ul><li> Help Help A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.<br/><br/></li></ul>Join EPA in protecting human health and the environment and enjoy many work life quality options! Working for the EPA offers you a comprehensive benefits package that includes, in part, paid vacation, sick leave, holidays, life insurance, health benefits, and participation in the Federal Employees Retirement System. To learn more about us, visit Life and Careers at EPA.<br/><br/>EPA offers workplace flexibilities as described on the EPA Benefits page. These flexibilities are not guaranteed, and eligibility will be determined in accordance with position requirements, policy, and/or applicable Collective Bargaining Agreement after you are hired.<br/><br/><strong>PUBLIC SERVICE LOAN FORGIVENESS (PSLF):</strong> As a federal employee, you may be eligible for student loan forgiveness under the Public Service Loan Forgiveness program. The PSLF program forgives the remaining balance on federal Direct Loans after you have made 120 qualifying payments while working full-time for a qualifying employer, including EPA. Learn more: pslf.gov<br/><br/>This position has portable work. If selected for this position, you may be eligible for partial work-from-home flexibilities after meeting eligibility requirements, as allowable by agency policy and/or applicable collective bargaining agreement.<br/><br/>Review our benefits<br/><br/>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.<br/><br/>", "postedDate": "17 hours ago", "skills": ["Research", "Server Performance", "Database Systems", "Hardware", "Local Area Networks", "Software Applications", "Oral Communications", "Written Communications", "Contract Management"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005875787"}