{"jobTitle": "Social Media Intern", "company": {"name": "Fifth & Cor ", "location": "Florida, United States"}, "location": "Florida, United States", "jobType": "Internship", "employmentType": "Internship", "experienceLevel": "Internship", "jobFunction": "Marketing and Sales", "industry": "Advertising Services", "description": "<em>Thank you for your interest in Fifth & Cor! </em>\n<em>This is a remote, part-time role. Applicants must be Florida residents who currently live in Florida.</em>\n<strong>_________________________________________________________________________________________</strong>\n<br/>\nAs a Social Media Intern at Fifth & Cor, you will play a crucial role in creating visually compelling and engaging content for our clients across various social media platforms. Your primary responsibility will be to stay on top of the latest trends and use your creative skills to bring fresh, innovative ideas to life. You will work closely with our marketing team to ensure that all content aligns with our clients' brand identities and marketing strategies.\n<br/>\n<strong><u>What We’re Looking For</u></strong>\nAs a Social Media Intern at Fifth & Cor, you will assist the team in conceptualizing and executing our customers' social media content with a strong emphasis on creative design and digital storytelling. This role is perfect for someone who is passionate about social media, content creation, and wants to hone their creative skills in a dynamic, fast-paced environment.\n<br/>\nWe are seeking a highly motivated and organized individual with a keen eye for creativity and detail. You must be able to think outside the box, multi-task, prioritize, and work efficiently under tight deadlines. This is an excellent opportunity for someone eager to grow their career in creative content and digital marketing.\n<br/>\n<strong><u>What We Want You To Do</u></strong>\n<ul><li>Design &amp; execute our clients’ content calendar across all existing social media channels, ensuring all visuals are high quality, engaging, and on-brand.</li><li>Create graphics, images, and videos for social media posts, including reels, TikToks, and YouTube shorts, using tools like Canva and Capcut.</li><li>Stay updated with trending content and audios across platforms, incorporating them into your designs and content strategies.</li><li>Collaborate with internal teams to develop visual assets for social media and marketing channels, ensuring timely and high-quality delivery.</li><li>Research and understand audience preferences to create visually and creatively appealing content that resonates with target audiences.</li><li>Monitor social media trends, platform changes, and design best practices to ensure maximum effectiveness of creative content.</li><li>Track and report on the performance of social media posts, providing insights to optimize future content and creative strategies.</li><li>Support external content creation efforts by coordinating with influencers, photographers, and brand ambassadors.</li><li>Suggest and design creative campaigns, promotions, and contests that attract and engage prospective customers.</li><li>Contribute to the development and execution of marketing strategies that drive strong digital results through experiential retail, brand partnerships, and guerrilla marketing.</li><li>Monitor and respond to comments and direct messages on a daily basis.</li><li>Find and engage with new accounts across social platforms to grow each client's online community. </li></ul>\n<br/>\n<strong><u>What We Want to See</u></strong>\n<ul><li>A passion for creative content, social media, and digital marketing.</li><li>Strong skills in graphic design and video editing, with proficiency in tools like Canva and Capcut.</li><li>Excellent organizational, project management, and problem-solving skills to handle multiple responsibilities and meet deadlines consistently.</li><li>A positive, \"no task is too small\" attitude with a willingness to experiment and innovate.</li><li>Ability to analyze data and use insights to improve content design and performance.</li><li>Strong customer service skills, including empathy, patience, and conflict resolution.</li><li>High attention to detail, with a commitment to producing visually stunning and creative content.</li><li>Ability to work effectively with multiple stakeholders and manage multiple projects simultaneously.</li><li>A working knowledge of the marketing ecosystem and the ability to design for various platforms and scenarios.</li><li>A creative eye with the ability to create and identify strong brand assets.</li><li>Familiarity with social media platforms, their respective audiences, and best practices for creative content design.</li></ul>", "postedDate": "4 hours ago", "skills": ["Canva", "Capcut", "Social Media", "Content Creation", "Digital Marketing", "Graphic Design", "Video Editing", "Project Management", "Problem Solving", "Customer Service", "Data Analysis", "Marketing Ecosystem", "Brand Assets", "Social Media Platforms"], "url": "https://www.linkedin.com/jobs/view/4005865576"}