{"jobTitle": "Autocad Designer", "company": {"name": "Actalent", "location": "Bellevue, WA"}, "location": "Bellevue, WA", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Business Consulting and Services", "description": "Job Title: AutoCAD Designer<br/><br/><strong>Job Description<br/><br/></strong>This individual will be responsible for creating detailed module drawings of building area layouts including material handling equipment, work areas, and material handling components based on current examples as well as designs supported for future initiatives. This role specifically will be working on the design of grocery store delivery stations. Working with Design Engineers to determine requirements for delivery station layouts, translating those requirements and standards into detailed interior CAD drawings, ensuring a high level of accuracy and completeness. Collaborate with Design Engineers, other CAD drafters, World Wide Engineering (WWE), Pre-Construction, Construction, external architects, MHE vendors, and Launch Execution teams, among others, to deliver a completed, approved design set. Review and engage with internal and external stakeholders to permit sets, structural drawings, elevations, and floorplans as it pertains to questions around designs. Support the Design quality control process, which strives for accurate, zero-defect designs, through participation in daily peer reviews, adherence to design checklists and standards, and soliciting constant feedback from Design Engineers. Responsible for delivering new designs, post-permit design updates, expansion, and retrofits to support associate and driver safety, quality, and productivity, and capacity increase for the delivery stations. Implement new template designs, process improvements, safety processes, etc. into standard designs.<br/><br/>Hard Skills<br/><br/><ul><li>AutoCAD drafting and design skills</li><li>Understanding architectural floor plans, preferably in large warehouse-type environments</li><li>Ability to work across a large number of projects simultaneously<br/><br/></li></ul>Job Type<br/><br/>This is a contract position with a duration of 12 Month(s).<br/><br/>Work Site<br/><br/>This is a hybrid position requiring some days on-site in Bellevue, Washington and some days remote.<br/><br/>Work Environment<br/><br/>This person will be working onsite in Bellevue, WA 3 days a week.<br/><br/><strong>About Actalent<br/><br/></strong>Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options.", "postedDate": "2 hours ago", "skills": ["AutoCAD"], "url": "https://www.linkedin.com/jobs/view/4005926335"}