{"jobTitle": "Workplace Experience Manager, US", "company": {"name": "Datamaran", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "description": "<strong>Workplace Experience Manager<br/><br/></strong><strong>Reporting to:</strong> VP of People in HR<br/><br/><strong>Location:</strong> Hybrid. New York City, New York, US<br/><br/><strong>Full-time/Part-time<br/><br/></strong>We are Datamaran: a fast-paced, energetic and high-growth technology company.<br/><br/>Datamaran is the only software analytics platform in the world that identifies and monitors external risks, including ESG. Trusted by blue-chip companies and top tier partners, it brings a data-driven business process for external risk and materiality analysis. In house - at any time. At Datamaran our mission is to positively impact the world by helping corporations to have a robust sustainability strategy with our SaaS platform. Literally, the software helps our clients to make the world a better place with ESG strategy decision-making! Now, we need you to help to accelerate this transformation.<br/><br/>We recognise that people of different backgrounds widen our perspective, so we're committed to diversity, equality and inclusion in everything we do. Datamaran is proud to be an equal opportunity employer as such all applications received will be considered without regard to race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, or age.<br/><br/>Our eclectic team of talented individuals represent over 25 nationalities, with 50% of our leaders being female. Datamaran is a fully digital and distributed company, already with over 100 members of staff working across the globe, with offices in London, Valencia, New York and now Leeuwarden in the Netherlands.<br/><br/>Such a mix makes Datamaran a unique, collaborative and ambitious workplace.<br/><br/><strong>Job Overview:<br/><br/></strong>As Workplace Experience Manager your role is to prioritize the employee experience primarily in our New York City Hub and to some extent for our distributed employees in the US. The role also has a broad cohort of stakeholders and exposure to the broader Datamaran global community.<br/><br/>The Workplace Experience Manager will find ways to improve the New York workplace experience for everyone and will have responsibility to deliver Datamaran employees an exceptional workplace experience, through:<br/><br/><ul><li>workplace design</li><li>technology</li><li>culture<br/><br/></li></ul>At Datamaran, we are dedicated to fostering strong working relationships, a crucial element for the success of the Workplace Experience team. When teams feel a greater sense of belonging and have solid working relationships, communication becomes smoother, making the team more agile and efficient. This combination leads to a deeper connection to the company and its brand, creating high-performing, highly engaged teams.<br/><br/><strong>Key Responsibilities:<br/><br/></strong>Office Hub Management:<br/><br/><ul><li>Ensure office efficiency by managing procedures, supplies, and space planning</li><li>Oversee office expenditure and coordinate with finance on budgeting</li><li>Collaborate with the Studio team to meet SLAs and tailor services</li><li>Keep snack and drink stations stocked and monitor workplace improvements<br/><br/></li></ul>Culture and Engagement:<br/><br/><ul><li>Organize team events and celebrations</li><li>Collect and advocate for colleague feedback and ideas</li><li>Work with teams to enhance office vibe, manage onboarding packs, and company gifts</li><li>Support People Operations with onboarding/offboarding and asset management<br/><br/></li></ul>Company Event Management:<br/><br/><ul><li>Align events with team preferences through feedback</li><li>Maintain and plan an events calendar that meets company goals</li><li>Ensure seamless event execution, managing logistics and vendors</li><li>Handle event budgeting and communication to boost engagement<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Skills/Abilities<br/><br/></strong><ul><li>Strong Organisational and Project Management Skills: Ability to manage multiple projects simultaneously, prioritise tasks effectively, and ensure smooth execution of office operations, events, and workplace initiatives</li><li>Excellent Communication and Interpersonal Skills: Proven ability to engage with a diverse range of stakeholders, gather and analyse feedback, and foster strong working relationships across different teams and global offices</li><li>Proactive Problem-Solving and Adaptability: Ability to anticipate challenges, identify opportunities for improvement, and adapt to changing needs to enhance the workplace experience<br/><br/><br/></li></ul><strong>Education/Experience<br/><br/></strong><ul><li>At least 3 years of experience in a related field</li><li>Experience in Office Management or Workplace Experience Roles: Demonstrated experience in managing office spaces, coordinating events, and enhancing workplace culture in a corporate or similar environment</li><li>Experience with Budget Management and Vendor Coordination: Proven experience in managing budgets, processing invoices, and coordinating with vendors to ensure cost-effective and high-quality services</li><li>A kind note to recruiters: thank you for your potential interest but we are currently not looking to work with any external staffing agencies* <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong>Some of Datamaran's Benefits available to our US-based Datamaraneers:<br/><br/><ul><li>Competitive Salary package</li><li>24 Vacation days excluding bank holidays, plus Juneteenth</li><li>Medical, Dental &amp; Vision insurance (premium contribution)</li><li>Paid Sick leave</li><li>Paid Parental leave</li><li>401k </li><li>New benefits continue to be introduced as the US team grows</li></ul>", "jobFunction": "Human Resources", "industry": "Non-profit Organizations and Primary and Secondary Education", "postedDate": "4 hours ago", "benefits": "Some of Datamaran's Benefits available to our US-based Datamaraneers:<br/><br/><ul><li>Competitive Salary package</li><li>24 Vacation days excluding bank holidays, plus Juneteenth</li><li>Medical, Dental &amp; Vision insurance (premium contribution)</li><li>Paid Sick leave</li><li>Paid Parental leave</li><li>401k </li><li>New benefits continue to be introduced as the US team grows</li></ul>", "qualifications": {"required": "Strong Organisational and Project Management Skills: Ability to manage multiple projects simultaneously, prioritise tasks effectively, and ensure smooth execution of office operations, events, and workplace initiatives\nExcellent Communication and Interpersonal Skills: Proven ability to engage with a diverse range of stakeholders, gather and analyse feedback, and foster strong working relationships across different teams and global offices\nProactive Problem-Solving and Adaptability: Ability to anticipate challenges, identify opportunities for improvement, and adapt to changing needs to enhance the workplace experience", "preferred": "At least 3 years of experience in a related field\nExperience in Office Management or Workplace Experience Roles: Demonstrated experience in managing office spaces, coordinating events, and enhancing workplace culture in a corporate or similar environment\nExperience with Budget Management and Vendor Coordination: Proven experience in managing budgets, processing invoices, and coordinating with vendors to ensure cost-effective and high-quality services\nA kind note to recruiters: thank you for your potential interest but we are currently not looking to work with any external staffing agencies* "}, "skills": ["Project Management", "Communication", "Problem Solving"], "url": "https://www.linkedin.com/jobs/view/4005868992"}