{"jobTitle": "Executive Administrative Assistant", "company": {"name": "Compunnel Inc.", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Financial Services", "description": "<strong>Job Title: Administrative Assistant</strong>\n<p><strong>Location: NYC, NY</strong></p><p><br/></p><p><strong>Job Description:</strong></p><p>Description:</p><p><strong>Calendaring</strong> o Assisting with creating meetings, <strong>moving meetings, sending invites for events, and other adjustments</strong> in schedule</p><p> Working with other assistants to find times that work for all higher level leaders o Managing conflicts that may arise on the calendar</p><p> Event/Meeting Planning o Assist with planning events, group meetings, offsites, etc. o Working with senior leadership to plan details of meetings and outings including all travel arrangements, transportation options, food plans, presentation ideas, timeline/schedule, etc.</p><p> Creating calendar invites, managing attendance for the events, organizing catering orders, setting up the conference rooms with audio, catering, and visual as needed o Arranging welcome lunches, welcome breakfasts, and other lunch or breakfast meetings</p><p> Expenses : Track and manage all expenses from the corporate credit card o Create expense reports, managing receipts from leadership travel, submitting reports weekly/monthly (as needed) for non-corporate card charges o Keep track of all fees related to corporate card</p><p> Special projects include assisting with document review and edits, applying signatures to documents other teams provide, power point editing and formatting, etc.</p><p> Assist when possible during urgent technical issues that may arise, including issues with calendars, or accessing applications. This includes also getting in touch with IT –</p><p> Expenses via OKTA /Concur</p><p> MUST demonstrate history of supporting one, and only one, high powered executive.</p><p> Demonstrated continuance in a long-term support role. Resumes where folks jump once a year will not work.</p><p></p>", "postedDate": "2 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005870806"}