{"jobTitle": "Academic Dean", "company": {"name": "San Joaquin Valley College", "location": "Visalia, CA", "industry": "Higher Education"}, "location": "Visalia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$72,000.00 - $90,000.00", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Higher Education", "description": "<strong>Who Are We: </strong>San Joaquin Valley College prepares graduates for professional success by offering Baccalaureate and Associate of Science Degrees and Certificates of Completion in business, medical and technical career fields. We help students achieve success by providing them with \"hands-on\" training that uses the technologies and processes that are used in the field, allowing them to build their confidence while they \"learn by doing\". Our focus is to help change the lives of our students for the better through education. That's more than our purpose; it's our promise to you and our students!<br/><br/><strong>What we're looking for: </strong>Someone with tenacity, passion, and leadership skills to join our team as an <strong>Academic Dean</strong> at our <strong>Visalia campus</strong>.<br/><br/><strong>Summary: Are you a natural-born leader who is motivated by the success of everyone around you?</strong> Do you have a passion for education and seeing students thrive? The Community Campus Dean position could be a great fit. Under the direct supervision of the Vice Provost and technical supervision of the Director of Instruction, the Campus Dean is responsible for the day-to-day operation of our educational programs and our campus faculty. You'll also be helping with the development, implementation, and delivery of various services to enrich the SJVC experience for our on-campus students.<br/><br/><strong>What We Offer: </strong>The targeted starting pay range for this position is between <strong>$72,000-$90,000 per year.</strong> Our benefits program for full-time colleagues includes medical, dental, and vision coverage, as well as flexible spending and health savings accounts. You will accrue two to three weeks of paid vacation your first five years with eleven paid holidays. We offer state-compliant sick leave, disability insurance, and company-paid life insurance. We offer a 401k profit-sharing plan with a discretionary match and tuition assistance to employees.<br/><br/><strong>Are you a natural-born leader who is motivated by the success of the teams you lead? </strong>SJVC's Academic Dean position could be a great fit. Under the direct supervision of the Campus President and technical supervision of the Vice Provost, the Academic Dean is responsible for the day-to-day operation of our educational programs and our campus faculty. You'll also be helping with the development, implementation, and delivery of various services to enrich the SJVC experience for our on-campus students.<br/><br/><strong>Do you qualify? Qualifications for the position:<br/><br/></strong>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Education and/or Experience </strong>- Must possess a minimum of a Baccalaureate degree with a master's degree preferred in education or related field. Must possess a minimum of 5 years of administrative experience. Degree(s) must be from institutions accredited by recognized U.S. accrediting agencies and or degrees from non-U.S. institutions are recognized only if equivalence has been established and provided.", "responsibilities": "Under the direct supervision of the Vice Provost and technical supervision of the Director of Instruction, the Campus Dean is responsible for the day-to-day operation of our educational programs and our campus faculty. You'll also be helping with the development, implementation, and delivery of various services to enrich the SJVC experience for our on-campus students.", "qualifications": {"required": "Must possess a minimum of a Baccalaureate degree with a master's degree preferred in education or related field. Must possess a minimum of 5 years of administrative experience. Degree(s) must be from institutions accredited by recognized U.S. accrediting agencies and or degrees from non-U.S. institutions are recognized only if equivalence has been established and provided."}, "skills": [], "postedDate": "4 hours ago", "benefits": "Our benefits program for full-time colleagues includes medical, dental, and vision coverage, as well as flexible spending and health savings accounts. You will accrue two to three weeks of paid vacation your first five years with eleven paid holidays. We offer state-compliant sick leave, disability insurance, and company-paid life insurance. We offer a 401k profit-sharing plan with a discretionary match and tuition assistance to employees.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005863155"}