{"jobTitle": "Terminal Manager", "company": {"name": "Saia Inc.", "location": "Richfield, OH"}, "location": "Richfield, OH", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "Ready To Go Further?<br/><br/>Saia is a different kind of logistics and transportation company. We do things the right way. You‘ll see it in our commitment to our people, customers, and community. You‘ll feel it in the support you get on day one – from leadership and from your team. A job with Saia is packed with opportunity – from learning new skills and advancing to competitive compensation and great benefits. It's all here and it’s exactly what <em>going further</em> is all about.<br/><br/>Job Summary<br/><br/>Ready to take your career in the transportation industry to the next level? Saia is recruiting for a Terminal Manager. As a Terminal Manager, you will direct and coordinate activities of terminal employees to provide cost effective, timely, quality service to customers.<br/><br/>Job Responsibilities<br/><br/><ul><li>Investigating customer complaints and resolving problems</li><li>Interviewing, selecting, training, and assigning new personnel</li><li>Enforcing compliance of all company policies and procedures, safety rules and governmental regulations</li><li>Reviewing and analyzing expenditure, financial and operations reports to determine requirements for increasing profits and improving processes<br/><br/></li></ul>Preferred Qualifications<br/><br/><ul><li>2+ years of freight terminal operations supervisory experience</li><li>Bachelor's degree</li><li>Knowledge of AS400</li><li>Knowledge of Microsoft Office</li><li>Ability to work extended hours, including nights and weekends as necessary<br/><br/></li></ul>Benefits<br/><br/>At Saia, your success is our success! That’s why we work hard to provide you with what you need to build an awesome career. We are committed to rewarding superior employee performance so that when you work hard, your achievements won’t go unnoticed.<br/><br/>Make Your Move<br/><br/>At Saia, our people are the reason we’ve been successful for over a century in the industry. Together, we’ve created a positive culture that’s driven by our core values – like dignity and respect, a customer-first approach, safety and more. With hundreds of terminals across the country and growing, we’re always looking for more collaborative and motivated individuals to join our team. So, if you’re ready to put your career on a solid path, let’s go further.<br/><br/>Saia is an Equal Opportunity Employer and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "responsibilities": "<ul><li>Investigating customer complaints and resolving problems</li><li>Interviewing, selecting, training, and assigning new personnel</li><li>Enforcing compliance of all company policies and procedures, safety rules and governmental regulations</li><li>Reviewing and analyzing expenditure, financial and operations reports to determine requirements for increasing profits and improving processes<br/><br/></li></ul>", "qualifications": {"preferred": "<ul><li>2+ years of freight terminal operations supervisory experience</li><li>Bachelor's degree</li><li>Knowledge of AS400</li><li>Knowledge of Microsoft Office</li><li>Ability to work extended hours, including nights and weekends as necessary<br/><br/></li></ul>"}, "skills": ["AS400", "Microsoft Office"], "postedDate": "2 hours ago", "benefits": "At Saia, your success is our success! That’s why we work hard to provide you with what you need to build an awesome career. We are committed to rewarding superior employee performance so that when you work hard, your achievements won’t go unnoticed.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005876858"}