{"jobTitle": "Director of Technology", "company": {"name": "National Congress of American Indians", "location": "Washington, DC"}, "location": "Washington, DC", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Information Technology", "industry": "Government Relations", "description": "Job Summary:\nThe Director of Technology (DOT) will be responsible for executing a tailored technology strategy that aligns\nwith NCAI business goals and major partnerships and supports growth plans. The DOT will supervise all\ntechnical aspects of NCAI, accelerate digital innovation within the organization, lead internal technical staff,\nand assist in external partnerships to ensure that products and services are developed efficiently. The DOT\nwill lead and inspire a talented technology team, drive digital transformation, and, in a cooperative effort\nacross NCAI’s departments and externally, shape the technological future of NCAI.\n\nObjectives of this role include:\n• Identifying and evaluating technology needs and solutions, assessing their potential for strategic\nadvantage and business impact.\n• Collaborating closely with executive leadership, business units, customers, and partners to evaluate\ntechnology needs and drive technology-enabled business initiatives.\n• Providing strong leadership and guidance, fostering a culture of collaboration and constant learning.\n• Accelerating innovation initiatives to optimize efficiency of our products, services and processes.\n• Managing relationships with technology vendors and partners, evaluating and selecting the most\nsuitable solutions and services.\n• Overseeing the development and implementation of scalable, resilient, reliable, and secure systems,\nhardware, software solutions, and infrastructure.\n*This job description does not represent an exclusive list of all duties encompassed in this position.\n\nDuties/Responsibilities:\n• Develop and execute a comprehensive technology strategy tailored to the company's business\nobjectives, scalability, and operational efficiency.\n• Create and manage the technology budget, optimizing resource allocation and cost-effectiveness.\n• Oversee the design and implementation of robust technical architectures, ensuring alignment with\nbusiness requirements, security standards and industry’s best practices.\n• Establish and maintain efficient and reliable technology operations, including enterprise-wide\nsoftware systems infrastructure, and data management and security protocols for data integrity.\n• Develop and implement business continuity strategies.\n• Identify and mitigate technology-related risks, ensuring data privacy and security compliance.\n• Maintain awareness of the latest technological advancements to provide strategic insights and\nrecommendations for maintaining a modernity in technological business capacities.\n• Prepare and conduct staff training on internal policies and processes in cybersecurity.\n• Other duties as assigned.\n\n\nMinimum Qualifications:\n• A bachelor’s degree in computer science, information technology, or a related field.\n• 5+ years of experience as a technology officer or in a similar senior technology leadership role.\n• Demonstrated success in managing business software architecture and implementation of IT infrastructures, IT budgets, software development and systems architecture.\n• Expert understanding of technology trends, best practices, and the global\ntechnology landscape.\n• Extensive knowledge of software development methodologies, infrastructure management, and\ncybersecurity best practices.\n• Experience driving digital transformation initiatives, leveraging cloud technologies, and implementing\ndata-driven decision-making.\n\n\nRequired/Knowledge/Skills/Abilities:\n• Ability to think tactically and translate business objectives into technology initiatives.\n• Proficient in risk mitigation and data security of digital assets.\n• Knowledge of regulatory and compliance frameworks relevant to 501(c)(3) and 501(c)(4) operations.\n• Familiarity with methodologies for enterprise-wide software implementation.\n• Strong communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams, directors, and senior executives.\n• Proven ability to navigate complex technology landscapes and align technology initiatives with\nbusiness objectives.\n• Strong strategic thinking, and the ability to effectively translate business objectives into successful\ntechnology strategies.\n• Excellent leadership and team management skills, with the ability to inspire and develop high-performing technology teams.\n• Proven track record of successfully leading complex and multi-stakeholder technology projects,\ndelivering results on time and within budget.\n• Excellent analytical and problem-solving skills, with the ability to leverage data and insights for\ninformed decision-making.\n• Excellent written, verbal, and digital communication skills.\n• Excellent organizational skills and attention to detail.\n• Excellent time management skills with a proven ability to meet deadlines.\n• A passionate commitment to the mission of NCAI and the humility to take on all tasks assigned with a\ncheerful attitude and a desire to contribute to the NCAI team and company as a whole.\n• The ability to travel to staff and support NCAI’s three major conferences each calendar year.\n• Ability to act with integrity, professionalism, and confidentiality.\n• Proficient with Google Workspace, Paychex, Slack or related software.\n\n\nWorking Conditions & Physical Demands:\n• Typical business office setting with moderate noise level.\n• Non-office environment may be encountered for offsite presentations and support of company\nactivities.\n• Must be able to sit for work at a computer for more than 6 hours per day.\n• Must be able to use hands for dexterity of motion and reach with hands and arms. Extensive use of\ncomputer keyboards.\n• Occasionally required to stand and walk.\n• Frequently required to talk and hear.\n• Must have the ability to occasionally life 20+ lbs.\n\n\nSupervisory Responsibilities:\n• Recruits, interviews, hires, and trains new staff in the department.\n• Oversees the department’s daily workflow and coordinates support for\ninternal and external partners.\n• Provide guidance and feedback to all departments.\n• Provides constructive criticism and timely performance evaluations.", "postedDate": "2 hours ago", "skills": ["Technology", "Digital Transformation", "Cloud Technologies", "Data-Driven Decision-Making", "Software Development", "Infrastructure Management", "Cybersecurity", "Risk Mitigation", "Data Security", "Google Workspace", "Paychex", "Slack"], "url": "https://www.linkedin.com/jobs/view/4005943732"}