{"jobTitle": "Environmental Engineer/Physical Scientist/Life Scientist", "company": {"name": "US Environmental Protection Agency (EPA)", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Engineering and Information Technology", "industry": "Government Administration", "description": "Help Help<br/><br/><strong>Requirements<br/><br/></strong>Conditions of Employment<br/><br/><ul><li>Position has education requirements--see Qualifications/Education section.</li><li>You must submit a resume and required documents--see How to Apply section.</li><li>You must be a U.S. citizen.</li><li>EPA and non-EPA applicants must submit transcripts/course listings.<br/><br/></li></ul>This position is designated as Moderate Risk and requires a background investigation. Unless an appropriate background investigation is already on record with the Office of Personnel Management, you must undergo a background investigation. All conditions of the pre-employment security process must be met before an official letter of employment can be issued with a report for duty date.<br/><br/>If you are selected, you will be required to complete a Confidential Financial Disclosure form within 30 days of your first day of employment and annually thereafter.<br/><br/>If you are selected, you may be required to complete a one-year probationary period.<br/><br/><strong>Qualifications<br/><br/></strong>NOTE: You must meet qualification requirements, including any requirements described in the Education section, by the closing date of this announcement.<br/><br/>In addition to the basic entry education requirements, you must have specialized experience and/or directly related education as described below:<br/><br/>To qualify for the GS-11 level, you must have one of the following:<br/><br/><ul><li>1 year of full-time* specialized experience equivalent to at least the GS-09 level defined as providing technical assistance and oversight of drinking water programs. </li><li>3 years of progressively higher level graduate education leading to a Ph.D. degree; or Ph.D. or equivalent doctoral degree; the education must be directly related and provide the knowledge, skills, and abilities necessary to do the work of the position</li><li>equivalent combination of education and experience<br/><br/></li></ul>NOTE: 1 year of full-time graduate education is the number of credit hours that the school attended has determined to represent 1 year of full-time study; if that number cannot be obtained from the school, 18 semester hours is considered an academic year of graduate study.<br/><br/>To qualify for the GS-12 level, you must have 1 year of full-time* specialized experience equivalent to at least the GS-11 level defined as providing technical assistance and oversight of drinking water programs; and ensuring the delivery of safe drinking water by public water systems pursuant to requirements under the safe drinking water act.<br/><br/>Your answers to the online assessment will be used to evaluate your competencies in the following areas:<br/><br/><ul><li>Knowledge of federal environmental laws and regulations.</li><li>Knowledge of drinking water programs and strategies.</li><li>Skill in oral communication.</li><li>Skill in collaborating with external stakeholders to provide advice and achieve consensus.</li><li>Skill in written communication.</li><li>Ability to manage water treatment facilities projects.<br/><br/></li></ul>Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.<br/><br/><ul><li>If you have part-time work experience, read this: EPA Announcement Policies and Procedures.<br/><br/></li></ul>Education<br/><br/><strong>0819 - Environmental Engineer<br/><br/></strong><strong>You Must Have One Of The Following<br/><br/></strong><ul><li>Successful completion of a professional engineering degree at an accredited university or college<br/><br/></li></ul><strong>OR<br/><br/></strong><ul><li>Combination of college level education or training AND technical experience that has furnished you with (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following:</li><li>Professional registration as an engineer.</li><li>Evidence of passing the Engineer-in-Training written test.</li><li>Successful documented completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences as described by OPM.</li><li>Successful completion of a curriculum leading to a bachelor's or higher degree from an accredited or pre-accredited college or university in engineering technology or in an appropriate professional field and at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance.<br/><br/></li></ul>Please review the OPM page on specifics about required curriculum and for more information on qualifications, please visit <strong>GS-800: All Professional Engineering Positions qualifications<br/><br/></strong><strong>1301 - Physical Scientist<br/><br/></strong>You must have a bachelor's or higher degree from an accredited or pre-accredited college or university in physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics; OR a combination of education and experience with education equivalent to one of the majors listed that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education.<br/><br/><strong>0401 - Life Scientist<br/><br/></strong>You must have a bachelor's or higher degree from an accredited or pre-accredited college or university in biological sciences, agriculture, natural resource management, chemistry, or related disciplines appropriate to the position; OR a combination of education and experience with courses equivalent to a major, as listed.<br/><br/>For information about accreditation requirements, visit EPA Announcement Policies and Procedures.<br/><br/>Additional information<br/><br/>This position is in the bargaining unit.<br/><br/>Diversity, equity, and inclusion are core values at EPA. Our excellence can only be fully realized by staff who share our commitment to these values. Successful candidates are committed to advancing equity and inclusion in the Agency’s workplace and mission. We encourage applications from candidates with a variety of personal experiences, values, and worldviews that arise from differences of culture and circumstance. At EPA, diversity is a vital element in bringing a balance of perspectives to bear on every challenge we face. We are committed to creating a diverse workforce because we know that the individual strengths and abilities of our employees make us a stronger organization. The more inclusive our employee base is, the greater the variety of ideas that are generated, and the more representative we are of the nation we serve. To learn more about how EPA values and supports our diverse workforce, visit Equal Opportunity Employment at EPA.<br/><br/>EPA participates in E-Verify. E-Verify is an Internet based system operated by the Department of Homeland Security (DHS) in partnership with the Social Security Administration (SSA) that enables participating employers to electronically verify the employment eligibility of their newly hired employees. For additional information: EPA Announcement Policies and Procedures.<br/><br/>If you are selected, travel, transportation, and relocation expenses will not be paid by EPA. Any travel, transportation, and relocation expenses associated with reporting to work in this position will be your responsibility.<br/><br/>Except in special circumstances, those new to the federal government will be hired at the starting salary (step 1) of the applicable grade range listed in the Overview section.<br/><br/>Are you a Displaced Federal Employee? If so, please read the Required Documents section and visit the EPA website for additional information on the Career Transition Assistance Plan (CTAP) and Interagency Career Transition Assistance Plan (ICTAP): EPA Announcement Policies and Procedures<br/><br/>NOTE: To be entitled to selection priority, you must be rated well-qualified (i.e., you must fall into the Well Qualified category or higher--see the How You Will Be Evaluated section).<br/><br/>Read more<br/><br/><ul><li> Help Help A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.<br/><br/></li></ul>Join EPA in protecting human health and the environment and enjoy many work life quality options! Working for the EPA offers you a comprehensive benefits package that includes, in part, paid vacation, sick leave, holidays, life insurance, health benefits, and participation in the Federal Employees Retirement System. To learn more about us, visit Life and Careers at EPA.<br/><br/>EPA offers workplace flexibilities as described on the EPA Benefits page. These flexibilities are not guaranteed, and eligibility will be determined in accordance with position requirements, policy, and/or applicable Collective Bargaining Agreement after you are hired.<br/><br/><strong>PUBLIC SERVICE LOAN FORGIVENESS (PSLF):</strong> As a federal employee, you may be eligible for student loan forgiveness under the Public Service Loan Forgiveness program. The PSLF program forgives the remaining balance on federal Direct Loans after you have made 120 qualifying payments while working full-time for a qualifying employer, including EPA. Learn more: pslf.gov<br/><br/>This position has portable work. If selected for this position, you may be eligible for partial work-from-home flexibilities after meeting eligibility requirements, as allowable by agency policy and/or applicable collective bargaining agreement.<br/><br/>Review our benefits<br/><br/>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.<br/><br/>", "postedDate": "18 hours ago", "qualifications": {"required": "NOTE: You must meet qualification requirements, including any requirements described in the Education section, by the closing date of this announcement.<br/><br/>In addition to the basic entry education requirements, you must have specialized experience and/or directly related education as described below:<br/><br/>To qualify for the GS-11 level, you must have one of the following:<br/><br/><ul><li>1 year of full-time* specialized experience equivalent to at least the GS-09 level defined as providing technical assistance and oversight of drinking water programs. </li><li>3 years of progressively higher level graduate education leading to a Ph.D. degree; or Ph.D. or equivalent doctoral degree; the education must be directly related and provide the knowledge, skills, and abilities necessary to do the work of the position</li><li>equivalent combination of education and experience<br/><br/></li></ul>NOTE: 1 year of full-time graduate education is the number of credit hours that the school attended has determined to represent 1 year of full-time study; if that number cannot be obtained from the school, 18 semester hours is considered an academic year of graduate study.<br/><br/>To qualify for the GS-12 level, you must have 1 year of full-time* specialized experience equivalent to at least the GS-11 level defined as providing technical assistance and oversight of drinking water programs; and ensuring the delivery of safe drinking water by public water systems pursuant to requirements under the safe drinking water act.<br/><br/>Your answers to the online assessment will be used to evaluate your competencies in the following areas:<br/><br/><ul><li>Knowledge of federal environmental laws and regulations.</li><li>Knowledge of drinking water programs and strategies.</li><li>Skill in oral communication.</li><li>Skill in collaborating with external stakeholders to provide advice and achieve consensus.</li><li>Skill in written communication.</li><li>Ability to manage water treatment facilities projects.<br/><br/></li></ul>Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.<br/><br/><ul><li>If you have part-time work experience, read this: EPA Announcement Policies and Procedures.<br/><br/></li></ul>", "preferred": "You must have a bachelor's or higher degree from an accredited or pre-accredited college or university in physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics; OR a combination of education and experience with education equivalent to one of the majors listed that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education.<br/><br/>You must have a bachelor's or higher degree from an accredited or pre-accredited college or university in biological sciences, agriculture, natural resource management, chemistry, or related disciplines appropriate to the position; OR a combination of education and experience with courses equivalent to a major, as listed.<br/><br/>For information about accreditation requirements, visit EPA Announcement Policies and Procedures."}, "skills": ["federal environmental laws and regulations", "drinking water programs and strategies", "oral communication", "collaborating with external stakeholders", "written communication", "water treatment facilities projects"], "benefits": "A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.<br/><br/>Join EPA in protecting human health and the environment and enjoy many work life quality options! Working for the EPA offers you a comprehensive benefits package that includes, in part, paid vacation, sick leave, holidays, life insurance, health benefits, and participation in the Federal Employees Retirement System. To learn more about us, visit Life and Careers at EPA.<br/><br/>EPA offers workplace flexibilities as described on the EPA Benefits page. These flexibilities are not guaranteed, and eligibility will be determined in accordance with position requirements, policy, and/or applicable Collective Bargaining Agreement after you are hired.<br/><br/><strong>PUBLIC SERVICE LOAN FORGIVENESS (PSLF):</strong> As a federal employee, you may be eligible for student loan forgiveness under the Public Service Loan Forgiveness program. The PSLF program forgives the remaining balance on federal Direct Loans after you have made 120 qualifying payments while working full-time for a qualifying employer, including EPA. Learn more: pslf.gov<br/><br/>This position has portable work. If selected for this position, you may be eligible for partial work-from-home flexibilities after meeting eligibility requirements, as allowable by agency policy and/or applicable collective bargaining agreement.<br/><br/>Review our benefits<br/><br/>Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.<br/><br/", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005874861"}