{"jobTitle": "Sr. Director, Global Talent", "company": {"name": "MicroVention-Terumo", "location": "Aliso Viejo, CA", "industry": "Medical Equipment Manufacturing"}, "location": "Aliso Viejo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Training and Education", "industry": "Medical Equipment Manufacturing", "description": "<strong>Sr. Director, Global Talent</strong><br/><br/>As a critical role of Talent, which is a key focus area for MicroVention, lead the Global Talent Center of Excellence for all regions worldwide inclusive of Leadership Development, Talent Management, Succession Planning, Top Talent Development, Performance Management, Coaching, and Organizational Development. Work in close partnership with members of the Global HR Leadership &amp; Communications Team and senior leaders within MicroVention globally.<br/><br/>As a member of the Global Human Resources Leadership Team, work in close collaboration with global HR Business Partners and senior leadership to impact MicroVention’s business through the development, execution, and oversight of impactful global talent solutions. Internally build solutions (e.g., processes, programs, tools, coaching, and resources) for global leadership capabilities, enhance overall associate effectiveness, positively increase employee engagement, and develop talent bench strength throughout the organization. Partner with those in HR and the business to advance MicroVention’s Global Talent Strategy, foster a culture of innovation, and enable the achievement of organizational goals.<br/><br/><u>What You'll be Doing</u><ul><li>Lead the Center of Excellence globally for Global Talent, including Leadership Development, Talent Management, Succession Planning, Top Talent Development, Performance Management, Coaching, and Organizational Development. </li><li>Internally design, develop and implement the Global Talent Management strategy. </li><li>Internally design, develop, and facilitate leadership learning solutions for people managers and individual contributors. </li><li>Lead a diverse, high-performing team of Global Talent professionals. </li><li>Provide coaching and development to targeted high performers worldwide. </li><li>Provide guidance and mentorship to people managers, HRBPs, and business leaders on talent management, including best practices that will best serve their associates and business needs. </li><li>Lead the end-to-end processes, tools and training for Talent Management, and Performance Management. </li><li>Partner with internal key stakeholders and HR Partners to effectively implement global solutions that will address business needs and employee development, measure effectiveness, and report results. </li><li>Provide coaching to targeted high performers. </li><li>Provide subject matter consultation and expertise to HRBPs and business leaders. Keep up to date with industry developments, technology, and trends to adopt best practices. </li><li>Leverage business data, engagement/pulse surveys, direct employee feedback, and best practices to influence the learning strategy and employee learning experiences. </li><li>Oversee the delivery and administration of LinkedIn Learning. </li><li>Perform ongoing evaluations of current programs to determine effectiveness and manage continuous improvement initiatives. </li><li>Foster collaborative partnerships with HRBPs and business leaders to have a continuous pulse on the organization, assess talent development needs, create programs, and implement, monitor, and maintain them. </li><li>Continually develop business acumen and apply organizational knowledge in order to address business and organizational challenges in a targeted, business-oriented manner. </li><li>Evaluate and monitor the effectiveness of talent programs by analyzing data and providing feedback and/or modifications as needed. </li><li>Evaluate overall effectiveness of Talent Development processes and systems and adjust as needed. </li></ul><br/><br/><u>What's Needed for the Role</u><ol><li>Bachelor’s degree in human resources, Instructional Design, Organizational Psychology, or business-related field. </li><li>A minimum of fifteen (15) years of professional experience in Talent Development, Talent Management, Leadership, Human Resources, or related field. </li><li>A minimum of seven (7) years of people management experience. </li><li>Excellent listening, written, and verbal communication skills. </li><li>Proficient with MS Word, Excel, PowerPoint, Outlook, and Teams.</li></ol><br/><br/><u>What will Differentiate You from the Rest</u><ol><li>Significant experience with internally designing, developing, and implementing leadership and talent management solutions. </li><li>Significant experience with leadership development, coaching, and succession planning. </li><li>Ability to analyze and report out data. </li><li>Experience driving and handling projects while managing multiple stakeholders. </li><li>Experience in the medical device/neuroendovascular device industry desired. </li><li>Global experience - working, living, and/or extensive travel to different areas of the globe to advance the business. Ability to work with ease with different cultures. </li><li>Strong business acumen. </li><li>Strong collaboration skills. </li><li>Strong experience in project and program management. </li><li>Seasoned presenter with demonstrated facilitation skills in leadership development space</li></ol><p></p>", "responsibilities": "Lead the Center of Excellence globally for Global Talent, including Leadership Development, Talent Management, Succession Planning, Top Talent Development, Performance Management, Coaching, and Organizational Development. Internally design, develop and implement the Global Talent Management strategy. Internally design, develop, and facilitate leadership learning solutions for people managers and individual contributors. Lead a diverse, high-performing team of Global Talent professionals. Provide coaching and development to targeted high performers worldwide. Provide guidance and mentorship to people managers, HRBPs, and business leaders on talent management, including best practices that will best serve their associates and business needs. Lead the end-to-end processes, tools and training for Talent Management, and Performance Management. Partner with internal key stakeholders and HR Partners to effectively implement global solutions that will address business needs and employee development, measure effectiveness, and report results. Provide coaching to targeted high performers. Provide subject matter consultation and expertise to HRBPs and business leaders. Keep up to date with industry developments, technology, and trends to adopt best practices. Leverage business data, engagement/pulse surveys, direct employee feedback, and best practices to influence the learning strategy and employee learning experiences. Oversee the delivery and administration of LinkedIn Learning. Perform ongoing evaluations of current programs to determine effectiveness and manage continuous improvement initiatives. Foster collaborative partnerships with HRBPs and business leaders to have a continuous pulse on the organization, assess talent development needs, create programs, and implement, monitor, and maintain them. Continually develop business acumen and apply organizational knowledge in order to address business and organizational challenges in a targeted, business-oriented manner. Evaluate and monitor the effectiveness of talent programs by analyzing data and providing feedback and/or modifications as needed. Evaluate overall effectiveness of Talent Development processes and systems and adjust as needed.", "qualifications": {"required": "Bachelor’s degree in human resources, Instructional Design, Organizational Psychology, or business-related field. A minimum of fifteen (15) years of professional experience in Talent Development, Talent Management, Leadership, Human Resources, or related field. A minimum of seven (7) years of people management experience. Excellent listening, written, and verbal communication skills. Proficient with MS Word, Excel, PowerPoint, Outlook, and Teams.", "preferred": "Significant experience with internally designing, developing, and implementing leadership and talent management solutions. Significant experience with leadership development, coaching, and succession planning. Ability to analyze and report out data. Experience driving and handling projects while managing multiple stakeholders. Experience in the medical device/neuroendovascular device industry desired. Global experience - working, living, and/or extensive travel to different areas of the globe to advance the business. Ability to work with ease with different cultures. Strong business acumen. Strong collaboration skills. Strong experience in project and program management. Seasoned presenter with demonstrated facilitation skills in leadership development space"}, "skills": ["Leadership Development", "Talent Management", "Succession Planning", "Top Talent Development", "Performance Management", "Coaching", "Organizational Development", "Global Talent Management", "Leadership Learning", "Talent Management Strategy", "Performance Management", "LinkedIn Learning", "Business Acumen", "Project Management", "Program Management", "Facilitation Skills"], "postedDate": "3 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005879047"}