{"jobTitle": "Call Center Specialist", "company": {"name": "Urgently", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "19/hr", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Software Development", "description": "<strong>YOUR MISSION: </strong>Your mission is to enhance partner relationships both internally and externally to deliver best-in-class customer experience. You will own the case until the job has been completed. <p><br/></p><p><strong>YOUR LEGACY: </strong>Your legacy is that you turned a negative customer experience into a positive outcome and expedited the service. This enhanced our relationship with the customer and partner and helped to mend bridges. <strong>The result?</strong> You helped Urgently become the world’s leading mobility assistance company. </p><p><br/></p><p><strong>Must have availability for on of the following shifts below: </strong></p><p>Schedule 1: 08:00 AM - 04:30 PM Monday/Tuesday off </p><p>Schedule 2: 11:00AM - 07:30 PM Monday/Saturday off </p><p>Schedule 3: 01:00 PM - 09:30 PM Wednesday/Thursday off </p><p>Schedule 4: 03:00 PM - 11:30 PM Tuesday/Wednesday off </p><p><br/></p><p><strong>WHAT YOU’LL BE RESPONSIBLE FOR: </strong></p><p><strong>1) Within first 2 months: </strong></p><ul><li>Become cross trained to operate in Urgently’s platform; CSS, Kibana, Hero, Incontact chats. </li><li>Perform outbound calls to customers and stakeholders to address their recent service experience. </li><li>Answering BPO questions. </li><li>Be able to create and handle any job at any point. </li><li>Own the case until job completion. </li><li>Support the team with projects </li></ul><p><strong>2) Within next 4 months: </strong></p><ul><li>Providing feedback to the corresponding team for coaching opportunities. </li><li>Able to make executive decisions when working cases. </li></ul><p><strong>3) Within 6-8 months: </strong></p><ul><li>Aligned with the Partner Managers to continue to build partner relationship </li><li>Elevate the relationship with the partner and customers so the workflow is consistent </li></ul><p><strong>4) Ongoing: </strong></p><ul><li>Ensure workload is being properly executed in a timely manner </li><li>Continue building the foundation with the partner </li><li>Able to take accountability of the work delivered and making independent decisions </li></ul><p><br/></p><p><strong>WHO YOU ARE: </strong></p><ul><li>Minimum of 2 years of experience in negotiation </li><li>Minimum of 2 years of experience in conflict resolution </li><li>Minimum of 1 years of experience in cross functional team collaboration </li><li>Ability to communicate and work with senior leadership </li><li>Ability to critically think through challenging situations </li><li>Proven experience providing clear and effective documentation </li><li>Ability to problem solving with limited information and follow and/or update processes where needed </li><li>Ability to multitask </li><li>Experience prioritizing work and tasks </li></ul><p><br/></p><p>You are the go-to person to get a situation fixed. You have critical thinking skills to know when to follow a prescribed path for resolution, and when to veer off that path due to special circumstances. </p><p><br/></p><p>You have above average communication skills in both written and oral form. You feel comfortable talking to customers, other agents, VIPs, Senior Leadership. You will reactively take on jobs that have taken a wrong turn, and also will look proactively for jobs that may take a wrong turn. Your documentation skills are above average and feel confident in presenting that documentation to Senior Leadership. </p><p> </p><p> </p><p>You have the ability to multitask handling multiple jobs at the same time, and prioritize each job and each step of the job. </p><p>You have grace under fire, and excel under pressure. You enjoy being in a fast paced environment, anything can happen at anytime environment. </p><p> </p><p>You feel comfortable making decisions in a situation that may be vague. </p><p><br/></p><p><strong>THE NITTY GRITTY: </strong></p><ul><li>Location = Great news! You have the option of working from anywhere in the U.S.! Successful candidates for this position must be located outside of California. It is also our expectation that all work for this position will be conducted outside of the state as well. </li><li>Manager = You’ll report to Executive Escalations Supervisor </li><li>Compensation = The base rate for this position is $19/hr. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by job-related skills, experience, and relevant education or training. </li><li>Benefits = At Urgently, we have awesome benefits! We provide short term disability, long term disability, and life insurance to you - all free of charge! We also offer three different medical plans to choose from, two dental plans, a vision plan, and other valuable benefits. You’ll have 12 holidays off and you accrue between 10-20 days of paid time off annually based on your years of service. We match 100% on the first 3% you contribute to our 401(k)and then 50% of the next 2% you contribute. So, if you contribute 5% of your paycheck, we’ll match 4% of that. Free money!</li></ul>", "responsibilities": "Your mission is to enhance partner relationships both internally and externally to deliver best-in-class customer experience. You will own the case until the job has been completed. <p><br/></p><p>Your legacy is that you turned a negative customer experience into a positive outcome and expedited the service. This enhanced our relationship with the customer and partner and helped to mend bridges. <strong>The result?</strong> You helped Urgently become the world’s leading mobility assistance company. </p><p><br/></p><p>Must have availability for on of the following shifts below: </p><p>Schedule 1: 08:00 AM - 04:30 PM Monday/Tuesday off </p><p>Schedule 2: 11:00AM - 07:30 PM Monday/Saturday off </p><p>Schedule 3: 01:00 PM - 09:30 PM Wednesday/Thursday off </p><p>Schedule 4: 03:00 PM - 11:30 PM Tuesday/Wednesday off </p><p><br/></p><p><strong>WHAT YOU’LL BE RESPONSIBLE FOR: </strong></p><p><strong>1) Within first 2 months: </strong></p><ul><li>Become cross trained to operate in Urgently’s platform; CSS, Kibana, Hero, Incontact chats. </li><li>Perform outbound calls to customers and stakeholders to address their recent service experience. </li><li>Answering BPO questions. </li><li>Be able to create and handle any job at any point. </li><li>Own the case until job completion. </li><li>Support the team with projects </li></ul><p><strong>2) Within next 4 months: </strong></p><ul><li>Providing feedback to the corresponding team for coaching opportunities. </li><li>Able to make executive decisions when working cases. </li></ul><p><strong>3) Within 6-8 months: </strong></p><ul><li>Aligned with the Partner Managers to continue to build partner relationship </li><li>Elevate the relationship with the partner and customers so the workflow is consistent </li></ul><p><strong>4) Ongoing: </strong></p><ul><li>Ensure workload is being properly executed in a timely manner </li><li>Continue building the foundation with the partner </li><li>Able to take accountability of the work delivered and making independent decisions </li></ul><p><br/></p>", "qualifications": {"required": "Minimum of 2 years of experience in negotiation, Minimum of 2 years of experience in conflict resolution, Minimum of 1 years of experience in cross functional team collaboration, Ability to communicate and work with senior leadership, Ability to critically think through challenging situations, Proven experience providing clear and effective documentation, Ability to problem solving with limited information and follow and/or update processes where needed, Ability to multitask, Experience prioritizing work and tasks"}, "skills": ["Negotiation", "Conflict Resolution", "Team Collaboration", "Communication", "Critical Thinking", "Documentation", "Problem Solving", "Multitasking", "Prioritization"], "postedDate": "2 hours ago", "benefits": "At Urgently, we have awesome benefits! We provide short term disability, long term disability, and life insurance to you - all free of charge! We also offer three different medical plans to choose from, two dental plans, a vision plan, and other valuable benefits. You’ll have 12 holidays off and you accrue between 10-20 days of paid time off annually based on your years of service. We match 100% on the first 3% you contribute to our 401(k)and then 50% of the next 2% you contribute. So, if you contribute 5% of your paycheck, we’ll match 4% of that. Free money!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005883860"}