{"jobTitle": "Chief Executive Officer (CEO) - Hospitality Industry", "company": {"name": "East 57th Street Partners", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "$375,000.00 - $450,000.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Business Consulting and Services and Venture Capital and Private Equity Principals", "description": "Chief Executive Officer (CEO) - Hospitality Industry\n<strong>Company:</strong> East 57th Street Partners\n<strong>Client:</strong> Prominent Private Equity Firm\n<strong>Location:</strong> Major Metro US Market (Travel Required: 25-40% Monthly)\n<strong>About East 57th Street Partners:</strong>\nEast 57th Street Partners is a premier management consulting firm specializing in executive search and strategic advisory services. We partner with leading organizations to identify and place top-tier executive talent.\n<strong>About Our Client:</strong>\nOur client is a prominent private equity firm looking to secure a Chief Executive Officer (CEO) for one of their portfolio companies in the hospitality industry. This role is critical for driving the company's overall strategy, operational efficiency, and long-term growth.\n<strong>Position Overview:</strong>\nAs the CEO, you will be responsible for the overall strategic direction and leadership of the hospitality company. You will leverage your extensive experience in the hospitality industry to drive performance, optimize operations, and spearhead growth initiatives. This role requires a dynamic leader capable of navigating the complexities of a PE-backed environment.\n<strong>Key Responsibilities:</strong>\n<ul><li>Lead the strategic direction and operations of the hospitality company, ensuring alignment with business goals.</li><li>Oversee all aspects of the business, including finance, operations, marketing, and sales.</li><li>Drive strategic growth initiatives, including mergers, acquisitions, and market expansion.</li><li>Optimize operational performance, ensuring efficiency and profitability.</li><li>Implement and maintain robust corporate governance and internal controls.</li><li>Collaborate with the private equity firm to align on strategic objectives and performance targets.</li><li>Provide visionary leadership to the executive team and foster a high-performance culture.</li><li>Ensure timely and accurate reporting to stakeholders, including the private equity firm.</li><li>Represent the company in industry forums and build strong relationships with key stakeholders.</li><li>Mentor and develop senior leadership team members, driving professional growth and organizational success.</li></ul>\n<strong>Qualifications:</strong>\n<ul><li>Bachelor’s degree in business, finance, or a related field; MBA preferred.</li><li>Extensive experience in executive leadership within the hospitality industry.</li><li>Proven track record as a CEO or senior executive in a PE-backed company.</li><li>Strong understanding of hospitality operations and market dynamics.</li><li>Exceptional strategic thinking, leadership, and problem-solving skills.</li><li>Excellent communication and interpersonal skills.</li><li>Ability to manage multiple priorities and work effectively under pressure.</li><li>Willingness to travel 25-40% monthly to company locations and stakeholder meetings.</li></ul>\n<strong>Compensation and Benefits:</strong>\n<ul><li>Competitive base salary ranging from $375,000 to $450,000 per year, depending on experience.</li><li>Performance-based bonuses.</li><li>Possible equity participation depending on experience.</li><li>Comprehensive benefits package, including health, dental, and vision insurance.</li><li>Retirement plan options.</li><li>Relocation assistance for qualified candidates.</li></ul>", "responsibilities": "Lead the strategic direction and operations of the hospitality company, ensuring alignment with business goals. Oversee all aspects of the business, including finance, operations, marketing, and sales. Drive strategic growth initiatives, including mergers, acquisitions, and market expansion. Optimize operational performance, ensuring efficiency and profitability. Implement and maintain robust corporate governance and internal controls. Collaborate with the private equity firm to align on strategic objectives and performance targets. Provide visionary leadership to the executive team and foster a high-performance culture. Ensure timely and accurate reporting to stakeholders, including the private equity firm. Represent the company in industry forums and build strong relationships with key stakeholders. Mentor and develop senior leadership team members, driving professional growth and organizational success.", "qualifications": {"required": "Bachelor’s degree in business, finance, or a related field; MBA preferred. Extensive experience in executive leadership within the hospitality industry. Proven track record as a CEO or senior executive in a PE-backed company. Strong understanding of hospitality operations and market dynamics. Exceptional strategic thinking, leadership, and problem-solving skills. Excellent communication and interpersonal skills. Ability to manage multiple priorities and work effectively under pressure. Willingness to travel 25-40% monthly to company locations and stakeholder meetings."}, "skills": [], "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "Competitive base salary ranging from $375,000 to $450,000 per year, depending on experience. Performance-based bonuses. Possible equity participation depending on experience. Comprehensive benefits package, including health, dental, and vision insurance. Retirement plan options. Relocation assistance for qualified candidates.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/4005871686"}