{"jobTitle": "Director External Communications", "company": {"name": "Macy's", "location": "New York City Metropolitan Area"}, "location": "New York City Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$149,280- $249,000", "currency": "USD"}, "jobFunction": "Advertising, Public Relations, and Writing/Editing", "industry": "Public Relations and Communications Services", "description": "Director, External Communications\nNew York, NY, United States\nFull time Schedule\n$149,280- $249,000\nAnnually*\n* based on job, location, and schedule\n<br/>\nJob Description\n<u>Bring Your Amazing Self to Work</u>\nAt Macy's, Inc. we're on a mission to create a brighter future with bold representation for all. This is our Mission Every One. We know that each person here is unique. So we respect and invest in each individual to create growth, pride, and satisfaction. If we are able to bring our whole selves to work, it translates into a more abundant and wider array of ideas and energy for all to benefit from. Our success will be built on amazing colleagues, working together.\n<br/>\n<u>Job Overview</u>\nThe Director, External Communications for Macy’s, Inc. is a leader with 12-years minimum of experience in communications or related field. The role is reserved for a tenured individual who has a proven track record of being able to pivot into new industries and sectors seamlessly. This person can organically flex between corporate-level priorities and nameplate initiatives and can deliver on strategy development, content development, pitching/responding to media, reputation/issues management, consumer public relations, crisis communications, thought leadership, and corporate and executive positioning.\nThe Director is an avid collaborator and partners well with other communications experts along with cross-functionally. This individual can develop and implement relevant strategies and tactics for communications including media training, speaking engagements, spokespeople positioning, recognition, awards, etc.\nThis person is energetic, highly motivated, conscientious, and detail-oriented – a driven leader who takes initiative in developing new ideas and solving issues. This candidate is a high-potential executive who displays strong leadership skills, is proactive and aggressive in driving programs from start to finish and is dedicated to championing the company's business objectives and delivering performance results.\nAs a passionate storyteller, this person embraces flexing to engage with a range of priority stakeholders (i.e. investors, B2B, partners, and potential corporate colleagues) on key company narratives, initiatives, and priorities as part of a year-round communications strategy.\nThis role reports to the Vice President, External Communications.\nThis position is hybrid, based in New York.\n<br/>\n<u>What You Will Do</u>\nThis Director role includes, but are not limited to, the following aspects:\n<ul><li>Flex between protecting and preserving corporate reputation for Macy’s, Inc. and garnering consumer PR for Macy’s to establish greater brand love and relevancy (and alignment) at the national, regional, and local level.</li><li>As a senior communicator, this individual will be a company spokesperson.</li><li>Responsible for providing strategic communications counsel based on robust knowledge of internal and external environments and developing/ implementing effective communications strategy and plans with their team and the larger department to support company goals and major programs.</li><li>Cultivating strong relationships with all levels of leadership internally and externally, including agencies, partners, vendors, community organizations, key media, influencers, etc.</li><li>Contributing to key internal communications channels such as the daily media report, Now Trending newsletter, colleague portal and Macy’s, Inc. social media.</li><li>Effective people leader and helps develop and mentor External Communications direct reports and junior staff.</li><li>Supporting special projects across External Communications pillars and in markets as needed.</li><li>Supporting the wider External Communications team with on-site execution of communications plans in New York City during select holidays and major initiatives inclusive of select nights, weekends, in support of Macy’s Thanksgiving Day Parade, Macy’s 4th of July Fireworks, Macy’s Flower Show, Macy's Holiday events, Black Friday, etc.</li></ul><br/>\n<u>Skills You Will Need</u>\nStrategic Communication Skills\n<ul><li>Expert Writing and Language Proficiency: Ability to craft and edit communications plans, press materials, executive messaging, and presentations with precision and clarity.</li><li>Digital and Social Media Savvy: Strong understanding of digital and social media platforms, with a passion for leveraging these tools for corporate communications.</li><li>Crisis Communications and Reputation Management: Extensive experience in handling high-pressure situations, with sound judgment and the ability to navigate crisis communications effectively.</li></ul>\nLeadership and Collaboration\n<ul><li>People Leadership and Mentorship: Proven ability to lead, mentor, and develop direct reports and junior staff within the External Communications team.</li><li>Cross-Functional Collaboration: Skilled at building and maintaining strong relationships with leadership, agencies, partners, vendors, community organizations, media, and influencers.</li><li>Spokesperson Expertise: Experience serving as a company spokesperson, with the ability to represent the company effectively to various stakeholders.</li></ul>\nTechnical Proficiency\n<ul><li>Advanced Microsoft Office Skills: Proficient in using Microsoft Office Suite and other software programs for authoring, editing, and designing dynamic content, including Q&amp;As, press releases, media assets, presentations, and more.</li><li>Content Creation: Capable of producing high-quality content for senior leadership and business partners, including speeches, talking points, social media posts, and media segments.</li></ul>\nEvent and Special Project Support\n<ul><li>Event Execution: Experience supporting on-site execution of communications plans during major initiatives and events such as Macy’s Thanksgiving Day Parade, Macy’s 4th of July Fireworks, and others.</li><li>Project Management: Skilled at managing special projects across various External Communications pillars and markets as needed.</li></ul>\n<u> </u>\n<u>Who You Are</u>\n<ul><li>Dedicated to fulfilling ideals of diversity, inclusion, and respect that Macy’s aspires to achieve every day in every way.</li><li>Candidates with a bachelor’s degree or equivalent work experience in Communications are encouraged to apply. 12+ years of experience in Communications, Media Relations, or related field. Background in or knowledge of retail, technology, entertainment, fashion merchandising, or other consumer business.</li><li>Regularly required to sit, talk, hear; use hands/fingers to touch, handle, and feel. Occasionally required to move about the workplace and reach with hands and arms. Requires close vision.</li><li>Able to work a flexible schedule, including days, evenings, weekends, and holidays, based on department and company needs. Working during major business initiatives (July 4th, Thanksgiving Day, Black Friday, etc.) is expected.</li><li>Able to travel domestically for key company initiatives.</li></ul><br/>\n<u>What We Can Offer You</u>\n<ul><li>An inclusive, challenging, and refreshingly fun work environment</li><li>Competitive pay and benefits rooted in principles of equity</li><li>Performance incentives and annual merit review</li><li>Merchandise discounts</li><li>Health and Wellness Benefits across medical, dental, vision, and additional insurance</li><li>Retirement Savings Plan with 401k match opportunity</li><li>Employee Assistance Program (mental health counseling and legal/financial advice)</li><li>Resources for continuous learning, career growth, and leadership development</li><li>8 paid holidays</li><li>Paid Time Off (first year prorated depending on start date)</li><li>Tuition reimbursement program</li><li>Guild education benefit funds 100% of tuition, books, and fees in designated programs</li><li>Colleague Resource Groups (CRGs) and give-back/volunteer opportunities</li><li>Empowerment and autonomy to perform impactful work with tangible results</li></ul><br/>\n<u>About Macy’s</u>\nNow is an exciting time for a Macy's career as we continue to focus on creating exciting and memorable experiences for every Macy's customer, whether their journey starts online or in the store. Our opportunities in Sales, Merchandise, Operations, Customer Service, Warehouse, Marketing, and other areas let you express your creativity and commitment to excellence, grow your career and make a difference to your Macy's colleagues and customers.\nBring your creativity, energy, and ideas to the Macy's team – Apply Today!\nThis job description is not all-inclusive. Macy's, Inc. reserves the right to amend this job description at any time. Macy's, Inc. is an Equal Opportunity Employer, committed to a diverse and inclusive work environment.\n<br/>\nCORP00\n<br/>\n<br/>\nThis position may be eligible for performance-based incentives/bonuses. Benefits include 401k, medical/vision/dental/life/disability insurance options, PTO accruals, Holidays, and more. Eligibility requirements may apply based on location, job level, classification, and length of employment. Click here to see details on benefits.\n", "responsibilities": "The Director, External Communications for Macy’s, Inc. is a leader with 12-years minimum of experience in communications or related field. The role is reserved for a tenured individual who has a proven track record of being able to pivot into new industries and sectors seamlessly. This person can organically flex between corporate-level priorities and nameplate initiatives and can deliver on strategy development, content development, pitching/responding to media, reputation/issues management, consumer public relations, crisis communications, thought leadership, and corporate and executive positioning.\nThe Director is an avid collaborator and partners well with other communications experts along with cross-functionally. This individual can develop and implement relevant strategies and tactics for communications including media training, speaking engagements, spokespeople positioning, recognition, awards, etc.\nThis person is energetic, highly motivated, conscientious, and detail-oriented – a driven leader who takes initiative in developing new ideas and solving issues. This candidate is a high-potential executive who displays strong leadership skills, is proactive and aggressive in driving programs from start to finish and is dedicated to championing the company's business objectives and delivering performance results.\nAs a passionate storyteller, this person embraces flexing to engage with a range of priority stakeholders (i.e. investors, B2B, partners, and potential corporate colleagues) on key company narratives, initiatives, and priorities as part of a year-round communications strategy.\nThis role reports to the Vice President, External Communications.\nThis position is hybrid, based in New York.", "qualifications": {"required": "Candidates with a bachelor’s degree or equivalent work experience in Communications are encouraged to apply. 12+ years of experience in Communications, Media Relations, or related field. Background in or knowledge of retail, technology, entertainment, fashion merchandising, or other consumer business.", "preferred": ""}, "skills": ["Writing", "Public Relations", "Media Relations", "Crisis Communications", "Reputation Management", "Digital Marketing", "Social Media", "Leadership", "Mentorship", "Collaboration", "Microsoft Office", "Content Creation", "Event Management", "Project Management"], "postedDate": "1 hour ago", "benefits": "Competitive pay and benefits rooted in principles of equity\nPerformance incentives and annual merit review\nMerchandise discounts\nHealth and Wellness Benefits across medical, dental, vision, and additional insurance\nRetirement Savings Plan with 401k match opportunity\nEmployee Assistance Program (mental health counseling and legal/financial advice)\nResources for continuous learning, career growth, and leadership development\n8 paid holidays\nPaid Time Off (first year prorated depending on start date)\nTuition reimbursement program\nGuild education benefit funds 100% of tuition, books, and fees in designated programs\nColleague Resource Groups (CRGs) and give-back/volunteer opportunities\nEmpowerment and autonomy to perform impactful work with tangible results", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005917577"}