{"jobTitle": "Junior Manager, Influencer", "company": {"name": "CGC", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$50,000 - $70,000", "currency": "USD"}, "industry": "Public Relations and Communications Services", "description": "CGC NYC is looking for a brilliant and visionary Junior Manager to join its influencer team in the US. This role would be responsible for supporting the Senior Manager in all influencer activities, inclusive of paid, organic, event and partnership support, across the full client portfolio. \n\nCGC is a modern brand building communications agency, spanning Brand Communications, Influencer and Talent representation, with offices in London and New York. CGC represents the Global leading power brands &amp; Talent within the beauty industry. \n\nCGC’s desirable client roster in London includes Hermès parfum &amp; beauty, Augustinus Bader, Rose Inc, Glossier, Hershesons, The Nue Co., Summer Fridays, Youth to The People, Trudon, OUAI, Westman Atelier. The CGC NYC roster includes Anastasia Beverly Hills, Sarah Creal Beauty, r.e.m. beauty, SLIP, Westman Atelier and Summer Fridays.\n\n \n\nThe ideal candidate will be a self-starter with at least 2-3 years agency/ In-house experience in the beauty industry. Understanding and experience of the influencer landscape is recommended. CGC NYC has a hybrid work model and works out of the NYC office 3 days a week. \n\n\n**INFLUENCER**\n\n\n<ul><li>Assist Senior Manager by sourcing relevant profiles for paid and organic activations across the CGC portfolio</li><li>Research specific profiles to introduce new talent into the CGC roster, ensuring profiles meet brand objectives and reach the relevant audience demographic</li><li>Support team in admin for both external (client) and internal (agency) needs</li><li>Maintain individual client influencer lists, ensuring consistent core seeding to new and relevant profiles, in partnership with Senior Manager</li><li>Share recommendations to support seasonal moments with influencers and ensure reactive seeding for relevant brands</li><li>Assist Senior Manager in facilitating paid influencer projects across the CGC client portfolio by sourcing profiles, writing briefs, collecting analytics and creating post campaign overviews. </li><li>Utilize Tribe Dynamics for influencer management, tracking, and reporting.</li><li>Attention to detail and organization is key</li><li>Role may require light support of press team in media activations and events</li></ul>\n\n\nSalary range - $50,000 - $70,000 per annum", "responsibilities": "Assist Senior Manager by sourcing relevant profiles for paid and organic activations across the CGC portfolio\nResearch specific profiles to introduce new talent into the CGC roster, ensuring profiles meet brand objectives and reach the relevant audience demographic\nSupport team in admin for both external (client) and internal (agency) needs\nMaintain individual client influencer lists, ensuring consistent core seeding to new and relevant profiles, in partnership with Senior Manager\nShare recommendations to support seasonal moments with influencers and ensure reactive seeding for relevant brands\nAssist Senior Manager in facilitating paid influencer projects across the CGC client portfolio by sourcing profiles, writing briefs, collecting analytics and creating post campaign overviews. \nUtilize Tribe Dynamics for influencer management, tracking, and reporting.\nAttention to detail and organization is key\nRole may require light support of press team in media activations and events", "postedDate": "4 hours ago", "skills": ["Influencer Marketing", "Social Media", "Public Relations", "Brand Management", "Communication", "Marketing", "Media Relations", "Event Management", "Talent Management", "Tribe Dynamics"], "url": "https://www.linkedin.com/jobs/view/4005860841"}