{"jobTitle": "Executive Assistant", "company": {"name": "Atlantic Group", "location": "United States"}, "location": "United States", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Not Applicable", "salary": {"amount": "18.00/hr - 22.00/hr", "currency": "USD"}, "jobFunction": "Administrative, Customer Service, and Consulting", "industry": "Staffing and Recruiting, IT Services and IT Consulting, and Computer and Network Security", "description": "An exciting contract opportunity to join a highly sought-after software company. The ideal candidate will provide top-level assistance for senior leadership. They should be well-organized and be comfortable scheduling meetings and responding to emails on the executive's behalf. Lastly, this individual should be able to draft documents and help the executive with any necessary meeting preparations. The candidate must be able to work PST hours.  Responsibilities Calendar management for executives Aid executive in preparing for meetings Responding to emails and document requests on behalf of executives Draft slides, meeting notes and documents for executives Qualifications Bachelor's degree or equivalent experience 3+ years EA experience Proficient in Microsoft Office suite Google Workspace, Slack, Zoom Experience in managing multiple priorities, administrative coordination, and logistics Well-organized, detail-oriented, ability to multi-task with great follow-up skills Strong written and verbal communication skills", "responsibilities": "Calendar management for executives, Aid executive in preparing for meetings, Responding to emails and document requests on behalf of executives, Draft slides, meeting notes and documents for executives", "qualifications": {"required": "Bachelor's degree or equivalent experience, 3+ years EA experience, Proficient in Microsoft Office suite, Google Workspace, Slack, Zoom, Experience in managing multiple priorities, administrative coordination, and logistics, Well-organized, detail-oriented, ability to multi-task with great follow-up skills, Strong written and verbal communication skills", "preferred": ""}, "skills": ["Microsoft Office", "Google Workspace", "Slack", "Zoom", "Calendar Management", "Meeting Preparation", "Email Management", "Document Drafting"], "postedDate": "2 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005867927"}