{"jobTitle": "Sr Executive Coach / Corporate Trainer / Instructional Designer", "company": {"name": "Technogen, Inc.", "location": "Washington, DC"}, "location": "Washington, DC", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "IT Services and IT Consulting", "description": "<em>TECHNOGEN, Inc. is a Proven Leader in providing full IT Services, Software Development and Solutions for 15 years. <br/><br/></em><em>TECHNOGEN is a Small &amp; Woman Owned Minority Business with GSA Advantage Certification. We have offices in VA; MD &amp; Offshore development centers in India. We have successfully executed 100+ projects for clients ranging from small business and non-profits to Fortune 50 companies and federal, state and local agencies.<br/><br/></em><strong>Position: Senior Executive Coach / Corporate Trainer / Instructional Designer<br/><br/>Location: Washington DC<br/><br/>Duration: 2-3 months+ Contract <br/><br/></strong><strong>Job Description<br/><br/></strong>Prior experience in US Federal training . Trainer needed for US Federal space.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Conduct one-on-one coaching sessions with senior leaders and executives.</li><li> Assess clients' strengths, weaknesses, and areas for development.</li><li> Develop personalized coaching plans tailored to each client's needs and goals.</li><li> Provide ongoing support, feedback, and accountability to clients.</li><li> Use a variety of coaching techniques and tools to facilitate client growth.</li><li> Help clients develop leadership skills and improve their performance.</li><li> Assist clients in setting and achieving professional goals.</li><li> Build strong, trusting relationships with clients.</li><li> Maintain confidentiality and professionalism at all times.</li><li> Stay up-to-date with the latest coaching methodologies and best practices.</li><li> Facilitate group coaching sessions and workshops as needed.</li><li> Collaborate with other coaches and team members to provide comprehensive support.</li><li> Track and measure client progress and adjust coaching plans as needed.</li><li> Provide clients with resources and tools to support their development.</li><li> Help clients navigate challenges and overcome obstacles.</li><li> Encourage clients to take ownership of their development and growth.</li><li> Promote a positive and supportive coaching environment.</li><li> Continuously improve your coaching skills and knowledge.</li><li> Participate in professional development opportunities and training.</li><li> Contribute to the overall success of the coaching program.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li> Proven experience as an Executive Coach or similar role.</li><li> Strong understanding of business and leadership principles.</li><li> Excellent communication and interpersonal skills.</li><li> High level of emotional intelligence and empathy.</li><li> Ability to build strong, trusting relationships with clients.</li><li> Strong problem-solving and critical-thinking skills.</li><li> Ability to work independently and as part of a team.</li><li> Experience with a variety of coaching techniques and tools.</li><li> Ability to maintain confidentiality and professionalism.</li><li> Strong organizational and time-management skills.</li><li> Ability to assess clients' strengths and areas for development.</li><li> Experience developing personalized coaching plans.</li><li> Ability to provide constructive feedback and support.</li><li> Strong facilitation and presentation skills.</li><li> Commitment to continuous learning and professional development.</li><li> Ability to track and measure client progress.</li><li> Experience working with senior leaders and executives.</li><li> Ability to adapt coaching style to meet clients' needs.</li><li> Passion for helping others succeed.</li><li> Relevant coaching certification or accreditation is a plus.<br/><br/></li></ul><strong>Best Regards,<br/><br/></strong>Ashok Kumar<br/><br/>Sr. Talent Acquisition Specialist<br/><br/>Phone: 443-832-6103<br/><br/>Email: ashok.c@technogeninc.com<br/><br/>Web: www.technogeninc.com<br/><br/>4229 Lafayette Center Dr, Suite 1880, Chantilly, VA 20151", "responsibilities": "Conduct one-on-one coaching sessions with senior leaders and executives. Assess clients' strengths, weaknesses, and areas for development. Develop personalized coaching plans tailored to each client's needs and goals. Provide ongoing support, feedback, and accountability to clients. Use a variety of coaching techniques and tools to facilitate client growth. Help clients develop leadership skills and improve their performance. Assist clients in setting and achieving professional goals. Build strong, trusting relationships with clients. Maintain confidentiality and professionalism at all times. Stay up-to-date with the latest coaching methodologies and best practices. Facilitate group coaching sessions and workshops as needed. Collaborate with other coaches and team members to provide comprehensive support. Track and measure client progress and adjust coaching plans as needed. Provide clients with resources and tools to support their development. Help clients navigate challenges and overcome obstacles. Encourage clients to take ownership of their development and growth. Promote a positive and supportive coaching environment. Continuously improve your coaching skills and knowledge. Participate in professional development opportunities and training. Contribute to the overall success of the coaching program.", "qualifications": {"required": "Proven experience as an Executive Coach or similar role. Strong understanding of business and leadership principles. Excellent communication and interpersonal skills. High level of emotional intelligence and empathy. Ability to build strong, trusting relationships with clients. Strong problem-solving and critical-thinking skills. Ability to work independently and as part of a team. Experience with a variety of coaching techniques and tools. Ability to maintain confidentiality and professionalism. Strong organizational and time-management skills. Ability to assess clients' strengths and areas for development. Experience developing personalized coaching plans. Ability to provide constructive feedback and support. Strong facilitation and presentation skills. Commitment to continuous learning and professional development. Ability to track and measure client progress. Experience working with senior leaders and executives. Ability to adapt coaching style to meet clients' needs. Passion for helping others succeed.", "preferred": "Relevant coaching certification or accreditation is a plus."}, "skills": ["Executive Coaching", "Leadership Development", "Performance Management", "Communication", "Interpersonal Skills", "Emotional Intelligence", "Problem Solving", "Critical Thinking", "Teamwork", "Coaching Techniques", "Confidentiality", "Organizational Skills", "Time Management", "Needs Assessment", "Personalized Coaching Plans", "Constructive Feedback", "Facilitation", "Presentation Skills", "Professional Development", "Progress Tracking", "Senior Leadership", "Coaching Style Adaptation"], "postedDate": "19 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005862909"}