{"jobTitle": "Director of Manufacturing Operations", "company": {"name": "Confidential", "location": "Dallas-Fort Worth Metroplex"}, "location": "Dallas-Fort Worth Metroplex", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Manufacturing", "industry": "Computers and Electronics Manufacturing and Appliances, Electrical, and Electronics Manufacturing", "description": "We are in search of a seasoned Director of Manufacturing Operations in the Dallas, Texas area for an international growing company in the Electronics industry.\n\nThis position is an onsite role, reporting to the COO of the company and managing full P&L responsibilities.\n\nThis individual will be responsible for leading the turnaround of the operation towards the next performing level, enhancing the cost effectiveness of the organization, as well as driving sustainable growth aligned to company goals and expectations. The Director of Operations will drive the day-to-day business operation in a high pace and complex environment, ensuring effective and efficient use of facilities, resources, and staff. Applicants must have a proven track of Plant Leadership experience, managing all areas in the operation.\n\n**Duties/Responsibilities**\n\n* Oversees the manufacture of products, ensuring production, performance, and quality standards are consistently met\n* Reviews production reports to ensure safety, quality, financial, and delivery goals and standards are met\n* Ensures a healthy and safe working environment, and compliance with federal and state regulations, through collaboration with environmental, health, and safety staff\n* Assists chief operating officer with long-range operating goals, expansion efforts, and implementation of new and advanced technology\n* Identifies and shares training opportunities for staff to build and improve skills\n* Organizes departmental management structure and teams for optimal, efficient operations\n* Works with chief financial officer to develop operating budget\n* Delivers progress and production reports to executive team members as requested\n* Supervises equipment purchase, maintenance, and layout\n* Performs other related duties as assigned\n\n**Requirements**\n\n* Bachelors degree in a relevant field required; Masters degree preferred\n* At least ten years of hands-on experience in industrial management within the Electronics industry\n* Excellent verbal and written communication skills\n* Excellent organizational and managerial skills\n* Thorough understanding of the policies and practices used in the manufacturing division\n* Ability to set long-term goals and communicate them to others\n* Ability to motivate and organize multiple efforts to accomplish goals", "postedDate": "1 hour ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005940497"}