{"jobTitle": "Patient Access Specialist", "company": {"name": "WorkPath Partners", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Customer Service", "industry": "Pharmaceutical Manufacturing", "description": "We are looking for a Patient Access Specialist to join our growing team. You will be offered a competitive hourly rate of $17 / hour. We will also provide you a comprehensive benefits package.\n\nAs a Patient Access Specialist you will be providing advanced services to patients, providers, and caregivers on behalf of patients for a specific manufacturer sponsored program or set of programs.\n\nResponsibilities of the Patient Access Specialist:\n1. Provides advanced services to patients, providers and caregivers. Services could include but not limited to:\n\n* Billing and coding support\n* Claims assistance, tracking and submission\n* Prior authorization assistance and tracking\n* Coordination of benefits\n* Benefit verification result call\n* Welcome calls\n* Advanced alternate coverage research\n* Appeals/Denials\n* Intakes and reports adverse events as directed.\n\n2. Provides exceptional customer service to internal and external customers; resolves any customer requests in a timely and accurate manner; escalates complaints accordingly.\n\n3. Establishes themselves as regional experts regarding payer trends and reports any reimbursement trends/delays to management team (e.g. billing denials, claim denials, pricing errors, payments, etc.).\n\n4. Processes any necessary correspondence.\n\n5. Coordinates with internal and external service providers to ensure services are performed in accordance with program policy and within expected service level agreements (SLA).\n\n6. Maintains confidentiality in regards to all patient sensitive information.\n\n7. Works on problems of moderate scope where analysis of data requires a review of a variety of factors. Exercises judgment within defined standard operating procedures to determine appropriate action.\n\n8. Required to be self-motivated, working from a queue (phone or system). Expected to perform work in accordance with defined standard operating procedures. Management will monitor queues and provide active feedback as required.\n\n9. Performs related duties as assigned, could include well defined services generally performed by other program representatives (e.g. benefit verifications, PAP determinations).", "postedDate": "3 hours ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005870766"}