{"jobTitle": "Virtual Onboarding Manager", "company": {"name": "LC EXCLUSIVE", "location": "Houston, TX"}, "location": "Houston, TX", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "We are seeking a dedicated and experienced Virtual Onboarding Manager to join our team who love to help others. As a Virtual Onboarding Manager, you will play a pivotal role in ensuring a smooth transition for new team members into our organization, regardless of their geographic location. You will be responsible for delivering engaging virtual onboarding programs, equipping new employees with the knowledge, tools, and support they need to excel in their roles.OtherDuties include arranging transportation, accommodations, and entertainment for families, couples and individual travelers.<br/><br/><strong><strong>Key Responsibilities:<br/><br/></strong></strong><ul><li>Develop engaging and interactive training materials, including e-learning modules, presentations, videos, and documentation to facilitate the onboarding process</li><li> Host live virtual onboarding sessions using video conferencing and online collaboration tools, offering opportunities for interaction and Q&amp;A</li><li>Provide ongoing support and resources to new agents, answering questions and addressing any concerns</li><li>Present, promote and sell packages using proven sales techniques to prospective customer</li><li>Ability to interact, communicate and negotiate effectively</li><li>Address customer inquiries in a positive, friendly manner</li><li>Collaborate with other departments to develop workable business solutions to customer satisfaction issues<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Excellent interpersonal communication skills</li><li>Previous experience in customer service or hospitality also a plus, but not required</li><li>Strong communication and presentation skills</li><li>A high school diploma or GED equivalently</li><li>Ability to develop engaging and interactive training materials</li><li>Excellent organizational and project management skills<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Flexible schedule</li><li>Agents Discounts</li><li>On-the-job training</li><li>Company Perks</li><li>Work from home opportunity</li><li>Bonus &amp; dailypay</li><li>Generous commissions and incredible business opportunity!</li><li>If you are passionate about travel and helping new agents succeed and thrive within our organization and have the necessary qualifications, we encourage you to apply<br/><br/></li></ul>We are an equal opportunity employer, and we welcome candidates from all backgrounds to apply.<br/><br/>Powered by JazzHR<br/><br/>g4FsbdGjzd", "jobFunction": "Human Resources", "industry": "Internet Publishing", "postedDate": "4 hours ago", "skills": [], "benefits": "Flexible schedule, Agents Discounts, On-the-job training, Company Perks, Work from home opportunity, Bonus & dailypay, Generous commissions and incredible business opportunity!", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005865485"}