{"jobTitle": "Director of Partnerships (Sports & Entertainment!!)", "company": {"name": "The Greene Group", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$100,000.00/yr - $175,000.00/yr", "currency": "USD"}, "jobFunction": "Finance, Accounting/Auditing, and Project Management", "industry": "Entertainment Providers, Musicians, and Spectator Sports", "description": "<strong>About the Company:</strong>\n<p>Our client is one of the leading entertainment companies that is taking over the live-event industry. As they continue to expand their nationwide footprint, they're looking for a new <strong>Director of Partnerships</strong> that can bring on some exciting new logos!! This is a newly-created role with UNCAPPED COMMISSIONS!!!</p>\n<p><br/></p>\n<p><strong>*** MUST HAVE SPORTS / MUSIC / LIVE EVENT SPONSORSHIP EXPERIENCE ***</strong></p>\n<p><br/></p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Identify potential sponsors based on the event properties or clients.</li>\n<li>Conduct sales outreach, targeting new potential partners, previous clients, and your personal network.</li>\n<li>Create and deliver compelling presentations and pitches tailored to specific prospects.</li>\n<li>Develop, package, and sell sponsorship solutions for events and clients.</li>\n<li>Devise strategies to capture the attention of key decision-makers among prospective sponsors.</li>\n<li>Tailor sales pitches and proposals dynamically to align with the specific interests and preferences of clients.</li>\n<li>Collaborate with the Director of Sponsorship to ensure a smooth transition from sales pitch to client/account management.</li>\n<li>After securing a sale, develop partnership briefs and action plans for the activation, account management, and marketing teams to implement.</li>\n<li>Take responsibility for achieving and surpassing annual revenue targets, emphasizing relationship-building with major brands.</li>\n<li>Work closely with the Senior Director of Partnerships, Head of Production, and Co-Founders to identify sponsorship assets and opportunities.</li>\n<li>Oversee select external sales team members to drive new revenue streams.</li>\n<li>Build and maintain strong relationships with key decision-makers at client marketing companies and their advertising agencies.</li>\n<li>Structure, price, and successfully negotiate deals to closure.</li>\n<li>Provide direction to the marketing team for executing sponsor campaigns, including branded content creation, copywriting, and sponsored social media posts.</li>\n<li>Collaborate with the Director of Finance and Director of Legal to manage sponsor contracts, invoicing, and accounts receivable.</li>\n</ul>\n<p><br/></p>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>MUST have 5+ years of experience with corporate partnerships in sports/entertainment industry</li>\n<li>Willingness to travel to events throughout the year</li>\n<li>Excellent verbal and written communication skills, with the proven ability to communicate effectively cross-functionally</li>\n</ul>", "responsibilities": "Identify potential sponsors based on the event properties or clients. Conduct sales outreach, targeting new potential partners, previous clients, and your personal network. Create and deliver compelling presentations and pitches tailored to specific prospects. Develop, package, and sell sponsorship solutions for events and clients. Devise strategies to capture the attention of key decision-makers among prospective sponsors. Tailor sales pitches and proposals dynamically to align with the specific interests and preferences of clients. Collaborate with the Director of Sponsorship to ensure a smooth transition from sales pitch to client/account management. After securing a sale, develop partnership briefs and action plans for the activation, account management, and marketing teams to implement. Take responsibility for achieving and surpassing annual revenue targets, emphasizing relationship-building with major brands. Work closely with the Senior Director of Partnerships, Head of Production, and Co-Founders to identify sponsorship assets and opportunities. Oversee select external sales team members to drive new revenue streams. Build and maintain strong relationships with key decision-makers at client marketing companies and their advertising agencies. Structure, price, and successfully negotiate deals to closure. Provide direction to the marketing team for executing sponsor campaigns, including branded content creation, copywriting, and sponsored social media posts. Collaborate with the Director of Finance and Director of Legal to manage sponsor contracts, invoicing, and accounts receivable.", "qualifications": {"required": "MUST have 5+ years of experience with corporate partnerships in sports/entertainment industry Willingness to travel to events throughout the year Excellent verbal and written communication skills, with the proven ability to communicate effectively cross-functionally"}, "skills": [], "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005874065"}