{"jobTitle": "CAD DESIGNER", "company": {"name": "Path Engineering", "location": "Whitewater, WI"}, "location": "Whitewater, WI", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Engines and Power Transmission Equipment Manufacturing", "description": "<strong>Role<br/><br/></strong>As a CAD Designer (also known as Mechanical Designer, Design Engineer), you'll generate CAD drawings based on specifications and documentation, communicate concepts to customers, and ensure internal manufacturability. You'll also lead project management activities, maintain engineering documentation standards, and utilize SolidWorks for drafting work. Additionally, you'll prepare 3D concept drawings, prototype drawings, and production drawings for projects.<br/><br/><strong>Benefits<br/><br/></strong><ul><li>Opportunity to work on diverse projects.</li><li>Continuous skill improvement through training.</li><li>Chance to contribute to new product development.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Associates degree or equivalent from a two-year college or technical school; or minimum 5 years mechanical design or related experience.</li><li>Proficiency in CAD Software (Solidworks, AutoCAD), Microsoft Word, Excel, and Outlook.</li><li>Ability to read and interpret documents, manuals, drawings, procedures, or other instructions furnished in written, oral, diagram or schedule form.</li></ul>", "postedDate": "4 hours ago", "benefits": "Opportunity to work on diverse projects. Continuous skill improvement through training. Chance to contribute to new product development.", "qualifications": {"required": "Associates degree or equivalent from a two-year college or technical school; or minimum 5 years mechanical design or related experience. Proficiency in CAD Software (Solidworks, AutoCAD), Microsoft Word, Excel, and Outlook. Ability to read and interpret documents, manuals, drawings, procedures, or other instructions furnished in written, oral, diagram or schedule form."}, "skills": ["Solidworks", "AutoCAD", "Microsoft Word", "Excel", "Outlook"], "url": "https://www.linkedin.com/jobs/view/4005853457"}