{"jobTitle": "Business Analyst", "company": {"name": "Agility Partners", "location": "Columbus, Ohio Metropolitan Area"}, "location": "Columbus, Ohio Metropolitan Area", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting and Banking", "description": "<strong><em>**Unable to work C2C</em></strong>\n<p><strong><em>**Candidates local to Columbus, OH or Minneapolis, MN preferred</em></strong></p><p><br/></p><p>Agility Partners is seeking qualified applicants to fill an open <strong>ServiceNow Business Analyst</strong> position with one of our Banking clients. This is an exciting opportunity to sit on the ServiceNow platform team and work with business partners to align technology solutions with business strategies.</p><p> </p><p><strong>Responsibilities</strong></p><ul><li>Work with business partners to understand requested changes to the ServiceNow platform</li><li>Document requirements for platform changes/integrations/modifications, etc.</li><li>Write traditional technical requirements as well as story cards</li><li> Dig into the platform to understand if/how the modifications can be made and provide guidance/solutions</li></ul><p><br/></p><p><strong>Qualifications</strong></p><ul><li>Traditional Business Analyst experience</li><li>Experience writing technical requirements</li><li>ServiceNow platform knowledge and experience (NOT just a user), must understand how integrations/modifications work</li><li>Ability to be the point on a Scrum team – confident and comfortable leading</li><li>Experience tracking and driving deliverables to completion</li></ul><p></p>", "responsibilities": "Work with business partners to understand requested changes to the ServiceNow platform, Document requirements for platform changes/integrations/modifications, etc., Write traditional technical requirements as well as story cards, Dig into the platform to understand if/how the modifications can be made and provide guidance/solutions", "qualifications": {"required": "Traditional Business Analyst experience, Experience writing technical requirements, ServiceNow platform knowledge and experience (NOT just a user), must understand how integrations/modifications work, Ability to be the point on a Scrum team – confident and comfortable leading, Experience tracking and driving deliverables to completion"}, "skills": ["ServiceNow", "Business Analysis", "Technical Requirements", "Scrum", "Project Management"], "postedDate": "2 hours ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005871846"}