{"jobTitle": "Graphic Design Specialist", "company": {"name": "UnboundEd", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "84,700.00/yr - $131,300.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "<strong>About Unbound<br/><br/></strong>UnboundEd empowers educators to eliminate the predictability of student outcomes by race, language, and socioeconomic status through evidence-informed, engaging, affirming, and meaningful grade-level instruction—so all students succeed academically. As the nation's largest equity-focused professional learning organization, we provide professional learning products and services to hundreds of thousands of educators nationwide.<br/><br/>UnboundEd is a passionate team of former teachers, district and school leaders, curriculum writers, and education experts united by the desire to see every student thrive. We walk alongside educators on their professional learning journey, helping them cultivate the mindsets, knowledge, and skills to deliver equitable, effective instruction. In 2023, UnboundEd joined forces with Pivot Learning and CORE Learning to expand our offerings and drive long-needed changes in instruction, especially in the highest-need schools.<br/><br/><strong>Role Summary<br/><br/></strong>Reporting to the Director, Marketing and Communications Operations, the Graphic Design Specialist at UnboundEd will manage the implementation of our various brands' visual identities. This role produces most visual design work for UnboundEd and its subsidary(ies) and may involve managing one to three part-time contract designers. In this position, you will collaborate with cross-functional teams to ensure the production of high-quality visual content that aligns with our mission and goals. The Graphic Design Specialist will play a critical role in implementing our brand presence across various digital and print platforms.<br/><br/>UnboundEd is a virtual organization, and this employee can work from anywhere in the United States. UnboundEd has core business hours when we expect all staff to be available from 9 a.m. to 5 p.m. local time and 15% travel is required.<br/><br/><em><strong>UnboundEd's Commitment to Diversity and Equal Opportunity Employment Policy<br/><br/></strong></em><em>UnboundEd is an equal opportunity employer that encourages individuals of all ethnicities, racial backgrounds, sexual orientations, and gender identities to apply for our positions. We are dedicated to creating a supportive environment where all employees are respected, valued, and free from discrimination. We are committed to fostering a diverse and inclusive organization and actively seek to engage those who can contribute to our vision, especially individuals with experience living or working in underserved urban communities.<br/><br/></em><strong>Essential Responsibilities<br/><br/></strong>Essential responsibilities for this position include, but are not limited to:<br/><br/><em><strong>Maintain and execute the visual identity of the UnboundEd and CORE brands:</strong></em> Produce most visual design work across the company<br/><br/><ul><li>Collaborate with marketing, sales, content, and product teams to create visually appealing materials that support our campaigns and initiatives</li><li>In alignment with established brand guides, oversee all design projects, from conception to delivery, ensuring high-quality and timely execution</li><li>Work with the design contractors, as needed, to develop and execute creative concepts that meet the organization's needs</li><li>Enhance and enforce brand guidelines to ensure consistency across all visual communications</li><li>Foster a collaborative and innovative design culture with internal careholders and contract designers</li><li>Support in-person events by fulfilling specs for tangible items, such as swag and event materials. Design signage as needed. Produce handouts for sessions</li><li>Stay current with industry trends and best practices to keep our designs fresh and relevant<br/><br/></li></ul><em><strong>Digital Media Support:</strong></em> Produce designs for a wide variety of projects at UnboundEd and CORE Learning. This category of design work could include a variety of visual content types, such as:<br/><br/><ul><li>Event promos featuring headshots of speakers and event information</li><li>Infographics that present current education research and data </li><li>Sales collateral</li><li>Quote graphics </li><li>Program participant testimonials </li><li>Video and moving animation aesthetic development</li><li>Email marketing graphics<br/><br/></li></ul><em> Other related duties and projects as assigned <br/><br/></em><strong>Requirements<br/><br/></strong><strong>MINIMUM QUALIFICATIONS<br/><br/></strong><ul><li>Bachelor's degree in Graphic Design, Visual Arts, or a related field</li><li>A minimum of three (3) years of experience in graphic design, with at least 1 year of experience managing vendor relationships and leading multiple design projects simultaneously</li><li>High levels of proficiency in the use of Adobe Creative Suite</li><li>Experience with Figma is preferred<br/><br/><br/></li></ul><strong>THE STRONGEST CANDIDATES WILL HAVE/BE:<br/><br/></strong><ul><li>Commitment to UnboundEd's organizational values</li><li>Learning orientation and commitment toward diversity, equity, and inclusion</li><li>Knowledge of urban school environments</li><li>Ability to work independently and effectively in a virtual, remote environment and build strong relationships with colleagues and partners across geographies and time zones</li><li>Willingness to work alongside a dynamic, highly collaborative, and vision-driven team</li><li>Entrepreneurial spirit and ability to thrive in a fast-paced and changing environment</li><li>Proficient use of Microsoft Office, Google-based applications, and online collaboration tools such as Slack<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>BENEFITS AND COMPENSATION<br/><br/></strong>UnboundEd offers competitive salaries commensurate with experience and education and a generous benefits package that includes take-as-you-need vacation time, group medical, dental, and vision plans, disability and life insurance plans, and an employer-sponsored 401K retirement plan with a 5% employer contribution and no vesting period. This is an exempt position with an annual compensation range of $84,700 - $131,300. UnboundEd bases compensation offers on relevant years of experience in relation to the position. Because of our strong commitment to equity and growth, UnboundEd does not negotiate compensation offers.", "responsibilities": "Essential responsibilities for this position include, but are not limited to:<br/><br/><em><strong>Maintain and execute the visual identity of the UnboundEd and CORE brands:</strong></em> Produce most visual design work across the company<br/><br/><ul><li>Collaborate with marketing, sales, content, and product teams to create visually appealing materials that support our campaigns and initiatives</li><li>In alignment with established brand guides, oversee all design projects, from conception to delivery, ensuring high-quality and timely execution</li><li>Work with the design contractors, as needed, to develop and execute creative concepts that meet the organization's needs</li><li>Enhance and enforce brand guidelines to ensure consistency across all visual communications</li><li>Foster a collaborative and innovative design culture with internal careholders and contract designers</li><li>Support in-person events by fulfilling specs for tangible items, such as swag and event materials. Design signage as needed. Produce handouts for sessions</li><li>Stay current with industry trends and best practices to keep our designs fresh and relevant<br/><br/></li></ul><em><strong>Digital Media Support:</strong></em> Produce designs for a wide variety of projects at UnboundEd and CORE Learning. This category of design work could include a variety of visual content types, such as:<br/><br/><ul><li>Event promos featuring headshots of speakers and event information</li><li>Infographics that present current education research and data </li><li>Sales collateral</li><li>Quote graphics </li><li>Program participant testimonials </li><li>Video and moving animation aesthetic development</li><li>Email marketing graphics<br/><br/></li></ul><em> Other related duties and projects as assigned <br/><br/></em>", "qualifications": {"required": "Bachelor's degree in Graphic Design, Visual Arts, or a related field\nA minimum of three (3) years of experience in graphic design, with at least 1 year of experience managing vendor relationships and leading multiple design projects simultaneously\nHigh levels of proficiency in the use of Adobe Creative Suite", "preferred": "Experience with Figma is preferred"}, "skills": ["Adobe Creative Suite", "Figma"], "postedDate": "3 hours ago", "benefits": "UnboundEd offers competitive salaries commensurate with experience and education and a generous benefits package that includes take-as-you-need vacation time, group medical, dental, and vision plans, disability and life insurance plans, and an employer-sponsored 401K retirement plan with a 5% employer contribution and no vesting period. This is an exempt position with an annual compensation range of $84,700 - $131,300. UnboundEd bases compensation offers on relevant years of experience in relation to the position. Because of our strong commitment to equity and growth, UnboundEd does not negotiate compensation offers.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005870597"}