{"jobTitle": "ADMINISTRATIVE ASSISTANT III - 22011718", "company": {"name": "State of Florida", "location": "Tallahassee, FL"}, "location": "Tallahassee, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "23,721.12/yr - 42,008.94/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Government Administration", "description": "Requisition No: 835715<br/><br/>Agency: State Courts System<br/><br/>Working Title: ADMINISTRATIVE ASSISTANT III - 22011718<br/><br/>Pay Plan: State Courts System<br/><br/>Position Number: 22011718<br/><br/>Salary: Annual Salary: $23,721.12 (Part-time salary, full time salary $42,008.94)<br/><br/>Posting Closing Date: 08/23/2024<br/><br/><strong>Total Compensation Estimator </strong><strong> Tool <br/><br/></strong><strong>ADMINISTRATIVE ASSISTANT III<br/><br/></strong><strong>Full-Time Position, using two Part-time Positions <br/><br/></strong><strong>(AAIII position #011718 and AAI position #011744)<br/><br/></strong><strong>Annual Salary: $23,721.12 (Part-time salary, full time salary $42,008.94) <br/><br/></strong><strong>Position Number: 011718<br/><br/></strong><strong>Class Code: 6360<br/><br/></strong><strong>General Description<br/><br/></strong>The essential function of the position within the organization is to provide administrative, organizational, coordinating, and clerical support for the Second Judicial Circuit Office of Court Administration. This position is to provide complex accounting, human resources, administrative, program coordinating, and clerical support. Interface with members of the judiciary, state court personnel and the public. The position works independently, reporting major activities through periodic meetings with management.<br/><br/><strong> Education and Training Guidelines <br/><br/></strong>Bachelor’s degree. Additional relevant experience may substitute for the recommended educational level on a year-for-year basis.<br/><br/>Three years of work experience in business administration, office skills, or related field. Additional relevant education may substitute for the recommended experience on a year-for-year basis, excluding supervisory experience.<br/><br/><strong>Responsibilities<br/><br/></strong><strong> Examples of Possible Job Responsibilities <br/><br/></strong><ul><li> Perform administrative functions for the Trial Court Administrator and Chief Deputy Court Administrator, to include maintaining Outlook calendars, scheduling meetings, making travel arrangements, and completing travel reimbursements in STMS. </li><li> Performs a variety of human resources duties, including employee on-boarding paperwork, processing payroll records, calculating employee leave information, temporary OPS payroll, maintaining timesheets and attendance records for employees, and auditing employee timesheets. </li><li> Assists in screening employment applications and enters data into PeopleFirst and prepares application packets to hiring supervisors within the circuit. </li><li> Prepares documents relating to employee changes for submission to OSCA Office of Human Resources. </li><li> Provide backup support for the ADA Coordinator. </li><li> Performs a variety of administrative, accounting, and fiscal duties to assist in managing daily business and support operations. </li><li> May provide temporary coverage for judicial assistants. </li><li> Prepares and edits correspondence for the Trial Court Administrator, observing strict confidentiality rules. </li><li> Conducts research on a variety of issues, maintains unit website, develops correspondence to judges and court staff, and assists in the drafting of operational policies and procedures. </li><li> Interface with the public through telephone calls, emails and in-person to provide information, resolves issues, directs to proper personnel, or takes messages. </li><li> Performs general accounting and purchasing functions such as auditing accounts, processing vouchers, assisting in the budget process, processing purchase orders, obtaining bids, preparing bills/processing invoices for payment, and creates, processes, and/or renews contracts for services. </li><li> Reconciles purchasing card charges in the WORKS system for the Trial Court Administrator. </li><li> Establishes and maintains working relationships with judges and other SCS personnel, judicial stakeholders/partners, other state agency staff, local government, and the public. </li><li> Staff court committees to include coordinating meetings, draft correspondence, develop documents or other committee related materials, and draft meeting minutes. </li><li> Sets up and maintains files, books, records, and other departmental systems of responsibility. </li><li> Gathers and maintains information/data to prepare periodic and special reports for the Trial Court Administrator. </li><li> Attends staff meetings and professional meetings, trainings, workshops, or conferences to improve technical or professional skills. <br/><br/></li></ul><strong> Competencies <br/><br/></strong><strong>Data Responsibility<br/><br/></strong>Compiles, examines, or evaluates data or information and possibly recommends action based on results.<br/><br/><strong>People Responsibility<br/><br/></strong>Gives information, guidance, or assistance to people who directly facilitate task accomplishment; may give instructions or assignments to helpers or assistants.<br/><br/><strong>Assets Responsibility<br/><br/></strong>Has responsibility and opportunity for achieving considerable economies and/or preventing considerable losses through the management of a large division or minor department.<br/><br/><strong>Mathematical Requirements<br/><br/></strong>Uses addition, subtraction, multiplication, and division; may compute ratios, rates, and percentages.<br/><br/><strong>Communications Requirements<br/><br/></strong>Reads routine sentences, instructions, regulations, procedures, or work orders; composes business letters, complex reports and manuals; speaks formally to groups inside and outside the organization.<br/><br/><strong>Complexity Of Work<br/><br/></strong>Performs coordinating work involving guidelines and rules with constant problem solving; requires continuous, close attention for accurate results and frequent exposure to unusual pressures.<br/><br/><strong>Equipment Usage<br/><br/></strong>Handles machines, tools, equipment, or work aids involving moderate latitude for judgment regarding attainment of standard or in selecting appropriate items, such as computers, peripherals, or software programs such as word processing, spreadsheets or custom applications.<br/><br/><strong>Special Comments<br/><br/></strong><ul><li> This is a full-time position, funded with two part-time positions. </li><li> This position is available immediately. </li><li> This position may require travel to the six counties within our circuit which include Franklin, Gadsden, Jefferson, Leon, Liberty, and Wakulla Counties </li><li> Must possess good oral and written communication skills. </li><li> Experience in the use of Word, Adobe Acrobat, and Excel applications is preferred. </li><li> Ability to manage multiple projects, priorities, and activities. </li><li> Ability to plan, edit, and proofread reports, articles, and other written materials. </li><li> Ability to develop and maintain effective working relationships with members of the judiciary, state court personnel and the public. </li><li> Knowledge of court operations and administration will benefit the successful applicant. </li><li> Understanding of legal terminology preferred. </li><li> Experience in human resources will benefit the successful applicant. </li><li> Experience in State accounting applications such as STMS, FLAIR and WORKS will greatly benefit the successful applicant. </li><li> Experience in the State Courts System is preferred. </li><li> An application addendum is required for final applicants to conduct a thorough criminal and civil background check. <br/><br/></li></ul>We are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, sex, age, national origin or disability.<br/><br/>If you need an accommodation to participate in the application/selection process, please call the contact person at the number indicated for each respective position. Persons using a TDD may call the contact person through the Florida Relay Service 1-800-955-8771.<br/><br/>The State of Florida is an Equal Opportunity Employer/Affirmative Action Employer, and does not tolerate discrimination or violence in the workplace.<br/><br/>Candidates requiring a reasonable accommodation, as defined by the Americans with Disabilities Act, must notify the agency hiring authority and/or People First Service Center (1-866-663-4735). Notification to the hiring authority must be made in advance to allow sufficient time to provide the accommodation.<br/><br/>The State of Florida supports a Drug-Free workplace. All employees are subject to reasonable suspicion drug testing in accordance with Section 112.0455, F.S., Drug-Free Workplace Act.", "responsibilities": "The essential function of the position within the organization is to provide administrative, organizational, coordinating, and clerical support for the Second Judicial Circuit Office of Court Administration. This position is to provide complex accounting, human resources, administrative, program coordinating, and clerical support. Interface with members of the judiciary, state court personnel and the public. The position works independently, reporting major activities through periodic meetings with management.", "qualifications": {"required": "Bachelor’s degree. Additional relevant experience may substitute for the recommended educational level on a year-for-year basis.<br/><br/>Three years of work experience in business administration, office skills, or related field. Additional relevant education may substitute for the recommended experience on a year-for-year basis, excluding supervisory experience.", "preferred": "Experience in the use of Word, Adobe Acrobat, and Excel applications is preferred. Ability to manage multiple projects, priorities, and activities. Ability to plan, edit, and proofread reports, articles, and other written materials. Ability to develop and maintain effective working relationships with members of the judiciary, state court personnel and the public. Knowledge of court operations and administration will benefit the successful applicant. Understanding of legal terminology preferred. Experience in human resources will benefit the successful applicant. Experience in State accounting applications such as STMS, FLAIR and WORKS will greatly benefit the successful applicant. Experience in the State Courts System is preferred. An application addendum is required for final applicants to conduct a thorough criminal and civil background check."}, "skills": ["Word", "Adobe Acrobat", "Excel", "STMS", "FLAIR", "WORKS"], "postedDate": "17 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005869939"}