{"jobTitle": "Sr. Manager - Customer Onboarding", "company": {"name": "AddSource ", "industry": "Hospitals and Health Care", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Mid-Senior level", "jobFunction": "Information Technology", "industry": "Hospitals and Health Care", "description": "<strong>Sr. Manager - Customer Onboarding</strong><p><strong>Location:</strong> Remote</p><p><strong>Experience:</strong> 12+ Years</p><p><strong>Mandatory Skills / Required Experience:</strong></p><ul><li>Bachelor’s degree in Business, Healthcare Management, or a related field; Master’s degree preferred.</li><li>15+ years of experience in a leadership role, with a focus on strategic initiatives, process standardization, and cross-functional collaboration.</li><li>Extensive experience in the healthcare or health plans industry, with a deep understanding of customer onboarding, whole person management, and third-party interactions.</li><li>Strong leadership and communication skills, with the ability to influence and engage stakeholders at all levels of the organization.</li><li>Experience in change management, with a focus on driving organizational change and ensuring successful adoption of new processes.</li><li>Excellent problem-solving and analytical skills, with a focus on data-driven decision-making.</li></ul><p><strong>Educational Qualifications:</strong></p><p>Engineering Degree – BE/ME/BTech/MTech/BSc/MSc.</p><p>Technical certification in multiple technologies is desirable.</p><p><strong>What is in it for you?</strong></p><p>As a Sr. Manager - Customer Onboarding, you will be a part of an Agile team to provide leadership support for the customer onboarding processes across the organization.</p><p><strong>Responsibilities:</strong></p><ul><li>Provide leadership support in engaging Sales, Marketing, and Operations teams to align on strategic goals and initiatives.</li><li>Lead the development and execution of strategies to streamline and standardize customer onboarding processes across the organization.</li><li>Oversee the implementation of whole person non-digital management practices, ensuring alignment with organizational goals and customer needs.</li><li>Drive the standardization of processes related to customer onboarding, ensuring consistency and efficiency across all teams and departments.</li><li>Collaborate with key stakeholders to identify opportunities for process improvement and implement best practices.</li><li>Ensure that third-party interactions are streamlined and standardized, enhancing overall operational efficiency and customer experience.</li><li>Work closely with Sales, Marketing, and Operations teams to ensure alignment on strategic initiatives and process improvements.</li><li>Collaborate with internal and external stakeholders to integrate whole person management practices into existing processes.</li><li>Monitor and evaluate the effectiveness of whole person management initiatives, making adjustments as needed to ensure success.</li><li>Lead efforts to streamline and standardize interactions with third-party vendors and partners, ensuring alignment with organizational goals.</li><li>Develop and implement strategies to enhance the efficiency and effectiveness of third-party interactions, reducing complexity and improving outcomes.</li><li>Manage relationships with key third-party stakeholders, ensuring successful collaboration and alignment on objectives.</li><li>Drive change management initiatives to support the implementation of standardized processes and strategic initiatives across the organization.</li></ul><p></p>", "responsibilities": "Provide leadership support in engaging Sales, Marketing, and Operations teams to align on strategic goals and initiatives. Lead the development and execution of strategies to streamline and standardize customer onboarding processes across the organization. Oversee the implementation of whole person non-digital management practices, ensuring alignment with organizational goals and customer needs. Drive the standardization of processes related to customer onboarding, ensuring consistency and efficiency across all teams and departments. Collaborate with key stakeholders to identify opportunities for process improvement and implement best practices. Ensure that third-party interactions are streamlined and standardized, enhancing overall operational efficiency and customer experience. Work closely with Sales, Marketing, and Operations teams to ensure alignment on strategic initiatives and process improvements. Collaborate with internal and external stakeholders to integrate whole person management practices into existing processes. Monitor and evaluate the effectiveness of whole person management initiatives, making adjustments as needed to ensure success. Lead efforts to streamline and standardize interactions with third-party vendors and partners, ensuring alignment with organizational goals. Develop and implement strategies to enhance the efficiency and effectiveness of third-party interactions, reducing complexity and improving outcomes. Manage relationships with key third-party stakeholders, ensuring successful collaboration and alignment on objectives. Drive change management initiatives to support the implementation of standardized processes and strategic initiatives across the organization.", "qualifications": {"required": "Bachelor’s degree in Business, Healthcare Management, or a related field; Master’s degree preferred. 15+ years of experience in a leadership role, with a focus on strategic initiatives, process standardization, and cross-functional collaboration. Extensive experience in the healthcare or health plans industry, with a deep understanding of customer onboarding, whole person management, and third-party interactions. Strong leadership and communication skills, with the ability to influence and engage stakeholders at all levels of the organization. Experience in change management, with a focus on driving organizational change and ensuring successful adoption of new processes. Excellent problem-solving and analytical skills, with a focus on data-driven decision-making.", "preferred": "Engineering Degree – BE/ME/BTech/MTech/BSc/MSc. Technical certification in multiple technologies is desirable."}, "skills": [], "postedDate": "3 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005887518"}