{"jobTitle": "Project Manager", "company": {"name": "Wharton-Smith, Inc.", "industry": "Construction"}, "location": "Palm Beach Gardens, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management", "industry": "Construction", "description": "Wharton-Smith, Inc. is currently seeking an experienced Project Manager to work in the Water/Wastewater Division in the Palm Beach Gardens, FL area. In this role, the successful candidate will be responsible for the overall performance of the project(s) from the estimating/pre-construction phase to successful completion including safety, owner satisfaction, cost, schedule and quality control.  Responsibilities:  Build strong relationships with client/owner, architect, and engineer. Ensure they will want to renew the construction experience with Wharton-Smith.  Maintain a positive image of the company with clients, vendors, subcontractors, and team members.  Partner with Preconstruction Services regarding value engineering/constructability, soliciting bidders, estimating assistance and generating proposals.  Set up and maintain project cost accounting.  Develop and maintain the project schedule.  Support the permitting, testing and inspection requirements of the project.  Familiar with owner contract requirements and delivery methods.  Negotiate subcontractor agreements and equipment/material purchase orders.  Develop a Schedule of Values and generate monthly payment applications.  Review and approve subcontractor pay applications and vendor invoices.  Track and evaluate subcontractor change management.  Facilitate subcontractor and owner coordination/progress meeting and document meeting minutes.  Manage execution of contracts, bonds, insurance certificates, contract compliance, and warranties.  Monitor the submittal, shop drawing, and purchase order process to insure accurate and timely delivery of equipment and materials.  Monitor budgets, schedules, cost reports and job progress and review with the project team on a weekly basis.  Visit jobsites on a regular basis to review job progress, production planning boards, quality of work and safety on the job.  Manage change orders, extra work orders, disputed claims, with owner and owner’s representatives to a successful conclusion.  Resolve major disputes with vendors and subcontractors.  Manage startup and commissioning of facility, where applicable.  Provide owner training to the end user and turn-over contract close-out deliverables.  Review and report project financial information, performance and any major conflicts to be resolved with Division Manager.  Qualifications:  Bachelor’s degree in Civil Engineering, Mechanical Engineering, Construction Management, or other relevant degree.  Must have relevant water/wastewater construction experience  Experience in managing self-perform crews is preferred.  Excellent written and verbal communication skills.  Developing leader and team player with five plus years of experience in engineering, construction, or related field.  Proven success in the completion of multimillion-dollar projects.  Technical skills:  Computer-based CPM Scheduling Programs  Construction Management Software  Microsoft Office Products", "responsibilities": "Build strong relationships with client/owner, architect, and engineer. Ensure they will want to renew the construction experience with Wharton-Smith. \nMaintain a positive image of the company with clients, vendors, subcontractors, and team members. \nPartner with Preconstruction Services regarding value engineering/constructability, soliciting bidders, estimating assistance and generating proposals. \nSet up and maintain project cost accounting. \nDevelop and maintain the project schedule. \nSupport the permitting, testing and inspection requirements of the project. \nFamiliar with owner contract requirements and delivery methods. \nNegotiate subcontractor agreements and equipment/material purchase orders. \nDevelop a Schedule of Values and generate monthly payment applications. \nReview and approve subcontractor pay applications and vendor invoices. \nTrack and evaluate subcontractor change management. \nFacilitate subcontractor and owner coordination/progress meeting and document meeting minutes. \nManage execution of contracts, bonds, insurance certificates, contract compliance, and warranties. \nMonitor the submittal, shop drawing, and purchase order process to insure accurate and timely delivery of equipment and materials. \nMonitor budgets, schedules, cost reports and job progress and review with the project team on a weekly basis. \nVisit jobsites on a regular basis to review job progress, production planning boards, quality of work and safety on the job. \nManage change orders, extra work orders, disputed claims, with owner and owner’s representatives to a successful conclusion. \nResolve major disputes with vendors and subcontractors. \nManage startup and commissioning of facility, where applicable. \nProvide owner training to the end user and turn-over contract close-out deliverables. \nReview and report project financial information, performance and any major conflicts to be resolved with Division Manager.", "qualifications": {"required": "Bachelor’s degree in Civil Engineering, Mechanical Engineering, Construction Management, or other relevant degree. \nMust have relevant water/wastewater construction experience \nExcellent written and verbal communication skills. \nDeveloping leader and team player with five plus years of experience in engineering, construction, or related field. \nProven success in the completion of multimillion-dollar projects.", "preferred": "Experience in managing self-perform crews is preferred."}, "skills": ["CPM Scheduling", "Construction Management Software", "Microsoft Office"], "postedDate": "4 hours ago", "benefits": "Medical insurance, Vision insurance, Dental insurance, 401(k)", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005860463"}