{"jobTitle": "Remote Triage RN 1 weekday shift 5a-10a2 of 3 wknd rotation", "company": {"name": "IntellaTriage", "location": "Nashville, TN"}, "location": "Nashville, TN", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "IntellaTriage continues to GROW!<br/><br/><strong>IntellaTriage Nurses enjoy the benefits of working from home, providing care, without the stress and expense of commuting each day!<br/><br/></strong><em><strong><ul><li>MUST have or be willing to obtain a Compact RN license</li><li>MUST live in/work from a Compact US state</li><li>Minimum of 3 years as a Nurse</li><li>Minimum of 1 year of experience in a fast-paced environment (i.e. ED, Critical Care, Surgical Services, Med/Surg, etc.)</li><li>Must have high speed internet</li><li>Must be tech savvy, enjoy a fast-paced environment, and have no concerns typing</li><li>Must be available to work 2 out of every 3 weekends &amp; 1 weekday per week.<br/><br/></li></ul></strong></em><strong>&gt; 1 weekday shift 5a-10a (shift times are set/weekday flexes)<br/><br/></strong><strong>&gt; 2 of every 3 weekend rotation (Sat &amp; Sun) 5a-10a CST<br/><br/></strong><strong>Our Nurse Advice Line Nurses<br/><br/></strong><ul><li>Have proven experience in a fast-paced, critical-thinking environment; ED, Critical Care, Surgical Services, etc.</li><li>Work a minimum of 1 shift per weekday (Mon-Fri).</li><li>Preferred scheduling for their weekday requirements.</li><li>Work 2 weekends or every 3 weeks, both Saturday and Sunday on those weekends with rotating times. (For example: weekend 1: work, weekend 2: work, weekend 3: off) </li><li>Train for 3 weeks. (Week 1: Day shift on Monday &amp; Tuesday, &amp; Wednesday then train 8-10 shifts during Week 2 &amp; Week 3 primarily during the shift you are hired for, based on our Trainers’ schedule and availability).</li><li>Must have a compact license and live in that compact state. (no states with pending legislation or future implementation dates are considered current compacts)<br/><br/></li></ul><strong>What is important to know?<br/><br/></strong>We are growing and excited to be able to support our clients’ nursing staffs in the field who need time to focus on work-life balance, as well, while being able to trust that we are there to support them and their patients during nights and weekends!<br/><br/><ul><li>Patient care is #1. We do not have call quotas. We employ the best nurses to provide the best care.</li><li>When our patients or their families reach our triage line, they immediately speak directly with a nurse.</li><li>We do not have PRN positions.</li><li>We are super busy. If you like fast-paced roles, keep reading…</li><li>Any nurse may pick up additional shifts, if shifts are available for the clients’ they are trained to support.</li><li>We will provide you with a laptop and headset.</li><li>Nurses are required to provide their own high-speed internet (only fiberoptic or coaxial cable internet is compatible with our remote call center technology).</li><li>Our laptop is required to be directly connected to your modem. Working through Wi-Fi is not compatible with our systems. The calls will drop.</li><li>It is essential to have a home office or quiet space free from noise or distractions in your home (Privacy/HIPAA compliant space is required).</li><li>Training is provided remotely and is paid; no travel is required in this role.</li><li>MUST be able to follow instructions (verbal and written) and be comfortable with technology (tech savvy).</li><li>Must remain in good standing and ensure their home state license remains active.</li><li>IntellaTriage will cover the cost of non-compact state licensure based on the client(s) that are assigned for support.</li><li>All nurses must have a compact license and reside/work in that state.</li><li>Shift prep is a minimum clock-in of 30 minutes prior to taking calls; this is paid time to prepare.</li><li>Once calls roll to the next team/shift, our nurses remain clocked in and complete any remaining charting before leaving for the day. This may take 30 minutes or this may take 2 hours. It depends on the pace of the calls received during that shift and the pace of your ability to quickly navigate technology and type.<br/><br/></li></ul><strong>Sound exciting to you?<br/><br/></strong>Then… put those days on the floor and that commute or hours on the road between patients’ homes behind you! Our nurses enjoy working from their own home office; no more purchasing scrubs, expensive takeout, and the large gas bill along with extra wear-and-tear on your vehicle.<br/><br/>Most importantly, working remotely enables you to spend more time with those you love!<br/><br/><strong>Requirements<br/><br/></strong><ul><li> MUST have or be willing to obtain a Compact Nursing License (States with pending legislation or future implementation dates are not considered current compacts until the implementation date.)</li><li>3+ years as a RN</li><li>Experience in a fast-paced environment: i.e. ED, Surgical Services, or Critical Care.</li><li>Must be comfortable with technology and accessing multiple applications remotely to perform documentation during calls.</li><li>Ability and comfort typing.</li><li>Fluency in English is required, additional languages are a bonus.</li><li>Must physically reside in the U.S. and be legally eligible to work for any employer.</li><li>Must be able to complete the 3-week orientation and training (Schedule listed in this posting).</li><li>Must be available to work Saturday &amp; Sunday on your team's required weekends; 2 of every 3 weekends.</li><li>Holidays as they are required (rotation).</li><li>Able to handle stress and multitask when calls are coming in (minimum of 5+ calls per hour on weekdays, and much higher on weekends).</li><li>Able to communicate with patients and families with empathy while also maintaining adherence to client protocols.</li><li>Must maintain CEU’s as designated by the states you are answering calls in.</li><li>Must attend any in-services, additional training on an as needed basis.</li><li>Able to pass background check and nurse licensing check.<br/><br/></li></ul><strong>Benefits<br/><br/></strong>All Remote Nurse Advice Line RN's, once trained to their originally assigned team are at $23/hourly. All part-time nurses accumulate PTO, based on the number of hours they work (per year). All part-time nurses receive an additional 3-paid-sick-days per year. All part-time nurses are eligible to participate in our 401(k) plan.", "responsibilities": "IntellaTriage Nurses enjoy the benefits of working from home, providing care, without the stress and expense of commuting each day!", "qualifications": {"required": "MUST have or be willing to obtain a Compact RN license, MUST live in/work from a Compact US state, Minimum of 3 years as a Nurse, Minimum of 1 year of experience in a fast-paced environment (i.e. ED, Critical Care, Surgical Services, Med/Surg, etc.), Must have high speed internet, Must be tech savvy, enjoy a fast-paced environment, and have no concerns typing, Must be available to work 2 out of every 3 weekends & 1 weekday per week.", "preferred": "Have proven experience in a fast-paced, critical-thinking environment; ED, Critical Care, Surgical Services, etc., Work a minimum of 1 shift per weekday (Mon-Fri), Preferred scheduling for their weekday requirements, Work 2 weekends or every 3 weeks, both Saturday and Sunday on those weekends with rotating times. (For example: weekend 1: work, weekend 2: work, weekend 3: off), Train for 3 weeks. (Week 1: Day shift on Monday & Tuesday, & Wednesday then train 8-10 shifts during Week 2 & Week 3 primarily during the shift you are hired for, based on our Trainers’ schedule and availability), Must have a compact license and live in that compact state. (no states with pending legislation or future implementation dates are considered current compacts)"}, "skills": ["RN", "Compact Nursing License", "Fast-paced environment", "Technology", "Typing", "English", "Communication", "Empathy", "CEU's", "Background check", "Nurse licensing check"], "postedDate": "4 hours ago", "benefits": "All Remote Nurse Advice Line RN's, once trained to their originally assigned team are at $23/hourly. All part-time nurses accumulate PTO, based on the number of hours they work (per year). All part-time nurses receive an additional 3-paid-sick-days per year. All part-time nurses are eligible to participate in our 401(k) plan.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005858391"}