{"jobTitle": "VP of Customer Success", "company": {"name": "Augment Jobs", "location": "Atlanta, GA"}, "location": "Atlanta, GA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$80,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Financial Services and IT Services and IT Consulting", "description": "Job Description: VP of Customer Success<br/><br/>Company: Augmentjobs<br/><br/>Salary Range: $80,000 - $120,000<br/><br/>Experience Level: 2 to 5 years<br/><br/>Overview<br/><br/>As the VP of Customer Success at Augmentjobs, you will be responsible for leading our Customer Success team to ensure that our clients achieve their desired outcomes and receive exceptional service throughout their engagement with us. Your role will involve strategic planning, team management, and driving initiatives to enhance customer satisfaction, retention, and expansion.<br/><br/>Key Responsibilities<br/><br/><ul><li>Leadership &amp; Strategy:</li><ul><li>Develop and execute a comprehensive customer success strategy aligned with Augmentjobs’ business goals. </li><li>Lead, mentor, and manage the Customer Success team to drive performance and professional growth. </li><li>Define key performance indicators (KPIs) and metrics to measure the effectiveness of customer success initiatives. </li></ul><li>Customer Relationship Management:</li><ul><li>Build and maintain strong, long-lasting customer relationships by understanding their needs and delivering exceptional service. </li><li>Oversee the onboarding process for new customers, ensuring a smooth and positive experience. </li><li>Address and resolve customer issues and concerns in a timely and effective manner. </li></ul><li>Team Collaboration:</li><ul><li>Work closely with sales, product, and support teams to ensure alignment and address customer needs and feedback. </li><li>Collaborate with product teams to advocate for customer needs and drive product improvements. </li></ul><li>Data Analysis &amp; Reporting:</li><ul><li>Analyze customer data and feedback to identify trends, areas for improvement, and opportunities for upsell and cross-sell. </li><li>Provide regular reports and insights to senior management on customer success metrics, challenges, and opportunities. </li></ul><li>Process Improvement:</li><ul><li>Continuously evaluate and improve customer success processes and strategies to enhance efficiency and effectiveness. </li><li>Develop and implement best practices for customer success operations. </li></ul><li>Customer Advocacy:</li><ul><li>Serve as a customer advocate within the organization, ensuring that their voice is heard and their needs are addressed. </li><li>Promote customer success stories and case studies to showcase the value of Augmentjobs’ services. <br/></li></ul></ul>Skills &amp; Qualifications<br/><br/><ul><li>Experience:</li><ul><li>2 to 5 years of experience in a customer success or related role, with a proven track record of managing customer relationships and driving satisfaction. </li><li>Experience in a leadership or managerial role within a customer success team is highly desirable. </li></ul><li>Leadership:</li><ul><li>Strong leadership and team management skills, with the ability to inspire and motivate a team. </li><li>Excellent interpersonal and communication skills, with the ability to build relationships at all levels of the organization and with customers. </li></ul><li>Strategic Thinking:</li><ul><li>Ability to develop and execute strategic plans to achieve customer success goals. </li><li>Strong analytical skills with the ability to interpret data and make data-driven decisions. </li></ul><li>Customer Focus:</li><ul><li>Deep understanding of customer needs and a commitment to delivering exceptional service. </li><li>Experience with customer success software and tools is a plus. </li></ul><li>Problem-Solving:</li><ul><li>Strong problem-solving skills with the ability to address complex issues and find effective solutions. </li></ul><li>Adaptability:</li><ul><li>Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities. <br/></li></ul></ul>Apply Now: If you are a strategic thinker with a passion for customer success and leadership, we encourage you to apply for the VP of Customer Success role at Augmentjobs.<br/><br/>Augmentjobs is an Equal Opportunity Employer.", "responsibilities": "As the VP of Customer Success at Augmentjobs, you will be responsible for leading our Customer Success team to ensure that our clients achieve their desired outcomes and receive exceptional service throughout their engagement with us. Your role will involve strategic planning, team management, and driving initiatives to enhance customer satisfaction, retention, and expansion.<br/><br/>Key Responsibilities<br/><br/><ul><li>Leadership &amp; Strategy:</li><ul><li>Develop and execute a comprehensive customer success strategy aligned with Augmentjobs’ business goals. </li><li>Lead, mentor, and manage the Customer Success team to drive performance and professional growth. </li><li>Define key performance indicators (KPIs) and metrics to measure the effectiveness of customer success initiatives. </li></ul><li>Customer Relationship Management:</li><ul><li>Build and maintain strong, long-lasting customer relationships by understanding their needs and delivering exceptional service. </li><li>Oversee the onboarding process for new customers, ensuring a smooth and positive experience. </li><li>Address and resolve customer issues and concerns in a timely and effective manner. </li></ul><li>Team Collaboration:</li><ul><li>Work closely with sales, product, and support teams to ensure alignment and address customer needs and feedback. </li><li>Collaborate with product teams to advocate for customer needs and drive product improvements. </li></ul><li>Data Analysis &amp; Reporting:</li><ul><li>Analyze customer data and feedback to identify trends, areas for improvement, and opportunities for upsell and cross-sell. </li><li>Provide regular reports and insights to senior management on customer success metrics, challenges, and opportunities. </li></ul><li>Process Improvement:</li><ul><li>Continuously evaluate and improve customer success processes and strategies to enhance efficiency and effectiveness. </li><li>Develop and implement best practices for customer success operations. </li></ul><li>Customer Advocacy:</li><ul><li>Serve as a customer advocate within the organization, ensuring that their voice is heard and their needs are addressed. </li><li>Promote customer success stories and case studies to showcase the value of Augmentjobs’ services. <br/></li></ul></ul>", "qualifications": {"required": "2 to 5 years of experience in a customer success or related role, with a proven track record of managing customer relationships and driving satisfaction. Experience in a leadership or managerial role within a customer success team is highly desirable. Strong leadership and team management skills, with the ability to inspire and motivate a team. Excellent interpersonal and communication skills, with the ability to build relationships at all levels of the organization and with customers. Ability to develop and execute strategic plans to achieve customer success goals. Strong analytical skills with the ability to interpret data and make data-driven decisions. Deep understanding of customer needs and a commitment to delivering exceptional service. Experience with customer success software and tools is a plus. Strong problem-solving skills with the ability to address complex issues and find effective solutions. Ability to thrive in a fast-paced, dynamic environment and adapt to changing priorities.", "preferred": ""}, "skills": [], "postedDate": "4 hours ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005864114"}