{"jobTitle": "HR Assistant II - FULLY REMOTE", "company": {"name": "Aston Carter", "location": "Henderson, NV"}, "location": "Henderson, NV", "jobType": "Contract", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Staffing and Recruiting", "description": "One of the largest eCommerce tech companies is hiring multiple HR Assistants to support the benefits team. Role will be 100% remote. However candidates must be able to work at least one weekend day.<br/><br/><strong>About the role:<br/><br/></strong><ul><li>Start date (s): All within September 2024</li><li>Location: 100% remote, must reside within the US</li><li>Compensation: $21/hr</li><li>Contract: 6 months with potential for extension/conversion</li><li>Schedules: start between 9am-1pm PST ending between 6pm- 10pm PST. Will either include one or both weekend days.<br/><br/></li></ul><strong>Job Description<br/><br/></strong>Join the My HR Live Support (MHLS) team and help make a difference for all employees! The MHLS team provides HR assistance to organizational employees in the form of accurate, consistent, and timely responses to inquiries from various contact channels – phone, chats, and HR cases.<br/><br/>The role of the HR Assistant II in the My HR Live Support organization is to serve as a first point of contact for employee-related inquiries and holistic case management services, including but not limited to financial, health, and internal review to meet compliance with corresponding benefit plans as defined by the organization. The MHLS Benefits organization is dedicated to servicing the Benefits space, interacting with organizational employees in a way that earns trust by providing accurate information and resolving issues. This role requires critical thinking and fact-finding skills to make decisions that support the entire benefits process from intake to case management support.<br/><br/>A MHLS HR Assistant takes ownership of employee contacts ensuring that each case is accepted and resolved with a high degree of problem-solving and customer obsession. They build customer trust through empathetic and personalized conversations by assessing and adjusting the case management plan to each employee’s changing needs.<br/><br/>A MHLS HR Assistant manages their workload effectively to meet SLAs and productivity goals. They use high judgment, critical thinking, and rationale to balance process adherence with employee’s needs. They resolve inquiries holistically by referring to available documentation such as frequently asked questions, knowledge base articles, and standard operating procedures – escalating when these cannot be resolved. They respond to employee-impacting issues that may arise during the benefits event and ensure that proper communication and documentation occurs, even when information is limited. A MHLS HR Assistant consistently consults and collaborates with partner teams on process changes in an effort to resolve cross-functional issues to update and improve policies.<br/><br/>Hard Skills<br/><br/><ul><li>2+ years’ experience working in Benefits or Human Resources (preferably in a contact center or shared service environment)</li><li>Experience with rapid and complex changing work environments</li><li>Must have call center experience</li><li>Outstanding customer service and communication skills</li><li>Technical aptitude and proficiency with Microsoft Office Suite or similar software<br/><br/></li></ul>Soft Skills<br/><br/><ul><li>Excellent organizational and time management skills</li><li>Strong customer service focus with the ability to prioritize quality and customer experience</li><li>Excellent verbal and written communication skills</li><li>Ability to understand benefit terms and programs</li><li>Being quick to act and address customer issues while demonstrating strong judgment/decision making</li><li>A high degree of ownership and the ability to handle sensitive situations with care and empathy</li><li>Ability to work within fast-paced environment requiring ability to quickly pivot through several communication forms, prioritization of work to be completed as well as follow-through, and execution with attention to details while always keeping the customers’ needs first<br/><br/></li></ul>About Aston Carter:<br/><br/>Aston Carter provides world-class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry-leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Aston Carter, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options.", "postedDate": "2 hours ago", "skills": ["Microsoft Office Suite", "Customer Service", "Communication", "Benefits", "Human Resources", "Call Center", "Time Management", "Organizational Skills", "Problem Solving", "Decision Making", "Empathy", "Technical Aptitude"], "url": "https://www.linkedin.com/jobs/view/4005926504"}