{"jobTitle": "Interior Designer", "company": {"name": "Actalent", "industry": "Business Consulting and Services", "location": "Charlotte, NC"}, "location": "Charlotte, NC", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Business Consulting and Services", "description": "<strong>Job Title: Interior Designer – Multifamily Studio<br/><br/></strong><strong>Job Description<br/><br/></strong>Join our Architecture division and leverage your skills in a dynamic environment that covers projects from initial feasibility studies to construction administration and start-up. We are seeking an Interior Designer for our multifamily studio, based in Charlotte, NC. The successful candidate will be instrumental in maintaining client confidence and satisfaction for repeat business, working autonomously to deliver exceptional results.<br/><br/>Hard Skills<br/><br/><ul><li>Minimum 3 years of architectural experience in a production environment</li><li>Bachelor’s degree in Architecture from an accredited school</li><li>Revit proficiency (minimum 3 years)</li><li>Knowledge of drawing production for presentation, zoning, and contract documents</li><li>Rendering ability from Revit</li><li>Understanding of building systems, costs, and accessibility codes<br/><br/></li></ul>Soft Skills<br/><br/><ul><li>Strong communication skills (verbal and written)</li><li>Good interpersonal skills and diplomacy</li><li>Ability to solve technical issues</li><li>Passion for building design<br/><br/></li></ul>Work Site<br/><br/>This is an on site position.<br/><br/><strong>About Actalent<br/><br/></strong>Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options.", "postedDate": "1 hour ago", "skills": ["Revit", "Architectural Experience", "Communication Skills", "Interpersonal Skills", "Problem Solving", "Building Design"], "url": "https://www.linkedin.com/jobs/view/4005928039"}