{"jobTitle": "CAD Drafter (ENTRY LEVEL)", "company": {"name": "Actalent", "location": "Pittsburgh, PA"}, "location": "Pittsburgh, PA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Business Consulting and Services", "description": "ENTRY LEVEL!<br/><br/>Applicants must be able to work on site Monday-Friday in Pittsburgh, PA. Hours are 7:30am-4:00pm. Must have some CAD experience/exposure.<br/><br/>Great opportunity to get into the drafting/design industry! CAD Drafters will get 100% on the job training for the first 1-2 weeks. After the training period, the CAD Drafter will be put on a team lead by a QC Specialist, and will be responsible for doing AutoCAD or MicroStation drafting work!<br/><br/>Job Responsibilities &amp; Requirements:<br/><br/><ul><li>High School diploma or completed GED</li><li>Experience using CAD to some extent, or interest in learning</li><li>Desire to work in a drafting role long-term</li><li>Open to learning new software</li><li>Ability to work in a fast-paced environment</li><li>Associate's Degree or certificate in CAD is a bonus</li><li>Experience with ESRI ArcGIS is a bonus<br/><br/></li></ul>About Actalent<br/><br/>Actalent is a global leader in engineering and sciences services and talent solutions. We help visionary companies advance their engineering and science initiatives through access to specialized experts who drive scale, innovation and speed to market. With a network of almost 30,000 consultants and more than 4,500 clients across the U.S., Canada, Asia and Europe, Actalent serves many of the Fortune 500.<br/><br/>Diversity, Equity &amp; Inclusion<br/><br/>At Actalent, diversity and inclusion are a bridge towards the equity and success of our people. DE&amp;I are embedded into our culture through:<br/><br/><ul><li>Hiring diverse talent</li><li>Maintaining an inclusive environment through persistent self-reflection</li><li>Building a culture of care, engagement, and recognition with clear outcomes</li><li>Ensuring growth opportunities for our people<br/><br/></li></ul>The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.<br/><br/>If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email actalentaccommodation@actalentservices.com for other accommodation options.", "postedDate": "2 hours ago", "skills": ["CAD", "AutoCAD", "MicroStation", "ESRI ArcGIS"], "url": "https://www.linkedin.com/jobs/view/4005930584"}