{"jobTitle": "Studio Runner", "company": {"name": "Create Music Group", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "17.28", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "Create Music Group is an LA-based digital music company that provides artists and labels with distribution, rights management, and creative services. We monetize over 12 billion monthly music streams and have collected over $150 Million in previously unclaimed revenue for artists and labels. Clients include Future, JLo, City Girls, Marshmello, Don Diablo, Trippie Redd, Migos, Universal Music Group, and more.<br/><br/><strong>Summary<br/><br/></strong>The Studio Runner will be working part time on an on call basis on weekends as needed by the Studio Manager. This role will be supporting with studio setup, troubleshooting for clients, and maintaining cleanliness in the studio at all times.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Support with setting up the studio, plugging in mics, routing the patchbay, troubleshooting errors as needed for clients</li><li>May go on runs to purchase tools as needed for clients</li><li>Maintaining studio cleanliness and etiquette at all times</li><li>Display a professional and personable attitude while respecting the privacy and workflow of clients at all times</li><li>May assist with miscellaneous projects as assigned by studio management<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Must be willing to work part time on weekends on call as needed</li><li>Educational training in audio engineering preferred</li><li>Extensive knowledge of Pro Tools and Logic Pro X</li><li>Extensive knowledge in pitch editing programs such as Antares Autotune 7 and Celemony's Melodyne</li><li>Excellent in troubleshooting equipment and signal flow</li><li>Excellent time management and organization skills<br/><br/></li></ul><strong>Pay Scale<br/><br/></strong><ul><li>$17.28/hour<br/><br/></li></ul>Create Music Group is an equal opportunity employer dedicated to diversity and inclusion. We invite qualified candidates to apply by submitting a resume and/or a cover letter that highlights how they can contribute to the company's strategic and operational goals.", "responsibilities": "Support with setting up the studio, plugging in mics, routing the patchbay, troubleshooting errors as needed for clients, May go on runs to purchase tools as needed for clients, Maintaining studio cleanliness and etiquette at all times, Display a professional and personable attitude while respecting the privacy and workflow of clients at all times, May assist with miscellaneous projects as assigned by studio management", "qualifications": {"required": "Must be willing to work part time on weekends on call as needed, Educational training in audio engineering preferred, Extensive knowledge of Pro Tools and Logic Pro X, Extensive knowledge in pitch editing programs such as Antares Autotune 7 and Celemony's Melodyne, Excellent in troubleshooting equipment and signal flow, Excellent time management and organization skills"}, "skills": ["Pro Tools", "Logic Pro X", "Antares Autotune 7", "Celemony's Melodyne", "Troubleshooting", "Time Management", "Organization"], "postedDate": "5 hours ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/4005858065"}