{"jobTitle": "Strategic Sourcing Manager", "company": {"name": "LinkedIn", "location": "Sunnyvale, CA"}, "location": "Sunnyvale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$103,000 to $168,000", "currency": "USD"}, "jobFunction": "Marketing", "industry": "Technology, Information and Internet", "description": "Company Description<br/><br/>LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.<br/><br/>Join us to transform the way the world works.<br/><br/>Job Description<br/><br/>At LinkedIn, we trust each other to do our best work where it works best for us and our teams. This role offers a hybrid work option, meaning you can both work from home and commute to a LinkedIn office, depending on what’s best for you and when it is important for your team to be together.<br/><br/>The Strategic Sourcing Manager role requires strong partnership with the business to strategically manage spend and opportunities for the assigned categories. The Strategic Sourcing Manager develop category-sourcing strategy and lead cross-functional teams to execute the sourcing and supplier management strategy for their assigned categories.  <br/><br/>The Strategic Sourcing Manager will be responsible for Professional Services, Outsourcing Services, Managed Services, HR Services, IT Services, and related services, and have accountability to deliver against department and functional goals. You will need a strong sense of urgency and the ability to drive resolutions. <br/><br/>This role requires a customer orientation with emphasis on strong analysis, category expertise, and a passion for driving innovation and value creations. The successful candidate will have a strong sense of ownership of the whole customer experience. <br/><br/>This role requires experience with strategic sourcing methodologies related to indirect procurement categories by performing market and spend analysis and then working with the business to build a category roadmap, perform sourcing activities, leading contract negotiations and award to supplier, and then utilizing scorecards and quarterly business reviews to monitor supplier performance. <br/><br/>Responsibilities: <br/><br/><ul><li>Effectively communicate the mission of Strategic Sourcing and educate internal stakeholders at all levels. </li><li>Ability to develop and execute Sourcing Strategy for the Categories. </li><li>Ability to develop and execute Sourcing Recommendations. </li><li>Ability to collaborate with internal and external partners to construct flexible and scalable outsourcing models including scopes, deliverables, key / critical metrics, acceptance criteria, governance models, etc. </li><li>Ability to lead or facilitate the Outsourcing Life Cycle, including industry analysis, supplier analysis, RFP package development, Supplier selections, Sourcing Recommendation, SOW development &amp; execution, etc. </li><li>Ability to think both strategically and operationally; ideal candidate can manage multiple categories with high level of internal client relationship management skills.   </li><li>Act as Commercial Advisor to Internal Stakeholders with regards to market insights, commercial &amp; operation risks, supplier selection and favorable legal and commercial terms. </li><li>Maintain strong external focus and ability to build strong external partner relationships. </li><li>Propose and drive opportunities for optimal value through analysis of current spend and external category analysis and benchmarking. </li><li>Brings business and sourcing perspectives together, helping the business to see the potential and impact of sourcing recommendations. </li><li>Drives cross-functional negotiation teams, influences customers in the decision-making process, implements world-class negotiation techniques and contractual clauses.  </li><li>Responsible for drafting commercial terms, negotiating, reviewing and the approval of contracts for assigned categories.</li><li>Manage preferred supplier relationships, monitor performance, and analyze category spend, build, and maintain category plans in connection with business leaders to define and strategically leverage spending with proactive focus on major spend initiatives.</li><li>Be a champion for change that can act decisively to drive decisions, while demonstrating agility to support the evolution of business needs. </li><li>Manage the assigned supplier base through supplier scorecards and quarterly business reviews. <br/><br/><br/></li></ul>Qualifications<br/><br/>Basic Qualifications:<br/><br/><ul><li>BA/BS degree or equivalent experience </li><li>5+ years' experience in procurement, sourcing, or purchasing background</li><li>6+ years' experience in managing multiple category areas and procuring goods/services</li><li>Experience in various categories including Financial Services, Consulting Services, Legal Services, and IT Services<br/><br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Master’s degree</li><li>Assertiveness with execution excellence mindset</li><li>Excellent communication, analytical, leadership and negotiating skills</li><li>Collaborative and mindful in successful internal &amp; external relationship development.</li><li>Expertise in developing outsourcing and commercial models &amp; execution across Professional Services, Outsourcing Services, Managed Services, HR Services, and IT Services</li><li>Ability to work efficiently in a dynamic environment with global internal stakeholders in different time zones</li><li>Ability to deal with ambiguity<br/><br/><br/></li></ul>Suggested Skills:<br/><br/><ul><li>Communication</li><li>Strategic Sourcing</li><li>Negotiation<br/><br/><br/></li></ul>LinkedIn is committed to fair and equitable compensation practices.<br/><br/>The pay range for this role is $103,000 to $168,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor.<br/><br/>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.<br/><br/>Additional Information<br/><br/>Equal Opportunity Statement<br/><br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: EEO Statement_2020 - Signed.pdf.<br/><br/>Please reference the following information for more information: https://legal.linkedin.com/content/dam/legal/LinkedIn_EEO_Statement_2020.pdf.<br/><br/>Please reference the following information for more information: https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf and<br/><br/>https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/><br/>LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.<br/><br/>If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.<br/><br/>Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:<br/><br/><ul><li>Documents in alternate formats or read aloud to you</li><li>Having interviews in an accessible location</li><li>Being accompanied by a service dog</li><li>Having a sign language interpreter present for the interview<br/><br/><br/></li></ul>A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.<br/><br/>LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>San Francisco Fair Chance Ordinance <br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.<br/><br/>Pay Transparency Policy Statement <br/><br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates <br/><br/>Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.<br/><br/><br/>Equal Opportunity Statement<br/>LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.<br/> <br/>LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response.<br/> <br/>In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days.<br/> <br/> LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.<br/><br/>Pay Transparency Policy Statement<br/>As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.<br/><br/>Global Data Privacy Notice for Job Candidates<br/>This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice<br/>", "responsibilities": "<ul><li>Effectively communicate the mission of Strategic Sourcing and educate internal stakeholders at all levels. </li><li>Ability to develop and execute Sourcing Strategy for the Categories. </li><li>Ability to develop and execute Sourcing Recommendations. </li><li>Ability to collaborate with internal and external partners to construct flexible and scalable outsourcing models including scopes, deliverables, key / critical metrics, acceptance criteria, governance models, etc. </li><li>Ability to lead or facilitate the Outsourcing Life Cycle, including industry analysis, supplier analysis, RFP package development, Supplier selections, Sourcing Recommendation, SOW development &amp; execution, etc. </li><li>Ability to think both strategically and operationally; ideal candidate can manage multiple categories with high level of internal client relationship management skills.   </li><li>Act as Commercial Advisor to Internal Stakeholders with regards to market insights, commercial &amp; operation risks, supplier selection and favorable legal and commercial terms. </li><li>Maintain strong external focus and ability to build strong external partner relationships. </li><li>Propose and drive opportunities for optimal value through analysis of current spend and external category analysis and benchmarking. </li><li>Brings business and sourcing perspectives together, helping the business to see the potential and impact of sourcing recommendations. </li><li>Drives cross-functional negotiation teams, influences customers in the decision-making process, implements world-class negotiation techniques and contractual clauses.  </li><li>Responsible for drafting commercial terms, negotiating, reviewing and the approval of contracts for assigned categories.</li><li>Manage preferred supplier relationships, monitor performance, and analyze category spend, build, and maintain category plans in connection with business leaders to define and strategically leverage spending with proactive focus on major spend initiatives.</li><li>Be a champion for change that can act decisively to drive decisions, while demonstrating agility to support the evolution of business needs. </li><li>Manage the assigned supplier base through supplier scorecards and quarterly business reviews. <br/><br/><br/></li></ul>", "qualifications": {"required": "<ul><li>BA/BS degree or equivalent experience </li><li>5+ years' experience in procurement, sourcing, or purchasing background</li><li>6+ years' experience in managing multiple category areas and procuring goods/services</li><li>Experience in various categories including Financial Services, Consulting Services, Legal Services, and IT Services<br/><br/><br/></li></ul>", "preferred": "<ul><li>Master’s degree</li><li>Assertiveness with execution excellence mindset</li><li>Excellent communication, analytical, leadership and negotiating skills</li><li>Collaborative and mindful in successful internal &amp; external relationship development.</li><li>Expertise in developing outsourcing and commercial models &amp; execution across Professional Services, Outsourcing Services, Managed Services, HR Services, and IT Services</li><li>Ability to work efficiently in a dynamic environment with global internal stakeholders in different time zones</li><li>Ability to deal with ambiguity<br/><br/><br/></li></ul>"}, "skills": ["Communication", "Strategic Sourcing", "Negotiation"], "postedDate": "1 hour ago", "benefits": "LinkedIn is committed to fair and equitable compensation practices.<br/><br/>The pay range for this role is $103,000 to $168,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor.<br/><br/>The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005878528"}