{"jobTitle": "University Recruiter", "company": {"name": "Stripe", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$107,500.00 - $161,300.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Software Development, Financial Services, and Technology, Information and Internet", "description": "Who we are<br/><br/>Stripe is a technology company that builds economic infrastructure for the internet. Businesses of all sizes—from new startups to public companies like Amazon and Salesforce—use our software to accept online payments and run technically sophisticated financial operations in more than 100 countries. By helping businesses accept payments from anywhere in the world and accelerating the economic shift from offline to online, we aim to increase the GDP of the internet.<br/><br/>What you’ll do<br/><br/>To further this important mission, we are looking for a consultative and creative University Recruiter to grow and scale our early talent programs and teams. You can expect high impact and wide-ranging responsibility: owning full-cycle recruiting, driving hiring strategy, leading first-in-kind searches, and delivering best-in-class candidate experience. This person must be a builder who thrives in a learning environment—unafraid to try new things, embrace new ideas, and welcome suggestions for how we can iterate on our processes.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Partner closely with organizations across Stripe to help build their university recruiting strategy</li><li>Manage the full-cycle recruiting process for new graduate and intern candidates across multiple roles and offices</li><li>Develop deep relationships with university groups, including faculty and student organizations, to design school-specific strategies that enhance our value proposition and brand on campus</li><li>Plan and execute on campus and virtual events with a focus on early engagement, education, and strategic branding</li><li>Screen candidates and ensure that our hiring process is consistent and inclusive</li><li>Drive a positive candidate experience for every new graduate and intern candidate considering a career at Stripe</li><li>Build and iterate on our year-round internship program alongside teammates and cross-functional stakeholders</li><li>Act as a resource to interns from hire to full-time conversion</li><li>Proactively share data-centric updates with internal stakeholders to maintain aligned decision making and build trusted partnerships<br/><br/><br/></li></ul>Who you are<br/><br/>We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.<br/><br/><strong>Minimum Requirements<br/><br/></strong><ul><li>A passion for building teams and delivering exceptional candidate experience for early talent</li><li>Excellent verbal and written communication skills with an appropriate blend of professionalism and friendliness</li><li>Proven abilities to create a strategic campus strategy and build a diverse pipeline</li><li>An active and data driven approach to problem solving, using data to identify trends and applying insights to drive efficient recruiting strategies</li><li>A growth mindset and is truly flexible, can shift tasks and priorities as circumstances change (At a fast-growing startup, they often do)</li><li>An interest in working in a cross-functional and fluid environment, the ability to learn quickly, and welcome new perspectives</li><li>Ability and willingness to travel up to 30% during peak recruiting cycles and work flexible hours as needed<br/><br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>A minimum of 3-4 years full-cycle university recruiting experience in a fast-paced, high-growth environment<br/><br/><br/></li></ul>Working remotely at Stripe<br/><br/>A remote location, in most cases, is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on-sites, meet-ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently or plan to live.<br/><br/>Pay and benefits<br/><br/>The annual US base salary range for this role is $107,500 - $161,300. For sales roles, the range provided is the role’s On Target Earnings (“OTE”) range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process.<br/><br/>Additional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends.", "responsibilities": "Partner closely with organizations across Stripe to help build their university recruiting strategy\nManage the full-cycle recruiting process for new graduate and intern candidates across multiple roles and offices\nDevelop deep relationships with university groups, including faculty and student organizations, to design school-specific strategies that enhance our value proposition and brand on campus\nPlan and execute on campus and virtual events with a focus on early engagement, education, and strategic branding\nScreen candidates and ensure that our hiring process is consistent and inclusive\nDrive a positive candidate experience for every new graduate and intern candidate considering a career at Stripe\nBuild and iterate on our year-round internship program alongside teammates and cross-functional stakeholders\nAct as a resource to interns from hire to full-time conversion\nProactively share data-centric updates with internal stakeholders to maintain aligned decision making and build trusted partnerships", "qualifications": {"required": "A passion for building teams and delivering exceptional candidate experience for early talent\nExcellent verbal and written communication skills with an appropriate blend of professionalism and friendliness\nProven abilities to create a strategic campus strategy and build a diverse pipeline\nAn active and data driven approach to problem solving, using data to identify trends and applying insights to drive efficient recruiting strategies\n A growth mindset and is truly flexible, can shift tasks and priorities as circumstances change (At a fast-growing startup, they often do)\nAn interest in working in a cross-functional and fluid environment, the ability to learn quickly, and welcome new perspectives\nAbility and willingness to travel up to 30% during peak recruiting cycles and work flexible hours as needed", "preferred": "A minimum of 3-4 years full-cycle university recruiting experience in a fast-paced, high-growth environment"}, "skills": ["University Recruiting", "Campus Recruiting", "Early Talent", "Recruiting Strategy", "Candidate Experience", "Data Driven", "Problem Solving", "Growth Mindset", "Cross-Functional", "Communication", "Travel"], "postedDate": "2 hours ago", "benefits": "equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005943858"}