{"jobTitle": "Personal Assistant to the CEO", "company": {"name": "Swooped", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000 to $120,000", "currency": "USD"}, "jobFunction": "Administrative and General Business", "industry": "Computer and Network Security and Technology, Information and Media", "description": "<strong>About Our Client</strong>\nAs a leading NFT marketplace, the organization is pioneering a new frontier where art, games, technology, and commerce converge in fascinating and unprecedented ways. The platform empowers millions of creators, collectors, and developers to easily showcase, discover, buy, and sell unique digital items.\n\n<br/>\n\nThe team consists of rigorous problem solvers, visionary futurists, proactive doers, and effective communicators. As a remote-first company, it enables team members to work from anywhere while making time to come together as a team to collaborate and connect in person throughout the year.\n\n<br/>\n\nThis position is ideal for a highly organized, proactive individual who is flexible and detail-oriented, adept at managing various tasks and supporting the daily personal and professional activities of the CEO. If you thrive in a supportive role and are capable of maintaining a calm and professional demeanor while ensuring the CEO's day-to-day operations run smoothly and efficiently, you are encouraged to apply.\n\n<br/>\n\n<strong>Desired Experience</strong>\n- Proven experience in managing schedules and commitments with precision and attentiveness.\n- Strong communication skills, both written and verbal, with an ability to manage correspondence and effectively relay information.\n- Ability to multitask and prioritize tasks effectively in a dynamic environment.\n- Commitment to maintaining confidentiality and demonstrating the utmost discretion at all times.\n\n<br/>\n\n<strong>Responsibilities:</strong>\n- Manage and coordinate the CEO’s daily schedule, including setting up meetings, appointments, and travel arrangements.\n- Handle personal tasks and errands for the CEO, ranging from managing household staff to personal shopping and scheduling personal appointments.\n- Assist in preparing for meetings by organizing materials, taking notes, and ensuring follow-up tasks are completed.\n- Provide administrative support such as filing documents, managing emails, and answering phone calls.\n\n<br/>\n\n<strong>Salary Range</strong>\nThe base salary for this full-time position, which spans across multiple levels depending on qualifications, ranges between <strong>$80,000 to $120,000.</strong>", "postedDate": "1 hour ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/4005901548"}