{"jobTitle": "Technical Support Analyst", "company": {"name": "Privia Health", "location": "Arlington, VA"}, "location": "Arlington, VA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "19.23- $24.00hr", "currency": "USD"}, "jobFunction": "Customer Service", "industry": "Hospitals and Health Care", "description": "<strong>Company Description<br/><br/></strong>Privia Health™ is a technology-driven, national physician enablement company that collaborates with medical groups, health plans, and health systems to optimize physician practices, improve patient experiences, and reward doctors for delivering high-value care in both in-person and virtual settings. The Privia Platform is led by top industry talent and exceptional physician leadership, and consists of scalable operations and end-to-end, cloud-based technology that reduces unnecessary healthcare costs, achieves better outcomes, and improves the health of patients and the well-being of providers.<br/><br/><strong>Job Description<br/><br/></strong>The Technical Support Analyst role offers a dynamic opportunity to develop skills while working across a broad spectrum of customer experience and technology services. This position is responsible for delivering comprehensive hardware, software, and systems support to both healthcare providers and corporate employees. This role offers the unique opportunity to blend remote work flexibility with on-site engagement at our headquarters. By providing technical assistance and troubleshooting across a broad spectrum of customer experience and technology services, the Analyst ensures seamless operations and maintains high-quality support. The ideal candidate will be innovative, energetic, and adaptable, with the ability to manage a high volume of requests while consistently upholding exceptional support standards.<br/><br/><strong>Primary Job Duties<br/><br/></strong><ul><li>Respond to a high volume of inquiries via email, phone, and other communication channels, providing professional and customer-focused support.</li><li>Deliver hardware, software, and general systems support for end-user computers, troubleshooting issues, and providing timely resolutions.</li><li>Assist care center staff and corporate users with technology systems including athenaNet, Privia Connect, Salesforce, and other software applications.</li><li>On-Site Visits: Travel to headquarters as leadership discretion to provide on-site technical support, address complex issues, and collaborate with internal teams.</li><li>Effective Case Management: Manage a diverse range of cases, ensuring timely and effective resolution while maintaining clear communication and adherence to service level agreements (SLAs).</li><li>Project Collaboration: Work with cross-functional teams on projects and tasks, both remotely and on-site, to resolve issues and contribute to successful project outcomes.</li><li>Process Improvement: Identify and implement process improvements. Contribute to the development of new support methodologies and report common issues and trends to management.</li><li>Documentation: Accurately document all customer interactions, technical solutions, and issue resolutions in the knowledge base or ticketing system.</li><li>Training and Development: Stay current with the latest technology trends and industry best practices. Continuously enhance personal expertise and skills.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Education: High school diploma required; Associate’s degree or equivalent work experience preferred.</li><li>Experience: 2+ years of relevant work experience. Healthcare experience is preferred.</li><li>Technical Skills: Proficiency with Google Apps, ConnectWise, Salesforce, and experience with iOS, Android, Windows, and Desktop Mac systems. Familiarity with networking concepts is a plus.</li><li>Remote and On-Site Experience: Experience working in a remote environment, with the flexibility and willingness to travel to headquarters for on-site support.</li><li>Customer Service: Strong customer service and communication skills, with the ability to interact professionally with customers and provide effective technical assistance.</li><li>Adaptability: Ability to quickly adapt to changing processes, procedures, and technologies in a fast-paced environment.</li><li>Problem-Solving: Excellent problem-solving skills with the ability to research, analyze, and resolve complex technical issues.</li><li>Productivity: Proven track record of maintaining high productivity levels while delivering quality support and meeting SLAs.</li><li>Team Collaboration: Collaborative mindset and readiness to work with cross-functional teams to resolve issues and achieve organizational goals.</li><li>Documentation Skills: Strong skills in documenting interactions, solutions, and issue resolutions.</li><li>Continuous Learning: Passion for staying up to date with technology trends and industry best practices.</li><li>HIPAA Compliance: Understanding of and ability to comply with all HIPAA rules and regulations.<br/><br/><br/></li></ul><em>The hourly rate range for this role is $19.23- $24.00hr in base pay. </em>This role is also eligible for an annual bonus targeted at 10%. The base pay offered will be determined based on relevant factors such as experience, education, and geographic location.<br/><br/><strong>Additional Information<br/><br/></strong>All your information will be kept confidential according to EEO guidelines.<br/><br/>Preferred experience with profession-based telephonic or remote communication<br/><br/><ul><li>Must comply with all HIPAA rules and regulations<br/><br/><br/></li></ul><strong>﻿Technical Requirements (for remote workers only, not applicable for onsite/in office work):<br/><br/></strong><strong>In order to successfully work remotely, supporting our patients and providers, we require a minimum of 5 MBPS for Download Speed and 3 MBPS for the Upload Speed. This should be acquired prior to the start of your employment. The best measure of your internet speed is to use online speed tests like https://www.speedtest.net/. This gives you an update as to how fast data transfer is with your internet connection and if it meets the minimum speed requirements. Work with your internet provider if you have questions about your connection. Employees who regularly work from home offices are eligible for expense reimbursement to offset this cost.<br/><br/></strong>Privia Health is committed to creating and fostering a work environment that allows and encourages you to bring your whole self to work. Privia is a better company when our people are a reflection of the communities that we serve. Our goal is to encourage people to pursue all opportunities regardless of their age, color, national origin, physical or mental (dis)ability, race, religion, gender, sex, gender identity and/or expression, marital status, veteran status, or any other characteristic protected by federal, state or local law.", "responsibilities": "The Technical Support Analyst role offers a dynamic opportunity to develop skills while working across a broad spectrum of customer experience and technology services. This position is responsible for delivering comprehensive hardware, software, and systems support to both healthcare providers and corporate employees. This role offers the unique opportunity to blend remote work flexibility with on-site engagement at our headquarters. By providing technical assistance and troubleshooting across a broad spectrum of customer experience and technology services, the Analyst ensures seamless operations and maintains high-quality support. The ideal candidate will be innovative, energetic, and adaptable, with the ability to manage a high volume of requests while consistently upholding exceptional support standards.", "qualifications": {"required": "Education: High school diploma required; Associate’s degree or equivalent work experience preferred.\nExperience: 2+ years of relevant work experience. Healthcare experience is preferred.\nTechnical Skills: Proficiency with Google Apps, ConnectWise, Salesforce, and experience with iOS, Android, Windows, and Desktop Mac systems. Familiarity with networking concepts is a plus.\nRemote and On-Site Experience: Experience working in a remote environment, with the flexibility and willingness to travel to headquarters for on-site support.\nCustomer Service: Strong customer service and communication skills, with the ability to interact professionally with customers and provide effective technical assistance.\nAdaptability: Ability to quickly adapt to changing processes, procedures, and technologies in a fast-paced environment.\nProblem-Solving: Excellent problem-solving skills with the ability to research, analyze, and resolve complex technical issues.\nProductivity: Proven track record of maintaining high productivity levels while delivering quality support and meeting SLAs.\nTeam Collaboration: Collaborative mindset and readiness to work with cross-functional teams to resolve issues and achieve organizational goals.\nDocumentation Skills: Strong skills in documenting interactions, solutions, and issue resolutions.\nContinuous Learning: Passion for staying up to date with technology trends and industry best practices.\nHIPAA Compliance: Understanding of and ability to comply with all HIPAA rules and regulations.", "preferred": "Healthcare experience is preferred."}, "skills": ["Google Apps", "ConnectWise", "Salesforce", "iOS", "Android", "Windows", "Desktop Mac", "Networking", "Customer Service", "Problem-Solving", "HIPAA"], "postedDate": "2 hours ago", "benefits": "The base pay offered will be determined based on relevant factors such as experience, education, and geographic location.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/4005894522"}