{"id": 790298014629, "name": "Network Provisioning Engineer", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721962070, "t_create": 1721260800, "ats_job_id": "AJRT44801", "display_job_id": "AJRT44801", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix is responsible for over one-third of Internet traffic at peak times and we work collaboratively with <a href=\"http://media.netflix.com/en/company-blog/how-netflix-works-with-isps-around-the-globe-to-deliver-a-great-viewing-experience\" target=\"_blank\">thousands of ISPs</a> to deploy <a href=\"http://openconnect.netflix.com/Open-Connect-Overview.pdf\" target=\"_blank\">Open Connect,</a> Netflix&#39;s Content Delivery Network. As Netflix grows globally, we continue to look for the best and brightest talent to scale with our growth opportunity.  <br /><br />We have a global network connecting hundreds of sites and thousands of partners. Inter connecting our studios, offices, internet exchanges, and partners takes technical know-how, the ability to manage complex projects, and excellent communication skills. We are seeking a Network Provisioning Engineer to help scale our CDN, Live, corporate, and studio connectivity.</p><p></p><p>Your responsibilities will include</p><ul><li>Managing the installation and turn-up of connectivity; ensure contractual acceptance is met in accordance with vendor MSA including receipt and review of circuit design records and circuit testing results</li><li>Ensuring circuits are designed to standard (resiliency/redundancy, latency, etc.)</li><li>Working with various data centers, vendors, internal teams, and partners to troubleshoot connectivity and provide clean, error-free handoff for activation </li><li>Testing, troubleshooting, and acceptance of all data center cross connects and network circuits</li><li>Identify trends and proactively recommend hardware and internal fiber augments</li><li>Providing support for new site builds, moves, and expansions; plan large scale circuit migrations with data center providers, vendors and partners</li><li>Communicating with Technical Infrastructure Delivery, Business Operations, Logistics, Infrastructure Procurement and Network Engineering teams to streamline service delivery for various stakeholders</li><li>Working with data center vendors and telecommunication providers to ensure reliable and functional connectivity per Netflix standards</li><li>Reducing potential risks to upcoming projects timelines, by identifying issues and providing solutions</li><li>Managing vendor for on time delivery of services, escalate issues to account teams as appropriate and manage expectations of customers both internal and external on a periodic basis</li><li>Conducting regularly scheduled audits of all connectivity to ensure accurate inventory and invoicing</li></ul><p></p><p>You will be successful in this role if you</p><ul><li>Thrive and enjoy working in a high performance, fast-paced environment.</li><li>Possess a fierce attention to detail with the ability to manage multiple circuit installations concurrently.</li><li>Are an effective collaborator with excellent communication skills; able to articulate complex ideas in a direct, concise way.</li><li>Can develop and seek process improvements and strategies to further automate and streamline provisioning workflows.</li><li>Are comfortable with not being onsite doing the actual work, but instead, planning and documenting the work to be executed by remote hand partners.</li><li>Possess the ability to troubleshoot issues remotely -- coordinating and communicating with remote hands, vendors, tools, and other teams to quickly isolate and remediate installation issues.</li></ul><p></p><p>Requirements</p><ul><li>Team player with the ability to build peer and external relationships</li><li>Support a global organization; able to time shift to lead or support projects executed in other time zones</li><li>In-depth understanding of dark fiber, wavelength, DIA, WDWM</li><li>Understand the usage of patch panels, fiber optic connectors, optic types and form factors</li><li>Understanding of basic router command lines for troubleshooting</li><li>Excellent written and verbal communications skills, able to provide detailed instructions for contemporaries to follow and execute</li><li>Extensive knowledge of the telecommunications carrier and data center industry </li><li>Ability to travel when required (Occasional)</li><li>Ability to manage high volume of orders</li><li>Ability to participate in team on-call</li><li>Ability to solve order issues and handle escalations</li><li></li></ul><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.<br /><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here.</a></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44801-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014629", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44801"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
