{"id": 790298014527, "name": "Project Coordinator, Scaled Launch Operations", "location": "Mumbai, Maharashtra, India", "locations": ["Mumbai, Maharashtra, India"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1710720000, "t_create": 1710720000, "ats_job_id": "JR27922", "display_job_id": "JR27922", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>As Netflix’s global member base grows from 250&#43; million members, the ability to operate at scale without compromising on quality is paramount to our success. Netflix is looking for a skilled Project Coordinator to join its Scaled Launch Operations team in Mumbai.</p><p></p><p><br /><br />This team will be part of a broader operational hub strategy and manages the launch readiness process, focusing on the on-service promotion of our content, by combining rigorous project management and risk mitigation with a strategic, member-first mindset.</p><p></p><p></p><p><br />This is an exciting opportunity for a Project Coordinator with a passion for operations in service of delivering promotional material for Netflix titles to our global members, at scale. If you are analytically minded and your attention to detail is unmatched, you excel at challenging the status quo and influencing change, you thrive in a global team, possess a high level of intellectual curiosity, and demonstrate strong judgement in the face of ambiguity, then this role is for you. </p><p></p><p><br /><br />The Project Coordinator will align with multiple cross-functionals across the globe, track multiple assets, assign to required teams, monitor finalized asset delivery all the while ensuring their accuracy and that they are available for member consumption. You will manage a large volume of titles across the global slate, have effective communication, manage dependencies with moving launch targets, predicting and mitigating risks and pivot as required with short turnaround time.</p><p></p><p></p><p><br />What You’ll Do:</p><ul><li>You will own and be accountable for some of the critical workflows, which affect  how the Member views the titles from across the globe.  While multiple teams (internal and external) are responsible for creating and delivering assets, you will be responsible for ensuring those assets are coming in at the right time to support the predetermined launch date that all of your stakeholders are aligned to. </li><li>You will help shape and redesign existing workflows to help accelerate the efficiency of our operations in line with key business objectives for our group.  </li><li>Partner with internal and external teams (vendors) to ensure operational momentum and seamlessness across launches. </li><li>Exercise sound judgement and risk mitigation to create/modify delivery and launch plans including use cases that fall outside the norm.</li><li>Partner with our Technology, Engineering, Partnerships, and Quality Control teams within Global Product Creative Operations, to guide tooling, workflow, and vendor needs to help scale operations. </li></ul><p></p><p>What You’ll Need:</p><ul><li>The candidate must have 5&#43; years of experience in project management / coordination roles</li><li>Ability to handle a fast-paced environment and the ability to keep multiple priorities moving at the same time</li><li>Excellent verbal and written communication skills with a self starter mentality</li><li>An analytical and innovative mindset with a passion for operational excellence</li><li>Attention to detail while executing on work across several tools and systems</li><li>The ability to build deep cross-functional relationships </li><li>An optimistic, solutions-driven attitude in the most challenging situations</li><li>Fluency in an additional language is a bonus</li><li>The ability to adapt to the <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">Netflix culture and values</a></li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR27922-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014527", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27922"], "team": ["Engineering Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
