{"id": 790298010716, "name": "Marketing Manager - Film & Series Thailand", "location": "Bangkok, Thailand", "locations": ["Bangkok, Thailand"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1718150400, "t_create": 1718150400, "ats_job_id": "JR28461", "display_job_id": "JR28461", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to join Netflix. We are shaping the future of global entertainment, bringing new stories to millions of people worldwide. Our marketing is focused on bringing consumers to our service through breakthrough campaigns for some of the most compelling, exclusive content in the world.\n\nSince launching Netflix worldwide, we have witnessed exciting public reaction and early growth in Asia, and want to scale our operations in the region. We are looking to build a team of passionate, creative, local experts to make Netflix a meaningful contributor to pop culture, and a beacon of the entertainment industry in Thailand.\n\nAs Country Marketing Manager, in Thailand, you will be responsible for developing local strategy and insights for the market, leading best-in-class creative campaigns for our global titles, and driving business growth.\n Key Attributes in Detail: <ul><li>You will lead iconic Netflix campaigns and manage local films and series franchises for subsequent seasons</li><li>You will lead all facets of marketing strategy from establishing films/series positioning, creating Key arts and trailers, overseeing paid media, social/influencer engagement and local launch activations.</li><li>Be a thought partner for Head of Marketing and cross-functional teams and be able to contribute in the formation of strategies</li><li>You will be the key point of contact for Netflix Originals in Thailand, and your cross-functional management (Consumer insights, comms, etc.) will be critical.</li><li>You will manage creative and media agencies to deliver your campaigns.</li></ul> We are looking for someone who: <ul><li>Has deep knowledge in running a 360-campaign, from strategy development to tactical execution (including AV/trailers, digital/social, print, and out-of-home).</li><li>Is a strategic thinker with a business mind: identifying key challenges and critical levers to drive the growth of Netflix in the market.</li><li>Has a deep understanding of consumer insights and how they are translated into creative strategy and campaigns.</li><li>Has a deep knowledge of Thai pop culture.&nbsp;</li><li>Has a proven track record of building world-class creative and launching campaigns that spark excitement and passion within the local community.&nbsp;</li><li>Has a deep understanding of the social media landscape: platform best practices and consumers' (social) media behaviors.</li><li>Is a cross-functional leader who is able to engage, listen and collaborate with internal departments/teams to align early on overall strategy and goals. We want you to see the cross-functional collaboration through the launch.</li><li>Is able to effectively communicate different facets of their campaigns to executives, showrunners, talent and their representatives.</li><li>Has a good understanding of marketing, social, and media analytics and can apply data to the testing and optimization of campaigns.</li><li>Appreciates technology and can collaborate with our world-class product team to integrate our campaigns into the member product experience.</li><li>Is an effective collaborator in a fast-paced, multifaceted environment. We will typically have multiple campaigns launching at once.</li></ul> What We Need From You: <ul><li>Written and Verbal fluency in both English and Thai</li><li>A desire to thrive in our unique culture</li><li>A curious creative mind that can help us establish meaningful connections between Netflix and our non-members in Thailand, exploring innovative ways to express our values and positioning when promoting our original titles</li><li>Native understanding of digital/social marketing combined with the skills to tell compelling stories for the market through media-agnostic ideas</li><li>Deep knowledge of pop culture, having invested thousands of hours consuming content. Someone truly passionate about entertainment, capable of extracting powerful communication insights from our original content</li><li>Ability to manage multiple time-sensitive projects simultaneously without the support of a large team, working both independently and in close collaboration with a wide variety of stakeholders</li><li>Ability to self-motivate in a fast-paced, multifaceted environment</li><li>Capacity to continuously provide and receive constructive, actionable feedback to and from colleagues</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28461-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010716", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28461"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
