{"id": 790298013748, "name": "Engineering Manager, Cloud Games Infrastructure", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1714348800, "t_create": 1714348800, "ats_job_id": "AJRT45008", "display_job_id": "AJRT45008", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service, with almost 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Now, Netflix aims to add the world’s best games to the same subscription!\n\nBring your passion for games and the joy of enabling developers to create the best games to the Netflix membership. We are seeking a highly motivated and passionate individual to lead a software development team that handles work critical to the Open Connect Gaming Appliance. This team coordinates with other groups to integrate new features in a timely and predictable way; handles the appliance software release process (including CI/CD, release automation, and testing); fixes bugs that are found in testing or production; and, interfaces with other groups to ensure their tools and pipelines support the game appliance.\nWe provide the freedom to execute, learn, and pivot and the responsibility to be self-directed, collaborative, and insightful. This gives you the freedom to do your best work and contribute directly to the business's success.\n\nYou will be successful in this role if you:\nAre passionate about leading engineering teams with senior software developers\nEnjoy leading high-functioning teams that produce high-quality software with rapid development cycles\nAre passionate about systems engineering\nAre a quick learner excited about learning new technologies, and unfazed by ambiguity and new challenges\nThrive in an environment with minimal guidance given important context\nEnjoy collaborating with partners across functional teams and have excellent communication skills\nAre comfortable leading a team by empowering individuals with knowledge and freeing them to self-manage their work to do what is best for Netflix with only minimal direction\n\nQualifications: <ul><li>Experience managing/leading successful and highly productive teams</li><li>Experience efficiently building and deploying robust products/features</li><li>Strong track record of cross-functional collaboration</li><li>High comfort with technical complexity and ambiguity, and an interest to pioneer</li></ul> Nice to have: <ul><li>Experience developing and optimizing high-performance, real-time applications such as games or simulations</li><li>Experience with Linux</li><li>Experience with CI/CD systems and SDK&nbsp;</li></ul> Does this sound interesting but intimidating? Please don’t self-select; let’s figure it out together. We’d love to talk to you!\n\nOur culture is unique, and we tend to live by our values, allowing you to do your best work and grow. To learn more about Productivity Engineering, feel free to listen to this podcast.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45008-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013748", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45008"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
