{"id": 790298014097, "name": "Software Engineer (L5) - Developer Enablement Tooling", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719273600, "t_create": 1719273600, "ats_job_id": "JR28326", "display_job_id": "JR28326", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>Within the broader Infrastructure Engineering organization, the goal of the Engineering Operations team is to increase the productivity of Netflix developers by promoting the adoption and adherence to Paved Path products.  Engineering Operations facilitates onboarding of new hires to Netflix,  builds learning and discovery solutions for products in the Paved Road, develops learning solutions and provides technical support enabling Netflix engineers to efficiently solve business problems.  To achieve this goal,  Solution Engineers, Enablement Managers and the Program Managers of Developer Education use various tools to create and manage content and to manage support workflows. The objective of the Developer Enablement Tooling team is two fold, (i) build, support and maintain tools used by colleagues in Developer Enablement and (ii) build and support products used by all Netflix engineers for discovery and learning and to improve their productivity.</p><p></p><p><br /><b>This role is based in Warsaw</b> and our teams work in a <b>hybrid-working model. </b></p><p></p><p><br /><b>Responsibilities</b></p><ul><li>Participate in all aspects of software development starting from brainstorming, design, implementation to deployment and testing</li><li>Understand customer needs by collaborating closely with them and other  stakeholders like Product Managers and Program Managers  </li><li>Create tools and products to increase efficiency of Paved Path Discovery and Learning and Engineering Support workflows</li><li>Collaborate via Slack, GitHub comments, documents, and frequent video calls </li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolve</li></ul><p></p><p><b>Requirements</b></p><ul><li>You have experience developing software applications and designing APIs in Object Oriented languages, primarily Java, Python, Go  and knowledge of React, and JavaScript</li><li>You are passionate about solving developer productivity challenges for engineers at enterprise-scale</li><li>You are biased-to-action and care deeply about the craft of software development</li><li>You are open to working across the stack with primary focus on backend and ability to flex into frontend when needed</li><li>You are self-driven and highly motivated to deliver top-tier solutions with minimal guidance. </li><li>Possess exceptional collaboration and communication skills and a product centric mindset</li><li>You Strive to embrace best practices and are always searching for opportunities to continually improve</li></ul><p></p><p><br />Our culture is unique, and we live by our values, so it’s worth learning more about Netflix culture.</p><p></p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28326-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014097", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28326"], "team": ["Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
