{"id": 790298013393, "name": "Security Engineer (L5) - User Security", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721260800, "t_create": 1721260800, "ats_job_id": "JR28573", "display_job_id": "JR28573", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>About Netflix\nAt Netflix, we do one thing - entertainment - and we aim to do it very well. With over 221 million paid memberships in over 190 countries, we offer a wide variety of award-winning TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. \n\nAbout the Team\nThe Workforce Security team rightsizes corporate security risk across Netflix’s corporate technology footprint (workforce users, vendors, and endpoints). Given our work's broad scope and scale, we achieve this mission by building critical partnerships across Netflix, providing opinionated security guidance, security strategies, architecture reviews, and developing baseline security controls. \n\nWho We Seek\nWe seek a thoughtful and collaborative security engineer who will develop broad security strategies and scalable solutions to manage high-risk areas that impact our Netflix workforce.  Our ideal next team member considers the security landscape holistically, factors in both the business and security context, is open to feedback and guidance, takes an empathetic approach to reduce risk, and is comfortable driving outcomes that impact the entire organization. \n\nDesired Background\nThe ideal candidate for the Senior Security Engineer (L5) - User Security role is a highly skilled and experienced professional with a robust background in user security, including authentication, authorization, identity management, and user behavior and risk analytics. They possess strong technical expertise and the ability to understand complex technical ecosystems to inform and shape their approach. The ideal candidate is also adept at writing broad user security strategies and guidance to align leadership, internal security teams, and external organizations to ensure a cohesive and comprehensive approach to user security across Netflix. Strong problem-solving, communication, and interpersonal skills are essential for success in this role.\n\nWe encourage you to apply even if you don’t meet every criteria listed below. We value each candidate's unique perspectives, skills, and experiences.\nUser Security Expertise <ul><li>Track record of developing broad security strategies and scalable security solutions and driving the execution resulting in landed impact.&nbsp;</li><li>Excellent written and verbal communication skills and can align leadership and cross-functional partners on vision and long-term strategic objectives.</li><li>You have a strong understanding of user security principles and best practices, including working knowledge of authentication, authorization, identity management, user behavior and risk analytics.</li><li>You are a fast learner with experience understanding complex engineering ecosystems and partnering with cross-functional teams in ambiguous problem spaces.</li><li>Your approach is empathetic and user-focused. You always ensure that your strategies consider business needs and employee experience.</li><li>Experience using data to inform decisions and familiarity with quantified risk.</li><li>Prior Merger & Acquisition security expertise is a plus.</li></ul> Some other reasons to work @ Netflix <ul><li>You will be able to facilitate security work that impacts the Netflix workforce.</li><li>You will work with an industry-leading security team, and there will be many opportunities to reduce risks in existing projects and identify new ones.</li><li>You will be able to research new ideas and share your ideas across the community.</li></ul> We seek thoughtful security professionals who enable our mission and support our culture of freedom and responsibility. You can learn more about life at Netflix by watching our security talks or exploring our open source work.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28573-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013393", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28573"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
