{"id": 790298013327, "name": "Capacity Planner, L5 - Live", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1710288000, "t_create": 1710288000, "ats_job_id": "AJRT43245", "display_job_id": "AJRT43245", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen.\n\nThe Open Connect Capacity Planning team is at the center of all efforts to ensure that there’s always enough capacity so that our members always have a great entertainment experience. We provide long range planning by developing proactive strategies that are future compatible, and nimble enough to change course quickly. Working with the engineering and finance teams, Capacity Planning main tasks include: 1) translating demand forecasts into concise, actionable capacity plans, 2) managing utilization by providing reports and dashboards out to key stakeholders, and 3) provide data-driven analyses to continually optimize spend and ensure the platform is scalable far into the future.\n\n The Open Connect Capacity Planning Group is hiring a Capacity Planner to focus on demand and capacity planning\nKey tasks include: <ul><li>Translating forecasted demand from finance into actionable capacity plans&nbsp;</li><li>Analyzing and modeling data to enhance operational efficiency as products, hardware architecture initiatives evolve</li><li>Creating and managing yearly capacity plans for network hardware and IP backbone infrastructure</li><li>Providing oversight and prioritization to ensure capacity arrives in a timely fashion</li><li>Managing reporting and dashboards for overall network utilization, and identifying data needs required to improve reporting</li><li>Continually working to refine workflows that enable the business to achieve alignment and efficiency</li></ul> Who you are: <ul><li>A passion for answering questions with data driven solutions.&nbsp;</li><li>The willingness to experiment with different approaches to new and existing problem sets</li><li>Expertise with data modeling and visualization software and experience developing reports and dashboards</li><li>Expertise in Excel, SQL, Tableau (or other Business intelligence software)</li><li>Strong background using financial analysis for multi variable decision making</li><li>Background in statistical analysis, specifically building and refining demand forecasts.</li><li>Able to independently identify issues, analyze potential solutions, and drive resolutions</li><li>Strong communication skills, both verbal and in writing and experience collaborating across the entire organization including engineering, finance, and product management</li><li>The perspective that delivering results quickly, with iteration, is better than waiting for 100% perfection</li><li>Expertise (or strong curiosity) in the internet ecosystem</li><li>Prefer MBA or MS Statistics&nbsp;</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43245-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013327", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43245"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
