{"id": 790298021069, "name": "Distributed Systems Engineer (L4) - Data Platform", "location": null, "locations": [], "hot": 0, "department": "Engineering", "business_unit": "Unknown", "t_update": 1721963869, "t_create": 1721433600, "ats_job_id": "JR28717", "display_job_id": "JR28717", "type": "ATS", "job_description": "<p style=\"text-align:left\">Netflix is one of the world&#39;s leading entertainment services with over 247 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>The data infrastructure teams at Netflix enable us to leverage data to bring joy to our members in many different ways. We provide centralized data platforms and tools for various business functions at Netflix, so they can utilize our data to make critical data-driven decisions. We do all the heavy lifting to make it easy for our business partners to work with data efficiently, securely, and responsibly. We aspire to lead the industry standard in building a world-class data infrastructure, as Netflix leads the way to be the most popular and pervasive destination for global internet entertainment.<br /><br />We are looking for distributed systems engineers to help evolve and innovate our infrastructure. We are committed to building a diverse and inclusive team that will bring new perspectives as we solve the next set of challenges. In addition, we are open to remote candidates. We value what you can do from anywhere in the U.S.<br /><br />Spotlight on Data Platform Teams:<br /><br />Big Data Warehouse and Iceberg | Learn More<br />The Big Data Warehouse and Iceberg team is responsible for Netflix&#39;s exabyte-scale data warehouse, building and operationalizing foundational services to manage the lifecycle of core tables critical for all analytical, reporting, and data decision needs. These services enable query engines to discover tables/datasets, provide secure access to data, and efficiently store data in S3 using Iceberg table format. Additionally, the team works on efficiencies of compute, storage, and network costs, and optimality of data storage, and ensures that the data meets Netflix&#39;s standards and compliance requirements. The team is also committed to developing new features and enhancements to the Iceberg table format (which began in Netflix and is now an industry standard) and contributing to the open source.<br /><br />Gen AI Platform | Learn More<br />The mission of the Gen AI Platform team is to boost the productivity of the data science and engineering community at Netflix. This means enabling users to spend more time solving business problems and less time engineering lower-level systems. We are seeking a Software Engineer to help build a developer platform that will provide the building blocks for Netflix to efficiently create GenAI applications. The platform will enable our teams to leverage LLM models and internally fine-tuned models. It will provide tools to support the LLM development lifecycle, high-level abstraction APIs for RAG, and tools for prompt engineering, management, and LLM operations.<br /><br />Online Datastores - Caching, Relational &amp; Search | Learn More</p><p><span>Online Data Stores organization offers managed datastores at scale to meet Netflix’s operational data requirements across all lines of business. These datastores cover various types, including Caching, Relational, Search, Key-Value, and Composite abstractions. Our focus is on developing and maintaining high-performance, reliable, and efficient datastores. Additionally, we enhance developer productivity by providing secure, intuitive and opinionated access layers.</span></p><p><span>This particular team focuses on datastores and abstractions related to caching including EVCache (memcached), Redis, Hollow, and relational stores including RDS, Aurora, CockroachDB, and search stores including Opensearch and GenAI storage related to Retrieval Augmented Generation.</span></p><p><br /><br />This would be your dream job if you enjoy:</p><ul><li><p>Solving real business needs at large scale by applying your software engineering and analytical problem-solving skills.</p></li><li><p>Architecting and building a robust, scalable, and highly available distributed infrastructure.</p></li><li><p>Leading cross-functional initiatives and collaborating with engineers, product managers, and TPM across teams.</p></li><li><p>Sharing our experiences with the open source communities and contributing to Netflix OSS.</p></li></ul><p></p><p><br />About you:</p><p></p><ul><li><p>You have 2&#43; years of experience in building large-scale distributed systems features or applications.</p></li><li><p>You are proficient in the design and development of RESTful web services.</p></li><li><p>Experienced in building and operating scalable, fault-tolerant, distributed systems</p></li><li><p>You are experienced in Java or other object-oriented programming languages.</p></li><li><p>Multi-threading is a challenge that you are comfortable tackling.</p></li><li><p>You have a BS in Computer Science or a related field.</p></li></ul><p></p><p><br />A few more things about us:<br /><br />As a team, we come from many different countries and our fields of education range from the humanities to engineering to computer science. Our team includes product managers, program managers, designers, full-stack developers, distributed systems engineers, and data scientists. Folks have the opportunity to wear different hats, should they choose to. We strongly believe this diversity has helped us build an inclusive and empathetic environment and look forward to adding your perspective to the mix!<br /><br />Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br /><br />Netflix is a unique culture and environment. Learn more here.</p><p></p>", "id_locale": "JR28717-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298021069", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28717"], "team": ["Engineering"], "posting_date": [], "work_type": []}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
