{"id": 790298014621, "name": "Designer, Consumer Products Product Development - Mexico City, MX", "location": "Ciudad de México, Mexico", "locations": ["Ciudad de México, Mexico"], "hot": 0, "department": "Consumer Products", "business_unit": "Streaming", "t_update": 1720396800, "t_create": 1720396800, "ats_job_id": "AJRT43788", "display_job_id": "AJRT43788", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>We are pursuing consumer products and experiences because we believe it will drive meaningful show awareness/buzz with more tangible, curated ways to interact with our most popular content IRL and drive long-term value. We want merchandise and experiences to help promote our titles and build them into title brands, or franchises, so they become part of the zeitgeist for longer periods of time.<br /> </p><p></p><p>As Designer of Product Development, you will be the creative lead on development and product strategy mainly for Mexico plus other territories in the LATAM region.</p><p><br /><b>Responsibilities include:</b></p><ul><li><p>Lead the development and execution of the Netflix brands on how they turn up through products. </p></li><li><p>Build and maintain strong, highly collaborative relationships with external partners/licensees to ensure creative excellence.</p></li><li><p>Lead creative meetings with external partners/licensees.</p></li><li><p>Align with key stakeholders across the CP x-functional teams in order to ensure all products being developed are on brand and effectively align with the brand’s strategy. </p></li><li><p>Maintain strong knowledge of the trends in the space of assigned key categories.</p></li><li><p>Manage vendors/agencies for creative projects.</p></li><li><p>Be the expert on the product approval process on Brand Comply in order to keep track and carry out submissions for all categories from concept to production.</p></li></ul><p></p><p></p><p><b>Requirements:</b></p><ul><li><p>8&#43; years of experience in product development in the consumer products industry - preferably in the entertainment space.</p></li><li><p>English is mandatory for this role, and proficiency in Portuguese will be viewed as a significant advantage. Candidates who are able to read, write, speak, and comprehend Portuguese will be prioritized, as this skill is a key differentiator in our multicultural work environment. </p></li><li><p>Knowledge and understanding of development within the hardlines, soft lines, health &amp; beauty, and food product categories.</p></li><li><p>Experience working with multiple partners internal and external.</p></li><li><p>Strong creative instincts and ability to distill stakeholder comments into actionable creative feedback.</p></li><li><p>Excellent communication skills, both written and verbal, and able to provide clear direction. </p></li><li><p>Ability to prioritize and multitask in a dynamic, deadline-driven environment.</p></li><li><p>Strong desire to think outside the box and innovate.</p></li><li><p>Resourceful in troubleshooting issues and finding creative solutions. </p></li><li><p>Experience using Adobe and Google Suite applications.</p></li><li><p>Extreme attention to detail and maintaining accuracy.</p></li><li><p>Self-starter who thrives in a fast-paced environment.</p></li><li><p>Positive attitude and team player, especially when faced with changing responsibilities.</p></li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT43788-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014621", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43788"], "team": ["Consumer Products"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
