{"id": 790298013626, "name": "Machine Learning Scientist (L4) - Content Demand Modeling", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1720483200, "t_create": 1720483200, "ats_job_id": "AJRT46253", "display_job_id": "AJRT46253", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is revolutionizing the entertainment industry with world-class technology. We are both a content distributor and a producer of original and premium shows. We serve millions of subscribers worldwide in more than 190 countries. We produce hundreds of new series, movies, documentaries, stand-up specials, and other categories of content each year. Because of our global footprint, we are able to elevate new types of creators, tell a diverse set of stories, and inspire a global audience.\n\nThe Content Demand Modeling team, within Data Science and Engineering, plays a central role at the company and supports critical decisions such as predicting the value of content and supporting strategic decision-making around content. Arming our creative teams with data-driven insights improves both the efficiency and accuracy of decision-making and helps Netflix produce more hits and member joy at better economics. This decision making is supported by the Content Demand Modeling team’s core product, which is a suite of highly robust machine learning models.\nIn this role, you will: <ul><li>Develop and deploy robust, scalable ML systems that are critical to advancing Netflix’s content understanding, production, and promotion workflows.</li><li>Collaborate with machine learning scientists, data engineers, and machine learning platform engineers to define project roadmaps, ensure alignment of goals, and drive strong execution.</li><li>Manage the full lifecycle of model development, including data gathering and preparation, training, evaluation, deployment, continuous monitoring, and improvement.</li><li>Work cross-functionally with partners across the business in different domains and with different backgrounds.</li><li>Help lay the foundation that allows the team to accelerate and therefore more effectively scale its impact</li></ul> About you: <ul><li>Strong foundation in machine learning or data science. Practical experience in supervised and/or unsupervised machine learning methods.</li><li>Passion for problem-solving and creative thinking.</li><li>Strong programming skills in Python and proficiency with SQL – create code that is understandable, simple, and clean, and easily shared with others.</li><li>Self-motivated to build, with an ability to thrive with minimal oversight and process.</li><li>Able to communicate your ideas clearly and succinctly to audiences with varying technical backgrounds.&nbsp;</li><li>You enjoy working with diverse colleagues of a variety of technical backgrounds and expertise. Empathy for users and collaborators with a variety of technical skills.</li><li>You are collaborative and thrive in fast-paced dynamic environments, contributing positively to the team and company culture.</li><li>Passionate about data quality and delivering effective data to impact the business.&nbsp;</li><li>Enthusiasm about and compatibility with Netflix <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a></li></ul> Bonus: <ul><li>Experience building ML infrastructure with an eye toward software engineering.</li><li>Time series modeling and forecasting.</li><li>Experience working with large data, e.g. ‘out-of-memory’ data.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46253-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013626", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46253"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
