{"id": 790298013986, "name": "Senior Manager, Consumer Insights, LATAM", "location": "Ciudad de México, Mexico", "locations": ["Ciudad de México, Mexico"], "hot": 0, "department": "Consumer Insights", "business_unit": "Streaming", "t_update": 1711324800, "t_create": 1711324800, "ats_job_id": "AJRT44723", "display_job_id": "AJRT44723", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, we are shaping the future of entertainment because we believe there is a better way to watch. Like our customers, we love movies and TV shows and we want the world to experience the joy of entertainment wherever and whenever they want.  </p><p><br />To succeed at promoting our exclusive, original content, we need an unparalleled level of consumer insight to understand what motivates these ‘must watch’ entertainment moments and to create a desire to join Netflix.</p><p><br />In this role, you will lead projects that guide the direction of the business and execution of tactics within LatAm. A deep understanding and proven track record of working across the region is critical for success in this role.</p><p><br />A background in entertainment research (TV, film advertising) is strongly preferred as it provides the unique perspective this leader will need.   </p><p><br />We seek an individual who:</p><p></p><ul><li>Can flourish in our unique company culture</li><li>Has spent time living and working in LatAm, whilst in a research or leadership role</li><li>Has a depth of experience in developing strategic insights to inform content, product, marketing &amp; brand decisions</li><li>Has worked with and has the ability to interface and maintain work and relationships with  different departments - Content, Product, Design, PR, social, creative - and managing different levels and types of interactions with these stakeholders.</li><li>Thrives on wanting to know why consumers act and feel the way they do and can transform their findings into recommendations that will drive and support strategic decision making that drive the business forward</li><li>Has a strong voice in setting strategy and identifying new directions</li><li>Has significant experience in designing research projects to proactively answer business critical questions, </li><li>A master of primary research (experience in secondary also helpful)</li><li>Is keen to roll sleeves up and be hands-on</li><li>Is as confident in qualitative research techniques as in quantitative, and understands the different applications of each to select the right methodology for the right questions</li><li>Knows when to pursue a research project and when to push back</li><li>Can bring the voice of the LatAm consumer into the relevant room and can bridge the gap where commonalities exist</li><li>Enjoys autonomy, yet hates working in silos</li><li>Ability of coaching team to be more effective and impactful in their roles</li><li>Ability to build strong relationships with cross functional stakeholders</li><li>Deep business acumen and ability to adapt and adjust to an ever changing and complex environment</li><li>Fluent English speaker, and a regional language preferred - Spanish and / or Portuguese.</li></ul><p></p><p>Essential qualifications:</p><p></p><ul><li>Significant consumer insights experience, preferably within the entertainment or tech industries </li><li>Have managed others in a fast paced environment, and as part of a global, distributed team</li><li>Experience in both qualitative and quantitative types of research - comfortable with the both equally, and with deep collaboration with analytics and data science</li><li>Be ready for an all-embracing thrill ride in a unique space where what we say really matters</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT44723-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013986", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44723"], "team": ["Consumer Insights"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
