{"id": 790298013504, "name": "UI Engineer (L4), Growth Product Experiences", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719446400, "t_create": 1719446400, "ats_job_id": "JR28569", "display_job_id": "JR28569", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>On the Growth Product Experiences team, we’re passionate about the intersection of our business as the world’s leading streaming video company and the complex engineering challenges that come with that scale.  We work on A/B tests and product features across our web, TV, and mobile platforms that help to introduce Netflix to even more people around the world, encourage them to sign up, and keep them thrilled and engaged as members who stay with us for the long term.  <br /><br />People who excel on our team are growth-oriented, curious, and selfless.  We are part of a global, diverse organization that values inclusion and equity. We encourage anyone who is passionate about building compelling UI experiences that touch audiences around the world to apply.<br /><br />This is a hybrid role based out of Netflix’s headquarters in Los Gatos, California, with the expectation of working from Netflix’s HQ in Los Gatos, California at least 3 days a week. Relocation assistance is provided along with generous parental leave, vacation, and reproductive benefits</p><p><br /><b>About the role</b></p><ul><li><p>Collaborate with engineers, designers, and product managers to build delightful, performant, and accessible user experiences.</p></li><li><p>Contribute to product features and A/B tests by using JavaScript / TypeScript, React, and GraphQL.</p></li><li><p>Develop highly maintainable web and TV client code (both React applications) with effective documentation.</p></li><li><p>Write automated tests with React Testing Library and other test frameworks, from unit tests to full end-to-end UI automation, to deliver high-quality code.</p></li><li><p>Pioneer emerging techniques such as server-driven UI (SDUI) to help us more rapidly experiment across multiple platforms with the Netflix design system.</p></li></ul><p></p><p></p><p><b>What sets you apart?</b></p><ul><li><p>3&#43; years of professional experience designing, building, and shipping software using JavaScript or TypeScript, and using unit tests and other automation to validate its quality.  </p></li><li><p>Bonus if familiar with React, GraphQL, or server-driven UI techniques.</p></li><li><p>Curious about a broad range of new or unfamiliar technologies, our consumer base, and the product and business challenges that we face.</p></li><li><p>Always seeking different perspectives, feedback, and relevant information to continuously grow and improve.</p></li><li><p>Taking a thoughtful, practical approach to problem-solving that considers tradeoffs and avoids over-engineering.</p></li><li><p>Endeavors to elevate the knowledge, skills, and abilities of yourself and others that is conducive to fostering an inclusive, collaborative environment.</p></li></ul><p></p><p></p><p><b>What’s different about us?</b></p><ul><li><p>Growth Product Experiences is a team that celebrates and values the business impact we have on Netflix, and not just the engineering contributions we make.  If you have a strong product mindset that loves knowing how your work directly impacts our customer growth and revenue, this is the team for you.</p></li><li><p>We move fast and iterate quickly—we take ideas from concept to reality in weeks, not quarters. Compared to other teams, expect a broader range of projects.</p></li><li><p>Inclusivity is something we embrace - diverse backgrounds, perspectives, and styles are something we’re proud of.  You can be your authentic self on this team, as we look for culture adds, not culture fits. </p></li></ul><p></p><p></p><p><b>Take a peek at your future colleagues</b><br /><br /><b>Clarence Leung</b><br />Clarence<b> </b>is an Engineering Manager within Growth Product Experiences, leading the Acquisition, Upsells, and Retention workstreams.  Beyond his passion for wilderness backpacking, he cares deeply about Netflix’s user accessibility, from content to each product feature the team builds.<br /><br /><b>Michael Burden</b><br />Michael is a Senior Software Engineer on the Growth Product Experiences team. He is passionate about building data-driven, easy-to-use products that solve complex business problems. In his free time, he enjoys traveling, culinary arts, and Lego.<br /><br /><b>Anna Wygant</b><br />Anna is a Senior Software Engineer on the Growth Product Experiences team. When she’s not out snowboarding you can find her creating reusable components and utilities for her fellow developers, or driving A/B tests to discover the best experiences for each unique Netflix market.<br /><br /><b>Lakshmi Rapaka</b><br />Lakshmi is a Senior Software Engineer in Test on the Growth Product Experiences team. She is passionate about ensuring the quality, accessibility, and user-friendliness of the products delivered. In addition to her focus on quality, Lakshmi develops testing tools that are utilized by engineers across various teams. In her free time, she enjoys training for races and exploring fun outdoor activities.<br /><br /><br />Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><u>here</u></a><span>.</span></p><p><br /><br /><span>Netflix is a unique culture and environment. Learn more </span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><u>here</u></a><span>. </span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28569-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013504", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28569"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
