{"id": 790298013174, "name": "Senior Product Designer, Live", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1719878400, "t_create": 1719878400, "ats_job_id": "AJRT43304", "display_job_id": "AJRT43304", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is Live! With hits like comedian Chris Rock’s Selective Outrage and The Netflix Slam, a match-up against tennis superstars Rafael Nadal and Carlo Alcaraz, Netflix is exploding into the live streaming world, giving its members more entertainment like the upcoming Jake Paul vs. Mike Tyson fight, NFL Games on Christmas Day, and WWE.\n\nThis is just the beginning. If you want to be part of shaping this business, crafting end-to-end journeys, and taking the live streaming experience to the next level, then we’d love for you to join our design team!\n\nThis role is ideally based in our Los Gatos offices. There is also the option to be based out of LA, or remotely from the West Coast/PST working hours. Expect to travel monthly to meet with your teams, stakeholders, and partners.\n\nKey Responsibilities <ul><li>Partner closely with multi-disciplinary team members - Product Design, Content Design, Operations, Product Management, Engineering, Merchandising, Research, and others – to take the business to the next level</li><li>Be a thought leader in the live streaming space, collaborating with the team to create a user experience vision, while balancing a tactical strategy for progress</li><li>Drive a human-centered design process for defining and executing features from concept to launch</li><li>Innovate to meet member needs while contributing strategically and tactically to the overall design system, accounting for delight, flexibility, and scalability</li><li>Be a master of storytelling to present a vision to create a shared understanding of the experience strategy with the company</li><li>Be a fierce advocate for our members from around the world</li><li>Embrace our culture of experimentation and A/B testing</li></ul> Skills, Characteristics & Qualifications <ul><li>5+ years of experience designing user experiences for consumer-facing products across mobile, web and/or TV</li><li>Track record of designing and shipping products and leading projects to successful outcomes for global users and the business</li><li>Known for understanding the intricacies of delivering a live stream, member expectations, and industry trends</li><li>Ability to think at a high level about product strategy and articulate a vision</li><li>Deep knowledge of the best ways to delight sports fans around the world</li><li>Experience connecting the dots across the organization with other related initiatives across the company while driving collaboration</li><li>Ability to navigate ambiguity, and drive clarity that brings the user, technology, and business together; apply big-picture thinking to break down ambiguous opportunities into an actionable roadmap</li><li>Exceptional communication skills, in writing and verbally, whether in small group discussions, large-scale presentations, or with executives</li><li>Proven ability to deal with complex initiatives with deadlines and requirements from various teams, while not losing sight of long-term experience goals</li><li>Systems thinker who thinks strategically about how individual business needs can fit into a holistic design systems that accommodates for requirements across the company</li><li>Known for high-quality craft, both in the holistic design approach and detailed execution</li><li>Demonstrated ability to work on patterns across multiple UI platforms, such as TV, mobile, and web</li><li>Excel in interaction design, visual design, and prototyping skills</li></ul> \n\n\nDoes this sound interesting but still unsure? Please don’t self-select out; let’s figure it out together. We’d love to talk to you! \n\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds more substantial teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nPay Transparency\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off.\n\nSee more detail about our Benefits here. Netflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43304-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013174", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43304"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
