{"id": 790298013057, "name": "Senior Manager, Marketing Partnerships Creative - France", "location": "Paris, France", "locations": ["Paris, France"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1719273600, "t_create": 1719273600, "ats_job_id": "AJRT44572", "display_job_id": "AJRT44572", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>The Marketing Partnerships Creative team collaborates with external brands and agency/production partners as well as internal cross-functional teams to create compelling campaigns, activations, sponsorships, and other innovative solutions. The team consists of (3) disciplines: Brand Strategy, Creative, and Creative Production. This team is tasked with ensuring partnership programs are rooted in a compelling strategy, crafted at the highest quality, and executed flawlessly. Examples of the work created by this group can be found here - https://www.netflixmp.com/ </p><p></p><p></p><p><br />We are seeking a Creative with strong experience working on brands from various categories. You will own creative campaigns for Netflix’s major partnerships with brands in France as well as top creative/media/partnership agencies, across a variety of product categories in support of Netflix’s content releases and its platform. This role will be at the forefront of establishing the creative output of our emerging integrated marketing and sponsorship offerings which are new to Netflix and come on the back of our Ad-supported tier and our increasing ventures into live entertainment.</p><p></p><p></p><p><br />All candidates should demonstrate their deep experience and passion for creative advertising. But the truly outstanding candidates will offer a clear and compelling point of view on good creative and how/why Netflix is well positioned to offer something new and better to enhance the entertainment experience for both brands and members alike.</p><p></p><p></p><p><br />This new role presents a huge opportunity to be at the forefront of a new Netflix offering, one that not only continues to prove how Netflix is the most innovative entertainment company in the world, but also helps to deliver and grow an important new revenue stream for the business.</p><p></p><p><br />KEY RESPONSIBILITIES:</p><ul><li>Act as creative lead guiding and executing best-in-class creative campaigns in service of the Netflix advertising tier and our advertising partners.</li><li>Build foundational concepts that reflect the strategic intersection between the brand and the title</li><li>Provide guidance and feedback to partner creative agencies and brands</li><li>Evaluate current creative resources in market (including agencies, freelancers and tooling) to ensure we are set up to execute best-in-class work now and into the future, as our creative output expands </li><li>Translate our brand/marketing requirements into ideas the partner and ultimately consumer easily understands</li><li>Introduce new partners and their agencies to the Netflix brand, creative guidelines and workflow</li><li>Attend partner meetings and managing all creative relationships</li><li>Collaborate with cross-functional teams including: Creative Marketing, Editorial &amp; Publishing, Content, Creative Production, and Public Relations.</li></ul><p></p><p>REQUIREMENTS:</p><ul><li>10&#43; years of proven experience in a creative role (Creative Director, Art Director or Copywriter) within the entertainment, advertising, or related industry in France.</li><li>5&#43; years leading a creative team, with a track record of establishing a brilliant internal culture that balances collaboration with individual creativity</li><li>A strong portfolio of impactful and award-winning work spanning a range of different industries. </li><li>Passionate and curious about marketing, brands, and entertainment.</li><li>Have key, demonstrable experience developing innovative creative solutions with notable brands.</li><li>Strong experience in brand and/or consumer marketing. Partnerships experience a plus.</li><li>Willing to invest the time and effort and sometimes even sacrifice personal goals for the benefit of the overall project.</li><li>Confident presentation skills and excellent communication skills.</li><li>Experience and palpable passion for building great content marketing programs that are unique and scalable.</li></ul><p></p><p>PERSONALITY ATTRIBUTES:</p><ul><li>A natural and deep affection for entertainment and brands.</li><li>Strategic, forward-thinker, extremely organized, effective communicator, and thrive in a fast-paced environment.</li><li>Capable of working independently as well as part of a broader team.</li><li>Can organize, clarify and communicate complex ideas quickly, succinctly and accurately. </li><li>High level of intellectual curiosity with the ability to demonstrate strong judgment in the face of ambiguity.</li><li>Agile, goal-oriented, driven to succeed and always up for a challenge.</li><li>Has a passion for concepting and pitching unique and innovative marketing campaigns.</li><li>Can flourish in our unique ​​<a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">company culture</a>.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT44572-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013057", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44572"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
