{"id": 790298013722, "name": "Data Engineer (L5) - Ads (Ad Data Governance and Privacy)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1721956458, "t_create": 1715040000, "ats_job_id": "AJRT30170", "display_job_id": "AJRT30170", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Who are we?\nNetflix is the world's leading internet entertainment service with over 220+ million memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. And as of November 2022 we added an advertisement branch to our business, making Netflix service accessible to an even broader member base with ad-supported plans!\n\nAbout the team\nAds Data Engineering team sits at the core of building a data ecosystem that will power Netflix’ understanding and decision making about what impact ads have on our business. This team’s main focus is to build rich, connected, and easily accessible data products about ad inventories, forecasting, targeting, ad serving, pacing and much more. We are looking for passionale, mature, and curious software engineers with strong data intuition, analytical mindset and ad ecosystem experience, to contribute to the team’s impact in a quickly evolving. \nWho are you? <ul><li>Beyond talented, you are curious, creative, and tenacious.&nbsp;</li><li>Sharp communicator who can break down and explain complex data problems in clear and concise language.&nbsp;</li><li>You have an extensive background and strong technical expertise working with data at scale, experience with advertising data (preferred), and understand how to build for privacy and business impact</li><li>You have a high tolerance for ambiguity and fast-changing context</li><li>Hands-on experience building batch or streaming production data pipelines, ideally using one or more distributed processing frameworks such as Spark, Flink or Hive/Hadoop</li><li>Knowledge of data modeling and establishing data architecture across multiple systems</li><li>Thrive in a fast-paced environment, and see yourself as a partner with the business with the shared goal of moving the business forward.</li><li>Create code that is understandable, simple, and clean, and take pride in its beauty.</li><li>Love freedom and hate being micromanaged. Given the context, you're capable of self-direction.</li><li>Passionate about data quality and delivering effective data to impact the business.&nbsp; </li></ul> What will you do? <ul><li>Architect, strengthen, and expand the core data products that scale our Ads business.&nbsp; You’ll get on a team of talented data engineers and envision how all the data elements from multiple sources should fit together as a whole, and then execute on that plan.</li><li>Fully own critical portions of Netflix's Ads data products. Collaborate with stakeholders to understand needs, model tables using software engineering and data warehouse best practices, and develop large-scale data processing solutions to ensure the timely delivery of high-quality data.</li><li>Partner with Analytics Engineers, Data Scientists, and Software Engineers to create data products that will serve analysis, ML and reporting needs intuitively.</li><li>Develop best practices for governance of data sets with sensitive information.</li><li>Build strong and collaborative partnerships with data scientists, analytics engineers, and Machine Learning practitioners.</li></ul> What (ideally) do you know? <ul><li>Domains related to advertising, data privacy, GDPR</li><li>Data warehousing, data modeling, and data transformation for both batch and streaming&nbsp;&nbsp;</li><li>Hands-on command programming languages such as python, scala, or java as well as data exploration using SQL</li><li>Expert at building performant data pipelines and optimizing existing workflows for new features</li><li>Big Data tech - Hadoop, Spark, Flink, Stream processing, Hive, Presto, etc.&nbsp;&nbsp;</li><li>Experience with sourcing and modeling data from application APIs</li><li>Team-based software development tools and best practices</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000. \n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT30170-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013722", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT30170"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
