{"id": 790298013623, "name": "Product Manager, Developer Foundations L6", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1689811200, "t_create": 1689811200, "ats_job_id": "AJRT31512", "display_job_id": "AJRT31512", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to be joining Netflix as we continue to transform entertainment. We deliver billions of hours of movies and TV shows per month to more than 230 million members in over 190 countries. At Netflix, we want to entertain the world. To achieve this, we must be able to rapidly build and ship innovative experiences for our members and creators all around the globe.\n\nAt Netflix, we practice full-cycle development where developers own and operate what they build. We scale this model by investing heavily in developer tooling to simplify and automate DevOps and reduce toil. Within the Platform Engineering organization, our Developer Platform exists to maximize the impact of Netflix engineers by providing holistic experiences for building and managing software through the entire lifecycle of development, delivery, operations, and maintenance. Our Developer Platform enables Netflix to scale effectively and evolve rapidly by providing highly reliable, performant, secure, and flexible developer tools, services, and infrastructure to support the expanding needs of the business. Ultimately, we aim for Netflix engineers to spend less time on repetitive engineering tasks, unnecessary complexity, and undifferentiated heavy lifting so they can spend more time helping Netflix entertain the world.\n\nThe Opportunity\n\nWe are looking for technical product managers to drive the next evolution of our developer platform with best-in-class experiences that simplify and accelerate workflows and empower and delight software engineers. We continually strive to manage more for developers so they can innovate more for Netflix.\n\nYour mission is to optimize the inner dev loop for Netflix engineers. You will be responsible for our developer foundations, which include source code management & code search, repository management, artifact management, developer workspaces, IDEs, plugins & remote development environments, polyglot build, package, & publish tools, and distributed builds & tests.\nWhat You Will Do: <ul><li>Deeply understand and triangulate across customer needs, product analytics, and external industry innovation to drive product vision and strategy for Developer Platform offerings that maximize business and customer impact.</li><li>Partner closely with senior management and engineering teams to define and align with stakeholders on vision, strategy, and roadmaps.</li><li>Develop product roadmaps in partnership with relevant product and engineering teams that execute on product vision and strategy and inform our engineering teams of what problems need to be solved.</li><li>Define how we will measure the success and effectiveness of our products and drive the execution and continuous evaluation of those metrics.</li><li>Create strong partnerships with Netflix engineers creating continuous feedback loops that allow us to better understand their problems.</li><li>Ensure we are solving the right problems by sourcing input from multiple channels and prioritizing effectively to drive maximum impact for Netflix.</li><li>Ensure that our product evolution thoughtfully addresses product lifecycle and adoption/migration experience and provides clear guidance and recommendations to Netflix engineers.</li><li>Help evolve Platform Engineering’s customer engagement model, communication strategy, and prioritization and planning/road mapping practices.</li></ul><div><br></div> What We’re Looking For: <ul><li>5+ years of experience as a Technical Product Manager.</li><li>Proven track record of managing and evolving a product portfolio and/or driving product vision and strategy.</li><li>A healthy blend of deep technical knowledge with a customer-focused mindset and empathy.</li><li>Demonstrated passion for developer platforms, developer experience, tools, workflows, and/or infrastructure.</li><li>Strategic thinker that can connect customer use cases to technology solutions and think holistically about end-to-end experience.</li><li>Ability to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision.</li><li>Comfortable applying a combination of qualitative and quantitative methods to define success.</li><li>Leverages product intuition and judgment to solve problems and make decisions without perfect information.</li><li>Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’.</li><li>Excellent communication skills; timely communication with clear expectations.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.\n\n\n\nMore About Developer Productivity @ Netflix\n\nFull Cycle Developers at Netflix -- Operate What You Build (techblog)\nUnifying the Netflix engineering experience with a federated platform console (video)\nBackstage in the Wild (podcast)\nTelltale: Netflix Application Monitoring Simplified (techblog)\nMachine Learning for a Better Developer Experience (techblog)\nManaged Delivery: Bringing Infrastructure as Code to Spinnaker (video)<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT31512-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013623", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT31512"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
