{"id": 790298010753, "name": "Manager, Brand Partnerships - DACH", "location": "Berlin, Berlin, Germany", "locations": ["Berlin, Berlin, Germany"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1718582400, "t_create": 1718582400, "ats_job_id": "AJRT44568", "display_job_id": "AJRT44568", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>We are the world’s biggest fans of entertainment, and we’re always looking to give members the thrill of the next great story. It’s an exciting time to join Netflix as we continue to raise the bar and innovate in how we serve our fans and members.</p><p></p><p></p><p><br />About The Team</p><p></p><p><br />The Marketing Partnerships team collaborates with external partners and internal cross-functional teams to create compelling campaigns, activations, sponsorships, and other innovative solutions. As part of our overall marketing efforts, we partner with admired consumer brands to promote our titles and fuel fandom with creative marketing campaigns that drive outsized conversation. These ‘Brand Partnerships’ allow us to unlock new channels, reward fans, and engage new audiences. Importantly, these partnerships are an opportunity to develop unique ideas that neither brand could do without each other. Examples of the work created by this group can be found here - https://www.netflixmp.com/ </p><p></p><p></p><p><br />About The Role</p><p></p><p><br />You will lead outreach with potential brand partners to build relationships and gain a deep understanding of their goals, planning process, creative ambition, and core equities. You will negotiate and shape robust partnerships with admired brands in support of Netflix’s most prominent films and series. <br /> </p><p></p><p><br />At the earliest stages of development, you will work cross-functionally with the content, marketing, and legal teams to identify titles that strategically align with the Netflix Brand Partnership approach. You will research and engage with a cross-section of brands to identify potential partners and find meaningful connections between titles, audiences, and partner’s marketing priorities. <br /> </p><p></p><p><br />You will be a part of a multi-disciplinary working team within the Marketing Partnerships function. These working teams consist of a brand partner lead (this role) who leads partner engagement and sets the conditions for a successful partnership; a strategy lead that develops strategic intersections between our title and a brand’s positioning; a creative lead who oversees the campaign development; and a production lead that helps to bring the idea to life. You will be tasked with building mutually beneficial deals, using your judgment, business context, and experience to craft a custom approach. You’ll contribute toward the development of highly creative co-promotional campaigns that increase awareness, interest and conversation for both the partner brand and the title. There is no one-size-fits-all approach to any aspect of our partnerships, from deals to creative ideas, so the ideal candidate will have an entrepreneurial spirit. <br /> </p><p></p><p><br />You will build brand partnership presentations, lead partner discussions and negotiations, and manage partner relationships. You will also work with title marketing, media, publicity, and social teams to integrate partnership campaigns into title marketing plans and look to extend these campaigns across countries and regions should there be an opportunity to do so. This role will be responsible for the overall partner relationship, with a focus on maintaining open communication before, during, and after the execution of a partnership campaign. </p><p></p><p></p><p><br />This role will also be at the forefront of establishing the output of our emerging integrated marketing and sponsorship offerings, which are new to Netflix and come on the back of our Ad-supported tier and our increasing ventures into live entertainment. It’s a huge opportunity to be at the forefront of a new Netflix offering, one that not only continues to prove how Netflix is the most innovative entertainment company in the world but also helps to deliver and grow an important new revenue stream for the business.</p><p></p><p><br />KEY RESPONSIBILITIES:</p><ul><li>Building the strategic vision for brand partnerships in Germany, identifying brands that might be a good fit for the Netflix brand and/or key Netflix titles.</li><li>Extracting insights from partners and internal marketing teams to develop and steer the strategic &amp; creative vision from beginning through to execution.</li><li>Writing strategy briefs and building the foundations of a strategic intersection between the brand and the title.</li><li>Drafting and negotiating deal memos and contractual agreements.</li><li>Experience working alongside Ad Sales and Consumer Products functions.</li><li>Development of memos, in English, that can articulate clear thinking to inform and guide major decisions or voice opinions that can be shared publicly within the broader Netflix Marketing Org (and sometimes beyond).</li><li>Providing guidance and feedback to partner creative agencies and brands.</li><li>Working closely with internal creative groups as well as external agency partners.</li><li>Translating our brand/marketing requirements into ideas the partner and ultimately consumer easily understands.</li><li>Drive successful integration of broader creative content and brand initiatives at Netflix and our strategic partners.</li><li>Collaboration with cross-functional teams including Creative Marketing, Editorial &amp; Publishing, Content, Creative Production, and Public Relations.</li></ul><p></p><p>REQUIREMENTS:</p><ul><li>Has 7&#43; years of experience developing, negotiating, and executing incredibly creative entertainment partnerships or brand campaigns.</li><li>Experience within a film or TV environment, including working with content teams in early development work for film or series (or both).</li><li>Clear and articulate writer, in both German and English, who is comfortable crafting a narrative and developing points of view, despite some ambiguity or uncertainty.  </li><li>Proven experience in brand and/or consumer marketing.</li><li>Has demonstrated the ability to leverage research, insights and analytics to inform creative strategy.</li><li>Able to give strong input on strategy and a clear POV on creative work.</li><li>Experience and palpable passion for building great content marketing programs that are unique and scalable.  </li><li>Demonstrated ability to prioritize and drive results.</li></ul><p></p><p>PERSONALITY ATTRIBUTES:</p><ul><li>Passionate and curious about marketing, brands, and entertainment.</li><li>Strategic, forward-thinker, extremely organized, effective communicator, and thrive in a fast-paced environment.</li><li>A passion for both deal-making and creative marketing.</li><li>Has a record of cultivating relationships and a deep level of respect with top brand marketers</li><li>Capable of working independently as well as part of a broader team.</li><li>A dynamic presenter who can captivate and communicate effectively with senior executives, showrunners, filmmakers, and partner leadership</li><li>Can organize, clarify and communicate complex ideas quickly, succinctly and accurately. </li><li>High level of intellectual curiosity with the ability to demonstrate strong judgment in the face of ambiguity.</li><li>Agile, goal-oriented, driven to succeed and always up for a challenge.</li><li>Has a passion for unique and innovative marketing campaigns.</li><li>Can flourish in our unique ​​<a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">company culture</a>.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT44568-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010753", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44568"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
