{"id": 790298014633, "name": "Distributed Systems Engineer (Sr. Mgr)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1710720000, "t_create": 1710720000, "ats_job_id": "JR27816", "display_job_id": "JR27816", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Content Engineering builds the products and services used by our internal and external creative partners to create, launch, and promote our global content. Our products enable the entire workflow of content creation, from pitch to play, and provide innovative new ways to develop and manage entertainment at scale. </p><p></p><p><br />We are looking for talented distributed systems engineers like you to help build the technologies that allow us to scale our efforts across the globe, and do so effectively and efficiently! You’ll have a direct impact on how the Netflix studio creates and promotes shows such as “Squid Game”, “Stranger Things” and “The Queen’s Gambit” on a global scale. </p><p></p><p><br />We are committed to building a diverse and inclusive team to bring new perspectives as we solve the next set of challenges. In addition, we are open to remote candidates - we value what you can do, from anywhere in the U.S.</p><p></p><p><br />You will be successful in this role if you enjoy:</p><p></p><ul><li>Being self-motivated, working independently, and partnering with a diverse group of engineers, product managers and TPMs across different functional areas and organizations.</li><li>Empowering other engineers by building and operating robust, scalable, and highly available infrastructures, with a focus on developer experience, observability and operational excellence.</li><li>Thriving in ambiguity, diving deep to understand problems and customer pain points, and solving them using appropriate technologies.</li><li>Being an evangelist for high quality code and engineering best practices.</li><li>Assisting in the career development of others, actively mentoring individuals, and helping build technical communities across the organization.</li><li>Living the Netflix’s <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">culture</a> and thinking you would thrive here.</li></ul><p></p><p></p><p>Qualifications:</p><p></p><ul><li>Have 5&#43; years of experience in crafting complex distributed systems.</li><li>Have recent proficient experience with Java, C# or other OO programming languages with a solid understanding of OO design principles, concurrency, multi-threading, performance tuning and observability.</li><li>Have a proven track record in architecting, building, and operating distributed systems with high availability, fault tolerance, and performance.</li><li>Have solid experience in setting technical directions for engineering projects, making architectural decisions, and influencing partner and cross-functional teams.</li><li>Have the ability to proactively describe complex technical concepts to a variety of stakeholders, driving conversations and decisions through written and/or verbal communication.</li></ul><p></p><p></p><p>Nice to have:</p><p></p><ul><li>Have a product mindset toward infrastructure and platforms.</li><li>Experience in developing long-term technical strategies aligning with business goals via appropriate technology investments.</li><li>Proficient with gRPC and/or GraphQL API design and implementation.</li><li>Working experience with Kafka, Cassandra, Elasticsearch, Memcached, and/or AWS.</li><li>Familiarity with library development and DI frameworks (preferably Spring Boot).</li><li>Have application security domain experience - awareness of AuthN and AuthZ constructs.</li></ul><p></p><p></p><p>Spotlight on Content Engineering Teams:</p><p></p><p><br />Studio Production Engineering (SPE)</p><p><br />The Studio Production Engineering team builds products to enable Netflix Studio to optimize and innovate how Netflix plans productions, produces great content, and manages the production of content globally and at scale to achieve operational efficiency, scale economies, and better decision-making through shared, accurate, and transparent data. </p><p><br /><br />Media Infrastructure Platform (MIP)<br />The Media Infrastructure Platform team provides large-scale infrastructure for content media, enabling Netflix to store, access, and process media files at scale, reliably, and efficiently to meet the demands of Netflix streaming and studio. Our products are highly leveraged by Encoding, Netflix Studio, and Content Engineering. We closely partner with a variety of cross-functional teams, including Encoding Technology, Netflix Engineering Platform, Data Science Engineering, and Content Engineering, as well as Product Managers. The team currently owns a few key products such as a polyglot application framework, and container-based executor for media-aware serverless functions with observability tools and workflow orchestration frameworks, a storage layer built on top of S3 with a set of features like file and folder solution, lifecycle management,  media sequence detection, Netflix access control, security,  client side encryption, full file checksum, etc.  Besides the cloud services the team currently owns, the team is also looking to grow into a more diverse and hybrid media processing and storage media space to meet the needs of business growth. </p><p></p><p><br />Content Promotion &amp; Distribution (CPD)</p><p><br />Content Promotion &amp; Distribution (CPD) sits at the intersection of the consumer experience and the Netflix Studio. Our team is integral to making the Netflix experience feel personal and relevant by developing innovative approaches to how we catalog, promote, localize, and distribute content.  As part of the Content Promotion and Distribution org, the Metadata Distribution team provides the Tier 0 services and infrastructure to safely and quickly verify, compute, package, and distribute the extensive catalog library that drives what you see and play when you use the Netflix product. This information plays a crucial role in shaping the user experience on Netflix, influencing everything from the recommendations you receive, to the way you experience content and even how the content is played back.<br /> </p><p></p><p><br />A few more things about us:<br /><br />As a team, we come from many different countries and our fields of education range from the humanities to engineering to computer science. Our team includes product managers, program managers, designers, full-stack developers, distributed systems engineers, and data scientists. Folks have the opportunity to wear different hats, should they choose to. We strongly believe this diversity has helped us build an inclusive and empathetic environment and look forward to adding your perspective to the mix!</p><p></p><p><br />Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.</p><p><br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.</p><p><br /><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27816-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014633", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27816"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
