{"id": 790298013981, "name": "Operations Manager 5, Live Broadcast Technology", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1714348800, "t_create": 1714348800, "ats_job_id": "AJRT45555", "display_job_id": "AJRT45555", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>In this role, you will manage day-to-day global live-streaming operations for Netflix. As a Live Broadcast Operations Manager, you will mainly coordinate and execute live-focused initiatives based on collaboration with the Live Streaming Pipeline Engineering Team, Live On-Site Technical Managers and Production teams, and our Reliability Engineering teams.<br /><br />You will impact multiple areas of the live event lifecycle, from the pitch &amp; planning phase to testing and event launch days. You will lead innovation initiatives that bridge the gap between production, hardware, broadcast engineering, and our software engineering teams.</p><p></p><p><br /><b>Responsibilities:</b></p><ul><li><p>Coordination and partnership across multiple stakeholders and clients for the smooth execution of live-streaming events.</p></li><li><p>Collaborate with contractors and in-house engineers for transmission planning.</p></li><li><p>Establish and maintain partnerships with satellite and IP transmission vendors. </p></li><li><p>Establish and maintain partnerships with hardware and broadcast companies such as contribution/distribution encoder vendors, closed-captioning gears, and services.</p></li><li><p>Ability to organize and maintain maps &amp; drawings of venue infrastructures for communication with all entities.</p></li><li><p>Acts as a central resource for engineering and production, collaborating with teams to develop and execute technical plans that align with Netflix&#39;s creative and technical objectives, often managing concurrent schedules.</p></li><li><p>Responsible for troubleshooting, diagnosing, and reporting audio, video, and infrastructure issues.</p></li><li><p>Monitor and manage cloud-based and hardware-based video infrastructure. Provide analysis and remediation of any issues in the video workflow.</p></li><li><p>Manage, build, and evolve ground ingest capabilities, including signal acquisition, inspection, validation, and standardization.</p></li><li><p>Monitors the industry for emerging technologies, developing trends to keep Netflix live on the cutting edge.</p></li><li><p>Work closely to help enable new feature development by figuring out how the feature affects overall operations and how to make it work at scale.</p></li><li><p>Be present on launch days at Network Operations Center (NOC) or ground ingest facilities as required.</p></li><li><p>Be able to work with flexible hours based on the live events schedule.</p></li><li><p>Must have flexibility to travel for scheduled live events.</p></li></ul><div></div><div></div><p><b>Qualifications:</b></p><ul><li><p>5&#43; years of broadcast remote operations experience (preferably network level) in a coordination or supervisory role </p></li><li><p>Strong understanding of digital audio/video fundamentals, compression technologies, distribution formats, and associated technologies such as Multicast and Unicast video distribution, MPEG Video (2,4, &amp; HEVC), MPEG-2 TS, HDR, SCTE-35 &amp; ESNI signaling, closed-captions, satellite video distribution, and ad-splicing.</p></li><li><p>Experience with video transport protocols such as SDI, SMPTE-2110, RTP, RTMP, SRT, Zixi, RIST, HLS, MPEG-DASH.</p></li><li><p>Proficient in Video and Audio Compression technology.</p></li><li><p>Understanding of nuances of remote production and the on-site technical operation.</p></li><li><p>Knowledge of remote production facilities and equipment vendors.</p></li><li><p>Deep understanding of MVPD-based linear ecosystem and working knowledge of OTT video distribution, contribution technology, and architecture.</p></li><li><p>Ability to assess and troubleshoot video and audio quality.</p></li><li><p>Experience with on-premise video acquisition with partners or co-location facilities.</p></li></ul><div></div><div></div><p><b>Nice to have:</b></p><ul><li><p>Experience with cloud-based infrastructure.</p></li><li><p>Experience with at least one programming language (Java, Go, Python).</p></li><li><p>Experience in Unix (or unix-based systems), shell scripting, and good SQL knowledge.</p></li><li><p>Experience with web technologies and distributed systems with microservices architecture.</p></li></ul><p></p><div></div><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <span><span> </span></span><a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a><span>.</span></p><p></p><p><span>Netflix is a unique culture and environment. Learn more<span> </span></span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a><span>.</span><span> </span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45555-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013981", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45555"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
