{"id": 790298014530, "name": "Director, Workplace - LATAM", "location": "Ciudad de México, Mexico", "locations": ["Ciudad de México, Mexico"], "hot": 0, "department": "Facilities And Workplace Services", "business_unit": "Streaming", "t_update": 1719792000, "t_create": 1719792000, "ats_job_id": "JR28574", "display_job_id": "JR28574", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>As part of the Global Enterprise Ops organization, the successful individual will play a key role in leading the regional workplace team with offices across Latin America.  This team is focused on providing an efficiently run, safe, amazing, inspiring, and consistent experience for our colleagues &amp; customers. Netflix’s LATAM offices include our Mexico City (Mexico) headquarters, São Paulo (Brazil), Buenos Aires (Argentina), and Bogotá (Colombia). </p><p></p><p><br /><br />The main responsibility of the Workplace team is ensuring the smooth running of the daily operations and experience to provide best-in-class environments to drive the business forward. The successful candidate will be proactive and creative and will be encouraged to express new ideas on improving the overall workplace, ensuring that we are enhancing innovation, collaboration, and productivity.</p><p></p><p><br /><br />Netflix offers a fast-paced and expanding operation with a variety of needs. We are looking for an ambitious person who can grow and lead a successful, efficient, and high-performing Workplace team. The role requires a strategic and customer-focused individual with a crazy focus on excellence.</p><p></p><p><br /><br />The role will be based in Mexico City and dual report to the LATAM regional CFO &#43; Sr. Director  of Workplace LATAM/EMEA/APAC (based in Amsterdam).</p><p></p><p><br />Responsibilities:</p><ul><li>Directly manage all workplace teams across LATAM who oversee all building operations, food &amp; beverage, front of house, shipping &amp; receiving, events support, employee moves, and Environmental Health &amp; Safety (EHS).</li><li>Remain highly aligned with functional teams &amp; leaders across space &amp; occupancy, design &amp; construction, real estate, and security to ensure we are constantly meeting the needs of the business and our stakeholders. </li><li>Build, lead &amp; mentor your team as they work through challenges and promote an environment that encourages them to continuously excel &amp; improve. </li><li>Drive a strategy across all aspects of the Workplace to create consistency across the region and leverage our scale for procuring goods &amp; services.  </li><li>Sourcing strategy for outsourced workplace services, including Janitorial, Logistics, F&amp;B, and Maintenance - leverage the subject-matter expertise of our vendors and drive accountability.</li><li>As a member of the global Workplace leadership team, lead strategic initiatives to improve our global workplace excellence. </li><li>Financial management of workplace costs (including people costs) to ensure Netflix money is being spent wisely. </li><li>Collaborate &amp; align with cross-functional partners such as Security, Talent, EHS, AV, Ntech Ops, Events, Security Operations, and Systems to ensure we are constantly providing a frictionless, safe &amp; secure workplace and responding to incidents that will occur 24/7.</li><li>Develop and manage a strong communication strategy on all levels to ensure cohesive engagement across all sites.</li></ul><p></p><p>Requirements:</p><ul><li>Proven leadership experience and a crazy focus on excellence are a must. </li><li>Expertise in operations management, including the development of workplace standards and sourcing strategies.</li><li>Ability to think innovatively to create the best experience for our employees from a workplace services and operations perspective. </li><li>15&#43; years in a similar role, must include management of multiple corporate buildings and be inclusive of both facilities and leadership experience</li><li>Travel up to 25% as needed, including International. Regularly visiting all LATAM locations will be critical for this role. </li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28574-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014530", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28574"], "team": ["Facilities And Workplace Services"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
