{"id": 790298013954, "name": "Manager, IP Relations", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Content Creative", "business_unit": "Streaming", "t_update": 1702512000, "t_create": 1702512000, "ats_job_id": "AJRT30524", "display_job_id": "AJRT30524", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is the world's leading internet entertainment service with over 270+ million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Opportunity \n\nWe are searching for a Manager, IP Relations for our Content Licensing team based at our Tokyo, Japan Office. The Manager will be a part of the team that owns TV and film programming and acquisitions across the country, and they will also work very closely with the Netflix IP Scouting Team. This team is responsible for identifying and acquiring books and other forms of intellectual property for TV and film adaptation, as well as working hand-in-hand with the various Netflix content teams and producer deals to help curate material for their specific television and film slates. In addition, the team also handles rights checks, provides coverage on material, and helps maintain an up-to-date internal information system on the current book/IP-to-screen marketplace.\n\nThe Manager should - first and foremost- love to read books including manga, and consume other media! And not only that, but talk about them, have an authentic point of view (good AND bad) on them, and be able to effectively pitch the material to executives and producers. This position will primarily oversee day-to-day IP scouting and acquisitions for Japanese IP for Content teams across the globe, and act as a liaison between the IP team and the content executives for both feature films and television series. They will be responsible for the relationship with the partners and IP rights holders and often act as the liaison on behalf of the Content Creative teams. The Manager will be the point of contact and liaison between the IP owner and the Content team. We are specifically looking for someone who has relevant experience in the publishing or film/TV market in Japan, as well as some form of specialization or in-depth knowledge of the book/IP-to-screen marketplace. The ideal candidate is not only passionate about books and intellectual property, but is excited at the opportunity and challenge, and enjoys working in a collaborative “all hands on deck” group setting.\n\nResponsibilities and oversight include: <ul><li>Identifying and evaluating books and intellectual property (manga, webtoons, anime, graphic novels, articles, short stories, podcasts, etc.).</li><li>Developing an authentic point of view on material and the ability to pitch the material to executives and producers.</li><li>Interacting daily with the content teams, business affairs, legal team, marketing, and producers.</li><li>Proactively maintaining and developing relationships with agents, editors, publishers, scouts, authors, journalists and other IP rights holders and aggregators.</li><li>Be a liaison between our Content Team, and the partners and IP rights holders, and lead negotiations and deal conversations.&nbsp;</li><li>Researching and compiling reports and lists based on content team mandates and arenas of interest, as well as helping to maintain our internal IP database.</li><li>Attending relevant industry conferences, book fairs, and events, as well as some travel to liaise with our colleagues in other regions and countries.</li></ul><div><br></div> About you: <ul><li>A passion for TV/film/pop culture and reading, and the ability to evaluate material quickly and with an eye towards adaptation.</li><li>Extensive knowledge of Japanese content including live-action films and series, anime, and manga</li><li>Knowledge of the current book/IP-to-screen marketplace (deal-making, authors of note, buzz-worthy books, and IP already being developed).</li><li>Minimum 7 years of experience in the entertainment industry (book scouting, film/TV creative executive, publishing/editorial work, media rights representation; a combination of these fields is preferred) with negotiation/sales experience</li><li>A collaborative teammate who not only contributes ideas and feedback, but also has the ability to pivot easily to changes internally and in the marketplace.</li><li>A commitment to diverse and inclusive storytelling and helping to identify marginalized voices that have traditionally not been represented on screen.</li><li>Experience with interacting and engaging with executives, producers as well as representatives, authors, and industry contacts externally.</li><li>Strong organizational skills, critical thinking, attention to detail, and an ability to multitask.</li><li>Ability to manage and process detailed information while keeping perspective on the bigger picture&nbsp; &nbsp;</li><li>Demonstrated ability to work cross-functionally and across multiple geographies and time zones&nbsp; &nbsp;</li><li>Excellent project and time management skills&nbsp;&nbsp;</li><li>Strong written and verbal communication skills.&nbsp;</li><li>Fluency in English and Japanese is required.</li></ul> Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT30524-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013954", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT30524"], "team": ["Content Creative"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
