{"id": 790298013186, "name": "Research Scientist 4 - Content and Studio", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1719360000, "t_create": 1719360000, "ats_job_id": "AJRT44691", "display_job_id": "AJRT44691", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, our mission is to entertain the world by connecting our members with an extensive library of stories from around the globe. We are revolutionizing international storytelling by connecting 270&#43; million members in over 190 countries, across 30&#43; languages, to the movies and TV shows they love. A crucial element in forging these connections is providing personalized textual insights about our shows and movies and highlighting the unique ways they appeal to diverse audiences.</p><p></p><p><br /><br />Our mission at Netflix is to connect global stories with global audiences. When a Netflix member opens our app, we have a few precious moments to help them choose a story or a game that is right for them at that instance. Presenting them evidence – Artwork, Trailers, Synopses – that authentically represents each title and resonates with the member is essential to this effort.</p><p></p><p><br /><br />Getting this evidence just right for each title is a tall order; however, the Promo Media Algo team, with assistance from creative supervision and member feedback data, have built tools &amp; processes that use technologies like Computer Vision, Graphics, and Machine Learning to enable our creators to tell the best version of the story they want while allowing our studio to scale further.</p><p></p><p><br /><br />We are looking for a Research Scientist with a background in Computer Vision to join the team.</p><p></p><p><br />Responsibilities:</p><ul><li>Design and implement algorithmic solutions to create Visual Promotional Media Assets that are better at helping our members choose a story or game that will delight them in a cost-effective way. </li><li>Collaborate with cross-functional teams, including product managers, engineers, and data scientists, to define problem statements, define roadmaps, and execute on priorities. </li><li>Communicate complex concepts with both technical and non-technical stakeholders to influence strategic decisions.</li><li>Stay abreast of the latest developments in the field by attending conferences, reading research papers, and implementing promising novel ideas that can impact Promo Media workflows.</li><li>Contribute to the growth of the team and domain by exploring new directions and initiating projects with high potential for a substantial additional impact. </li><li>Engage with the ML community, internal and external, to learn, to teach, and to contribute to building a great Netflix brand in ML.</li></ul><p></p><p>About You:</p><ul><li>You have a strong foundation in machine learning and deep learning, including supervised and/or unsupervised learning, deep learning architectures, GANs, and diffusion models.</li><li>Advanced degree (MS or PhD) in Computer Science, Electrical Engineering, or a related technical field with a focus on Computer Vision.</li><li>Suitable programming skills in Python and experience with ML/DL frameworks such as PyTorch.</li><li>You have demonstrated the ability to solve complex problems with innovative algorithmic solutions in the media and content creation space. You are able to both develop novel algorithms and adapt existing methods from the literature to new challenges.</li><li>You have an entrepreneurial spirit, the ability to balance risk against reward, and a strong desire to initiate and execute on projects that are likely to have a large impact. You are an excellent communicator, capable of explaining complex technical details to both technical and non-technical audiences.</li><li>You are collaborative and thrive in fast-paced dynamic environments, contributing positively to the team and company culture.</li><li>The Netflix <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">culture</a> resonates with you.</li></ul><div></div><div></div><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.</p><p></p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><span>here</span></a>.</span></p><p></p><p></p><p></p><p><span>Netflix is a unique culture and environment. Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><span>here</span></a>.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44691-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013186", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44691"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
