{"id": 790298014054, "name": "Senior Researcher - Enterprise Product", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Consumer Insights", "business_unit": "Streaming", "t_update": 1716249600, "t_create": 1716249600, "ats_job_id": "AJRT45835", "display_job_id": "AJRT45835", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries, enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Content Promotion and Distribution product team is integral to helping Netflix feel personal and relevant by developing innovative approaches that power how we promote, localize, and distribute content around the world. \n\nThe Enterprise Product Research team’s mission is to create a competitive advantage for Netflix by delivering research and insights that translate directly into product and business impact, guiding the development of the world’s largest and most technically advanced content studio. This role will partner with business leaders, cross-functional product teams, and global creative talent inside and outside Netflix to power the technology suite that allows us to create great promotional assets at scale (think: your favorite movie/TV artwork and trailers that make deciding what to watch a thrilling experience). \n\nThis job sits at the intersection of enterprise technology and the consumer experience. Because our products touch both members and creators, we are seeking a researcher who can fluidly move between both worlds and seamlessly manage a portfolio of both enterprise and member-facing research, balancing strong research principles with deep empathy for the art and craft required to create great content. \nWhat You'll Be Doing: <ul><li>Partner with cross-functional teams (including Business Stakeholders, Design, Product Management, Engineers, and Data Scientists) to develop, lead, execute, and socialize a roadmap of high-impact research initiatives (both fast-moving product research and strategic business research).&nbsp;</li><li>Ability to respond to changing needs across the business to identify and prioritize impactful opportunities in an environment where balancing rigor with velocity is paramount.&nbsp;</li><li>Get deep into the technical workflows of complex enterprise products and workflow ecosystems.&nbsp;</li><li>Engage internal and external partners worldwide to uncover pain points and unmet needs from members and creators and translate them into actionable business recommendations.&nbsp;</li><li>Thoughtfully evangelize the role of research and scale practice in local and global environments where a research culture/infrastructure does not exist or is nascent.</li><li>Cut through competing perspectives and approaches to tell powerful, objective insights and stories that can land across diverse technical and non-technical audiences.&nbsp;</li><li>Identify opportunities to establish new points of view and capabilities that evolve our enterprise research function.</li></ul> The Ideal Background: <ul><li>Demonstrable experience leading both qualitative & quantitative research supporting product development and business strategy (ideally in both consumer and enterprise environments).&nbsp;</li><li>Experience working with global stakeholders and technical audiences.&nbsp;</li><li>Effective verbal and written communication to distill complex multi-method research reports into understandable, compelling, and actionable insights.</li><li>Strong analytical skills and the ability to triangulate data and insights from multiple sources.&nbsp;</li><li>Experience in or passion for working with creative teams/building products for creative teams.&nbsp;</li><li>Ability to frequently travel to Los Angeles to meet with stakeholders and openness to international travel as needed.&nbsp;</li><li>​​An advanced degree in psychology, social sciences, or a related field is a plus but not required.</li></ul> Who you are: <ul><li>You are curious, love learning, and are eager for new challenges.&nbsp;</li><li>You are comfortable putting a stake in the ground, even without all the data you need.</li><li>You are discerning and know when and how to balance scrappiness with rigor.&nbsp;</li><li>You are the first to roll up your sleeves when something needs to get done.</li><li>You make the connections no one else sees.</li><li>You stand firm in the face of change and challenge.</li><li>You read the Netflix culture memo and were energized.</li><li>You are equal parts creative and analytical.</li><li>You are both an excellent collaborator and a self-starter, and you know what it means to be both simultaneously.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $130,000 - $470,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45835-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014054", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45835"], "team": ["Consumer Insights"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
