{"id": 790298014014, "name": "Director, Mobile Experiences", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America", "Los Angeles, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1718841600, "t_create": 1718841600, "ats_job_id": "AJRT43996", "display_job_id": "AJRT43996", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Team: We want to invent entertainment experiences the world can’t live without, connecting people with stories they’ll love. The Member Product Management team is accountable for making the core Netflix experience better every day for our members around the world. Our work spans all platforms (TV/living room, mobile, tablet, and web), and includes experiences and ranking/recommendations strategy across discovery/browse (shows, movies, live programming, and games), player, identity/profiles, and new surfaces.\n\nThe Role: In this role, you will take full responsibility for delivering exceptional mobile, tablet and web experiences to our members. This includes maximizing the value our members derive from our current product offerings and discovering new ways to enhance member value.\n\nThis role is based in our Los Gatos office (preferred) in a hybrid model, but we are open to remote candidates who are on the West Coast (PST timezone). Travel to Los Gatos will be required if remote-based.\nWhat will you do? <ul><li>Oversee the end-to-end product management of the mobile and web Netflix member experience, including the development of a comprehensive product strategy that encompasses data, user interface, and algorithms, while setting and maintaining prioritization across the portfolio.</li><li>Partner with cross-functional leaders in articulating a compelling product vision, convert those ideas into well-scoped projects, prioritize smartly among competing efforts, and lead the team to execute at a high level.</li><li>Ensure that the broader organization is clear about our product strategy and roadmap, and farm for dissent to make sure that we’re focusing on the most important, strategic work.</li><li>Take product concepts from idea through validation, shipping, measurement, and iteration.</li><li>Work as part of an autonomous agile team along with designers, engineers, consumer insights, and data science, ML & analytics colleagues to deliver outstanding products to our customers.&nbsp;</li><li>Work with your consumer insights and experience design partners to deeply understand and socialize the evolving needs of our customers, content team, and partners.</li><li>Work closely with the TV experience team to determine shared and unique member use cases across mobile and TV to ensure member needs are addressed holistically across device experiences.</li><li>Manage a team of Product Managers focused on the Mobile & Web product domain.</li><li>Foster an inclusive environment, where all viewpoints are welcomed and encouraged.</li><li>Think broadly about the Netflix business and contribute to efforts beyond your domain.</li></ul> What are we looking for? <ul><li>10+ years experience in product management with a proven record of successfully launching products, or platforms. Preferably with experience leading mobile product development efforts.</li><li>Expertise managing ML-powered consumer experiences.</li><li>Demonstrated leadership working effectively with designers, data scientists, engineers, researchers, and colleagues across content, communications, and marketing.</li><li>Very high attention to detail, with an ability to connect the smallest experience elements to the big picture goals at the company and team level.</li><li>An ability to synthesize the complex into the simple and persuasive, and tell compelling stories with data.</li><li>Excellent written and verbal communication skills, and ability to present technical content to diverse non-technical audiences.&nbsp;</li><li>Experience working in an organizational structure with both vertical and horizontal teams where ownership of a capability cuts across multiple teams.</li><li>Ability to partner with different functions to ensure that your solutions drive real business impact. Strategic thinking and ability to incorporate larger business context into product development.</li><li>Ability to prioritize well, and manage a portfolio of bigger and smaller bets, while balancing short-term goals and long-term vision.&nbsp;</li><li>Experience with managing product managers.</li><li>Exposure to the entertainment industry or related products and solutions in the past is a huge plus.</li></ul> What we offer <ul><li>Opportunity to impact the business in a meaningful way.&nbsp;</li><li>Responsibility. Netflix offers true transparency and autonomy. Our <a href=\"http://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a> is unique and is key to how we innovate.</li><li>Freedom to innovate, solve interesting problems and influence in a fast paced, exciting environment.&nbsp;</li><li>Work with smart people who love to solve hard problems and who expect and foster high performance.&nbsp;</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $430,000 - $1,500,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43996-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014014", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43996"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
