{"id": 790298014625, "name": "Data Scientist (L5) - Content & Marketing DSE", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1719446400, "t_create": 1719446400, "ats_job_id": "AJRT46537", "display_job_id": "AJRT46537", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>It's an exciting time to join Netflix as we continue to transform entertainment globally. We are bringing new stories to millions of people worldwide by promoting our original, exclusive content. As we move beyond 270 million members and hundreds of partnerships worldwide, our approach to marketing is to build innovative, culturally relevant, creatively excellent campaigns that pierce the zeitgeist and drive conversation.\n\nData is a crucial component in shaping our comprehensive conversation strategy. In Content &  Marketing Data Science and Engineering (DSE), we focus on delivering data products and insights that support our business partners in their complex and nuanced decision-making processes. We are a highly collaborative team that partners across Netflix to drive impact.\n\nWe are seeking a talented Senior Data Scientist to provide key insights and thought partnership to our marketing decision makers. You will generate insights by scoping and executing deep dive analysis and experimentation with global marketing teams, consumer insights and finance and strategy. You will also be the primary point of contact for our Product Marketing, BizOps, and Content Services partner team and will play a critical role in aligning and coordinating the efforts of the various other DSE peers that partner with the Marketing team. In success, you will collaborate on existing priorities but also will propose and execute on new opportunities. This role features ample opportunity for project ownership, leadership and direct influence on impactful business decisions. \nIn this role, you will: <ul><li>Be a strategic thought partner with business stakeholders to define high-impact analytical problems and innovative ways to solve them with data.</li><li>Develop statistical models explaining campaign engagement and performance, Marketing impact, and other key behavioral patterns</li><li>Facilitate the Marketing cross-functional DSE pod, ensuring the DSE partnership efforts with Marketing efforts are aligned</li><li>Translate analytic insights into actionable recommendations for business improvement, and communicate these findings clearly to a broad audience</li><li>Identify and proactively socialize Marketing insights, especially those that may be impactful to other business areas</li></ul> What you’ll bring: <ul><li>Exceptional interpersonal and communication skills to influence stakeholders using clear insights and recommendations</li><li>Adept at cultivating strong partnerships</li><li>Exceptional thought partnership and engagement abilities with a diverse set of stakeholders and passion about communicating difficult concepts to non-technical audiences</li><li>Highly skilled in leading through influence</li><li>Exceptional facilitation, planning, and organization skills</li><li>Domain expertise in Marketing measurement</li><li>Strong statistical knowledge: understanding of predictive modeling; ability to tease out incrementality vs. correlations, confounder identification and amelioration, etc.</li><li>Basic understanding of experimentation including power calculations and interpretation of results</li><li>Strong SQL skills and experience with distributed analytic processing technologies (S3, Presto, Hive & Spark)</li><li>Strong skills in Python or R</li><li>Self-starter who thrives under a high level of autonomy.</li><li>Enthusiastic about Netflix culture</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46537-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014625", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46537"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
