{"id": 790298013409, "name": "Research Scientist L5, Algorithms Engineering", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1718841600, "t_create": 1718841600, "ats_job_id": "JR28459", "display_job_id": "JR28459", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>NOTE: This job posting is inclusive of a variety of positions within our Algorithms Engineering group. Based on your background, expertise and interests, we will route you to the appropriate team(s). All teams may not be hiring at the same time. \n\nAs Netflix continues to grow, we are venturing into exciting new frontiers of personalization to help our members find the content they’ll most enjoy.\n\nWe are looking for exceptional individuals to work full-time with us as research scientists. In this role, you will conduct applied research by conceptualizing, designing, implementing, and validating potential algorithmic improvements. This includes researching and applying cutting edge machine learning algorithms, running offline experiments, and building online A/B tests to run in production systems. To be successful in this role, you need a strong machine learning background, solid software development skills, a love of learning, a passion for solving end-user problems and to collaborate well in multi-disciplinary teams. You will need to exhibit strong communication and leadership skills, an ability to handle ambiguity and set priorities, and an execution focus in a dynamic environment. \nWhat we are looking for: <ul><li>A burning desire to solve real-world problems at scale by applying Machine Learning.</li><li>PhD or Masters in Computer Science, Statistics, or a related field.</li><li>5+ years of applied research experience with a track record of delivering quality results.</li><li>Experience in applied research in industrial settings.</li><li>Expertise in machine learning spanning supervised, self-supervised, and bandit learning methods.</li><li>Strong mathematical and problem-solving skills with knowledge of statistical methods.</li><li>Excellent software engineering skills in Python along with Scala or Java or C++ or C#.</li><li>Experience in one or more of the following applied fields: Recommendations, Personalization, long-term reward modeling, Bandits, Transformers.</li><li>Great interpersonal skills including strong written and verbal communication.</li></ul> Preferred, but not required: <ul><li>Experience as a technical leader.</li><li>Experience working with cross-functional teams.</li><li>Experience in one or more of Search, Natural Language Processing, Knowledge Graphs, Conversational Agents, Personalization, and Causal Inference, Reinforcement Learning, etc.</li><li>Experience with cloud computing platforms and large web-scale distributed systems.</li><li>Open source contributions.</li><li>Research publications at peer reviewed journals and conferences on relevant topics.</li></ul> Links: <ul><li><a href=\"https://research.netflix.com/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Netflix Research site</a></li><li><a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Our culture</a></li><li><a href=\"https://ir.netflix.net/ir-overview/long-term-view/default.aspx\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Our long term business view</a></li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28459-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013409", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28459"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
