{"id": 790298013574, "name": "Marketing Production Manager", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1718150400, "t_create": 1718150400, "ats_job_id": "JR28476", "display_job_id": "JR28476", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>The Opportunity</p><p><br />We are looking for an experienced Production Manager to join our UK Marketing Operations &amp; Production team, overseeing title-level campaign production, creative operations and project management across our UK content slate. Marketing Operations &amp; Production brings creative ideas to life while partnering closely with Marketing, Communications and Product groups at Netflix to connect our stories with millions of people worldwide. </p><p><br /><br />The Role</p><p><br />The role will oversee project management across our marketing campaigns for films, series and brand. This role will require exceptional communication, organisation and production expertise, with the ability to navigate multiple tools and complex workflows whilst maintaining operational best practices for campaign production for the business.</p><p><br /><br />The ideal candidate will be a nimble, solutions-oriented, project management expert, and thrive in a fast-paced environment. You will work closely with in-house producers in Video and Art &amp; Print, as well as external production agencies, to manage Netflix’s production and operational campaign needs. You will serve as the connective point to all cross-functional stakeholders, facilitating alignment between global and local teams dedicated to creative, localisation, media, marketing, publicity, events and social.</p><p><br /><br />You will be an accomplished creative Production Manager with a strong background in Media Production. Project management experience in Film and/or TV marketing campaigns either client-side or at an agency is essential. </p><p><br />Key Responsibilities</p><ul><li>Oversee a slate of Netflix UK titles managing the end-to-end campaign operational scope including: campaign production timelines, asset planning and production, budgets, deliverables and campaign resources. Ensuring a regular flow of information between all cross-functional partners in the UK, EMEA and globally.</li><li>Partner with a team of marketing managers, media strategists and integrated producers responsible for managing production, localisation, and trafficking of key promotional materials. Driving and enabling production excellence and innovation across channels including social, digital, OOH and experiential. </li><li>Manage the delivery of integrated marketing campaigns, including online and offline video, out of home, print, digital display, TV, cinema, radio and social advertising. </li><li>Lead status updates on project timelines and budgets. Identify and troubleshoot any anticipated production challenges.</li><li>Partner with marketing managers to provide production guidance and best practise advice for the creation and execution of stunts and activations linked to the promotion of our titles. </li><li>Uses judgement and data to inform best production practices and to ensure that we eliminate time-sensitive bottlenecks and produce high-quality creative with appropriate velocity &amp; accuracy.</li><li>Nurture and maintain a network of best-in market vendors (production agencies &amp; freelancers).</li></ul><p></p><p>Qualifications</p><ul><li>8&#43; years of marketing production/project management and creative production experience at an entertainment brand, advertising or media agency - within the entertainment industry. </li><li>Proven track record of managing large cross functional teams through successful marketing campaigns. </li><li>Expert knowledge of marketing campaign and localisation workflows, deeply understanding the creative and production process for videos (trailers, TV spots, paid social creative, etc), Print/OOH &amp; digital materials. </li><li>Fluent in Video, Print &amp; Digital types and formats, whilst understanding the fundamentals of asset management, servicing and ad trafficking.</li><li>High competency and proven track record of project management for high profile local and global campaigns.</li><li>Knowledgeable of ever-evolving advertising and media landscape.</li><li>Experience managing a high volume of creative and campaign types in parallel, while working with geographically dispersed teams.</li><li>Strategic thought partner and strong team player</li><li>Proactive, fast, and flexible problem-solver with superb time, resource, and stakeholder management. </li><li>Exceptionally strong communication and analytical skills along with the ability to think strategically and creatively.</li><li>Can support workflow optimisation, identifying gaps and opportunities to push for innovative solutions at scale, and capable of executing workflow changes where required. </li><li>Fluency in English is required, fluency in any other language is a plus.</li></ul><p></p><p>Personality Attributes</p><ul><li>You are passionate and curious about all aspects of entertainment marketing</li><li>You are a natural-born communicator, connecting the dots when others cannot, and have an ability to simplify complex issues and questions </li><li>You thrive in a fast-paced and demanding environment, possess a high level of intellectual curiosity, and demonstrate strong judgement in the face of ambiguity</li><li>You have a track record of successful cross-functional work and lead deftly across the many aspects of campaign development </li><li>A collaborative spirit who possess a strong creative and strategic sensibility who can expertly influence key stakeholders and foster deep relationships across the business </li><li>You approach all challenges and obstacles with a solutions-oriented mindset</li><li>You are resilient and able to consistently operate at a higher level. </li></ul><div></div><div></div><div>See <a href=\"https://jobs.netflix.com/\" target=\"_blank\">Who We Are</a> and what our <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">Culture</a> is like.</div><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28476-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013574", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28476"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
