{"id": 790298013609, "name": "MAC Manager (Moves/Adds/Changes)", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Facilities And Workplace Services", "business_unit": "Streaming", "t_update": 1716854400, "t_create": 1716854400, "ats_job_id": "JR27694", "display_job_id": "JR27694", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The Opportunity\nAs part of our Los Angeles Workplace team, we are seeking a Manager to lead the MAC (Moves, Adds, Changes) team in the move and relocation efforts of our evolving real estate portfolio. This position will be responsible for project strategy and execution for Netflix moves, adds, and changes of varying scale and complexity.  This role will work closely with our Space & Occupancy Planning, Design & Construction, and Workplace teams as well as our vendor partners to execute our evolving site strategies. \n\nThe successful candidate will be passionate, strategic, proactive, quick-thinking, flexible, creative, innovative, and able to juggle multiple and diverse responsibilities with a strong emphasis on organization. This is a demanding position that requires a strategic leader who demonstrates curiosity, excellent communication, and unwavering attention to detail. We are seeking a forward-thinking leader who is passionate about driving innovation, navigating unchartered territory, and guiding a team through change. \n\nResponsibilities <ul><li>Develop strategy for moves, adds, changes, including complex campus-wide relocations, reconfigures, and restacks. Plan and successfully manage internal relocations of varying complexity and scale.&nbsp;</li><li>Responsible for full-scale project plans, schedules, and budgets in partnership with Space & Occupancy Planning, Workplace, and Design & Construction teams.</li><li>Collaborates with all levels of the organization. Meets with partners to detail project scope, results, goals, risks, blockers, success measures, and estimated resources needed.</li><li>Ensures that projects remain in scope and meet budgetary, scheduling, and quality requirements.</li><li>Craft, present, and distribute project communication plans to internal stakeholders and functional partners.&nbsp;</li><li>Manage a team of full-time employees, contractors, and multiple vendors responsible for the successful execution of moves, adds, and changes.</li><li>Optimize relocations and FFE providers, including the RFP bidding process, develop KPIs, and recommend the selection of a vendor/contractor.</li><li>Provide regular status updates to leadership with a review of program metrics, achievements, and results.</li><li>Update project status reports, review invoices, and ensure timely payment.</li><li>Manage work orders and small projects, including but not limited to furniture reconfigurations and space enhancements.</li><li>Ensure your team closely collaborates with supporting stakeholders (AV, security, engineering, etc.).</li><li>Develop and implement a strategy for FF&E inventory management, including storage needs, asset tracking, and depreciation protocols.&nbsp;</li><li>Role may require some weekend and evening oversight.</li></ul> Qualifications <ul><li>Experience executing projects in a leased environment in collaboration with property management groups.</li><li>Ability to read and understand construction drawings.</li><li>Excellent level of communication and organizational skills.</li><li>Have an understanding of project cost analysis.</li><li>Proficiency in GSuite (Docs, Sheets, Slides, Calendar), Slack, Zendesk, and Serraview. A plus: AirTable and Asana.</li><li>Ability to lead inclusively. Incorporate inclusive leadership principles to drive collaboration, creativity, and innovation among team members. Fosters a workplace environment where diverse perspectives are valued.</li><li>Familiarity with modular furniture systems, FF&E, ergonomics & traditional Move, Adds, Changes (MAC).</li><li>Ability to problem-solve and manage multiple priorities in a fast-paced environment.</li><li>Positive team-oriented, hands-on, adaptive, and client-focused attitude.</li><li>Comfortable collaborating with diverse team members, including architects, building engineers, property management, senior internal partners, project managers, and facility managers.</li><li>High tolerance for change, and the capacity to accomplish enormous amounts of work in a fast-paced, ever-changing environment.&nbsp;</li><li>Respect, understanding, and enthusiasm for the Netflix Culture.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $350,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment. Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27694-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013609", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27694"], "team": ["Facilities And Workplace Services"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
