{"id": 790298013320, "name": "Manager, Finance and Strategy, Partnerships and Commerce - Korea", "location": "Seoul, Korea, Republic of", "locations": ["Seoul, Korea, Republic of"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1717718400, "t_create": 1717718400, "ats_job_id": "AJRT45397", "display_job_id": "AJRT45397", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Finance and Strategy (F&S) team for Partnerships and Commerce is seeking an experienced individual contributor to join our team. We have an opening for a Manager in our Korea team, based out of Seoul. This role is primarily focused on analyzing partnership opportunities in Korea, as well as supporting strategic commerce initiatives to shape broader growth strategy for Korea. \n\nLocal partnerships are a critical driver of growth for Netflix. The most common types of partnerships with local operators are bundles and/or set-top box integrations. Our team evaluates opportunities with leading local telcos and analyzes their performance over time. During negotiations, we provide strategic guidance to the Business Development team using data and analysis. When partnerships are launched, we monitor their performance and search for best practices and areas of improvement.\n\nThe team also plays a critical role in contributing to the broader growth strategy at the market level, providing competitive intelligence, local guidance on price and plan strategy across markets, and driving analysis in conjunction with our Regional Monetization and Consumer Insights teams. \n\nThis person will have a high degree of visibility with senior leadership of Netflix management who depend heavily on the strategic insights we provide to inform critical business decisions to drive overall growth in Korea.\n\nResponsibilities: <ul><li>Supporting senior stakeholders in the approach to Partnership launches in the region</li><li>Evaluating the financial impact of partnership opportunities (e.g. bundles) via financial projections and commercial scenario modeling&nbsp;</li><li>Analyzing the performance of existing partnerships to extract actionable insights (e.g. best practices, areas of improvement)&nbsp;&nbsp;</li><li>Creating insightful strategic presentations that facilitate decision-making for internal stakeholders and external partners&nbsp;&nbsp;</li><li>Partnering with the Product team to help identify, prioritize and assess the impact of new initiatives (e.g. reducing prices in a market, improving plan upgrades for bundles)&nbsp;</li><li>Work cross-functionally with other teams working on Partnership or Commerce initiatives (e.g. Partner Engagement, Marketing, Product, Consumer Insights)&nbsp;</li><li>Develop a deep understanding of industry trends as well as competitive threats in Korea to better inform our future strategic choices</li></ul> Qualifications: <ul><li>7+ years of experience in a top management consulting firm and/or tech companies&nbsp;</li><li>At least 3 years of management consulting experience or equivalent strategic and analytical roles in a high growth environment are strongly preferred</li><li>A highly analytical and effective communicator, with significant experience in managing and influencing senior stakeholders</li><li>A proven track record of performing quantitative and qualitative financial analysis, and driving strategic thinking independently and proactively</li><li>Must thrive in a fast-paced environment, possess a high level of ownership and intellectual curiosity, focus selflessly on driving team results and exhibit the highest standards of integrity and ethics</li><li>Skilled in preparing effective presentations with clear narratives and impactful visuals</li><li>Adept at managing multiple projects and stakeholders on a regular basis</li><li>Strong quantitative skills, proficiency in Excel; proficiency with SQL and Tableau a plus&nbsp;</li><li>Bachelor’s or master’s degree with emphasis on quantitative coursework; MBA a plus</li><li>English and Korean language fluency is mandatory</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>넷플릭스는</span><span> </span><span>다양한</span><span> </span><span>경험과</span><span> </span><span>생각을</span><span> </span><span>가진</span><span> </span><span>구성원이</span><span> </span><span>모였을</span><span> </span><span>때</span><span> </span><span>최고의</span><span> </span><span>성과를</span><span> </span><span>내는</span><span> </span><span>팀을</span><span> </span><span>만들어</span><span> </span><span>갈</span><span> </span><span>수</span><span> </span><span>있다고</span><span> </span><span>믿고</span><span> </span><span>있습니다</span><span>. </span><span>다양성과</span><span> </span><span>포용성은</span><span> </span><span>우리가</span><span> </span><span>지향하는</span><span> </span><span>기업</span><span> </span><span>문화의</span><span> </span><span>핵심</span><span> </span><span>중</span><span> </span><span>하나이며</span><span>, </span><span>이것의</span><span> </span><span>궁극적인</span><span> </span><span>목적은</span><span> </span><span>모든</span><span> </span><span>직원이</span><span> </span><span>역량을</span><span> </span><span>마음껏</span><span> </span><span>발휘하고</span><span> </span><span>성장하며</span><span> </span><span>기여할</span><span> </span><span>수</span><span> </span><span>있도록</span><span> </span><span>환경을</span><span> </span><span>조성하는</span><span> </span><span>것입니다</span><span>.  </span><span>인재를</span><span> </span><span>선별하는</span><span> </span><span>과정은</span><span> </span><span>이러한</span><span> </span><span>목적을</span><span> </span><span>달성하는</span><span> </span><span>데</span><span> </span><span>매우</span><span> </span><span>중요합니다</span><span>.  </span><span>이에</span><span> </span><span>따라</span><span> </span><span>넷플릭스는</span><span>  </span><span>성별</span><span>, </span><span>인종</span><span>, </span><span>피부색</span><span>, </span><span>국적</span><span>, </span><span>종교</span><span>, </span><span>성적</span><span> </span><span>지향</span><span>, </span><span>나이</span><span>, </span><span>결혼</span><span> </span><span>여부</span><span> </span><span>등</span><span> </span><span>모든</span><span> </span><span>개인적인</span><span> </span><span>배경과</span><span> </span><span>상관없이</span><span> </span><span>모두에게</span><span> </span><span>평등한</span><span> </span><span>기회를</span><span> </span><span>보장하며</span><span>, </span><span>공정한</span><span> </span><span>과정을</span><span> </span><span>통해</span><span> </span><span>채용을</span><span> </span><span>진행하고</span><span> </span><span>있습니다</span><span>.</span><span>장애인</span><span> </span><span>및</span><span> </span><span>국가보훈</span><span> </span><span>대상자는</span><span> </span><span>관련</span><span> </span><span>법령에</span><span> </span><span>따라</span><span> </span><span>우대합니다</span><span>.</span></p>", "id_locale": "AJRT45397-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013320", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45397"], "team": ["Finance & Accounting"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
