{"id": 790298012643, "name": "Research Engineer (L5) - Growth and Commerce", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1718150400, "t_create": 1718150400, "ats_job_id": "AJRT45933", "display_job_id": "AJRT45933", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Role location: Los Gatos, CA or Remote.\n\nNetflix is one of the world’s leading streaming entertainment services, with over 270 million members in 190 countries enjoying 1000s of TV Shows, Movies and Games every month via a variety of subscription plans - from Ad supported entry level plans to Premium plans that provide best-in-class streaming experience.\n\nThe Growth & Commerce Data Science & Engineering team plays a critical role in driving and accelerating sustainable growth of Netflix members and revenue globally, by leveraging data, experimentation & machine learning to develop compelling and persuasive conversion and monetization experiences across the membership lifecycle - starting from the signup flow which is visited daily by millions of prospective members looking to find persuasive information about our service, to timely & relevant commerce experiences post-signup to optimize revenue per member.\n\nAs a Senior Research Engineer, you will join this team of stunning Data Scientists, Analytics Engineers and ML Scientists to lead the development of algorithmic & ML driven experience optimization systems\n\nML for Growth & Commerce experiences is a relatively greenfield area, with potential for several 0-1 applications that can drive millions of dollars of impact at Netflix’s scale. You will be responsible for operating, as well as innovating on, these algorithms in production, and validating through running offline experiments, and building online A/B tests to run in production systems. You’ll partner with other ML engineers, scientists and product managers on cross-functional ML initiatives. You’ll spot gaps in how we’ve done things before, and you’ll find a better way to do them. \n\nTo be successful in this role, you’ll bring a solid machine learning background, strong software development skills, rapid learning velocity, a burning desire for impact and a passion for solving problems end-to-end. You will need to demonstrate strong communication and leadership skills, an ability to set priorities, and a strong bias to action in a dynamic environment.\nIn this role, you will: <ul><li>Design, implement and operate high impact machine learning models in Growth & Commerce</li><li>Partner closely with cross-functional Growth leads and business analysts to identify high value applications of machine learning, translating business intuition into data-driven solutions&nbsp;</li><li>Work closely with scientists and engineers on detailed requirements and implementation of end-to-end solutions at scale</li><li>Inform and influence the development of better infrastructure for developing and deploying ML models</li><li>Advocate for and apply best practices when it comes to availability, scalability, operational excellence, and cost management</li></ul> What you’ll bring: <ul><li>Deep end-to-end ML experience with a strong track record of deploying successful ML solutions</li><li>Exceptional communication skills, able to explain complex technical concepts clearly to cross-functional partners&nbsp;</li><li>Ability to deal with ambiguity; a strong ownership mindset, and a desire to thrive on minimal oversight and process</li><li>Willingness to learn and rapidly absorb business context in the complex payments ecosystem</li><li>Strong experience in a ML/DL framework (e.g., scikit-learn, Keras, PyTorch, TensorFlow)</li><li>Excellent software engineering skills in multi-language settings with Scala, Java, and Python</li><li>PhD or Masters in Computer Science or related field preferred</li><li>Experience with causal ML or reinforcement learning is a plus</li><li>Experience with Growth, Notifications or other Targeting systems is a plus</li></ul> What you’ll learn: <ul><li>Innovation and partnership on a global scale, navigating the balance of technical rigor with business requirements</li><li>Incubating and scaling new areas of ML within a highly successful product</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45933-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012643", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45933"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
