{"id": 790298014096, "name": "Senior Analytics Engineer", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1720656000, "t_create": 1720656000, "ats_job_id": "AJRT45006", "display_job_id": "AJRT45006", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Now is an amazing time to join Netflix as we seek to entertain the world. We have over 270 million paid members in over 190 countries, and we won’t stop there. Games are our next big frontier and an incredible opportunity for us to deliver new experiences to delight and entertain our quickly growing membership. You will be jumping in at the early stages of this adventure and be in a position to help us redefine what a Netflix subscription means for our members around the world.\n\nData Science and Engineering (‘DSE’) at Netflix is aimed at using data, analytics, and sciences to improve various aspects of our business. We are looking for a Senior Analytics Engineer to join our Games DSE team, leading end-to-end analytics & data needs for the Games space. This role will be partnering closely with our stakeholders from Game Studios, product and engineering to do advanced analytics and define key metrics, build and maintain key analytic tools and provide data driven insights to our stakeholder set. As an early member of the team, you will also help shape our overall Games Data Strategy at Netflix.   \nWhat You Will Do: <ul><li>Partner directly with our Game stakeholders (e.g., Netflix Games Studio, Games Product, Game Strategy, Planning & Analysis team) on data, metrics & analytics initiatives.</li><li>Lead end-to-end development of reports/dashboards/tools used by your direct stakeholders and a diverse set of teams across the company.</li><li>Proactively perform data exploration and analytical deep dives to discover insights or future opportunities.</li><li>Be a bridge between the business and tech, scaling access to insights that can empower better decision-making.</li><li>Drive the direction and execution of your work, which span from developing scrappy analytic tools to designing scalable analytic systems.</li><li>Balance handling engineering efforts, analytical deep dives, and building analytic products.</li></ul> Who You Are: <ul><li>5+ years of experience in leveraging technical skills in manipulating large data sets with complex SQL and Python (or similar languages), big data technologies (e.g., Hadoop, Spark) and visualization tools (e.g., Tableau).</li><li>Exceptional communication and collaboration skills coupled with strong business acumen.</li><li>Comfortable with ambiguity; able to take ownership, and thrive with minimal oversight and process.</li><li>You are experienced in managing stakeholder asks, expectations, and relationships across a variety of stakeholders.</li><li>Experience in the Gaming industry preferred.</li><li>Netflix culture resonates with you.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45006-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014096", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45006"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
