{"id": 790298013143, "name": "Ratings Policy Strategist", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1712102400, "t_create": 1712102400, "ats_job_id": "JR27963", "display_job_id": "JR27963", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is releasing content at a pace and scale unlike any studio or broadcast channel in history: all around the world, at the same time for over 265 million members. With so many different titles to choose from across such a range of tastes and cultural standards, our members need the information and context to be able to tell at a glance that what they’re watching is appropriate for their household.\n\nWe are looking for an experienced and passionate strategist for the Policy division of our Ratings team. The Ratings Team is a center of excellence for maturity ratings and advisories, working closely with Product, Content, and Public Policy teams at Netflix to empower members with trustworthy ratings guidance to make informed viewing choices for themselves and their families.\n\nIn this role, you will have the opportunity to help rate and classify Netflix’s rapidly growing catalog of content. It will require an understanding of global rating requirements, critical thinking and thorough analysis, policy development, operational aptitude to enforce those policies, clear written and verbal communication, and deep-level movie and television expertise. The work you do in this role will directly affect how our members decide what to watch.\n\nWithin the Product Metadata and Ratings team, you will serve as a trusted consultant to Content, working with our metadata, innovation, and classification teams to provide accurate global maturity ratings and advisories for our titles. You will collaborate with Public Policy and Comms to ensure that ratings and advisories are locally relevant. In the broader Product organization, you will partner with Globalization, Product Creative Studio, Operations, Consumer Insights, and Engineering to execute our overall maturity ratings strategy.\nKey Responsibilities <ul><li>Provide maturity ratings and advisory guidance to Content teams throughout the development of a title - from script to post-launch</li><li>Engage with external ratings boards and filmmakers/show executives, especially on high-profile titles, and provide detailed notes to help Content teams reach desired ratings</li><li>Communicate ratings information and rationale to Content teams, Public Policy, and Comms</li><li>Audit titles for accurate maturity ratings, content advisories, and local sensitivities</li><li>Develop, maintain, and explain ratings guidelines to our stakeholders</li><li>Consult with Content Analysts on the factors that impact a title’s rating</li><li>Lead cross-functional education, research, and innovation projects</li><li>Manage escalations related to ratings and advisories and articulate tradeoffs between different courses of action for team and company leadership</li><li>Advise on the appropriateness of trailers, imagery, and other supplemental materials appearing on-platform</li><li>Identify opportunities to increase efficiencies of current workflows and propose alternative solutions</li></ul> Qualifications <ul><li>7+ years in relevant fields such as global Content Classification, Standards & Practices, Trust & Safety, Content Moderation, Content Strategy, and Policy/Legal Operations</li><li>5+ years experience in highly cross-functional global roles gaining buy-in, alignment, and context from a variety of stakeholders</li><li>Critical thinking, creative problem-solving skills&nbsp;</li><li>Experience analyzing, adapting, and adopting government regulations</li><li>Knowledge of, and adherence to, global ratings boards’ standards and requirements</li><li>Strong judgment and decisiveness when dealing with timely, deadline-driven, content-related issues and concerns</li><li>Excellent verbal and written communication with experience explaining complex ideas to stakeholders</li><li>Experience crafting policy proposals that require research, data support, rationale, and cross-functional feedback</li><li>Experience with algorithm-assisted and vendor-supported workflows</li><li>Excellent project/program management skills, and/or a proven track record for operational excellence</li><li>Proficiency in the Google Suite, AirTable, or other database/ reporting/ tracking tools</li><li>Experience working with non-western cultures and knowledge of cultural content concerns</li><li>Proficiency in languages other than English is a plus</li><li>Experience managing content in languages other than English is a plus</li></ul><div><br></div><div><b>Applications will be accepted until May 24, 2024.</b></div> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $210,000 - $500,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27963-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013143", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27963"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
