{"id": 790298013007, "name": "Sales Partner - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Sales And Business Development", "business_unit": "Streaming", "t_update": 1717977600, "t_create": 1717977600, "ats_job_id": "AJRT42938", "display_job_id": "AJRT42938", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid\nmemberships in over 190 countries. Our mission is to entertain the world and we are\nconstantly innovating to bring the best stories from around the world to our members. With the incredible launch of our ad-supported model, we are now working toward providing more choices for consumers and a premium brand experience for advertisers. \n\nAs the Agency Sales Partner in Japan, you will be responsible for helping lead the development and execution of the agency sales strategy in Japan. Working closely with senior-level account directors, account planning stakeholders, trading leadership, and investment directors within our agency partners, you will build strong relationships with advertisers, promoting the use of the Netflix advertising platform to C-level executives including: CMO, CDO, Media Directors etc.\n\nYour role involves the dual tasks of cultivating business with senior stakeholders at major agency groups and establishing key client relationships with C-level, VP, and Director contacts within those portfolios. You will drive Netflix Advertising opportunities with agency partners, client leaders, and internal teams.  \n\nThe ideal candidate will have a deep understanding of the advertising ecosystem in an established network of relationships, and a track record of delivering revenue growth.\nKey responsibilities: <ul><li>Develop and execute agency-focused sales for Japan to deliver revenue targets and exceed client expectations.</li><li>Build and maintain strong relationships with a major Agency Holding group and related Agencies to secure ad partnerships and drive revenue growth.</li><li>Develop long-term relationships with key senior Clients within those portfolios.</li><li>Partner with Microsoft Partner teams to respond to briefs and grow the business together</li><li>Develop sales strategies and sales plans for the assigned Account portfolio&nbsp;</li><li>Collaborate with cross-functional teams to ensure the successful delivery of advertising campaigns.</li><li>Leverage Netflix's unique audience insights and premium content offerings to drive revenue growth.</li><li>Monitor market trends, and competitor activity and identify opportunities for innovation.</li></ul> We're looking for: <ul><li>8+ years of advertising sales experience</li><li>Fluency in Japanese and English is required for this role</li><li>Proven strategic thinker with the ability to analyze data and translate it into specific and measurable tactics, actions, and outcomes</li><li>Highly skilled in negotiating and selling the intrinsic value of a premium offering to customers</li><li>Problem solver with the ability to collaborate and work across functions</li><li>Prospecting and cold calling skills necessary</li><li>Understanding of how our clients set priorities and performance goals, and how we can align our product portfolio to best fulfill those needs</li><li>Excellent written, verbal and interpersonal communication skills</li><li>Ability to multitask, make decisions and manage at entrepreneurial speed</li><li>Strong, confident presentation skills</li><li>Interest in our corporate culture (read our memo <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>)</li></ul> If you have a passion for entertainment and a desire to work in a fast-paced, innovative environment, we would love to hear from you. Come join us and help us entertain the world!\n\nNetflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT42938-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013007", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT42938"], "team": ["Sales And Business Development"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
