{"id": 790298014152, "name": "Senior Software Engineer (L5) - Personalization Data Engineering", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1721959078, "t_create": 1712534400, "ats_job_id": "AJRT45452", "display_job_id": "AJRT45452", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>About the Team\nNetflix continues to shape the future of entertainment by offering a delightful and personalized experience for members to discover and enjoy a rapidly growing catalog of movie and TV content.\n\nThe personalization data engineering team is responsible for building large, web-scale datasets used for enabling and improving member experience. These datasets are integral inputs to our machine learning algorithms, which drive the exceptional experiences our members enjoy. By utilizing cutting-edge data infrastructure such as Spark, Flink, Kafka, Cassandra, and Iceberg etc we build systems that ensure the delivery of highly reliable and high-quality data.\n\nAbout the role\nGiven the size, complexity and criticality of our datasets, we are looking for a Software Engineer with a deep analytical mindset and experience with modern distributed systems. As a member of this team, you will drive innovation in big data processing by contributing and adding to the team’s suite of data products and frameworks. You will also have the unique opportunity to partner with our world-class algorithm teams to drive continuous improvement and innovation to Netflix personalization.\nSkills required for this role: <ul><li>Expertise in building production data systems (using Spark, Flink, etc.) on web-scale datasets.</li><li>Proficiency in at least one major programming language (e.g. Java, Scala) and ability to pick up new tech skills independently.</li><li>Hands on experience with schema design and data modeling, with an unmistakable passion for elegant and intuitive dataset design.</li></ul> Qualities we value: <ul><li>You have a passion for engineering excellence and tolerance for ambiguity in a fast-paced setting.</li><li>You are independent and can allocate your time judiciously. You employ organizational context to resolve competing priorities.&nbsp;</li><li>You are able to strategically partner with diverse stakeholders to drive innovation.</li><li>You seek to drive change and influence others through clear and effective communication.&nbsp;</li><li>You are both a leader and a learner and can smoothly inter-operate between the two personas with humility and maturity</li></ul> Our culture:\nNetflix's culture is key to our success. We celebrate diversity, recognizing that diversity of thought and background builds stronger teams, and we approach inclusion equally seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45452-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014152", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45452"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
