{"id": 790298014035, "name": "Software Engineer 5 - Streaming Algorithms", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Engineering", "business_unit": "Streaming", "t_update": 1718582400, "t_create": 1718582400, "ats_job_id": "JR28425", "display_job_id": "JR28425", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Interested in working with the team that influences <a href=\"https://drive.google.com/file/d/18cR9WJ2SIZv1UBfDfLn754tSJomin-Qx/view\" target=\"_blank\">⅓ of the Internet traffic</a>, <a href=\"https://networkingchannel.eu/wp-content/uploads/2021/11/networking_channel_Nov21.pdf\" target=\"_blank\">shapes the playback experience at Netflix</a>, and brings <a href=\"https://netflixtechblog.com/engineering-a-studio-quality-experience-with-high-quality-audio-at-netflix-eaa0b6145f32\" target=\"_blank\">studio-quality audio to Stranger Things</a>? Read on to learn more!<br /><br /><b>Who We Are</b><br />We obsess over great playback experiences. We want playback to start immediately, at great quality, and we never want playback to stop unexpectedly. <br /><br />To provide the best possible streaming experience, we design algorithms that adapt audio and video qualities to ever-changing network conditions, encoding profiles, UI features, and device capabilities. Our team comes from diverse backgrounds, has an equal gender ratio, and has a wide range of expertise in computer networking, video streaming, data analysis, embedded systems, and software engineering. <br /><br />Beyond the subscription-based video-on-demand service, we help Netflix expand into Live Streaming and Advertisements. We work highly cross-functionally and jointly develop our algorithms with Netflix CDN, Encoding Technologies, Data Science &amp; Engineering, Consumer Insights, and UI Engineering. <br /><br /><b>Who You Are</b><br />We are looking for a senior engineer to help us further improve the streaming quality of experience (QoE) on browsers, game consoles, Smart TVs, mobile and other devices. In this role, you would be responsible for improving Netflix’s Live streaming experience and developing tools that help innovate streaming algorithms for millions of devices. You will also help evolve system architecture and conduct controlled experiments in the field to validate improvements.<br /><br />It’s an exciting time to join this team! The business is expanding, the science is new, and we’re making big progress at a rapid pace.</p><p><br />More about you:</p><ul><li>Comfortable developing software on multiple platforms.</li><li>Comfortable with algorithm-focused software development.</li><li>Proven ability to design tools to improve software performance.</li><li>Proven ability to communicate complex technical issues cross-functionally.</li><li>Bias to action and take strategic approaches to solve technical problems.</li></ul><p></p><p>Nice to have skills:</p><ul><li>Experience in statistics and data analysis.</li><li>Experience with audio or video.</li><li>Knowledge of streaming protocols</li><li>Knowledge of data engineering</li><li>Knowledge of encoding technology</li><li>Experience with shipping software on behalf of a major brand at scale.</li></ul><p></p><p>What you will do:</p><ul><li>Improve Netflix Live playback experience through adaptive streaming designs.</li><li>Design tools and systems to facilitate adaptive streaming algorithm designs and improve the playback experience.</li><li>Design metrics that capture the viewer’s experience as well as the system performance.</li><li>Run controlled experiments on millions of streaming sessions to validate improvements.</li><li>Work cross-functionally with Netflix CDN, Encoding Technologies, Data Science &amp; Engineering, Consumer Insights, and UI Engineering.</li></ul><p></p><p>To Learn More:</p><ul><li>Read about the Netflix <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">culture</a> which values freedom and responsibility, enabling us to do our best work.</li><li>Watch <a href=\"https://www.youtube.com/watch?v&#61;kCshXyCmUho&amp;t&#61;9s\" target=\"_blank\">the video</a> to learn how Netflix streaming works and how we design adaptive streaming algorithms.</li><li>Watch <a href=\"https://www.youtube.com/watch?v&#61;t4nRrLygVwo\" target=\"_blank\">the video</a> to learn how we improve the experimentation methodology with Bayesian Optimization.</li><li>Read <a href=\"https://netflixtechblog.com/engineering-a-studio-quality-experience-with-high-quality-audio-at-netflix-eaa0b6145f32\" target=\"_blank\">the tech blog</a> to learn how we launch the high-quality audio experience at Netflix.</li><li>Read <a href=\"https://drive.google.com/file/d/18cR9WJ2SIZv1UBfDfLn754tSJomin-Qx/view?usp&#61;drive_link\" target=\"_blank\">this paper</a> to learn how we make Netflix traffic friendlier on the Internet while improving the quality of experience. </li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br /><br />Netflix is a unique culture and environment.  Learn more here.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28425-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014035", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28425"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
