{"id": 790298013518, "name": "Director, Marketing Partnerships Creative, APAC", "location": "Singapore, Singapore", "locations": ["Singapore, Singapore"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1708300800, "t_create": 1708300800, "ats_job_id": "AJRT44485", "display_job_id": "AJRT44485", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>It's an exciting time to join Netflix as we continue to transform entertainment globally. We are bringing new stories to millions of people worldwide by promoting our original, exclusive content.  As we move beyond 270 million members and hundreds of partnerships worldwide, a key to growth is our ability to work well with strategic partners across verticals. We’ve recently introduced a new ad-supported plan, offering customers a more affordable price point and offering advertisers a new way to reach engaged audiences. \n\nAs we grow & evolve our partnerships & ads offerings, we are looking for a talented leader who can drive strong creative outcomes across the Marketing Partnerships team.\n\nThe role:\nThe Marketing Partnerships team seeks to drive meaningful marketing outcomes across our strategic partnerships: i) distribution partners like telco operators, pay TV services & consumer electronics brands, ii) co-promotion campaigns featuring the Netflix brand and / or IP with leading consumer brands & iii) the emerging Ad Sales business. The Marketing Partnerships Creative team supports all of the above by developing a strong partnership creative strategy and creating compelling campaigns, activations & sponsorships. \n\nWe are seeking a strategic leader for the Marketing Partnerships Creative team (15+ years) who can lead a team of end-to-end creatives to develop, design and creatively execute all our partnership campaigns & Ad sales materials. This individual will be responsible for building our creative capabilities as we grow our team and supporting agencies across the region with a special focus on Korea and Japan. The ideal candidate also comes with a deep understanding of how to creatively support an Ad Sales organization. \n\nThis individual must demonstrate deep passion and expertise in creative marketing. Any entertainment marketing experience will be a bonus. The ideal candidate will be capable of building a strong creative strategy that can drive specific outcomes - consumer acquisition, buzz / word of mouth around the biggest Netflix titles or exciting advertisers by helping them connect with our IP & brand in impactful ways. The candidate will be well versed in developing a partnership campaign positioning and strategy and ultimately, the crafting and execution of marketing campaigns that inspire people to share and talk about Netflix and our content. This role must be able to closely partner with external agencies/vendors, external partners (advertisers) as well as cross-functional teams across Ad Sales, Ads Marketing, Consumer Insights, Title Marketing, Consumer Products, Partnerships & more. \n\nThis person should value entrepreneurial work environments and thrive in our ‘freedom and responsibility’ culture. If you are passionate about entertainment with demonstrated experience in crafting and executing impactful creative campaigns/programmes, we’d love to hear from you.\nKey responsibilities: <ul><li>Support & mentor a team of creative managers to develop high quality partnership and Ads Marketing campaigns.</li><li>Establish a high quality creative team across the region. Build effective ways of working, budget & resourcing efficiencies and a regular cadence of learnings and best practices.&nbsp;</li><li>Building a network of creative agencies & freelancers across the key APAC markets. Existing relationships with leading advertising agencies and brands across APAC markets is a bonus.&nbsp;</li><li>Setting the creative strategy and ensuring business objectives are met over time. </li><li>On occasion, leading creative workshops, presentations, briefings and owning the feedback loop and output with partners and agencies.</li><li>Creatively supporting the Ads Business through pitch decks, AVs, events, experiences & more.&nbsp;</li><li>Closely collaborate with key XF partners including Content, Marketing, Production, Ads Marketing and Consumer Products.&nbsp;</li></ul> Qualifications/Experience: <ul><li><b>THE BASICS:</b> 15+ years of track record in brand or consumer marketing at advertising agency, or in-house Creative team. Experience in Entertainment or Ads Marketing Creative is a plus. Experience in Korea and/or Japan is a plus.&nbsp;</li><li><b>STRATEGIC PLANNING: </b>Connector of dots, able to scan through data, behaviours, comms plans, consumer research to find partner insights and content insights and bridge them in the right sweet spot to create the most fertile territory for great ideas to flourish.</li><li><b>CREATIVE THINKER:</b> A media-agnostic thinker who can ideate for any space and impact the right audience. Knows how to get to great work and brings a fresh perspective to the way people connect with culture, content and brands.&nbsp;</li><li><b>PROJECT MANAGEMENT: </b>A creative shepherd and problem solver who is able to drive multiple projects from start to finish and turn cool ideas into reality. Knowledge of production with the ability to execute flawlessly. Doesn’t hesitate to get into the details, and does not lose sight of the broader strategic intent.</li><li><b>CLEAR & CONCISE COMMUNICATOR: </b>We are looking for a fluent English speaker with excellent communication skills, who is comfortable collaborating with multiple internal cross-functional teams and confident in influencing external senior stakeholders. Knowledge of other Asian languages is a plus.&nbsp;</li></ul> Personality Attributes: <ul><li>Curious and creatively-minded in every way.</li><li>Entrepreneurial and selfless collaborator who is selfless and goes beyond roles and titles to get great work done.</li><li>Able to give and receive feedback positively, and see the value of different perspectives.</li><li>Able to think and act with agility.&nbsp;</li><li>Capable of being impactful without the support of a large team of direct reports.</li><li>Demonstrates strong judgment in the face of ambiguity.</li><li>Flexible and adaptive to evolve the role based on our business needs.</li><li>A natural and deep affection for movies and television and the role of entertainment in today’s media landscape.</li><li>A desire to thrive in our unique <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a>.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT44485-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013518", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44485"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
