{"id": 790298013275, "name": "Senior Producer, External Games", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Games", "business_unit": "Streaming", "t_update": 1715040000, "t_create": 1715040000, "ats_job_id": "JR28220", "display_job_id": "JR28220", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>This is your chance to be at the forefront of Netflix’s new offering of Video Games. We will bring these new experiences to market through the world's leading streaming entertainment app with 208 million paid memberships in over 190 countries who are already enjoying TV series, documentaries, and feature films across a wide variety of genres and languages.\n\nMembers can watch as much as they want, anytime, anywhere, and now they can download and play mobile games anytime, anywhere with a collection of Netflix curated and produced Games. At Netflix, we have an insatiable need to continually improve our product experience and the creative elements that support it and this team sits at the forefront of the effort. \nResponsibilities: <ul><li>Take the lead as an external developer’s primary point of contact, working with developers in the creation of project and milestone schedules, submission planning, and overall development plans; provide ongoing management checks and balances throughout the full product life cycle.</li><li>This role will manage external game development partners across multiple titles at once.&nbsp;</li><li>Review and evaluate game builds and milestones across design, creative, development, and production progress.&nbsp;</li><li>Work with Head of External Game Development and Executive Producers to ensure all projects are delivered on time, within budget, against the design scope, and aligned to broader portfolio and quality goals.&nbsp;</li><li>Take a long-term view and ownership towards developing games with an eye toward sequels, localizations, and product line extensions.&nbsp;</li><li>Maintain relationships with external leadership level development & publishing teams to ensure all production and publishing goals and concerns are met, cultivating relationships to effectively collaborate and problem solve.&nbsp;</li><li>Help resolve unique, complex product issues through ingenuity, creativity, and any other means necessary to get the job done. Identify risks early and often and remove roadblocks and performance bottlenecks as needed.&nbsp;</li><li>Inspire and empower the development teams that you will be working with, guide them through continuous improvement, and share learnings with the studio.&nbsp;</li><li>Serve as internal product champion/evangelist by crafting and presenting product pitches in appropriate ways to specific and different audiences, providing visibility into milestones and challenges. Ensure that all teams have optimal product information to deliver games to market.</li><li>Work cross-functionally to Create a healthy team culture that is communicative, transparent, motivated, committed, and focused on realistic goals.</li></ul> Qualifications: <ul><li>7+ years of experience in game development/product management (social, F2P, mobile, web, console, handheld).</li><li>2+ years experience as a Producer in the games industry including leading the development of game features and/or services.</li><li>Experience in publishing is a plus.</li><li>Ability to collaborate with and manage external development teams.</li><li>A strong knowledge of production, the difficulties generally encountered by teams, and solutions tailored to their requirements.&nbsp;</li><li>Having significantly contributed to complex cross-functional projects with the successful delivery of quality, schedule, and balancing scope, capacity, budget, risk, and time.&nbsp;</li><li>Experience managing a team of multiple developers (programmers, artists, animators, designers, testers).</li><li>Licensed game experience is a plus.</li><li>Strong project management skills - Fluent with Agile methodology.</li><li>Excellent verbal and written communication skills.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $90,000-$600,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28220-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013275", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28220"], "team": ["Games"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
