{"id": 790298013517, "name": "Senior Design Technologist, Live", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1719878400, "t_create": 1719878400, "ats_job_id": "AJRT43307", "display_job_id": "AJRT43307", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Do you feel equally at home dreaming up new ideas to create elegant and delightful user experiences as you do rolling up your sleeves and writing the code that brings these ideas to life? Do you have the mindset of a Product Designer but the skills of a Front-end Engineer? If so, we’d love to chat. The Design Technology team is seeking a new member to help advance Netflix&#39;s mission to entertain the world.</p><p><br /><br />About The Design Technology XD team</p><p><br />Our team&#39;s purpose is to deepen the technical proficiencies of the Product Design organization. We do this by working on design projects where writing coded prototypes will unblock, up-level, or expedite product innovation ideas, and by building design tooling &amp; infrastructure that make the process of designing at Netflix more efficient. Our team plays a crucial role in driving innovation and efficiency within Netflix’s Product Design organization.</p><p></p><p><br />About Live Streaming &#64; Netflix</p><p><br />Netflix has recently expanded its entertainment offerings to include live content, allowing members to stream events such as the upcoming Mike Tyson vs. Jake Paul fight and the Christmas Day NFL games. This role is an exciting opportunity to help support the team responsible for creating the best-in-class user experience around this new content type in our product.</p><p><br /><br />About The Role</p><p><br />In this role, you will leverage your unique combination of solid design and engineering skills to make impactful contributions at each phase in the product innovation lifecycle.  You will help brainstorm and then write the code that breathes life into new design concepts, making them tangible for the team. These prototypes help us validate ideas both internally and with our users via in-field qualitative research. You will act as a bridge between the Design team and our cross-functional partners, helping to ensure both design fidelity as well as technical feasibility.</p><p></p><p><br />Your work will directly influence the way millions of people experience live content on Netflix.</p><p></p><p><br />About You</p><p></p><ul><li>You have a creative mind and a deep understanding of interaction design. You care about the design details and are driven to push the user experiences you create beyond acceptable to make them exceptional. You have an entrepreneurial spirit and bring your own creative ideas into the conversation (instead of waiting for others to tell you what to make).</li><li>Your engineering skills are rock-solid, but you’re never done learning. You have a curiosity that compels you to try new technologies, build for new platforms, and solve new technical problems. You don’t suffer from ‘analysis paralysis’ and prioritize trying a bunch of ideas quickly over meditating to find the “perfect” solution.</li><li>You thrive on collaboration. You’re inclusive in your engagement with your team and cross-functional partners. You’re mature enough to not have an ego, and you welcome honest, open feedback as easily as you give it. You demonstrate selflessness by prioritizing making the right call for the business, team or project over your own personal opinion.</li></ul><p></p><p></p><p>What We&#39;re Looking For</p><p></p><ul><li>Experience designing and prototyping live streaming experiences.</li><li>A great portfolio showing several years worth of complex, highly usable interactive UIs.</li><li>Several years of experience writing HTML, JavaScript and CSS applications and fluency with modern frameworks and libraries such as React and NodeJS</li><li>Experience creating performant animations on the web using both CSS and JavaScript</li><li>Proven leadership and strategic ability to drive initiatives and projects with teams</li><li>The communication skills to clearly articulate your concepts—and evangelize on their behalf</li><li>A love of movies, TV shows, Games, and interactive media is a plus</li></ul><p></p><p><br />Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><u>here</u></a>.<br /><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><u>here</u></a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43307-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013517", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43307"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
