{"id": 790298013469, "name": "Senior Manager, Content Programming Strategy & Operations - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1719964800, "t_create": 1719964800, "ats_job_id": "AJRT46519", "display_job_id": "AJRT46519", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Content Programming Strategy & Operations (CPS&O) is looking for a Senior Manager to join and lead the Japan team in Tokyo. CPS&O is the team in charge of the analytical efforts and strategic thinking behind the content programming strategy, working across content buying and original content decisions of Japanese Live Action and Anime. The team works cross-functionally to translate the incredible amount of data at Netflix into problem-solving and strategic decisions. \n\nThis person will have a high degree of visibility with senior management which uses the team’s analysis and insights to inform important business decisions, such as our content performance analysis and programming strategy.\n\nThis role will be located in Netflix's Japan office and report to the APAC CPS&O lead.\nResponsibilities: <ul><li>Understand the day-to-day work of the team and provide guidance and perspectives (both technical and qualitative)&nbsp;</li><li>Lead valuation of new projects and deal evaluation and support for all original and licensed content in partnership with Content Creative and Acquisition teams&nbsp;</li><li>Analyze title performance and the ongoing trend of key content metrics on the slate level</li><li>Conduct content deep-dives and compile thoughtful post-mortem analyses to determine areas for optimization and improvement</li><li>Develop audience insights and a deep understanding of the industry to build a programming and resourcing strategy across content and production</li><li>Lead the slate planning and scheduling conversations with the Content team</li><li>Identify execution challenges in pursuit of our programming strategy (internally and externally, across content and production) and drive problem-solving in partnership with the Content team&nbsp;</li><li>Lead cross-functional coordination and alignment and drive solutions for operational challenges</li><li>Identify and provide an informed perspective on future programming opportunities to enhance our content offerings and drive the business growth&nbsp;</li></ul> Qualifications: <ul><li>10+ years of experience in a top management consulting firm, investment bank, private equity, and/or media/entertainment/tech company in a strategy/planning/analytical role. We are looking for candidates who have worked in a highly demanding environment.</li><li>Highly analytical and experienced in leading complex quantitative and qualitative analysis. Exceptional proficiency with MS Excel & PowerPoint; working knowledge of statistics and analysis packages</li><li>Strong and effective communicator with experience presenting complex analyses to executives/ senior management</li><li>Significant experience in building relationships with and influencing senior management and executive stakeholders in the areas of strategy creation, planning, and enabling execution</li><li>Experienced in building and managing high-performing teams&nbsp;</li><li>Ability to thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results, and exhibit the highest personal and professional standards of integrity and ethics. They must also be motivated, disciplined, and flexible.</li><li>Passion and familiarity with Japanese content and entertainment is a strong plus</li><li>English and Japanese language fluency are mandatory.</li></ul> Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT46519-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013469", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46519"], "team": ["Finance & Accounting"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
