{"id": 790298115461, "name": "Associate - CPS&O UK", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1721989975, "t_create": 1721779200, "ats_job_id": "JR28743", "display_job_id": "JR28743", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p><span>As Netflix continues to grow globally, we are looking for the best and brightest to drive analytics that underpins our entertainment strategy and key business decisions.</span></p><p></p><p><span>Netflix’s Content Programming Strategy &amp; Operations (CPS&amp;O) team is looking for an Associate to join its team in London. The CPS&amp;O team develops strategic insights to further the company&#39;s global entertainment efforts and is primarily responsible for deal analysis, portfolio planning, performance/audience insights, competitive analysis and external metrics. Executives and senior management depend heavily on the CPS&amp;O team to accurately measure the business performance and lead the strategic analysis that is used to inform important business decisions.</span><br /> </p><h3><b>RESPONSIBILITIES:</b><br /> </h3><p><span>A sample of work could include:</span></p><ul><li><p><span>Conducting market research, tracking and compiling industry trends in the region</span></p></li><li><p><span>Conducting analysis of key business drivers, trends and performance indicators</span></p></li><li><p><span>Advising content stakeholders on content programming strategy and individual project decisions</span></p></li><li><p><span>Regularly present analyses and reports on relevant operating metrics in an easy-to-understand format to senior business leaders</span></p></li><li><p><span>Compiling thoughtful post-mortem analyses to determine areas for optimization and improvement for our content teams</span></p></li><li><p><span>Working cross-functionally with other Content Programming Strategy teams globally as well as Product, Marketing, Consumer Insights teams</span></p></li></ul><p></p><h3><b>QUALIFICATIONS:</b></h3><ul><li><p><span>2 - 5 years of experience in a top management consulting firm, investment bank, private equity, hedge fund, and/or media/entertainment/tech company in a strategy/business development/analytical role. We are looking for candidates that have worked in a highly-demanding environment in which complex modeling and analysis is performed</span></p></li><li><p><span>Passion for entertainment and avid watcher of content</span></p></li><li><p><span>Strong communication/presentation skills with track record of presenting complex analyses to executives/senior management clearly and concisely</span></p></li><li><p><span>Extensive experience conducting quantitative and qualitative analysis</span></p></li><li><p><span>Strong initiative and ability to work independently; thrives in a fast-paced, always changing environment</span></p></li><li><p><span>Highly intellectually curious and has the courage to challenge the status quo and exhibits the highest personal and professional standards of integrity and ethics. </span></p></li><li><p><span>Excellent proficiency with MS Excel / PowerPoint and/or Google Sheets / Slides</span></p></li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28743-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298115461", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28743"], "team": ["Finance & Accounting"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
