{"id": 790298014290, "name": "Mobile Engineer 5 - Shared Client Foundations", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Engineering", "business_unit": "Streaming", "t_update": 1705881600, "t_create": 1705881600, "ats_job_id": "JR27609", "display_job_id": "JR27609", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Roles on the team provide an opportunity to explore the unique UI systems architecture challenges presented by the Netflix UI application stacks - balancing the performance constraints of the devices we support with developer-friendly solutions which scale.<br /><br />This particular role requires <b>knowledge of both iOS and Android stacks</b>. We’re looking for <b>expertise in one of them (either one)</b>, to provide technical leadership on that platform. <b>Along with competency in the other</b>. Allowing you to work on implementation across both stacks as project needs arise, while identifying opportunities for leverage across stacks.</p><p><br />We believe strong engineering aptitude transcends stacks, and the opportunity to explore other platforms is a unique aspect of this role.</p><p><br />We’re currently building solutions with Swift on iOS, Kotlin on Android, and TypeScript/JavaScript and React on TV &amp; Web. We use GraphQL as our shared data access technology.</p><p><br />We provide ergonomic solutions for UI engineers to access data, configure applications, create server-driven UIs and optimize performance. We work on client side and server side solutions - wherever a problem takes us. And that’s just scratching the surface.</p><p><br />Many of the projects we take on are broad cross-functional efforts, allowing you to extend beyond our team and engage with teams across the company. We’re a team of peers. Everyone has the opportunity to scope, architect, implement, and support the solutions we deliver.</p><p></p><p><b>The Team</b><br />The Shared Client Foundations team builds shared UI architecture and frameworks which power the Netflix TV, iOS, Android and Web applications on devices ranging from web browsers, mobile phones and tablets, to streaming sticks, cable boxes, Smart TVs and game consoles.</p><p><br />We’re passionate about creating elegantly designed, highly performant UI architectures which empower engineers to build amazing UI experiences used by millions of users across the globe. We partner closely with teams across Netflix to help us deliver solutions which make UI development efficient and enjoyable.</p><p><br />Diverse and inclusive teams are strong teams. We encourage those with varied identities, backgrounds, and experiences to apply. We believe that creating a sense of belonging allows us to be our best selves, which in turn helps us produce our best work. We rely on our unique individual strengths to help each other grow.</p><p><br />We have a distributed team, with some teammates working remotely, and some located in the Los Gatos, CA office. The team is committed to being ‘remote-inclusive’ and believe it’s about the work you do, and the relationships you build. Where you can best do that from is up to you.</p><p><br />Some of the things we’re excited to be working on currently:</p><ul><li>Building the ideal cross-platform data access architecture for Netflix applications</li><li>Creating a Server Driven UI architecture which accelerates app experimentation</li><li>Delivering frameworks to optimize feature-flag based UI development</li></ul><p><br /><b>You</b><br />People who do well on the team are self-motivated engineers with a passion for driving technology innovation rooted in business and customer needs. Great analytical and technical skills form a solid foundation. But more importantly, we look for engineers who understand that there are rarely any absolutes when it comes to technology. The ability to engage in meaningful discussions about use cases, prioritization and technical challenges with colleagues, while thoughtfully weighing trade-offs across multiple solutions is a skill we value highly.</p><p><br />All of this, so that Netflix members can immerse themselves in the stories they care about, on the devices they love, from whichever part of the world they call home. Without the technology behind it all ever getting in the way.</p><p></p><p>If this resonates with you, we’d love to talk!</p><p></p><p><b>What’s Different About Us</b></p><p><b>Scale, Impact</b></p><ul><li><b>Hundreds of Engineers: </b>You’ll be improving UI development velocity for over 100 engineers.</li><li><b>Millions of Users:</b> creating best-in-class streaming UIs used by over 100M users.</li><li><b>Thousands of Devices</b>: across a wide spectrum of devices.</li><li><b>Globally</b>: in almost every country in the world.</li></ul><p></p><p>​<b>Unique Technical Challenges</b>: We build framework solutions which are flexible enough to withstand the span of use cases introduced by rapid A/B test development, across a varied client, server and network performance landscape, all while being ergonomic to use for the engineers we support.</p><p></p><p><b>Collaboration and Communication</b>: It’s not all about the tech. We highly value the skills required to build strong relationships and collaborate effectively.</p><p></p><p><b>Freedom, Responsibility, Ownership</b>: We believe in providing engineers with the business context they need, and then giving them the freedom and responsibility to define project scope, define/debate architecture, determine trade-offs, and figure out the implementation details.</p><p></p><p><b>Our Culture</b>: Lastly, <b>but most importantly</b>, we live by our <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">values</a>.</p><p></p><p><b>What Sets You Apart</b></p><ul><li>You’re <b>passionate about</b> writing elegantly designed,<b> maintainable, performant software</b></li><li>You enjoy pushing the boundaries of what technology can do, and <b>exploring uncharted waters</b></li><li>You love the idea of your work <b>empowering other engineers</b> and strive to understand their use cases</li><li>Colleagues appreciate the <b>unique perspectives and balanced views</b> you bring to collaborations</li><li>You <b>value the opinion of others</b> when fleshing out solutions, to fill out your blind spots</li><li>You know that there is rarely a single ‘right’ solution, and are <b>thoughtful about trade-offs</b></li><li>You understand that it is <b>really about solving problems</b>. A language, framework or library choice is just a means to an end.</li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.</p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><span>here</span></a>.</span></p><p></p><p><span>Netflix is a unique culture and environment. Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><span>here</span></a>.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27609-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014290", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27609"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
