{"id": 790298012371, "name": "Data Scientist (L5) - Ads", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1706054400, "t_create": 1706054400, "ats_job_id": "AJRT30178", "display_job_id": "AJRT30178", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>In April 2022, we introduced a new, more affordable, ad-supported tier for our customers, marking a significant milestone for Netflix. Our focus is now on expanding choices for consumers and providing advertisers with a premium TV brand experience that surpasses traditional linear formats. The challenge ahead involves scaling our ad tech to maximize its impact on our business.\n\nAt Netflix, the Ads Data Science and Engineering team plays a crucial role in establishing the foundation of our ads business. Our mission encompasses conducting comprehensive analyses, developing analytic tools, and creating predictive models using machine learning, all with the overarching goal of enhancing choices and joy for our members. As a leader in this domain, you'll collaborate closely with partner teams to strategize on overarching business goals. Your team will be at the forefront of developing and implementing advanced optimization algorithms and machine learning models, driving significant enhancements to our advertising systems. With a commitment to analytical rigor, your team will evaluate ideas, dissect problems, build workflows, provide recommendations, and lead end-to-end analytics initiatives in this transformative space.\nResponsibilities <ul><li>Apply modeling and machine learning techniques to business problems at the intersection of product and data science</li><li>Autonomously identify and pursue research with significant business impact, and make compelling cases for prioritization and resource allocation</li><li>Proactively perform data exploration on engagement behaviors to discover future opportunities</li><li>Collaborate with cross-functional stakeholders from product, engineering, operations, design, consumer research, etc., to develop and deploy models at scale</li><li>Deliver well-documented datasets, tools, and reports to key technical and business partners</li><li>Identify, compute and validate the appropriate metrics to measure success in a product area</li><li>Cultivate strong partnerships with cross-functional stakeholders from product, engineering, operations, design, consumer research, etc.</li><li>Present your research and insights to all levels of the company</li></ul> The Ideal Candidate: <ul><li>Demonstrated tenacity, resilience, and leadership experience that enables you to organize and drive cross-functional projects, overcome challenges, and propose solutions.&nbsp;</li><li>Be both quantitative and qualitative. You should be able to quickly assess and understand complex systems, but also have high EQ, so that you can be a product ambassador to the rest of the organization, and our Hollywood and global partners.&nbsp;</li><li>You are a player-coach. You can develop roadmaps and strategies, but also execute on technical work and ensure that your team produces consistent high quality outputs.</li><li>Superb communication skills - You must be able to cultivate strong working relationships, communicate effectively, write meticulously, and give outstanding presentations to both technical and creative audiences.&nbsp;</li><li>Capacity and passion to translate business objectives into actionable analyses, and analytic results into business and product recommendations&nbsp;</li><li>A passion for TV and movies and defining the future of entertainment</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000. \n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT30178-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012371", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT30178"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
