{"id": 790298012662, "name": "Senior Systems Engineer - DevOps", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721964876, "t_create": 1714953600, "ats_job_id": "JR28109", "display_job_id": "JR28109", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The N-Tech Systems Engineering team at Netflix focuses on improving the employee experience, collaboration, and productivity of our global employees and support teams. As a centralized engineering team responsible for helping Netflix employees with how they work, we aim to remove friction, simplify workflows by increasing automation, and provide technical solutions so they can focus on bringing engaging stories to our members all over the world. This role will focus on engineering solutions for Active Directory, Microsoft Azure and Google Workspace products.\nKey Responsibilities: <ul><li>As a member of the N-Tech Systems Engineering team, you will be responsible for developing tools and services that support Netflix’s Active Directory infrastructure.</li><li>Implement and enforce security policies, access controls, and group memberships within Active Directory.</li><li>You will establish the technical strategy and offer insights on the deployment of Microsoft Azure & Google Workspace products and services through collaboration with stakeholders and by understanding business use cases.</li><li>You will be collaborating with cross-functional teams to design and implement solutions that meet the needs of our stakeholders and business.</li><li>You’ll help maintain and document services owned by the team to ensure our runbooks and processes stay up to date.</li><li>Participate in a weekly on-call rotation with the team, be responsible for answering operational questions during business hours, and be available during off-hours for emergency pages.</li><li>Stay up to date on the latest trends and technologies of the N-Tech Systems Engineering service portfolio.</li></ul> Qualifications: <ul><li>Systems Engineering experience supporting and operating Active Directory, Microsoft Azure, and Google Workspace in an Enterprise Environment.</li><li>Strong background in designing scalable, reliable, and efficient systems. Including understanding trade-offs in system design, design for fault tolerance and recovery, and knowledge of best practices in distributed systems.</li><li>MUST HAVE: Know one or more general-purpose programming languages including but not limited to Python, Javascript, or Go.</li><li>Working knowledge utilizing APIs for integration/ETL automation.</li><li>Ability to use well-established enterprise standards, processes, and procedures to ensure engineering projects are delivered in a timely fashion with high-quality work products.</li><li>Ability to manage and maintain AWS infrastructure to support production systems.</li><li>Understanding SDLC and project management frameworks agile, scrum and iterative.</li><li>Exposure to directory services and cloud identity providers (Okta, Google, Azure AD/Entra ID).</li><li>Well-versed in producing technical documentation that conveys the story of business impact.</li><li>Production experience utilizing CI/CD for code deployment.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28109-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012662", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28109"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
