{"id": 790298013437, "name": "Engineering Manager - Search & Voice Systems", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1705363200, "t_create": 1705363200, "ats_job_id": "AJRT43848", "display_job_id": "AJRT43848", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service, with over 270 million paid memberships in over 190 countries, enjoying TV series, documentaries, and feature films across various genres and languages. Members can watch or play as much as they want, anytime, anywhere, on any internet-connected screen. As Netflix continues to grow, we are venturing into exciting new frontiers of personalization and discovery to help our members find the content they’ll enjoy the most.\n\nThe Opportunity\nFast-paced innovation in Generative AI and large language models (LLMs) is greatly helping to advance numerous aspects of the Search and Recommendations experiences on the Netflix product, including content discovery and personalization for members. \n\nThe Search & Voice Systems team builds the backend systems that help millions of members globally find and discover content they’ll love via Search, Voice UI, and other interactive experiences in the Netflix product. The team is at the forefront of LLM innovation in the Consumer product and collaborates closely with machine learning research scientists, product managers, data engineers, and other engineering teams to deliver a personalized and interactive search experience, leveraging and paving the path for the latest advancements in LLMs. \n\nWe are looking for a seasoned engineering leader with excellent product sense to lead an amazing team of engineers as we scale for continued growth. You will develop a vision for the team and generate an engineering roadmap to deliver on multiple product and engineering initiatives. You will exemplify the Netflix leadership principles and formulate strong partnerships throughout the company to guide your team and their work. In this role, you will lead a team of engineers specializing in search technologies and distributed systems to help pave the future of Search in the Netflix product!\nResponsibilities: <ul><li>Balance multiple business and product priorities to deliver maximal impact.</li><li>Develop an engineering roadmap that positions our systems for scale and continued innovation.</li><li>Build a high-performing, inclusive, and diverse team of top engineering talent.</li><li>Build strong and trusting partnerships with Product Managers, Engineering leadership, and Business stakeholders.</li><li>Be a role model of the Netflix culture.</li><li>Contribute, shape, and influence the broader Personalization roadmap.</li><li>Support your team by helping them understand priorities and providing context to help them make better decisions.</li><li>Drive success in a flat organization with minimal process and a heavy emphasis on individual responsibility.</li><li>Understand the business and build domain expertise in functions relevant to your systems.</li></ul> Desired Experience: <ul><li>Experience leading teams responsible for building high-traffic distributed systems to power Search, Recommendations, or Personalization experiences in the product.</li><li>Strong technical acumen and can act as a credible technical advisor to the team, set and enforce a high-quality bar for code and scalable system design, and be a mentor for the team.</li><li>A track record of hiring and growing diverse, highly talented tenured engineers deep into their careers to maximize their impact.</li><li>Excellent at communicating context with the team, stakeholders, partners, and leadership, giving and receiving feedback, fostering new ideas, and empowering others without micromanagement.</li><li>Demonstrated ability to develop, drive, and execute a technical vision and roadmap.</li><li>Able to provide thought partnership to your business stakeholders and are actively sought out by Product Managers (PMs). You can take a conceptual idea and transform it into an actionable test that is both feasible and meets business needs.&nbsp;</li><li>Experience managing hybrid teams with members and partners distributed across (US) geographies & time zones.</li></ul> Links to Some of Our Work: <ul><li><a href=\"https://medium.com/@netflixtechblog/lessons-learnt-from-consolidating-ml-models-in-a-large-scale-recommendation-system-870c5ea5eb4a\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Lessons Learnt From Consolidating ML Models in a Large Scale Recommendation System</a>.</li><li><a href=\"https://netflixtechblog.com/global-languages-support-at-netflix-testing-search-queries-ede40f7d93d3\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Global Languages Support at Netflix</a>.</li><li><a href=\"https://dl.acm.org/doi/10.1145/3477495.3536330\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Query Facet Mapping and its Applications in Streaming Services: The Netflix Case Study</a>.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43848-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013437", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43848"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
