{"id": 790298013765, "name": "Manager, Photo & AV - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Public Relations", "business_unit": "Streaming", "t_update": 1721088000, "t_create": 1721088000, "ats_job_id": "AJRT46522", "display_job_id": "AJRT46522", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>The Photo &amp; Audio Visual (AV) Studio team has the enviable position of straddling two worlds in the entertainment industry: Photo &amp; AV asset creation and global communication strategy. We specialize in capturing and creating photo &amp; video assets that shape, enhance, and support our publicity campaigns for our Netflix content including Series, Films, and Documentaries. Simply put, we produce content that compels people to watch our shows through various media. At its heart, Photo &amp; Audiovisual Studio is about telling stories. The team shapes the visual identity of Netflix’s PR campaigns with creative content built from the production phase of our series and films.</p><p></p><p></p><p><br />The Role</p><p><br />The role requires creativity, a curious and innovative mindset, as well as strong project management experience. A successful candidate will be a team player with a positive attitude and willingness to be flexible to get the job done. This role strategically plans and executes multiple projects simultaneously.  In addition, fosters cross-functional partnerships across multiple departments — from publicity to marketing to product and content, as well as, external production, talent reps, photographers, videographers, and producers throughout the lifecycle of a campaign. </p><p></p><p><br /><br />This candidate must be extremely well organized, creative, a succinct communicator, and thrive in a fast-paced environment. They must be self-motivated, possess integrity, and be able to work autonomously across multiple teams. The ideal candidate will use sound judgment to make wise decisions, think strategically, and drive their colleagues to do the same.</p><p></p><p><br /><br />Responsibilities of the role include:</p><ul><li>Develop content strategies in collaboration with your cross-functional partners in publicity, marketing, social, product, and content, and align on the creative needs of the title </li><li>Leverage editorial and creative expertise to solve for business opportunities through authentic visual storytelling and compelling creatives (audio-visual and photo assets) </li><li>Be responsible for the best use of talent time during production to meet the creative needs of the campaign. Drive communication from the set to key stakeholders   </li><li>Innovate and build engaging narratives that tell the story behind the story. Conduct in-depth interviews with on-screen and off-screen talent to uncover and shape narratives that elevate the campaign</li><li>Read scripts, and plan, hire and supervise unit photographers and video crews to capture the best on-set creative. Foster partnerships within the industry </li><li>Creative produce the photography and video needs for title premieres, events and editorial photoshoots, to build impactful creatives that further the campaign messaging and encourage conversation </li></ul><p></p><p>Skills and Requirements:</p><ul><li>8&#43; years of experience as a content creator, creative producer, art director at an entertainment, lifestyle media house or outlet, or have an editorial background</li><li>Work experience in Marketing, Publicity &amp; Communications, creative agencies at an entertainment studio, tech or production company</li><li>Strong creative eye with a keen understanding of visual storytelling in the service of audience-first communication strategies</li><li>Understand and have contacts in the photography and video industries in Japan and working knowledge of digital media file specs and size formats</li><li>Interest in copyright laws, usage licenses and embargos is preferred</li><li>Extensive knowledge of Adobe Suite including Photoshop and Pro is preferred</li><li>Business-level fluency in Japanese is required and English is preferred</li></ul><div></div><div></div><div>The Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our <a href=\"https://jobs.netflix.com/culture?lang&#61;%E6%97%A5%E6%9C%AC%E8%AA%9E\" target=\"_blank\">culture memo</a> (JA)/<a href=\"https://jobs.netflix.com/culture?lang&#61;English\" target=\"_blank\">culture memo</a> (EN). If it resonates with you, maybe you’re the right person to join our team. </div><div></div><div></div><div></div><p>Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT46522-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013765", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46522"], "team": ["Public Relations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
