{"id": 790298012331, "name": "PMR Analyst", "location": "Ciudad de México, Mexico", "locations": ["Ciudad de México, Mexico"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1718064000, "t_create": 1718064000, "ats_job_id": "AJRT43366", "display_job_id": "AJRT43366", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Opportunity:\n\nFrom “Feel Good Family Adventures” to “Irreverent Comedies,” the system that powers Netflix’s multitudes of personalized row recommendations is the result of years of painstaking content analysis, intricate taxonomical work, data science, and pure movie and television geekery.\n\nIf you are an avid fan and a serious consumer of visual entertainment, the Product Metadata & Ratings team at Netflix is seeking a unique candidate who can capture the essence of films, series, and specials — and turn that into metadata and insights. This starts with digging deep into every title, researching, analyzing, tagging, rating, reviewing and understanding the nuances of the content to help connect our members to the content they’ll love. \n\nThis role will join a team of classification experts: people who can identify, collect and transform the artistic qualities of films and series into the data that powers personalization for more than 270 million people (and counting) around the world. This hire innately understands the facets, tropes, and themes that allow audiences around the world to laugh, think, escape, cry, and tell their friends, “You have to watch this.” \nThe ideal candidate: <ul><li>Has a deep and broad knowledge and experience of visual media and is passionate about global entertainment. They can succinctly and broadly communicate what’s important about a piece of content, and why. They are comfortable working in a high-volume, high-quality, deadline-and data-driven environment. They are an excellent cross-functional partner who can relay the importance of this work to colleagues beyond your team, as well as collaborate on unique projects that use tags, metadata, and content insights in new and engaging ways on service. They are flexible, adaptive and curious in an ever-evolving organizational landscape.</li></ul> Responsibilities: <ul><li>.-Analyze, tag, research, and write detailed insights for titles produced in Latin America for all content verticals, including Film, Series, Animation, and Non-Fiction.&nbsp;</li><li>Represent the slate for the entire region, collaborating with Analysts and Rating Strategists.</li><li>Build strong xfn partnerships with Product, Merchandising, Creative Services, Content, and Marketing at all levels across the business.</li><li>Build successful partnerships in-region, while operating within a dual-reporting line structure.</li><li>Possess a deep understanding of the LATAM markets, successfully able to interpret and speak to the business strategy for the region.</li><li>Collaborate on other editorial and innovation projects that require cross-functional workflows.</li><li>Have your finger on the pulse with regard to current affairs and cultural moments, while also being aware of historical, political, social and/or sensitive issues from across the region.</li><li>Represent, educate on and advocate for all of Product Metadata and Ratings.</li></ul> Qualifications: <ul><li>Prior experience in media as a writer or editor or experience as a Content Specialist, Insights Strategist, Metadata Analyst or Platform Editor.</li><li>Passionate about films and series with a deep knowledge of the UCAN entertainment industry and the global streaming landscape</li><li>Ability to distinguish nuances within different content genres and distill the essence of a film/series, including sharing findings in an objective, concise manner</li><li>Excellent communication, presentation and cross-functional skills within a highly matrixed org structure</li><li>Ability to master internal tools and systems successfully</li><li>Fluency in English and Spanish required</li><li>Fluency in Airtable, Google Sheets, or other data trackers and data management systems required</li><li>Experience working with large data catalogs is a plus</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT43366-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012331", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43366"], "team": ["Product Discovery"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
