{"id": 790298012315, "name": "Manager, Japan Product & Corporate Legal - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Legal", "business_unit": "Streaming", "t_update": 1720137600, "t_create": 1720137600, "ats_job_id": "JR28536", "display_job_id": "JR28536", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p>With more than 270 million paid subscribers around the world and growing, Netflix is dedicated to bringing the world’s content to our members everywhere. We are just getting started, and it’s an exciting time to work at Netflix and change the future of entertainment.</p><p></p><p><br /><b>THE OPPORTUNITY</b></p><p></p><p><br />As a company, we challenge industry norms by pushing one another to think creatively about complex questions. Our legal team is no exception. We think critically about the range of legal issues our business faces and act in a manner consistent with <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">our culture</a>.</p><p></p><p><br />We are looking for a talented legal professional to join our Product &amp; Corporate Legal team in Tokyo, Japan as a Manager. You will be instrumental in helping our team deliver fast and practical solutions for a wide range of legal issues. The role will be primarily focused on commercial transactional work and supporting advisory, regulatory and contentious matters in Japan. The successful candidate should be comfortable counseling business partners and making decisions that have both legal and business impacts.</p><p></p><p><br /><b>As a member of the Product &amp; Corporate Legal team you will:</b></p><ul><li>Collaborate with our business partners to find business and legal solutions that help Netflix achieve its key business objectives.</li><li>Draft, review, and negotiate commercial agreements to support Netflix’s business operations.</li><li>Build knowledge and expertise on Netflix’s products and services to help the business teams navigate and assess legal risks arising from new and existing user experiences.</li><li>Become the go-to point-of-contact for processing and resolving consumer claims and inquiries by local law enforcement and/or regulators.</li><li>Work with internal stakeholders to prepare and submit regulatory filings.</li></ul><p></p><p></p><p><b>QUALIFICATIONS</b></p><p></p><p>The ideal candidate will be intellectually curious, demonstrate initiative, be an effective cross-cultural communicator, and welcome the opportunity to be part of a fast-paced, entrepreneurial organization. In particular, we are looking for candidates who have the following:</p><ul><li>At least three years of legal experience as either a practicing attorney or a member of the legal team in a multinational company</li><li>Prior experience in a few of the following areas: advising and supporting commercial transactions, deal structuring, contract administration, privacy, and regulatory compliance. Experience in the IT-industry is a plus</li><li>Must be able to draft, review, and negotiate commercial contracts in both Japanese and English</li><li>A strong business-first mindset</li><li>Excellent interpersonal and communication skills </li><li>Ability to thrive in a fast-paced, collaborative environment</li><li>Be comfortable evaluating risk with imperfect information and have the willingness to ask questions, especially those that may be awkward and/or uncomfortable</li><li>High intellectual curiosity and strong willingness to tackle new subject matters outside one’s comfort zone and take on special projects as the need arises, even outside the original role</li><li>Someone who will be excited and inspired by the <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">Netflix culture</a></li><li>Bar qualification in one or more jurisdictions is a plus</li></ul><p>Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "JR28536-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012315", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28536"], "team": ["Legal"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
