{"id": 790298010736, "name": "Software Engineer (L5) - AV Tools & Tests", "location": "Vancouver, British Columbia, Canada", "locations": ["Vancouver, British Columbia, Canada"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721964676, "t_create": 1718496000, "ats_job_id": "AJRT44072", "display_job_id": "AJRT44072", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 240 million paid subscribers, and are expanding into new forms of entertainment such as gaming. Engineering teams within Netflix work hard every day to scale and innovate this content production and member experience in an ever-growing complex software landscape.\n\nOur TV-Media organization is focused on helping engineers around the world deploy the Netflix application quickly, with the highest levels of quality. \n\nAbout the Team:\n\nThe Audio Video (AV) Tools & Tests team focuses on developing automation tools (HW/SW) to enable device audio/video quality characterization at scale for the diverse device ecosystem. Through the use of our tools and test automation, both external partner developers and internal Netflix engineers can ensure every device delivers the best possible Netflix experience. Our team works with 3rd party manufacturers to develop platforms that enable audio/video capture over HDMI and sensors measuring playback performance.\n\nThe products created by this team are used by all the major smart TV and set-top box device manufacturers like Samsung, Sony, Google, and Amazon around the world, enabling hundreds of millions of devices worldwide with Netflix.\n\nWe are looking for a Software Engineer to drive innovation in the audio/video quality monitoring space to enable new engineering solutions for a wide spectrum of functions ranging from initial device integration with Netflix to validating new TV user experiences. In this role, you will experiment with new ideas with stunning colleagues across different domains such as gaming, audio/video technologies, and security.\n What you will/may do: <ul><li>Contribute to Audio/Video automation and measurement products that include front-end and backend services that support distributed testing platforms for our custom-built HW/SW tools such as <a href=\"https://youtu.be/Uscu0qwbc00\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Eye Patch</a></li><li>Leverage in-house data solutions to operationalize the AV data metric pipeline for insight exploration&nbsp;&nbsp;</li><li>Develop and maintain AV automated tests to objectively measure and validate device AV capabilities for the Netflix TV application (<a href=\"https://netflixtechblog.com/hdmi-scaling-netflix-certification-8e9cb3ec524f\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">HDMI - Scaling Netflix Certification</a> tells you how we approach some of these challenges)</li><li>Implement new applications from ideation to product rollout through iterative experimentation with stakeholders in an agile manner&nbsp;</li><li>Operate in a cross-functional environment where you can learn from other AV subject matter experts and drive multiple teams to achieve common quality goals</li></ul> What we are looking for: <ul><li>4+ years of experience in a software development role shipping products</li><li>Strong in Python/Javascript or C/C++&nbsp;</li><li>Fullstack experience</li><li>Ability to work closely with internal stakeholders and external vendors to understand and leverage their software framework/components/service to build solutions</li><li>An outstanding communicator who is curious, flexible, and selfless; a maker at heart</li><li>Passion for automation and system reliability</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $300,000 - $700,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44072-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010736", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44072"], "team": ["Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
