{"id": 790298014655, "name": "Software Engineer (L5) - Distributed Refactoring Platform", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1718150400, "t_create": 1718150400, "ats_job_id": "AJRT45923", "display_job_id": "AJRT45923", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nNetflix’s source code is distributed across tens of thousands of code repositories written in numerous programming languages managed by thousands of engineers. It is the job of platform teams at Netflix to build tools and services to simplify the process of building and maintaining software systems at this scale. To that end, the Distributed Refactoring Platform team is being formed to consolidate and build services and APIs to safely accelerate the rate of source code modernization and changes at Netflix. As a part of the larger Productivity Engineering organization, this team will partner closely with other platform teams at Netflix to ensure source code follows Netflix's paved path and the latest best practices.\n\nThis role is based in Warsaw and our teams work in a hybrid-working model. \nYour Day-to-Day: <ul><li>Design and build systems and services for Netflix’s Distributed Refactoring Platform using a variety of JVM languages, TypeScript and beyond.</li><li>Collaborate with Platform Language teams to build code transformations for JVM and non-JVM programming languages alike.</li><li>Drive and support cross-organization critical change campaigns across a wide-variety of source code repositories.&nbsp;</li><li>Work cross-functionally to build new services, tools and data models to operationalize our workflows at scale.</li><li>Participate in product reviews and team meetings, providing technical insight. Help scope, estimate, and prioritize between conflicting needs.</li><li>Evaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.</li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolve.</li><li>Participate in our on-call rotation and contribute to incident reviews.</li></ul> You may enjoy working with us if: <ul><li>Are self-driven and highly motivated to deliver top-tier solutions with minimal guidance. You also recognize when you're wrong, learning from your mistakes and moving past them.</li><li>You enjoy collaborating and pairing with engineers to understand what they want, figure out what they really need, and finally, what we should build.</li><li>Strive to embrace best practices and are always searching for opportunities to continually improve.</li></ul> We would love working with you if: <ul><li>You have experience with Object Oriented languages, primarily Java.</li><li>You have explored the space of refactoring tools, including Open Rewrite, Atomist, SourceGraph’s Batch Changes and even ASTs.&nbsp;</li><li>You are passionate about solving developer productivity challenges for engineers at enterprise-scale.</li><li>You are adept at designing and building API’s for customers, in particular with GraphQL.&nbsp;</li><li>You excel at working with microservice architectures.</li><li>You are experienced with relational and non-relationship data stores.&nbsp;</li></ul> \n\nOur culture is unique, and we live by our values, so it’s worth learning more about Netflix culture.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT45923-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014655", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45923"], "team": ["Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
