{"id": 790298013741, "name": "Operations Manager, Emerging Experiences", "location": "Ciudad de México, Mexico", "locations": ["Ciudad de México, Mexico"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1721989975, "t_create": 1715040000, "ats_job_id": "AJRT45543", "display_job_id": "AJRT45543", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p><b>About the Team: </b></p><p></p><p>The Scaled Launch Operations team forms part of the backbone of Netflix&#39;s Film, Series, Games, and Live event launches. Our Project Managers, Coordinators, and Program Managers collaborate with many internal and external partners, local teams, and subject matter experts within Netflix to set up and scale new workstreams and experiences on the Netflix Product.</p><p></p><p>We are part of a border Operations team that serves other parts of our Product, Discovery, and Promotion organization. Underpinning all we do is a core focus on quality (protecting the member experience is the heartbeat of our team) and driving scale for the business in finding smart opportunities to optimize how we deliver our work. <br /><br /><b>Role Overview: </b></p><p></p><p>We’re looking for a strong Operations Manager of Emerging Experiences to join our leadership team. This role will spearhead the development and overseeing of the latest functions in our Mexico City hub, focusing on games and live events.</p><p></p><p>Additionally, you will support the incubation of new workstreams within our hub. The ideal candidate will have a proven track record of building and leading high-performing operational teams and designing effective workflows to meet the demands of our evolving business.</p><p></p><p>You will report to the Director of Scaled Launch Operations.<br /><br /><b>Key Responsibilities:</b></p><ul><li><p><b>Leadership and Development</b>: Lead and develop our Live and Games operations team in Mexico City. Resource planning is a critical part of the role.</p></li><li><p><b>Execution and Strategy:</b> Drive the day-to-day execution of developed strategies, ensuring successful launches of new Games and Live events within your team&#39;s domain.</p></li><li><p><b>Representation:</b> You will be the point person in Mexico City for UCAN-based Live and Games Leadership and teams. Represent our team in Games and Live forums with a solid operational voice.</p></li><li><p><b>Coaching and talent density:</b> Provide mentorship and development opportunities for team members, fostering a culture of excellence, high performance, and continuous improvement. You are responsible for maintaining a dream team.</p></li><li><p><b>Collaboration: </b>Partner with Mumbai-based peers and cross-functional teams, including Live and Games leadership based in UCAN, to drive project success and integrate new experiences into our broader hub capabilities.</p></li></ul><p></p><p><b>Expectations:</b></p><ul><li><p>Align team priorities with the broader mission and vision of the Ops organization.</p></li><li><p>Deliver timely, high-quality results within your team&#39;s sphere of impact.</p></li><li><p>Engage with peers and key stakeholders to navigate critical decisions thoughtfully and promptly.</p></li><li><p>Coach individual contributors on decision-making processes, ensuring appropriate context is absorbed and cascaded.</p></li><li><p>Make solid and data-informed decisions without falling into analysis paralysis. Take thoughtful risks.</p></li><li><p>Stay involved in the day-to-day operations to fully understand your team&#39;s activities.</p></li></ul><p></p><p><b>Requirements:</b></p><ul><li><p>Games &amp;/or Live Operations experience would be ideal; however, we’re open to different backgrounds. </p></li><li><p>Proven leadership experience with a focus on developing talent (8&#43; years)</p></li><li><p>Excellent, precise, and proactive global communication skills.</p></li><li><p>Passion for meeting the needs of cross-functional teams involved in Games and Live events.</p></li><li><p>Comfort with ambiguity and ability to drive projects to completion with clarity and excellence.</p></li><li><p>Significant experience in Project/Program Management.</p></li><li><p>Strong relationship-building and proactive risk management skills.</p></li><li><p>Experience with driving successful large-scale projects/initiatives </p></li></ul><p></p><p><span>Netflix is a unique culture and environment. Learn more<span> </span></span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a><span>.</span><span> </span></p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT45543-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013741", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45543"], "team": ["Engineering Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
