{"id": 790298014101, "name": "Senior Researcher - Content", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Consumer Insights", "business_unit": "Streaming", "t_update": 1715558400, "t_create": 1715558400, "ats_job_id": "AJRT45440", "display_job_id": "AJRT45440", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Los Angeles, California\n\nLike our members, we love entertainment and are big believers in the power of the consumer's voice when creating best-in-class content for the world to see. \n\nAs the Content Consumer Insights team, we work closely with business partners to inspire creative decisions by providing rich insights into genres, content opportunities, audiences, and evolving content tastes. We strive to understand viewers’ underlying needs, motivations, and emotions so Netflix can create TV shows and movies that will excite members around the world. \n\nThis Senior Researcher role focuses on generating content insights at scale, spanning across all content types and genres. Specifically, this role will focus on leading our global content tracking initiative where we gain critical insight into our members’ reactions to our titles (e.g. what they loved, what could be better, what they want to see more of in the future, etc.), providing valuable feedback to our Creative teams. This is an exciting opportunity to lead an innovative research program that covers hundreds of new Netflix title releases a year. This role is for someone who is excited about integrating consumer research, data science, and analytics to deliver an impact on Netflix's global content strategy!\n\nWhat you will do: <ul><li>Lead Netflix’s content tracking initiative and other large-scale quantitative research, overseeing the strategic applications as well as the project execution, data analysis, reporting, and adoption of the insights throughout the organization</li><li>Identify forward-looking business opportunities and develop, prioritize, and execute on a high-impact research roadmap</li><li>Leverage large-scale data sets to conduct deep dive analyses, develop validated survey metrics, integrate and uncover relationships across multiple data sources (e.g. survey & behavioral data), and surface new patterns & insights across genres and formats that teach us about members’ content needs</li><li>Establish research best practices and integrate innovative & emerging methodologies to help improve the efficiency, reliability, and future scalability of the content-tracking initiative</li><li>Socialize your research and findings throughout the company, making your insights memorable and actionable</li><li>Serve as a partner and trusted consultant to cross-functional teams and other Consumer Insights researchers in areas including Content, Data Science, Finance & Strategy, Marketing, and Product</li></ul> About You: <ul><li>Extensive quantitative research experience (~7+ years designing and executing research end-to-end)</li><li>Experience designing and managing large-scale, global tracking studies; extensive experience with various survey methodologies, research best practices, and advanced data techniques (e.g., Max Diff, Conjoint, segmentations, statistical analysis, etc.)</li><li>Strong data analysis skills; comfort working with large data sets and collaborating with data scientists and analytics engineers. Experience with R, SPSS, SQL, or Tableau preferred</li><li>An analytical mindset; you love digging into data for hidden connections and patterns and know how to balance analytical rigor with pragmatism and actionability</li><li>A phenomenal communicator; strong storytelling skills with experience turning data into actionable insights and socializing across different departments (from content/creative to data scientist to high-level executive)</li><li>An excellent collaborator; able to build strong relationships both within your team and with business partners</li><li>Independent thinker who likes taking initiative and approaches problem-solving with a creative mindset; you focus on long-term solutions and making an impact at scale</li><li>Comfortable with ambiguity and thinking through multiple perspectives; stays grounded in the face of change</li><li>A master of prioritization and time management - both the big picture and in terms of your own time</li><li>Advanced degree in research, social sciences, statistics, economics, or related field preferred but not required</li><li>A passionate fan of entertainment!</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $130,000 - $470,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45440-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014101", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45440"], "team": ["Consumer Insights"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
