{"id": 790298013501, "name": "Product Metadata and Ratings, Manager (UCAN and LATAM)", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1716768000, "t_create": 1716768000, "ats_job_id": "JR28280", "display_job_id": "JR28280", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Since the days of DVDs in envelopes, our content analysts and ratings strategists have brought context to content, analyzing and tagging titles on service to help match titles to members, and to help them make the right choices for them and their families. Now as Netflix explores a broader world of entertainment – expanding into Games, Live, Ads and more –  we are looking for a leader to take the Content Analysis and Ratings teams in the US, Canada, and Latin America to their next act: more metadata, more local, more impact.\n \nAs a leader in the Product Metadata and Ratings group, you’ll be responsible for leading the Content Analysis team covering some of our key markets, a team that captures the local nuances of a global catalog; for creating and managing relationships at all levels of the company – including Content and Product – in a complex matrixed environment; for driving innovation in the ways we think about content and member needs; for transforming workflows as we take advantage of ML and AI – and doing it all at the scale and quality our users and cross-functional partners demand. You will also work closely with the Ratings Policy team in-region, ensuring an effective collaborative relationship between Content Analysis and Ratings Policy, providing insights from key cross functional stakeholders in UCAN, and communicating ratings sensitivities to local partners.\nYou will: <ul><li>Lead a team of content analysts working on titles produced in the US and Canada organized by vertical categories: Series, Film and Animation, and Non-Fiction (including Live). You will also be responsible for a smaller slate of content produced in Latin America.&nbsp;</li><li>Be accountable for how we classify, rate and review content and assets in a way that supports existing and new use-cases across the Netflix business.</li><li>Be accountable for your teams maintaining performance standards, achieving key results and setting up the appropriate recurring review processes to ensure they are on track in a fast-paced operationally critical environment.</li><li>Manage day-to-day partnerships across the business in the region, creating and facilitating working relationships across Merchandising, Product, Content, vertical leadership teams, and Ratings. You will work with leadership at all levels across the business and must fluidly communicate between organizations.</li><li>Represent the wider Product Metadata & Ratings department in the region – working with Series, Film and Animation, and Non-Fiction&nbsp; leadership on strategy and team management. You will also represent Product Metadata and Ratings with local LATAM partners.&nbsp;</li><li>Serve as an escalation point of contact in-region for issues related to metadata application and ratings.</li><li>Ensure obstacles to launching and supporting key projects are addressed for your team. You will elevate opportunities and challenges with solutions to improve efficient and effective output, as needed.</li><li>Be responsible for the development and growth of Content Analysts.</li><li>Travel as required.</li></ul> Qualifications: <ul><li>5+ years of experience in a field encompassing any of product metadata, audience engagement, content classification and curation, content insights, content strategy and management, or similar.</li><li>Experience managing or leading teams in high-scale product and/or content organizations.</li><li>Deep understanding of consumer behaviors and discovery habits with entertainment, understands how those intersect with content catalog and services.</li><li>Should have experience with globally distributed, matrixed, and remote-first teams.</li><li>Strategic, analytical thinker with a strong customer-focused mindset and empathy.</li><li>Strong judgment and decisiveness when dealing with timely, deadline-driven, content-related issues and concerns.</li><li>Excellent written (memos and presentations) and verbal communication skills; timely communication.</li><li>Highly motivated self-starter with the ability to work independently and drive alignment amid ambiguity.</li><li>Ability to build strong relationships with stakeholders and effectively influence and contribute with concrete recommendations/next steps, across both regional and global teams.</li><li>Comfortable applying a combination of qualitative and quantitative methods to define success.</li><li>Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000-$400,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28280-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013501", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28280"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
