{"id": 790298010726, "name": "Analytics Engineer (L5) - Content & Studio - EMEA", "location": "Amsterdam, North Holland, Netherlands", "locations": ["Amsterdam, North Holland, Netherlands"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1716768000, "t_create": 1716768000, "ats_job_id": "AJRT45934", "display_job_id": "AJRT45934", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Content & Media ML Foundations team, within Data Science and Engineering, is responsible for foundational R&D initiatives shaping the future of content production and promotion on a global scale. Using rich multi-modal data (text, video, audio, images), we build ML models and capabilities such as customized generative algorithms and multi-modal embeddings that enable unique content understanding. These initiatives lead to the development of high leverage capabilities and drive significant impact across Netflix. We also partner closely with platform teams to ensure that ML models and other data-driven solutions can be scaled effectively across Netflix.\n\nWe are looking for our first Amsterdam-based Analytics Engineer to join the team. In this role, you will own and deliver insights that directly inform our ML strategy across model performance, improvements and new applications across Netflix. Specifically, you will collaborate with ML practitioners to develop tooling that provides insights into model performance, enabling a deeper understanding of model behavior and informing both improvement roadmaps and the creation of analytical products with modeling outputs. You will also partner closely with platform teams to offer analytical support on foundational systems such as the Netflix media platform and the Netflix scripts ecosystem to enable better decision-making and drive operational efficiency.\n What You Will Do <ul><li>Amplify impact of ML models through Analytics: Drive insights across our ML ecosystem that shape long-term execution roadmaps against our strategy. Where appropriate, design and develop tools & dashboards that enable “unblackboxifying” of complex ML models, broadening the surface area of their impact.</li><li>Stakeholder Analytics: Partner with business teams to identify critical analytical problems, applying an entrepreneurial mindset to find innovative solutions using data.</li><li>Metric Design: Spearhead the creation of new metrics to inform decision-making and improve operational efficiency.</li><li>Regional Expertise: Become an expert on all things related to our Data Science & Engineering efforts, helping educate and connect regional offices to existing and new data solutions.</li></ul> You Are… <ul><li>Able to develop and deepen strong relationships with a wide variety of stakeholders and have a proven track record of influencing strategic decisions through data.</li><li>Able to thrive with minimal oversight and process, connecting the dots across business needs and independently driving projects forward.</li><li>Proven experience with ML models and an understanding of modern ML algorithms, enabling effective collaboration with ML researchers and engineers.</li><li>A senior analytics professional with extensive experience in data wrangling, analysis, reporting, and visualization.</li><li>An expert in data-oriented programming languages, including Python and SQL, and intuitive dashboard/visualization design (e.g Tableau). Proficient in ETL processes and data warehousing best practices.</li><li>Experienced at working across different cultures on a globally-distributed team, with core working hours in the Central European and GMT time zones.</li></ul> Culture\nYou will have the opportunity to impact the business in a meaningful way, working alongside smart people who love to solve hard problems, and who not only expect but also foster high performance. You will have the freedom to innovate, solve interesting problems, and influence decision-making in a fast-paced, exciting environment. You can learn more about our culture at jobs.netflix.com/culture.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT45934-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010726", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45934"], "team": ["Data Science & Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
