{"id": 790298014048, "name": "Engineering Manager (Poland)", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1715644800, "t_create": 1715644800, "ats_job_id": "AJRT45123", "display_job_id": "AJRT45123", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nContent Infrastructure & Solutions (CIS) empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. We do that by providing scalable and resilient infrastructure to address integrated large-scale media, assets, data, workflow, and communication use cases. Examples of this organization’s work include massive-scale media processing platforms (1, 2), workflows (conductor), and data processing at scale.\n\nThe Content MiddleWare Infrastructure team(MWI), a part of the Content Infrastructure & Solutions group, provides Studio and Content Engineering specific, highly leveraged, and fully managed data, workflow, and messaging & communication platforms facilitating the goal of the Connected Studio. To learn more about what the MWI team does, check out the following tech blogs: workflow (1, 2), search (1, 2, 3), data movement (1, 2).\n\nThe Media Infrastructure Platform team (MIP) is part of a media-focused engineering group that provides highly available infrastructure for content production and processing, storage, and access, across all Netflix productions and licensed content. Infrastructure pieces like massive-scale media processing platforms (1, 2), and media storage infrastructure (1, 2)  are key systems we build. All of this is custom-built on top of Amazon Web Services (AWS) infrastructure.\nWe are hiring managers in PL to build and lead either of the following teams: <ul><li><b>MWI Data Search Team: </b>This team will own Graph Search (<a href=\"https://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-5c0c1c7d7eaf\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">1</a>, <a href=\"https://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-part-2-49348511c06c\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">2</a>, <a href=\"https://netflixtechblog.com/reverse-searching-netflixs-federated-graph-222ac5d23576\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">3</a>), a Search-as-a-Service platform, within the MWI Data team. Graph Search streamlines search functions across various entities and workflows, notably in the Content Engineering domains but not limited to them. It offers a unified user experience encompassing both backend services and reusable front-end components. Graph Search is currently leveraged by around 70 applications and serves thousands of end users. This team may also contribute to the other infrastructure such as Ontology, SDSP, EARS, and RAW Hollow by collaborating with the rest of the MWI Data term in the US.&nbsp;</li><li><b>MIP Media Infra and Operational Tooling Team: </b>&nbsp;This team will 1) develop key portions of our media processing and media storage infrastructure in close collaboration with the broader Media Infrastructure Platform team, and 2) own the development of operational tooling for the broader Content Infrastructure and Solutions organization.&nbsp; You’ll have the unique opportunity to work both on developer-facing tooling as well as high scale distributed systems in the deep and interesting domain of media processing at Netflix scale and to uplift Netflix’s operational tooling. In particular, we want to evolve our operational tooling to make contemporary concepts like SLO management a first-class concept. While there has been some prior exploration in the operational tooling space, there is significant freedom to evolve this area from its current early state into a mature and thriving </li></ul> What you will do <ul><li>You will lead a team of software engineers to deliver high-impact results, your responsibilities in this role:</li><li>Partner with the product manager, engineers, and other engineering managers in the broader team to deliver the vision, strategy, and adoption of platform solutions across content and studio engineering, and ensure that we’re building the right features to power other engineering teams to effectively design and build search solutions at scale.</li><li>Collaborate closely with the rest of the MWI Data or MIP team in the US, drive the alignment of roadmaps for Search and other data infrastructure products (such as Ontology, Search, EARS, and RAW Hollow) or Cosmos, and ensure that we offer a cohesive and streamlined experience to our stakeholders across all the products MWI or MIP owns.&nbsp;</li><li>Foster a strong accountability culture in the team and help the team deliver the results reliably and in a timely manner to support the needs of critical business stakeholders.</li><li>Act as a credible technical advisor to the team; help the team make thoughtful, informed decisions in ambiguous situations</li><li>Form trust cross-functional relationships with partners and stakeholders in PL and US within Netflix, connect the dots and drive adoption to maximize the business impact, ensure our solutions meet their needs, and selflessly prioritize work beyond the scope of your own domain.</li><li>Effectively communicate complex ideas and influence decisions across a diverse range of stakeholders.</li><li>Balance business needs with strong engineering principles, ensure investment in foundational technical work, paying off tech debts and incremental improvements to deliver timely results.</li><li>Lead, coach, hire, and develop a team of outstanding engineers, challenge them to bring their best selves to their daily work, and deliver exceptional results in stability, performance, efficiency as well as developer experience.</li><li>Build and nurture an inclusive team culture where every member feels empowered, accepted, and respected.</li></ul> What we are looking for <ul><li>Experience in building and managing high-performing teams with a focus on inclusion and diversity. Ability to attract and retain the best talent, and ensure that all voices are heard to inform our decisions while fostering a strong culture of accountability, where individuals take ownership of their responsibilities and contribute to the team’s collective success.</li><li>Ability to foster a team culture of open and direct communications, where team members feel empowered to offer constructive and positive feedback and acknowledge achievements and areas for improvement.</li><li>Experience building and operating extremely reliable platform systems supporting large-scale and critical use cases, including running 24x7 on-call, highly available, and fast response services.</li><li>Long-term strategic thinker with a strong platform mindset, and ability to define and articulate product vision and strategy and how they fit into the broader objectives of the organization.</li><li>Ability to prioritize strategically and align the team’s work with larger business goals. Have the courage to pivot based on broader impacts.</li><li>Ability to build and maintain strong partnerships with cross-functional partners and stakeholders with excellent communication and collaboration skills. Capable of influencing the strategic direction of partners and stakeholders.</li><li>Proven track record helping a team deliver timely results on critical priorities against many demands for their time, and partnering with product and engineering management to influence the right areas for investment</li><li>Bring rigor to decision-making and drive down ambiguity with the right mix of collecting data, seeking input, farming for dissent, and making pilot investments to build understanding or confirm direction.</li><li>Experience driving teams to adopt specific KPIs/leading indicators of system health, observing and tuning the systems to prevent predictable outages.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT45123-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014048", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45123"], "team": ["Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
