{"id": 790298012364, "name": "Executive Producer, External Games", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Games", "business_unit": "Streaming", "t_update": 1715558400, "t_create": 1715558400, "ats_job_id": "AJRT27281", "display_job_id": "AJRT27281", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is revolutionizing entertainment. We connect people with movies and television globally by delivering outstanding content and technological innovation. \n\nThis is your chance to be at the forefront of Netflix’s new video game offering. We will bring these new experiences to market through the world's leading streaming entertainment app with 231 million paid memberships in over 190 countries who are already enjoying TV series, documentaries, and feature films across a wide variety of genres and languages.\nMembers can watch as much as they want, anytime, anywhere, and now they can download and play mobile games anytime, anywhere with a collection of Netflix curated and produced Games. \n\nNetflix is looking for an experienced Executive Producer to join the External Games team. This role will report to the Production Director, leading the execution of our big bet games across the External Games portfolio. This role interacts with External games leadership, Producers, Business Development, Product Manager and Creative Leads across External Games, as well as cross-functional partners to ensure our games are tracking to the highest possible quality. \n\nThe candidate will have a proven track record of releasing Must Play games, working across complex partnerships with publishers, developers, and IP owners, as well as deep experience across multiple platforms.  \nResponsibilities: <ul><li>This role will focus on our big bets from a production perspective, ensuring our highest priority, most impactful games are tracking well across quality, development, and member value</li><li>Define, develop, and refine the overall production strategy for our larger, more complex titles, including platforms, pipelines, and processes to ensure that Producers have everything they need to serve players, developers, and partners.</li><li>Identify and lead additional strategic initiatives to ensure our team and developers have the goals, frameworks, and priority they need to be successful during&nbsp; development</li><li>Assist the Production Director in budget management of games in the development&nbsp;</li><li>Partner with business development and creative teams to ensure we are making the right decisions for our developers and members</li><li>Manage a team of producers, supporting them in their role as our external developer’s primary point of contact during development&nbsp;</li><li>Mentor, manage, and lead multiple producers, creating growth and opportunities for their success while maintaining a balanced production capacity.</li><li>Help resolve unique, complex product issues through ingenuity, creativity, and any other means necessary to get the job done. Identify risks early and often and remove roadblocks and performance bottlenecks as needed.&nbsp;</li><li>Develop strong relationships with internal and 1st party studios to establish and maintain a flow of information so we are aligned on frameworks, games, opportunities, and priorities&nbsp;</li><li>Work cross-functionally to create a healthy team culture based on rich communication, transparency, and shared context.</li></ul> Qualifications: <ul><li>Previous Executive Producer or Production Director experience in game development and publishing</li><li>6+ years of management experience, including managing direct reports with varying levels of production experience</li><li>12+ years experience in game production with experience shipping multiple games (console, PC, Mobile)&nbsp;</li><li>Experience in strategic planning and execution through the development on large complex project</li><li>You have robust experience overseeing the full lifecycle of game development with a specific focus on mult-platform releases&nbsp;</li><li>An excellent knowledge of licensing and IP complexities, understanding the difficulties generally encountered by teams and solutions tailored to their requirements.&nbsp;</li><li>Experience leading complex cross-functional projects with successful delivery of quality and schedule and in balancing scope, capacity, budget, risk, and time.&nbsp;</li><li>Ability to influence direction, without relying on positional authority</li><li>You have an uncanny knack for arriving at solutions through unconventional methods and developing a plan to put them into action</li><li>You have excellent communication and are able to work with a variety of people, effectively communicating everything from data to creative feedback</li><li>Passion for video games, innovations in software, and how they enrich the player's experience.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $610,000\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT27281-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012364", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT27281"], "team": ["Games"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
