{"id": 790298020581, "name": "Distributed Systems Engineer (L5) - Data Platform", "location": null, "locations": [], "hot": 0, "department": "Engineering", "business_unit": "Unknown", "t_update": 1721963039, "t_create": 1721433600, "ats_job_id": "JR28718", "display_job_id": "JR28718", "type": "ATS", "job_description": "<p style=\"text-align:left\">Netflix is one of the world&#39;s leading entertainment services with over 247 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>The data platform teams at Netflix enable us to leverage data to bring joy to our members in many different ways. We provide centralized data platforms and tools for various business functions at Netflix, so they can utilize our data to make critical data-driven decisions. We do all the heavy lifting to make it easy for our business partners to work with data efficiently, securely, and responsibly. We aspire to lead the industry standard in building a world-class data infrastructure, as Netflix leads the way to be the most popular and pervasive destination for global internet entertainment.<br /><br />We are looking for Distributed Systems Engineers to help evolve and innovate our infrastructure. We are committed to building a diverse and inclusive team to bring new perspectives as we solve the next set of challenges. In addition, we are open to remote candidates. We value what you can do, from anywhere in the U.S.<br /><br /><br />Spotlight on Data Platform Teams:<br /><br />Data Platform Infrastructure |Learn More<br /><br />The Data Platform Infrastructure team acts as a platform for our own data platforms. Our shared infrastructure and tooling enable Netflix to innovate quickly in providing state-of-the-art data and analytics systems to the rest of the company without building bespoke scaffolding for each new system. To do this, we create high-leverage infrastructure, control, and deployment systems that are fine-tuned for running our data systems at scale.<br /><br />The team plays an essential role in making it easy and efficient to use the Netflix platform and security products for building the data platform; uniquely, many of our tools and systems are written in Python, so this is a great team to consider if you enjoy working in a variety of languages.<br /><br />Big Data Warehouse and Iceberg | Learn More<br /><br />The Big Data Warehouse and Iceberg team is responsible for Netflix&#39;s exabyte-scale data warehouse, building and operationalizing foundational services to manage the lifecycle of core tables critical for all analytical, reporting, and data decision needs. These services enable query engines to discover tables/datasets, provide secure access to data, and efficiently store data in S3 using Iceberg table format. Additionally, the team works on efficiencies of compute, storage, and network costs, and optimality of data storage, and ensures that the data meets Netflix&#39;s standards and compliance requirements. The team is also committed to developing new features and enhancements to the Iceberg table format (which began in Netflix and is now an industry standard) and contributing to the open source.<br /><br />Online Datastores - Caching, Relational &amp; Search | Learn More</p><p></p><p><span>Online Data Stores organization offers managed data stores at scale to meet Netflix’s operational data requirements across all lines of business. These data stores cover various types, including Caching, Relational, Search, Key-Value, and Composite abstractions. Our focus is on developing and maintaining high-performance, reliable, and efficient data stores. Additionally, we enhance developer productivity by providing secure, intuitive, and opinionated access layers.</span></p><p><span>This particular team focuses on datastores and abstractions related to caching including EVCache (memcached), Redis, Hollow, and relational stores including RDS, Aurora, CockroachDB, and search stores including Opensearch and GenAI storage related to Retrieval Augmented Generation.</span></p><p><br /><br />This would be your dream job if you enjoy:</p><ul><li><p>Solving real business needs at a large scale by applying your software engineering and analytical problem-solving skills.</p></li><li><p>Architecting and building a robust, scalable, and highly available distributed infrastructure.</p></li><li><p>Leading cross-functional initiatives and collaborating with engineers, product managers, and TPM across teams.</p></li><li><p>Sharing our experiences with the open source communities and contributing to Netflix OSS.</p></li></ul><p></p><p><br />About you:</p><p></p><ul><li><p>7&#43; years experience in crafting complex, scalable distributed data infrastructure</p></li><li><p>Proficiency in Java, C&#43;&#43;, Golang, or Python with a solid understanding of multi-threading and memory management</p></li><li><p>Proven track record of developing and maintaining high-impact systems</p></li><li><p>Experience building and operating scalable, fault-tolerant, distributed systems</p></li><li><p>You have a BS in Computer Science or a related field</p></li><li><p>Familiarity with library development, DI frameworks (preferably SpringBoot), and container technologies</p></li></ul><p></p><p><br />A few more things about us:<br /><br />As a team, we come from many different countries and our fields of education range from the humanities to engineering to computer science. Our team includes product managers, program managers, designers, full-stack developers, distributed systems engineers, and data scientists. Folks have the opportunity to wear different hats, should they choose to. We strongly believe this diversity has helped us build an inclusive and empathetic environment and look forward to adding your perspective to the mix!<br /><br />At Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job family, background, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location.<br /><br />The overall market range for roles in this area of Netflix is typically $100,000 - $700,000<br /><br />This market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy. Our culture is unique, and we tend to live by our values, so it’s worth learning more about Netflix here.</p><p></p>", "id_locale": "JR28718-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298020581", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28718"], "team": ["Engineering"], "posting_date": [], "work_type": []}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
