{"id": 790298011437, "name": "Events Senior Manager - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Events / Hospitality", "business_unit": "Streaming", "t_update": 1709510400, "t_create": 1709510400, "ats_job_id": "AJRT43041", "display_job_id": "AJRT43041", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix aspires to provide great entertainment for people everywhere from the world's best creators across movies, TV series, documentaries, comedy and more. Our members have control over what they watch, when and where. It's an amazing time to join the Netflix team as we continue to transform entertainment. If you are a talented public relations executive with a passion for content and entertainment, keep reading!\n\nAbout the Role \n\nWe are looking to hire a Senior Manager for Events in Japan who will spearhead a team that is responsible for the development and delivery of world-class innovative events from in-person to virtual and everything in between. From external-facing events to internal employee-facing events; you should be able to blend strategic thinking with execution at scale. You should not be afraid to push the envelope and bring new ideas to the table, as well as experiment with the latest tools and technologies to elevate our events into unique-to-Netflix  experiences. You will have amazing attention to detail, the ability to see the big picture and clearly articulate your vision to internal and external stakeholders, as well as the ability to partner seamlessly, and execute flawlessly across APAC for local and global titles. \n\nReporting to the Director of Events for APAC, the role combines project management with strategic thinking, execution and the smart use of resources for maximum impact. You will need to have strong cross-functional relationships to create, shape, execute and manage events for Netflix content. The successful candidate will be curious about campaign promotional efforts - paying attention to creativity, concept, quality, and time constraints - and will seek to add value and improve campaigns with new and innovative event ideas. \n\nYou will be able to fulfill the roles and responsibilities of a senior leader, including helping your team navigate ambiguity by providing high-level context while enabling team members to make sound judgment calls. You will look to provide impact through scale but also be able to provide support on event executions. \n\nYou will seek to up-level the team and are unafraid to take smart risks. You are self-reflective and sunshine what you could have done better, sharing your learnings to up-level the whole team.\n\nThe successful candidate will be an experienced people manager, looking to grow and develop talent. You will be an inclusive leader and cultural ambassador, embodying and promoting our company values every day, and actively helping others do the same. \nThe work: <ul><li>Oversee the Japan event strategy for the short and long term, in line with business needs</li><li>Function as a strategic thought partner within Events & Screenings to Publicity, Photo & AV Studio, Awards, Comms, Marketing and Content</li><li>Lead cross-functional as well as cross-regional debate and collaboration</li><li>Foster cross-functional partnerships and take strategic approaches to achieve high impact events and campaign goals</li><li>Lead ongoing roles & responsibilities discussions, grow, nurture and develop the group and manage expectations setting and discussions for their team</li><li>Provide mentorship to less tenured team members across the Events & Screenings team to support their work and ideation</li><li>Forecast budgets based on title prioritization and oversee team budget</li><li>Oversee title staffing and day to day team management</li><li>Creative conceptualization, crafting of creative proposals and quotations</li><li>Resourceful strategic thinker and creative problem solver</li><li>Ability to pivot quickly and maintain a positive attitude and sense of humor</li><li>Produce creative and well-executed experiences that are consumer-centric and unique to Netflix</li><li>Adaptable to hybrid or virtual events, with knowledge of what it takes online and off, including the latest tools, platforms and technologies to bring our vision to life</li><li>External vendor and agency management and supervision</li><li>Provide team with strategic direction on sourcing of venues, vendors, entertainment and event related requirements</li><li>Superior project, budget and time management skills, within tight deadlines</li></ul><div><br></div> The candidate must: <ul><li>12+ yrs of events experience preferably from the entertainment industry that includes managing, executing, planning and staffing events at an agency, studio, network or with a brand (experience in film or television awards campaigns is a bonus)&nbsp;</li><li>Experience as a people manager</li><li>A self starter who is able to work independently, and under pressure, while consistently exercising sound judgment even when faced with ambiguity&nbsp;</li><li>Resourceful strategic thinker and creative problem solver</li><li>Ability to pivot quickly and maintain a positive attitude and sense of humor</li><li>Articulate what is and is not required to deliver a successful campaign</li><li>Be transparent and unafraid to challenge, ask questions or call out obstacles</li><li>Agile with meticulous attention to details</li><li>Excellent organizational skills and ability to roll up your sleeves to get things done</li><li>Excellent communication in Japanese and English fluency is a plus&nbsp;</li></ul><div><br></div><div><br></div><div>The Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture memo</a> . If it resonates with you, maybe you’re the right person to join our team.&nbsp;</div> If you have a passion for entertainment and a desire to work in a fast-paced, innovative environment, we would love to hear from you. Come join us and help us entertain the world!\n\nNetflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT43041-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298011437", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43041"], "team": ["Events / Hospitality"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
