{"id": 790298014043, "name": "Software Engineer (L5), Client Delivery Platform", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719187200, "t_create": 1719187200, "ats_job_id": "JR27631", "display_job_id": "JR27631", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is a global internet video streaming service with over 235 million members worldwide. Our members enjoy more than one billion hours of streamed video per week, on thousands of different types of devices. Building, testing, deploying and validating changes across all these experiences is a large and complex process. Come join us in building rich observability into our platform to help us ship Netflix faster and more reliably.\n\nWhat sets us apart:We are building a platform that pushes confidence in a change closer and closer to the moment of development. This journey began with a deep investment in real-time metrics and analysis of production changes by leveraging A/B Canaries. We are now early in the early stages of building comprehensive observability into every aspect of the software development lifecycle. Our goal is to simplify the process of releasing high quality software at scale, allowing engineers to focus entirely on their features.\nWhat you will do: <ul><li>Investigate, design and build a CI/CD Observability platform that allows our engineers to visualize, track, validate and interact with code changes at all stages of the software development lifecycle. </li><li>Effectively collaborate and communicate with internal partner teams on their developer experience opportunities and challenges.</li><li>Instrument and measure all aspects of the software development lifecycle to surface the highest impact opportunities for innovation.</li></ul> What sets you apart: <ul><li>7+ years of relevant full-stack software development experience.&nbsp;</li><li>Expertise developing data rich frontend user experiences.</li><li>Expertise developing restful, graphQL or gRPC services.</li><li>Experience developing internal, operational tooling.</li><li>Experience with data visualization, reporting, metrics and instrumentation.</li><li>Design & programming skills in Javascript/Typescript or another object-oriented programming language.</li><li>Exposure to Spinnaker, Jenkins, Github Actions or other CI/CD platforms.</li></ul> Nice to have skills: <ul><li>Experience with visualization libraries like <a href=\"http://d3.js\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">d3.js</a></li><li>Experience with stream processing platforms like Flink or Kafka.</li><li>Experience in Data engineering.</li><li>Experience with data lakes and time series data stores.</li><li>Experience with custom CI/CD platforms.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,00 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27631-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014043", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27631"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
