{"id": 790298014137, "name": "Engineering Manager, User & Access Management Engineering", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1715126400, "t_create": 1715126400, "ats_job_id": "AJRT45372", "display_job_id": "AJRT45372", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>At Netflix, we want to entertain the world and are constantly innovating how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 270 million paid subscribers, and are expanding into new forms of entertainment such as gaming. Producing content globally, at this scale is a unique challenge; this is where our organization comes in. \n\nStudio Production Engineering (SPE) plays a pivotal role in Netflix's content creation and delivery journey. The seamless magic of your favorite show starting with a click is the result of thousands of intricate processes and workflows behind the scenes that are enabled by our tools. We empower Netflix studios to bring creative excellence to life - develop tools to achieve operational excellence and economies of scale. Our solutions aim to elevate the ROI of the $15 billion dollars spent on content creation through cost/time efficiency, and data-driven decision-making.\n\nUser & Access Management Engineering, part of SPE, manages experiences, platforms, backend services and data facilitating the goal of seamless user onboarding and managing access to Netflix Content and Studio ecosystem. We are seeking a talented Engineering Manager to lead our dynamic team of local and remote engineers and drive the development and innovation of our complex infrastructure while improving the overall security posture.\nAs an Engineering Manager you will: <ul><li> Provide technical vision and strategy for building platforms that scale for the growing needs of Content & Studio.</li><li>Build strong relationships and work closely with various cross-functional partners including product, engineering, design, data science, security team and stakeholders across time zones.</li><li>Support your team by helping them understand priorities, drive down ambiguity bringing focus, provide context and empower them to bring their best and create impact.</li><li>Participate in architecture decisions for technology innovation and be a thought partner/sounding board for your team, stakeholders, and partners.</li><li>Coach and lead a dream team of UI, backend, and full-stack engineers to execute a shared vision between engineering, product and security partners.</li><li>Be an exemplar of the Netflix <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a></li></ul> About You: <ul><li>You are an inclusive leader with a proven track record of building and leading high-performing diverse teams.</li><li>You have an extensive background and strong technical expertise working in backend infrastructure and platforms, and understand how to build for complexity, scale and business impact.</li><li>You have a solid knowledge of distributed systems architectures and understanding of the whole web stack: front-end, back-end, databases, and integrations.</li><li>You are well versed in technical principles like cloud engineering, operational excellence, and balancing performance, efficiency, and reliability</li><li>You have a proven track record of taking innovative projects from concept to production.</li><li>You are inherently curious and enjoy leading through challenges. You balance short-term needs along with long-term vision.&nbsp;</li><li>You are a proactive, effective communicator with great judgment and a bias towards action.</li><li>You are a role model for integrity, transparency and courage.</li><li>You enjoy enabling your team to work on hard problems with tech, but what really drives you is creating levers for making a big impact</li><li>You have at least 2 years experience with hiring, leading engineering teams staffed with a range of experienced engineers and coaching through personal and professional growth.</li></ul> Bonus Experience if: <ul><li>You have application security domain experience - awareness of AuthN and<b> AuthZ </b>constructs.</li><li>You have a background working with Security Engineering or IAM foundational principles.</li></ul> To learn more about Content Engineering, feel free to listen to this video.\n\nOur team includes people of all genders, varied sexual orientations, parents, folks who are self-taught, and people of a wide variety of nationalities, ages, and socio-economic backgrounds. Diverse teams are strong teams, and we encourage those with varied identities and experiences to apply.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45372-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014137", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45372"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
