{"id": 790298013095, "name": "Enablement Manager - Engineering Support", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1719878400, "t_create": 1719878400, "ats_job_id": "JR28325", "display_job_id": "JR28325", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p><b>About the Engineering Support Organization</b><br />The aim of the Engineering Support Organization is to enable Infrastructure Engineering to effectively and sustainably scale the support they provide to their customers. The team is the frontline resource for the engineering support needs of our customers (i.e., our workforce) - handling, troubleshooting, and resolving customer requests and issues. In addition, the team will focus on ways of working, customer advocacy, support tooling, platform product offerings, documentation, and developer education. <br /><br /><b>Our Mission </b><br />Deliver an excellent support experience to Netflix’s developer community. To advocate for our customers, follow through on issues and resolve them in a reasonable time. If blockers prevent immediate resolution, we communicate status and ensure there is visibility into why there is a delay. <br /><br />Provide insights, feedback and champion customer sentiment about the tools we support to our partners across Productivity and Data Platform Engineering. Partner with Product Management, Developer Education and Engineering to track and maintain visibility into ongoing issues and communicate customer needs to ensure improving in these areas is prioritized.<br /><br />Drive collaboration efforts to reduce product friction and increase usability so that Infrastructure Engineering can build, deploy and deliver highly functional solutions for the Developer Community.<br /><br /><b>The Role </b><br />We are looking for an Enablement Manager with a passion for Productivity Engineering (think Java,Spring Boot, Gradle, Github, Continuous Integration/Continuous Delivery (CI/CD) ) and Data Platform infrastructure and tooling (think Big Data Technologies and Streaming Platform), customer service, and automation. <br /><br />You will be responsible to build, scale, and grow a team of outstanding Technical Support Engineers who will be responsible for monitoring and handling our customers’ requests, troubleshooting, solving issues, automating support needs, developing support documentation and runbooks, improving and maintaining support tools and automation, understanding our product offerings, and continuously looking for ways to improve the engineering support experience for both our UCAN and Poland Engineering teams.<br /><br />Since this role supports both UCAN and local Poland teams, the required working hours are 12pm to 8pm local time.</p><p></p><p><br /><b>What you will do:</b></p><ul><li><p>In your pivotal role as an Enablement Manager for the Developer Enablement team, you will define and implement the team&#39;s strategy, setting and achieving clear, organization-aligned goals. Your efforts will be key to ensuring the smooth operation of our engineering functions and fostering a culture of technical excellence that empowers our engineers to deliver unparalleled solutions.</p></li><li><p>Make strategic decisions to ensure support resources scale effectively with company growth.</p></li><li><p>Create workflows to ensure continuous feedback between engineering support and developer education, improving documentation and training based on customer pain points.</p></li><li><p>Develop workflows to facilitate effective collaboration between teams spanning across countries and time zones, particularly between UCAN and Poland teams.</p></li><li><p>Drive the use of generative AI to improve efficiency, automate ticket resolutions, reduce response times, and enhance user satisfaction.</p></li><li><p>Operate and evaluate support systems like Slack and Zendesk. Explore additional systems to enhance support for engineering teams and the organization.</p></li><li><p>Schedule sessions for collaborative problem-solving to address support and documentation issues, fostering team cohesion.</p></li><li><p>Establish strong relationships with Engineering Managers to understand challenges and provide meaningful support and solutions.</p></li><li><p>Advocate for the paved road approach, promoting standardized tools and procedures to enhance productivity and reliability.</p></li><li><p>Establish and monitor key metrics to assess support efficiency and effectiveness. Report data-driven insights for continuous improvement.</p></li><li><p>Organize training sessions and &#34;brown-bag&#34; meetings to cross-train and share knowledge. Maintain team proficiency with new tools and products.</p></li><li><p>Cultivate a proactive culture, encouraging team members to address &#39;low-hanging fruit&#39; tasks, enhancing problem-solving skills.</p></li><li><p>Instill innovation, collaboration, open communication, and technical excellence in all team activities.</p></li></ul><p></p><p></p><p><b>What we are looking for:</b></p><ul><li><p>An experienced engineering support leader who can drive a team of amazing support engineers to do their best work while building and maintaining strong partnerships with peers and stakeholders</p></li><li><p>Ability to dive deep as needed to facilitate technical strategy trade-offs and zoom out to understand the big picture to shape the support landscape</p></li><li><p>Experience building and running mature support infrastructure which enables fast response times, reduction in total time to resolution and effectively tracking the timeline of tickets from start to finish.</p></li><li><p>Bring rigor to decision making and drive down ambiguity with the right mix of collecting data, seeking input, farming for dissent, and making pilot investments to build understanding or confirm direction</p></li><li><p>Proven track record helping a team deliver timely results on critical priorities against many demands for their time, and partnering with product and engineering management to influence the right areas for investment</p></li><li><p>Experience building and leading engineering teams with a focus on inclusion and diversity, ensuring that we can attract and retain the best talent from anywhere and that all voices are heard to inform our direction</p></li><li><p>Experience in Big Data Analytics, Streaming and Productivity Engineering technologies would be a bonus.</p></li></ul><p></p><p></p><p><b>A few more things about us:</b><br />As a team, we come from many different backgrounds and countries, and our fields of education range from the humanities to engineering to computer science and we strive to give people the opportunity to wear different hats, should they choose to. We strongly believe this diversity and agility has helped us build an inclusive and empathetic environment, and we are looking forward to adding your perspective to the mix!<br /> </p><p></p><p><span>Netflix is a unique culture and environment. Learn more<span> </span></span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28325-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013095", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28325"], "team": ["Engineering Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
