{"id": 790298013355, "name": "Technical Program Manager 5  - Messaging", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1718582400, "t_create": 1718582400, "ats_job_id": "AJRT45560", "display_job_id": "AJRT45560", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>The Messaging Engineering organization at Netflix crafts and delivers dynamic multi-channel messaging to supercharge acquisition, retention, and engagement. We own the cutting-edge infrastructure and tools that enable us to connect with over 220 million users worldwide, sending an impressive 100 billion messages annually. Our focus on experimentation and A/B testing fuels innovation across Email, Push notifications, and in-app messages. We also champion enterprise messaging needs, ensuring seamless internal communications. By leveraging scalable capabilities, we deliver timely, personalized messages that drive Netflix’s strategic priorities, from Streaming and Live events to Games, Ads, and Content Production. In essence, we are the voice of Netflix to the customer.</p><p></p><p><br />We are looking for a Technical Program Manager who is passionate about delivery, enjoys cutting through ambiguity to achieve clarity, and is a strong communicator at all levels of the organization. You will work with a cross-functional group of platform engineers, testers, and distributed systems engineers to lead the evolution of Netflix Messaging across all our devices.</p><p></p><p><br />Primary responsibilities:</p><p></p><ul><li>Collaborate with various organizational departments to drive the execution of Messaging initiatives across Netflix.</li><li>Stakeholder management across engineering teams, to executive stakeholders between technical and non-technical roles</li><li>Leverage the insights and experience from this work to influence the improvement of underlying technologies, architectures, and operations.</li><li>Apply strong technical, organizational, and communication skills to devise sound technical approaches to abstract goals.</li><li>Identify the systems involved to build new solutions, align roadmaps, and weigh relative priorities.</li><li>Establish an overall plan for numerous teams to evolve the playback ecosystem</li><li>Identifying and mitigating technical risks.</li><li>You are a strong communicator with exceptional listening skills. You can operate independently, challenge the status quo, and always play for the larger team.</li></ul><p></p><p></p><p>What sets you apart?</p><p></p><ul><li>A passion for driving toward clarity and simplicity.</li><li>Always thinking about the quality of experience implications of the team’s work.</li><li>You are a thought partner to your platform and backend stakeholders.</li><li>You balance competing concerns and make tough calls on where to cut scope vs. invest more, and how to make resourcing trade-offs across different domains.</li><li>As comfortable speaking technically as non-technically and able to bridge between the two.</li><li>8&#43; years of experience in product management, technical program management, software engineering, or leading software development projects.</li></ul><p></p><p></p><p>Desired Technical Skills</p><ul><li>Systems design, and architecture experience.</li><li>Ability to identify gaps in solutions, debate technical approaches, and see various perspectives.</li><li>Able to provide insights into business, product, and technology tradeoffs.</li><li>Great at adapting solutions to meet short and longer-term needs.</li><li>Expertise in low-latency streaming, hardware, and infrastructure.</li></ul><p></p><p></p><p>Desired Project Management Skills</p><ul><li>Can devise and apply various approaches to the execution of complex initiatives.</li><li>Coordination across many independent tracks of work and organizations.</li><li>Risk identification and mitigation.</li><li>Can balance strategic and tactical efforts to make tough calls and communicate the decision framework.</li><li>Detail-oriented, can identify what’s missing in planning and execution of software development, testing, and launch.</li></ul><p></p><p></p><p><span>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is </span>$100,000 - $720,000<span>.</span></p><p></p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits </span><a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><u>here</u></a><span>.</span></p><p><br /> </p><p><span>Netflix is a unique culture and environment. Learn more </span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><u>here</u></a><span>. </span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45560-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013355", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45560"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
