{"id": 790298011520, "name": "Consumer Products, Merchandise Strategy and Development Lead", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Consumer Products", "business_unit": "Streaming", "t_update": 1721991738, "t_create": 1717545600, "ats_job_id": "JR27793", "display_job_id": "JR27793", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching, as much as they want, anytime, anywhere, and can change their plans at any time.\n\nWe are pursuing consumer products because we believe it will drive meaningful show awareness/buzz with more tangible, curated ways to interact with our most popular content and in effect, drive long-term value. We want merchandise, interactive games, and experiences to help promote our titles and build them into title brands, or franchises, so they become part of the zeitgeist for longer periods of time.\n\nThat’s where you come in. The Merchandise Strategy & Development team provides the overall vision and global strategy for how our fans will experience and engage with our titles via merchandise. Focus on upstream planning and developing additional business opportunities – including ownable moments, white space, etc. – for our partners and our fans.\n Essential Responsibilities <ul><li>Develop actionable plans that maximize business potential for our key set of CP titles in EMEA with a focus on growth, e.g. bringing in new audiences, unlocking new categories or major partnerships</li><li>Ensure clear prioritization of efforts and resources across title priorities and partners to maximize title’s merchandise impact for EMEA, including driving trade-off discussions.</li><li>Communicate and collaborate cross-functionally to drive alignment and potential amplification.</li><li>Ideate meaningful merchandisable moments (e.g. unique themes, digital/social strategies)&nbsp; for our title priorities to generate business with clear business rationale, consumer proposition, actionable insights/thought-starters, etc.&nbsp;</li><li>Develop strategic partner-facing material to deliver the clearest business proposition and drive the most impactful narratives. Provide ongoing guidance, thought partnership (Tier 1 pitches, retail buyer meetings), and recommendations to regional stakeholders and ensure alignment across highest priorities.</li><li>Partner with EMEA CP team, Finance & Strategy, content, and marketing to identify titles with CP potential.</li><li>Thought-partner to EMEA CP from a title brand / talent management perspective. Ensuring partner selection and creative execution of CP programs align with broader title brand DNA and talent expectations.</li><li>Manage alignment communications cross-functionally across EMEA CP team and in-region internal stakeholders</li><li>Work with CP marketing to integrate our products into broader title campaigns led by MSD title lead & cross-functional teams</li></ul> Basic Qualifications <ul><li>10+ years of experience in brand management, brand/mktg strategy and/or franchise development (pan-EMEA preferred)</li><li>Experience in consumer products (incl. licensing and retail)</li><li>Entrepreneurial mindset. Experience in consulting or agency capacity&nbsp;</li><li>Has a track record of building brands, marketing campaigns and/or franchises that connect consumers to brands and create a passionate following</li><li>Experienced in a pan-EMEA role. Deep understanding of market-specific nuances.</li><li>Ability to analyze multiple data inputs and formulate strategies and recommendations&nbsp;</li><li>A cross-functional leader who is able to engage, listen and collaborate with internal departments/teams to align early on in terms of overall strategy and goals</li><li>Is an effective collaborator in a fast paced, multifaceted environment. We typically have multiple launch campaigns happening at once.&nbsp;</li><li>Experience and appropriate discretion working with Content teams and Talent</li><li>Analytical, uses trends and insights to inform decisions & approach</li></ul> Desired Skills <ul><li>Strong passion for entertainment properties, with knowledge of the competitive landscape</li><li>Has a track record of building and commercializing brands</li><li>Ability to analyze multiple data inputs and formulate strategies and recommendations&nbsp;</li><li>A cross-functional leader who is able to engage, listen and collaborate with internal departments/teams to align early on in terms of overall strategy and goals</li><li>Is an effective collaborator in a fast paced, multifaceted environment. We typically have multiple launch campaigns happening at once.&nbsp;</li><li>Experience and appropriate discretion working with Content teams and Talent</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR27793-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298011520", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27793"], "team": ["Consumer Products"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
