{"id": 790298010728, "name": "Marketing Partnership Manager, SEA & TW+", "location": "Bangkok, Thailand", "locations": ["Bangkok, Thailand"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1718323200, "t_create": 1718323200, "ats_job_id": "JR28498", "display_job_id": "JR28498", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>It's an amazing time to join Netflix as we continue to bring exciting content to over 270M paid memberships worldwide. Our ability to extend our reach and grow new audiences through partnerships is critical to the company's future success, and we are looking for a talented individual to join our Marketing Partnerships team in Southeast Asia, Taiwan, and Hong Kong.\n\nMarketing Partnerships sits at the intersection of commerce and creativity, working with a wide range of partners from telco operators to big consumer brands. You will lead the efforts to unlock new partnerships, as well as growing existing ones with the ultimate goal of driving business impact for Netflix in critical markets. A passion for technology and content is a must in addition to a keen understanding of how partner technologies fit into member’s lives and how they are likely to evolve over time. \n\nYou are expected to develop effective marketing strategies and execute content marketing campaigns while cultivating deep relationships with partners. Ultimately, you must own the full life cycle of partner marketing projects, from idea to execution to post-analysis.\n\nThe role is based in Bangkok and will report to the Head of Marketing Partnerships, Southeast Asia & Taiwan Hong Kong. You will occasionally travel to meet with partners.\n Responsibilities: <ul><li>Support the Head of MP to create and execute Marketing Partnership strategies that align with the business objectives across key markets</li><li>Work with internal stakeholders and Telco operators&nbsp; to identify business growth opportunities, and develop effective marketing strategies and tactics to achieve business objectives for Netflix</li><li>Lead and own partner marketing campaigns from ideation to execution</li><li>Identify, connect with, and pitch consumer brands that can help enhance our Marketing strategy in the respective markets, and bring title brands to life through brand partnerships</li><li>Develop a long-term relationship and marketing strategies with our distribution partners’ Marketing teams to drive incremental business growth for both.</li></ul> Experience and Qualifications: <ul><li>8+ years experience in a consumer marketing role with a reputable brand or agency</li><li>Must have experience in leading and executing large-scale integrated marketing campaigns, and have working knowledge of media strategy and planning</li><li>Demonstrated strong business acumen and ability to analyze and apply data to business strategy and goals.</li><li>Proven record of strong negotiation skills with an ability to develop rapport and translate established partner relationships to programs that impact the business.</li><li>Demonstrated creativity, entrepreneurship, and ability to pivot plans when necessary</li><li>Exemplary communication and interpersonal skills, strong capabilities in managing external and internal stakeholders from different disciplines such as business development, creativity, strategy, and analysis.</li><li>Ability to navigate different cultures and business customs with comfort and ease</li><li>Ability to manage multiple time-sensitive projects simultaneously without the support of a large team, working both independently and in close collaboration with a wide variety of stakeholders, mainly remotely.</li><li>Strong cross-team collaboration skills and ability to promote innovation through a creative collaboration process that transforms different inputs into one actionable output.&nbsp;</li><li>A desire to thrive in our unique <a href=\"https://jobs.netflix.com/life-at-netflix\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a>.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28498-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010728", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28498"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
