{"id": 790298115661, "name": "Software Engineer (L4/L5), Content Infrastructure & Solutions", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering", "business_unit": "Unknown", "job_description": "Content Infrastructure &amp; Solutions (CIS) empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. We do that by providing scalable and resilient infrastructure to address integrated large-scale media, assets, data, workflow, and communication use cases. Examples of this organization’s work include massive-scale media processing platforms (<a href=\"http://netflixtechblog.com/simplifying-media-innovation-at-netflix-with-archer-3f8cbb0e2bcb\" target=\"_blank\">1</a>, <a href=\"http://netflixtechblog.com/high-quality-video-encoding-at-scale-d159db052746\" target=\"_blank\">2</a>), workflows (<a href=\"http://github.com/Netflix/conductor\" target=\"_blank\">conductor</a>), and data processing at scale. </span></p><p><br /><span>The Content MiddleWare Infrastructure team(MWI), a part of the Content Infrastructure &amp; Solutions group, provides Studio and Content Engineering specific, highly leveraged, and fully managed data, workflow, and messaging &amp; communication platforms facilitating the goal of the Connected Studio. To learn more about what the MWI team does,The Media Infrastructure Platform team (MIP) is part of a media-focused engineering group that provides highly available infrastructure for content production and processing, storage, and access, across all Netflix productions and licensed content. Infrastructure pieces like massive-scale media processing platforms (<a href=\"http://netflixtechblog.com/simplifying-media-innovation-at-netflix-with-archer-3f8cbb0e2bcb\" target=\"_blank\">1</a>, <a href=\"http://netflixtechblog.com/high-quality-video-encoding-at-scale-d159db052746\" target=\"_blank\">2</a>), and media storage infrastructure (<a href=\"http://netflixtechblog.medium.com/netflixs-media-landscape-evolution-from-3-2-1-to-cloud-storage-optimization-77e9a19171ed\" target=\"_blank\">1</a>, <a href=\"http://netflixtechblog.medium.com/navigating-the-netflix-data-deluge-the-imperative-of-effective-data-management-e39af70f81f7\" target=\"_blank\">2</a>)  are key systems we build. All of this is custom-built on top of Amazon Web Services (AWS) infrastructure.</span></p><p><br /><span>We are hiring engineers in Warsaw on both of the following teams:</span><br /><span><b>MWI Data Search Team: </b>This team will own Graph Search (<a href=\"http://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-5c0c1c7d7eaf\" target=\"_blank\">1</a>, <a href=\"http://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-part-2-49348511c06c\" target=\"_blank\">2</a>, <a href=\"http://netflixtechblog.com/reverse-searching-netflixs-federated-graph-222ac5d23576\" target=\"_blank\">3</a>), a Search-as-a-Service platform, within the MWI Data team. Graph Search streamlines search functions across various entities and workflows, notably in the Content Engineering domains but not limited to them. It offers a unified user experience encompassing both backend services and reusable front-end components. Graph Search is currently leveraged by around 70 applications and serves thousands of end users. This team may also contribute to the other infrastructure such as Ontology, SDSP, EARS, and RAW Hollow by collaborating with the rest of the MWI Data term in the US. </span></p><p><br /><span><b>MIP Media Infra and Operational Tooling Team:  </b>This team will 1) develop key portions of our media processing and media storage infrastructure in collaboration with the broader Media Infrastructure Platform team, and 2) own the development of operational tooling for the broader Content Infrastructure and Solutions organization.  You’ll have the unique opportunity to work both on developer-facing tooling as well as high scale distributed systems in the deep and interesting domain of media processing and storage at Netflix scale and to uplift Netflix’s operational tooling. In particular, we want to evolve our operational tooling to make contemporary concepts like SLO management a first-class concept, improve our infrastructure observability and offer self-service tooling for engineers at Netflix. While there has been some prior exploration in the operational tooling space, there is significant freedom to evolve this area from its current early state into a mature and thriving capability.</span></p><h2><br /><b><span>We are looking for</span></b><br /><b><span>In General</span></b></h2><p><span>You are self-motivated and can work independently, while also being able to partner closely with other engineers on a project. You are passionate about building quality products and want to own development end-to-end, leading with the right architecture, and following sound engineering principles to deliver maintainable, performant and highly developer-friendly experience. You are a problem solver and like to challenge yourself, but you are not afraid to reach out when you need help and enjoy helping other engineers.</span></p><p><br /><b><span>Preferred Qualifications</span></b><br /><span>Even if you feel that you don’t feel that you fully meet these preferred qualifications, if you’re interested in the area or have had some exposure, we’d encourage you to reach out. </span></p><p><br /><span><u>Experience working full stack</u> - Some engineers are stronger on the frontend others are stronger on the backend, but you’re not afraid to work full stack. We typically use Java on the backend and Typescript/React &#43; GraphQL on the frontend, but we understand that good engineers can work in many different languages and frameworks.</span></p><p><br /><span><u>Experience operating a production system to a high degree of operational excellence</u> - For both teams, this is a critical skill set. Graph Search is a critical service for engineering, and must be highly reliable. To effectively build operational tooling, you should know what it’s like to operate a service yourself. Likewise, the reliability of operational tooling needs to be incredibly high since these are tools that other engineers rely on to tell them if something is going wrong and to troubleshoot issues.</span></p><p><br /><span><u>Experience building platforms, tooling or infrastructure for other engineers</u> - Building services and tooling for other engineers to consume is a bit different than building line of business applications or standard microservices. A strong platform and infrastructure mindset, long term thinking, and the ability to understand what other engineers need will set you up for success in this role.</span></p><p><br /><span><u>You have a passion for clean, well-tested performant code</u> - This means you are dedicated to writing code that is not only functional but also maintainable and efficient. You understand the importance of comprehensive testing to ensure reliability and prevent future issues. You strive for optimal performance in your code, focusing on speed and resource efficiency. Your commitment to these principles helps create robust and scalable systems that other engineers can depend on and build upon with confidence.</span></p><p><br /><b><span>Nice to have</span></b></p><ul><li><p><span>MWI Data Search Team:</span></p></li><li><p><span>Experience in building scalable and reliable search or data infrastructure for use by engineering stakeholders.</span></p></li><li><p><span>Experience with Elasticsearch, in creating efficient indexing strategies, crafting complex queries, and implementing advanced features such as search suggestions, facets for filtering, and ranking algorithms to enhance search relevance and user experience.</span></p></li><li><p><span>Experience building UI components that other teams can embed</span></p></li><li><p><span>Deep GraphQL experience</span></p></li></ul><ul><li><p><span>MIP Media Infrastructure and Operational Tooling Team:</span></p></li><li><p><span>Experience with storage or media processing domains.</span></p></li><li><p><span>Experience working with SLOs, SREs, and contemporary observability platforms. Even better if you have experience building an observability solution.</span></p></li><li><p><span>Experience developing build tooling or delivery automation</span></p></li><li><p><span>You’ve advocated for reliability and operational excellence in other roles</span></p></li><li><p><span>Experience building self-service infrastructure tooling (eg to provision new infrastructure or to manage access to infrastructure)</span></p></li></ul><p><span> </span></p><p><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>","canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298115661"}
