{"id": 790298012556, "name": "Software Engineer 4 - UI", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1716249600, "t_create": 1716249600, "ats_job_id": "JR28291", "display_job_id": "JR28291", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Content Engineering builds the products and services used by our internal and external partners to create, launch, and promote our global content. Our products enable the entire workflow of content production, from pitch to play, and provide innovative new ways to develop and manage entertainment at scale.\n\nYou'll have a direct impact on how the Netflix studio creates and promotes shows, such as “Bridgerton”, “Wednesday”, and “Stranger Things” on a global scale. With an increasing slate of original content being produced every year, our products manage billions of dollars worth of content-spend.\n\nWe need your help to build the technologies that allow us to scale our efforts across the globe, and do so effectively and efficiently!\n\nYour Day-to-Day <ul><li>Work cross-functionally to build new services, tools and data models to operationalize our workflows at scale.</li><li>Participate in product reviews and team meetings, providing technical insight. Help scope, estimate, and prioritize between conflicting needs.</li><li>Evaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.</li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolves.</li><li>Participate in our on-call rotation and contribute to incident reviews.</li></ul> You may enjoy working with us if you: <ul><li>Are curious about product experiences and motivated to understand how our work impacts our users.</li><li>Love brainstorming with fellow Backend and UI engineers, product designers, product managers, and directly with our users, to understand what they want, figure out what they really need, and finally, what we should build.</li><li>Can deliver top-tier solutions with minimal guidance. You also recognize when you're wrong, learning from your mistakes and moving past them.</li><li>Are selfless and willing to flex across the stack or into a new domain to help a teammate when needed, never thinking “that’s someone else’s job”.</li></ul> We would love to work with you if you: <ul><li>Are adept at building client side applications using technologies like HTML5, JavaScript, React, TypeScript, NodeJS, and GraphQL.</li><li>Are passionate about building intuitive user interfaces in close partnership with UX Designers.</li><li>Have in-depth knowledge of web performance and accessibility.</li><li>Have hands-on experience with deployment in a cloud environment.</li><li>Have a strong sense of independence, bias towards action, and inclination for collaboration. We live by our values, learn more about our unique culture <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. </li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28291-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012556", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28291"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": []}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
