{"id": 790298014286, "name": "Technical Program Manager 5 - Growth Commerce Platform Engineering", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1719360000, "t_create": 1719360000, "ats_job_id": "AJRT46227", "display_job_id": "AJRT46227", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p><span>Netflix is the world&#39;s leading streaming entertainment service with over 260 million paid memberships in over 190 countries, enjoying TV series, documentaries, and feature films across various genres and languages. Members can watch as much as they want, anytime, anywhere, on any Internet-connected screen. Members can play, pause, and resume watching, all without commercials or commitments. Recently, Netflix has expanded its entertainment offering to include Live content, like The Roast of Tom Brady Comedy Special, the SAG Awards ceremony, and The Netflix Slam tennis match. Our scope will grow to include premium live entertainment with partners like WWE and the NFL in 2025. Join us as we push the boundaries of scale, performance, resilience, and user experience to drive the future of Live Streaming.</span></p><p></p><p><b><b>The Team:</b></b></p><p>Netflix&#39;s Growth Commerce Platform builds and operates the massively scaled, highly available, resilient, and accurate tier-0 commerce systems that collect and manage 99% of Netflix’s Revenue across  270 million&#43; consumers. These data and compute-intensive backend systems are Netflix&#39;s financial backbone. This role will work closely with Engineering and Product teams to ensure the smooth execution of engineering-led initiatives to build commerce capabilities and resilience of commerce services.  We are looking for an experienced Technical Program Manager who can partner closely with engineering managers, engineers, product managers, Data Science teams, and other technical program managers to execute critical, complex, and ambitious technical deliverables. If you’re looking for a technical and highly dynamic opportunity that will shape the future of Netflix Commerce, we’d love to talk to you!</p><p><br /><b>What you will do:</b></p><ul><li>Spearhead cross-functional initiatives to increase the resilience of tier-0 commerce flows.</li><li>Lead Execution for highly cross-functional initiatives along with engineering Leads to accomplish highly ambitious goals to evolve commerce at Netflix.</li><li>Define repeatable templates and practices for execution and communication across the Commerce Platform and beyond.</li><li>Aggregate and track overall engineering risks in delivery to prioritize, and resolve them.</li><li>Manage cross-functional dependencies, risks, and changes across engineering-led initiatives, such as new capabilities, system migrations, and initiatives that touch multiple teams within the Commerce Platform and Consumer Engineering.</li></ul><p></p><p><b>What we are looking for // Skills:</b></p><ul><li>Understanding of challenges in<b> </b>high-scale distributed systems, architectures, and data layers.</li><li>Ability to communicate and partner successfully with deeply technical backend engineers.</li><li>Experience in identifying tradeoffs, surfacing needs for clarity, and driving decision-making.</li><li>Highly skilled in orchestrating programs with many moving parts—people, needs, and technologies.</li><li>Excellent written communication skills and ability to present technical content to non-technical audiences including clear articulations of business impact and technical constraints tailored to the audience.</li><li>The data-driven mindset in decision-making. </li><li>A natural inclination to structure and plan, balanced by the ability to pivot with unknowns.</li><li>Attention to detail and ability to represent engineering concerns.</li></ul><p></p><p><b>What we are looking for // Qualifications:</b></p><ul><li>Background in CS or related Engineering.</li><li>4&#43; years of experience driving large-scale SW projects in addition to 4&#43;  years of experience as a backend engineer building or testing stateful systems.</li><li>Domain knowledge of Commerce domain pertaining to subscriptions, payments, partnerships, billing.</li><li>Experience managing complex deliverables across cross-functional teams towards fast paced, agile releases.</li><li>Self-starter who enjoys tackling 0 to 1 problem spaces and quickly bringing clarity and direction.</li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.</p><p><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.</p><p></p><p><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46227-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014286", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46227"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
