{"id": 790298012354, "name": "Manager, Business Security Partners", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1719360000, "t_create": 1719360000, "ats_job_id": "JR27960", "display_job_id": "JR27960", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The Opportunity:\n\nWe are seeking an experienced Information Security Manager to lead and mature our team of highly skilled Business Security Partners (BSPs). This team bridges the gap between our security organization and business units (ads, games, studio, finance, legal, etc.), ensuring that security initiatives align and support the execution of business objectives. Through our partnerships, we ensure that security policies, projects, and controls are effectively implemented across the business. This role operates within very ambiguous boundaries and an ideal candidate would have experience in executing with and within sometimes loosely-defined environments. \n\nWe are looking for a leader who has managed teams with a global impact and understands the business and security implications of doing so. We are looking to find a new colleague who will be a strategic thinker, have strong stakeholder management abilities, advocate for their team, communicate clearly, and possess a deep understanding of security and business operations (preferably entertainment business).\n\nThis role is remote - and our teams operate within a hybrid model. There are opportunities to come into the office if you are local to the Los Angeles, Los Gatos, or New York City area.\nKey Responsibilities: <ul><li><b>Leadership and Advocacy: </b>Lead, mentor, and advocate for a team of Senior BSPs, ensuring a balance of autonomy and support needed to effectively engage with business unit leaders. Have the ability to work through uncertainty and develop trust within the team, stakeholders and the business.&nbsp;&nbsp;</li><li><b>Strategic Alignment:</b> Be a confidant to the team and the business. Demonstrated ability to align and, in some cases, influence business stakeholders on making appropriate security investments. Have the ability to bring the business to security and security to the business. We are interested in the different approaches you and the team will take in synthesizing strategy, providing and receiving feedback, and using these signals to influence Netflix Security Leadership and other stakeholders.</li><li><b>Communication: </b>Demonstrate effective communication (written and verbal) between the BSP team, external stakeholders, and Netflix Security leadership. Experience in understanding how and in what ways to communicate across individuals contributors to executives.&nbsp;</li><li><b>Operational Excellence:</b> Develop mechanisms and workflows around accountability. Institute and implement accountability within the team and socialize support within the business and security leadership. Help the team and the business understand the BSP value proposition, therefore securing buy-in, support, or influencing outcomes. Leverage data (qualitative and quantitative) in internal team management and external stakeholder management.</li><li><b>Feedback and Growth:</b> Have the ability to provide direct and timely feedback to team members, partners and leadership. Demonstrated ability to coach and grow talent to drive change and influence within the business. Develop and maintain strong signals and indicators about our business and security stakeholders, approaching this with honesty and transparency.&nbsp;</li></ul> About You: <ul><li><b>Inclusive Leadership:</b> You have a proven track record of building, cultivating, and leading high-performing diverse teams. You are curious about how we work, why we work and look for ways to create the optimal environment for the team. You partner and maintain strong relationships with security, business, and product colleagues. You have experience managing teams and understand the nuances of operating and serving a business in different regions globally.</li><li><b>Strategic and Tactical Balance:</b> You balance strategic initiatives with tactical execution and set this context for the team and stakeholders.&nbsp;</li><li><b>Effective Communicator:</b> You are a proactive and effective communicator with a bias toward decisive action. You can distill complex information and provide clear context to your team, stakeholders, and senior leadership.</li><li><b>Self-Aware and Adaptable:</b> You thrive in an environment of ambiguity and are able to adapt&nbsp;your approach based on the unique needs of the Netflix culture and security landscape. You are transparent and honest in knowing your limitations and opportunities for growth.</li><li><b>Collaboration & Partnership: </b>The ability to work through uncertainty and develop trust and alignment within your team, stakeholders, and the business.</li><li><b>Technical Depth and Vision: </b>Broad knowledge of Information Security (GRC, Enterprise Security, Product Security, Cloud Security, etc.) and can leverage your domain experiences to address the needs of our stakeholders when compared to our security investments and initiatives. You will set a clear vision and strategy built not only on your domain knowledge but assessing current needs and future outcomes</li><li><b>Data-Driven Mindset:</b> Use data to influence decision-making and bring visibility and clarity to security initiatives.</li><li><b>Mature Leadership & Partnership: </b>Thoughtful, candid, and strong interpersonal skills. Ability to lead and mentor a diverse team and build trust across the organization. A strong partner for business and engineering leaders, demonstrating effective verbal communication across a diverse set of stakeholders.</li></ul> Compensation:\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27960-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012354", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27960"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
