{"id": 790298129221, "name": "Security Software Engineer (L5) - Security Services Engineering", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721963039, "t_create": 1721779200, "ats_job_id": "JR28755", "display_job_id": "JR28755", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p><span> </span><span>Netflix is the world&#39;s leading streaming entertainment service, with 200&#43; million paid memberships in over 190 countries, enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. This is made possible, in part, by an engineering organization that enables our customers to stream content and our studio to produce content. </span><span> </span></p><p></p><p><span>The Security Services Engineering organization supports the Netflix workforce by creating and operating authentication, authorization, and cryptographic software services. Our IAM use cases will continue to become more complex as we increase investment in Netflix Originals content production ecosystems, including but not limited to Enterprise, Studio, Gaming, Live streaming, and more. Our workforce and partners are global, and they access our information with different patterns from various locations and devices. With security and ease of information access for our fast-paced growth in mind, we realize that the traditional corporate network security perimeter no longer meets our requirements. Instead, we invest in Identity as a perimeter in the open internet, with reliable, robust, and strong authentication and authorization services to protect our information. </span></p><p></p><h2><span>The Role </span></h2><p><span>This role is a unique opportunity to contribute to longstanding services at Netflix that enable all of our workforce to properly access the resources they need to help Netflix entertain the world—building services from the ground up with security, large scale, high availability, high throughput, and low latency in mind! You will be part of the Access Control Engineering team, focusing on core functionality to support the entire Netflix ecosystem (Enterprise, Studio, and Gaming). You will be responsible for a mix of projects encompassing ownership of system design, implementation, partner integration, rollout strategy, and maintenance for some of our foundational authorization and access management services internally and cross-organizationally.  </span></p><p><span>If you are curious about some of the team’s work, you can watch this </span><a href=\"https://youtu.be/ce7dUI5uD-0\" target=\"_blank\"><span>Building Identity for an Open Perimeter</span></a><span> conference talk by our IAM engineers. Another recommended read is </span><a href=\"https://medium.com/&#64;bdpsecurity/netflix-culture-meets-product-security-599ceecd615d\" target=\"_blank\"><span>this</span></a><span> blog post about how product and application security operates in the Netflix culture.</span></p><p></p><h2>What you’ll need to be successful:</h2><ul><li><p><span>You are a pragmatic software engineer who believes in risk-focused, scalable security approaches with a solid technical background in developing secure, low latency, resilient, and high-availability services</span></p></li><li><p><span> </span><span>In-depth experience in at least one modern programming language such as Java (preferred), C&#43;&#43;, C#, Python, or Go; we’ve invested heavily in Java but have services built in other languages such as Go, Python, NodeJS, and more</span></p></li><li><p><span>In-depth experience designing and building complex Authorization Models by making informed decisions using a deep understanding of industry standards such as RBAC/ABAC/PBAC, etc.</span></p></li><li><p><span>Experience with authentication and authorization protocols/frameworks (OpenID Connect, SCIM, OAuth, SAML).</span></p></li><li><p><span>You have experience working on complex systems running on top of Cloud platforms(e.g., AWS, Microsoft Azure, GCP)</span></p></li><li><p><span>You are driven by collaboration and problem-solving rather than processes and mandates. You thrive in dealing with ambiguity and making self-driven decisions. You can adequately communicate your choices and tradeoffs and dissent when necessary. </span></p></li><li><p><span>You have excellent verbal and written communication skills and a product-focused mindset to build the right solutions for your stakeholders and customers. You adapt your communication style to reflect the audience you are speaking to.  </span></p></li></ul><p></p><h2>Nice to have:</h2><ul><li><p><span>Experience in continuous integration and continuous deployment in a Cloud platform</span></p></li><li><p><span>Experience with NoSQL technologies such as Hive, Presto, Spark, or Cassandra</span></p></li><li><p><span>Experience with Graph database</span></p></li><li><p><span>Experience with GraphQL, gRPC, DGS</span><span> </span></p></li></ul><p></p><p></p><p>Compensation:<br />Generally, our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is 100,000 - $720,000.</p><p></p><p>Benefits:<br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a></p><p></p><p>Culture: <br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.<br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28755-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298129221", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28755"], "team": ["Engineering"], "posting_date": ["07-24-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
