{"id": 790298014131, "name": "Technical Program Manager, DevEd L5", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1717977600, "t_create": 1717977600, "ats_job_id": "JR28424", "display_job_id": "JR28424", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Overview\n\nWe are looking to hire a TPM for Developer Enablement within the Platform Engineering organization. The role is for a TPM, Developer Education specialist who can drive both platform wide or domain based programs that cut across multiple engineering teams and product teams. We are seeking a candidate with extensive developer education operations and ecosystem knowledge and experience including working knowledge of Time to Productivity and training personas.\n\nPlatform DevEd TPM Context\n\nThis role will create vision, strategy and action plans for driving the developer education dashboard, content library, and ecosystem within Platform Engineering. These are highly visible and cross-functional efforts that require building and driving technical thought leadership across all engineering organizations across Netflix. \n\nA successful candidate will have experience in Developer Education, DevOps or EngOps. They will have experience leading complex cross team and cross organization programs, and bringing them to a successful conclusion. They will have demonstrated experience building and fostering relationships across many stakeholders. They will thrive stepping into an ambiguous situation and bring order and alignment.\n\nOur TPM team is currently staffed with 3 Individual Contributor Technical Program Managers who have backgrounds in Engineering, Product Management, Program Management, Data Analysis and visualization, and Generative AI. Our TPMs are technically adept and partner directly with product and engineering functions, aligning and mobilizing teams to deliver high impact business outcomes. The team has grown organically over the last year with a new leader. We are looking for an experienced TPM to join the team to lead new programs across Netflix Engineering within the Developer Education lens.\nIn a TPM, we want to see... <ul><li>Passion for technical education and instructional design.</li><li>Experience measuring and tracking Time to Productivity.</li><li>Lead projects mapping engineering organizations and personas.</li><li>Lead technical discussions and show thought leadership.</li><li>Strategic execution and delivery on a vision focused on results.</li><li>Ability to build strong relationships and rally the team.</li><li>Ability to influence program/product direction and simplify complexity.</li><li>High emotional intelligence and ability to assess people dynamics.</li></ul> What would be additive for the team/group: <ul><li><b>Unique perspectives and lenses: </b>We aim to be (at least) as diverse as the user base we serve, so that we build inclusive products/experiences. We would benefit from perspectives across dimensions of diversity that are not currently represented on our TPM team.&nbsp;</li><li><b>Perspectives on partnering with PM groups: </b>As we introduce Product Management to Platform Engineering, we’re evolving our definition of the TPM role and partnership model. We would benefit from experience and perspectives on how best to set up the model and partnership for success.&nbsp;</li></ul> Our culture is unique, and we tend to live by our values, allowing you to do your best work and grow. \n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $260,000-$490,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28424-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014131", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28424"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
