{"id": 790298012329, "name": "Solutions Engineer L5", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1708560000, "t_create": 1708560000, "ats_job_id": "JR27757", "display_job_id": "JR27757", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>It’s an amazing time to be joining Netflix as we continue to transform entertainment on our mission to entertain the world! To achieve this, we are building a technology-powered studio for global production, distribution and delivery of compelling content to over 240 million members in 190 countries in more than 30 languages. We are also expanding into new forms of entertainment such as gaming and live streaming. </p><p></p><p></p><p><br />About Studio Tech Solutions (STS)</p><p></p><p><br />For Netflix Studio to continue to scale and produce quality content, the Studio business teams work closely with product partners to innovate and develop technical solutions that support the entire content life cycle - planning, programming, producing, distributing and promoting content on a global scale. These solutions include internal enterprise applications that support critical functions, as well as short-term technical solutions that increase operational efficiency at the business user level on a smaller, rapidly iterative scale. STS works directly with business stakeholders, product partners and engineering colleagues to deliver these short-term solutions. The team&#39;s goal is to translate business challenges and opportunities for operational improvement into focused, nimble and highly impactful solutions as an integral part of the Netflix Studio product ecosystem.</p><p></p><p></p><p><br />About the Role</p><p></p><p><br />As a Solutions Software Engineer (L5) on the STS team, you&#39;ll be a part of a co-located team working out of the Los Angeles office. You&#39;ll use a broad set of internal and third-party technology and tools to contribute to impactful short-term solutions that increase operational efficiency within the Content Planning and Finance area of the Netflix Studio business. You will be responsible for providing short-term solutions that automate highly manual processes until those features can be evaluated and incorporated into the enterprise application ecosystem. You will interface with business users, analyze their needs, design and develop a solution, or leverage existing technology/tools with customized enhancements. Most of the solutions involve data ingestion or export tasks. While we value your ability to create well-defined systems, your effectiveness will be related to your ability to context switch effectively while developing nimble solutions for the studio.</p><p></p><p></p><p><br />Your effectiveness in this role will be related to:</p><ul><li>Your ability to learn quickly and switch contexts productively in a highly collaborative development environment.</li><li>Your curiosity to gain business and technical context to determine the efficient level of engineering investment for project scope..</li><li>Your eagerness to share learning and project visibility with the team, partners, and stakeholders.</li><li>Having a keen eye for identifying the team’s productivity tooling opportunities and working with partners to influence their feature roadmap.</li></ul><p></p><p>You belong in this team if:</p><ul><li>You are passionate about solving problems and love every aspect of the full-stack software development life cycle.</li><li>You understand the importance of seeking in-depth and broad context to build an effective solution.</li><li>You enjoy building prototypes and short-term solutions to help improve and empower users to innovate on business workflows.</li><li>You are comfortable contributing to solutions at all technical levels, from scripting to building a custom application.</li></ul><p></p><p>Qualifications:</p><ul><li>4&#43; years of experience in full-stack development.</li><li>Comfortable working with: <a href=\"http://Node.js\" target=\"_blank\">Node.js</a>, Python or Java.</li><li>React or similar front-end frameworks.</li><li>Experience with API integrations (GraphQL, REST and/or gRPC).</li><li>Experience with end-to-end project ownership (user interview to project delivery)</li><li>Experience working with non-technical business stakeholders</li><li>Keen understanding of database models and SQL.</li></ul><div></div><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.</p><p></p><p></p><p><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.</p><p></p><p></p><p><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27757-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012329", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27757"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
