{"id": 790298014292, "name": "Engineering Manager, Consumer Identity and Access", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1708905600, "t_create": 1708905600, "ats_job_id": "JR27768", "display_job_id": "JR27768", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix is the world’s leading Internet television network with over 270&#43; million paid members enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. As a global household brand, we strive to bring joy to users by connecting them with stories and artists through a delightful and high-quality experience. </p><p><br /><br />As part of the Consumer Identity and Access organization, the Consumer Identity Foundations team builds platforms and services to store, manage and serve context on Netflix accounts, profiles and devices for our streaming and games products at high scale. We are seeking a talented Engineering Manager to lead our dynamic team of local and remote engineers and drive the development and innovation of our highly resilient infrastructure that enables product experiences and privacy initiatives.</p><p></p><p><br />About You:</p><ul><li>You are an inclusive leader with a proven track record of building and leading high-performing diverse teams.</li><li>You have an extensive background and strong technical expertise working in backend infrastructure and platforms, and understand how to build for scale and business impact.</li><li>You have a proven track record of taking innovative projects from concept to production.</li><li>You are inherently curious and enjoy leading through challenges with building high scale, low latency applications.</li><li>You are a proactive, effective communicator with great judgment and a bias towards action.</li><li>You are a role model for integrity, transparency and courage.</li><li>You have a high tolerance for ambiguity and fast-changing context.</li><li>You enjoy enabling your team to work on hard problems with new tech, but what really drives you is creating levers for making a big impact and delighting your stakeholders.</li></ul><p></p><p></p><p>Scope of the Role:</p><p></p><ul><li>Provide technical vision and strategy for building platforms to scale to the next set of million members.</li><li>Build strong and productive relationships across product management, engineering, data science, and security partners.</li><li>Balance immediate stakeholder needs vs longer-term vision.</li><li>Lead a dream team of backend engineers to execute on a shared vision between security, engineering, and product partners.</li><li>Grow and mentor team through a supportive mindset, thoughtful observation, and courageous, honest feedback.</li></ul><p></p><p></p><p>Must-Haves:</p><p></p><ul><li>Knowledge of distributed systems architectures and infrastructure.</li><li>An engineering mindset that stays technically curious and engaged in innovation and encourages learning in the team.</li><li>Thoughtful leadership with experience in hiring, coaching and retaining strong engineering talent with various needs for personal and professional growth.</li><li>Strong partner for product management and engineering leaders, equally passionate about working with engineering and non-engineering stakeholders.</li></ul><p></p><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.</p><p></p><p></p><p><b><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits </span><a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><u>here</u></a><span>.</span></b></p><p><br /><br /><b><span>Netflix is a unique culture and environment. Learn more </span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><u>here</u></a><span>. </span></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27768-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014292", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27768"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
