{"id": 790298013447, "name": "Manager, Content Programming Strategy & Operations - India", "location": "Mumbai, Maharashtra, India", "locations": ["Mumbai, Maharashtra, India"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1720396800, "t_create": 1720396800, "ats_job_id": "AJRT46615", "display_job_id": "AJRT46615", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Content Programming Strategy & Operations (CPS&O) is looking for a Manager to join its India team in Mumbai. CPS&O is the team in charge of the analytical efforts and strategic thinking behind the content programming strategy, working across content buying and original content decisions of India. The team works cross-functionally to translate the incredible amount of data at Netflix into problem-solving and strategic decisions. \n\nThis person will have a high degree of visibility with senior management which uses the team’s analysis and insights to inform important business decisions, such as our content performance analysis and programming strategy.\n\nThis role will be located in Netflix's India office and report to the lead of India CPS&O team.\nResponsibilities: <ul><li>The individual will be a key thought partner and go-to person for the India Content Team focusing on commissioning and licensing Hindi local content (in addition to being a thought partner for various cross-functional stakeholders)</li><li>Analyze title performance and the ongoing trend of key content metrics on the slate level, develop audience insights and a deep understanding of the industry to build a programming and resourcing strategy across content and production</li><li>Conduct content deep-dives and compile thoughtful post-mortem analyses to determine areas for optimization and improvement</li><li>Conduct analysis of key business drivers, trends, and performance indicators, preparing deal and valuation analyses (model building, scenario testing, etc.) in partnership with the Creative and Business Affairs teams</li><li>Working cross-functionally with other teams globally as well as Finance, Product, Marketing, and Consumer Insights teams</li></ul> Qualifications: <ul><li>5-7 years of experience in a top management consulting firm, investment bank, private equity, hedge fund, and/or media/entertainment/tech company in a strategy/business development/analytical role. We are looking for candidates who have worked in a highly-demanding environment in which they’d have managed multiple stakeholders and performed complex analytics mixed with simple/digestible communication of the same</li><li>Candidates are required to be highly analytical and be effective communicators</li><li>They must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest personal and professional standards of integrity and ethics. Candidates must be motivated, disciplined, flexible, and be able to work effectively autonomously</li><li>High aptitude and enthusiasm for complex (often highly ambiguous) problem solving and utilizing financial modeling and analysis (including strong Excel skills)</li><li>Familiarity with statistical concepts and analyses</li><li>Adept at writing, facilitating and presenting analyses</li><li>Passion and familiarity with Indian content and entertainment is a strong plus especially Hindi</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT46615-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013447", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46615"], "team": ["Finance & Accounting"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
