{"id": 790298013715, "name": "Director, Marketing Partnerships - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1701302400, "t_create": 1701302400, "ats_job_id": "AJRT43068", "display_job_id": "AJRT43068", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Role\n\nReporting to the Senior Director of Marketing Partnerships APAC, the Marketing Partnership Director for Japan will be responsible for developing and executing marketing campaigns whilst cultivating deep relationships with partners like mobile & broadband operators, consumer electronics and other leading consumer brands.\n\nOur partners are an extension of Netflix’s own marketing efforts and therefore a strategic lever of growth for us. It is therefore essential that our partner communication is clear, consistent and engaging. Additionally,  we’re always looking for cutting edge, creative ways to work with partners to make the Netflix service and our titles shine.\n\nThe successful candidate will be a seasoned professional with 15+ years of demonstrated experience in executing partner marketing initiatives. A passion for technology and entertainment is a must in addition to a keen understanding of how access to entertainment fits into consumer’s lives and how it is likely to evolve over time. Ultimately they must own the full life cycle of partner marketing projects from idea to execution to post-analysis.\n\nEssential duties and responsibilities: <ul><li>Lead a small team and together, own the marketing relationship & opportunity with our partners in Japan.</li><li>Execute partner marketing programs that deliver on our broader business strategy.</li><li>Provide strategic support to internal product and business development teams to develop and execute Go-to-Market strategies across partner channels for maximizing Netflix exposure on new and existing partnerships.&nbsp;&nbsp;</li><li>Work closely with the cross functional teams; our business development, marketing, content and PR teams to identify opportunities for partnerships and subsequently, the right partners for executing those opportunities.</li><li>Develop and launch highly creative & conversation-driving marketing partnership programs that advance exposure for Netflix content or the brand in a way that benefits Netflix and our partners.</li><li>Collaborate with partner creative, marketing and content teams to elevate the campaign creatives and introduce our content to consumers in unique and unexpected ways.&nbsp;</li><li>Evaluate performance against marketing goals with partners through established review rhythm and define corrective actions to improve effectiveness and results.</li><li>Be a hands-on leader who is willing to constantly learn and iterate our campaign initiatives to drive bigger & better impact.</li></ul><div><br></div><div>The role will be based in our Tokyo office and will require occasional travel.&nbsp;</div> Qualifications: <ul><li>Extensive knowledge and 15+ years of experience in Japan in connected industries like Consumer Tech and Entertainment.&nbsp;</li><li>Strong experience in consumer marketing with natural partner management and influencing skills.</li><li>Proven record of strong negotiation skills with an ability to develop rapport and translate established partner relationships to programs that impact the business.</li><li>Ability to analyze and apply data to business strategy and goals.</li><li>Experience and passion for building great content partner marketing programs that are unique and scalable.</li><li>Experience working with Entertainment properties (movies, tv series, video games, music, etc) is a plus.</li><li>Ability to manage multiple time-sensitive projects simultaneously without the support of a large team, working both independently and in close collaboration with a wide variety of stakeholders, mainly remotely.</li><li>Strong cross-team collaboration skills and ability to promote innovation through a creative collaboration process that transforms different input into one actionable output.&nbsp;</li><li>Willingness to be a hands-on leader with an ability to be deeply involved in the details of the execution.&nbsp;</li><li>Knowledge or experience with telco/ISP industries or previous experience working with CE and/or retail partners is a plus.</li><li>Fluency in Japanese and English is required.</li><li>A desire to thrive in our unique culture.</li></ul> The Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our culture memo. If it resonates with you, maybe you’re the right person to join our team. \n\nNetflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT43068-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013715", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43068"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
