{"id": 790298013659, "name": "Network Architect (L5)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719792000, "t_create": 1719792000, "ats_job_id": "AJRT43703", "display_job_id": "AJRT43703", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is responsible for double-digit percentages of the traffic on Internet access networks delivered in a manner that is both highly efficient and cost-effective, delivered by our purpose-built consumer delivery network.  We also strive to deliver a world class ecosystem to our content creators in every stage of the production process through technology and collaboration enabled by network solutions.  We need great network professionals to help us manage the remarkable challenges and opportunities in these environments.\n\nThere are multiple disciplines on this team and we’re looking for a talented Network Architect to focus on what our content creators need, including design and testing for our offices, creative spaces, studio infrastructure, private data centers, and remote connectivity solutions.\n\nThis role requires a technical leader and collaborator with a broad set of skills and technical achievements, a DevOps, automation-first mindset, a flexible approach to problem-solving, and an impressive past of unique career and life experiences to bring to our diverse team of experts. \nMust-have skills: <ul><li>Deliver Technical Designs: You have a proven ability to rapidly deliver architecture artifacts, including detailed high-level designs, test plans, and roadmaps.</li><li>Communicating a Shared Vision: You excel at working cross-functionally with experts in different disciplines and translating business goals into technical requirements and offerings.&nbsp;</li><li>You have 5+ years of experience in several technical disciplines, including Designing, deploying, and troubleshooting services over Wi-Fi.</li><li>Delivering solutions in baseband, hybrid, or IP-based Media/Content Creation Networks. (Live, Studio Production, VFX, Animation, and general Editorial preferred).</li><li>Designing Spine Leaf, Backbone, and multi-tiered networks to support multiple customer environments.</li><li>Design and implementation of Data Centers supporting highly available compute and storage elements.</li><li>Zero Trust/Cloud First network architecture design.</li><li>Firewalls, both physical and virtual. (Experience with AWS Security Groups a plus).</li><li>Overlay Networks (VXLAN/MPLS preferred).</li><li>Designing, scaling, and troubleshooting large BGP environments.</li><li>Evaluating Network equipment vendors.</li><li>Working with Network Automation tools such as Ansible or Nornir to deliver at scale.</li><li>Scripting network configurations and management tooling, preferably in Python or Java.</li><li>Designing test cases with synthetic traffic generation (IXIA, iPerf preferred) and performing end-to-end testing of solutions as a part of architectural design projects.</li></ul> Thriving in this role looks like: <ul><li>Balancing bias to action with the ability to make well-informed decisions.</li><li>Understanding and solving business needs at scale with high-quality solutions.</li><li>Owning and driving cross-functional projects that enable new business areas for Netflix.</li><li>Thriving in ambiguity; complex and fuzzy requirements are more common than clearly defined customer expectations.</li><li>Passion for technology, pragmatic thinking, and the ability to dive into ambiguous areas and break down complex problems.</li><li>Taking incremental steps toward solving big problems; test-and-learn approaches work better than heads-down development.</li><li>Engaging directly with end engineering and developer users to understand their needs and improve their overall experience with the Infrastructure at Netflix.</li><li>Independent and self-driven; progress is often self-directed by teams & individuals.</li></ul> Additional requirements:\nLocation is flexible within the US or The Netherlands\nPeriodic travel within the United States for offsites, conferences, and technical meetings\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $600,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43703-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013659", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43703"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
