{"id": 790298014217, "name": "Dubbing Title Manager - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Studio Operations", "business_unit": "Streaming", "t_update": 1719964800, "t_create": 1719964800, "ats_job_id": "AJRT46630", "display_job_id": "AJRT46630", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Opportunity\nThe Netflix Dubbing Production team is responsible for getting those amazing programs to our growing international audience. Centered around dubbing/VO production, a great team environment, and cutting-edge technology, this group is critical to Netflix’s ability to provide the best-localized experience of our great content. With this international expansion, the preservation of creative intent in the production of a localized experience is of utmost importance; what a great time to join Netflix!\n\nAs a Dubbing Title Manager, you will be responsible for how members experience dubbed audio, ensuring Netflix customers across the globe get the highest quality experience from our localized audio assets. As we continue to add support for new languages and expand our global membership, providing best-in-class localized content is critical to our success.\n\nThe Role\nThe Dubbing Title Manager is the main liaison to local cross-functional teams, managing titles for Japan on the Dubbing team.  The ideal candidate is an experienced, organized, strategic thinker who thrives in managing a multitude of tasks while safeguarding all title-level requirements.  Key responsibilities include scaling and growing the business, ensuring strength in internal and external partnerships, and accountability for the strategy and all facets of the development of dubbing production across assigned titles.  You will be working on Netflix's growing catalog to manage long and short-form project progress, quality control, and the launch of all dubbed and accessibility assets. Managing end-to-end dubbing includes strategizing closely with internal and external partners to direct and influence outcomes even amidst ambiguity.  This is a demanding and fast-moving position that requires someone who can maintain a holistic, strategic approach while getting as tactical as necessary to deliver the content. Applicants must work across all components of Dubbing alongside in-territory teams to produce high-quality global audio assets in up to 36+ languages.  \nResponsibilities: <ul><li>Develop the long-form and short-form dubbing strategy on multiple large-scale projects across a wide range of Dubbing partners and languages.</li><li>Leading the project management on titles originating from Japan being dubbed into various languages.</li><li>Consistently develop relationships with our Netflix original content teams to identify the challenges and complexities within the original content that impact localization and address them strategically.</li><li>Work with Creative teams on titles to assess the intention of the original version and determine appropriate creative support and guidance for character/cast management, title sensitivities, and consistency across the title’s localization strategy.&nbsp;</li><li>Foster and support consistent communication with cross-functional teams, including Content Acquisitions, Dubbing Language Production, Post Production, Marketing, Legal, Globalization, Business Affairs, Creative Production teams, etc., to ensure strategy alignment around the global distribution of Netflix original content.</li><li>Constantly execute creative and operational excellence for Netflix content.</li><li>Work closely with in-territory partners (dubbing vendors and/or language production) to provide creative context about both titles and slates.</li><li>Manage context gathering, complexity signaling, budgets, source material distribution, schedules, and asset deliveries to ensure successful global launches of dubbed assets.</li><li>Cultivate adopting and contributing to new practices, initiatives, workflows, and technology as it applies to Dubbing within the company.</li><li>Manage and communicate with external partners to ensure dubbed assets are in a launch-ready state by a designated date, whether under a normal or accelerated timeline.</li><li>Make sound independent decisions, and know when to escalate issues.</li></ul> Role Requirements: <ul><li>Minimum 5+ years of project management experience (creative/operations) or equivalent experience.</li><li>Prior experience in managing dubbing or localization workflows in the entertainment industry.</li><li>Highly analytical and able to get to the root cause of a problem; creatively figure out a solution or propose changes to existing workflows as required.</li><li>Adaptability and resilience to rapidly evolving priorities, technology, tools, and workflows.</li><li>Identify and manage risk through prioritization, troubleshooting, and other means necessary.</li><li>Develop business and cultural awareness of territory nuances related to dubbing, costs, talent, and workflows.</li><li>Ability to handle a fast-paced environment, supervising several projects in various production points (from development through delivery).</li><li>Contribute to the company's culture of curiosity and self-disciplined proactive responsibility as part of the Dubbing team.</li><li>A sincere passion for the Dubbing landscape and the future of content creation.</li><li>Strong organizational skills with a proactive mentality and creative problem-solving abilities.</li><li>Willing to constantly question existing systems and look for a better way to execute workflows and processes.</li><li>Willing to travel as needed.</li><li>Fluency in written and spoken Japanese and English is required.&nbsp; Being multilingual is a plus.</li></ul> Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT46630-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014217", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46630"], "team": ["Studio Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
