{"id": 790298013758, "name": "Data Engineer (L5) - Product (Device)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1716940800, "t_create": 1716940800, "ats_job_id": "AJRT43261", "display_job_id": "AJRT43261", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, our mission is to entertain the world. With 200&#43; million paid members in over 190 countries on millions of devices, enjoying TV series, documentaries, and feature films across a wide variety of genres and languages, Netflix is reinventing entertainment from end to end. We are revolutionizing how shows and movies are produced, pushing technological boundaries to efficiently deliver streaming video at a massive scale over the internet, and continuously improving the end-to-end user experience with Netflix across their member journey. </p><p><br /><br />The Device pod within the Streaming Data Engineering team partners with multiple engineering teams, producing high-quality and large-scale datasets, a source of truth for how Netflix services operate on the vast landscape of devices that support Netflix. This team helps to create datasets used to certify and retire devices, categorize them, and identify changes in this constantly changing environment. </p><p><br /><br />This role is focused on supporting Netflix’s core data assets, delivering high-quality business datasets and metrics, and building systems to process batch and real-time data at a large scale. Additionally, a candidate should have a rich understanding of large distributed systems, modern big data technologies, and software development techniques. Since data engineers are responsible for their pipelines at Netflix, this role requires engineers to take ownership of the operational excellence in their domain.  In addition, the ideal candidate will have excellent data intuition and share our passion for continuously improving how we handle streaming data at Netflix. <br /><br /><br />Who are you?</p><ul><li>You strive to write elegant code and are comfortable with independently picking up new technologies.</li><li>You have mastery over at least one major programming language (e.g., Java, Scala, Python) and are comfortable working with SQL.</li><li>You enjoy helping teams push the boundaries of analytical insights, creating new product features using data, and powering machine-learning models.</li><li>You have a strong background in at least one of the following: distributed data processing or software engineering of data services.</li><li>You are familiar with big data technologies like Spark and Flink and comfortable working with web-scale datasets.</li><li>You are passionate about the end-to-end software development lifecycle, focusing on automation, testing, CI/CD, and documentation.</li><li>At Netflix, you own your code, services, and pipelines. You have practical, solid DevOps and Operation fundamentals, and you enjoy total ownership of your domain.</li><li>You have a solid understanding of the device lifecycle. </li><li>You have an eye for detail, good data intuition, and a passion for data quality.</li><li>You relate to and embody many of the aspects of the Netflix Culture. You love working independently while also collaborating and giving/receiving candid feedback.</li><li>You are comfortable working in a rapidly changing environment with ambiguous requirements. You are nimble and take intelligent risks.</li></ul><p></p><p></p><p>What you will do:</p><ul><li>Help Netflix support and evolve the device data model by improving data excellence and quality, supporting analytics, developing and maintaining metrics, and partnering with engineering to deliver the next generation of Netflix experiences.</li><li>Engineer efficient, adaptable, and scalable data pipelines to process structured and unstructured data </li><li>Partner with numerous engineering teams, analytics engineers, and data scientists to enhance playback-related datasets. </li><li>Maintain and rethink existing pipelines to improve scalability and maintainability.</li></ul><p></p><p></p><p>Here are a few more things to know:</p><ul><li>Our culture is unique, and we live by our values, so it&#39;s worth learning more about Netflix at <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">jobs.netflix.com/culture</a>. We regularly share examples of our work on our tech blog. You will need to be comfortable working in the most agile of environments. Requirements will be vague. Iterations will be rapid. You will need to be nimble and take smart risks. </li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43261-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013758", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43261"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
