{"id": 790298014093, "name": "Product Manager, Commerce Algorithms", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1702944000, "t_create": 1702944000, "ats_job_id": "AJRT44494", "display_job_id": "AJRT44494", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The Role\nWe are constantly innovating to grow our member base and revenue. Algorithms and machine learning power critical systems that enable this growth: from the messages we send to the back-end of our payments infrastructure. \n\nWe are looking for a dynamic and innovative product manager to lead the development of the next generation of commerce algorithms for Netflix. In this role, you will leverage our vast amounts of data to create personalized and optimized signup experiences, enabling easy and secure access to our service, and maximizing the lifetime value of our existing members by utilizing data-driven insights to enhance their overall experience and satisfaction with Netflix. This is a unique opportunity to shape the future of commerce algorithms and drive growth for our platform.\n\nYou will craft and communicate a strategic roadmap and see to its execution leading cross-functional teams of the industry’s best data scientists, machine learning and software engineers. You will work in close partnership with the commerce product management team, design, consumer insights and other functions to bring your vision to life. As a high-leverage thought leader, you will have the ability to shape our thinking on how to evolve the commercial aspects of our product and have a massive impact on our ability to accelerate revenue and growth. \n\nThis role is based in our Los Gatos office (preferred) in a hybrid model, but we are open to remote candidates who are on the West Coast. Some travel to Los Gatos will be required if remote-based.\nAn ideal candidate in this role will: <ul><li>Work through open-ended Commerce problems and identify problem spaces that benefit from algorithm investment&nbsp;</li><li>Identify algorithmic synergies throughout the commerce lifecycle and approach them systematically, focusing on reusability and repurposability&nbsp;</li><li>Have intuition about when to invest in ML vs. heuristics</li><li>Specify product requirements that are relevant for ML and data engineers to consider e.g. freshness of algorithm, precision of recommendation</li><li>Develop deep understanding of the business and product metrics, and how they are affected by improvements to algorithm metrics&nbsp;&nbsp;</li><li>Collaborate closely with Data Scientists in designing effective AB tests for evaluating algorithm improvements&nbsp;</li><li>Collaborate effectively with Growth PMs to drive the right product experience leveraging algo/ML capabilities as necessary</li><li>Strong product sense with user-centric mindset&nbsp;</li><li>Excellent communication skills to define, explain and execute your vision</li><li>Strong analytical and problem-solving skills</li></ul> What We Offer <ul><li>The opportunity to have a huge impact. The products and features you will be working on are central to the product experience of hundreds of millions of people around the world.</li><li>Responsibility. Netflix offers true transparency and autonomy. Our <a href=\"http://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a> is unique and is key to how we innovate.</li><li>Learning. You will be creating customer experiences and business models that have never been done before. You will have the opportunity to work with stunning colleagues who value collaboration and from whom you can learn.</li><li>A work environment where you can grow your career. Many of our top execs started out as individual contributors.</li></ul> Skills Required: <ul><li>Experience managing consumer products leveraging machine learning (e.g. recommendation systems) with a proven record of prioritizing and successfully launching impactful products or platforms.</li><li>Demonstrated leadership experience working effectively with data scientists, machine learning engineers, statisticians etc.&nbsp;</li><li>Proven ability to map algorithmic solutions to product problems with demonstrated impact on business metrics through AB testing.</li><li>Excellent written communication skills and ability to present technical content to non-technical audiences.&nbsp;</li><li>Ability to partner with different functions to ensure that your solutions drive real business impact. Strategic thinking and ability to incorporate larger business context into algorithm and product development.</li><li>MS in an applied quantitative field is preferred (such as Machine Learning, Statistics, Operations research, Information theory, Control theory, Econometrics etc)&nbsp; or&nbsp; equivalent experience working in data science or ML-engineering.</li><li>Experience working in the eCommerce domain is a plus.</li><li>Deep understanding of product design is a plus</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $240,000 - $725,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44494-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014093", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44494"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
