{"id": 790298013745, "name": "Engineering Manager, MWI Workflow", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1713225600, "t_create": 1713225600, "ats_job_id": "AJRT44437", "display_job_id": "AJRT44437", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world’s leading Internet television network, with over 200 million members enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause, and resume watching, all without commercials or commitments.\n\nContent Infrastructure & Solutions (CIS) empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. We do that by providing scalable and resilient infrastructure to address integrated large-scale media, assets, data, workflow, and communication use cases. Examples of this organization’s work include massive-scale media processing platforms (1, 2), workflows (conductor), and data processing at scale. \n\nThe Content MiddleWare Infrastructure team(MWI), part of the Content Infrastructure & Solutions group, provides Studio and Content Engineering-specific, highly leveraged, and fully managed data, workflow, and messaging and communication platforms that facilitate the goal of the Connected Studio. To learn more about what the MWI team does, check out the following tech blogs: workflow (1, 2), search (1, 2, 3), and data movement (1, 2).\n\nWe are hiring a manager for the Workflow Infrastructure team within MWI. This team builds highly scalable and reliable infrastructure to enable business workflow development within CE/Studio applications via solutions like a workflow orchestration engine (here), a priority queueing system (here), and a human-driven workflow solution. Our services free up application engineering teams to enable innovation in the content production and delivery space by enabling a consistent business workflow development experience, providing a seamless experience to their business stakeholders, and enabling effective business workflow orchestrations. In the second half of 2024, the team will start to collaborate with the product manager and partner teams on the future of the workflow platform which aims to converge various workflow platform solutions at Netflix into a single platform that provides a unified and streamlined user experience in building human-in-the-loop business workflows. The team focuses on not only the reliability, performance, and operability of the complex distributed workflow platform but also the developer experience for both engineering and semi-engineering users.\n\nThis is an exciting opportunity for an experienced manager. We are looking for a leader to facilitate setting the long-term strategy and vision for the team and drive the adoption of the workflow infrastructure to maximize the team’s impact on the business. \nWhat you will do: <ul><li>You will lead a team of software engineers to deliver high-impact results.</li><li>Partner with the product manager and the team to deliver the vision, strategy, and adoption of the workflow platform across content and studio engineering, and ensure that we’re building the right solutions to power other engineering teams to effectively design and build business workflows at scale.</li><li>Foster a strong accountability culture in the team and help the team deliver the results reliably and in a timely manner to support the needs of critical business stakeholders.</li><li>Act as a credible technical advisor to the team; help the team make thoughtful, informed decisions in ambiguous situations</li><li>Form trust cross-functional relationships with partners and stakeholders within Netflix, connect the dots and drive adoption to maximize the business impact, ensure our solutions meet their needs, and selflessly prioritize work beyond the scope of your own domain.</li><li>Effectively communicate complex ideas and influence decisions across a diverse range of stakeholders.</li><li>Balance business needs with strong engineering principles, ensure investment in foundational technical work, pay off tech debts, and make incremental improvements to deliver timely results.</li><li>Lead, coach, hire, and develop a team of outstanding engineers, challenge them to bring their best selves to their daily work, and deliver exceptional results in stability, performance, efficiency as well as developer experience.</li><li>Build and nurture an inclusive team culture where every member feels empowered, accepted, and respected.</li></ul> What we are looking for: <ul><li>3+ years of management experience.</li><li>Experience building and leading distributed, high-performing teams with a focus on inclusion and diversity. Ability to attract and retain the best talent from anywhere and ensure that all voices are heard to inform our decisions while fostering a strong culture of accountability, where individuals take ownership of their responsibilities and contribute to the team’s collective success.</li><li>Ability to foster a team culture of open and direct communications, where team members feel empowered to offer constructive and positive feedback and acknowledge achievements and areas for improvement.</li><li>Experience building and operating extremely reliable distributed platform systems supporting large-scale and critical workloads, including running 24x7 on-call, highly available, and fast response services.</li><li>Long-term strategic thinker with a strong platform mindset. Ability to define and articulate product vision and strategy and how they fit into the broader objectives of the organization.</li><li>Ability to prioritize strategically and align the team’s work with larger business goals. Courage to pivot based on broader impacts.</li><li>Ability to build and maintain strong partnerships with cross-functional partners and stakeholders with excellent communication and collaboration skills. Capable of influencing the strategic direction of partners and stakeholders.</li><li>Proven track record helping a team deliver timely results on critical priorities against many demands for their time, and partnering with product and engineering management to influence the right areas for investment</li><li>Bring rigor to decision-making and drive down ambiguity with the right mix of collecting data, seeking input, farming for dissent, and making pilot investments to build understanding or confirm direction.</li><li>Experience driving teams to adopt specific KPIs/leading indicators of system health, observing and tuning the systems to prevent predictable outages.</li></ul> Nice to have: <ul><li>Experience in building scalable and reliable business workflow systems that involve human interactions for use by engineering and semi-engineering stakeholders.</li><li>You have experience effectively working with product managers and TPMs, building trust relationships, and collaborating with them on strategic vision and project execution.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44437-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013745", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44437"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
