{"id": 790298013978, "name": "Software Engineer L5, Machine Learning Platform (Metaflow)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1716854400, "t_create": 1716854400, "ats_job_id": "AJRT42765", "display_job_id": "AJRT42765", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with 240M+ paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Machine Learning drives innovation across all product functions and decision support needs. Building highly scalable and differentiated ML infrastructure is key to accelerating this innovation.\n\nWe are seeking a senior software engineer to join the Metaflow project, developing a product that makes it easy to build, manage and scale real life ML applications.   Metaflow is used in over 100+ distinct ML applications within Netflix, spanning personalization and recommendations, growth and Ads.\n\nYou will lead requirements, design, and implementation of Metaflow product improvements, and have the opportunity to work alongside our applied researchers and data scientists on the cutting edge of machine learning.  You will have a strong customer focus and consistently engage with our ML community to source feedback, identify pain points, and opportunities to evolve Metaflow and the Machine Learning Platform in general.  You will also partner with the OSS Metaflow development community to ensure a mutually beneficial roadmap and relationship.\n\nTo be successful in this role, you must have a strong software engineering background, a keen sense of software design, a track record of prioritizing user experience, have proven experience with distributed applications, be a good communicator, and work well in large cross-functional teams.\nWhat we are looking for: <ul><li>5+ years of software engineering experience with a successful track record of delivering quality results</li><li>Strong software design and development skills, with prior Python experience</li><li>Experience working with tools, systems, and processes that accelerate ML researchers and Data Scientist velocity</li><li>Experience in building and operating scalable and reliable ML systems</li><li>Experience in large-scale build, release, continuous integration/continuous deployment (CI/CD), and observability methods</li><li>Experience working with public clouds, especially AWS</li></ul> Preferred, but not required additional areas of experience: <ul><li>Knowledge of machine learning algorithms</li><li>Prior experience as a Data Scientist or MLE</li><li>Experience with deep learning frameworks, such as TensorFlow, PyTorch, etc.</li><li>Significant contributions to open source projects</li><li>Experience in building UI</li></ul> More information <ul><li>To learn more about the work we do to check if it align with your interests, check the following articles:</li><li><a href=\"https://netflixtechblog.com/supporting-diverse-ml-systems-at-netflix-2d2e6b6d205d\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Supporting Diverse ML Systems at Netflix</a></li><li><a href=\"https://metaflow.org/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Metaflow</a></li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT42765-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013978", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT42765"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
