{"id": 790298012378, "name": "Software Engineer 5 - TV Player", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Engineering", "business_unit": "Streaming", "t_update": 1714348800, "t_create": 1714348800, "ats_job_id": "JR28086", "display_job_id": "JR28086", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix is the world&#39;s leading streaming video service, with over 200 million paid memberships in 190&#43; countries. Most of that streaming happens on CE devices (which comprise Smart TVs, streaming sticks, game consoles, and set-top boxes). <br /><br /><b>Who We Are</b><br />We are a team of passionate engineers who delight our members with industry-leading playback experiences on CE devices. To provide the best streaming experience, we design and develop playback features that adapt to device capabilities, are optimized for performance, and are scalable for reach. <br /><br />The TV Player team sits at the nexus of diverse activities powering new strategic product feature development (Live Streaming, Seamless Ads playback, and Cloud Games Streaming). From supporting UI and product innovation, adhering to evolving content protection features and <a href=\"http://netflixtechblog.com/what-is-an-a-b-test-b08cc1b57962\" target=\"_blank\">A/B experimentation</a> of new encodes (ex:<a href=\"http://netflixtechblog.com/bringing-av1-streaming-to-netflix-members-tvs-b7fc88e42320\" target=\"_blank\">AV1</a>), and Platform Capabilities, we partner with various cross-functional teams across Netflix, including <a href=\"https://netflixtechblog.com/bringing-rich-experiences-to-memory-constrained-tv-devices-6de771eabb16\" target=\"_blank\">UI</a>, <a href=\"https://netflixtechblog.com/vmaf-the-journey-continues-44b51ee9ed12\" target=\"_blank\">Encoding</a>, <a href=\"https://www.youtube.com/watch?v&#61;kCshXyCmUho&amp;t&#61;9s\" target=\"_blank\">Streaming Algorithms</a>, Security,  and <a href=\"https://netflixtechblog.com/serving-100-gbps-from-an-open-connect-appliance-cdb51dda3b99\" target=\"_blank\">Open Connect</a>. We also manage and deploy our player releases with test automation and continuous integration.<br /><br />Our team comprises engineers from diverse backgrounds with expertise spanning different disciplines (Embedded systems, Streaming Media Playback, Content Protection,  Client Server Communication, Networking protocols, Continuous Integration, Test Automation, Experimentation, and Software engineering). Our success comes from self-motivated, selfless, curious, and highly collaborative engineers in the team.<br /><br /><b>The Role</b><br />We are looking for a senior software engineer to join our team in enhancing our video player with new features and tackle challenges to improve streaming quality and reach on TV devices. In this role, you will lead and drive initiatives in new feature developments, conduct A/B experiments, analyze the data, influence decision-making, contribute to CI and test automation, and manage our player releases to millions of devices worldwide.</p><p><br /><b>What sets you apart?</b></p><ul><li>You are a curious, self-motivated, and self-starter, comfortable identifying opportunities and driving technical roadmaps. </li><li>You have a mindset to go deeper to understand the problems, identify the root causes, and develop solutions that consider trade-offs.</li><li>You seek alternate perspectives to improve your ideas.</li><li>You can rethink existing designs and rebuild them to improve performance and scalability.</li><li>You use data and seek input from others to inform your decisions. </li><li>You are selfless, highly collaborative, and willing to help colleagues when in need.</li></ul><h2></h2><p><b>What skills are essential to us:</b></p><ul><li>Expertise in developing software for streaming media applications. Live Streaming experience is a plus.</li><li>Proficiency in Javascript/Typescript and solid build scripting skills are required.</li><li>Strong analytical and problem-solving skills with a focus on critical thinking and a testability mindset.</li><li>Good understanding of CI/CD principles, with strong analytical skills to assess and optimize workflows and processes.</li><li>Experience with A/B testing, developing experiments to test hypotheses, and analyzing data to drive product decisions.</li><li>Proven ability to tailor communication to a given audience.</li><li>Experience working with CE devices (Smart TVs, Set-top boxes, or Streaming sticks) is a plus.</li></ul><p></p><p><b>What you will Do:</b></p><ul><li>Design and Develop new playback features to optimize and fine-tune streaming QoE for the same on TV devices to increase reach.</li><li>Work cross-functionally with the TV Platform Team, UI, Streaming Algorithms, Encoding, DSE, and other player client teams to collaborate and drive new initiatives.</li><li>Run experiments to gauge system performance for new device capabilities and feature exploration. </li><li>Design and develop tools to increase developer velocity and aid in-field issue triage.</li><li> Contribute to CI and test automation and manage our player releases.</li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000. <br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br /><br />Netflix is a unique culture and environment.  <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">Learn more here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28086-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012378", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28086"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
