{"id": 790298014058, "name": "Manager, FS&A, Ads Revenue & Yield Analytics (Inventory and Revenue Analytics) EMEA", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1714521600, "t_create": 1714521600, "ats_job_id": "AJRT43330", "display_job_id": "AJRT43330", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>We have ambitious plans, an enormous scale of opportunity and the passion to be the best in customer experience - which now includes a new ad-supported plan at a more affordable price point for customers. \n\nWithin the broader Finance, Strategy & Analysis (FS&A) organization, we’re building out a new team, Ads Revenue & Yield Analytics, who will help steward and support our Ads go-to-market strategy.  In this role, you will support the Ads business in the EMEA region, inclusive of Sales & Account Management, with specialization in Inventory Management and Revenue Analytics. \n\nIn tandem, you will have the opportunity to learn and grow quickly in this space, working closely with a global, cross-functional team across FS&A, Data Science & Engineering, Partnerships, Consumer insights, Marketing & Content to help build a cohesive understanding and unified approach to advertising at Netflix.\n\nVisit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team. \n Responsibilities will include: <ul><li>Develop an inventory monetization strategy across Netflix Ads product to drive revenue growth and improve yield.</li><li>Manage inventory availability across targeted media, sponsorship executions and custom programs.</li><li>Partner with Pricing and Yield to optimize go-to market initiatives against inventory composition, pricing strategies and ad serving logic.</li><li>Collaborate with Microsoft & Account Management to oversee effective inventory utilization throughout the pitch-to-pay process.&nbsp;&nbsp;</li><li>Work cross-functionally to define inventory guidelines for campaign executions across transaction models and currencies.&nbsp;</li><li>Work with Product and Data Science & Engineering to assess delivery scenarios across the Ad Product catalog to increase serving efficiency.</li><li>Work with Business Operations to assess transactional buying trends against marketplace conditions to quantify impacts across the Sales portfolio.&nbsp;</li><li>Collaborate with MSFT to establish a sustainable and reliable data model throughout the Ad Tech stack to ensure consistent and accurate outputs.</li><li>Work cross-functionally to build a reporting suite to track performance, elevate data-driven insights and advise real-time business decisions.</li><li>Prepare clear and concise presentations for Sales leaders and Ads stakeholders.</li><li>Support Sales, FS&A and Business Operations to assess Ad Tech stack / platform investments and to evaluate the impact on growth opportunities.</li></ul> What we’re looking for: <ul><li>7+ years of Inventory Management and/or Advertising Strategy experience</li><li>Strong modeling skills and comfort with manipulating large datasets in Excel, Google Sheets, Tableau, and other data visualization tools</li><li>A strong attention to detail and eye towards using the 80/20 rule to address problems</li><li>Candidates must be motivated, disciplined, flexible, able to work autonomously, and perform tasks with a wide range of difficulties</li><li>Very strong project management, planning and organizational skills, including the ability to handle multiple projects simultaneously and to deliver under tight timelines</li><li>Excellent communication and interpersonal skills, with proven ability to build successful relationships and partners at all levels</li><li>The ability to communicate ad serving logic with varying degrees of detail depending on the forum.&nbsp; You know your audience and what they’re looking for.</li><li>Expertise in programmatic advertising, auction dynamics, ad tech&nbsp;</li><li>Familiarity with&nbsp; the streaming ecosystem is a plus (though not required)</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT43330-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014058", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43330"], "team": ["Finance & Accounting"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
