{"id": 790298013614, "name": "Live Service Executive Producer, External Games", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Games", "business_unit": "Streaming", "t_update": 1705449600, "t_create": 1705449600, "ats_job_id": "JR27588", "display_job_id": "JR27588", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>This is your chance to be at the forefront of Netflix's new offering of Video Games. \n\nNetflix is revolutionizing entertainment. We connect people globally with movies and shows by delivering outstanding content and technological innovation through the world's leading streaming entertainment app, with 220 million paid memberships in over 190 countries.\n\nMembers can watch as much as they want, anytime, anywhere, and now they can enjoy an expanding collection of Netflix curated and produced Games. \n\nAt Netflix, we have an insatiable need to continually improve our product experience and the creative elements that support it, providing great value to our members, and this team sits at the forefront of the effort.\n\nAbout the Job\nAs the Executive Producer for our Live Service Games, you will oversee, from an operations and production perspective, our wide catalog of live games. Our production team focuses on the how and when, partnering with our PMs who will focus on the what and why. Together you will build a successful live service catalog, entertaining our members across the globe.\n\nOur live games vary from those that require infrequent updates, to our fully live serviced games which require roadmaps, scoping, dependencies and release of content updates. You will mentor and manage our Live Producers as they work directly with our external development teams and internal partners.\nResponsibilities: Focus on the How: <ul><li>Own the overall Live Service production strategy for the portfolio including pipelines and processes to ensure that Live Producers have everything they need to serve players, developers, and partners.</li><li>Identify and lead strategic initiatives across the portfolio to ensure our team and developers have goals, tools, frameworks and priority they need to be successful in Live service games.</li><li>Help resolve unique complex product issues through ingenuity, creativity and any other means necessary to get the job done.&nbsp;</li><li>Identify risks early and often and remove roadblocks and performance bottlenecks as needed.</li><li>Work directly with business development on developer evaluations and communicate production-related feedback to ensure developers are set up for success prior to signing.</li></ul> Build and Mentor Your Team: <ul><li>Manage a team of Live Producers, supporting them in their role as our external developer’s primary point of contact.</li><li>Mentor and lead multiple Live Producers, creating growth and opportunities for their success while maintaining a balanced production capacity.</li></ul> Collaborate with Stunning Colleagues: <ul><li>Align with our Live Service Director of Product Management to ensure priorities can be executed and roadmaps are in sync.</li><li>Partner with Executive Producers and Operations Leads for our development projects to ensure the Live Service is set up for success early in development and share best practices for building stunning teams.</li><li>Develop strong relationships with internal and 1st party studios to establish and maintain a flow of information so we are aligned on frameworks, games, opportunities and priorities.</li><li>Work cross-functionally to create a healthy team culture based on rich communication, transparency and shared context.</li></ul> Qualifications: <ul><li>Previous Executive Producer or Live Service Operations Director experience with a game developer or publisher.</li><li>6+ years of team leadership experience.</li><li>12+ years experience in game production with experience shipping multiple games (social, F2P, mobile, web, console, handheld).</li><li>Excellent knowledge of Live Service production, the difficulties generally encountered by teams and solutions tailored to their requirements.</li><li>Experience leading complex cross-functional projects with successful delivery of quality, schedule and in balancing scope, capacity, budget, risk, and time.</li><li>Experience in strategic planning and execution, specifically post-launch/live services experience in gaming preferred. (console, PC, or mobile).</li><li>Ability to influence direction, without relying on positional authority.</li><li>An uncanny knack for arriving at solutions through unconventional methods and developing a plan to put them into action.</li><li>Excellent communication skills with the ability to work with a variety of people, effectively communicating everything from data to creative feedback.</li><li>Multiple years of experience managing direct reports with varying levels of production experience.</li><li>Passion for video games, innovations in software and how they enrich the player experience.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $90,000 - $600,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27588-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013614", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27588"], "team": ["Games"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
