{"id": 790298013711, "name": "Product Manager, ML Platform: Training", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1721964876, "t_create": 1718582400, "ats_job_id": "AJRT46162", "display_job_id": "AJRT46162", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>The Machine Learning Platform (MLP) is responsible for enabling new technological development at Netflix and improving researchers’ and engineers’ productivity. MLP covers all phases of machine learning development at Netflix, including data processing, training, evaluation, deployment and operations.<br /><br />We are looking for a highly technical Product Manager with demonstrated excellence in delivering platforms that enhance data scientist productivity. You’ll build up a comprehensive understanding of what ML teams throughout the company need to land critical projects. From there, you’ll build out a vision and drive a roadmap of platform capabilities necessary to accelerate ML development, especially for Generative AI use cases. You’ll also define and execute on continual measurement of ML practitioner productivity.<br /><br />Excellent candidates have deep experience in product management for AI/ML platforms. They have strong empathy for ML practitioners, with a clear understanding of typical ML journeys. They are familiar with the full technology stack supporting ML training, from cloud computing to ML frameworks to orchestration systems. The best candidates demonstrate initiative, especially in ambiguous areas with unclear ownership. They’ll already have strong communication skills and a proven ability to align different teams to drive initiatives with a high degree of clarity and speed.<br /><br />This role can be located in our Los Gatos office in a hybrid model. We are also open to remote-based candidates on the West Coast of the US. Monthly travel will be required for remote employees.<br />Primary Responsibilities:</p><ul><li>Build a vision of machine learning training workflows at Netflix, from data acquisition to model rollout</li><li>Engage a broad set of customers to collect and clearly document requirements. Prioritize roadmaps to meet these needs.</li><li>Drive execution and adoption of the ML Platform’s training tools across the various stakeholders for MLP: Consumer Engineering, Algorithms Engineering, Studio and Content Engineering and Data Science organizations</li><li>Define new pathways to support Generative AI within the ML Platform</li><li>Define Training Dataset preparation, discovery and consumption requirements </li><li>Forge partnerships with other platform teams working on data &amp; developer products. Advance a cross-team vision to accelerate ML development at Netflix</li><li>Establish and follow through on regular measurement of success metrics like adoption and developer productivity</li><li>Own regular communication to senior Netflix management as well as broad communication to ML practitioners at Netflix</li></ul><p>Skills and Qualifications:</p><ul><li>10&#43; years of experience in technical product management</li><li>Extensive experience working and innovating on ML/AI platforms</li><li>Deep understanding of ML / AI development tools, from cloud computing (AWS, Azure, GCP, etc.) to ML frameworks (PyTorch, Tensorflow, etc.) to orchestration systems (Kubeflow Pipelines, Metaflow, etc.)</li><li>Knowledge and experience in defining, measuring, and improving developer productivity</li><li>Strategic thinking and ability to craft and drive a vision for maximum positive business impact</li><li>Demonstrated initiative in clarifying ambiguous projects and driving them to completion</li><li>Demonstrated leadership experience working effectively with engineers, data scientists and ML practitioners</li><li>Excellent written communication skills and ability to present technical content to non-technical audiences. Ability to partner with different functions to ensure that your solutions drive real business impact.</li><li>Experience in identifying tradeoffs, surfacing needs for clarity, and driving decision-making</li></ul><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46162-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013711", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46162"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
