{"id": 790298010748, "name": "Software Engineer 4", "location": "Sacramento, California, United States of America", "locations": ["Sacramento, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1711497600, "t_create": 1711497600, "ats_job_id": "JR27836", "display_job_id": "JR27836", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix has been on the leading edge of the cloud since beginning the migration to AWS 15 years ago and runs one of the largest Cloud footprints around. The Cloud Engineering organization exists to manage that massive scale, constantly innovating to increase fleet-wide agility, efficiency, and reliability of the Netflix cloud infrastructure, while solving scale problems that we are the first to ever hit. We build, operate, and maintain Compute, Network, and Storage services so that developers at Netflix can rely on foundational building blocks when entertaining hundreds of millions of customers around the world. Join us as we push the boundaries of performance and resilience, empowering developers to create groundbreaking applications on a reliable platform.</p><p><br /><br />We are looking to add new stunning colleagues to the teams outlined below.</p><p><br /><br />Team Spotlights:</p><p><br /><br />Cloud Gateway</p><p><br />The Cloud Gateway team provides a consistent traffic management story at the edge. We abstract out the complexity of resiliency, security, routing, and insights from application owners and their business logic. As a member of this team, you will own the feature set that Edge Proxy provides, comprising everything from low-level networking and incoming request processing to high-level product features directly impacting the customer experience. This role will have a broad impact and will allow you to partner with client teams, product teams, and cloud infrastructure teams.</p><p><br /><br />Network Services &amp; Insights</p><p><br />Network Services &amp; Insights re-architects the approach to managing and exposing modern cloud networking features, building on top of Netflix’s federated resource management platform. We apply time-tested software principles to develop a network management platform that is user-focused, intent-first, and built-in layers using composable modules with clear schemas and a single responsibility principle. The team connects the dots across other networking teams, products, and features to allow us to ship end-to-end experiences, not org charts. We additionally develop and operate some of Netflix’s largest distributed systems offering topology, health, and performance insights, solutions for the identification &amp; consumption of network resources, and structured network data access.</p><p><br /><br />Cloud Networking</p><p><br />Cloud Network Engineering owns all aspects of cloud-based networking for services at Netflix. Our goal is to create network architectures that can readily evolve to the needs of our product services and initiatives. We achieve this goal through the development of feature-rich tooling and services that improve network availability, security, and visibility while removing friction for our users.</p><p></p><p><br />Compute Abstractions</p><p><br />At Netflix, every engineer is responsible for building and delivering highly efficient, highly scalable products that meet a variety of business needs. In Compute Abstractions, we believe getting up and running in the cloud quickly should be the easiest step when setting out to solve some of the most interesting and complex problems in streaming today. Whatever your computing needs, GPUs, long-running services, or batch computing over many hours, we take the guesswork out of selection so you can trust you have the power and resources required to get the job done.</p><p></p><p><br />Compute Runtime</p><p><br />Every engineer at Netflix works under the “build it, run it” model and our job is to make it safe, easy, and performant for them to run what they build. We own the host-level foundation for Netflix’s server fleet: the customized base operating system and core services that enable the secure and efficient operation of hosts across Netflix. We build core services that enable the provisioning and operation of large server fleets and own the data plane of our centrally managed container platform, Titus.</p><p><br /><br />Compute CaP</p><p><br />With one of the world’s largest cloud footprints, Capacity strives to efficiently and reliably provide cloud resources for each of the thousands of microservices and batch workloads powering the Netflix experience, ensuring capacity is available when and where it is needed. Placement reliably and efficiently orchestrates and places workloads across Netflix’s global infrastructure by architecting, building, and operating the control plane for our multi-tenant kubernetes-based container platform. We push the boundaries of scale while maintaining high availability to meet our customer’s varied needs.</p><p><br /><br />Storage</p><p><br />Storage team focuses on providing storage and insights services to platforms, applications and users around the globe which are performant, secure and centrally managed; enabling platforms to move, store and efficiently archive data in the cloud. We offer a consistent mechanism to create &amp; manage object/block/file resources, integrate Netflix ecosystem for access control and provide observability into the cost &amp; lifecycle of these resources, by taking ownership of existing tools and shaping a more cohesive strategy. We manage storage at exabyte scale and enable Netflix to serve a huge amount of content around the globe.</p><p></p><p><br />Must-have skills:</p><ul><li>2-5 years of professional Software Engineering experience.</li><li>Recent and proficient experience with Java, C&#43;&#43;, Go, Python, or similar.</li><li>Experience building &amp; operating highly reliable distributed systems in a cloud environment.</li><li>Passion for technology, pragmatic thinking, ability to jump into an ambiguous area and break down complex problems.</li></ul><p></p><p>What you&#39;ll be doing:</p><ul><li>Building and operating Services, APIs, and Tooling for a variety of use-cases.</li><li>Balancing bias to action with the ability to make well-informed bets.</li><li>Engaging directly with end engineering users to understand their needs and improve their experience.</li><li>Understanding and solving business needs at scale with high-quality solutions.</li><li>Leaning into proactiveness and effective communication in pursuit of cross-functional alignment.</li></ul><p></p><p>Success criteria:</p><ul><li>You thrive in ambiguity; complex and fuzzy requirements are more common than clearly defined customer expectations.</li><li>You take incremental steps toward solving big problems; test-and-learn approaches work better than heads-down development.</li><li>You are independent and self-driven; progress is often self-directed by teams &amp; individuals.</li><li>You’ve read about <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">Netflix’s culture</a> and think you would thrive here.</li></ul><p></p><p>Here are a few recent talks and posts from members of the team to highlight the work we do:</p><p><br /><br />Keeping Netflix Reliable Using Prioritized Load Shedding<br />How Netflix uses eBPF Flow logs<br />NATless IPv6/IPv4 Address Translation<br />Consistent caching mechanisms in Titus Gateway<br />Netflix Drive <br />Zero Configuration Service Mesh with On-Demand Cluster Discovery</p><p><br /><br />Does this sound interesting? Or does this sound interesting-but-intimidating? Please don’t self-select out, let’s figure it out together. We’d love to talk to you!<br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27836-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010748", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27836"], "team": ["Engineering"], "posting_date": ["07-21-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
