{"id": 790298012393, "name": "Distributed Systems Engineer, Gen AI Platform L5", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721963039, "t_create": 1718064000, "ats_job_id": "AJRT46001", "display_job_id": "AJRT46001", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 270 million paid subscribers, and are expanding into new forms of entertainment such as gaming.  <br /><br />Within the Infrastructure Engineering organization, our Data Platform exists to maximize the value of data throughout Netflix by improving the productivity and innovation of Netflix engineers, data scientists, machine learning practitioners, and business users. Our Data Platform enables Netflix to scale effectively and evolve rapidly by providing highly performant, secure, compliant, and flexible data infrastructure that supports the expanding needs of the business. Ultimately, we aim to democratize data by making it more accessible and useful to technical and non-technical employees.<br /><br />The Opportunity<br /><br />The mission of the Gen AI Platform team is to boost the productivity of the data science and engineering community at Netflix. This means enabling users to spend more time solving business problems and less time engineering lower-level systems. We are seeking a senior software engineer to help build a developer platform that will provide the building blocks for Netflix to efficiently create GenAI applications. The platform will enable our teams to leverage LLM models and internally fine-tuned models. It will provide tools to support the LLM development lifecycle, high-level abstraction APIs for RAG, and tools for prompt engineering, management, and LLM operations.<br /><br /><br />What you will do:</p><ul><li>Design, build, and deploy APIs to access third-party large language models and internal fine-tuned ML models.</li><li>Develop frameworks and components for building GenAI applications.</li><li>Develop and maintain integrations between third-party products and the Netflix data platform solutions.</li><li>Lead cross-functional initiatives and collaborate with engineers, product managers, and technical program managers across teams.</li><li>Solve real business needs at scale by applying your software engineering and analytical problem-solving skills.</li><li>Rapidly iterate with users to improve product experiences while establishing foundational capabilities.</li></ul><p>Desired Background:</p><ul><li>8&#43; years of software engineering experience with a successful track record of delivering quality results</li><li>Strong interest and experience with the latest GenAI stack (LLMs, RAG, Agents/Tools) </li><li>Strong experience building SDKs and APIs for internal or external products</li><li>Strong software design and development fundamentals, with experience in building and operating scalable, observable, fault-tolerant, distributed systems</li><li>Proficiency in Java, GRPC, Python, Python package management tooling, and GraphQL</li><li>Experience in large-scale build, release, continuous integration/continuous deployment (CI/CD), and observability methods</li><li>Experience designing, building, and deploying ML applications</li></ul><p>At Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job family, background, skills, and experience to get it right. These considerations can cause your compensation to vary and will also depend on your location. <br /><br />The overall market range for roles in this area of Netflix is typically $100,000 - $700,000<br /><br />This market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy.<br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br /><br />Netflix is a unique culture and environment.  Learn more here.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46001-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012393", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46001"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
