{"id": 790298013122, "name": "Software Engineer 4 - Content Finance Foundations", "location": "Warsaw, Poland", "locations": ["Warsaw, Poland"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1716422400, "t_create": 1716422400, "ats_job_id": "AJRT45259", "display_job_id": "AJRT45259", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nOur team builds products to help Netflix plan, spend and account for the money we spend producing world-class, award-winning, high quality, and diverse content. The goal of our team is to provide accurate planning of our content budget, help production houses manage their production budget, accounting of content spend and reduce the risks associated with reporting of the content spend.\n\nWe work cross functionally with Engineering, Product, Design, and our Business Partners to build solutions for their needs. These systems help our business plan, account for, and operate all-things-finance for our productions. Our team is a diverse mix of talented engineers that work together building applications, core services, and systems on the Netflix Paved Path. We deeply care about our business partners and seek to understand the need and importance of what we’re working on.\n \nWe need your help to build the technologies that allow us to scale our efforts across the globe, and do so effectively and efficiently!\n \nThis role is based in Warsaw and our teams work in a hybrid-working model. \n\nWe are looking for both Level 4 and Level 5 Software Engineers to join our team.\nYour Day-to-Day <ul><li>Design and build systems and services for Netflix’s Content Finance using Java.</li><li>Work cross-functionally to build new services, tools and data models to operationalize our workflows at scale.</li><li>Participate in product reviews and team meetings, providing technical insight. Help scope, estimate, and prioritize between conflicting needs.</li><li>Evaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.</li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolve.</li><li>Participate in our on-call rotation and contribute to incident reviews.</li></ul> You may enjoy working with us if you: <ul><li>Are self-driven and highly motivated to deliver top-tier solutions with minimal guidance. You also recognize when you're wrong, learning from your mistakes and moving past them.</li><li>Love brainstorming with fellow Backend and UI engineers, product designers, and product managers, and directly with our users, to understand what they want, figure out what they really need, and finally, what we should build.</li><li>Strive to embrace best practices and are always searching for opportunities to continually improve.</li></ul> We would love to work with you if: <ul><li>You are adept at building applications with an Object Oriented language. We work with Java primarily, so interest in learning and coding in Java is desirable.</li><li>You excel in developing microservice-based distributed systems with high availability, throughput, fault tolerance, and performance.</li><li>You are experienced in utilizing relational and non-relational data stores.</li><li>You have previous experience in Media and Entertainment industry.&nbsp;</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT45259-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013122", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45259"], "team": ["Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
