{"id": 790298013652, "name": "Product Manager, Partner Products: Partner Ecosystem", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1721962070, "t_create": 1704672000, "ats_job_id": "JR27514", "display_job_id": "JR27514", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Connecting hundreds of millions of people around the globe with great entertainment requires not only amazing content but also strategic partnerships and product integrations that make it easy to access and enjoy Netflix. The Partner Product team tackles many hard problems that others struggle to solve and requires a  leader who can shape these experiences and the future of entertainment globally. \n\nThe Team \nAs a Partner Product Manager, you will be a key interface between the Product Innovation and Partnerships team, driving our Partner Product vision and roadmap to ensure best-in-class Netflix experiences across all partners and devices around the globe. You will work closely with global companies like Google, Apple, Samsung, Amazon, Microsoft and Sony, and a host of regional partners around the world. Internally, you will work with Partnerships, Design, Engineering, and Marketing teams to define and execute our strategy for how we are represented in our partner experiences (TV & mobile), what new products we support and what features we offer. This is a dynamic role with tremendous impact on how current and future members around the world will interact with Netflix. \n\nThis role is based in our Los Gatos office in a hybrid model.\nIn this role, you will have: <ul><li>Experience driving consumer-facing product features and roadmaps with a proven record of prioritizing and successfully launching impactful products or platforms.</li><li>Excellent written communication skills and ability to present to a variety of technical and non-technical cross-functional partners</li><li>5+ years of product management experience in related domain areas</li><li>Ability to partner with different functions to ensure that your solutions drive real business impact.&nbsp;</li><li>Strategic thinking and ability to incorporate larger business context into product solutions.</li><li>Strong judgment and welcome candid feedback as outlined in our <a href=\"http://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Culture Memo</a></li><li>Experience with approaching new ideas with a testing and innovation mindset and lean on data to inform decision-making</li><li>Familiarity with working in ambiguity. This role is fast-paced, fluid, and will frequently evolve based on partner, strategy, and product priorities.</li><li>The belief that great product and design are essential to a successful consumer service</li></ul> Successful applicants can come from many places, but will have combined product, business, strategy, technology, data and/or design backgrounds to create amazing consumer experiences.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $200,000 - $700,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27514-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013652", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27514"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
