{"id": 790298012975, "name": "Director of Product, Developer Platform", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Product Management", "business_unit": "Streaming", "t_update": 1707436800, "t_create": 1707436800, "ats_job_id": "JR27741", "display_job_id": "JR27741", "type": "ATS", "job_description": "Our Developer Platform is central to this approach, providing a comprehensive experience across the entire software lifecycle, from development to delivery to operations to maintenance. More than just a set of tools, the platform is designed to streamline the development process, making it more efficient and less burdensome. By evolving with the needs of our developers and business, the platform maximizes the efficiency and effectiveness of Netflix engineers, increasing their overall impact.\n\nThe Opportunity\nWe are looking for a Director of Product to drive the evolution of our Developer Platform. Your mission is to offer best-in-class experiences that empower and delight our software engineers, and simplify and accelerate their developer experience. You will lead the overall product vision and strategy for our Developer Platform, managing a team of experienced technical product managers who are responsible for different product domains within the platform. This pivotal role enables Netflix engineers to focus on our core mission: entertaining the world. Your contributions will directly shape the future of development, influencing how we innovate and deliver entertainment to millions worldwide.\n\nOur Developer Platform offers a comprehensive suite of tools and services encompassing the entire software development lifecycle. These include:\n\nDeveloper Experience: \nWe provide a unified front door, the Netflix Console, for easy software and infrastructure management. This includes product discovery, learning, provisioning workflows, software catalog, inventory management, change campaigns, and core services like search.\n\nDeveloper Foundations: \nWe optimize the inner development loop to keep developers in the flow, with development environments and tools like IDEs, source code management, repository management, project initialization, and CLIs.\n\nApplication Development: \nWe optimize application development by providing tools, frameworks, and libraries for specific personas and use cases (e.g., backend, frontend), including code authoring, build, test, and debug workflows, build systems, test frameworks, and more.\n\nContinuous Integration & Delivery: \nWe ensure safe delivery of changes from commit to production with robust, seamless integration of changes, delivery workflows and pipelines, global deployment orchestration, safe delivery and rollbacks, and fleetwide change orchestration.\n\nReliability & Resiliency: \nWe ensure operational excellence and highly reliable, resilient, scalable systems with incident management and product readiness tools, testing frameworks, automation, reporting & insights, and product infrastructure experimentation (e.g., canaries, shadow traffic, performance testing, failure injection testing, chaos experiments, etc).\n\nObservability: \nWe enable rapid issue detection and remediation with telemetry ingestion, storage, and querying of metrics, events, logs, and traces, monitoring and alerting, remediation, system health exploration and troubleshooting, and profiling and diagnostic tools.\n\nExamples of opportunities that you and your PMs might tackle include unifying the developer experience, providing holistic end-to-end workflows, managing more for users through higher levels of abstraction, reducing toil, optimizing cycle times, defining how we measure developer experience and productivity, and ensuring we provide best-in-industry tooling. The scope and impact of these roles is significant. You and your PMs will be responsible for managing a portfolio of products and driving holistic product strategy and prioritization across them.\n\nProduct Management is a newer team within Platform Engineering, and we're on a mission to elevate product thinking across the organization. This unique opportunity allows you to shape our product management practices and contribute significantly to our evolution.\n\nIf you’re looking for a deeply technical and highly dynamic opportunity that will have an outsized impact on the future of developer experience at Netflix, we’d love to talk to you!\n\nWhat You Will Do: <ul><li>Deeply understand customer needs, product analytics, and industry innovation to drive the product vision and strategy for Developer Platform, maximizing business and customer impact.</li><li>Lead, mentor, inspire, and grow a high-performance team of technical product managers, developing strategies, roadmaps, and specifications that prioritize the most impactful opportunities.</li><li>Collaborate with senior management to align vision, strategy, success metrics, and roadmaps.</li><li>Foster a collaborative environment with Netflix engineers, creating continuous feedback loops to ensure we're solving the right problems and driving maximum impact for Netflix.</li><li>Stay informed about industry advancements, influence their direction, and conduct comprehensive buy vs. build analysis to align with state-of-the-art solutions, encouraging ROI-based decisions.</li><li>Foster a metrics-driven environment that encourages quality experimentation and sets high standards for measuring product success.</li><li>Exhibit robust problem-solving and decision-making skills, tackling both technical and strategic challenges in innovative ways, and leveraging both data and intuition to make strategic choices in the face of ambiguity and complexity.</li><li>Ensure thoughtful product evolution that addresses product lifecycle and adoption experience.</li><li>Help evolve Platform Engineering’s customer engagement model, communication strategy, and prioritization and planning practices.</li><li>Collaborate with other product leaders across Platform Engineering and Netflix to evolve our practices and competencies in technical product management.</li></ul> What We’re Looking For: <ul><li>At least 5 years of experience managing a team of senior and staff technical product managers as a Director of Product, Group Product Manager, or similar role.</li><li>Proven track record of leading and scaling teams, managing and evolving a product portfolio, and driving product vision and strategy.</li><li>Deep technical knowledge paired with a customer-focused mindset and empathy.</li><li>Experience working on developer platforms with a solid understanding of the software development lifecycle and passion for developer experience and productivity.</li><li>Strategic thinker who can connect customer use cases to technology solutions and think holistically about end-to-end experience.</li><li>Ability to manage a portfolio of projects, balancing short-term goals with long-term vision in a rapidly changing environment.</li><li>Proficiency in using both qualitative and quantitative methods to define success, with a track record of making data-driven decisions.</li><li>Strong problem-solving skills with the ability to leverage product intuition and judgment to make informed decisions in scenarios where perfect information may not be available.</li><li>Insatiable curiosity, with a passion for learning new domains, keeping up with industry innovation, and constantly questioning the status quo.</li><li>Excellent communication skills with a knack for setting clear expectations.</li><li>Experience navigating and leading in a fast-paced, agile environment with rapidly shifting priorities.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $430,000 - $1,500,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nWe are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nOur culture is unique, and we live by our values, so it’s worth learning more about Netflix culture.\n\nMore About Developer Platform @ Netflix\nFull Cycle Developers at Netflix -- Operate What You Build (techblog)\nUnifying the Netflix engineering experience with a federated platform console (video)\nTelltale: Netflix Application Monitoring Simplified (techblog)\nMachine Learning for a Better Developer Experience (techblog)\nManaged Delivery: Bringing Infrastructure as Code to Spinnaker (video)<p style=\"text-align:inherit\"></p>", "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012975"}
