{"id": 790298012343, "name": "Machine Learning Intern, Research (Fall 2024)", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America", "Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1719964800, "t_create": 1719964800, "ats_job_id": "JR28587", "display_job_id": "JR28587", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix is reinventing entertainment from end to end. We are revolutionizing how shows and movies are produced, pushing technological boundaries to efficiently deliver streaming video at massive scale over the internet, and continuously improving the personalization of how entertainment is presented to our more than 270 million members around the globe. <br /><br />Applied Machine Learning Research at Netflix improves various aspects of our business, including personalization algorithms, search, systems optimization, content valuation, tooling for artists, and streaming video optimization. As such, our research spans many Machine Learning areas, including recommender systems, causal inference, reinforcement learning, computer vision, computer graphics, image and video processing, natural language processing, optimization, operations research and systems. Great applied research also requires great Machine Learning infrastructure,  another large area of emphasis at Netflix.<br /><br />In Fall 2024, Netflix will be hosting a cohort of of Machine Learning Research interns within a specific set of areas listed below.<br /><br />We are looking for individuals with the following qualifications:<br /> </p><p><b>Must have:</b></p><ul><li>Currently enrolled PhD or MS student in the Machine Learning space, or PhD graduate seeking postdoctoral research.</li><li>Experience with at least one of the following ML areas:</li><li>Personalization &amp; Recommender Systems: using transformers for recommenders, multi-modal recommenders, conversational recommenders</li><li>Natural Language Processing (NLP): Large Language Models (LLMs), fine-tuning, in-context learning, text generation and embedding</li><li>Computer Vision (CV): Image and video processing and generation</li><li>Reinforcement Learning (RL): Preference-based learning, reinforcement learning from human feedback</li><li>Multimodal Data: Handling and integrating text, image, video, and other data</li><li>Model Optimization and Efficiency: Inference efficiency, model benchmarking, optimization techniques.</li><li>Experience programming in at least one programming language (e.g. Python or C/C&#43;&#43;).Experience developing ML models using common frameworks (e.g. PyTorch, TensorFlow, Keras) and training on GPUs</li><li>Curious, self-motivated, and excited about solving open-ended challenges at Netflix.</li><li>Great communication skills, both oral and written.</li></ul><p></p><p><b>Nice to have:</b></p><ul><li>Publications in relevant topics in top conferences or journals.</li><li>Comfortable with distributed computing environments such as Spark or Presto.</li><li>Comfortable with software engineering best practices (e.g. version control, testing, code review, etc.)</li></ul><p></p><p><b>For your application to be considered complete:</b></p><ul><li>You will be sent an Airtable form shortly after you submit your application on our careers site (1-5 business days); your application will not be considered complete until you fill out and submit this form.</li><li>Include a Resume or CV with complete contact information (email, phone, mailing address) and a list of relevant coursework and publications (if applicable). </li><li>In the Airtable form, you will be asked to select exactly one ML area for your potential internship. This will be used to map your application to particular teams &amp; projects.</li><li>You will be asked to include a short (max one page) statement describing your research experiences and interests, and (optionally) their relevance to Netflix Research. For inspiration, have a look at the Netflix research site.</li></ul><p></p><p><b>The Netflix Internship:</b><br /><br />At Netflix, we offer a personalized experience for interns, and our aim is to offer an experience that mimics what it is like to actually work here. We match qualified interns with projects and groups based on interests and skill sets, and fully embed interns within those groups for the summer. Netflix is a unique place to work and we live by our values, so it&#39;s worth learning more about our culture.<br /><br />Internships are paid and are a typically a duration of 12 weeks, with a choice of a few fixed start dates in September or October to accommodate varying program calendars. Conditions permitting, the internship will be located in our Los Gatos, CA office, or in our Los Angeles, CA office, depending on the team.<br /><br />At Netflix, we carefully consider a wide range of compensation factors to determine internship top of market. We use on market indicators to determine compensation and consider your specific internship team, degree, and years of education to get it right. These considerations can cause your compensation to vary and will also be dependent on your location. <br /><br />The overall market range for Netflix Internships is typically $40/hour - $110/hour.<br /><br />This market range is based on total compensation (vs. only hourly rate), which is in line with our compensation philosophy. Netflix is a unique culture and environment. Learn more here.<br /><br />Apply now and help us shape the future of entertainment at Netflix!</p><p><br /><i><b>Application Deadline: August 4th, 2024</b></i></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28587-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012343", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28587"], "team": ["Data Science & Engineering"], "posting_date": ["07-21-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
