{"id": 790298013642, "name": "Product Manager, Content Finance", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1721996005, "t_create": 1718928000, "ats_job_id": "AJRT46158", "display_job_id": "AJRT46158", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading streaming entertainment services, with 270 million paid memberships in over 190 countries. Members enjoy TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can play, pause, and resume watching as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Content and Business Product organization is a key driver of this growth. We build solutions that fuel the operations and insights needed to plan, produce, and promote great content at Netflix, empowering our global teams to constantly delight our members! Every year, Netflix spends billions producing content, and our Content Finance teams are involved throughout the lifecycle. We’re looking for a Product Manager to join the Content Finance Product team as we build products to forecast and optimize this large content spend and manage content financials at Netflix.\n\nAs a strategic product leader for our financial systems, you will be responsible for building products to forecast Netflix's content spend and working across a broad range of internal teams. We seek someone who can fluidly move amongst our end users and product development teams, applying strong product principles and strategic frameworks while being equally as excited about driving financial accuracy as you are about seamless user experiences.\n\nThis role can be based in our Los Gatos or Los Angeles office in a hybrid model or remote-based in the US. This role will require travel to Los Gatos and Los Angeles at least 1-2 times per month.\nAs a Product Manager at Netflix, you will: <ul><li>Build a strategic roadmap and take product concepts from ideas through validation, shipping, measurement, and iteration.</li><li>Author strategy memos and presentations and represent your team’s work to senior executives.</li><li>Lead a team of stunning colleagues across design, engineering, and data science to deliver outstanding products to our customers.&nbsp;</li><li>Build business cases and measure the impact of your product innovation.</li><li>Deeply understand and socialize the evolving needs of our customers, with your design partners.</li></ul> As the Product Manager on the Content Finance team, you will be responsible for: <ul><li>Define the product vision and strategy for Content planning and strategy products, measure business performance, and partner effectively across the company to drive a higher ROI.</li><li>Partner with our Finance & Content & Business Product teams to dissect current workflows and leverage custom technology and off-the-shelf offerings to enable financial forecasting and reporting at scale</li><li>Develop and deliver a roadmap that balances the needs of our partner teams and prioritizes what is most impactful for the business.</li><li>Lead cross-functional teams including design, engineering, and data science to discover and execute opportunities.</li><li>Communicate your strategy broadly throughout the organization.</li></ul> Our wish list (remember, no one ever gets everything on their wish list!): <ul><li>Minimum of 3-5 years of Product Management experience with a proven record of prioritizing and successfully launching products or platforms.</li><li>Experience with building or implementing enterprise financial applications and a strong understanding of operational finance activities, such as budgeting and forecasting, cash planning, or procurement.</li><li>Experience with products that have directly used ML/AI technologies.</li><li>Ability to inspire, motivate, and lead a cross-functional team: your ability to build strong relationships is critical to success in this role.&nbsp;</li><li>Experience using data to inform priorities and evaluate the impact of initiatives.</li><li>Excellent verbal and written communication skills - you will write a lot!</li><li>Experience working on internal products or B2B enterprise products.</li><li>Has strong instincts for outstanding customer experience.</li><li>Embodying the Netflix values while also bringing a new perspective to improve our culture, we strongly believe that diversity of experiences, perspectives, and backgrounds will lead to a better environment for our employees and better products for our customers.&nbsp;</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46158-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013642", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46158"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
