{"id": 790298013167, "name": "Senior Product Designer, Payments", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1715558400, "t_create": 1715558400, "ats_job_id": "JR28231", "display_job_id": "JR28231", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix, the world's leading streaming entertainment service, reaches over 230 million paid memberships across 190 countries. As we expand our original productions and licensed content globally, scaling our business and creating value across diverse markets and user segments becomes paramount.\n\nAt Netflix, Payments is vital for ensuring members stay and sign up hassle-free. Our team crafts a scalable, seamless and largely familiar payments experience, across a range of locally preferred methods of payment (MOPs) that in turn drive incremental paid member growth and long-term revenue.\n\nAbout the Role\n\nAs a Senior Product Designer within our Growth Team, you'll shape consumer payment experience on Netflix across all commerce use cases. Your responsibility is crafting intuitive, frictionless, and engaging payment journeys that resonate with our diverse global audience. This role extends beyond interface design to drive member engagement and retention.\nAbout You <ul><li>Natural leader with exceptional communication skills</li><li>Comfortable navigating ambiguity</li><li>Ability to collaborate with multiple stakeholders to solve problems</li><li>Capable of driving vision and change in established domains</li><li>Skilled at simplifying complex workflows into intuitive design solutions</li><li>Strategic balance between short-term feature building and long-term team goals</li><li>Proficiency in identifying patterns and streamlining workflows across vertical content teams</li></ul> Responsibilities <ul><li>Collaborate with cross-functional teams to define and execute growth initiatives</li><li>Deep dive into global payment systems and user behaviors</li><li>Lead design process from concept to implementation</li><li>Advocate for user needs through research and usability testing</li><li>Champion design-centered product enhancements</li><li>Stay updated on industry trends and best practices</li><li>Develop relationships with global stakeholders and ensure cohesive product experiences</li></ul> Must Haves <ul><li>7+ years of UX/UI design experience, demonstrating proficiency in creating intuitive and engaging user experiences.</li><li>Strong background in payments or e-commerce, with a deep understanding of industry trends and best practices.</li><li>Direct experience in successfully scaling payment solutions in both global and emerging markets, showcasing the ability to adapt strategies to diverse cultural and regulatory landscapes.</li><li>Knowledge or hands-on experience with mobile payments, payment processing, and fraud detection, including familiarity with industry standards and emerging technologies.</li><li>A robust portfolio showcasing exceptional problem-solving abilities and a keen eye for detail in crafting user-centric designs that drive positive outcomes.</li><li>Demonstrated sense of accountability and a track record of fostering responsibility within cross-functional teams, leading to successful project delivery.</li><li>Excellent communication, collaboration, and influence skills, enabling effective interaction with internal stakeholders and external partners across different regions and cultures.</li><li>Genuine eagerness to contribute to high-impact projects and a commitment to knowledge-sharing and continuous learning within the organization.</li></ul> \n\nWhy Join Us\n\nThis role offers a unique opportunity to blend design, technology, and human behavior. While the challenges are complex, they're what make the role exciting and rewarding. Join our supportive and collaborative team, where your ideas are valued, and your impact is tangible. If you're ready to shape the future of entertainment, we'd love to hear from you.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28231-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013167", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28231"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
