{"id": 790298013193, "name": "Data Scientist - India", "location": "Mumbai, Maharashtra, India", "locations": ["Mumbai, Maharashtra, India"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1714348800, "t_create": 1714348800, "ats_job_id": "AJRT43368", "display_job_id": "AJRT43368", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as the want, anytime, anywhere, and can change their plans at any time.\n\nOur mission to entertain the world is anchored in our content, and data is a crucial component in shaping our comprehensive content strategy. We focus on creating analytical products that support our content partners in their complex and nuanced decision-making processes. We are a highly collaborative team that partners across Netflix to drive impact.\n\nWe are seeking a talented Senior Data Scientist to provide key insights to our content decision makers in India. You will generate insights by scoping and executing deep dive analysis with local partner analytics teams, Consumer Insights and Finance & Strategy. In success, you will collaborate on existing priorities but also will propose and execute on new opportunities. This role features ample opportunity for project ownership and will support impactful decision-making. \nIn this role you will <ul><li>Be a strategic thought partner with business stakeholders to define high impact analytical problems and innovative ways to solve them with data.</li><li>Develop statistical models explaining viewership, content engagement, and other key behavioral patterns</li><li>Build dashboards and visualization that enables stakeholders to self-serve metrics and trends effectively. </li><li>Actively socialize and educate, aiding on interpretation</li><li>Translate analytic insights into actionable recommendations for business or content improvement, and communicate these findings clearly to a broad audienceIdentify and proactively socialize regional insights, including those that may generalize to opportunities in other markets</li></ul> What you will bring <ul><li>Exceptional interpersonal and communication skills to influence stakeholders using clear insights and recommendations</li><li>Exceptional thought partnership to build credibility and relationships with stakeholders</li><li>Strong statistical knowledge: understanding of predictive modeling; ability to tease out incrementality vs. correlations, confounder identification and amelioration, etc.</li><li>Basic understanding of experimentation including power calculations and interpretation of results</li><li>Strong SQL skills and experience with distributed analytic processing technologies (S3, Presto, Hive & Spark)</li><li>Strong skills in Python or R</li><li>Highly effective in engaging with diverse stakeholders and adept at cultivating strong partnerships. P</li><li>assionate about communicating difficult concepts to non-technical audiencesSelf-starter who thrives under a high level of autonomy.</li><li>Exceptional interpersonal and communication skills.</li><li>Enthusiastic about Netflix culture</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT43368-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013193", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43368"], "team": ["Data Science & Engineering"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
