{"id": 790298012360, "name": "Director, Business Development, Game Licensing", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Games", "business_unit": "Streaming", "t_update": 1710806400, "t_create": 1710806400, "ats_job_id": "AJRT27289", "display_job_id": "AJRT27289", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is the world's leading internet entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and games across a wide variety of genres and languages.  Netflix members can watch as much as they want, anytime, anywhere, and now they are able to download and play games anytime, anywhere with a collection of Netflix curated and produced games.\n\nAbout the Job\n\n​​The Director of Game Licensing will report to, and work closely with, the Senior Director of Portfolio Strategy and Content Acquisition to devise and implement the game licensing strategy and execution plan across Netflix's External Games business that will touch licensed, Netflix-owned, and co-published games, high impact marketing activations and Netflix IP integrations with top tier third party game companies.\n\nThis individual will also oversee the operations and production of a variety of licensed game projects partnering with our Marketing, Production, Comms and Content teams.  Together you will build a successful catalogue of outbound licensed content, entertaining our members across the globe.\n\nAs a business development leader, you will be responsible for guiding game licensing programming strategies, exploring, managing and maximizing the commercialization of intellectual properties through collaborative partnerships with external partners, defining the right rules of engagement, collaborating with Netflix’s senior leadership on the Company's growth strategy across all of its Gaming businesses, and helping scale the value proposition of Netflix gaming via the right set of partners. You will work closely with game production, live-ops, transmedia, marketing, content, product, comms, strategy and analytics, legal, among others, to deliver results.\nResponsibilities <ul><li>Build and direct the execution, tone, and vision for the External Games team’s licensing programs.</li><li>Develop category and distribution strategies that maximize our title and portfolio output, achieving a balance between driving consumer demand (a proxy for fan joy) and delivering meaningful impact.</li><li>Own the overall production strategy for all External Games team’s game licensing projects, including pipelines and processes, to ensure Producers have everything they need to serve players, developers, and internal partners.</li><li>Manage a team of Producers, supporting them in their role as our external developer’s and internal partner’s primary point of contact.</li><li>Mentor and lead Producers, creating growth and opportunities for their success, while maintaining a balanced production capacity.</li><li>Act as a senior thought leader and develop high-impact, high-priority game marketing activations outside of Netflix that help drive conversation around our biggest IP Franchises.</li><li>Constantly analyze the rapidly evolving video game landscape, finding new opportunities for licensing deals and partnership opportunities that will support the growth of Netflix properties.</li><li>Evaluate, negotiate, and close key game licensing deals across Netflix IP that will help grow the footprint of Netflix Gaming with creators and developers of all sizes.</li><li>Demonstrate fluency in the most complex legal and business issues in contracts and develop creative win-win solutions with our partners.</li><li>Quickly develop expertise in each of the relevant licensed categories and act as the resource for these categories. This includes developing a thorough understanding of the product line, the market, competitors, and all capabilities of the licensee.</li><li>Collaborate with our Transmedia team to help expand Netflix’s ever-growing IP catalogue in the digital gaming space via key strategic partnerships with top global gaming companies.</li><li>Be agile and execute across a quickly evolving range of products.</li><li>Collaborate with a broad range of internal constituents to help define go-to-market strategies and drive sign-off from internal leadership.</li></ul> Qualifications <ul><li>10+ years of licensing experience in the games industry across all major categories.</li><li>5+ years experience in game production with experience shipping multiple games (social, F2P, mobile, web, console, handheld).</li><li>Proven track record with scaling businesses, including established and nascent brands.</li><li>Strong experience sourcing in a gaming environment with a demonstrated track record of helping drive a broad range of PC, console and mobile-focused game partnership deals.</li><li>High-level expertise in negotiation and deal construction including the legal aspects of negotiations.</li><li>Strong program/project management skills with successful delivery of quality, drive planning, schedules, estimates, budgeting, resource plans and status reports.&nbsp;</li><li>Thorough understanding of the product development process.</li><li>Experience learning quickly about new technologies and distilling information into actionable insights for internal stakeholders.</li><li>Experience successfully navigating a fast-paced, highly ambiguous environment.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $220,000 - $900,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT27289-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012360", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT27289"], "team": ["Games"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
