{"id": 790298014018, "name": "Senior Manager, FS&A, Games", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1695340800, "t_create": 1695340800, "ats_job_id": "JR27225", "display_job_id": "JR27225", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nNetflix connects people all over the globe with movies, television, and now video games by pairing outstanding content with technological innovation. This is your chance to be at the forefront of our new Gaming offering. \n \nMembers have always been able to watch as much as they want, anytime, anywhere, and now they can also download and play mobile games anytime, anywhere with a collection of Netflix curated and produced games. At Netflix, we have a perpetual need to improve our product experience and the creative elements that support it; this role sits at the center of these efforts.\n\nThe Gaming Finance, Strategy & Analysis (FS&A) team develops strategic insights to advance the company’s gaming initiative and is primarily responsible for programming strategy, performance/audience insights, competitive analyses, and metric development. Executives and senior management depend heavily on our team to accurately assess, contextualize, and forecast the business and lead the strategic analysis that is used to inform critical business decisions.\n\nIn this role, you will need to be a self-starter, an analytical thought partner with a keen eye for detail, and have proven skills and experiences as a cross-functional partner. You must thrive in a fast-paced environment, possess a high level of intellectual curiosity, and embrace ambiguity. You must be an expert communicator who is able to convey complex ideas using both qualitative and quantitative means to effectively work with a broad spectrum of stakeholders.\n\nResponsibilities: <ul><li>Preparing valuation analyses (model building, scenario testing) to support deal-making decisions and negotiations.</li><li>Developing insightful presentations that summarize key data, identify underlying trends, and ultimately result in actionable strategic recommendations.</li><li>Conducting market research and competitive trends analyses and summarizing them for a senior executive-level audience.</li><li>Working cross-functionally with our Data Science, Consumer Insights, and other data-driven partner teams to develop new metrics and track them through dashboarding and reporting.</li><li>Collaborating directly with top leaders in the Gaming organization: expertly delivering on their requests, translating their high-level thoughts into actionable strategies with measurable goals, and assisting in socializing these strategies and coordinating execution across a diverse set of stakeholders.</li><li>Developing, evangelizing, and implementing strategic frameworks to help our executives and stakeholders make informed decisions and evaluate critical trade-offs for this nascent vertical.&nbsp;&nbsp;</li><li>Netflix Gaming is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. You must be motivated, disciplined, and able to work effectively autonomously.</li></ul><div><br></div> Qualifications: <ul><li>10+ years of work experience in a highly analytical role, ideally in investment banking, management consulting, or in a strategy & operations-focused role at a top-tier gaming or technology company.</li><li>Relevant experience in gaming, particularly in mobile, is <b>required.</b></li><li>Strong passion for Netflix IP and the entertainment industry at large.</li><li>Experience conducting quantitative analyses (including modeling) and qualitative analyses that can drive insights and results.</li><li>Excellent communication/presentation skills with a track record of presenting complex analyses to senior management clearly and concisely.</li><li>Excellent writing skills, and the ability to communicate complex data & analysis concisely.</li><li>Strong initiative and ability to work independently; must thrive in a fast-paced, always-changing environment.</li><li>Highly intellectually curious, has the courage to challenge the status quo, and exhibits the highest personal and professional standards of integrity and ethics.</li><li>Bachelor's degree with an emphasis on coursework of a quantitative nature, preferably Business, Economics, or Statistics.</li><li>MBA is a strong plus.</li><li>Passion for gaming is critical.</li><li>Excellent proficiency with MS Excel / PowerPoint (and ideally their Google Suite counterparts).</li><li>Nice to have: Experience with Tableau, SQL, Data.ai, Sensor Tower.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $470,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27225-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014018", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27225"], "team": ["Finance & Accounting"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
