{"id": 790298013989, "name": "Manager, Social - Multicultural", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1718323200, "t_create": 1718323200, "ats_job_id": "JR28429", "display_job_id": "JR28429", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Opportunity\n\nWe are looking for a candidate to be a part of a social media team that focuses on connecting Netflix with multicultural audiences. This role will build and execute tailored, culturally relevant, and innovative social marketing campaigns that authentically reach and resonate with LGBTQ+ audiences across our original films, series, and licensed content. They will collaborate cross-functionally to align social strategies with overarching marketing goals, effectively communicate these goals to partners, and create content to engage with these key audiences across multiple social channels and platforms. \n\nThis is an exciting hands-on role that requires passion and deep knowledge of LGBTQ+ communities and cultural zeitgeist, as well as the ability to translate these insights into compelling social creative that fuels fandom for Netflix titles, slate and brand. It involves a diverse array of tasks, from crafting high-level strategies to developing best-in-class social content that spans from turnkey reactive to longer form formats to coordinating within the company. \n\nThe ideal candidate will have a social media background, entertainment experience, and excellent editorial judgment to balance the needs of the audience with the needs of our business. They will have experience working with executives, filmmakers, showrunners, talent, talent representatives, agencies and production partners. It is necessary to have strong strategic vision, sharp copy-writing skills, and the ability to work collaboratively with multiple teams.\nKey Responsibilities: <ul><li>Develop and execute social strategy to reach LGBTQ+ audiences across platforms, including Instagram, TikTok, Facebook, Twitter/X, Tumblr, YouTube and more.&nbsp;</li><li>Responsible for building social strategy for relevant Netflix films & series, aligned with the overall marketing campaign strategy. This is inclusive of target audience, social creative, content distribution across the Netflix social ecosystem and, if necessary, the creation of title social pages.</li><li>Manage internal and agency resources to execute title and slate social campaigns at every stage from ideation through production and distribution.&nbsp;&nbsp;</li><li>Work with key cross-functional partners including Creative Marketing, Publicity, Paid Media, Events and more, to build social strategy that supports business priorities as they relate to the LGBTQ+ audience.&nbsp;</li><li>Develop multi-title promotional narratives based on audience behavior and need states as well as existing channel tentpoles.</li><li>Use internal and external social analytics and other internal data to inform strategy, iterate creative, and constantly learn to improve future campaigns.</li><li>Main point of contact regarding social strategy and social creative across Marketing, Publicity, Content, and other teams working against single title or slate-level initiatives focused on the LGBTQ+ audience.</li></ul> Background and Specific Skills: <ul><li>Experience working on broad, multiple-platform marketing campaigns and delivering nuanced, insight-based social strategies.&nbsp;</li><li>Knowledge of what works across various social platforms and experience in multi-channel distribution efforts.</li><li>Background and affinity for LGBTQ+ entertainment and pop culture spaces</li><li>Entrepreneurial spirit and highly collaborative - loves working with others, isn’t afraid to lead or follow.</li><li>Excellent written and verbal communication skills.</li><li>Experience using data and intuition to make content that grabs attention and engages its audience. Strong on social media analytics, but isn’t afraid to take big risks.</li><li>Must be able to prioritize and handle several projects at the same time in a fast-paced environment while adhering to shifting deadlines.</li><li>Able to build strong relationships and work across many internal cross-functional teams.&nbsp;</li><li>Experience working directly with filmmakers and is skilled in pitching/ presenting with the ability to read the room.&nbsp;</li><li>High tolerance for change, and the capacity to accomplish enormous amounts of work in a fast-paced, ever-changing environment.</li><li>Respect, understanding, and enthusiasm for Netflix culture.&nbsp;</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $360,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28429-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013989", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28429"], "team": ["Marketing"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
