{"id": 790298014634, "name": "Senior Research Analyst, Consumer Insights", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Consumer Insights", "business_unit": "Streaming", "t_update": 1715040000, "t_create": 1715040000, "ats_job_id": "AJRT45678", "display_job_id": "AJRT45678", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries, enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Quantitative & Screening Operations Pod sits in Consumer Insights and our mission is to build solutions for quantitative research projects and programs. This includes partnerships on custom quantitative research projects, global trackers, and online screenings. We employ best practices alongside innovative methodologies to capture the voice of the consumer. \n\nWe are looking for a stunning Senior Research Analyst to join the CI Core Group. CI-Core focuses on primary research execution and maintaining quality standards for our ongoing research projects. This role will partner with Core, Research Program Managers, and Consumer Insights Researchers to execute internal research projects. It will also identify and drive opportunities to innovate and build efficiency in internal member sampling and sampling workstreams. \n\nIn this role, you will leverage your: <ul><li><b>Strategic Thinking: </b>An insatiable business & research curiosity lays the foundation for you to proactively think through sampling to enable qualitative & quantitative programs in partnership with Researchers and Program Managers.&nbsp;</li><li><b>Familiarity in Consumer Research:</b> Using your knowledge of qualitative and quantitative research methods, you will decipher and translate research questions and lead sampling strategies in the consumer research context.&nbsp;</li><li><b>Sampling & Analytical Skills: </b>To effectively plan and execute research sampling across a global research team, managing multiple & diverse work streams at one time.</li><li><b>Project Management Skills: </b>Develop and lead end-to-end workflows for sampling and messaging members for research purposes. This includes leading recurring meetings with Program Managers, initiating kick-off meetings with Researchers, and proactively managing a project pipeline.</li><li><b>Global First Mentality:</b> Take a regionally minded approach to designing best-fit tools and methodologies to deliver impactful insights (vs replicating or modifying a US-centric approach).</li></ul> About you: <ul><li>Experience with messaging data & knowledge of response rates and bias in consumer research.</li><li>Research familiarity working with qualitative and quantitative methods, trend data, cross-sectional data, and integrating data across different sources to achieve the research objective.</li><li>Strong track record of partnering with stakeholders to translate complex business problems into reliable analytic solutions.</li><li>Strong quantitative reasoning and analytical skills with programming knowledge & experience using survey software (eg. Decipher/Focus Vision, Qualtrics, etc).</li><li>Advanced ability to leverage SQL (5+ years) to extract and combine disparate data sources is required.</li><li>Familiarity with Tableau, R, Python, SAS, STATA, or similar programming languages is a plus.</li><li>Experience planning, developing, and maintaining research, data, and related databases and systems.</li><li>Strong written and verbal communication skills and excellent organizational skills.</li><li>Strong multitasking capabilities and the ability to work successfully in an environment of tight timeframes and constant change.</li><li>Familiar with statistical methodologies such as randomized sampling, power analysis & hypothesis testing. Familiar with the benefits and limitations of research practices.</li><li>Bachelor's degree or relevant experience.</li></ul> Key Focus Areas: <ul><li>Lead research sampling execution across the Consumer Insights team with an understanding of both Quantitative and Qualitative consumer research methods.</li><li>Define data requirements, gather and validates information, applies judgment and statistical tests to support the execution of consumer research.</li><li>Plans, executes, interprets and evaluate original research projects involving complex experimental designs in the field of behavioral and social sciences.</li><li>Combining disparate data sets using SQL, to assist in the day-to-day operations of the Consumer Insights team at Netflix.</li><li>Leverage analytic thinking & experience working with big data to target, curate, and stratify samples for research projects.</li><li>Partner with Researchers, Research Program Managers, Data Scientists, and Engineers to develop best practices in research recruitment strategy & allocation.</li><li>Partner with researchers to contextualize and present data in compelling graphics for stakeholders and decision-makers.</li><li>Leverage Member sample health monitoring tools to advise on sampling trends and best practices in various countries to maximize response rates and preserve sample.</li><li>Provide guidance on the feasibility of research considering various system constraints and data limitations.</li><li>Support post-field analytics problems by providing custom data appends and enriching the analysis of our research.</li><li>Pre-field behavioral data exploration to support the research hypothesis and core develop research objectives.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $130,000 - $470,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45678-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014634", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45678"], "team": ["Consumer Insights"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
