{"id": 790298014050, "name": "TPM Director", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1714953600, "t_create": 1714953600, "ats_job_id": "JR27664", "display_job_id": "JR27664", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is revolutionizing entertainment. We connect people with movies and television globally by delivering outstanding content and technological innovation. \n\nInfrastructure Engineering provides the backbone for Netflix products (SVOD, Live, Games, etc.) by building and operating an efficient, scalable, secure, and easy-to-use development platform and content delivery network. Join us as we push the boundaries of scale, performance, and resilience, empowering developers to create groundbreaking applications on a reliable platform.\n\nOur Technical Program Management (TPM) team is chartered with driving Infrastructure Engineering’s most challenging and cross-functional initiatives. Our TPMs are technically adept and partner directly with product and engineering functions to align and mobilize teams to deliver high impact business outcomes. The team has grown organically over the last few years and we are looking for an experienced leader to coach, mentor, and grow our TPMs, while also shaping the vision and strategy of the TPM function.\n\nWe are seeking a Director of TPM to drive the evolution of the TPM function within Infrastructure Engineering. You will lead our TPM team's overall vision and strategy, which is focused on establishing the right-sized practices and rituals for the organization and the TPM team to create operational excellence within the organization and across Engineering. Your contributions will directly shape how Infrastructure Engineering operates and delivers the critical platforms and products needed for the Netflix Engineering community. \nResponsibilities <ul><li>Lead, grow, and mentor a team of Staff+ Technical Program Managers building an environment of teamwork, trust, and mutual success</li><li>Deeply understand business and technical strategy to proactively identify high-impact programs</li><li>Develop KPIs to measure the effectiveness of programs and establish frameworks using program management principles that foster high-quality, metrics-driven program delivery&nbsp;</li><li>Partner with product and engineering teams to drive alignment, prioritization, and&nbsp;critical decision-making with internal partners and stakeholders&nbsp;</li><li>Navigate diverse stakeholder groups, forming and sustaining trusted relationships</li><li>Work directly with Engineering and Product leadership to define and shape the execution strategy for our critical bets</li><li>Define and manage the operating rhythms for the Engineering org - planning, program management, partnership syncs, etc.</li><li>Influence leaders and teams to effect change across Netflix Engineering</li><li>Be a catalyst for change within Infrastructure Engineering</li></ul> Requirements <ul><li>15+ Years of experience in managing engineering or TPM teams and designing large-scale or complex technical initiatives on shared infrastructure platforms</li><li>5+ Years in building and improving common platforms including AWS cloud products, CI/CD tooling (Github, Circle CI, JFrog, EKS), messaging (Kafka), and storage (Redis, Cassandra, Aurora, MySQL)</li><li>Experience leading and mentoring TPMs</li><li>Flexible, agile, and fast learner</li><li>Excellent cross-group collaboration, outstanding verbal and written communication</li><li>Someone looking to make a large impact in their next role</li></ul> What Sets You Apart <ul><li>Self-starter who enjoys quickly bringing organization and direction</li><li>Exemplify the <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Netflix culture</a> by understanding, advocating, and demonstrating its values</li><li>Able to identify gaps in solutions and weigh in on product vs. technology tradeoffs</li><li>Deep understanding of cloud infrastructure, especially microservice or distributed systems architecture</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $310k-$1.8M.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27664-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014050", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27664"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
