{"id": 790298013216, "name": "Account Manager - Australia", "location": "Pyrmont, New South Wales, Australia", "locations": ["Pyrmont, New South Wales, Australia"], "hot": 0, "department": "Sales And Business Development", "business_unit": "Streaming", "t_update": 1721347200, "t_create": 1721347200, "ats_job_id": "AJRT46588", "display_job_id": "AJRT46588", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service with over 270 million paid memberships in over 190 countries. Our mission is to entertain the world and we are constantly innovating to bring the best stories from around the world to our members. With the incredible launch of our ad supported model, we are now working toward providing more choices for consumers and a premium brand experience for advertisers. \n\nNetflix is seeking an Account Manager who will be an exceptional addition to our growing Netflix Ads team.  The Account Manager will be responsible for leading the pre-to-post sale campaign execution workflow as a strategic partner to Netflix Sales Partner(s).   Our Account Managers will partner with clients and sales on RFP responses, media plan generation, campaign execution and monitoring delivery performance to ensure flawless execution and excellent client service.  \nKey Responsibilities: <ul><li>Partner with aligned Sales Partners to understand client goals and objectives in order to deliver excellent customer service</li><li>Host weekly Pipeline &amp; Pacing meetings with Sales Partners to align on upcoming launches and active campaign performance&nbsp;</li><li>Build Media Plans and contribute to RFP responses around campaign packaging, pricing, targeting, etc.&nbsp;</li><li>Host campaign kick-off meetings and partner with client on gathering campaign launch assets&nbsp;</li><li>Partner with cross-functional teams on the production of custom creative assets&nbsp;&nbsp;</li><li>Work closely with Ad Operations for flawless order implementation and technical troubleshooting</li><li>Responsible for overseeing the delivery performance of Ad Campaigns and partnering with clients on necessary campaign optimization tactics&nbsp;</li><li>Provide clients with necessary campaign performance including post-campaign wrap reports&nbsp;</li><li>Ability to navigate campaign escalations and contribute to long-term solutions to prevent similar issues in the future</li><li>Maintain an in-depth understanding of our ad products, sponsorship offerings, targeting capabilities and ad policies&nbsp;</li><li>Contribute to monthly billing &amp; invoicing&nbsp; process with clients and finance&nbsp;</li><li>Establish strong working relationships with client and agency partners</li></ul> We’re Looking for: <ul><li>3+ years of experience in Account Management and/or Sales Planning functions in the digital media industry, with a focus on video advertising</li><li>Experience working in Sales Operation systems (CRM, OMS, Ad Servers)&nbsp;</li><li>Knowledge of digital media sales and marketplaces including Direct IO, Programmatic Guaranteed and PMP advertising</li><li>Excellent verbal and written communication skills&nbsp;</li><li>Strong analytical and strategic thinking abilities with the ability to make data digestible for cross-functional stakeholders</li><li>Proven project management skills with ability to multitask and manage requests from various stakeholders.</li><li>Familiarity with Advertising Research and Verification vendors like Nielsen, ComScore, Moat, Integral Ad Science, DoubleVerify, Kantar, etc.&nbsp;</li></ul><div><br></div><div>If you have a passion for entertainment and a desire to work in a fast-paced, innovative environment, we would love to hear from you. Come join us and help us entertain the world!</div> We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT46588-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013216", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46588"], "team": ["Sales And Business Development"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
