{"id": 790298013766, "name": "Director, Discovery & Promotion, Korea", "location": "Seoul, Korea, Republic of", "locations": ["Seoul, Korea, Republic of"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1710892800, "t_create": 1710892800, "ats_job_id": "JR27913", "display_job_id": "JR27913", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Company & Role Overview: \nAt Netflix, we are reinventing the way people are entertained by both enabling and innovating how visual storytelling is produced, discovered and enjoyed. Netflix provides a platform for stories from different places and different perspectives to reach, connect, and inspire millions of people all over the world.\n\nIn this role, you sit at the intersection of content, marketing and product, powering one of the most transformational shifts in the industry. Netflix is the world's leading internet entertainment service with over 230 million members in over 190 countries enjoying TV series, documentaries, feature films, and games across a wide variety of genres and languages.\n\nAs the Product Discovery & Promotion (PDP) Leader for Korea, you will grow, develop and lead a team that is ultimately responsible for contextualising what is special about Korean stories on our service - for the world.  Your team strives to authentically represent the multiple narratives that exist in every story so that our members can discover the stories that they will love.  You and your team define and drive the creative and operational strategy for how we represent and launch titles across these regions and partner with internal and external partners to ensure a seamless experience for our members in these countries and beyond.\n\nKey Characteristics Sought:\n\nYou value, understand, and can deliver great experiences for our members <ul><li>Approach problems with both a local and regional lens</li><li>Build strong partnerships locally, regionally, and globally to advocate for the needs, nuances, and complexity of Korea, while seeking a broader understanding and best practices</li><li>Have first-hand experience working with product/brand/content in Korea</li><li>Understands that local titles have the power to inspire global phenomena&nbsp;</li><li>Have a strong track record of building and cultivating great locally-oriented teams</li></ul> You are equally adept at defining and driving both Creative and Operational Excellence <ul><li>Understands the challenges and importance of driving high-quality creative work at scale</li><li>Ensures regional and global business context is considered alongside local ambitions to find the sweet spot for this team</li><li>Inspires a multi-disciplinary team toward&nbsp; shared goals, objectives, and opportunities</li><li>Complexity and volatility do not faze you - you are able to stretch to drive/ set strategy AND drive implementation/ execution</li></ul> You are a strong strategic partner to cross-functional leaders <ul><li>Great bridge - both to cross-functional teams; as well as to broader PDP (regionally + globally): equally adept at articulating your own vision while also collaborating to drive market success.</li><li>Adept at speaking to Product considerations (member-first approach, hypotheses forming and experimentation) as well as Marketing/Content concerns (audiences, how to integrate brand into day-to-day work, storytelling)</li><li>Influence and synthesize functional context and strategy for your teams in a way that best suits the needs of the markets.</li></ul> You are a builder and developer of strong multidisciplinary teams <ul><li>Bring nuanced and deep local business experience which allows you to provide input on local creative and operational strategy from a market perspective while influencing regional and global teams.</li><li>Be an excellent leader who sees the big picture. You know how to inspire your own team through the challenges of a rapidly evolving, complex business.</li><li>Be an invaluable colleague to your cross-functional stakeholders and partners by working with them closely to recognize opportunities and synthesize strategy across other countries, regions, and functions.</li><li>Be equally comfortable in “left brain” or “right brain” problem solving, but be most excited when both are deployed at the same time and understand how to leverage data and insights to push the boundaries of creative excellence.&nbsp;</li><li>Have an eye for compelling creativity, inspire and set a high bar for quality, and advocate effectively on behalf of what’s best for the member experience.</li><li>Adept at identifying, innovating, and developing opportunities for efficiency and increased impact on the team.&nbsp;</li><li>Have experience working within a matrix organisation structure - and be adept at effectively influencing and advocating for both local and global/ functional business goals, serving as a bridge between both.</li><li>Be an earnest and inclusive leader who will be a great steward of the Netflix culture while also helping it to shape and evolve over time.</li></ul> Qualifications: <ul><li>Leadership experience in a fast-paced growth environment, adept at scaling within a rapidly expanding company and market.</li><li>10+ years of experience in building and growing diverse teams through hiring, developing, and managing a sizable team of high-performers.&nbsp;</li><li>Experience working in Korea, with a nuanced understanding of navigating the local challenges and opportunities while synthesizing regional and global contexts.</li><li>Experience in managing teams and influencing outcomes in a matrix environment.&nbsp;</li><li>Comfort working at a company, and in a team, where data and insights are heavily leveraged in decision-making.&nbsp; First-hand experience with A/B testing is a plus.</li><li>Business fluency in Korean and English.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>넷플릭스는</span><span> </span><span>다양한</span><span> </span><span>경험과</span><span> </span><span>생각을</span><span> </span><span>가진</span><span> </span><span>구성원이</span><span> </span><span>모였을</span><span> </span><span>때</span><span> </span><span>최고의</span><span> </span><span>성과를</span><span> </span><span>내는</span><span> </span><span>팀을</span><span> </span><span>만들어</span><span> </span><span>갈</span><span> </span><span>수</span><span> </span><span>있다고</span><span> </span><span>믿고</span><span> </span><span>있습니다</span><span>. </span><span>다양성과</span><span> </span><span>포용성은</span><span> </span><span>우리가</span><span> </span><span>지향하는</span><span> </span><span>기업</span><span> </span><span>문화의</span><span> </span><span>핵심</span><span> </span><span>중</span><span> </span><span>하나이며</span><span>, </span><span>이것의</span><span> </span><span>궁극적인</span><span> </span><span>목적은</span><span> </span><span>모든</span><span> </span><span>직원이</span><span> </span><span>역량을</span><span> </span><span>마음껏</span><span> </span><span>발휘하고</span><span> </span><span>성장하며</span><span> </span><span>기여할</span><span> </span><span>수</span><span> </span><span>있도록</span><span> </span><span>환경을</span><span> </span><span>조성하는</span><span> </span><span>것입니다</span><span>.  </span><span>인재를</span><span> </span><span>선별하는</span><span> </span><span>과정은</span><span> </span><span>이러한</span><span> </span><span>목적을</span><span> </span><span>달성하는</span><span> </span><span>데</span><span> </span><span>매우</span><span> </span><span>중요합니다</span><span>.  </span><span>이에</span><span> </span><span>따라</span><span> </span><span>넷플릭스는</span><span>  </span><span>성별</span><span>, </span><span>인종</span><span>, </span><span>피부색</span><span>, </span><span>국적</span><span>, </span><span>종교</span><span>, </span><span>성적</span><span> </span><span>지향</span><span>, </span><span>나이</span><span>, </span><span>결혼</span><span> </span><span>여부</span><span> </span><span>등</span><span> </span><span>모든</span><span> </span><span>개인적인</span><span> </span><span>배경과</span><span> </span><span>상관없이</span><span> </span><span>모두에게</span><span> </span><span>평등한</span><span> </span><span>기회를</span><span> </span><span>보장하며</span><span>, </span><span>공정한</span><span> </span><span>과정을</span><span> </span><span>통해</span><span> </span><span>채용을</span><span> </span><span>진행하고</span><span> </span><span>있습니다</span><span>.</span><span>장애인</span><span> </span><span>및</span><span> </span><span>국가보훈</span><span> </span><span>대상자는</span><span> </span><span>관련</span><span> </span><span>법령에</span><span> </span><span>따라</span><span> </span><span>우대합니다</span><span>.</span></p>", "id_locale": "JR27913-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013766", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27913"], "team": ["Product Discovery"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
