{"id": 790298013496, "name": "Program Manager - Security, Risk, & BPO IT Implementation", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Program / Project Management", "business_unit": "Streaming", "t_update": 1720396800, "t_create": 1720396800, "ats_job_id": "JR28500", "display_job_id": "JR28500", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nWhen our members sit down to watch, we want to make sure that nothing gets between them and their favorite shows, movies, and games. Netflix Customer Service (CS) is here to assist customers when they need help. \n\nOver 200 million members worldwide love Netflix. When they sit down to watch, we want to make sure that nothing gets between them and their favorite shows, movies, and games. And Netflix Customer Service (CS) is here to assist customers when they are in need of help. \n\nThe CS Technology team is part of the CS organization and is responsible for ensuring the right CS tools and technologies are in place and well-functioning to support the operation, growth, and scalability of the Customer Service business now and in the future. \n\nProgram and CS Tools Support Management (PSM), a key component of the CS Technology team, manages technical issue escalations and champions enhanced reliability for CS tools and technologies. PSM ensures compliance with Netflix's security standards across all CS operations and tooling initiatives. Additionally, it oversees the implementation of Netflix-specific IT at our BPO CS sites and manages user access and system administration for CS-specific workflows for Netflix CS full-time employees (FTEs).\n\nIn this role, you will manage security and risk prevention programs for Customer Service in partnership with stakeholders from the broader Netflix Security Organization. Success in this role means you will have built strong collaborative relationships, effectively mitigated risks, ensured compliance with security standards, and implemented robust programs that consistently enhance the security and quality of the Customer Service Organization.\nCore Responsibilities: <ul><li>Define and manage the security program within Netflix Customer Service. Initiate and drive risk reduction programs through operational best practices and technology improvements in partnership with the broader Netflix security organization and CS Product teams.</li><li>Advocate for stakeholders by uncovering security risks within internal processes, technologies, and partnerships and developing a plan to manage and mitigate those risks.</li><li>Hypothesize, socialize, and seek feedback on security programs with various cross-functional partners.</li><li>Manage Netflix-specific technical implementation requirements for our BPO CS Operations, ensuring they are aligned with Netflix Security standards and CS Product expectations.&nbsp;</li><li>Consult on BPO MSA and SOW contracts to ensure security, reliability, and IT requirements are aligned with Netflix standards in partnership with stakeholders from the broader Netflix security organization and CXO.&nbsp;</li><li>Create plans for granting access and conducting tests for the implementation of new or updated CS&nbsp; Tools.</li><li>Embody the unique Netflix <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a>.</li></ul> Qualifications: <ul><li>5+ years of experience managing key programs and projects, preferably within InfoSec, Customer Service, or similar industries</li><li>Experience working with BPOs for Customer Service.&nbsp;</li><li>Experience with Customer Service technology platforms (CRM, CMS, CCaaS, etc).</li><li>Strong relationship-building and communication skills.</li><li>Experience and comfort working across global regions and time zones.&nbsp;</li><li>Demonstrated ability to stay current with the latest AI trends and technologies and effectively apply them to solve real-world business challenges a plus</li><li>Possess strong analytical skills and a proven track record of making data-driven decisions.</li><li>Self-starter and fast learner who can work independently while using impeccable judgment.</li><li>Exhibits a strong sense of curiosity and the initiative to explore unknowns and thrive in ambiguous situations.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $160,000 - $390,000. \n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28500-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013496", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28500"], "team": ["Program / Project Management"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
