{"id": 790298132703, "name": "Marketing Manager - UK (FTC)", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1721989975, "t_create": 1721865600, "ats_job_id": "JR28768", "display_job_id": "JR28768", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p><p><span>We are looking to fill an integral role on the marketing team for a </span>Manager of Marketing, <span>specialising in scripted content, based in London. This is a great opportunity to join a team that leads the development and launch of marketing campaigns across a diverse range of scripted series produced in the UK, such as </span><i>The Gentlemen, Supacell, Black Mirror, One Day, Fool Me Once</i></p><p></p><p><b><u>The Role</u></b></p><p></p><p><span>This role is unique. So is the right candidate. </span></p><p></p><p><span>In this role, you will be a key contributor and leader in strategising, executing and managing integrated marketing campaigns for different series. You will be a member of a small and nimble group of professionals based in our London office. </span></p><p></p><p><span>We are looking for someone who: </span></p><ul><li><p><span>Has a proven track record of building world-class creative and launching global campaigns for premium entertainment properties, with scripted content in particular, that creates a passionate following. We are not only building campaigns, we are transforming our properties into culturally relevant brands.</span></p></li><li><p><span>Has deep knowledge in running a 360-campaign, from strategy development and building briefs, to tactical execution (including AV/trailers, digital/social, print and out-of-home). </span></p></li><li><p><span>Has a deep understanding of the social media landscape, and experience in establishing strong and out of the box social media strategies. Campaigns that build, nurture and maintain fan communities and manifest themselves in a unique tone of voice and culturally relevant and conversation-driving creative.</span></p></li><li><p><span>Has experience with marketing shoots, from development of creative and campaign ideas, to planning and shoot execution (key art, A/V, and digital / social).</span></p></li><li><p><span>Has experience in evaluating and executing innovative campaign ideas within the media landscape (inclusive of but not limited to OOH, Digital OOH and experiential) </span></p></li><li><p><span>Is a cross-functional leader who is able to engage, listen and collaborate with internal departments/teams to align early on in terms of overall strategy and goals, and to see the cross-functional collaboration through launch. </span></p></li><li><p><span>Is able to effectively communicate different facets of their campaigns to executives, showrunners (or producers), talent and talent representatives (as needed).</span></p></li><li><p><span>Has exposure to working on global campaigns, with reach domestically and internationally. Ideally, this person would have a global IQ and/or be familiar with working with teams from different regional markets. </span></p></li><li><p><span>Has a good understanding of marketing, social and media analytics and how to apply data to test and optimise campaigns.</span></p></li><li><p><span>Has a native understanding of digital with an emphasis on mobile, social, video and display and an ability to tell stories through great ideas regardless of medium. </span></p></li><li><p><span>Appreciates technology and can collaborate with our world class product team to integrate our campaigns within the member product experience. </span></p></li><li><p><span>Is an effective collaborator in a fast paced, multifaceted environment. We will typically have multiple launch campaigns happening at once. </span></p></li></ul><p></p><p><span>Core Responsibilities: </span></p><ul><li><p><span>Lead on launch campaigns for scripted content<span> </span>being produced from the UK -- from strategy development to creative execution, production to campaign roll out.</span></p></li><li><p><span>Act as the central cross-functional liaison amongst internal teams (across region-based Marketing teams, PR, Publicity, Product and Social), with a focus on managing workflow and being able to socialise, absorb, organise and address cross-functional feedback (where possible)</span></p></li><li><p><span>Act as the main point of contact with agencies - hire, manage and give feedback to create the best campaigns.</span></p></li><li><p><span>Have a holistic vision for leading campaigns, but also do the tactical day-to-day (brief writing, shoot planning, budgeting and managing overall campaign resources)</span></p></li></ul><p></p><p><u>Qualifications</u> </p><p></p><p><span>The successful candidate possesses: </span></p><ul><li><p><span>A minimum of 8&#43; years of experience at an entertainment marketing or social department, network/studio marketing/social team, or creative agency working on creative campaigns (in strategy, Digital, Print and AV creative). </span></p></li><li><p><span>Experience managing a high volume of campaign types in parallel, while collaborating with diverse, geographically-dispersed teams.</span></p></li><li><p><span>Strong communication and analytical skills along with the ability to think strategically and creatively and a reasonable appreciation for the unknown.</span></p></li></ul><ul><li><p><span>Passion for television is a must. </span></p></li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28768-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298132703", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28768"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
