{"id": 790298014531, "name": "Senior Product Designer, Games Enablement Platform", "location": "Albany, New York, United States of America", "locations": ["Albany, New York, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1716768000, "t_create": 1716768000, "ats_job_id": "JR28290", "display_job_id": "JR28290", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The Netflix Games Design team is searching for a highly ambitious, visionary, and experienced Senior Product Designer who will enable a best-in-class partner platform experience to power games for our members around the globe. You will lead design for a pillar of Netflix’s Games Product XD team, collaborating with stunning product, engineering, design colleagues, as well as game developers to build the apps, tools, and services that power Netflix Games’ partner platform.\n\nThis will be a remote-friendly role, with the freedom to set your own work-from-home schedule.  When safe and reasonable, there will be times where the team will meet onsite in Los Gatos and Los Angeles for meaningful moments of collaboration and bonding. \n\nAbout Netflix Games and Our Partnerships...\n\nThe Netflix Games team is working to deliver games to 200+ million people across mobile, web, and TV. This takes work across discovery experiences as well as the developer lifecycle to ensure developers can build awesome games and experiences for the Netflix platform. You’ll be the design lead who crafts the applications, tools, and services that enable cloud-based games and partnerships. More specifically, you’ll play a critical, architectural role by cultivating the developer platform that delivers Netflix games to the world!\nWhat You Will Do <ul><li>Lead the design of partner-facing tools, experiences, and services that enable <b>a)</b> Netflix games<b> b)</b> Game development lifecycle & <b>c)</b> Game partnerships</li><li>Lead individual design initiatives and strategically architect a developer platform for Netflix games.</li><li>Identify, research, and drive new initiatives that enable next generation interactive experiences.</li><li>Collaborate with engineers, product managers, tech writers, and other stakeholders to develop and iterate upon new concepts.</li></ul> What We’re Looking For <ul><li>A passionate energy for great design and amplifying our team <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">culture</a>.</li><li>8+ years as a Product Designer (or equivalent experience) in the B2B2C space, leading high-impact initiatives from concept to execution.</li><li>A versatile portfolio that showcases deep interaction and problem solving skills.</li><li>Understanding of complex workflows designed to scale across diverse, global operations teams.</li><li>Experience contributing to and consuming component-based design systems.</li><li>Excellent communication skills that excite stakeholders and articulate a vision.</li></ul> Even Better <ul><li>Experience with game development, game platforms, and gaming developer personas.</li><li>Experience working with complex internal systems, partner-facing platforms, and highly technical environments (like API platforms).</li></ul> Why You’ll Love Our Team <ul><li>Business environment that’s big on individual responsibility and efficient process.</li><li>Work with stunning, supportive designers on problems that matter.</li><li>Top of market compensation and <a href=\"https://candidate.netflix.com/united-states/candidate-benefits\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">benefits</a>, flexible time off, and work-life-balance.</li><li>Remote flexibility to balance work-from-home and in-office work, so long as you’re able to be onsite for meaningful moments of collaboration .Freedom and flexibility to craft your own design workflow, while harnessing Netflix’s world-class design system and tooling.</li><li>An inclusive environment to help you do your best work and feel genuinely supported.</li><li>You are empowered to imagine what gaming on Netflix means and create new work streams for the best game developers in the world. </li></ul> \n\nDoes this sound interesting but overwhelming? Please don’t self-select out; let’s figure it out together. We’d love to talk to you! \n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000 - $515,000\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28290-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014531", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28290"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
