{"id": 790298013953, "name": "Software Engineer 5 - Media Encoding Pipelines, Encoding Technologies", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719792000, "t_create": 1719792000, "ats_job_id": "JR27334", "display_job_id": "JR27334", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The mission of Encoding Technologies is to deliver the best A/V experiences to our members and our studio customers via media innovations. A critical component to achieve this goal is the highly scalable cloud based encoding pipelines to support generating media assets of various formats and quality levels, and propagating media metadata associated with these assets across the surrounding ecosystem. Media Encoding Pipelines team focuses on developing such infrastructure to support workflow orchestration, metadata publishing, task prioritization and catalog management. In the recent years our scope has expanded from supporting the on demand streaming service to image generation and more recently ads. We are looking for talented engineers to join our team and elevate our system to the next level.\nYou will be successful in this role if you: <ul><li>Are a quick learner and excited about learning new technologies.</li><li>Passionate about automated testing, code quality, and engineering best practices.</li><li>Thrive in an environment with lots of context and minimal guidance.</li><li>Enjoy collaborating with both technical and non-technical partners from cross-functional teams and have excellent communication skills.</li><li>Enjoy taking full ownership of projects from conception to production.</li></ul> Qualifications: <ul><li>5+ years of working experiences using Java or similar languages and proficient in OO design principles.</li><li>Experience in designing and developing large scale distributed systems focusing on availability, throughput, fault tolerance and performance.</li><li>Good understanding of concepts like concurrency, parallelism, batch processing and event driven architecture.</li><li>Experience with cloud computing platforms such as Amazon AWS.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $180,000 - $560,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27334-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013953", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27334"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
