{"id": 790298013554, "name": "Senior Manager, Dubbing Partner Operations (APAC)", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Studio Operations", "business_unit": "Streaming", "t_update": 1716768000, "t_create": 1716768000, "ats_job_id": "AJRT45072", "display_job_id": "AJRT45072", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Dubbing team is bridging global storytellers with local voices, making joy accessible to all audiences. As Netflix continues to scale, the Dubbing Global Resource Strategy team supports the long-range planning of external resources along with supporting global frameworks for ongoing vendor management.\n\nYou will work within the Dubbing team, along with a variety of cross-functional teams such as Engineering, Sound Technology, Studio Strategy & Analysis, and Product among many others. You will identify audio, tooling, and workflow challenges amongst the external partner ecosystem and partner with engineering and innovation teams to design solutions, serving as an informed captain for external partner impact and needs.  In partnership with local Dubbing & Language Production Managers, you will be responsible for the implementation of dub audio solutions and infrastructure to Netflix Asia Pacific (APAC) Dubbing partners, in support of driving creative and operational excellence. This role is unique as it merges audio engineering expertise with technical operations management.  Our environment is fast-paced, requiring the ability to work autonomously with minimal supervision. You will need to demonstrate excellent strategic, and problem-solving skills and a proven record for improving existing frameworks, tools, and technologies. The right mix of organizational and communication skills is key to success as a large part of the role is collaborating with business partners to understand and communicate needs. \n\nAbout You\nYou are an expert in the fields of dubbing/localization, sound recording, editing, and mixing and possess a mix of both a strategy and operations mindset. You understand dubbing workflows and tools and how technology and creative demands are evolving. You have worked with translators, editors, recordists, mixers, sound supervisors, archivists, and network or studio executives, and you understand their goals and challenges. You've kept abreast of developing standards and new technologies that are shaping the way soundscapes are created and reproduced for consumers, and have ideas about how to ensure their longevity. You’re comfortable interacting with the domestic and international sound community and are able to easily explain technical concepts to non-technical audiences and internal/external senior leaders.  \nResponsibilities: <ul><li>Strive to bring alignment between Netflix Dubbing partners and Netflix’s technical and workflow goals to drive creative excellence; recording, mixing, quality control, delivery, M&E, and software solutions.</li><li>Partner closely with our Dubbing Strategy & Innovation team to amplify internal tooling/workflow development and initiatives, and then form a bridge with APAC Language Production/Dubbing Managers for external impact and rollouts.</li><li>Identify, and partner with teams to execute, any needed internal or external educational technical/audio training. This will involve typical scenarios related to the recording and mixing of dubbed content, plus territory nuances and best practices.</li><li>Gather context and identify key pain points with partner workflow technical challenges, and assess the impact of the problem. Document business priorities, and define goals and outcomes to achieve.&nbsp;</li><li>Thoroughly understand the dubbing market across the studio ecosystem and research into the context and impact around audio, tooling, and workflow initiatives, in partnership with local/regional colleagues and third parties, where needed.</li><li>Command an understanding of Netflix tooling and how those tools are used and integrated with external partners.</li><li>Partner with teammates on execution, for partner technical evaluations and testing, Dubbing tool training, partner support ticketing workflows, and Partner Help Center maintenance.</li><li>Consume QC and other performance metrics to drive continued excellence of partner performance, identifying pain points and strategizing remediations.</li></ul> Requirements: <ul><li>10+ years experience in audiovisual exhibition and post-production or dubbing&nbsp;</li><li>technology, interacting with creatives, and vendors, managing maintenance and upgrades</li><li>Strong understanding of the Asia Pacific market and familiarity with external partners within the region.</li><li>Experience in vendor management and senior relationship management&nbsp;</li><li>Understanding of all forms of professional audio formats, technology, and best practices.</li><li>Experience with integration and operation of post-production/dubbing tools and infrastructure.</li><li>Experience in dub audio mixing, editorial, and quality control</li><li>Agile, goal-oriented personality, driven to succeed, and always up for a challenge.</li><li>Ability to be forward-thinking, strategic, and innovative, while proactively making decisions that can sometimes be difficult or challenging. Passion for learning and experimenting with new technologies. Experience building and defining software requirements.</li><li>Top-notch communication and presentation skills with the ability to speak clearly and concisely, and translate technical speak for non-technical partners.&nbsp;</li><li>Ability to forge strong partnerships, collaborate, and learn with stakeholder groups.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT45072-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013554", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45072"], "team": ["Studio Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
