{"id": 790298014682, "name": "Software Engineer 4", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1715817600, "t_create": 1715817600, "ats_job_id": "AJRT45849", "display_job_id": "AJRT45849", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 270 million paid subscribers, and are expanding into new forms of entertainment such as gaming. \n\nContent Engineering builds the products and services used by our internal and external creative partners to create, launch, and promote our global content. Our products enable the entire workflow of content creation, from pitch to play, and provide innovative new ways to develop and manage entertainment at scale. \n\nWe are looking for talented distributed systems engineers like you to help build the technologies that allow us to scale our efforts globally, effectively, and efficiently! You’ll have a direct impact on how the Netflix studio creates and promotes shows such as “Squid Game,” “Stranger Things,” and “The Queen’s Gambit” globally. \n\nWe are committed to building a diverse and inclusive team to bring new perspectives as we solve the next set of challenges. In addition, we are open to remote candidates - we value what you can do, from anywhere in the U.S.\nYou will be successful in this role if you enjoy: <ul><li>Being self-motivated and working independently while collaborating with engineers on the team and cross-functional teams (product managers and TPMs).</li><li>Empowering other engineers by building and operating robust, scalable, and highly available infrastructures, with a focus on developer experience, observability, and operational excellence.</li><li>Being passionate about code quality and engineering best practices.</li><li>Embracing and thriving in ambiguity. Complex and fuzzy requirements are more common than clearly defined customer expectations.</li><li>Living the Netflix’s culture and thinking you would thrive here.</li></ul> Qualifications: <ul><li>Have 2+ years of experience working on distributed systems features or applications.</li><li>Have recent proficient experience with Java, C# or other OO programming languages, as well as OO design principles.</li><li>Have a good understanding of concepts like multithreading and parallelism, as well as software observability.</li><li>Experience in developing microservices, data modeling, and API designs.</li><li>Ability to describe complex technical concepts to cross-functional team peers, driving conversations and decisions through written and/or verbal communication.</li></ul> Nice to have: <ul><li>Experience in building infrastructure and platforms.</li><li>Experience in API design and implementation using gRPC and/or GraphQL.</li><li>Experience in any of the following areas: cloud storage/file system, data platform, event-driven infrastructure, ontology, and workflow orchestration.</li></ul> Spotlight on Content Engineering Teams:\n\nContent MiddleWare Infrastructure (MWI)\nThe Content MiddleWare Infrastructure team(MWI), a part of the Content Infrastructure & Solutions group, provides Studio and Content Engineering specific, highly leveraged, and fully managed data, workflow, and messaging & communication platforms facilitating the goal of the Connected Studio. To learn more about what the MWI team does, check out the following tech blogs:Workflow (1, 2)Graph Search (1, 2, 3)Data Movement (1, 2)\n\nMedia Infrastructure Platform (MIP)\nThe Media Infrastructure Platform team provides large-scale infrastructure for content media, enabling Netflix to store, access, and process media files at scale, reliably, and efficiently to meet the demands of Netflix streaming and studio. Our products are highly leveraged by Encoding, Netflix Studio, and Content Engineering. We closely partner with a variety of cross-functional teams, including Encoding Technology, Netflix Engineering Platform, Data Science Engineering, and Content Engineering, as well as Product Managers. The team currently owns a few key products such as a polyglot application framework, and container-based executor for media-aware serverless functions with observability tools and workflow orchestration frameworks, a storage layer built on top of S3 with a set of features like file and folder solution, lifecycle management,  media sequence detection, Netflix access control, security,  client side encryption, full file checksum, etc.  Besides the cloud services the team currently owns, the team is also looking to grow into a more diverse and hybrid media processing and storage media space to meet the needs of business growth. \n\nAsset Management Platform (AMP)\nThe Asset Management Platform (AMP) team is part of the Content Infrastructure and Solutions (CIS) organization which empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. We do that by providing scalable and resilient infrastructure to address integrated large-scale media, assets, data, and communication use cases. The AMP team focuses on asset management. The team manages a centralized, scalable asset platform that serves as the backend for many studio applications that are used by film/TV series production teams. The scope of the asset platform is very wide, it manages assets straight from the production sets to promotional images/videos to studio related documents. Within the assets it also manages temporal and spatial annotations that enhances  asset discovery.\n\nA few more things about us:\nAs a team, we come from many different countries, and our fields of education range from the humanities to engineering to computer science. Our team includes product managers, program managers, designers, full-stack developers, distributed systems engineers, and data scientists. Folks have the opportunity to wear different hats, should they choose to. We strongly believe this diversity has helped us build an inclusive and empathetic environment, and we look forward to adding your perspective to the mix!\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45849-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014682", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45849"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
