{"id": 790298013374, "name": "Program Manager, Production Solutions - APAC", "location": "Seoul, Korea, Republic of", "locations": ["Seoul, Korea, Republic of"], "hot": 0, "department": "Studio Operations", "business_unit": "Streaming", "t_update": 1716508800, "t_create": 1716508800, "ats_job_id": "AJRT45945", "display_job_id": "AJRT45945", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>The Role\n\nAt Netflix, the Production Solutions team enables the Content and Production teams to achieve their creative pursuits and operational goals through production solutions, technology, resource assurance, and workflow optimization. We seek to identify and address pan-regional opportunities for operational improvement and provide project management advice and support, to enable the execution of our Studio strategy on a global, regional, and country level.\n\nAs the Program Manager, you will serve as a liaison between the regional teams and central teams to gather learnings and improve. PMs are globally savvy, self-motivated, flexible in thought, and able to juggle multiple responsibilities with a strong emphasis on organization. We value people who are creative problem solvers, have great judgment, and thrive in a fast-paced environment.  Truly collaborative, you are always excited to take on a new challenge and enjoy making the business better for everyone.\nYou are tenured at Netflix - with the drive and passion for data analysis, and workflows with solid internal tools knowledge, and expertise to identify and address pan-regional opportunities for operational improvement to enable the execution of our Studio strategy on a global, regional, and country level. All SME activity is aligned through the Program Manager. \nAs part of the Production Solutions team, you will: <ul><li>Act as the primary conduit between local teams and Central as well as other regional Production Solutions teams.</li><li>Work in sync with production teams to highlight and communicate local and regional priorities to global teams, ensuring collaboration to make global initiatives relevant regionally.</li><li>Forge partnerships with Content Operations and Innovations to craft enhanced workflows, establish best practices, and develop tool solutions.</li><li>Seek out region-specific chances for ongoing improvement in workflows, technology, efficiency, tool enhancement, and deployment.</li><li>Collaborate with global, regional, and country teams to ensure that data is complete, accurate, and contextual.</li><li>Eliminating operational redundancies optimizes process efficiency and resource usage, enabling our content, creative, and production teams to prioritize tasks of greater value.</li><li>Lead the discovery, development, and integration of tools, facilitating operational rollouts of new products, tools, and enhancements through scalable onboarding and localized support.</li><li>Utilize data and trend analysis to foster regional improvements and maximize resource efficiency.</li></ul> Requirements: <ul><li>Functional experts tenured at Netflix(+3yrs)—with the drive and passion for data analysis and workflows and solid internal tools knowledge.</li><li>Driven by intense curiosity, this individual delves into the deeper nuances of topics and challenges, displaying a knack for connecting the dots through pattern recognition.</li><li>This person is adept at quickly addressing concerns and opposition within their function, offering necessary adjustments or explanations for decisions on proceeding with, adjusting, or abandoning solutions. This includes navigating challenges that emerge during the engineering process.</li><li>They are skilled in prioritizing and realistically scheduling deliverables, fostering alignment within their function and across others, and practicing active listening.</li><li>The ideal candidate is capable of juggling numerous tasks, prioritizing effectively, and tackling problems with a solution-oriented approach aimed at creating a significant impact.</li><li>Experience with data analysis, setting strategic goals based on insights, and presenting these insights is highly valued. A strong passion for upholding our culture and values in the workplace is essential.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>넷플릭스는</span><span> </span><span>다양한</span><span> </span><span>경험과</span><span> </span><span>생각을</span><span> </span><span>가진</span><span> </span><span>구성원이</span><span> </span><span>모였을</span><span> </span><span>때</span><span> </span><span>최고의</span><span> </span><span>성과를</span><span> </span><span>내는</span><span> </span><span>팀을</span><span> </span><span>만들어</span><span> </span><span>갈</span><span> </span><span>수</span><span> </span><span>있다고</span><span> </span><span>믿고</span><span> </span><span>있습니다</span><span>. </span><span>다양성과</span><span> </span><span>포용성은</span><span> </span><span>우리가</span><span> </span><span>지향하는</span><span> </span><span>기업</span><span> </span><span>문화의</span><span> </span><span>핵심</span><span> </span><span>중</span><span> </span><span>하나이며</span><span>, </span><span>이것의</span><span> </span><span>궁극적인</span><span> </span><span>목적은</span><span> </span><span>모든</span><span> </span><span>직원이</span><span> </span><span>역량을</span><span> </span><span>마음껏</span><span> </span><span>발휘하고</span><span> </span><span>성장하며</span><span> </span><span>기여할</span><span> </span><span>수</span><span> </span><span>있도록</span><span> </span><span>환경을</span><span> </span><span>조성하는</span><span> </span><span>것입니다</span><span>.  </span><span>인재를</span><span> </span><span>선별하는</span><span> </span><span>과정은</span><span> </span><span>이러한</span><span> </span><span>목적을</span><span> </span><span>달성하는</span><span> </span><span>데</span><span> </span><span>매우</span><span> </span><span>중요합니다</span><span>.  </span><span>이에</span><span> </span><span>따라</span><span> </span><span>넷플릭스는</span><span>  </span><span>성별</span><span>, </span><span>인종</span><span>, </span><span>피부색</span><span>, </span><span>국적</span><span>, </span><span>종교</span><span>, </span><span>성적</span><span> </span><span>지향</span><span>, </span><span>나이</span><span>, </span><span>결혼</span><span> </span><span>여부</span><span> </span><span>등</span><span> </span><span>모든</span><span> </span><span>개인적인</span><span> </span><span>배경과</span><span> </span><span>상관없이</span><span> </span><span>모두에게</span><span> </span><span>평등한</span><span> </span><span>기회를</span><span> </span><span>보장하며</span><span>, </span><span>공정한</span><span> </span><span>과정을</span><span> </span><span>통해</span><span> </span><span>채용을</span><span> </span><span>진행하고</span><span> </span><span>있습니다</span><span>.</span><span>장애인</span><span> </span><span>및</span><span> </span><span>국가보훈</span><span> </span><span>대상자는</span><span> </span><span>관련</span><span> </span><span>법령에</span><span> </span><span>따라</span><span> </span><span>우대합니다</span><span>.</span></p>", "id_locale": "AJRT45945-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013374", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45945"], "team": ["Studio Operations"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
