{"id": 790298012966, "name": "Android Software Engineer 5 - Android Client Foundations", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 1, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721963039, "t_create": 1718496000, "ats_job_id": "AJRT46239", "display_job_id": "AJRT46239", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>Netflix is the world&#39;s leading streaming video service with over 200 million paid memberships in 190&#43; countries. The Consumer Engineering team builds the industry-leading Netflix iOS, Android, and TV apps. To bring new kinds of engaging and cinematic experiences to life, we partner closely with many cross-functional teams including product management, experience design, and creative production. <br /><br />The Android Client Foundations team is responsible for solving shared opportunities and needs of Android product engineers across Netflix. We build foundational client infrastructure, app architecture, automation, and developer frameworks with insightful release and production tooling in close collaboration with our partners.<br /><br /><b>Our mission is to:</b></p><ul><li>Enable teams to craft &amp; ship rich, elegant, and performant product experiences</li><li>Enable rapid execution and product innovation on solid, field-tested, operationalized foundational pieces</li><li>Stay highly aligned with Product Engineering teams yet loosely coupled to have a dedicated focus on technical missions to serve our customer teams </li></ul><p><br />Our responsibilities include implementing large-scale future-looking foundational architecture and frameworks ranging from core UI frameworks to core infrastructure that enables existing and future innovations for product teams across Netflix. We care deeply about the performance, quality, and accessibility of the Netflix app. We’re passionate about creating elegantly designed, highly performant architectures that empower engineers to build unique UI experiences used by millions of users across the globe. We partner closely with teams across Netflix to help deliver solutions that make UI development efficient and enjoyable.<br /><br />We are part of a global, diverse organization that includes people of all genders, sexual orientations, upbringings, nationalities, ages, and socioeconomic &amp; educational backgrounds. We encourage anyone passionate about building compelling mobile experiences that touch audiences worldwide to apply.</p><p><br /><b>What you’ll be doing</b></p><ul><li>Build core UI infrastructure and systems that define best practices to help drive consistency and simplicity in client code.</li><li>Architect maintainable, performant Android client code with effective documentation that can be leveraged by Android developers on other teams.</li><li>Bring a wide variety of experience building features and frameworks with technologies like DI/Dagger/Hilt, Jetpack Compose, GraphQL, etc., to the team.</li><li>Develop code for testability and write automated tests with JVM Unit/Espresso tests to help uphold product quality on a high commit volume code base.</li><li>Keep a pulse on cutting-edge Android technologies and software engineering practices, and modernize the code base to accelerate innovation velocity and maintain high product quality.</li></ul><p></p><p><b>What Sets You Apart</b></p><ul><li>Deep understanding of the technical landscape of Android development and can introduce new paradigms and practices.</li><li>Self-starter comfortable with identifying opportunities and driving forward-looking technical solutions or roadmaps.</li><li>Taking a thoughtful, practical approach to problem-solving that considers tradeoffs and avoids over-engineering.</li><li>Exceptional coding skills, especially with Java and Kotlin, and can navigate different languages and technology stacks (eg. GraphQL, etc).</li><li>Effective at developing strong relationships with cross-functional teams through clear communication, curiosity, and selflessness.</li><li>Strives to elevate the knowledge and skills of yourself, and others in a way that fosters an inclusive, collaborative environment.</li><li>Deeply cares about the quality &amp; performance of the product shipped.</li></ul><p></p><p><b>You will be successful in the role if</b></p><ul><li>You enjoy pushing the boundaries of what technology can do and <b>exploring uncharted waters</b> with some supervision.</li><li>You are curious and ready to learn about various new or unfamiliar technologies, our consumer base, and product vision.</li><li>You have experience building transparent observability tooling and solutions that enhance developer velocity.</li><li>You love the idea of your work <b>empowering other engineers</b> and striving to understand their use cases.</li><li>Your colleagues appreciate the <b>unique perspectives and balanced views </b>you bring to collaborations.</li><li>You <b>value the opinions of others </b>when fleshing out solutions to fill out your blind spots.</li><li>You have familiarity with the Data-centric <b>approach</b> to app development.</li><li>You always seek different perspectives, feedback, and relevant information to navigate ambiguity comfortably.</li><li>You are effective at establishing <b>strong relationships with cross-functional teams</b> through clear communication.</li><li>You deeply care about the <b>quality &amp; performance</b> of the product shipped.</li><li>You have read about Netflix’s <a href=\"https://jobs.netflix.com/culture\" target=\"_blank\">culture</a> and think you would thrive here</li></ul><p></p><p><b>Learn about Android Product Engineering</b></p><ul><li>Read about <a href=\"https://netflixtechblog.com/seamlessly-swapping-the-api-backend-of-the-netflix-android-app-3d4317155187\" target=\"_blank\">how we migrated our Android endpoints out of a monolith into a new microservice </a>(<a href=\"https://www.linkedin.com/in/rohandhruva/\" target=\"_blank\">Rohan</a> and <a href=\"https://www.linkedin.com/in/eballot/\" target=\"_blank\">Ed</a>)</li><li>See one of our <a href=\"https://github.com/airbnb/epoxy/pull/560\" target=\"_blank\">pull requests for Epoxy (Emmanuel)</a></li><li>Read our take on <a href=\"https://netflixtechblog.com/android-rx-onerror-guidelines-e68e8dc7383f\" target=\"_blank\">Rx onError Guidelines (Ed)</a></li><li>See some of our work highlighted at a <a href=\"https://www.youtube.com/watch?v&#61;YpIGejJiaBo\" target=\"_blank\">Netflix Women In Tech Event</a></li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000. <br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.<br /><br />Netflix is a unique culture and environment.  Learn more here.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46239-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012966", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46239"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
