{"id": 790298010570, "name": "Marketing Production Manager - DACH", "location": "Berlin, Berlin, Germany", "locations": ["Berlin, Berlin, Germany"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1721001600, "t_create": 1721001600, "ats_job_id": "JR28596", "display_job_id": "JR28596", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Marketing Production Manager DACH\n\nIt's an amazing time to join Netflix as we continue to shape the future of entertainment. By promoting our content, we are bringing new stories to millions of people worldwide. This is where you come in. We are looking for a Marketing Production Manager to lead operational and executional innovation, production, and delivery of best-in-class entertainment campaigns for the DACH market.\n\nThe Role\n\nIn this role, you will be responsible for managing the end-to-end production process of our market-specific campaign initiatives across paid, earned, and owned channels. This means that you thrive in an environment requiring you to bridge creative and technical needs. We are looking for someone with hands-on knowledge and extensive experience in the DACH entertainment and production landscape. The role is based in Berlin.\n\nResponsibilities include: <ul><li>Acting as a creative and strategic thought partner for Marketing Managers throughout campaign development and owning the campaign execution of title and brand campaigns.</li><li>End-to-end production management for the entire asset suite (including asset planning, production, management, and final delivery).</li><li>Driving localization of global creative materials to deploy marketing experiences and extensions with high regional relevance.</li><li>Project management and ownership of selected campaign elements, including budget and time management.</li><li>Managing agency and vendor relationships in the region by defining and tracking the scope of work, budgets, and timelines.</li><li>Managing internal (Content, Product, Partnerships, etc.) and external (Talent, Filmmakers, Showrunners, etc.) stakeholders throughout the campaign lifecycle.</li><li>Ensuring that all assets are delivered in line with our brand guidelines and effectively communicating these standards to all external vendors.</li><li>Managing and optimizing internal workflows and processes to ensure efficient operations.</li></ul> Requirements: <ul><li>Passion for storytelling and excellent project management skills.</li><li>Strong familiarity with the DACH market, media, vendor, and preferably entertainment landscape.</li><li>8+ years of experience in content production with profound knowledge of on-set production, brand activations, OOH, and campaign production (360 marketing).</li><li>Highly experienced in working with creative agencies and production houses, with the ability to provide concise, clear, and actionable briefings as well as creative feedback.</li><li>Proactive, hands-on, and flexible problem-solver with great time, resource, and stakeholder management skills.</li><li>Proven ability to manage multiple high-volume campaigns simultaneously without compromising attention to detail, while demonstrating strong creative judgment.</li><li>Comfortable keeping up to date with the zeitgeist in entertainment, culture, tech, and business innovations around the world.</li><li>Fluent in English and German.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28596-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010570", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28596"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
