{"id": 790298013411, "name": "Product Manager, Developer Platform - Networking", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1707868800, "t_create": 1707868800, "ats_job_id": "JR27710", "display_job_id": "JR27710", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Join Netflix at this exciting time as we continue to revolutionize entertainment. Each month, we deliver billions of hours of content to over 270 million members in more than 190 countries. Our mission is to entertain the world, and we achieve this by swiftly building and reliably scaling innovative experiences for our members and creators around the globe.\n\nOur Infrastructure organization is vital to this mission, serving as the backbone for Netflix’s growing scale and boosting engineering productivity. We enhance the agility, efficiency, and reliability of our cloud infrastructure across compute, networking, and storage. We minimize time spent on infrastructure management and undifferentiated heavy lifting, streamlining developer workflows and reducing toil. This allows our engineers to concentrate on what truly matters: helping Netflix entertain the world.\n\nThe Opportunity\n\nWe are seeking a Principal Product Manager to drive the evolution of our networking platform. Your mission is to ensure a robust, agile platform that is reliable, efficient, secure, and scalable to meet the ever-evolving needs of the business. You will simplify networking for end users and enhance infrastructure agility by driving Network as a Service. Your contributions will significantly shape the future of networking at Netflix.\n\nIn this pivotal role, you will shape the product vision and strategy across the entire networking stack, forging strong partnerships with your engineering teams and key stakeholders. This role spans L3 to L7 networking, from networking primitives to edge gateways processing millions of requests per second:\n\n- Edge Services: Handle access control, DDoS mitigations, origin protections, real-time traffic inspection, dynamic routing, load shedding, and push notifications to millions of client devices.\n\n- Service Communication: Ensure a secure, reliable service mesh with intelligent service discovery, traffic management, observability, and enhanced features for load balancing, retry policies, rate limiting, circuit breaking, and more, reducing application complexity and improving performance.\n\n- Traffic Management: Dynamically steer, shape, and shift traffic within and across regions and externally to balance latency, availability, and cost.\n\n- Network Design & Topology: Design and manage the network, ensuring secure and efficient configuration and placement of elements and low-level primitives such as VPCs, load balancers, DNS, and subnets/IP management, aiming for a seamless user experience.\n\n- Network Observability: Provide a comprehensive network observability platform for monitoring, analysis, troubleshooting, and reporting on network topology, health, and performance.\nWhat You Will Do <ul><li>Deeply understand customer needs, product analytics, and industry innovation to drive the product vision and strategy for Networking, maximizing business and customer impact</li><li>Partner closely with senior management and engineering teams to define and align with stakeholders on vision, strategy, and roadmaps</li><li>Develop product roadmaps in partnership with relevant product and engineering teams that execute on product vision and strategy and inform our engineering teams of what problems need to be solved</li><li>Foster a metrics-driven environment that encourages quality experimentation and sets high standards for measuring product success</li><li>Stay informed about industry advancements, influence their direction, and conduct comprehensive buy vs. build analysis to align with state-of-the-art solutions, encouraging ROI-based decisions</li><li>Foster a collaborative environment with Netflix engineers, creating continuous feedback loops to ensure we're solving the right problems and driving maximum impact for Netflix</li><li>Exhibit robust problem-solving and decision-making skills, tackling both technical and strategic challenges in innovative ways, and leveraging both data and intuition to make strategic choices in the face of ambiguity and complexity</li><li>Ensure thoughtful product evolution that addresses product lifecycle and adoption experience</li><li>Help evolve our customer engagement model, communication strategy, and prioritization and planning/roadmapping practices</li></ul> What We’re Looking For <ul><li>8+ years of experience as a Technical Product Manager</li><li>Demonstrated expertise and passion in networking and developer experience</li><li>Proven track record of managing & evolving a product portfolio and driving product vision & strategy</li><li>A healthy blend of deep technical knowledge with customer-focused mindset and empathy</li><li>Strategic thinker that can connect customer use cases to technology solutions and think holistically about end-to-end experience</li><li>Ability to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision</li><li>Comfortable applying a combination of qualitative and quantitative methods to define success </li><li>Leverages product intuition and judgment to solve problems and make decisions without perfect information</li><li>Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’</li><li>Excellent communication skills; timely communication with clear expectations</li></ul> More About Cloud Infrastructure @ Netflix\n\neBPF Flow Logs at Scale for Network Insight & Enrich VPC flow logs at Hyperscale\nTitus, Netflix container management platform\nEvolution of Edge @Netflix\nScaling Push Messaging for Millions of Netflix Devices\nOpen Sourcing Zuul 2\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $340,000 - $975,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27710-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013411", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27710"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
