{"id": 790298012336, "name": "Security Engineering Manager, Security Platforms Engineering (Engineering Controls Automation)", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1721989975, "t_create": 1721174400, "ats_job_id": "AJRT43236", "display_job_id": "AJRT43236", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, we do one thing - entertainment - and we aim to do it really well at massive scale. Thousands of services work together to bring engaging content from the minds of our creative partners to the devices where members enjoy that content. The Engineering Controls Automation Team (ECAT) supports Netflix’s ability to move the speed of show business by taking an engineering-first approach to discovering the most important risks to this environment at scale, and automating security controls for those risks.</p><p></p><p></p><p>About the team</p><p>ECAT invests in deeply understanding our vast and ever-changing ecosystem and our internal customers, so we can focus on the work that drives the most impact. We serve Netflix by right-sizing security risks where possible, and providing appropriate context and actionable guidance (at the right time and in the right place) that will meaningfully reduce security risk at Netflix. </p><p></p><p></p><p>We are looking for an experienced Security Engineering Leader to lead the ECAT team. The key responsibilities of this role are facilitating the long-term strategy and vision for this team, leading and growing a hybrid team of security software engineers, and aligning and partnering with other security and platform engineering leaders across Netflix to drive this team’s charter forward.</p><p></p><p></p><p>About you</p><ul><li>You are an experienced and inclusive engineering manager, with a background in leading teams at the intersection of software engineering and engineering security controls</li><li>You have a strong background and technical expertise working in software and/or security engineering, and understand how to help your team navigate nuance and complexity, while always keeping focus on the outcomes.</li><li>You are excited to coach, mentor and develop a talented team. You know that the most important part of your job is building the team to be successful. You help your team make sound architectural decisions, improve their code quality, and grow out of their comfort zone.</li><li>You are comfortable with ambiguity, and experienced with clarifying and tackling open-ended problems, and helping your team do the same. You support your team by helping them understand priorities, drive down ambiguity, provide context and empower them to bring their best and create impact.</li><li>You understand that candor and honest feedback are kind, and you lean into open and transparent feedback with the intent of helping others grow and driving the best outcomes for Netflix.</li><li>You are a clear and effective communicator - you know your audience, and you drive consistency and clarity in the way you communicate</li><li>You are skilled at creating and maintaining cross-functional partnerships with other leaders inside and outside of your organization</li><li>You are experienced managing a hybrid team of in-person and remote engineers.</li></ul><p></p><p></p><p>For more information related to the work our team does at Netflix please see these resources:</p><ul><li>Scaling Appsec at Netflix: <a href=\"https://netflixtechblog.medium.com/scaling-appsec-at-netflix-6a13d7ab6043\" target=\"_blank\">Part 1</a> and <a href=\"https://netflixtechblog.com/scaling-appsec-at-netflix-part-2-c9e0f1488bc5\" target=\"_blank\">Part 2</a></li><li><a href=\"https://www.youtube.com/watch?v&#61;ALPQxRmTqiI\" target=\"_blank\">Asset Inventory and Prism</a></li><li><a href=\"https://www.youtube.com/watch?v&#61;ks9J0uZGMh0\" target=\"_blank\">2019 BlackHat talk </a>about how we approach third-party vulnerability management.</li><li><a href=\"https://medium.com/&#64;bdpsecurity/netflix-culture-meets-product-security-599ceecd615d\" target=\"_blank\">Netflix Culture Meets Product Security </a></li><li><a href=\"https://www.youtube.com/channel/UCCic-LGj5o892PhU_xrWq-g\" target=\"_blank\">The Netflix Security YouTube Channel</a> contains videos from talks Netflixers have given about various security topics.</li></ul><p></p><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.</p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits<span> </span></span><a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a><span>.</span></p><p></p><p><span>Netflix is a unique culture and environment. Learn more<span> </span></span><a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a><span>.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43236-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012336", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43236"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
