{"id": 790298013278, "name": "Software Engineer (L4) - Continuous Integration", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1720396800, "t_create": 1720396800, "ats_job_id": "JR28418", "display_job_id": "JR28418", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world's leading entertainment services, with 270 million paid memberships in over 190 countries, enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nNetflix’s source code is distributed across tens of thousands of code repositories written in numerous programming languages managed by thousands of engineers. Engineers are constantly making changes to these repositories, which are being built and tested on Netflix's continuous integration infrastructure, powered by Jenkins. Our Jenkins based infrastructure is hosted across 30+ controllers and 1000+ build agents to run over tens of thousands of build jobs a day. In addition to this mature CI platform, Netflix is currently exploring the future of CI to understand how we might address the needs of our users in the coming years. We are looking for engineers to join this team to manage and evolve our CI platform.\nYour Day-to-Day <ul><li>Driving feature work and taking ownership of services that are a part of Netflix’s Continuous Integration platform that operates and manages various aspects of the CI tooling.</li><li>Operate and maintain Jenkins and its build agents while keeping plugins and version upgrades current.</li><li>Collaborate with various other Platform teams to ensure their systems can integrate with our CI Platform.&nbsp;&nbsp;</li><li>Support cross-organization critical change campaigns across a wide variety of source code repositories.&nbsp;</li><li>Support customers with a variety of build and environment needs.&nbsp;</li><li>Work cross-functionally to build new services, tools, and data models to operationalize our workflows at scale.</li><li>Participate in product reviews and team meetings, providing technical insight. Help scope, estimate, and prioritize between conflicting needs.</li><li>Evaluate new technologies and approaches to streamline and improve our rapid application development tooling and conventions.</li><li>Regularly learn new systems and tools as the Netflix platform and ecosystem evolve.</li><li>Participate in our on-call rotation and contribute to incident reviews.</li></ul> You may enjoy working with us if: <ul><li>You are self-driven and highly motivated to deliver top-tier solutions with minimal guidance. You also recognize when you're wrong, learning from your mistakes and moving past them.</li><li>You enjoy collaborating and pairing with engineers to understand what they want, figure out what they really need, and finally, what we should build.</li><li>You strive to embrace best practices and are always searching for opportunities to continually improve.</li></ul> We would love working with you if: <ul><li>You are excited to be working with Java or other JVM languages.&nbsp;</li><li>You have experience running and operating continuous integration systems like Jenkins, CircleCI, GitHub Actions and others.&nbsp;</li><li>You are passionate about solving developer productivity challenges for engineers at the enterprise scale.</li><li>You are adept at designing and building APIs for customers, in particular with GraphQL.&nbsp;</li><li>You excel at working with microservice architectures.</li><li>You are experienced with relational and non-relational data stores.&nbsp;</li></ul> Here’s some stuff we’ve worked on: <ul><li><a href=\"https://netflixtechblog.com/how-we-build-code-at-netflix-c5d9bd727f15\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">How We Build Code at Netflix&nbsp;</a></li><li><a href=\"https://netflixtechblog.com/towards-true-continuous-integration-distributed-repositories-and-dependencies-2a2e3108c051\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Towards True Continuous Integration</a></li><li><a href=\"https://www.youtube.com/watch?v=Gr9wY7MZTew\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Evolving Continuous Integration at Netflix</a></li><li><a href=\"https://www.youtube.com/watch?v=LU8wYBWev_0\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">How Netflix Autoscales CI</a></li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000- $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28418-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013278", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28418"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
