{"id": 790298012307, "name": "Senior Treasury Analyst - Capital Markets", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Finance & Accounting", "business_unit": "Streaming", "t_update": 1717718400, "t_create": 1717718400, "ats_job_id": "AJRT43412", "display_job_id": "AJRT43412", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world’s leading streaming entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nNetflix’s Corporate Treasury team is responsible for managing the company’s capital structure, financial risk, and cash and banking activities, including our $14 billion debt portfolio, our $10 billion foreign currency hedging program, and $7 billion in cash and short-term investments as of Q1 FY24.\n\nWe are looking for an experienced candidate to become an integral part of our Treasury team that will play a pivotal role in our Corporate Finance & Capital Markets function. The ideal candidate will be familiar with capital structure and allocation strategies, have experience with debt capital markets and other financing activities, and can assess various capital markets proposals for alignment with broader corporate initiatives. This position is a hybrid role and will be expected to come into the office 3 times a week (generally Tuesday-Thursday).\n\nThe individual will be based out of either our Los Gatos, CA, or Los Angeles, CA office and report to the Senior Treasury Manager.\nResponsibilities: <ul><li>Asses and develop corporate finance strategies that align with the company’s objectives</li><li>Play an active role in the deal process, including structuring, negotiation, documentation, and execution</li><li>Develop and maintain models related to rating agency metrics, long-term liquidity planning, and capital allocation strategy</li><li>Monitor compliance with key covenants and liaise with regulatory and legal teams as needed</li><li>Ensure daily transmission and execution for commercial paper program</li><li>Lead tracking and reporting for Netflix’s banking counterparties including ratings monitor, fee analysis, and regulatory disclosures</li><li>Act as back-up for the Markets Risk Management team leading Netflix’s foreign exchange risk management program</li><li>Effectively communicate complex financial concepts into reports and presentations for key stakeholders and senior management</li><li>Support ad-hoc cross functional projects such as M&A strategy, policy and procedure documentation and data visualization</li></ul> Key Qualifications: <ul><li>5+ years experience in corporate treasury, or related experience in banking or fintech</li><li>Bachelor’s/Master's in business, finance, mathematics, or related discipline</li><li>Avid interest in global markets and different asset classes</li><li>Experience maintaining and developing models and large datasets</li><li>Strong analytical, technical, and problem solving skills are essential for this position.&nbsp;</li><li>Quick learner who takes full responsibility on assigned tasks and sees them through to completion</li><li>Familiarity with RPA, SQL, Google Apps Script (Java) a plus</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $210,000 - $500,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43412-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012307", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43412"], "team": ["Finance & Accounting"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
