{"id": 790298013030, "name": "Manager, Media Ops - UCAN", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Program / Project Management", "business_unit": "Streaming", "t_update": 1706140800, "t_create": 1706140800, "ats_job_id": "AJRT44411", "display_job_id": "AJRT44411", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>The Opportunity:\nWe’re looking for a stunning, savvy Media Ops Manager with expertise in media launch and execution, to enhance and develop delivery workflows, allocate for efficiency either with Business Process Outsourcing and/or infrastructure while partnering closely with key stakeholders. As a resourceful project manager and impeccable communicator, this role leads strategic workflow innovation, upholds quality and develops relationships for value-driven creative delivery initiatives in digital media. Partnerships include: vendors, Marketing Production teams, Social Marketing, Marketing Technology, Engineering and Operations.\n\nYou will join the global Media Operations team responsible for cutting edge promotional media solutions in security and creative distribution. Curiosity combined with technical media knowledge and a meticulous approach are the keys to success. Our ideal candidate has passion for media platforms, expertise in paid, owned and earned media operations, creative formats, operational best practices, quality assurance, stakeholder insights and continuous optimization.\nIn this role you will: <ul><li>Lead downstream solutions for creative launch while managing global workflows in partnership with the team and key stakeholders.</li><li>Bring a solution-first resolution approach and be accountable for implementation.</li><li>Partner with vendors and cross-functional teams to identify, optimize, and execute workflows that support quality output and efficiency initiatives for media operations.</li><li>Own intake and guidance for new regional programs and projects related to key objectives, including expansion of creative formats, varied media channels, and repeatable launch tasks.</li><li>Manage vendor workflow definition, training, monitoring, and escalation resolution.</li><li>Model best-in-class project management with communication of milestones, roadblocks, optimization, and key learnings.</li><li>Contribute to measurement methodology and operational frameworks that scale operational excellence.</li><li>Continuously evolve our business process outsourcing&nbsp; engagement model with partners while evaluating tooling solutions and tradeoffs with Engineering.</li><li>Leverage data and user insights to drive decision-making for new and existing work streams that deliver sustainable, high impact solutions to stakeholders.</li><li>Advocate, understand, and communicate the <a href=\"https://jobs.netflix.com/culture\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">company values</a>.</li></ul> The ideal candidate has: <ul><li>5+ years of Marketing & Social Media, Ad Operations, Entertainment Ad Tech, and/or Media Operations experience with applied project management methodologies and certifications.</li><li>Strengths building cross-functional relationships, developing insights, and managing projects while articulating progress and success.</li><li>Delivered highly effective solutions for media management by incorporating tooling, User Experience Testing (UAT), and vendor partnerships.</li><li>Deep understanding of media platforms and formats, with an appetite for continuous improvement.</li><li>Aptitude in the application of social media systems to meet security and launch challenges.</li><li>Experience in international environments, and knowledge of local languages a plus.</li><li>Mastered simplifying complexity, managing large sets of assets, and distributing with precision.</li><li>A data-driven approach to problem-solving and analysis; managing accountability for deliverables.</li><li>Propensity towards optimization, quality assurance and defined objectives.</li><li>Driven partnerships for tooling and workflow implementation, including issue resolution and end-to-end analysis.</li><li>Identified and resolved advanced technical issues across internal/external toolsets, adeptly troubleshooting with key partners.</li><li>Demonstrated ability to operate effectively in ambiguity and willingness to pivot as needed.</li><li>Excellent verbal and written communication skills and exceptional attention to detail.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000- $360,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here. <p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT44411-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013030", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT44411"], "team": ["Program / Project Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
