{"id": 790298013549, "name": "Coordinator, Film & Series Marketing - Japan", "location": "Tokyo, Japan", "locations": ["Tokyo, Japan"], "hot": 0, "department": "Marketing", "business_unit": "Streaming", "t_update": 1719273600, "t_create": 1719273600, "ats_job_id": "AJRT46527", "display_job_id": "AJRT46527", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is one of the world’s leading entertainment services with over 270 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nWe’re looking for an innovative, self-starter to fill the role of Coordinator, Film & Series Marketing, Japan, and create breakthrough ideas that market our titles and create a lasting brand story for local members.  This is an opportunity to lead the development, launch, and execution of 360-degree campaigns that pierce the cultural zeitgeist and drive global conversations about the Netflix brand and our titles.\n\nOur ideal candidate is strategic, solution-oriented, and highly passionate about storytelling. This person will serve as the strategist and creative lead for title campaigns.\n\nVisit our culture memo and long-term view to learn more about Netflix's unique culture and the opportunity to join our team. \n\nResponsibilities: <ul><li>Develop, lead, and execute unique and conversational title campaigns that place Netflix in the middle of the cultural zeitgeist.</li><li>Serve as creative lead for these campaigns from print/OOH, trailers/AV/Social, events/activations to non-traditional headline-grabbing creative.</li><li>Align with the Japan marketing strategy to establish Netflix's brand image within the Japanese market through campaign activities.</li><li>Work alongside other marketing functions (Social Marketing, Marketing Partnerships, etc.) to build impactful campaigns that demonstrate our values and ingrain us in Japanese culture.&nbsp;&nbsp;</li><li>Partner with and act as the main point of contact for local creative and media agencies to bring campaigns to life</li><li>Partner with and act as the main point of contact for marketing communications with local talent agencies and production companies to share our campaign strategies and to execute the campaign.</li><li>Work with and serve as the liaison between internal cross-functional teams (such as Content, Publicity, Product, etc.), ensuring that all aspects of a title campaign are cohesive across all lines of business.</li><li>Be part of our Dream Team to help Netflix better understand the needs and shifting cultural landscape of Japan.&nbsp;</li><li>Continue to innovate and push to think of the best media strategies for Netflix.</li></ul> Qualifications: <ul><li>A seasoned creative exec/marketer with a minimum 5 years of experience in building strategic and creative consumer marketing campaigns, preferably at a streamer, network, or studio with a background in entertainment or for a global lifestyle brand that intersects with Japanese entertainment and culture (TV, film, gaming, sport).&nbsp;</li><li>A natural leader, team player, and project manager; you are a selfless, collaborative marketing professional who will go beyond your roles to get great work done.</li><li>Passionate about great stories. You can talk on and on about your favorite shows, genres, and creators you admire in your life.</li><li>A proven track record of building impactful, world-class creative campaigns that connect with audiences and break through the cultural zeitgeist. We are not only building campaigns, we are transforming our properties into culturally relevant brands.</li><li>Knowledge and experience in building and executing strategic media strategies.</li><li>Inherently bold and comfortable with risk-taking.</li><li>Strong presentation, prioritization, and decision-making skills.</li><li>An entrepreneurial mindset. This person should be a proactive self-starter, who is not afraid to get their hands dirty and wear multiple hats.</li><li>Passionate and curious about all aspects of Netflix and the Netflix business at large.</li><li>Written and Verbal fluency in the Japanese language is required.</li><li>Fluency in the English language is preferable.</li></ul> Netflix Japan will not accept unsolicited resumes or applications from recruitment agencies, and we will not be responsible for any related fees. Please do not forward resumes to our career page or employees.<p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span><span><span><span><span><span class=\"WDH1\">Netflixは男女雇用機会均等法を順守しており、考え方や背景の多様性がより強力なチームを構築すると認識しています。Netflixは多様性・インクルージョンについて、真剣にかつ思慮深く取り組んでおり、人種、宗教、出身地、性別、性自認・性表現、経済状況、性的指向、年齢、婚姻状況、兵役、障がいの有無、その他の属性によって差別することはありません。</span></span></span></span></span></span></p>", "id_locale": "AJRT46527-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013549", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46527"], "team": ["Marketing"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
