{"id": 790298014610, "name": "ML Engineer L4, Consumer Inference", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1717545600, "t_create": 1717545600, "ats_job_id": "AJRT46010", "display_job_id": "AJRT46010", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>With more than 230 million members in over 190 countries, Netflix continues to shape the future of entertainment around the world. Machine Learning/Artificial Intelligence is powering innovation in all areas of the business, from helping members choose the right title for them through personalization, to better understanding our audience and our content slate, to optimizing our payment processing and other revenue-focused initiatives.\n\nThe Machine Learning Platform (MLP) provides the foundation for all of this innovation. It offers ML/AI practitioners across Netflix the means to achieve the highest possible impact with their work by making it easy to develop, deploy and improve their machine learning models. \n\nAs part of our mission to support the infrastructure for machine learning across the company, we are hiring for a Machine Learning Engineer to join our team to contribute to the team's mission of bridging the gap between ML research and productization. In this role, you will:\n\n-Develop customer facing libraries and services to productize machine learning models for efficient and scalable inference. \n-Develop and maintain online inference services that provide real-time predictions with low latency and high reliability.\n-Optimize and deploy large language models (LLMs) for efficient, scalable inference, ensuring high performance and low latency in production environments.\n-Maintain and improve a model registry to facilitate the discovery, versioning, and governance of machine learning models.\n-Participate in and improve ML Platform incident management and support workflows.\n\nWhat we offer\nOpportunity for impact. You will work on cutting edge ML infrastructure use cases and technologies. This role will develop into strategic ownership opportunities for defining MLP’s path from research to production, specifically focusing on building services and tools to accelerate research to production velocity for Netflix ML practitioners..\n\nResponsibility. Netflix offers true transparency and autonomy. Our culture is unique and is key to how we innovate. From day one, your expertise and opinion will be respected and valued by the team and you’ll be given autonomy in deciding the best direction to set for optimizing research to the production path for ML practitioners at Netflix.\n\nLearning. You will be developing libraries, tools and services to ensure an efficient and reliable journey of productizing ML models. You will have the opportunity to work with stunning colleagues who value collaboration and have a wealth of experience you can tap into.\n\nA work environment where you can grow your career. ML Platform offers a wide variety of projects that can help find the areas you are passionate about.\nWho will be successful in this role? <ul><li>You are highly customer-driven / developer-driven and empathic. You strive to always focus on delivering customer / user value with an excellent customer service mentality.</li><li>You have a strong understanding of building scalable and efficient model serving solutions to support large-scale inference for generative models and large language models (LLMs). You create solutions that your stakeholders love and you drive development success from planning to implementation to delivery.</li><li>You can successfully execute changes within a team's systems, including developing, testing, deploying, and revising solutions.</li><li>You can communicate and collaborate effectively&nbsp; (e.g. project meetings, team meetings, code reviews) with immediate team peers and cross-functional project teams.</li><li>You are eager to both go deep and wide on ML-facing projects. When a project needs deep technical expertise in a domain area you are able to get up to speed quickly. When projects require breadth of focus you are eager to do what’s needed to deliver value even if it means going outside of your comfort zone.</li></ul> Skills: <ul><li>Strong programming skills, particularly in languages such as Python and Java, and familiarity with ML libraries and frameworks like TensorFlow, PyTorch.</li><li>Familiarity tools and techniques for deploying machine learning models into production environments, with a particular emphasis on GPU inference optimization (e.g., Triton Inference Server, TensorRT), as well as containerization (e.g., Docker) and orchestration (e.g., Kubernetes).</li><li>Experience designing with data handling, preprocessing, and transformation techniques to prepare data for model inference.</li><li>Demonstrated industry-leading experience in large-scale build, release, CI/CD and observability techniques, with particular emphasis on multi-language environments including Scala, Java, and Python.</li><li>Adopt and promote best practices in operations, including observability, logging, reporting, and on-call processes to ensure engineering excellence.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $464,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT46010-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014610", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT46010"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
