{"id": 790298012971, "name": "Principal Product Manager, Data Platform - Analytics Experience", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1714435200, "t_create": 1714435200, "ats_job_id": "JR27405", "display_job_id": "JR27405", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to be joining Netflix as we continue to transform entertainment. We deliver billions of hours of movies and TV shows per month to more than 220 million members in over 190 countries. At Netflix, we want to entertain the world. To achieve this, we must be able to rapidly build and ship innovative experiences for our members and creators all around the globe.\n\nWithin the Platform Engineering organization, our Data Platform exists to maximize the value of data throughout Netflix by improving the productivity and innovation of Netflix engineers, data scientists, machine learning practitioners, and business users. Our Data Platform enables Netflix to scale effectively and evolve rapidly by providing highly performant, secure, compliant, and flexible data infrastructure that supports the expanding needs of the business. Ultimately, we aim to democratize data by making it more accessible and useful to technical and non-technical employees.\n\nThe Opportunity\n\nWe are looking for a principal technical product manager to help drive the next evolution of our analytics experience at Netflix. Your mission is to simplify and accelerate data experience at Netflix and offer best-in-class experiences to Netflix software engineers, data engineers, analytics engineers, data scientists, machine learning practitioners, and business users.\n\nYour focus will be on the end-to-end experience for our users who need to leverage our analytics platform to accomplish their work. You will lead the vision and strategy for our data development experience, remote analytics environments, Notebooks, data visualization, and business intelligence tools leveraged by technical and non-technical talent at Netflix for business-critical work. Examples of the types of opportunities you might tackle include developing a seamless end-to-end managed ETL platform to reduce friction and toil for our users, enabling semantic modeling at scale to improve self-service data analytics for multiple Netflix businesses, and integrating the data analytics platform with machine learning workflows. The scope and impact of this role is significant. You'll be responsible for managing a portfolio of products and driving holistic product strategy and prioritization across them.\n\nIf you’re looking for a deeply technical and highly dynamic opportunity that will have an outsized impact on the future of data platform at Netflix, we’d love to talk to you!\nWhat You Will Do <ul><li>Deeply understand customer needs, product analytics, and industry innovation to drive the product vision and strategy, maximizing business and customer impact.</li><li>Partner closely with senior management and engineering teams to define and align with stakeholders on vision, strategy, and roadmaps.</li><li>Develop product roadmaps in partnership with relevant product and engineering teams that execute on product vision and strategy and inform our engineering teams of what problems need to be solved.</li><li>Foster a metrics-driven environment that encourages quality experimentation and sets high standards for measuring product success.</li><li>Stay informed about industry advancements, influence their direction, and conduct comprehensive buy vs. build analysis to align with state-of-the-art solutions, encouraging ROI-based decisions.</li><li>Foster a collaborative environment with Netflix engineers, creating continuous feedback loops to ensure we solve the right problems and drive maximum impact for Netflix.</li><li>Exhibit robust problem-solving and decision-making skills, tackling technical and strategic challenges in innovative ways and leveraging data and intuition to make strategic choices in the face of ambiguity and complexity.</li><li>Ensure thoughtful product evolution that addresses product lifecycle and adoption experience.</li><li>Help evolve our customer engagement model, communication strategy, prioritization, and planning/road-mapping practices.</li></ul> What We’re Looking For <ul><li>8+ years of experience as a Technical Product Manager with at least 3+ years of domain experience in data analytics platforms, data analytics experience, or ML platforms.</li><li>Proven track record of managing and evolving a product portfolio and/or driving product vision and strategy</li><li>A healthy blend of technical depth and deep domain expertise with a customer-focused mindset</li><li>Demonstrated passion and experience in one or more of the following technologies: Compute engines (Spark, Trino), ETL Platforms, Notebooks and BI Tools</li><li>Strategic thinker who can connect customer use cases to technology solutions and think holistically about the end-to-end experience</li><li>Ability to manage a portfolio of bigger and smaller bets while balancing short-term goals and long-term vision</li><li>Comfortable applying a combination of qualitative and quantitative methods to define success </li><li>Leverages product intuition and judgment to solve problems and make decisions without perfect information</li><li>Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’</li><li>Excellent communication skills; timely communication with clear expectations</li></ul> \n\nOur culture is unique, and we live by our values, so it’s worth learning more about Netflix culture.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $340,000 - $975,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nMore About Data Platform @ Netflix\nIncremental Processing using Netflix Maestro and Apache Iceberg\nOrchestrating Data/ML Workflows at Scale With Netflix Maestro\nReady-to-go sample data pipelines with Dataflow\nNetflix Data Engineering Summit<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27405-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298012971", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27405"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
