{"id": 790298014083, "name": "Software Engineer (L6) - Revenue Finance Infrastructure", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719360000, "t_create": 1719360000, "ats_job_id": "JR28356", "display_job_id": "JR28356", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>At Netflix, we want to entertain the world and are constantly innovating how entertainment is imagined, created, and delivered to a global audience. Engineering teams within Netflix work hard every day to scale and innovate this content production and member experience in an ever-growing complex software landscape.  </p><p></p><p><br />The Revenue Finance Infrastructure team is composed of talented engineers dedicated to developing products that optimize revenue financial workflows and build scalable, accurate systems to manage revenue operations for all Netflix customers. Our team is responsible for everything from accurately recording and reporting financial operations and transactions to data-crunching jobs that process billions of dollars in financial events every day. We&#39;re seeking a self-motivated individual who is excited about the opportunity to work on complex projects and drive measurable results.</p><p></p><p><br />As an Engineer on the team, you will work with Product Managers, cross-functional engineering teams, and Revenue Finance to design and evolve architectures that can handle massive data. You will build highly configurable pipelines to support global workflows for complex financial functions. Additionally, you will ensure that the technical strategy aligns with the company&#39;s revenue goals and create innovative solutions to drive revenue growth.</p><p></p><p><br />Expectations:</p><p></p><ul><li>Working experience in building Revenue or Monetization products involving invoicing, revenue recognition, cash settlement, etc. </li><li>Experience with building configuration-driven platform systems that work across multiple business lines and use cases</li><li>Proficient in a JVM language such as Java, Scala, Python, etc</li><li>Experience working with big data technologies such as Apache Spark, Apache Flink, Kafka, and Hive</li><li>Proficient with gRPC, GraphQL, or RESTful API design and implementation.</li><li>Experience with distributed data streams, big data processing, and solving large data challenges.</li><li>Experience with driving alignment, managing projects, and effectively collaborating with stakeholders and cross-functional teams to launch revenue products and bring business initiatives to life</li><li>Experience with architecting elegant and maintainable code with a focus on autonomy and support from the team</li></ul><p></p><p></p><p>About you:</p><p></p><ul><li>Professional experience in building financial and monetization solutions, preferably on the revenue and tax side.  </li><li>Background in building configuration-driven platform solutions that help drive accounting and tax determination.</li><li>You are driven by the desire to solve hard technical problems with the goal of automating and scaling everything!</li><li>You demonstrate exceptionally deep and/or broad knowledge and skills in big data distributed systems. </li><li>You have a successful track record of delivering results that are open-ended or ambiguous and result in significant business or technical impact. </li><li>You can effectively collaborate with cross-functional teams while also increasing the productivity and success of your teammates.</li><li>You can influence technical strategies and identify gaps and opportunities across solutions and teams.</li></ul><p></p><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is  $300,000 - $900,000.</p><p><br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.</p><p><br /><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28356-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014083", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28356"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
