{"id": 790298014017, "name": "TPM 6 - Cloud Games", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering Operations", "business_unit": "Streaming", "t_update": 1712534400, "t_create": 1712534400, "ats_job_id": "AJRT29585", "display_job_id": "AJRT29585", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix\nAt Netflix, we want to entertain the world and, over the last few years, have been expanding our offerings to products like Live and Games. We aspire to connect our members with a variety of high-quality games that they’ll enjoy, starting with mobile but expanding to additional devices through the cloud. We make games for all members, with the conviction that everyone can have fun in a game if we put the right experience in front of them. We want Netflix to be a global top-5 game company, known as much for its great games as its awesome shows and movies.\n \nThe Role\nThis role will work closely with the Infrastructure Engineering, Game Experience Engineering, Product, and Games Studios to ensure we are delivering efficient, scalable, and reliable game streaming infrastructure that is a core part of our Cloud Games program. We are looking for an experienced technical program manager who can partner closely with engineering managers, engineers, product managers, and other technical program managers to execute complex technical programs. If you’re looking for a technical and highly dynamic opportunity that will have an outsized impact on the future of software engineering at Netflix, we’d love to talk to you!\n\nWhat you will do: <ul><li>Build and manage the roadmap, in collaboration with technical teams (including Engineering, Product, Data Science, Game Studio, etc), that focus on building a highly efficient, scalable, reliable, and secure infrastructure</li><li>Leverage deep knowledge and functional expertise to drive road mapping, execution planning and cross-functional alignment across multiple stakeholder groups.</li><li>Craft and drive engagement with partners, work to decompose requirements into technical execution plans with multiple engineering teams, track progress towards goals, and report status to product, customers, and technical leadership.</li><li>Champion breaking out annual goals into measurable milestones while proactively managing risks, blockers, and delays.</li><li>Manage cross-functional dependencies, risks, and changes effectively by optimizing scope, schedule, and resources accordingly.</li></ul> What we are looking for: <ul><li>You have domain expertise in one of the following areas: server infrastructure, distributed systems, game performance optimization</li><li>You are highly skilled, experienced, and enjoy orchestrating programs with many moving parts - people, needs, and technologies</li><li>You have an ability to identify gaps in solutions, debate technical approaches and weigh-in on product vs technology tradeoffs</li><li>You aren’t afraid to get your hands dirty, pulling data to provide insight, debug issues, and monitor system health</li><li>You have a data driven mindset in your decision making</li><li>You have a deep understanding and point of view within your technical domain(s) of expertise.&nbsp;</li></ul> Basic Qualifications: <ul><li>10+ years of experience driving large scale SW projects with engineering and product teams</li><li>4+ years of software engineering, systems engineering or technical product/program management experience</li><li>Experience managing projects across cross functional teams, building sustainable processes and coordinating release schedules</li><li>Excellent written and verbal communication skills, including clear articulation of business impact and technical constraints tailored to the audience</li><li>Self-starter who enjoys tackling 0 to 1 problem spaces and quickly bringing organization and direction</li></ul> Additive Qualifications: <ul><li>Experience in cloud gaming and/or distributed systems</li></ul> Location of work: \nOur organization has a distributed team across the US. We are considering candidates who are willing to relocate to Los Gatos, California. The expectation is that candidates will work during core Pacific Standard Time business hours.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top-of-market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $240,000 - $725,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT29585-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014017", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT29585"], "team": ["Engineering Operations"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
