{"id": 790298014039, "name": "Security Software Engineer (L4), Client Security Integrations", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1712275200, "t_create": 1712275200, "ats_job_id": "JR27204", "display_job_id": "JR27204", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>As a global company, Netflix’s customers come from diverse backgrounds. And each of these backgrounds allow them to experience joy from Netflix in their own unique way. Ultimately, this joy is rooted in our customers’ ability to trust Netflix. At Netflix, we earn this trust through our actions every day. And we work hard to continue to build this trust with our customers throughout the world. With the growth of Netflix consumer products to include new verticals such as Games, Live and Ads, we are evolving our solutions to support the unique needs of additional consumer facing solutions, reflecting unique requirements for transported data and integrations. </p><p></p><p><br /><br />The Client Security Integrations team provides the security strategy and client engineering solutions to protect content, application integrity, and subscriber data. We are responsible for integrating the engineering security features for all Netflix client applications, working directly with client platform teams within and outside of Netflix. </p><p></p><p></p><p><br />What You Will Work On:</p><ul><li>Build a vulnerability management solution for Netflix and third party applications on Consumer Electronics devices (TV, mobile, etc.).</li><li>Integrate scanning tools, develop custom software, and orchestrate flows within the Netflix environment.</li><li>Provide actionable guidance to stakeholders to reduce security risk and protect Netflix’s business model.</li><li>Work with external vendors and drive product requirements on behalf of Netflix.</li><li>Flexible language skills including Java, Python.</li></ul><p></p><p>Desired Skills and Background:</p><ul><li>Experience in container security space and challenges.</li><li>Energized by a diverse and constantly evolving environment to deliver innovative solutions to security challenges.</li><li>Take ownership of deliverables from end to end, including requirements, design, implementation, test, and deployment.</li><li>Consider security vs usability trade offs across a complex, cross functional system with multiple touch points and stakeholders. </li></ul><p></p><p>Nice to have:</p><ul><li>Experience working with game development and engines such as Unity and Unreal.</li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.</p><p></p><p></p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><span>here</span></a>.</span></p><p></p><p></p><p></p><p><span>Netflix is a unique culture and environment. Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><span>here</span></a>.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27204-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014039", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27204"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
