{"id": 790298014200, "name": "Senior Content Designer, Merchandising", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1716768000, "t_create": 1716768000, "ats_job_id": "JR28324", "display_job_id": "JR28324", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>We’re seeking a Senior Content Designer to partner with our Merchandising & Communications XD team on designing highly relevant, scalable experiences that connect the right members, with the right content, at the right time. \n\nAbout Merchandising & Communications XD\nMerchandising & Communications XD leads the creation and evolution of Netflix’s Merchandising design system. They strive to make every member feel like “Netflix gets me” by anticipating what they want and fostering deeper connections with content they love. This team is part of Netflix’s broader Member XD team, which designs the end-to-end member experience for TV, mobile, and other devices — from the moment someone joins Netflix.\n\nAbout Content Design\nContent Designers partner with Product Designers, Product Managers, Product Marketing, Globalization specialists and others to create Netflix’s product experiences. Designing through the lens of language, they develop testable, strategic content that minimize friction and helps Netflix speak meaningfully to a global audience.\n\nAbout You <ul><li>You advocate for the user, designing balanced solutions that offer choices (and show clear value) to the user vs. trying to \"sell\" something to them.</li><li>You’re a demonstrated systems thinker with familiarity in taxonomy creation.</li><li>You have rich experience categorizing or describing content for users, ideally in an entertainment-related setting.</li><li>You're equally comfortable writing vivid copy, articulating the rationale behind word choices and drafting strategic internal documents.&nbsp;</li><li>You know how to think critically about user journeys and incorporate data and research into your work.&nbsp;</li><li>You're comfortable advocating for your point of view, but also highly collaborative and responsive to feedback.&nbsp;</li><li>You're known for building strong working relationships with colleagues who have different backgrounds and areas of expertise.&nbsp;</li><li>You're self-directed and set a high bar for execution and communication.&nbsp;</li></ul> What You’ll Do <ul><li>Devise frameworks for new text assets that capture different dimensions of Netflix shows, movies and games, and provide clear guidance to fulfillment teams.</li><li>Create and execute Content Design strategies that bring the Netflix catalog to life and elevate the user experience.</li><li>Collaborate closely with the Netflix Design Systems team to design, document, and evolve a Merchandising Design System.</li><li>Collaborate with cross-functional teams innovating around merchandising strategy and tactics to leverage and up-level our Merchandising design system.&nbsp;</li><li>Maintain central resources that serve as a source of truth for cross-functional teams.&nbsp;</li></ul> Qualifications <ul><li>5+ years of experience working on a user-focused entertainment or publishing platform</li><li>Ability to build successful working relationships with stakeholders, partners and team members</li><li>Demonstrated creative and analytical writing skills</li><li>Experience developing language frameworks and strategies</li><li>Experience working on global products and partnering with Globalization</li><li>Experience with a/b testing preferred</li><li>Experience creating or contributing to design systems, and evolving them as business needs change</li><li>Understands the intersection of user journeys and merch lifecycles</li><li>Comfortable working with ambiguity - able to bring rigorous design thinking and operational structure to complex and evolving problem spaces.</li></ul> This full-time, salaried position reports to the Senior Manager of Content Design, Member XD. This role is ideally based in our Los Gatos offices. There is also the option to be based out of LA, or remotely from the West Coast/PST working hours. Expect to travel monthly to meet with your teams, stakeholders, and partners.\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $120,000-$515,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28324-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014200", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28324"], "team": ["Product Discovery"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
