{"id": 790298010761, "name": "Director, Globalization - EMEA", "location": "Amsterdam, North Holland, Netherlands", "locations": ["Amsterdam, North Holland, Netherlands"], "hot": 0, "department": "Product Discovery", "business_unit": "Streaming", "t_update": 1718323200, "t_create": 1718323200, "ats_job_id": "JR28454", "display_job_id": "JR28454", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>We are the world’s biggest fans of entertainment, and we’re always looking to give members the thrill of the next great story. It’s an exciting time to join Netflix as we continue to raise the bar and innovate in how we serve our fans and members.\n\nThe Globalization team, an organization within Product Discovery & Promotion (PDP), is responsible for translating and culturally adapting most of Netflix's creations, from beautiful user interfaces to cinematic original programming. We treat each country we enter differently since it is not just about translation; it is about providing our audience with an experience that feels local, and we do it at scale.\n\nWe are looking for the Director of Globalization - EMEA (Europe, Middle East and Africa) to lead our growing localization efforts in the region. As the Director of Globalization, you will lead a team of leaders and individual contributors who are responsible for the quality, authenticity, and cultural adaptation of Netflix experience in different languages of EMEA. You will work across large and diverse teams to drive the overall strategy and execution of localization launch strategy for the region, resulting in a great member experience through excellent content, marketing, and product localization. You will grow and support the globalization team members, and work vert collaboratively with the leaders and members of the PDP EMEA organization.  This role is based in Amsterdam. \n RESPONSIBILITIES <ul><li>Provide leadership and mentorship for the Language Manager teams and Program and Project Managers across different countries in EMEA. Hire, develop and retain top talent for the organization.</li><li>Identify opportunities to increase an international mindset across the company. Work with cross-functional teams throughout Netflix to advocate for our EMEA members, generate insights, initiate programs, and drive international experience and localization decisions for the region.&nbsp;</li><li>In collaboration with other localization leaders, develop operational and creative strategy for Globalization while representing the needs of the EMEA region into those strategies.&nbsp; Adapt the global localization strategy to the region to ensure prioritization of efforts and focus of resources to deliver against overall business objectives and KPIs.</li><li>Provide thought leadership by identifying areas for growth and improvement to quality and scale the business.</li><li>Advocate on behalf of the PDP and Localization team, building partnerships with key regional organizations including Content, Marketing, business development, PR, and other cross functional teams.</li><li>Be a great partner to other functions within the Globalization and PDP organizations</li><li>Represent Netflix at company and industry events&nbsp;</li></ul> ROLE REQUIREMENTS <ul><li>15+ years of people and organizational management in a global enterprise environment. Background in the entertainment industry is a plus.</li><li>10+ years of scaled operations, localization and internationalization.&nbsp;</li><li>Ability to work effectively cross-functionally; demonstrated leadership, influencing, and execution skills at the executive level.</li><li>Superior scaled operational management and organizational skills with an ability to translate complex ideas into simple and intuitive communications.</li><li>Demonstrated success in business analysis and strategic planning. Ability to make data and insights accessible to a non-expert audience.</li><li>Proven effectiveness at delivering impactful presentations at the executive level; great interpersonal and communication skills.&nbsp;</li><li>Regional expertise and fluency in more than one language is required.&nbsp;</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "JR28454-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298010761", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28454"], "team": ["Product Discovery"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
