{"id": 790298020509, "name": "Software Engineer L5 - Ads Platform", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Unknown", "t_update": 1721433600, "t_create": 1721433600, "ats_job_id": "JR28725", "display_job_id": "JR28725", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>We launched a new ad-supported tier in November 2022 to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply engaged.</p><p></p><p></p><p>Our Team<br /><br />The Ads Platform Engineering teams build advertising systems and integrations that power the delivery of ads using our world-class content delivery ecosystem. We use a number of Netflix investments and innovations to power our ads - a unique mix of client and server-side ad insertions, state-of-the-art content delivery systems, ad encoding recipes, content understanding and metadata, etc. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. We also ensure that advertiser brand safety is ensured during serving, members only see the most appropriate ads for them.</p><p><br /><br />Our team is new and yet faced with the enormous ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.</p><p><br /><br />We are looking for highly motivated engineers working in the advertising space who are excited to join us on this journey.</p><p><br /><br /><b>Skills &amp; experience we’re seeking:</b></p><ul><li><p>Well-grounded domain experience in ANY ONE of these 4 areas :</p></li><li><p>1- (Ad Delivery) Building publisher-side ad tech systems such as ad servers, bidders and pacers, yield optimizers, or their demand-side counterparts (DSPs).</p></li><li><p>2 - (Identity and Audience Targeting) Built identity graphs, integrated with DMPs, and worked on enabling audience targeting, 1P or 3P segments.</p></li><li><p>3 - (Measurement) Familiarity with brand lift measurement, incrementality-based measurement, outcomes measurement, etc.</p></li><li><p>4 - (Sales Enablement) Guaranteed and non-guaranteed inventory reservations and management, Sales tooling, Integrations with OMS, CRM systems, etc.</p></li><li><p>General understanding of the advertising marketplace and landscape.</p></li><li><p>Worked closely with ad operations to enable campaign setup, targeting, reporting, and advertiser needs.</p></li><li><p>Developed many cloud-based applications and comfortable with modern programming languages (preferably object-oriented).</p></li><li><p>Familiar with A/B testing and experimentation.</p></li></ul><p></p><p><br /><b>Nice to haves:</b></p><p></p><ul><li><p>Contributed to an ads industry technology standard (e.g VAST, OpenRTB) or worked on an industry consortium effort, working group etc.</p></li><li><p>Familiarity with legal compliance and changing landscape of ads regulations around the world.</p></li><li><p>Experience working in the CTV space and knowledge of it’s unique constraints</p></li></ul><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28725-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298020509", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28725"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
