{"id": 790298014206, "name": "Senior Manager, Operations - Live Experiences", "location": "Los Angeles, California, United States of America", "locations": ["Los Angeles, California, United States of America"], "hot": 0, "department": "Consumer Products", "business_unit": "Streaming", "t_update": 1713916800, "t_create": 1713916800, "ats_job_id": "AJRT45561", "display_job_id": "AJRT45561", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Our Live Experiences team puts fans at the center of their favorite stories, in real life, both through permanent entertainment venues, Netflix House, and globally touring attractions.  Netflix Houses are our permanent, always-on entertainment venues, where guests can step into their favorite stories and have IRL experiences, with the ultimate goal of increasing fandom for our members.  We want these experiences, along with merchandise offerings, to help promote our titles and build them into title brands so they become part of the zeitgeist for longer periods of time and drive long-term value.\n\nAs the Senior Manager of Netflix House Operations, you will lead the pre-opening lead up to the launch of the first two Netflix Houses, as well as oversee the steady-state operational growth of multiple Netflix House locations.  Leveraging the on-site General Managers, partnering with internal Netflix teams, and working with external partners, you will develop strategies and iterative operational development plans to optimize the Netflix House operations, including best-in-class operational service, financial profitability, and increased fandom through member engagement.\nWhat you will do: <ul><li>Develop and lead the overall operational framework for Netflix House.</li><li>Lead and mentor a network of General Managers to optimize individual site operations.</li><li>Lead the process of P&L management, budgeting, and revenue/cost efficiency exercises.</li><li>Develop a framework to evaluate operational success in each House location, including factors such as profitability, fandom, and operational learnings.</li><li>Lead the business relationship with multiple third-party operators.</li><li>Manage cross-functional initiatives that cut across various Netflix House locations.</li><li>Coordinate with the Netflix House development team to incorporate key learnings and challenges to optimize future House development plans.</li><li>Align with key stakeholders across consumer products, brand partnerships, content and marketing.</li><li>Establish regular meetings with key stakeholders to update on progress and solicit feedback.</li><li>Promote and foster a mindset of continuous innovation for internal teams and external partners.</li></ul> What we need from you: <ul><li>Demonstrated 12+ years of experience leading operations/operational improvement in a Location Based Entertainment, Theme Park, Touring, or other attraction environment.</li><li>Experience in developing operational budgets and P&L management.</li><li>Experience with operational planning and/or Industrial Engineering in a high-volume environment.</li><li>Experience with touring operations and/or rotating attraction product.</li><li>Experience in managing geographically diverse operations and teams.</li><li>Experience with building and developing highly functional teams.</li><li>Global operations experience is a plus.</li><li>Excellent communication skills, both verbal and digital.</li><li>Strong desire to think outside the box and innovate.</li><li>Excellent organizing skills using digital tools and Google Suite.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $250,000-$515,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45561-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014206", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45561"], "team": ["Consumer Products"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
