{"id": 790298014562, "name": "Software Engineer L5, LLM Compute & Serving Systems", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1719532800, "t_create": 1719532800, "ats_job_id": "JR28547", "display_job_id": "JR28547", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Netflix is the world's leading streaming entertainment service, with over 300 million paid members in over 190 countries, enjoying TV series, feature films, and games across numerous genres and languages. Members can watch or play as much as they want, anytime, anywhere, on any internet-connected screen. \n\nMachine Learning/Artificial Intelligence powers all of our consumer experience, including content discovery and personalization, identifying and attracting new members to our product, optimizing our payment processing, and much more. \n\nMore recently, fast-paced innovation in large language models (LLMs) has greatly helped advance state-of-the-art technology in many areas of personalization, including search and recommendation experiences. \n\nThe Opportunity\n\nThe Consumer ML Serving team provides the computational platform on which we build nearly all our consumer-facing ML/AI applications. If you’ve seen it, we probably served it! We provide all the building blocks to serve ML at scale, including a real-time model serving platform, an event-driven model and feature compute framework, a distributed compute orchestration engine, and more. Additionally, as we expand to enable LLM innovation in numerous areas of personalization, we’re building model serving infrastructure for LLMs and other large foundation models.  \n\nWe are looking for a strong senior engineer to own and develop our long-term vision. Our systems power some of Netflix's most business-critical models, and we need you to take our ML/AI initiatives to the next level. You will play a highly cross-functional role, partnering with other engineers, product managers, machine learning engineers, and data/research scientists. \n\nIf you have a passion for building scalable, robust systems, are interested in pushing the envelope in applied ML algorithms, and enjoy seeing a direct line between your work and what our customers see on their screens, we want to talk to you. \n\n\nYou may enjoy working with us if you are: <ul><li>Self-driven and highly motivated to deliver top-tier ML infrastructure while navigating highly ambiguous environments and can execute 0-to-1 projects.&nbsp;</li><li>Eager to learn about new domains and ship high-quality, well-tested code.</li><li>Able to produce generic and optimal solutions while balancing near-term needs.</li><li>Excited to work in a multidisciplinary environment (engineering, algorithms, data engineering/science, and product experimentation).</li><li>Comfortable working in a hybrid team with partners distributed across (US) geographies & time zones.</li><li>Willing to take broad ownership of team responsibilities (building roadmaps, scoping, task breakdowns, etc.)&nbsp;</li></ul> We would especially love to work with you if have experience with: <ul><li>Building and operating high-traffic, real-time distributed systems and ML serving infrastructure for LLMs and other large foundation models.</li><li>Supporting large-scale ML models with a direct impact on what customers see.&nbsp;</li><li>Translating the requirements of research scientists into generic platform offerings.&nbsp;</li><li>Delivering systems requiring high availability, throughput, and performance.</li><li>Navigating highly ambiguous environments.&nbsp;</li><li>Taking on and executing zero-to-one projects.</li><li>Leading projects with 3-4 other engineers.</li><li>Building applications in an object-oriented programming language. (We work primarily with Java, and while prior Java experience is not required to interview, you will be expected to become proficient on the job.)&nbsp;</li><li>DevOps for large applications, including performance tuning, optimization, deployment management, and capacity planning.&nbsp;</li><li>Public cloud like AWS, Azure, or GCP.</li></ul> …and if: <ul><li>You are a proactive, effective communicator and have a strong bias towards action.</li><li>You have a BS/MS in Computer Science, Applied Math, Engineering, or a related field.</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR28547-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014562", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR28547"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Remote"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
