{"id": 790298013214, "name": "Research Engineer (L5) - Growth and Membership", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Data Science & Engineering", "business_unit": "Streaming", "t_update": 1717459200, "t_create": 1717459200, "ats_job_id": "AJRT45935", "display_job_id": "AJRT45935", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p>Role location: Los Gatos, CA or Remote.\n\nAt Netflix, we seek to entertain the world. We have more than 270 million members in 190 countries, reflecting that great stories can come from anywhere and be loved everywhere. Our payments teams across the world are a key part of this mission, continuously optimizing the set of payment methods that we offer in each country and investing in innovation to enable a seamless payments experience for our members. This focus on operational excellence makes it easy for customers to access Netflix and enjoy their next story without interruption.\n\nData is at the heart of our payments strategy and innovation at Netflix. In the Payments & Partnerships Data Science & Engineering team, we provide guidance to the business not only through analysis, metrics research, experimentation, causal inference, and modeling, but also through exceptional judgment, partnership, and business acumen. Our team’s portfolio includes production ML models that we maintain and innovate upon, as well as zero-to-one efforts in greenfield application spaces. These deeply collaborative, innovative efforts unlock millions of dollars of revenue impact each year.\n\nAs a Senior Research Scientist, you will join this team of stunning Data Scientists, Machine Learning Scientists, Research Scientists, and Analytics Engineers. You’ll lead the development of ML models that improve member experience and efficiency for billions of payments transactions each year and stop fraud in real time. You will be responsible for operating, as well as innovating on, these algorithms in production, and validating through running offline experiments, and building online A/B tests to run in production systems. You’ll partner with other ML researchers and engineers in Growth on cross-functional ML initiatives. You’ll spot gaps in how we’ve done things before, and you’ll find a better way to do them. \n\nTo be successful in this role, you’ll bring a solid machine learning background, strong software development skills, rapid learning velocity, and a passion for solving problems end-to-end. You will need to demonstrate strong communication and leadership skills, an ability to set priorities, and a strong bias to action in a dynamic environment.\nIn this role, you will: <ul><li>Develop high impact machine learning models in Payments and Growth</li><li>Partner closely with Payments leads and business analysts to identify high value applications of machine learning, translating business intuition into data-driven solutions&nbsp;</li><li>Work closely with scientists and engineers on detailed requirements and implementation of end-to-end solutions at scale</li><li>Inform and influence the development of better infrastructure for developing and deploying ML models, often via collaboration with our Machine Learning Platform team</li></ul> What you’ll bring: <ul><li>Deep end-to-end ML experience with a strong track record of deploying successful ML solutions</li><li>Exceptional communication skills, able to explain complex technical concepts clearly to cross-functional partners&nbsp;</li><li>Exceptional thought partnership, able to own direct relationships with stakeholders and build credibility through clarity and judgment</li><li>Willingness to learn and rapidly absorb business context in the complex payments ecosystem</li><li>Strong experience in a ML/DL framework (e.g., scikit-learn, Keras, PyTorch, TensorFlow)</li><li>Excellent software engineering skills in multi-language settings with Scala, Java, and Python</li><li>PhD or Masters in Computer Science, Statistics, or related field is a plus</li><li>Knowledge of payments is a plus</li></ul> What you’ll learn: <ul><li>Innovation and partnership on a global scale, navigating the balance of technical rigor with business requirements</li></ul> Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix is a unique culture and environment.  Learn more here.<p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT45935-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013214", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT45935"], "team": ["Data Science & Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
