{"id": 790298014635, "name": "Sr. Manager, Product Operations - Ads", "location": "New York, New York, United States of America", "locations": ["New York, New York, United States of America"], "hot": 0, "department": "Product Management", "business_unit": "Streaming", "t_update": 1719792000, "t_create": 1719792000, "ats_job_id": "AJRT43917", "display_job_id": "AJRT43917", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>We recently launched a new ad-supported tier to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point while also creating a compelling path for advertisers to reach deeply immersed audiences.</p><p></p><p></p><p><br />Our Team</p><p></p><p><br />The Ads Platform team builds the advertising systems and integrations that power the delivery of ads using our world-class content delivery ecosystem. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. Our team is new and yet faced with the ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.</p><p></p><p></p><p><br />The Netflix Advertising team is seeking a Product Operational Lead to join the Advertising Product team.  The Advertising Product Operations team accelerates product outcomes by building and enabling the people, systems, tools, and processes to grow the rapidly scaling ads products. You will partner with Product, TPM, Engineering, Data Science, Data Engineering, and other cross-functional leaders to establish the operational framework for the advertising product team.</p><p></p><p><br /><br />We are searching for an operational expert with experience leading product operations for enterprise products. You excel in creating and implementing scalable processes and frameworks that drive efficiency and growth. You thrive in dynamic environments and work with a high degree of autonomy. Your problem-solving skills are exceptional, and you have a knack for bringing clarity and structure to complex situations.  You are adept at collaborating with product managers, engineers, advertising professionals, and executives, tailoring your communication to suit each audience effectively.</p><p></p><p><br />What you&#39;ll be doing:</p><ul><li>Partner directly with Product Management and cross-functional teams to successfully deliver products</li><li>Lead operational activities in close coordination with the Ads VP of Product Management.</li><li>Establish and scale portfolio and product life cycle management activities </li><li>Enable product frameworks and processes to support prioritization and launch activities</li><li>Develop and implement the operating framework for the advertising product team including establishing the proper meeting cadence, responsibilities framework, and stakeholder alignment activities.</li><li>Own the operationalization of product processes, artifacts, reporting, analysis, and stakeholder evangelization</li><li>Lead improvement initiatives to scale the Advertising product organization</li><li>Grow a team of product operations leads to support the scaling of advertising our product portfolio</li></ul><p></p><p>We’re seeking a candidate who has:</p><ul><li>10&#43; years as a Product Management, Program Management, or Product Operations leader</li><li>Experience defining product strategies, aligning roadmaps, and enabling focused execution </li><li>Demonstrated ability to design and implement operational change programs </li><li>Demonstrated ability to drive outcomes in a rapidly scaling environment </li><li>Demonstrated ability to lead, influence, and organize complex and highly technical programs</li><li>Expert with a variety of product development processes and methodologies</li><li>Expert standing up new product development and cross-functional processes </li><li>Experience with executive stakeholder communications, reporting, and evangelization</li><li>Experience with a variety of project management and product development tools</li><li>Experience growing a team from inception</li><li>Outstanding written and verbal communication skills.</li></ul><p></p><p>Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $340,000-$975,000. </p><p></p><p><br /><br />Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs.  Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more details about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\">here</a>.</p><p></p><p><br /><br />Netflix is a unique culture and environment.  Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\">here</a>.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "AJRT43917-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014635", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43917"], "team": ["Product Management"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
