{"id": 790298013687, "name": "Engineering Manager", "location": "Los Gatos, California, United States of America", "locations": ["Los Gatos, California, United States of America"], "hot": 0, "department": "Engineering", "business_unit": "Streaming", "t_update": 1708992000, "t_create": 1708992000, "ats_job_id": "JR27815", "display_job_id": "JR27815", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><b>The Role</b></p><p>As part of the Content Engineering team, Metadata Distribution provides the infrastructure to safely and quickly verify, compute, package, and distribute the extensive catalog library, structure, and liveness that drives what you see and play when you use the Netflix product. This information plays a crucial role in shaping the user experience on Netflix, influencing everything from the recommendations you receive, to the way you experience content and even how the content is played back.</p><p></p><p><br />As an Engineering Manager, you will:</p><ul><li>Coach a team of highly driven back-end focused senior engineers, providing them with robust career development opportunities.</li><li>Establish strong partnerships with upstream teams to better model new entities in the ecosystem and any new metadata needs.</li><li>Establish partnerships with downstream Engineering to understand controls and distribution needs in service of supporting new consumer product behaviors. </li><li>Ability to drive architectures and decisions for technology innovation. This team is responsible for launching tiles on the Netflix product and the engineering manager acts as the product manager for some services.</li><li>Ability to anticipate how new company initiatives will affect the movement of Title data and determine the most effective ways to evolve existing systems. Understanding the pros and cons of various options across different technology layers of the flow is essential.</li><li>Represent the Content Engineering team in cross-functional forums.</li><li>Ability to challenge designs and propose solutions for highly scalable distributed systems while minimizing technology costs and troubleshooting.</li></ul><p></p><p>About you:</p><ul><li>Prior expertise in all aspects of the data lifecycle such as modeling, movement, and distribution in highly scalable and low latency environments for core company data. </li><li>Experience as an Engineering Manager is required.</li><li>Experience leading teams working on highly scalable mission-critical distributed systems. </li><li>Systems thinker with a strong desire to understand the entire end-to-end architecture and data flow.</li><li>Strong influencing skills across partners and non-direct reports.</li><li>Able to work with a wide breadth of stakeholders/partners ranging from operations, creative teams, engineering, legal, security, etc. </li></ul><p>Our culture is unique, and we live by our values, allowing you to do your best work and grow. To learn more about Content Engineering, feel free to listen to this video.</p><p></p><p><br />Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $190,000 - $920,000.<br /> </p><p></p><p><span>Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits <a href=\"http://jobs.netflix.com/work-life-philosophy\" target=\"_blank\"><span>here</span></a>.</span></p><p></p><p></p><p><span>Netflix is a unique culture and environment. Learn more <a href=\"http://jobs.netflix.com/culture\" target=\"_blank\"><span>here</span></a>.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.</span></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>Job is open for no less than 20 days and will be removed when the position is filled.</span></p>", "id_locale": "JR27815-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298013687", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["JR27815"], "team": ["Engineering"], "posting_date": ["07-23-2024"], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
