{"id": 790298014172, "name": "Consumer Products EMEA Product Development Coordinator (FTC)", "location": "London, United Kingdom", "locations": ["London, United Kingdom"], "hot": 0, "department": "Consumer Products", "business_unit": "Streaming", "t_update": 1719273600, "t_create": 1719273600, "ats_job_id": "AJRT43791", "display_job_id": "AJRT43791", "type": "ATS", "job_description": "<p>Netflix is one of the world’s leading entertainment services with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.</p><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:left\"><b>The Role</b></p>It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is the world's leading internet entertainment service with over 270 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films and games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, as much as they want, anytime, anywhere, and can change their plans at any time. \n\nNetflix is pursuing consumer products because we believe it will drive meaningful show awareness/buzz with more tangible, curated ways to interact with our most popular content and in effect, drive long-term revenue. We want licensed merchandise to help promote our titles and build them into franchises so they become part of the zeitgeist for long periods of time. That’s where you come in. We’re seeking someone to support product development and executions for the Consumer Products team. Some travel is required within this role and open to the role being based outside of the UK in other European Netflix Offices.\nRole and Responsibilities: <ul><li>Creative approval and management of partners focusing primarily on softlines and softline adjacent partners.&nbsp;</li><li>Ownership of 3rd Party approval processes for these partners</li><li>An eye for detail and discernment; able to recognize incorrect use of Netflix IP on concepts as per the style guide guidelines, required legal attribution on branding and packaging solutions.</li><li>Time management skills in order to uphold contractual deadlines for approvals at all stages of development.</li><li>Support to partners with on-boarding to online PD tool and providing directions on asset usage.</li><li>Creative Lead for the POD creative within EMEA&nbsp;</li><li>Ad Hoc support of development for EMEA design team which includes; Presentation creation, Trend research and Sample management</li></ul> Qualifications: <ul><li>3+ years of marketing experience within consumer products or retail related industries.</li><li>Knowledge of design for consumer products</li><li>Knowledge of the licensing landscape with strong contacts and network across key markets within the EMEA licensing & retail landscape.</li><li>Knowledge of retail and industry trends.</li><li>High level of organizational skills, attention to detail, and ability to prioritize and time-manage across multiple deadlines.</li><li>English with an additional European language is preferred.</li></ul><p style=\"text-align:inherit\"><br /> </p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\"><span>We are an equal opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status or disability status.</span></p>", "id_locale": "AJRT43791-en-US", "locale": "en-US", "stars": 0, "medallionProgram": null, "location_flexibility": null, "work_location_option": null, "canonicalPositionUrl": "https://netflix.eightfold.ai/careers/job/790298014172", "isPrivate": false, "urls": {"links": {"blogs": [], "videos": []}}, "preApplyInfoBanner": {}, "custom_JD": {"data_fields": {"job_req_id": ["AJRT43791"], "team": ["Consumer Products"], "posting_date": [], "work_type": ["Onsite"]}, "display": [{"label": "Job Requisition ID", "value": "job_req_id"}, {"label": "Job Posting Date", "value": "posting_date"}, {"label": "Teams", "value": "team"}, {"label": "Work Type", "value": "work_type"}], "enable": true}, "hideUploadResumeOption": false}
