{"jobTitle": "Onboarding Specialist", "company": {"name": "Eating Recovery Center", "industry": "Mental Health Care", "size": "51-200 employees", "location": "United States"}, "location": "United States", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$20.00 - $32.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Mental Health Care", "description": "ERC Pathlight is an innovative, rapidly growing clinical leader in the behavioral health sector. Founded in 2008 by pre-eminent psychiatrists and psychologists in the eating disorder space, ERC Pathlight now treats over 6,000 patients per year, operates more than 30 facilities in 9 states and delivers tele-healthcare to patients nationally. We offer the most comprehensive treatment program in the country for patients who struggle with eating disorders, mood and anxiety and trauma-related disorders.", "responsibilities": "The Onboarding Specialist delivers a seamless and positive onboarding experience for the candidate/teammate. This person is key in the retention of our teammates. Onboard Specialist ensures all required pre-employment tasks are completed and the teammate is ready for Day 1. This role will partner and collaborate with cross-functional stakeholders such as Talent Acquisition, Payroll, HRIS, IT and Facilities for successful onboarding. Responsible for accurate teammate data in our HRIS system. Is an advocate for process improvement within the onboarding process, constantly seeking ways to improve to make it a better experience for candidates and teammates; increase turnover and efficiency. Supports various other people operations projects.", "qualifications": {"required": "3+ years of experience in previous HR position with focus on onboarding, Exceptional attention to detail, highly organized, with the ability to prioritize, multi-task, and manage multiple deadlines, Resourceful problem-solving skills. Ability to troubleshoot issues independently and drive impactful solution, Strong Excel knowledge with ability to create reports and PowerPoint to create and present professional decks, Excellent written and verbal communication skills, Exceptional customer service skills", "preferred": "Bachelors Degree, SHRM or PHR certificate"}, "skills": ["HRIS", "Onboarding", "Communication", "Problem Solving", "Excel"], "postedDate": "9 hours ago", "applicationDeadline": "", "benefits": "Competitive pay, comprehensive benefit plans, Generous Paid Time Off, 401(K) with company match and tuition reimbursement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/0013040539"}