{"jobTitle": "Logistics/ warehouse manager", "company": {"name": "Infrahire", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "IT Services and IT Consulting", "description": "InfraHire is looking for Logistics/ warehouse manager ( Bilingual Chinese- English) in Vernon, CA. <br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Maintain receiving, warehousing, RMA and outbound operations for airfreight and LTL volumes by initiating, coordinating, and enforcing program, operational, and personnel policies and procedures. Develop and implement warehouse SOP.</li><li>Comply with federal, state and local warehousing, material handling, and shipping requirement by studying existing and new legislation, enforcing adherence to requirements, advising management on needed actions.</li><li>Continuously improve operational performance and efficiency while satisfying both company and customer needs.</li><li>Maintain warehouse staff by recruiting, selecting, orienting, and training employees in cooperation with HR.</li><li>Maintain physical condition of warehouse by planning and implementing new design layouts including automated sorting machinery, inspecting equipment, issuing work orders for repair and requisitions for replacement.</li><li>Achieve financial objectives by preparing and annual budget, scheduling expenditures, analyzing variances, initiating corrective actions, report to management.<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Minimum 4 years operation and management experience in warehouse/distribution center.</li><li>Bilingual in Chinese and English</li><li>Strong knowledge of distribution center procedures, including analytical and problem-solving skills.</li><li>Strong administrative and organizational skills with the ability to drive results.</li><li>Ability to be flexible to work variable shifts, including weekends and operate on tight deadlines with multiple priorities subject to frequent change.<br/><br/></li></ul><strong>InfraHire is an Equal Opportunity Employer.</strong>", "postedDate": "4 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/2148440861"}