{"jobTitle": "Senior Middle Market Relationship Manager", "company": {"name": "Umpqua Bank", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Banking", "description": "In this role, you will serve as the key banking relationship manager for assigned middle market client relationships. You’ll be accountable for prospecting new business and working with Client Solution Managers to deepen client relationships. You’ll maintain a \"trusted advisor\" role, engaging in dialogue with executive-level client contacts to assess holistic banking needs and to provide customized banking insights and solutions. And you’ll drive financial performance through profitable revenue and growth and quality credit.<br/><br/>\n\n <br/><br/>\n\nAt this level, the relationship manager generally supports a portfolio of middle market clients with $50MM+ in annual revenue. These client relationships are generally the largest and most complex in the market's portfolio.<br/><br/>\n\n <br/><br/>\n\n<strong> <br/><br/></strong>\n\n<strong>Functions<br/><br/></strong>\n\n<ul><br/><li>Serve as the trusted advisor to clients, functions as the Middle Market client “expert” and the go-to-person providing differentiating consult, ideas, and options for the largest and most complex clients.</li><br/><li>Champion and lead business development efforts by developing a clear and holistic understanding of the client’s or prospect’s business and industry. Perform client reviews to ensure the bank provides relevant solutions as clients grow and adapt.</li><br/><li>Develop and maximize established referral network. Proactively prospect for new clients and identify ways to expand existing relationships in collaboration with Client Solutions Manager and internal partners. Identify opportunities and partners to structure, coordinate and sponsor credit and non-credit solutions.</li><br/><li>In partnership with the Client Solutions Manager, assemble and lead cross-functional team to quickly respond to customer request and identified needs. Utilize team of experts to creatively present the full breadth of the bank.</li><br/><li>Maintain active prospecting effort, including identification, qualification and calling. Consistently balance prospecting efforts and quality client-maintenance responsibilities.</li><br/><li>Make decisions on loans and terms within established lending limits. Analyze credit to determine the ability of customers and prospective customers to qualify for ensuing borrowing requirements.</li><br/><li>Follow-up on current loans to ensure compliance with internal procedures and other required terms.</li><br/><li>Study middle market industrial, economic and financial situations relating to new or existing business as part of prudent business development and portfolio management disciplines.</li><br/><li>Demonstrate compliance with all bank regulations that apply to your position, and keep up to date on regulation changes.</li><br/><li>Maintain working knowledge of our policies and procedures regarding the Bank Secrecy Act, Regulation CC, Regulation E, Bank Security and other regulations that apply to your position.</li><br/></ul><br/><p><strong> <br/><br/></strong></p><br/><p><strong>Qualifications<br/><br/></strong></p><br/><ul><br/><li>Bachelor’s Degree in business, finance, or related field (or equivalent experience) required</li><br/><li>Master’s Degree in Business Administration (MBA), or related field of study preferred</li><br/><li>More than 10 years of relevant Middle Market lending experience and proven track record of exceeding performance in developing business in the Middle Market segment and industry required</li><br/><li>4-7 years of high-performance experience serving commercial clients with $25MM+ annual revenue preferred</li><br/><li>Proven track record of success in developing new business, growing market share and establishing/growing a quality supportive network.</li><br/><li>Experience working in relationship management teams with a proven understanding of the importance of balancing business development and asset quality. Proven ability to constructively work within (lead) a team in effort to deliver holistic, customized banking relationships.</li><br/><li>Expert credit acumen (accounting, financial statement, understanding business and understanding of operational cash flow) with the ability to support the most complex deals. Working knowledge of the bank’s systems and policies applicable to underwriting and portfolio management.</li><br/><li>Thorough knowledge of bank’s risk-rating system, credit products and underwriting policies. Exceptional working knowledge with structuring credit products to middle market business in diverse industries with complex ownership structures.</li><br/><li>Excellent relationship management and business development abilities, analytical and problem-solving skills, sales skills, and credit and credit quality skills.</li><br/><li>Confirmed superior client relationship and internal partnering skills. Ability to work effectively with individuals and groups across the company to manage customer relationships.</li><br/><li>Ability to train and present to small and large audiences.</li><br/><li>Superior technical credit expertise. Readily mentors others to grow their skillsets in this space.</li><br/><li>Ability to negotiate/collaborate with Senior Credit Officers on credit terms and structures.</li><br/><li>Experience with syndications, asset-based lending, capital structure finance, leveraged lending, enterprise value lending, and trade finance.</li><br/><li>Experience with underwriting and/or managing Shared National Credits (SNC).</li><br/></ul><br/><p> <br/><br/></p><br/><p><strong>Physical Requirements and Working Conditions<br/><br/></strong></p><br/><p>Work involves:<br/><br/></p><br/><ul><br/><li>sitting</li><br/><li>walking</li><br/><li>lifting up to 25 pounds.</li><br/><li>Frequent Regional Travel</li><br/></ul><br/><p> <br/><br/></p><br/><p>No relocation offered.<br/><br/></p><br/><p> <br/><br/></p><br/><p><strong>About Us<br/><br/></strong></p><br/><p>We do things a little differently here at Umpqua. Our retail stores serve as community hubs, our associates are given up to 40 hours of volunteer time each year, and we're never satisfied with the status quo. It's no wonder we've made \"Fortune's 100 Best Companies to Work For\" eight years in a row. But greatness has no finish line, so we continue every day to keep people at the center of everything we do. We focus on building relationships, understanding our customers' needs and connecting to people in new and innovative ways -- always staying true to our mission of providing personalized banking for all people, whenever and however they prefer to bank.<br/><br/></p><br/><p> <br/><br/></p><br/><p>Umpqua Bank is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender. <br/><br/></p><br/><p> <br/><br/></p>", "postedDate": "2 years ago", "qualifications": {"required": "Bachelor’s Degree in business, finance, or related field (or equivalent experience) required\n\nMore than 10 years of relevant Middle Market lending experience and proven track record of exceeding performance in developing business in the Middle Market segment and industry required\n\nProven track record of success in developing new business, growing market share and establishing/growing a quality supportive network.\n\nExperience working in relationship management teams with a proven understanding of the importance of balancing business development and asset quality. Proven ability to constructively work within (lead) a team in effort to deliver holistic, customized banking relationships.\n\nExpert credit acumen (accounting, financial statement, understanding business and understanding of operational cash flow) with the ability to support the most complex deals. Working knowledge of the bank’s systems and policies applicable to underwriting and portfolio management.\n\nThorough knowledge of bank’s risk-rating system, credit products and underwriting policies. Exceptional working knowledge with structuring credit products to middle market business in diverse industries with complex ownership structures.\n\nExcellent relationship management and business development abilities, analytical and problem-solving skills, sales skills, and credit and credit quality skills.\n\nConfirmed superior client relationship and internal partnering skills. Ability to work effectively with individuals and groups across the company to manage customer relationships.\n\nAbility to train and present to small and large audiences.\n\nSuperior technical credit expertise. Readily mentors others to grow their skillsets in this space.\n\nAbility to negotiate/collaborate with Senior Credit Officers on credit terms and structures.\n\nExperience with syndications, asset-based lending, capital structure finance, leveraged lending, enterprise value lending, and trade finance.\n\nExperience with underwriting and/or managing Shared National Credits (SNC).", "preferred": "Master’s Degree in Business Administration (MBA), or related field of study preferred\n\n4-7 years of high-performance experience serving commercial clients with $25MM+ annual revenue preferred"}, "skills": ["Business Development", "Relationship Management", "Credit Analysis", "Financial Analysis", "Sales", "Banking", "Middle Market", "Lending", "Underwriting", "Portfolio Management", "Credit Risk", "Commercial Banking", "Financial Services", "Teamwork", "Communication", "Presentation Skills", "Negotiation", "Mentoring", "Leadership", "Syndications", "Asset-Based Lending", "Capital Structure Finance", "Leveraged Lending", "Enterprise Value Lending", "Trade Finance", "Shared National Credits (SNC)"], "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3009140368"}