{"jobTitle": "Account Executive", "company": {"name": "Excelerate Capital", "industry": "Financial Services", "size": "Not specified", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Commission only", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Excelerate Capital is rapidly growing and seeking to bring on Wholesale Account Executives in CA, OR, CO, HI, AZ, TX, and FL. At Excelerate Capital, we offer competitive pricing with a variety of loan products – Non QM/ Conventional/ FHA/ VA. A mortgage account executive is responsible for estimating credit worthiness, calculating risk, and approving mortgage loans after a thorough examination of documents (applications, credit reports, and other supporting documentation). Other duties include managing mortgage account for a company’s existing customers as well as following up on qualified leads and creating relationships with new customers. In addition to face-to-face time with customers and other brokers within a defined sales territory. The position also requires a good deal of time on the phone making sales and follow-up calls.", "responsibilities": "Develop & maintain strong working relationships in the target market. Establishing and developing relationships in the target market. Ability to provide proper presentation about our products and loan process to brokers. Excellent communication skills with mortgage brokers and operations team in order to provide on-going service support to brokers. Minimum of 2-3 years of mortgage industry experience is preferred. Must be proactive and self-starter and able to thrive in a production driven environment. Manages pipeline for all assigned accounts. Act as a liaison between sales and operations staff. Follow up on funding conditions. Meet assigned monthly closing goals. Analyze account potential and profitability. Develop account closing and growth strategies. Review and/or process loans submitted by third party originators (TPO’s). Create and foster good working relationship with TPO’s for whom you are assigned by training them on company policy on Excelerate’s policy and procedures and answering inquiries/addressing issues. Review all documentation provided by the TPO for sufficiency to meet underwriting guidelines and loan product requirements. Collect and input customer, property and other information required to originate the loan into Excelerate’s Loan Origination System in a timely manner. Work closely with underwriters to understand conditions and explain the TPO. Anticipate underwriter conditions to the extent possible. Manage multiple loan files and cases to ensure each loan closes in a timely manner. Maintain working knowledge of NQM/Non-Agency loan programs and applicable guidelines.", "qualifications": {"required": "Superior customer service skills with the ability to communicate real time updates in a professional manner by way of verbal or written updates. Strong Communication skills for developing quality leads establishing relationships with clients. Critical thinking and decision-making skills used when analyzing financial histories and mortgage applications. Presentation and negotiation skills help the mortgage account executive navigate the sales process and successfully close deals. Ability to multitask and remain organized under pressure helps with when juggling multiple client accounts at once. Because applications, mortgage data and financial reports are typically processed electronically, candidates should be proficient with word processing and spreadsheet software.", "preferred": "Minimum of 2-3 years of mortgage industry experience is preferred."}, "skills": ["Customer Service", "Communication", "Critical Thinking", "Decision Making", "Presentation", "Negotiation", "Multitasking", "Proficiency in Word Processing and Spreadsheet Software"], "postedDate": "1 year ago", "applicationDeadline": "Not specified", "benefits": "Dental Insurance, Flexible Schedule, Health Insurance, Paid Time Off, Vision Insurance", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3250349703"}