{"jobTitle": "Business Relationship Manager", "company": {"name": "East West Bank", "location": "Artesia, CA"}, "location": "Artesia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "65,000.00/yr - 110,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Banking", "description": "<strong>Introduction <br/><br/></strong>Since 1973, East West Bank has served as a pathway to success. With over 120 locations across the U.S. and Asia, we are the premier financial bridge between the East and West. Our teams of experienced, multi-cultural professionals help guide businesses and community members on both sides of the Pacific looking to explore new markets and create new opportunities, and our sustained growth and expertise in industries like real estate, entertainment and media, private equity and venture capital, and high-tech help build sustainable businesses and expand our associates’ potential for career advancement.<br/><br/>Headquartered in California, East West Bank (Nasdaq: EWBC) is a top performing commercial bank with an exclusive focus on the U.S. and Asia markets. With a strong foundation, and enterprising spirit and a commitment to absolute integrity, East West Bank gives people the confidence to reach further.<br/><br/><strong>Overview<br/><br/></strong>Being the next generation Business Relationship Manager at East West Bank means you are part of a world-class team that focuses on delivering a high quality, high-touch, and high-tech relationship banking experience across all customer touchpoints.<br/><br/>As a Business Relationship Manager, you will play a key role in:<br/><br/><ul><li> Improving the lives of our customers and the well-being of their businesses through financial solutions, education, and advice. </li><li> Strategically collaborating with commercial lending business partners, private banking, Retail Regional Managers, and/or Branch Managers to execute sales strategies </li><li> Ability to drive the priorities of the business and develop a plan to drive growth <br/><br/></li></ul>This role is meant for someone with a strong passion for driving growth by deepening existing relationships and cultivating new relationships, delivering exceptional service to customers, and building a Relationship Manager career in financial services.<br/><br/>We will help you grow your career at East West Bank by providing you with ongoing training to expand your business knowledge, grow your digital acumen, and build long-lasting relationships with our customers.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Achieve quarterly/annual goals through business generation of C&amp;I, CRE, mortgages, SBA, treasury management, deposits, investments, and international and other commercial and consumer products offered through East West Bank </li><li> Collaborate with Regional Manager and/or Branch Manager to develop and implement customer-centric strategic marketing plans and generate new business through prospecting, outside calling, networking, and referrals </li><li> Maintain and apply a thorough understanding of the bank’s credit policy, client eligibility and all necessary business practices to ensure the submission of accurate and complete commercial and consumer loan packages </li><li> Actively participate in local and regional business functions; coordinate and organize targeted campaigns and events </li><li> Provide management with input regarding current policies and practices of competition, when appropriate </li><li> Educate customers on how to use our digital platforms to bank and invest when, where and how they want </li><li> Perform other duties as assigned <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Bachelor’s degree preferred </li><li> 5+ years in commercial lending and/or private banking with proven sales track record </li><li> Strong understanding of C&amp;I loans, SBA loans and/or industry-focused lending </li><li> In-depth knowledge of banks, credit and deposit products; experience in international activities between U.S. and Greater China preferred </li><li> Strong analytical, marketing/sales, consulting and negotiating skills </li><li> Strong written and verbal communication </li><li> High energy, results-oriented, and work well in a team environment </li><li> Strong desire and capability to influence, educate and connect team, partners and customers to technology </li><li> Has ability to learn and adapt to new information and technology platforms <br/><br/></li></ul>East West Bank is an equal opportunity employer.<br/><br/><strong>Compensation<br/><br/></strong>The base pay range for this position is USD $65,000.00/Yr. - USD $110,000.00/Yr. Exact offers will be determined based on job-related knowledge, skills, experience, and location.", "responsibilities": "<ul><li> Achieve quarterly/annual goals through business generation of C&amp;I, CRE, mortgages, SBA, treasury management, deposits, investments, and international and other commercial and consumer products offered through East West Bank </li><li> Collaborate with Regional Manager and/or Branch Manager to develop and implement customer-centric strategic marketing plans and generate new business through prospecting, outside calling, networking, and referrals </li><li> Maintain and apply a thorough understanding of the bank’s credit policy, client eligibility and all necessary business practices to ensure the submission of accurate and complete commercial and consumer loan packages </li><li> Actively participate in local and regional business functions; coordinate and organize targeted campaigns and events </li><li> Provide management with input regarding current policies and practices of competition, when appropriate </li><li> Educate customers on how to use our digital platforms to bank and invest when, where and how they want </li><li> Perform other duties as assigned <br/><br/></li></ul>", "qualifications": {"required": "<ul><li> Bachelor’s degree preferred </li><li> 5+ years in commercial lending and/or private banking with proven sales track record </li><li> Strong understanding of C&amp;I loans, SBA loans and/or industry-focused lending </li><li> In-depth knowledge of banks, credit and deposit products; experience in international activities between U.S. and Greater China preferred </li><li> Strong analytical, marketing/sales, consulting and negotiating skills </li><li> Strong written and verbal communication </li><li> High energy, results-oriented, and work well in a team environment </li><li> Strong desire and capability to influence, educate and connect team, partners and customers to technology </li><li> Has ability to learn and adapt to new information and technology platforms <br/><br/></li></ul>", "preferred": null}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": null, "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3419089039"}