{"jobTitle": "Insomniac - Talent Buyer", "company": {"name": "Insomniac Events", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00 - $130,000.00", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Entertainment Providers", "description": "<strong>Job Summary</strong><p><br/></p><strong>WHO ARE YOU?</strong><p><br/></p>Do you enjoy dance music? Do you excel at talent curation? Then you’re in luck! We are looking for a highly motivated self-starter who embodies both a passion for dance culture and a love of talent curation space. Is this you? Read on…<p><br/></p><strong>WHO ARE WE?</strong><p><br/></p>Insomniac produces some of the most innovative, immersive music festivals and events in the world. Enhanced by state-of-the-art lighting, pyrotechnics and sound design, large-scale art installations, theatrical performers and next generation special effects, our events captivate the senses and inspire a unique level of fan interaction. The quality of the Headliner experience is our top priority.<p><br/></p>Insomniac produces 10,000 concerts, club nights and festivals for seven million attendees annually across the globe. Since its inception, Insomniac's events have taken place in 13 countries across five continents. The company's premiere annual event, Electric Daisy Carnival Las Vegas, is the world’s largest dance music festival and attracts more than 525,000 fans over three days. The company was founded by Pasquale Rotella and has been based in Los Angeles since it was formed in 1993.<p><br/></p><strong>THE ROLE</strong><p><br/></p>Insomniac is looking for a Talent Buyer who will be responsible for supporting and executing all aspects of talent booking for Festivals. The Talent Buyer will manage all aspects of music booking: budgets, scheduling, contracts, promotion, marketing, ticket sales, daily administrative reports and staff and production coordination. This is not a remote position and must be willing to relocate to Los Angeles, CA.<p><br/></p><strong>Responsibilities</strong><p><br/></p><ul><li>Support VP, Concerts &amp; Talent Buyer on all festival, rave and concert bookings</li><li>Assist curating eclectic show lineups</li><li>Day-to-day administrative tasks including but not limited to; approving contracts, following up on offers, advancing with marketing for assets, proof reading grids and set times</li><li>Execute annual business plan for events, ensuring we hit targeted goals</li><li>Maintain current promotional partnerships domestically and internationally</li><li>Develop new and maintain venue relationships</li><li>Partner with artists and their managers on creating any new hard ticket or touring opportunities</li><li>Execute strategic brand planning to accelerate brand growth to meet goals and objectives</li><li>Study market trends now and in the future to identify emerging trends and opportunities on short-term long-term basis</li><li>Field and make calls for Talent Buyer and following up with correspondence as needed</li><li>Partner with Production and Operations team on developing budgets, settlements, and site advancements for each show</li><li>Attend and work company events (domestic/international travel expected, economy class)</li><li>Assist with other duties as assigned on a regular or occasional basis</li></ul><p><br/></p><strong>Qualifications</strong><p><br/></p><ul><li>Bachelor’s degree or related experience</li><li>Required 5+ years’ experience in music entertainment industry talent curation, promotions, or business development</li><li>Proficient user of Microsoft suite</li><li>Must have clean criminal and driving record, valid driver’s license, passport, and car insurance</li></ul><p><br/></p><strong>WORK ENVIRONMENT</strong><p><br/></p><ul><li>Must be able to tolerate loud noise levels &amp; busy environments</li><li>May work in drastic temperature climates onsite at our shows</li><li>Must be willing to travel to work during evening, weekend hours and travel to events, as required</li></ul><p><br/></p>Applicants for employment in the U.S. must possess work authorization, which does not require sponsorship by Insomniac for a visa.<p><br/></p><strong>EQUAL EMPLOYMENT OPPORTUNITY</strong><p><br/></p>Insomniac strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.<p><br/></p><strong>HIRING PRACTICES</strong><p><br/></p>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<p><br/></p>Insomniac recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Insomniac may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms.<p><br/></p>Hiring Salary Range: $90,000.00 - $130,000.00 USD<p><br/></p>Please note that the compensation information provided is a good faith estimate for this position only and is provided pursuant to the California Salary Transparency in Job Advertisements Law. It is estimated based on what a successful California applicant might be paid. It assumes that the successful candidate will be in California or perform the position from California. Similar positions located outside of California will not necessarily receive the same compensation. Insomniac takes into consideration a candidate’s education, training, and experience, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the California Law, a potential new employee’s salary history will not be used in compensation decisions.", "responsibilities": "Support VP, Concerts & Talent Buyer on all festival, rave and concert bookings\nAssist curating eclectic show lineups\nDay-to-day administrative tasks including but not limited to; approving contracts, following up on offers, advancing with marketing for assets, proof reading grids and set times\nExecute annual business plan for events, ensuring we hit targeted goals\nMaintain current promotional partnerships domestically and internationally\nDevelop new and maintain venue relationships\nPartner with artists and their managers on creating any new hard ticket or touring opportunities\nExecute strategic brand planning to accelerate brand growth to meet goals and objectives\nStudy market trends now and in the future to identify emerging trends and opportunities on short-term long-term basis\nField and make calls for Talent Buyer and following up with correspondence as needed\nPartner with Production and Operations team on developing budgets, settlements, and site advancements for each show\nAttend and work company events (domestic/international travel expected, economy class)\nAssist with other duties as assigned on a regular or occasional basis", "qualifications": {"required": "Bachelor’s degree or related experience\nRequired 5+ years’ experience in music entertainment industry talent curation, promotions, or business development\nProficient user of Microsoft suite\nMust have clean criminal and driving record, valid driver’s license, passport, and car insurance", "preferred": null}, "skills": ["Microsoft Suite"], "postedDate": "9 months ago", "applicationDeadline": null, "benefits": null, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3489335938"}