{"jobTitle": "Content Manager, Social Media", "company": {"name": "Fashion Nova", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Retail Apparel and Fashion", "description": "<strong>About Us<br/><br/></strong>Fashion Nova is an inclusive fashion-forward and trend-driven apparel and lifestyle brand that celebrates all dimensions of confidence. We use our platform to spread positivity with brands for women, men, curve, luxe, sport, swim, beauty, and kids. We are obsessed with creating the best experience available for our customers and employees.<br/><br/>Fashion Nova was built on the backbone of individuality and inclusiveness. Our brands are worn and celebrated worldwide by customers, celebrities, and influencers because of our uniquely creative and talented employees.<br/><br/><strong>Role Overview<br/><br/></strong>The Content Manager will help lead the Creative Services department and will drive collaboration with multiple Fashion Nova teams, such as Studio, Buying, Beauty, Marketing, and others. You will help create quality content for our website, app, and social media channels. You will also lead activities that conceptualize innovative ideas to engage our customers and serve as the content aficionado in developing your team to constantly elevate the Fashion Nova brand for our customers.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Orchestrate day-to-day content in the form of photos, videos, and GIFs to publish across our social media channels, but also on our website, app and other digital properties</li><li>Mentor and develop your direct reports across the Content team</li><li>Curate photos, videos, behind-the-scenes footage, and other supporting assets for our editorial shoots and campaigns - You will support product launches, brand partnerships, store events, and influencer activations</li><li>Collaborate with teams across eCommerce, Marketing, Retail, Talent Acquisition, and more to understand product, editorial, and campaign requirements</li><li>Manage content calendar for all Brand divisions and follow up with the Content team to ensure deadlines are met and the quality of the work product is stellar</li><li>Stay abreast of new creative trends and insights, and generate ideas on how to best translate these across our Content and Social Media channels</li><li>Implement and use social listening tools to understand customer sentiment and uncover new areas of opportunity</li><li>You will create a best-in-class amplification and engagement strategy that will grow and nurture the customer community according to their behaviors, motivations, and interests.</li><li>Manage a budget ensuring all activity is delivered on time and meets commercial goals</li><li>Reaching out to influencers and working with them to plan out the best strategy on presenting products to target customers - Maintaining great relationships with influencers</li><li>Generating ideas for new videos or content to post on the platform</li><li>Lead social content production and workflow from concept to launch to post-production to ensure all assets are on track, on time, on brief, and within budget</li><li>Develop and maintain an elevated and cohesive social media aesthetic, persona and creative voice that is ownable to the brand<br/><br/></li></ul><strong>Role Requirements<br/><br/></strong><ul><li>Four plus years of experience in Photography, Videography, Graphics and Photo|Video editing</li><li>Three plus years of Social Media experience with a keen understanding of what works on each platform</li><li>Two plus years of experience in Fashion Retail and|or eCommerce is preferred</li><li>A keen eye for Fashion|Model photography and still life product photography</li><li>Experience leading, developing, and mentoring a team of at least five direct reports</li><li>Balance working in a fast-paced environment that is creatively driven with a strong work ethic. Must be a strategic thinker to ensure alignment with brand content strategy and broader company goals.</li><li>Deep understanding of social media platforms and up to date on industry and platform trends</li><li>Experience creating, editing, and optimizing social-first content is a plus</li><li>High-level creative judgment and an eye for quality, taste, and style.</li><li>Experience creating, editing, and optimizing social-first content is a plus.</li><li>BA|BS degree or equivalent work experience.</li><li>English, additional language(s) an advantage.</li><li>Schedule of this position: Monday – Friday | Core business hours | Onsite<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Formalized career paths</li><li>Flat management platform</li><li>Manager Training Academy</li><li>Creative Development Internship Program</li><li>Fashion Nova Cares Program </li><li>Flexible Paid Time Off (PTO)</li><li>Medical, Dental and Vision Coverage</li><li>401k match, with immediate vesting upon eligibility</li><li>Stocked kitchens with gratis snacks and drinks</li><li>Weekly catered lunches</li><li>Summer Fridays at Headquarters</li><li>Team bonding events and programs</li><li>Employee discounts<br/><br/></li></ul>Fashion Nova, LLC, and subsidiaries thereof, is an Equal Opportunity Employer. We are steadfast in our commitment to equal employment opportunities and pledge that these objectives are reflected in all aspects of our daily operations. We will continue to recruit, hire, train, and advance in employment qualified individuals in all job titles without regard to race, color, national origin, gender, sexual orientation, gender identity, religion, age, status as a protected veteran, criminal history, or status as an individual with a disability; and shall not discriminate against any individual, any such characteristic, nor any other classification protected by local, state and|or federal law.<br/><br/><strong>NOTICE AT COLLECTION</strong>", "responsibilities": "<ul><li>Orchestrate day-to-day content in the form of photos, videos, and GIFs to publish across our social media channels, but also on our website, app and other digital properties</li><li>Mentor and develop your direct reports across the Content team</li><li>Curate photos, videos, behind-the-scenes footage, and other supporting assets for our editorial shoots and campaigns - You will support product launches, brand partnerships, store events, and influencer activations</li><li>Collaborate with teams across eCommerce, Marketing, Retail, Talent Acquisition, and more to understand product, editorial, and campaign requirements</li><li>Manage content calendar for all Brand divisions and follow up with the Content team to ensure deadlines are met and the quality of the work product is stellar</li><li>Stay abreast of new creative trends and insights, and generate ideas on how to best translate these across our Content and Social Media channels</li><li>Implement and use social listening tools to understand customer sentiment and uncover new areas of opportunity</li><li>You will create a best-in-class amplification and engagement strategy that will grow and nurture the customer community according to their behaviors, motivations, and interests.</li><li>Manage a budget ensuring all activity is delivered on time and meets commercial goals</li><li>Reaching out to influencers and working with them to plan out the best strategy on presenting products to target customers - Maintaining great relationships with influencers</li><li>Generating ideas for new videos or content to post on the platform</li><li>Lead social content production and workflow from concept to launch to post-production to ensure all assets are on track, on time, on brief, and within budget</li><li>Develop and maintain an elevated and cohesive social media aesthetic, persona and creative voice that is ownable to the brand<br/><br/></li></ul>", "qualifications": {"required": "Four plus years of experience in Photography, Videography, Graphics and Photo|Video editing, Three plus years of Social Media experience with a keen understanding of what works on each platform, Two plus years of experience in Fashion Retail and|or eCommerce is preferred, A keen eye for Fashion|Model photography and still life product photography, Experience leading, developing, and mentoring a team of at least five direct reports, Balance working in a fast-paced environment that is creatively driven with a strong work ethic. Must be a strategic thinker to ensure alignment with brand content strategy and broader company goals., Deep understanding of social media platforms and up to date on industry and platform trends, Experience creating, editing, and optimizing social-first content is a plus, High-level creative judgment and an eye for quality, taste, and style., Experience creating, editing, and optimizing social-first content is a plus., BA|BS degree or equivalent work experience., English, additional language(s) an advantage., Schedule of this position: Monday – Friday | Core business hours | Onsite<br/><br/>", "preferred": ""}, "skills": ["Photography", "Videography", "Graphics", "Photo|Video editing", "Social Media", "Fashion Retail", "eCommerce", "Fashion|Model photography", "still life product photography", "Team Leadership", "Mentoring", "Strategic Thinking", "Social Media Platforms", "Social-first content creation", "Content Optimization", "English", "Additional languages"], "postedDate": "1 week ago", "benefits": "<ul><li>Formalized career paths</li><li>Flat management platform</li><li>Manager Training Academy</li><li>Creative Development Internship Program</li><li>Fashion Nova Cares Program </li><li>Flexible Paid Time Off (PTO)</li><li>Medical, Dental and Vision Coverage</li><li>401k match, with immediate vesting upon eligibility</li><li>Stocked kitchens with gratis snacks and drinks</li><li>Weekly catered lunches</li><li>Summer Fridays at Headquarters</li><li>Team bonding events and programs</li><li>Employee discounts<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3552667740"}