{"jobTitle": "Sales Representative / Retail Account Manager (RAM)", "company": {"name": "IDT Corporation", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "jobFunction": "Sales and Business Development", "industry": "Telecommunications", "description": "IDT’s Retail division is looking for a Sales Representative / Retail Account Manager (RAM). IDT is a leading communications and financial services company looking for enthusiastic and energetic Sales Representatives / RAMs. In this role, you will be responsible for sales of specified telecom and financial services products in an assigned geographical territory. RAMs develop a weekly cycle to sell IDT Retail products into retail via a designated route established by his/her Regional Sales Manager. RAMs also visit and contact retail stores on a regular basis to take and fulfill orders and ensure customer satisfaction. In this role, you will:<br/><br/><ul><li>Open new retail doors and services existing accounts</li><li>Handle all sales, collections, and card inventory using IDT's accounting system<br/><br/><br/></li></ul>We expect you to:<br/><br/><ul><li>Be a people person and a great communicator</li><li>Have a valid driver's license and a car (IDT offers a mileage and gas reimbursement program)</li><li>Excel in a fast-paced entrepreneurial environment</li><li>Have a basic knowledge of MS Office<br/><br/><br/></li></ul>Bonus points for:<br/><br/><ul><li>No sales background is required but a plus if you do</li><li>Bilingual English/Spanish is highly preferred<br/><br/><br/></li></ul>We offer you:<br/><br/><ul><li>Salary + commissions</li><li>Mileage reimbursement</li><li>On-the-job training and a dynamic work environment. </li><li>Excellent and competitive benefits package, including but not limited to, medical, dental, and vision plans, life insurance, tuition reimbursement, employee referral program, paid time off, and a 401k plan with employer contributions<br/><br/><br/></li></ul>About us: IDT is a leading US communications company founded in 1990 and headquartered in Newark, New Jersey. IDT is an industry leader in prepaid communication and payment services and one of the world's largest international voice carriers. We are listed on the NYSE, employ over 1600 people across 20+ countries, and have over $1.5 billion in revenues. Our flagship brand, Boss Revolution, includes Money Transfer, International Calling, and Mobile Top-Up services and supports IDT's mission of enabling people to keep in touch and share resources with family and friends worldwide.", "postedDate": "1 year ago", "skills": ["Sales", "Communication", "Customer Service", "Retail", "Telecommunications", "Financial Services", "Account Management", "Sales Management", "Product Knowledge", "Inventory Management", "Microsoft Office", "Bilingual", "Spanish"], "url": "https://www.linkedin.com/jobs/view/3573084973"}