{"jobTitle": "Store Manager", "company": {"name": "BoxLunch", "industry": "Retail", "size": "51-200 employees", "location": "Downey, CA"}, "location": "Downey, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not disclosed", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "At BoxLunch, we’re committed to using our love of pop culture to do something amazing: eliminate hunger. With every $10 spent, we donate a meal to Feeding America that directly benefits the communities we are in. We’re on the search for a Store Manager that will be at the forefront of bringing the fandom to life. You’ll lead the store in achieving store objectives with regard to hitting sales targets, recruiting, development, and performance management. You’ll be a retail maverick that can handle anything that comes your way. You’ll be a believer in developing talent and providing the best customer service in the mall. In short, you’re a superhero.", "responsibilities": "Ensure that your store achieves the sales plan and/or comp sales goals. It’s not all about the Benjamins, but then it kind of is. Recruit, develop, and retain a super collaborative and passionate team to run your store alongside you. You’re the leader of the band, and you love to create buzz and customer engagement through staying connected on social media, store web applications, and clienteling. Lead an operationally sound business; you’ll bring the right balance of organizational structure, delegation & autonomy, and customer first selling practices. Keep watch (like the Night’s Watch) on shrink/loss prevention, payroll hours, schedules, and external factors that will affect business. Collaboratively communicate with retail leadership and HQ partners on trends & customer feedback. Run sales reports and use data to help guide your strategy to hit sales targets. You’ve got the keys to the kingdom, and you’re not afraid to use them! You’re willing to adapt to new technologies, communicate company policies & procedures, and control supply ownership (spending only as needed). Deliver the goods - you’ll merchandise the store in a compelling way, leveraging planograms as a guide, while launching all promos on time. Every Fellowship needs a Gandalf! Ensure that you’re continually building a bench of equally talented, passionate staff through mentorship, recognition, and feedback.", "qualifications": {"required": "At least 1-2 years of retail store management experience; you’ve led teams to success and want to experience more of it. You’ll have skills to pay the bills: communication, recruiting, and operations (payroll, reporting, scheduling, merchandising). You'll have to be at least 18 years of age to join the fandom force. A high school diploma or GED equivalent. If you have a degree, even better. Roll with the punches! Retail is a fast-changing industry and you like catching curveballs thrown your way. Open-minded and inquisitive regarding pop culture fandoms & trends. The usual retail stuff (with or without reasonable accommodation): able to navigate your way around the store, merchandise product utilizing approved store equipment, and pack and unpack boxes of awesome merch that may weigh up to 50 pounds.", "preferred": ""}, "skills": [], "postedDate": "1 year ago", "applicationDeadline": "", "benefits": "", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3574813747"}