{"jobTitle": "Stock Associate", "company": {"name": "World Market", "industry": "Retail", "size": "Not specified", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Not specified", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$16.00/hr - $16.50/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Who We Are\nFor over 60 years, we have curated a unique marketplace filled with inspiring finds for the home decorator, entertainer, and gifter. From international foods and hand-picked wine and beverages to artisan furniture and on-trend décor, we offer a high-quality assortment at a great value you won’t find anywhere else.\nAnd, while diversity of product is critical to our success as a retail brand, it is our culture of diversity and belonging that allows us to thrive as a team. Each and every individual's contributions and unique perspective matter and inspire us to be inclusive, collaborative, open-minded, adaptable, honest, and respectful.\n\nWhat You’ll Do\nAs a stock associate you’ll delight shoppers with everything for extraordinary gift giving, entertaining and decorating. You’ll be responsible for a variety of duties including providing exceptional customer service, cashiering, merchandising, stocking merchandise, and maintaining visual standards and delivering curbside orders to our customers.\n\n- Physically unloading trucks and check in product according to Company procedures.\n- Stock merchandise according to visual standards, schematics, visual direction, pricing standards, productivity and safety standards.\n- Maintain the stockroom and sales floor organization and standards.\n- Adhere to all company Loss prevention policy and procedures, and distressed merchandise procedures.\n- General housekeeping as directed by management.\n- Assist customers utilizing World Market service standards as well as representing World Market brand.\n- Cashier according to customer service guidelines and register procedures as needed.\n\nWhat You’ll Bring\n- A can-do attitude and a commitment to contributing to a collaborative, open minded, adaptable, honest and respectful culture.\n- 1+ Years experience in retail preferred, but not required\n- Excellent communication & time management skills.\n- Ability to initiate a conversation.\n- Minimum Age 16 years\n- Ability to lift up to 40 lbs.\n\nWhy We Love It\n- Flexible scheduling to support your work life balance.\n- Associate discount to World Market!\n- A fun and supportive work environment where you feel welcome and safe.\n- A culture of inclusion that empowers you to be your best authentic self.\n- Eligible associates offered Medical and Dental Insurance, Vision Coverage, 401(k) Savings Plan, Commuter Benefits, Employee Assistance and more.\n\nHourly Pay Range is $16.00-$16.50\n\nPart time associates are eligible to participate in the Company’s 401(k) retirement savings plan after working 250 hours within their first three (3) months of employment.\n\nBenefits for full-time employment on the first of the month following 30 days of continuous employment include offerings for programs including Medical, Dental, Vision, Prescription Drug, Life Insurance, Flexible Spending, Commuter Benefits and Employee Assistance.\n\nIf you need reasonable accommodations to complete the on-line application, please contact the Human Resource Department:\n\nPhone: 1-833-680-2399\n\nEmail: hrsupport@worldmarket.com\n\nThis email address is only to request reasonable accommodation for the application process due to a medical condition. If you do not need a reasonable accommodation for such reason, please use the apply button below to complete an application and upload your resume.\n\nAn Equal Opportunity Employer\nIt is the policy of World Market, LLC. to recruit, hire, train, promote, transfer and compensate our associates and provide all other conditions of employment including Company sponsored events without regard to race, color, creed, religion, national origin, age, sex, gender identity, genetic information, marital status, lawful alien status, sexual orientation, physical or mental disability, citizenship status, veteran status, employment status or any other basis prohibited by applicable law.", "responsibilities": "As a stock associate you’ll delight shoppers with everything for extraordinary gift giving, entertaining and decorating. You’ll be responsible for a variety of duties including providing exceptional customer service, cashiering, merchandising, stocking merchandise, and maintaining visual standards and delivering curbside orders to our customers.", "qualifications": {"required": "Minimum Age 16 years", "preferred": "1+ Years experience in retail preferred, but not required"}, "skills": [], "postedDate": "1 year ago", "applicationDeadline": "Not specified", "benefits": "Flexible scheduling, Associate discount, Medical and Dental Insurance, Vision Coverage, 401(k) Savings Plan, Commuter Benefits, Employee Assistance.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3581432610"}