{"jobTitle": "Operations Manager", "company": {"name": "Enclave Search Group", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Management and Manufacturing", "industry": "Staffing and Recruiting", "description": "Marine Terminal and Supply Chain Operations\n\nPosition Summary\nAn Operations Manager is an essential member of the management team and is responsible for the direction of, and any disciplinary action related to, union-represented employees under the supervision of the Operations Manager.\n\nPrimary Duties And Responsibilities\n- Analyze operational needs and assign and direct labor to perform such operations in a manner that maximizes efficiency while maintaining a safe work environment.\n- Supervise union-represented employees, including the responsibility and authority to (a) counsel, discipline, and make termination recommendations to ensure an efficient operation, (b) train and direct such personnel in proper operating procedures, (c) ensure accomplishment of productivity levels by making frequent rounds within the terminal and follow up assessments prior to shift end, and (d) enforce safety rules and employ independent judgment to ensure a safe working environment.\n- Direct preparation of, and assist terminal employees to prepare, department plans and determine the appropriate workforce to be hired to accomplish an efficient and cost-effective completion of plan.\n- Adjust grievances submitted by labor and address and respond to issues raised by union business agents and members, including through informal discussions, the Labor Relations Committee process, and arbitration, as necessary.\n- Plan, hold, and document daily safety and operations meetings, and develop and implement plans to identify, address, and resolve safety hazards.\n\nSupervisory Responsibility\n- Supervise 2 – 100 employees (labor) directly and indirectly.\n\nRequirements\n- BS/BA degree in Business Management, Marine Administration, Transportation, Operations Management, or equivalent experience working in management.\n- Experience in managing related union labor.\n- Knowledge of principles of terminal operations.\n- Experience with computerized operating systems.\n- Knowledge of safety and accident prevention codes and regulations.\n- Knowledge and understanding of cargo stowage and stability strongly desired.\n- Ability to manage a large, complex and diverse workforce in a fast-paced environment.\n- Analytical and problem solving skills needed to respond quickly and effectively to operational issues.\n- Ability to plan and organize projects in a fast-paced environment.\n- Availability to work varied hours, shifts and days\n- Ability to communicate effectively with union-represented workforce and other staff.\n- Accountability for a safe and efficient operation, together with the ability to maintain a positive working relationship with union-represented and other employees.\n- TWIC Card: You will be required to apply for a TWIC (Transportation Worker’s Identification Credential) card through the United States Department of Homeland Security (“DHS”) prior to your start date. Failures to receive DHS approval, acquire, or renew a TWIC card may result in the termination of employment.\n\nPhysical Working Conditions\n- Ability to climb up and down a ladder multiple times within a shift in a marine terminal environment.\n- Ability to work in changing hot and cold climates based on weather conditions.\n- Ability to work in an environment that may be hazardous to persons unable to see and hear fast moving equipment.\n- Ability to work day or night shifts including weekends.\n- Ability to drive a vehicle up to 50% of working hours.\n- Ability to lift 30 pounds.\n- Ability to use a computer/keyboard.", "responsibilities": "Analyze operational needs and assign and direct labor to perform such operations in a manner that maximizes efficiency while maintaining a safe work environment. Supervise union-represented employees, including the responsibility and authority to counsel, discipline, and make termination recommendations to ensure an efficient operation, train and direct such personnel in proper operating procedures, ensure accomplishment of productivity levels by making frequent rounds within the terminal and follow up assessments prior to shift end, and enforce safety rules and employ independent judgment to ensure a safe working environment. Direct preparation of, and assist terminal employees to prepare, department plans and determine the appropriate workforce to be hired to accomplish an efficient and cost-effective completion of plan. Adjust grievances submitted by labor and address and respond to issues raised by union business agents and members, including through informal discussions, the Labor Relations Committee process, and arbitration, as necessary. Plan, hold, and document daily safety and operations meetings, and develop and implement plans to identify, address, and resolve safety hazards.", "qualifications": {"required": "BS/BA degree in Business Management, Marine Administration, Transportation, Operations Management, or equivalent experience working in management. Experience in managing related union labor. Knowledge of principles of terminal operations. Experience with computerized operating systems. Knowledge of safety and accident prevention codes and regulations. Knowledge and understanding of cargo stowage and stability strongly desired. Ability to manage a large, complex and diverse workforce in a fast-paced environment. Analytical and problem solving skills needed to respond quickly and effectively to operational issues. Ability to plan and organize projects in a fast-paced environment. Availability to work varied hours, shifts and days. Ability to communicate effectively with union-represented workforce and other staff. Accountability for a safe and efficient operation, together with the ability to maintain a positive working relationship with union-represented and other employees. TWIC Card: You will be required to apply for a TWIC (Transportation Worker’s Identification Credential) card through the United States Department of Homeland Security (“DHS”) prior to your start date. Failures to receive DHS approval, acquire, or renew a TWIC card may result in the termination of employment.", "preferred": "Not specified"}, "skills": [], "postedDate": "1 year ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3582333287"}