{"jobTitle": "Restaurant Manager-Los Angeles, CA", "company": {"name": "Butler Hospitality", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "Butler Hospitality operates the Food and Beverage Departments within our partner hotels throughout the USA, Great locations and conveniently located! We are looking for talented Restaurant Managers to join our growing teams!<br/><br/>WHY BUTLER!<br/><br/><ul><li>Competitive Salary!</li><li>Health, Dental benefits, Vision and a 401k plan match</li><li>Flexible Scheduling</li><li>Provided breakfast, lunch, and dinner shift meals</li><li>Growth and development opportunities.<br/><br/><br/></li></ul>RUN THE SHOW:<br/><br/><ul><li>Hire, train, motivate, and provide on-going communication to staff to deliver first-class service with unmatched elegance and professionalism while promoting a culture of accountability.</li><li>Manage facility and equipment in the responsible areas to make sure they are in complete working order.</li><li>Ensures high quality of food preparation and service.</li><li>Create a positive work environment that properly represents the Butler brand.</li><li>Ensures consistent, high-quality service standards are maintained through effective training and feedback mechanisms.</li><li>Evaluate employee performance and build reward and recognition systems.</li><li>Produces regular and special reports; maintains required records and files.</li><li>Propose staff changes in assigned areas</li><li>Manage vacation requests and staff absences.</li><li>Maintains close work relationships with other departments and their leaders to promote feedback, cross training and efficient operations.</li><li>Be able to work any shift, any day and long hours when necessary.<br/><br/><br/></li></ul>IDEAL CANDIDATE<br/><br/><ul><li>2-4 years of Food &amp; Beverage experience preferred, 2 years in a leadership role.</li><li>A well-groomed appearance.</li><li>Worked in a fast-paced, busy environment with minimal supervision<br/><br/><br/></li></ul><strong>About Butler<br/><br/></strong>Butler Hospitality was founded in 2017 to modernize the hospitality industry. The Company uses a hub and spoke model to acquire and monetize rooms through our digital platform. Butler delivers high quality food and services to hotel guests agnostic of brand, management company or ownership groups. Butler is VC-backed with $50 million+ of funding. The Company is growing rapidly and quickly expanding its footprint across the nation.<br/><br/>The above is intended to describe the general content of and requirements for the performance of this job. It is not to be construed as an exhaustive statement of duties, responsibilities or physical requirements. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3591218690"}