{"jobTitle": "Merchandising", "company": {"name": "The Home Depot", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "<strong><u>Job Description</u></strong><p><br/></p><strong><em>Merchandising Execution Associates:</em></strong>All Merchandising Execution Associates (MEAs) perform in-store merchandising service activities such as merchandising projects, planogram maintenance, overhead organization, and display/signage maintenance designed to enhance the customer experience. MEAs execute merchandising strategies and ensure products are displayed correctly to drive sales. MEAs work in teams, with on-site supervision and provide service to multiple departments in the store. Their focus is on general bay service, projects and product resets while always keeping safety, accuracy and efficiency at the forefront. MEAs build and maintain strong relationships with store associates and provide superior customer service to both internal and external customers.<p><br/></p>Full Time and Part Time positions<p><br/></p><strong>Day Team Merchandising Execution Associates (MEAs)</strong>spend approximately 80% of their time conducting general bay service or maintenance, ensuring that the products are stocked and properly merchandised to provide the customer the best possible shopping experience. Typically, 20% of their time is spent executing special projects designed to improve how products are displayed to the customer and to our suppliers needs.<p><br/></p>Full Time and Part Time positions<p><br/></p><strong>Night Team Merchandising Execution Associate(MEAs)</strong>spend approximately 80% of their time executing specific projects that introduce new items and conducting category resets to enhance the customer experience. Typically, 20% of their time is spent building displays and fixtures while utilizing basic hand tools in addition to refreshing display material/signage/brochures. Some general bay maintenance will occasionally be required. Night MEAs may be on a traveling team typically service multiple stores typically within a 30-mile radius. Mileage reimbursement is available for travel positions and must have reliable transportation.<p><br/></p>Full Time and part time position<p><br/></p><strong><u>Merchandising Services Specialists</u></strong><p><br/></p>Merchandising Services Specialists are responsible for implementing company standards for appearance and arrangement and ordering of merchandise. Plans and coordinates merchandise flow-through. Responsible for servicing and maintaining all assigned locations according to a set weekly visitation schedule.<p><br/></p>Full Time and Part Time positions", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3592059644"}