{"jobTitle": "Bartender & Floor Manager", "company": {"name": "Barcade®", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "The Floor Manager assists the General Manager in managing service and day to day operations of a specific Barcade location. The Floor Manager represents the Barcade brand and as such is friendly, attentive and knowledgeable of the brand and its unique offerings.<br/><br/>The position includes the option to work at least two bartending shifts. Eligible to participate in company health benefits eligible after 90 days of employment.<br/><br/>Duties and responsibilities<br/><ul><li> Manages service on designated shifts</li><li> Ability to bartend high volume shifts</li><li> Assists GM with daily operations including:</li><li>Overseeing staff training</li><li>Ensuring the completion of incident/accident reports, equipment repair reports, etc as necessary</li><li>Ordering and inventory for departments as assigned by the GM</li><li>Maintaining cleanliness and organization of location including walk ins, games work bench, storage areas, and office.</li><li>Performs daily walk throughs for cleanliness and compliance with health department and similar local regulations.</li><li>Performs daily play throughs of all games and makes minor repairs as necessary.<br/></li></ul><strong><u>Qualifications<br/></u></strong><ul><li> Previous management experience in a fast-paced bar setting.</li><li> Flexible schedule with ability to work some nights, weekends, and holidays.</li><li> Strong knowledge of craft beer.</li><li> Interest in vintage arcade games and willingness to do small repairs.</li><li> A passion for hospitality and customer service.</li><li> Strong attention to detail and organizational skills.</li><li> Ability to lift up to 60 lbs and stand for long periods of time.<br/></li></ul>Direct reports<br/><br/>Bartenders, Barbacks, Line Cooks, Dishwashers, Cleaning C", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3619885750"}