{"jobTitle": "Compensation Business Partner", "company": {"name": "Live Nation Entertainment", "location": "Beverly Hills, CA", "industry": "Entertainment Providers"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100,000.00 USD - 125,000.00 USD", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Entertainment Providers", "description": "Job Summary:<br/><br/><strong>WHO ARE WE?<br/><br/></strong>Live Nation Entertainment is the world’s leading live entertainment and eCommerce company, comprised of four market leaders: Ticketmaster.com, Live Nation Concerts, Front Line Management Group and Live Nation Network. Ticketmaster.com is the global event ticketing leader and one of the world’s top five eCommerce sites, with over 26 million monthly unique visitors. Live Nation Concerts produces over 20,000 shows annually for more than 2,000 artists globally. Front Line is the world’s top artist management company, representing over 250 artists. These businesses power Live Nation Network, the leading provider of entertainment marketing solutions, enabling over 800 advertisers to tap into the 200 million consumers Live Nation delivers annually through its live event and digital platforms. For additional information, visit www.livenation.com/investors.<br/><br/><strong>WHO ARE YOU?<br/><br/></strong>Passionate and motivated. Driven, with an entrepreneurial spirit. Resourceful, innovative, forward-thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on!<br/><br/><strong>THE ROLE<br/><br/></strong>As one of two Senior/Lead Compensation Business Partner, you’ll report directly to the VP of HR - Compensation, Benefits, HRIS. This role will aid in the design, implementation and administration of various compensation programs that enable the attraction and retention of talent in North America. This role is ideal for compensation professionals with an interest in analyzing data, handling sensitive information and making sound decisions, with a strong desire to manage details and deliver results and work in tandem with the HR Leads across divisions.<br/><br/><strong>What This Role Will Do<br/><br/></strong><ul><li>Partner with divisional HR leaders and Shared Services teams to develop division specific procedures and guidelines to ensure compensation programs are internally equitable and externally competitive</li><li>Provide professional consultation and guidance to HR Business Partners and divisional business leaders on market data and pay trends</li><li>Create compensation metrics and analyze data to assist business partners in making informed decisions</li><li>Manage participation in market surveys to determine market pay rates, salary structure and compensation budgets</li><li>Perform ongoing analysis of positions and assess compensation data</li><li>Lead various project teams such as compensation planning systems, budget planning, merger/acquisition integration, and pay-for-performance programs</li><li>Lead the annual compensation process</li><li>Guide preparation of job descriptions reflecting job responsibilities, activities, duties and requirements</li><li>Formulate recommendations regarding FLSA regulations, job revisions and changes in organizational structures</li><li>Provide analysis and input into the design, implementation, and ongoing management of compensation strategies</li><li>Assist in designing and administering new compensation programs (including short and long-term incentive plans)<br/><br/></li></ul><strong>What This Person Will Bring<br/><br/></strong><ul><li>Bachelor's degree required, preferably with a concentration in Finance, Accounting, Economics, Human Resources or other quantitative field</li><li>5+ years of compensation experience, along with a solid understanding of compensation practices/trends</li><li>Demonstrated experience building strong client relationships using solid interpersonal and collaborative skills</li><li>Demonstrated experience building strong client relationships using solid interpersonal and collaborative skills with HRBPs, Talent Acquisition and Business leaders required</li><li>Previous experience working across complex and nuanced Compensation structures, with the ability to be creative as it relates to solutioning for competitve pay plans preferred</li><li>Knowledge of federal, state and local regulations, and legislation that impacts compensation/pay.</li><li>Excellent analytical, mathematical and statistic skills</li><li>Strong written and verbal communication skills </li><li>Must have advanced knowledge of Microsoft Excel; should be an advanced user with experience linking multiple worksheets and external databases, using pivot tables, and writing nested functions.</li><li>Advanced knowledge of Microsoft Power Point, Excel, Word, and Access</li><li>Strong written and verbal communication skills </li><li>Experience managing independent workload and juggling multiple priorities</li><li>Ability to work in a rapidly evolving, fast paced culture and meet time-critical deadlines</li><li>Ability to be flexible with hours as workload changes and be able to multi-task effectively</li><li>Familiarity with Workday HCM is a plus</li><li>CCP certification a plus</li><li>Excellent analytical, mathematical and statistic skills</li><li>Global compensation experience nice to have<br/><br/></li></ul><strong>Benefits &amp; Perks<br/><br/></strong>Our motto is ‘Taking Care of Our Own’ through 6 pillars of benefits:<br/><br/><ul><li>HEALTH: Medical, Vision and Dental benefits for you and your family, including Flexible Spending Accounts (FSA) and Health Savings Accounts (HSAs)</li><li>YOURSELF: Generous paid time off policy including paid holidays, sick time and paid days off for your birthday, Free concert tickets</li><li>WEALTH: 401(k) program with company match, Stock Program</li><li>FAMILY: New parent programs &amp; support including caregiver leave and childcare cash, infertility support</li><li>CAREER: Tuition reimbursement, student loan repayment internal growth and development programs &amp; trainings</li><li>OTHERS: Volunteer time off, crowdfunding network<br/><br/></li></ul>Live Nation’s policy regarding vaccinations and masking will evolve based upon updated regulations and factors related to COVID-19. Currently, we strongly encourage employees to be fully vaccinated or have received a negative COVID test within [24] hours of entering an office.<br/><br/><strong>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/></strong>We are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion. You will be working in an inclusive environment and be encouraged to bring your whole self to work. We will do all that we can to help you successfully balance your work and homelife. As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with. It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities.<br/><br/>Live Nation strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.<br/><br/>We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas.<br/><br/>We also afford equal employment opportunities to qualified individuals with a disability. For this reason, Live Nation will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Live Nation also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Live Nation will also provide reasonable religious accommodations on a case by case basis.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job<br/><br/>Live Nation recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.<br/><br/>,CA<br/><br/>, IL<br/><br/>, GA<br/><br/>City<br/><br/>The expected compensation for this position is:<br/><br/>$100,000.00 USD - $125,000.00 USD<br/><br/><ul><li> Pay is based on a number of factors including market location, qualifications, skills, and experience.<br/><br/></li></ul>", "responsibilities": "<ul><li>Partner with divisional HR leaders and Shared Services teams to develop division specific procedures and guidelines to ensure compensation programs are internally equitable and externally competitive</li><li>Provide professional consultation and guidance to HR Business Partners and divisional business leaders on market data and pay trends</li><li>Create compensation metrics and analyze data to assist business partners in making informed decisions</li><li>Manage participation in market surveys to determine market pay rates, salary structure and compensation budgets</li><li>Perform ongoing analysis of positions and assess compensation data</li><li>Lead various project teams such as compensation planning systems, budget planning, merger/acquisition integration, and pay-for-performance programs</li><li>Lead the annual compensation process</li><li>Guide preparation of job descriptions reflecting job responsibilities, activities, duties and requirements</li><li>Formulate recommendations regarding FLSA regulations, job revisions and changes in organizational structures</li><li>Provide analysis and input into the design, implementation, and ongoing management of compensation strategies</li><li>Assist in designing and administering new compensation programs (including short and long-term incentive plans)<br/><br/></li></ul>", "qualifications": {"required": "Bachelor's degree required, preferably with a concentration in Finance, Accounting, Economics, Human Resources or other quantitative field\n5+ years of compensation experience, along with a solid understanding of compensation practices/trends\nDemonstrated experience building strong client relationships using solid interpersonal and collaborative skills\nDemonstrated experience building strong client relationships using solid interpersonal and collaborative skills with HRBPs, Talent Acquisition and Business leaders required\nPrevious experience working across complex and nuanced Compensation structures, with the ability to be creative as it relates to solutioning for competitve pay plans preferred\nKnowledge of federal, state and local regulations, and legislation that impacts compensation/pay.\nExcellent analytical, mathematical and statistic skills\nStrong written and verbal communication skills \nMust have advanced knowledge of Microsoft Excel; should be an advanced user with experience linking multiple worksheets and external databases, using pivot tables, and writing nested functions.\nAdvanced knowledge of Microsoft Power Point, Excel, Word, and Access\nStrong written and verbal communication skills \nExperience managing independent workload and juggling multiple priorities\nAbility to work in a rapidly evolving, fast paced culture and meet time-critical deadlines\nAbility to be flexible with hours as workload changes and be able to multi-task effectively\nFamiliarity with Workday HCM is a plus\nCCP certification a plus\nExcellent analytical, mathematical and statistic skills\nGlobal compensation experience nice to have<br/><br/>", "preferred": ""}, "skills": ["Compensation", "HR", "HRIS", "Market Research", "Compensation Planning", "Compensation Strategy", "Compensation Analysis", "Compensation Programs", "FLSA", "Microsoft Excel", "Microsoft PowerPoint", "Microsoft Word", "Microsoft Access", "Workday HCM", "CCP"], "postedDate": "2 weeks ago", "benefits": "Our motto is ‘Taking Care of Our Own’ through 6 pillars of benefits:<br/><br/><ul><li>HEALTH: Medical, Vision and Dental benefits for you and your family, including Flexible Spending Accounts (FSA) and Health Savings Accounts (HSAs)</li><li>YOURSELF: Generous paid time off policy including paid holidays, sick time and paid days off for your birthday, Free concert tickets</li><li>WEALTH: 401(k) program with company match, Stock Program</li><li>FAMILY: New parent programs &amp; support including caregiver leave and childcare cash, infertility support</li><li>CAREER: Tuition reimbursement, student loan repayment internal growth and development programs &amp; trainings</li><li>OTHERS: Volunteer time off, crowdfunding network<br/><br/></li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3631767590"}