{"jobTitle": "Account Representative - State Farm Agent Team Member (Property and Casualty Insurance Focus)", "company": {"name": "State Farm Agent", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "Position Overview<p><br/></p>Successful State Farm Agent is seeking a qualified professional to join their winning team for the role of Account Representative - State Farm Agent Team Member (Property and Casualty Insurance Focus). We seek an energetic professional interested in helping our business grow through value-based conversations and remarkable customer experience. If you are a motivated self starter who thrives in a fast-paced environment, then this is your opportunity for a rewarding career with excellent income and growth potential.<p><br/></p><strong><u>Responsibilities</u></strong><p><br/></p><ul><li>Establish customer relationships and follow up with customers, as needed.</li><li>Provide prompt, accurate, and friendly customer service. Service can include responding to inquiries regarding insurance availability, eligibility, coverages, policy changes, transfers, claim submissions, and billing clarification.</li><li>Use a customer-focused, needs-based review process to educate customers about insurance options.</li></ul><p><br/></p>As an Agent Team Member, you will receive...<p><br/></p><ul><li>Simple IRA</li><li>Salary plus commission/bonus</li><li>Paid time off (vacation and personal/sick days)</li><li>Flexible hours</li><li>Valuable experience</li><li>Growth potential/Opportunity for advancement within my agency</li></ul><p><br/></p><strong><u>Requirements</u></strong><p><br/></p><ul><li>Sales experience (outside sales or inside sales representative, retail sales associate, or telemarketing) preferred</li><li>Interest in marketing products and services based on customer needs</li><li>Enthusiastic about the role insurance and financial products play in helping people manage the risks of everyday life, recover from the unexpected, and realize their dreams</li><li>People-oriented</li><li>Self-motivated</li><li>Detail oriented</li><li>Dedicated to customer service</li><li>Achieve mutually agreed upon marketing goals</li><li>Property and Casualty license (must have currently)</li></ul><p><br/></p>If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.<p><br/></p>This position is with a State Farm independent contractor agent, not with State Farm Insurance Companies. Employees of State Farm agents must be able to successfully complete any applicable licensing requirements and training programs. State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm.<p><br/></p><strong>Looking for the skills and confidence to run a business in the future?</strong><p><br/></p>Our well-trained team uses state of the art technology to achieve outstanding results. We want to work alongside those who are equally committed to excellence and personal achievement. Our team is comprised of results-oriented individuals that are serious about their development. We take pride in using our years of valuable experience to mentor individual team members and prepare them for successful careers.<p><br/></p><strong><u>About Our Agency</u></strong><p><br/></p><ul><li>Our mission is to help people manage the risks of everyday life, recover from the unexpected and realize their dreams.</li><li>Our office is located in Newport Beach, CA.</li><li>I have been a State Farm agent since 2009.</li><li>I am a third generation State Farm agent. </li><li>I am a proud graduate of the University of San Diego. </li></ul><p><br/></p><strong>We look forward to speaking with you!</strong><p><br/></p><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3646048984"}