{"jobTitle": "Supply Chain Manager, GSC (JP9607)", "company": {"name": "3 Key Consulting, Inc.", "location": "Thousand Oaks, CA"}, "location": "Thousand Oaks, CA", "jobType": "Contract", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Biotechnology", "description": "<strong>Job Title</strong>: Supply Chain Manager, GSC (JP9607)<br/><br/><strong>Location:</strong> Thousand Oaks, CA<br/><br/><strong>Employment Type</strong>: Contract<br/><br/><strong>Business Unit: </strong>Global Supply Chain<br/><br/><strong>Duration</strong>: 12 months with likely extensions<br/><br/><strong>Job posting date</strong>: 1/03/2022<br/><br/><strong>Note: </strong>Remote<br/><br/>3 Key Consulting is hiring a Supply Chain Manager for a consulting engagement with our direct client, a leading global bio-pharmaceutical company.<br/><br/><strong><u>Job Summary<br/></u></strong><ul><li>The Americas Supply Chain is responsible for product planning, lifecycle management, distribution, and customer service for the United States, Canada, and Latin America.</li><li>The Value Chain Performance Management (VCPM) team within the Americas Supply Chain organization is accountable for the design, build, and business performance optimization of end-to-end value chains, integrating our enterprise functions with external stakeholders.</li><li>Developing and sustaining customer-centric end-to-end value chains will enable company to optimize the value we deliver to our patients and customers.</li><li>By leveraging process optimization, data and analytics, and change management, VCPM have successfully delivered substantial improvements to customer experience, service levels, lead times, and cost to serve.<br/></li></ul><strong><u>Top Must Have Skill Sets<br/></u></strong><ul><li>Operational excellence (methodology and/or projects, problem solving, leadership).</li><li>Supply Chain Management: 2-3 years.</li><li>Must have a Bachelor’s Degree; minimum requirement (no new grads).</li><li>Experience in a cross-functional business operations or project management role.</li><li>Ability to effectively manage multiple high-priority projects.<br/></li></ul><strong><u>Day-To-Day Responsibilities<br/></u></strong><ul><li>Lead design, build, and ongoing business performance management of e2e value chains.</li><li>Lead multi-year strategy development for value chain and supply chain segmentation</li><li>Liaise across various internal company functions (Commercial, Medical, Safety, IS, Finance, Operations) and external partners to achieve business outcomes.</li><li>Present to leadership on program performance, improvement opportunities &amp; budget</li><li>Leverage data insights, process mapping, and Operational Excellence methodologies to identify improvement opportunities.<br/></li></ul><strong><u>Employee Value Proposition<br/></u></strong><ul><li>Learn enterprise projects and expand multiple functions (finance, IS, operations)</li><li>Learn supply chain or more broadly learn value chains</li><li>Good mentorship</li><li>Leadership visibility</li><li>Expand operational excellence<br/></li></ul><strong><u>Red Flags<br/></u></strong><ul><li>Job jumping/rapid transitions</li><li>No bachelors degree</li><li>Lack of organizational and problem solving skills</li><li>Not able to work cross functionally<br/></li></ul><strong><u>Interview Process<br/><br/></u></strong>Phone screen - 30 minute<br/><br/>Webex follow up meeting<br/><br/>We invite qualified candidates to send your resume to resumes@3keyconsulting.com. If you decide that you’re not interested in pursuing this position, please feel free to look at other positions on our website www.3keyconsulting.com. You are welcome to also share this posting with anyone you think might be interested in applying for this role.<br/><br/>Regards,<br/><br/>3KC Talent Acquisition Team", "responsibilities": "Lead design, build, and ongoing business performance management of e2e value chains.Lead multi-year strategy development for value chain and supply chain segmentationLiaise across various internal company functions (Commercial, Medical, Safety, IS, Finance, Operations) and external partners to achieve business outcomes.Present to leadership on program performance, improvement opportunities &amp; budgetLeverage data insights, process mapping, and Operational Excellence methodologies to identify improvement opportunities.", "qualifications": {"required": "Operational excellence (methodology and/or projects, problem solving, leadership).Supply Chain Management: 2-3 years.Must have a Bachelor’s Degree; minimum requirement (no new grads).Experience in a cross-functional business operations or project management role.Ability to effectively manage multiple high-priority projects.", "preferred": ""}, "skills": ["Operational Excellence", "Supply Chain Management", "Project Management", "Business Operations"], "postedDate": "1 year ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3647582990"}