{"jobTitle": "Operations Professional- Century City", "company": {"name": "Tiffany & Co.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Management and Manufacturing", "industry": "Retail Apparel and Fashion, Retail Luxury Goods and Jewelry, and Retail", "description": "<strong>Job Description</strong><p><br/></p><strong>Purpose of the Role:</strong><p><br/></p>The Operations Professional is the heart of the back of house operations in a Tiffany store. The Operations Professional has strong communication and problem-solving skills and works effectively with client advisors, management, corporate partners, and clients to drive store sales and profitability.<p><br/></p><strong>As a Tiffany Operations Professional you will:</strong><p><br/></p><ul><li>Provide outstanding client service, order fulfillment and inventory management</li><li>Ensure merchandise is delivered all with the Tiffany Touch.</li><li>Be an excellent communicator and brand ambassador.</li><li>Cultivate an entrepreneurial spirit, be Creative and innovative and Deliver Excellence in all you do. Whist at the heart of it all knowing People make the difference. </li></ul><p><br/></p><strong>Operational Excellence:</strong><p><br/></p><ul><li>Champion Operational efficiency and effectiveness</li><li>Complete daily tasks such as order fulfillment, shipping, receiving and replenishment, cleaning jewelry, transferring merchandise, taking in jewelry repairs, and cleaning merchandise, following company operational policies and procedures.</li><li>Supervise and reconcile merchandise inventory, using reports and systems to assess inventory accuracy, report discrepancies to management or corporate partners.</li><li>Partner and communicate effectively with client advisors, management, and clients to respond and follow up on requests for assistance in product and service information, service, repairs, shipping, and inventory quickly and accurately.</li></ul><p><br/></p><strong>Service:</strong><p><br/></p><ul><li>Elevate in store experience consistently delivering memorable moments.</li><li>Demonstrate passion as a Tiffany brand ambassador by providing the Tiffany Touch during every client interaction.</li><li>Demonstrate Client Experience Behaviors identified within the NPS program.</li><li>Implement standard methodologies by optimizing hospitality and store amenities to create outstanding experiences and act on NPS performance and client feedback.</li><li>Apply deep knowledge of product, service, and care and handling instructions to increase client satisfaction during each interaction.</li><li>Support Company operations efficiency objectives by ensuring all activities improve efficiency and by providing feedback on process changes through appropriate channels.</li><li>Challenge the standards to seek continuous improvement</li></ul><p><br/></p><strong>Sales:</strong><p><br/></p><ul><li>Deepen the relationship with our clients to drive lifetime dedication and spend.</li><li>Carry out operations functions to support the store in consistently achieving or exceed monthly, quarterly, and annual commercial targets.</li><li>Collect data during client interactions to cultivate new and existing clients.</li><li>Optimally handle internal and external phone and e-mail correspondence and partner with Client Advisors and management to generate sales opportunities.</li></ul><p><br/></p><strong>Experience:</strong><p><br/></p>Required:<p><br/></p><ul><li>Strong Analytical skills</li><li>Proficient in Microsoft Word and Excel.</li><li>Ability to work retail store hours as necessary, including nights, weekends, and holidays.</li><li>Ability to connect with our clients</li><li>Organized and detail oriented</li><li>Flexibility to perform different tasks based on day-to-day business needs.</li><li>Must have authorization to work in the United States or in the country where the position is based.</li></ul><p><br/></p>Desired:<p><br/></p><ul><li>A college/university degree.</li></ul><p><br/></p>The hiring range for this position ranges from $19.55-26.45. The rate of pay offered will be dependent upon<p><br/></p>candidates’ relevant skills and experience. This role is also eligible for sales commission.", "postedDate": "2 weeks ago", "salary": {"amount": "19.55-26.45", "currency": "USD"}, "skills": ["Microsoft Word", "Microsoft Excel", "Analytical Skills", "Client Service", "Communication", "Inventory Management", "Retail", "Sales"], "url": "https://www.linkedin.com/jobs/view/3658636703"}