{"jobTitle": "Account Manager - Remote (Miami, FL Region)", "company": {"name": "Skytower Aviation Services, Inc.", "industry": "Aviation and Aerospace Component Manufacturing", "size": "Not specified", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Aviation and Aerospace Component Manufacturing", "description": "Summary\nThe Account Manager is responsible for servicing an assigned book of airline accounts and selling aftermarket commercial aircraft parts. This position will source material and MRO/ workshop quotations for aircraft part sales to Skytower’s commercial airline customer base. The successful candidate will be an aggressive, highly motivated salesperson, looking to get their foot in the door in a rapidly growing, young, energetic company.\n\nDaily activity centers around phone calls, data input, and analysis of how to win business in a competitive marketplace. Expect to be challenged to hone your sales skills, beat the competition, and become one of the best at what you do. If you are bright, motivated, and hungry for success - we encourage you to apply to join our team.\n\nEssential Functions\n- Proactive, assertive, and goal-oriented mentality.\n- Ability to work in a fast-paced, demanding sales environment.\n- Ability to communicate by phone and email in a proactive, detailed, and efficient manner.\n- Ability to understand Airline customers’ business requirements and satisfy expectations.\n- Understand the competitive marketplace; learn the market, products, services, and competitors.\n- Efficiently call suppliers and MROs to quote customers.\n- Track all sales activity in the Quantum Control electronic business application.\n- Assist sales management in servicing major accounts.\n- Other duties as assigned.\n- No recruiters, please.", "responsibilities": "- Proactive, assertive, and goal-oriented mentality.\n- Ability to work in a fast-paced, demanding sales environment.\n- Ability to communicate by phone and email in a proactive, detailed, and efficient manner.\n- Ability to understand Airline customers’ business requirements and satisfy expectations.\n- Understand the competitive marketplace; learn the market, products, services, and competitors.\n- Efficiently call suppliers and MROs to quote customers.\n- Track all sales activity in the Quantum Control electronic business application.\n- Assist sales management in servicing major accounts.\n- Other duties as assigned.", "qualifications": {"required": "High school diploma/GED required. 3 years in an office or business professional environment. 2 years in a sales role – OR – at least 1 year in sales in the aviation supply industry. Excellent verbal and written communication skills. Computer literacy (i.e., spreadsheets, MS Office, Outlook). Team player, while striving for individual excellence. Excellent business sense, and high executive acumen.", "preferred": "Bachelor or AA degree is preferred - but your experience and outlook are what counts."}, "skills": ["Sales", "Communication", "Customer Service", "Problem Solving", "Teamwork"], "postedDate": "1 year ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3666141445"}