{"jobTitle": "Customer Service Representative - State Farm Agent Team Member", "company": {"name": "State Farm Agent", "location": "Norwalk, CA"}, "location": "Norwalk, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "35,000.00 - 45,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Insurance", "description": "Responsive recruiter<br/><br/><strong>Overview<br/><br/></strong>Are you ready to join a dynamic team that's been making waves since 2008? Look no further! Our agency is expanding, and we're seeking passionate individuals to join us on our journey. With an office in California and a remote presence in Arizona - we offer flexible scheduling, a supportive work environment, and plenty of fun along the way. As part of our team of six seasoned professionals, you'll have the chance to engage with clients within California and Arizona, helping them discover their insurance needs. Plus, enjoy quarterly outings and become part of a community that values growth and collaboration.<br/><br/>Ready to make your mark? Apply now and discover why we're a top choice for job seekers like you.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Establish customer relationships and follow up with customers, as needed.</li><li>Use a customer-focused, needs-based review process to educate customers about insurance options.</li><li>Develop leads, schedule appointments, identify customer needs, and market appropriate products and services.<br/><br/></li></ul><strong>As an Agent Team Member, you will receive...<br/><br/></strong><ul><li>401K</li><li>Salary plus commission/bonus</li><li>Health benefits</li><li>Paid time off (vacation and personal/sick days)</li><li>Flexible hours</li><li>Growth potential/Opportunity for advancement within my agency</li><li>Hiring Bonus</li><li>Quarterly team outings</li><li>Bonus competitions</li><li>WFH options available <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Interest in marketing products and services based on customer needs</li><li>Excellent communication skills - written, verbal and listening</li><li>People-oriented</li><li>Detail oriented</li><li>Proactive in problem solving</li><li>Able to learn computer functions</li><li>Ability to work in a team environment</li><li>Currently licensed applicants preferred<br/><br/></li></ul>If you are motivated to succeed and can see yourself in this role, please complete our application. We will follow up with you on the next steps in the interview process.<br/><br/>This position is with a State Farm independent contractor agent, not with State Farm Insurance Companies. Employees of State Farm agents must be able to successfully complete any applicable licensing requirements and training programs. State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm.<br/><br/>Compensation: $35,000.00 - $45,000.00 per year<br/><br/><strong>We're Hiring!<br/><br/></strong>This busy insurance and financial services office has a passion to make a difference in the lives of others and better the community. We are an established, growth-oriented agency with a team of highly motivated individuals. We attribute our success to having a fun, energetic environment that is an enjoyable place to work. We want to work alongside those who are equally committed to excellence and personal achievement. If you want to work in an environment that is fun, challenging, and rewarding, then Maria Galli - State Farm Agent may be the right fit for you!<br/><br/><strong>About Our Agency<br/><br/></strong><ul><li>Our mission is to help people manage the risks of everyday life, recover from the unexpected and realize their dreams.</li><li>We help customers with their insurance and financial services needs, including Auto Insurance, Home Insurance, Life Insurance, Retirement Planning, Business Insurance, College Planning, Health Insurance, and Renters Insurance.</li><li>Our office is located in Whittier, CA.</li><li>Our office is open 9 A.M. - 6 P.M. Monday - Friday. </li><li>I have been a State Farm agent since 2007.</li><li>I am a proud graduate of University of California Berkley. </li><li>We currently have 6 team members at our agency. </li><li>Additional languages spoken: Spanish <br/><br/></li></ul><strong>If you want a career, not a job, then we encourage you to apply.<br/><br/></strong><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "responsibilities": "Establish customer relationships and follow up with customers, as needed.\nUse a customer-focused, needs-based review process to educate customers about insurance options.\nDevelop leads, schedule appointments, identify customer needs, and market appropriate products and services.", "qualifications": {"required": "Interest in marketing products and services based on customer needs\nExcellent communication skills - written, verbal and listening\nPeople-oriented\nDetail oriented\nProactive in problem solving\nAble to learn computer functions\nAbility to work in a team environment\nCurrently licensed applicants preferred"}, "skills": [], "postedDate": "1 year ago", "benefits": "401K\nSalary plus commission/bonus\nHealth benefits\nPaid time off (vacation and personal/sick days)\nFlexible hours\nGrowth potential/Opportunity for advancement within my agency\nHiring Bonus\nQuarterly team outings\nBonus competitions\nWFH options available", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3668770079"}