{"jobTitle": "Agent's Executive Assistant - State Farm Agent Team Member (Property and Casualty Insurance Focus)", "company": {"name": "State Farm Agent", "industry": "Insurance", "size": "Not specified", "location": "Whittier, CA"}, "location": "Whittier, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$25,000.00 - $35,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "Looking for a part-time job that provides meaningful work and competitive compensation? Consider a position in a State Farm Agent's office. As an Agent Team Member, you will receive hourly pay plus commission/bonus, flexible hours, valuable experience, and a signing bonus up to $500 when P & C licensed is obtained.", "responsibilities": "Establish customer relationships and follow up with customers, as needed. Provide prompt, accurate, and friendly customer service. Service can include responding to inquiries regarding insurance availability, eligibility, coverages, policy changes, transfers, claim submissions, and billing clarification. Use a customer-focused, needs-based review process to educate customers about insurance options.", "qualifications": {"required": "Excellent interpersonal skills, Excellent communication skills - written, verbal and listening, Dedicated to customer service, Ability to make presentations to potential customers, Provide timely and thorough activity reports to agent, Ability to conduct interviews in the office and in customer's home or business, Ability to assess customer needs and conduct effective interviews, Bilingual - Spanish required, Property and Casualty license (must have currently), Position may require irregular working hours", "preferred": ""}, "skills": ["Customer Service", "Communication", "Sales", "Bilingual - Spanish"], "postedDate": "1 year ago", "applicationDeadline": "Not specified", "benefits": "Hourly pay plus commission/bonus, Flexible hours, Valuable experience, Signing Bonus up to $500 when P & C licensed is obtained", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3669556288"}