{"jobTitle": "Sales Account Executive", "company": {"name": "Taycor Financial", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "42,000.00/yr - 80,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Financial Services", "description": "Taycor Financial is a rapidly-scaling equipment leasing and finance company headquartered in Los Angeles, CA. Since our inception over 30 years ago, Taycor has championed small and medium-sized business by providing financing with continued concierge-style service, guidance, and access to capital through our dedicated team of leasing and financing professionals.<br/><br/>We are looking for a highly self-motivated Account Executive to join our growing Sales team!<br/><br/><strong>About the Role:<br/><br/></strong>As a leader in our industry, Taycor has developed an innovative, truly unique, and infinitely scalable marketing engine. We have designed, built, tested, and have proven our process successful time and time again over the last several years.<br/><br/>Your book of business will be built through cultivating your own leads as well as supplementation from our marketing initiatives. You will be spending the majority of your workday on the phone interacting with active and interested potential customers and guiding them through the leasing and financing process. You must be a strong written and verbal communicator.<br/><br/>We will provide you with 360 degrees of support. We have in place the human and technology infrastructure to provide active leads, sales coaching, and experienced operations support to ensure success for successful closers.<br/><br/>This is a mentored sales position. Regardless of industry experience, you will begin with a structured training curriculum that includes classroom setting, historical analysis of best practices, and continue under the tutelage of a Senior Manager.<br/><br/>We are looking for driven account executives who are excited about closing deals and managing business relationships. Your time, focus, and talents will be spent closing deals.<br/><br/><strong>Duties/Responsibilities:<br/><br/></strong><ul><li>Identifying and creating opportunities by accessing our custom-built CRM database and reaching out to customers and vendors</li><li>Establishing and fostering relationships, typically through warm-calling</li><li>Capturing customer application and stipulation information to partner internally with Taycor’s Credit and Operations teams to help expedite the sales process</li><li>Maintaining in a high-volume of outbound phone calls daily</li><li>Continuously building a book of business by assessing customer current and anticipating future needs<br/><br/></li></ul><strong>Required Skills/Abilities:<br/><br/></strong><ul><li>Prior industry experience required, or strong sales background equivalent</li><li>Highly self-motivated and fearless when it comes to closing deals</li><li>Excellent follow-up and problem-solving skills</li><li>Strong communicator with excellent interpersonal skills</li><li>Ability to build rapport and establish relationships</li><li>Education and Experience:</li><li>Bachelor’s degree or 2+ years of Business to Business Sales experience preferred </li><li>CRM software experience a plus<br/><br/></li></ul><strong>Physical Requirements:<br/><br/></strong><ul><li>Prolonged periods of sitting at a desk and working on a computer<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Company-sponsored training</li><li>Advancement Opportunities</li><li>Medical, dental, vision, and life insurance</li><li>401k with company match</li><li>Paid holidays</li><li>Unlimited PTO<br/><br/></li></ul><strong>Compensation:<br/><br/></strong><ul><li>Multiple compensation plan offerings dependent upon experience and performance, base salary range from $42-$80k, commission range of 10-50%, and balance sheet bonus eligibility. </li><li>Monthly Commission</li><li>Residual Income<br/><br/></li></ul><strong>Application Instructions:<br/><br/></strong>To be considered for this role, submit a cover letter and resume.<br/><br/>Taycor is an equal opportunity employer. Qualified applicants are considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, status as a parent, national origin, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors.<br/><br/>If employed, employment, having no specified term, is based upon mutual consent and may be terminated at will, with or without cause, by either party (Taycor Financial or employee) without prior notice to the other, unless otherwise prohibited by law.", "responsibilities": "Identifying and creating opportunities by accessing our custom-built CRM database and reaching out to customers and vendors\nEstablishing and fostering relationships, typically through warm-calling\nCapturing customer application and stipulation information to partner internally with Taycor’s Credit and Operations teams to help expedite the sales process\nMaintaining in a high-volume of outbound phone calls daily\nContinuously building a book of business by assessing customer current and anticipating future needs", "qualifications": {"required": "Prior industry experience required, or strong sales background equivalent\nHighly self-motivated and fearless when it comes to closing deals\nExcellent follow-up and problem-solving skills\nStrong communicator with excellent interpersonal skills\nAbility to build rapport and establish relationships\nEducation and Experience:\nBachelor’s degree or 2+ years of Business to Business Sales experience preferred \nCRM software experience a plus", "preferred": "Bachelor’s degree or 2+ years of Business to Business Sales experience preferred \nCRM software experience a plus"}, "skills": ["CRM", "Sales", "Communication", "Relationship Building", "Problem Solving"], "postedDate": "1 year ago", "benefits": "Company-sponsored training\nAdvancement Opportunities\nMedical, dental, vision, and life insurance\n401k with company match\nPaid holidays\nUnlimited PTO", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3670484689"}