{"jobTitle": "Retail Merchandiser", "company": {"name": "Grocery Outlet", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "<strong>About Grocery Outlet<br/><br/></strong><ul><li>Our Mission: Touching lives for the better</li><li>Our Vision: Touching lives by being the first choice for bargain-minded consumers in the U.S.</li><li>Our Values &amp; Behaviors: Achievement, Diversity, Entrepreneurship, Family, Fun, Integrity &amp; Service<br/><br/></li></ul><strong>About The Team<br/><br/></strong>Our Sales and Merchandising team’s mission is to coach and develop our Independent Operator’s staff and assist their efforts in maintaining overall productivity and best practices in their store. The team is comprised of a diverse group of individuals that work together merchandising new store locations along with supporting existing stores.<br/><br/><strong>About The Role<br/><br/></strong>As a Retail Merchandiser you are a part of the most important team in the company! You will assist in the setup of all new stores in all states where we operate (CA, WA, OR, NV, ID &amp; PN). You will travel by plane 75-100% of the time spending an average of 2 days a week at home. While traveling you will have to adhere to the various county and state guidelines around COVID protocol. The Retail Merchandising Team travels to different locations weekly to help merchandise new stores and support existing store operators. You serve as a brand ambassador in the field to Independent Operators (IOs) and their store teams. The Retail Merchandiser will report to the Merchandising Manager.<br/><br/><strong>About The Pay<br/><br/></strong><ul><li>Base Salary: $22.50 hr</li><li>401(k) Profit Sharing</li><li>Medical, Dental, Vision &amp; More!</li><li>Final compensation will be determined based upon experience and skills and may vary based on location.<br/><br/></li></ul><strong>Responsibilities Include<br/><br/></strong><ul><li>Demonstrating merchandising best practices to store employees</li><li>Training Independent Operators and their store teams on merchandising and brand standards</li><li>Constructing &amp; deconstructing of store fixtures including shelving and racking</li><li>Unpacking pallets with various types of food &amp; products</li><li>Merchandising and organizing product on the sales floor and in the stock room</li><li>Working efficiently and effectively on tight timelines</li><li>Administrative tasks including but not limited to managing expenses, booking flights, submitting time sheets, checking email etc.</li><li>Other duties as assigned<br/><br/></li></ul><strong>About You<br/><br/></strong><ul><li>You have a can-do, professional, and positive attitude</li><li>Ability to lift up to 50lbs</li><li>Willing to travel weekly via plane and work 5-10 days in a row</li><li>Willing to work a flexible schedule including nights, weekends and overnight shifts</li><li>Able to work occasional overtime when needed</li><li>Strong verbal and written communication skills<br/><br/></li></ul>To learn about how we collect, use and secure your personal information. Click here to see our privacy policy.", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3678050259"}