{"jobTitle": "Corporate Supply Chain Supervisor", "company": {"name": "AHMC HealthCare", "location": "Alhambra, CA"}, "location": "Alhambra, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "<strong>Primary Function</strong><p><br/></p>The Corporate Supply Chain Supervisor coordinates and is responsible to oversee and manage the daily operational activities of the Buyer and Expediters in managing the processing orders for various supplies, equipment, and services. The Corporate Supply Chain Supervisor oversee the activities of the buyers throughout the AHMC system to ensure that economies of scale are obtained through vendor sources. The position ensures procurement of capital purchases and various supplies and services requested by each facility according to policy.<p><br/></p><strong>Accountability</strong><p><br/></p><ul><li>Develops policies and procedures and guides activities towards the attainment of materials and equipment from reliable sources, in sufficient quantities and at minimum costs; works with department heads and other hospital personnel facilitating supply and capital equipment</li><li>Manages Purchasing activities such as value analysis, purchasing research, buying, expediting, product specification, bid analysis, contract negotiations for supplies and services, and the maintenance of appropriate records and files.</li><li>Assists with monitoring contract expiration dates, run monthly reports for review with Director-e.g. hospital spend, cycle counts, inventory, etc.</li><li>Acts as a resource to department personnel and other hospital departments and to Buyers; assists departments with securing alternative supplies, equipment and services, as needed, when unavailable through primary vendors.</li><li>Audit contract pricing, validate AHMC is receiving the correct pricing on all invoice discrepancies. </li><li>Manage the corporate Buyers and Expediters daily ordering activities (product backorders, product alternatives).</li><li>Assists the Director of Corporate Supply Chain on cost saving product and service projects.</li><li>Performs other related duties as requested and/or required by the Director of Corporate Supply Chain.</li></ul><p><br/></p><strong>Qualifications</strong><p><br/></p><ul><li>Bachelor’s (BS or BA) degree in a field of study related to this position preferred or equivalent experience.</li><li>Minimum of two years progressive materials management experience in a healthcare environment</li><li>Proficiency with purchasing and word processing systems (MS office).</li><li>Knowledge of current materials management technology, practices and information systems</li><li>Knowledge of and ability to apply effective negotiating skills with emphasis in contract terminology and legal requirement</li><li>Excellent organization, communication, and judgement skills</li><li>Ability to follow through and troubleshoot</li><li>Critical thinking skills</li></ul>", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3683347063"}