{"jobTitle": "Restaurant & Rooftop Bar Manager", "company": {"name": "Botanical Hospitality Group ", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other and Management", "industry": "Dairy Product Manufacturing, Veterinary Services, and Fisheries", "description": "<strong>Summary Description<br/><br/></strong><ul><li>We are looking for a Restaurant Manager to lead all aspects of our business. You will deliver a high-quality menu and motivate our staff to provide excellent customer service. To be successful in this role, you'll need management skills and experience in both front and back of the house. We want you to know how to oversee the dining room, check-in with customers and balance seating capacity. Back of the house management experience is also essential, as you'll hire qualified Cooks and Wait Staff, set work schedules, oversee food prep and make sure we comply with health and safety restaurant regulations. We'll expect you to lead by example and uplift our staff during busy moments in our fast-paced environment. Ultimately, you will ensure our restaurant runs smoothly and customers have pleasant dining experiences.<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>Coordinate daily Front of the House and Back of the House restaurant operations.</li><li>Deliver superior service and maximize customer satisfaction.</li><li>Respond efficiently and accurately to customer complaints.</li><li>Regularly review product quality and research new vendors.</li><li>Organize and supervise shifts.</li><li>Appraise staff performance and provide feedback to improve productivity.</li><li>Estimate future needs for goods, kitchen utensils and cleaning products.</li><li>Ensure compliance with sanitation and safety regulations.</li><li>Manage restaurant's good image and suggest ways to improve it.</li><li>Control operational costs and identify measures to cut waste.</li><li>Create detailed reports on weekly, monthly and annual revenues and expenses.</li><li>Promote the brand in the local community through word-of-mouth and restaurant events.</li><li>Recommend ways to reach a broader audience (e.g. discounts and social media ads).</li><li>Train new and current employees on proper customer service practices.</li><li>Implement policies and protocols that will maintain future restaurant operations.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Proven work experience as a Restaurant Manager, Restaurant General Manager, Hospitality Manager or similar role.</li><li>Proven customer service experience as a manager.</li><li>Extensive food and beverage (F&amp;B) knowledge, with the ability to remember and recall ingredients and dishes to inform customers and wait staff.</li><li>Familiarity with restaurant management software, like OpenTable and PeachWorks.</li><li>Strong leadership, motivational and people skills.</li><li>Acute financial management skills.</li><li>BS degree in Business Administration; hospitality management or culinary schooling is a plus.</li></ul>", "postedDate": "1 year ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3683929367"}