{"jobTitle": "Ocean Import Specialist", "company": {"name": "FNS, Inc.", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.63/hr - $31.25/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Transportation, Logistics, Supply Chain and Storage", "description": "<strong>Company Overview<br/><br/></strong>Since its inception in 1995, FNS has been focused on providing the best total logistics services by implementing our core values: trust, communication, team play, challenge, and balance. Through trust, we can be a logistics partner that customers trust with a diverse group that works together based on a strong, unified belief. By communicating with and accommodating the voices of customers and co-workers we can deliver the best services. Our team play is enhanced by the appreciation and cooperation with each other with a focus on a singular goal. Challenging the status quo and innovating, FNS is unafraid of failure and strives to develop and improve our processes. Work-life balance strives to provide individuals with happiness to achieve and grow together.<br/><br/>For 2025, we have set out to become one of the nation’s top 25 logistics companies with more than $1,500M in sales, with the best employee and customer satisfaction, and a network of over 100 different partners.<br/><br/>To achieve our goals, there is an emphasis on three traits of work. We promote a family-like working environments allow us to help promote every member’s work-life balance, allowing us to develop cooperation and care for one another like family. We are nominated by our customers whom we can grow with based on a trusting relationship between our services and our customers. We specialize fields of work where professionals can nurture their talent, and we focus on every member’s work-life balance so that members may cooperate and care for each other like family. Our core values are integral to the success and growth of FNS.<br/><br/>To Discover more, please visit our website at http://www.fnsusa.com<br/><br/>Ocean Import Specialist<br/><br/><strong>About The Job<br/><br/></strong>At FNS, we are committed to the satisfaction of both our customers and our employees. We pride ourselves on the family-like work culture that we have established; we are looking for talented individuals to join our team. The Ocean Import Specialist position is responsible for the gathering of information from clients to determine shipping needs, performing daily reports, shipment tracking, and communication with clients, as well as booking freight services, coordinating pickup and drop off shipments for clients. They will advise clients on supply chain issues, update customer management software, and obtain shipping quotes from carriers. Join us to improve the working experience for our employees and play a key role in the growth of the company.<br/><br/>Location: 18620 Harmon Ave., Carson, CA 90746<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Perform daily task (daily report / shipment tracking / communicate with clients, etc.)</li><li>Gather information from clients to determine their shipping needs.</li><li>Obtain shipping quotes from carriers and passing them on to clients.</li><li>Book freight service through carriers for clients.</li><li>Coordinate the pick up and drop off shipments.</li><li>Monitor the progress of shipments to ensure that goods arrive promptly and undamaged.</li><li>Updating customer management software to keep client records accurate.</li><li>Advise clients on potential supply chain issues.</li><li>Additional projects as needed.<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Korean/English bilingual preferred.</li><li>0-3 years’ equivalent experience.</li><li>Excellent analytical and problem solving skills.</li><li>Highly organized with Ability to Multi-task.</li><li>A high level of integrity, accuracy, dependability, enthusiasm and confidentiality.<br/><br/><br/></li></ul>The base salary range for this role is between $21.63 - $31.25 hourly, and your base salary will depend on your experiences, qualifications, and skills.<br/><br/><strong>Benefits (Full-Time ONLY)<br/><br/></strong><ul><li>Health, Dental, and Vision PPO Insurance</li><li>Life, STD, LTD Insurance</li><li>401(K) Plan</li><li>14 Paid Holidays</li><li>Paid Time Off (Starting 12 days/year)</li><li>Additional Paid time off (Bereavement, Wedding, Birth of a Child, etc.)</li><li>Years of Service Awards</li><li>Education Assistant Program (Based on Eligibility)<br/><br/><br/></li></ul>If you are a California resident, California law may provide you with additional rights regarding our use of your personal information. To learn more about your California privacy rights, visit https://oag.ca.gov/privacy/ccpa.", "responsibilities": "<ul><li>Perform daily task (daily report / shipment tracking / communicate with clients, etc.)</li><li>Gather information from clients to determine their shipping needs.</li><li>Obtain shipping quotes from carriers and passing them on to clients.</li><li>Book freight service through carriers for clients.</li><li>Coordinate the pick up and drop off shipments.</li><li>Monitor the progress of shipments to ensure that goods arrive promptly and undamaged.</li><li>Updating customer management software to keep client records accurate.</li><li>Advise clients on potential supply chain issues.</li><li>Additional projects as needed.<br/><br/><br/></li></ul>", "qualifications": {"required": "Korean/English bilingual preferred.\n0-3 years’ equivalent experience.\nExcellent analytical and problem solving skills.\nHighly organized with Ability to Multi-task.\nA high level of integrity, accuracy, dependability, enthusiasm and confidentiality.<br/><br/><br/>", "preferred": ""}, "skills": [], "postedDate": "4 weeks ago", "benefits": "<ul><li>Health, Dental, and Vision PPO Insurance</li><li>Life, STD, LTD Insurance</li><li>401(K) Plan</li><li>14 Paid Holidays</li><li>Paid Time Off (Starting 12 days/year)</li><li>Additional Paid time off (Bereavement, Wedding, Birth of a Child, etc.)</li><li>Years of Service Awards</li><li>Education Assistant Program (Based on Eligibility)<br/><br/><br/></li></ul>", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3683472342"}