{"jobTitle": "Operations Associate", "company": {"name": "Crate and Barrel", "location": "Beverly Hills, CA"}, "location": "Beverly Hills, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "15.50/hr - 22.50/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "We inspire purpose-filled living that brings joy to the modern home. With a team of more than 8,000 associates spanning 130 store and distribution locations across the U.S. and Canada, we achieve together, drive results and innovate to inspire. Drawn together by a shared passion for our customers and a spirit of fun, we deliver high-quality home furnishings that are expertly designed, responsibly sourced and bring beauty and function to people’s homes. From the day we opened our first store in Chicago in 1962 to the digital innovations that engage millions of customers today, our iconic brand is nearly 60 years in the making—and our story is still unfolding.<br/><br/>We’re here for it. We think you should be too. We’re looking for a driven professional with an inclusive mindset to join our team as a Operations Associate.<br/><br/>Operations Associates are the rare breed of highly organized and efficient individuals. Maintaining an organized stockroom is key to this position. You're also incredibly accurate and meticulous. Reporting to the Assistant Leader, you work as part of a very talented team of associates who's main goal is to maintain an efficient stockroom to ensure excellent customer service. Also in this role, you will be supporting the sales floor in stocking and maintaining store displays. A positive attitude, sense of enthusiasm and ability to multitask are musts for every day.<br/><br/>A day in the life as a Operations Associate...<br/><br/> <ul><li>Maximize company sales growth and profitability by maintaining the stockroom and sales floor and facilitate the flow of product in order to provide an engaging experience to every customer, every time.</li><li>Perform duties associated with receiving and processing trucks.</li><li>Safely process and assist with customer pick-up orders.</li><li>Safely operate and maintain all stockroom equipment and tools and keep equipment in good working order.</li><li>Assist the Assistant Leaders effort to support financial and inventory accuracy.</li><li>Perform general maintenance of the store.</li><li>Maintain lighting in the store.</li><li>Maintain an awareness of current product in all departments.</li><li>Support and model excellent service by exhibiting a positive attitude and enthusiasm toward the job and company to both internal and external customers in all forms of communication.</li><li>Actively participate in weekly merchandising meetings, store meetings and training sessions.</li><li>Promote a strong sense of teamwork by working together safely, effectively, respectfully and efficiently with all associates.</li><li>Support an engaged customer experience by maintaining an organized and efficient stockroom.</li><li>Assist and support the execution of the store's seasonal and weekly floor plans under the direction of the Assistant Store Leader, Visual and Team Leader, Visual.</li><li>Maintain awareness and demonstrate a fundamental knowledge of computers, systems and programs relevant to the position.</li><li>Participate in ongoing training regarding technology upgrades and new systems.<br/><br/></li></ul>What You'll Bring To The Table...<br/><br/> <ul><li>Stock, Distribution Center, or retail experience preferred</li><li>Good reading, written and verbal language skills (English)</li><li>Organizational and time management skills<br/><br/></li></ul>We'd love to hear from you if you have...<br/><br/> <ul><li>Ability to move and/ or lift up to 65 pounds: heavier merchandise with team assist</li><li>Full-Time roles: Open availability to work flexible hours on weekdays, evenings and weekends</li><li>Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and/or Sunday) and at least one weekday or night<br/><br/></li></ul>Minimum Starting Rate: $15.50 Hourly<br/><br/>Up to: $22.50 Hourly<br/><br/>Pay ranges will be adjusted upward as needed to comply with applicable state and local law. In addition to your salary, based on your role, associates may be eligible for other compensation including bonuses, sales incentives, and long term incentives.<br/><br/>", "responsibilities": "Maximize company sales growth and profitability by maintaining the stockroom and sales floor and facilitate the flow of product in order to provide an engaging experience to every customer, every time.\nPerform duties associated with receiving and processing trucks.\nSafely process and assist with customer pick-up orders.\nSafely operate and maintain all stockroom equipment and tools and keep equipment in good working order.\nAssist the Assistant Leaders effort to support financial and inventory accuracy.\nPerform general maintenance of the store.\nMaintain lighting in the store.\nMaintain an awareness of current product in all departments.\nSupport and model excellent service by exhibiting a positive attitude and enthusiasm toward the job and company to both internal and external customers in all forms of communication.\nActively participate in weekly merchandising meetings, store meetings and training sessions.\nPromote a strong sense of teamwork by working together safely, effectively, respectfully and efficiently with all associates.\nSupport an engaged customer experience by maintaining an organized and efficient stockroom.\nAssist and support the execution of the store's seasonal and weekly floor plans under the direction of the Assistant Store Leader, Visual and Team Leader, Visual.\nMaintain awareness and demonstrate a fundamental knowledge of computers, systems and programs relevant to the position.\nParticipate in ongoing training regarding technology upgrades and new systems.", "qualifications": {"required": "Good reading, written and verbal language skills (English)\nOrganizational and time management skills", "preferred": "Stock, Distribution Center, or retail experience preferred"}, "skills": ["Stock", "Distribution Center", "Retail", "English", "Organizational", "Time Management"], "postedDate": "1 year ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3686224559"}