{"jobTitle": "Director of Buying", "company": {"name": "Fashion Nova", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "industry": "Retail Apparel and Fashion", "jobFunction": "Purchasing and Supply Chain", "description": "<strong>About Us<br/><br/></strong>Fashion Nova is a leading, digital and social commerce platform, and is one of the most visible fashion brands today. Fashion Nova was founded in 2006 when our first store opened its doors. Fast forward to 2013, Fashionnova.com and @fashionnova were born -- our customers became our models and social media became our runway.<br/><br/>Fashion Nova was built on the backbone of individuality and inclusiveness. Today, Fashion Nova is worn and celebrated by the hottest musicians, influencers and fashionistas. Our go-to-market strategy enables style innovation at warp speed, and at an accessible price point. With no plans on slowing down, Fashion Nova is set to provide everyone equal accessibility to fashion.<br/><br/><strong>About The Role<br/><br/></strong>Fashion Nova is seeking a passionate Category Director who has hands on Buying and Product Development experience. The Category Director will be responsible for developing and executing strategies which provide the Buying Merchandise direction for his/her assigned division. The Director will focus on the overall direction, market penetration, assortment, and vendor mix to meet the demands of our customer base for their division. They will also oversee a team of buyers.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Execute a merchandise assortment that supports the financial, merchandising, and marketing objectives.</li><li>Determine daily and or weekly which inventory items should be replenished based on order history.</li><li>Research new products to add to the total assortment.</li><li>Research market for inspiration on new products, pricing, strategies, and planning.</li><li>Seek out new influencers, shop various vendors for inspiration to stay current on market trends.</li><li>Lead weekly open-to-buy meetings with planning and buying teams to ensure the department achieves financial targets for turn and sell-through.</li><li>Train, develop, and mentor the buying team to ensure that financial and product goals are met.</li><li>Develop and maintain a profitable and productive partnership with vendors.</li><li>Contribute to the success of making the Fashion Nova brand number #1.<br/><br/><br/></li></ul><strong>Required Skills<br/><br/></strong><ul><li>BFA or BA in Fashion Merchandising, Business, or related field preferred</li><li>Must have 15+years of Apparel Buying/Merchandising experience in Lingerie; with 5 years min of Buying Management experience</li><li>Experience with product development preferred</li><li>Must be able to adapt to constant change and multi-task in a fast-paced environment</li><li>Must be results oriented and have excellent organizational skills</li><li>Must have excellent written and verbal communication skills</li><li>Must possess a keen eye for design, trends and color<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Employee Discount</li><li>Medical, Dental and Vision Coverage</li><li>401k Match</li><li>Kitchen stocked with snacks and drinks</li><li>Weekly catered food, fun events, raffles and free FN swag </li><li>Summer Fridays at HQ</li><li>Company Sponsored Parties</li><li>Team bonding events and programs to strengthen relationships with co-workers<br/><br/><br/></li></ul><strong>Fashion Nova, Inc. is an equal opportunity employer committed to a diverse workplace environment. <br/><br/></strong><strong>NOTICE AT COLLECTION</strong>", "responsibilities": "Execute a merchandise assortment that supports the financial, merchandising, and marketing objectives. Determine daily and or weekly which inventory items should be replenished based on order history. Research new products to add to the total assortment. Research market for inspiration on new products, pricing, strategies, and planning. Seek out new influencers, shop various vendors for inspiration to stay current on market trends. Lead weekly open-to-buy meetings with planning and buying teams to ensure the department achieves financial targets for turn and sell-through. Train, develop, and mentor the buying team to ensure that financial and product goals are met. Develop and maintain a profitable and productive partnership with vendors. Contribute to the success of making the Fashion Nova brand number #1.", "qualifications": {"required": "BFA or BA in Fashion Merchandising, Business, or related field preferred Must have 15+years of Apparel Buying/Merchandising experience in Lingerie; with 5 years min of Buying Management experience Experience with product development preferred Must be able to adapt to constant change and multi-task in a fast-paced environment Must be results oriented and have excellent organizational skills Must have excellent written and verbal communication skills Must possess a keen eye for design, trends and color", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Employee Discount Medical, Dental and Vision Coverage 401k Match Kitchen stocked with snacks and drinks Weekly catered food, fun events, raffles and free FN swag Summer Fridays at HQ Company Sponsored Parties Team bonding events and programs to strengthen relationships with co-workers", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3690784610"}