{"jobTitle": "VP of Buying", "company": {"name": "Fashion Nova", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Other", "industry": "Retail Apparel and Fashion", "description": "<strong>About Us</strong><p><br/></p>Fashion Nova is an inclusive fashion-forward and trend-driven apparel and lifestyle brand that celebrates all dimensions of confidence. We use our platform to spread positivity with brands for women, men, curve, luxe, sport, swim, beauty, and kids. We are obsessed with creating the best experience available for our customers and employees.<p><br/></p>Fashion Nova was built on the backbone of individuality and inclusiveness. Our brands are worn and celebrated worldwide by customers, celebrities, and influencers because of our uniquely creative and talented employees.<p><br/></p><strong>Role Overview</strong><p><br/></p>The Vice President of Buying will set the overall strategy and merchandise direction for the category. You will develop the buying and selling strategies that will maximize the Company’s performance and profitability. You will determine the product lines and merchandise to be sold in the category online and in-stores.<p><br/></p>Working with multiple departments across the organization, you will influence product marketing strategies, create market penetration strategies for the overall category, and manage the overall relationship with the Company’s network of vendors. Your role is essential to ensuring our customers have a premium selection of apparel across our Denim category.<p><br/></p>To be successful in this role, you must be able to keep pace in a highly fluid, ever-changing, collaborative workplace. You must also have excellent communication skills in order to engage the attention of our experienced leadership team and influence|respond to complexities with a high level of technical acumen.<p><br/></p><strong>Responsibilities</strong><p><br/></p><ul><li>Build seasonal assortments covering all channel needs</li><li>Develop seasonal merchandising initiatives and strategies to drive growth and brand positioning</li><li>Manage all key milestones for Denim, from adoption meetings to assortment plan and line finalization</li><li>Provide market and trend research to Leadership product trends and opportunities</li><li>Manage and execute key metrics including: Act as product|market expert on competition and industry trends; works closely with cross-functional teams to translate knowledge into innovative, relevant business opportunities:</li><li>Margin</li><li>Delivery</li><li>Assortment plan</li><li>SKU plan</li><li>Fabric</li><li>Oversee assortment SKU plans and final product selection for the division, ensuring costing goals are met while maximizing brand positioning</li><li>Work closely with eCommerce and Creative teams to strategize initiatives and marketing campaigns</li><li>Ensure the department is organized and staffed to meet the objectives of the division</li><li>Manage career paths, development and succession plans of the team</li></ul><p><br/></p><strong>Role Requirements</strong><p><br/></p><ul><li>Fifteen plus years of experience across Buying/Merchandising </li><li>Seven plus years of experience overseeing both the creative and financial aspects of merchandising</li><li>Five plus years of experience leading, coaching, and mentoring teams</li><li>Experience in product development, trend forecasting, and have a deep knowledge of product design, fabrics, and colors</li><li>Strong background concept research</li><li>Knowledgeable about fabrics: drape, appropriate use, quality</li><li>Strong understanding of garment construction</li><li>Must have experience with fittings</li><li>Experience working with domestic and overseas factories|suppliers is beneficial</li><li>Appetite for design influences</li><li>Strong eye for both elevated design and ability to judge overall assortment balance</li><li>Demonstrate strong ownership of one’s own categories</li><li>Commercial acumen and desire to read and understand sales reports</li><li>Customer-focused and data driven</li><li>Strong communication skills and the ability to communicate confidently at all levels</li><li>Ability to work under pressure and with strong personalities</li><li>Awareness of the financial performance of the business and be motivated to grow it</li><li>Good teamwork and interpersonal skills</li><li>Be customer focused and interested in reacting and chasing to what is selling well</li><li>BFA|BA in Fashion Merchandising, Business, or related field, or equivalent work experience</li><li>English, additional language(s) an advantage</li><li>Schedule of this position: Monday – Friday | Core business hours | Onsite</li></ul><p><br/></p><strong>Benefits</strong><p><br/></p><ul><li>Formalized career paths</li><li>Flat management platform</li><li>Manager Training Academy</li><li>Creative Development Internship Program</li><li>Fashion Nova Cares Program</li><li>Flexible Paid Time Off (PTO)</li><li>Medical, Dental and Vision Coverage</li><li>401k match, with immediate vesting upon eligibility</li><li>Stocked kitchens with gratis snacks and drinks</li><li>Weekly catered lunches</li><li>Summer Fridays at Headquarters</li><li>Team bonding events and programs</li><li>Employee discounts</li></ul><p><br/></p>Fashion Nova, LLC, and subsidiaries thereof, is an Equal Opportunity Employer. We are steadfast in our commitment to equal employment opportunities and pledge that these objectives are reflected in all aspects of our daily operations. We will continue to recruit, hire, train, and advance in employment qualified individuals in all job titles without regard to race, color, national origin, gender, sexual orientation, gender identity, religion, age, status as a protected veteran, criminal history, or status as an individual with a disability; and shall not discriminate against any individual, any such characteristic, nor any other classification protected by local, state and|or federal law.<p><br/></p><strong>NOTICE AT COLLECTION</strong>", "responsibilities": "Build seasonal assortments covering all channel needsDevelop seasonal merchandising initiatives and strategies to drive growth and brand positioningManage all key milestones for Denim, from adoption meetings to assortment plan and line finalizationProvide market and trend research to Leadership product trends and opportunitiesManage and execute key metrics including: Act as product|market expert on competition and industry trends; works closely with cross-functional teams to translate knowledge into innovative, relevant business opportunities:MarginDeliveryAssortment planSKU planFabricOversee assortment SKU plans and final product selection for the division, ensuring costing goals are met while maximizing brand positioningWork closely with eCommerce and Creative teams to strategize initiatives and marketing campaignsEnsure the department is organized and staffed to meet the objectives of the divisionManage career paths, development and succession plans of the team", "qualifications": {"required": "Fifteen plus years of experience across Buying/Merchandising Seven plus years of experience overseeing both the creative and financial aspects of merchandisingFive plus years of experience leading, coaching, and mentoring teamsExperience in product development, trend forecasting, and have a deep knowledge of product design, fabrics, and colorsStrong background concept researchKnowledgeable about fabrics: drape, appropriate use, qualityStrong understanding of garment constructionMust have experience with fittingsExperience working with domestic and overseas factories|suppliers is beneficialAppetite for design influencesStrong eye for both elevated design and ability to judge overall assortment balanceDemonstrate strong ownership of one’s own categoriesCommercial acumen and desire to read and understand sales reportsCustomer-focused and data drivenStrong communication skills and the ability to communicate confidently at all levelsAbility to work under pressure and with strong personalitiesAwareness of the financial performance of the business and be motivated to grow itGood teamwork and interpersonal skillsBe customer focused and interested in reacting and chasing to what is selling wellBFA|BA in Fashion Merchandising, Business, or related field, or equivalent work experienceEnglish, additional language(s) an advantageSchedule of this position: Monday – Friday | Core business hours | Onsite", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Formalized career pathsFlat management platformManager Training AcademyCreative Development Internship ProgramFashion Nova Cares ProgramFlexible Paid Time Off (PTO)Medical, Dental and Vision Coverage401k match, with immediate vesting upon eligibilityStocked kitchens with gratis snacks and drinksWeekly catered lunchesSummer Fridays at HeadquartersTeam bonding events and programsEmployee discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3694104791"}