{"jobTitle": "Overnight Supervisor - Hollywood Palladium", "company": {"name": "Live Nation Entertainment", "industry": "Entertainment Providers", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00 USD - 25.00 Hourly", "currency": "USD"}, "jobFunction": "Other", "industry": "Entertainment Providers", "description": "Job Summary:<br/><br/><strong>WHO ARE WE?<br/><br/></strong>Live Nation Entertainment is the world’s leading live entertainment company, comprised of global market leaders: Ticketmaster, Live Nation Concerts, and Live Nation Media &amp; Sponsorship. Ticketmaster is the global leader in event ticketing with over 500 million tickets sold annually and more than 12,000 clients worldwide.  Live Nation Concerts is the largest provider of live entertainment in the world promoting more than 40,000 shows and 100+ festivals annually for nearly 4,000 artists in over 40 countries. These businesses allow Live Nation Media &amp; Sponsorship to create strategic music marketing programs that connect over 1,000 brands with the 98 million fans that attend Live Nation Entertainment events each year. For additional information, visit www.livenationentertainment.com.<br/><br/>Live Nation’s Concerts Division is where tours are born, artists come to life, and fans get to experience the rush of live music. From our dozens of owned/operated Amphitheaters to our Global Touring team, from Ticketing and Venue Operations to Marketing and Sales... we foster a fun and upbeat work culture with no shortage of opportunities. With perks ranging from free concert tickets to dog-friendly offices, to progressive benefits like student loan reimbursement and adoption/fertility support... it’s no wonder we are certified as a <em>Great Place to Work</em> organization and one of People Magazine’s “50 Companies that Care”. We want everyone to feel like they belong and can thrive in our community, so we strive to help you achieve your career and personal goals. Live music is our passion and where we find our common ground. There has never been a better time to join Live Nation.<br/><br/><strong>WHO ARE YOU?<br/><br/></strong>Passionate and motivated. Driven, with an entrepreneurial spirit. Resourceful, innovative, forward thinking and committed. At Live Nation Entertainment, our people embrace these qualities, so if this sounds like you then please read on!<br/><br/><strong>THE JOB<br/><br/></strong>Hollywood Palladium is seeking an Overnight Supervisor. This person will monitor the venue premises to prevent theft/infractions of rules.<br/><br/><strong>What This Role Will Do<br/><br/></strong><ul><li>Oversee the overnight cleaning crew.</li><li>Reset the venue for the following event.</li><li>Ensure the venue is secure at the end of the shift.</li><li>Some light laundry assistance.</li><li>Must be able to lift up to 35lbs.</li><li>Must be able to be on a ladder 6 to 10 ft. high.</li><li>Take notes of any damage to the venue (must have good attention to detail).</li><li>Communicate with the operations team.</li><li>Assist with keeping the venue safe, clean and presentable to the guest.</li><li>Resolve guest complaints or problems.</li><li>Provide assistance to with guests with special needs, such as helping with seat accommodations.</li><li>Guide guests to exits or provide other instructions or assistance in case of emergency.</li><li>May assist in verifying staff credentials to generally restricted areas.</li><li>Assist patrons by giving directions places inside or outside the venue.</li><li>Ensure guests are safely enjoying the show.</li><li>Additional tasks as requested by management.<br/><br/></li></ul><strong>What You’ll Bring<br/><br/></strong><ul><li>High School Diploma or equivalent preferred</li><li>At least 1+ year in a guest service role preferred</li><li>Excellent verbal, written and interpersonal communication skills</li><li>Acute sense of judgment, tact and diplomacy</li><li>Position requires constant walking, climbing stairs and occasional sitting, lifting and carrying 35 lbs.+<br/><br/></li></ul><strong>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/></strong>We are passionate and committed to our people and go beyond the rhetoric of diversity and inclusion.  You will be working in an inclusive environment and be encouraged to bring your whole self to work.  We will do all that we can to help you successfully balance your work and homelife.  As a growing business we will encourage you to develop your professional and personal aspirations, enjoy new experiences, and learn from the talented people you will be working with.  It’s talent that matters to us and we encourage applications from people irrespective of their gender, race, sexual orientation, religion, age, disability status or caring responsibilities.<br/><br/>Live Nation strongly supports equal employment opportunity for all applicants regardless of age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), family and medical care leave or the denial of family and medical care leave, mental or physical disability (including HIV and AIDS), marital status, domestic partner status, medical condition (including cancer and genetic characteristics), genetic information, military and veteran status, political affiliation, national origin (including language use restrictions), citizenship, race, sex (including pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, and gender expression, sexual orientation, or any other basis protected by applicable federal, state or local law, rule, ordinance or regulation.<br/><br/>We will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance, San Francisco Fair Chance Ordinance and the California Fair Chance Act and consistent with other similar and / or applicable laws in other areas.<br/><br/>We also afford equal employment opportunities to qualified individuals with a disability. For this reason, Live Nation will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant consistent with its legal obligations to do so, including reasonable accommodations related to pregnancy in accordance with applicable local, state and / or federal law. As part of its commitment to make reasonable accommodations, Live Nation also wishes to participate in a timely, good faith, interactive process with a disabled applicant to determine effective reasonable accommodations, if any, which can be made in response to a request for accommodations. Applicants are invited to identify reasonable accommodations that can be made to assist them to perform the essential functions of the position they seek. Any applicant who requires an accommodation in order to perform the essential functions of the job should contact a Human Resources Representative to request the opportunity to participate in a timely interactive process. Live Nation will also provide reasonable religious accommodations on a case by case basis.<br/><br/><strong>HIRING PRACTICES<br/><br/></strong>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>Live Nation recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, internet recruiting, job fairs, college recruiting and search firms.<br/><br/>The expected compensation for this position in California is:<br/><br/>$20.00 USD - $25.00 Hourly<br/><br/><ul><li>Please note that the compensation information provided is a good faith estimate for this position only and is provided pursuant to the California Salary Transparency in Job Advertisements Law. It is estimated based on what a successful California applicant might be paid. It assumes that the successful candidate will be in California or perform the position from California. Similar positions located outside of California will not necessarily receive the same compensation. Live Nation takes into consideration a candidate’s education, training, and experience, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the California Law, a potential new employee’s salary history will not be used in compensation decisions.</li></ul>", "responsibilities": "What This Role Will Do<br/><br/>\n<ul>\n<li>Oversee the overnight cleaning crew.</li>\n<li>Reset the venue for the following event.</li>\n<li>Ensure the venue is secure at the end of the shift.</li>\n<li>Some light laundry assistance.</li>\n<li>Must be able to lift up to 35lbs.</li>\n<li>Must be able to be on a ladder 6 to 10 ft. high.</li>\n<li>Take notes of any damage to the venue (must have good attention to detail).</li>\n<li>Communicate with the operations team.</li>\n<li>Assist with keeping the venue safe, clean and presentable to the guest.</li>\n<li>Resolve guest complaints or problems.</li>\n<li>Provide assistance to with guests with special needs, such as helping with seat accommodations.</li>\n<li>Guide guests to exits or provide other instructions or assistance in case of emergency.</li>\n<li>May assist in verifying staff credentials to generally restricted areas.</li>\n<li>Assist patrons by giving directions places inside or outside the venue.</li>\n<li>Ensure guests are safely enjoying the show.</li>\n<li>Additional tasks as requested by management.<br/><br/></li>\n</ul>", "qualifications": {"required": "High School Diploma or equivalent preferred\nAt least 1+ year in a guest service role preferred\nExcellent verbal, written and interpersonal communication skills\nAcute sense of judgment, tact and diplomacy\nPosition requires constant walking, climbing stairs and occasional sitting, lifting and carrying 35 lbs.+", "preferred": ""}, "skills": ["Guest Service", "Communication", "Attention to Detail"], "postedDate": "6 days ago", "applicationDeadline": "", "benefits": "Free concert tickets, dog-friendly offices, student loan reimbursement, adoption/fertility support", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3708152346"}