{"jobTitle": "Account Executive", "company": {"name": "Crexi", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": ["Real Estate", "Technology", "Information and Internet", "Leasing Non-residential Real Estate"], "description": "<strong>About Crexi<br/><br/></strong>Crexi is reimagining commercial real estate, building industry-leading software for professionals to more effectively market, analyze, and trade commercial property. With a suite of due diligence tools, transaction services, deal pipeline support, and a dynamic listing marketplace, Crexi accelerates deal efficiency and has empowered millions of monthly users to close more than $615 billion in deals and market over $7 trillion in property value.<br/><br/><strong>About This Role:<br/><br/></strong>We are hiring on our Account Executive Pro team! We are expanding our team of high-achievers who are excited about the opportunity to speak with commercial real estate brokers and help position the Crexi platform as the best solution for their business. You will be joining a fast paced, entrepreneurial environment, where you will be able to successfully hone your closing ability and are encouraged to develop and implement new sales strategies.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li> Manage and oversee strategic and significant clients </li><li>Convert existing and new customers to the paid version of the platform</li><li>Provide comprehensive and effective product demonstrations to potential customers</li><li>Meet and further engage with current and prospective customers</li><li>Attend industry events and conferences and act as a brand ambassador for Crexi</li><li>Provide customer feedback to product team on opportunities to improve Crexi's offering</li><li>Provide leadership and mentorship to junior team members<br/><br/><br/></li></ul><strong>Who You Are<br/><br/></strong><ul><li> 3+ years sales experience, commercial real estate experience preferred </li><li> Proven closer with a track record of success - we want to see your stats </li><li>Hard working, motivated and hungry to succeed - an entrepreneurial mindset is a must</li><li>Comfortable with outbound calling to prospects and clients</li><li>Team player with the ability to contribute to a fast-paced, collaborative environment</li><li>Strong communication and interpersonal skills both on the phone and in-person</li><li>Learn fast and educate even faster - we love new ideas</li><li>Bachelor’s degree or equivalent experience in a sales organization<br/><br/><br/></li></ul><strong>Why Crexi? <br/><br/></strong><ul><li>Rapidly growing startup with a dynamic work environment</li><li>Flexible team structure with the ability to progress in career</li><li>Health, Dental, and Vision insurance</li><li>Collaborative culture and numerous team activities<br/><br/><br/></li></ul>The anticipated base salary range for candidates who will work in Playa Vista, California location is $75,000 to $85,000. The final salary offered to a successful candidate will depend on several factors, which may include, but are not limited to, the type and length of experience applicable to the role and within the industry, education, geographic location, etc. Commercial Real Estate Exchange, Inc (“Crexi”) is a multi-state employer, and this salary range may not reflect positions that work in other states.<br/><br/>Crexi is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Crexi will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.", "responsibilities": "Manage and oversee strategic and significant clients Convert existing and new customers to the paid version of the platform Provide comprehensive and effective product demonstrations to potential customers Meet and further engage with current and prospective customers Attend industry events and conferences and act as a brand ambassador for Crexi Provide customer feedback to product team on opportunities to improve Crexi's offering Provide leadership and mentorship to junior team members", "qualifications": {"required": "3+ years sales experience, commercial real estate experience preferred Proven closer with a track record of success - we want to see your stats Hard working, motivated and hungry to succeed - an entrepreneurial mindset is a must Comfortable with outbound calling to prospects and clients Team player with the ability to contribute to a fast-paced, collaborative environment Strong communication and interpersonal skills both on the phone and in-person Learn fast and educate even faster - we love new ideas Bachelor’s degree or equivalent experience in a sales organization", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Health, Dental, and Vision insurance Collaborative culture and numerous team activities", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3711771753"}