{"jobTitle": "Customer Service Representative", "company": {"name": "LHH", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "description": "LHH is currently seeking a Customer Service Representative with 2 or more years of experience for a full-time job at an exciting technology company in West Los Angeles, CA. This is a contract-to-hire role that offers the opportunity to work with a growing and dynamic organization within the technology sector.<br/><br/>This role entails providing complete customer service support to external clients and customers while adhering to company processes and policies. Our ideal candidate has the ability to stay organized in a fast-paced environment and communicate clearly as they will play a major part in the success of the office. If you are looking for a new and exciting place to work – apply online today!<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Receiving a high volume of incoming phone calls</li><li>Assisting with processing orders, preparing correspondence, and fulfilling customer needs to ensure customer satisfaction. </li><li>Interacting with customers to provide information in response to inquiries about accounts, products, and services. </li><li>Making outbound phone calls</li><li>Perform other tasks and functions as assigned to provide support to other team members and internal departments<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Experience working within a customer service or call center environment preferred</li><li>High school diploma</li><li>Ability to work independently and as part of a team</li><li>Personable, proactive, and able to work in a fast-paced environment<br/><br/></li></ul><strong>Skills:<br/><br/></strong><ul><li>Strong attention to detail</li><li>Ability to effectively multitask</li><li>Proficient with Microsoft Office Suite - mainly Word, Excel and Outlook<br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>2 – 4 years of recent Customer Service experience<br/><br/></li></ul><strong>Work Hours:<br/><br/></strong>8:00am – 5:00pm, 40 hours per week<br/><br/>To learn more about this administrative job opening, please apply and send a current resume. Not quite what you were looking for? Browse our other available jobs in your location on the LHH website.<br/><br/><strong>Pursuant to the Los Angeles Fair Chance Initiative for Hiring, we will consider for employment qualified applicants with arrest and conviction records.<br/><br/></strong>Equal Opportunity Employer/Veterans/Disabled<br/><br/><strong>Pay Details:</strong> $19.00 to $23.00 per hour<br/><br/><strong>Search managed by:</strong> Tyler Panos<br/><br/>Benefit offerings available for our associates include medical, dental, vision, life insurance, short-term disability, additional voluntary benefits, EAP program, commuter benefits and a 401K plan. Our benefit offerings provide employees the flexibility to choose the type of coverage that meets their individual needs. In addition, our associates may be eligible for paid leave including Paid Sick Leave or any other paid leave required by Federal, State, or local law, as well as Holiday pay where applicable.<br/><br/>Equal Opportunity Employer/Veterans/Disabled<br/><br/>To read our Candidate Privacy Information Statement, which explains how we will use your information, please navigate to https://www.lhh.com/us/en/candidate-privacy<br/><br/>The Company will consider qualified applicants with arrest and conviction records subject to federal contractor requirements and/or security clearance requirements.", "jobFunction": "Other", "industry": "Human Resources Services", "salary": {"amount": "19.00/hr - 23.00/hr", "currency": "USD"}, "skills": ["Microsoft Office", "Word", "Excel", "Outlook", "Customer Service", "Call Center"], "postedDate": "1 year ago", "benefits": "Benefit offerings available for our associates include medical, dental, vision, life insurance, short-term disability, additional voluntary benefits, EAP program, commuter benefits and a 401K plan. Our benefit offerings provide employees the flexibility to choose the type of coverage that meets their individual needs. In addition, our associates may be eligible for paid leave including Paid Sick Leave or any other paid leave required by Federal, State, or local law, as well as Holiday pay where applicable.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3713379219"}