{"jobTitle": "Vans Store Manager (Los Angeles, CA Area)", "company": {"name": "Vans", "location": "Cerritos, CA"}, "location": "Cerritos, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "27.00/hr - 42.78/hr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Retail Apparel and Fashion", "description": "Are you a passionate retail leader that is looking for a company dedicated to your personal development, continuing your growth into a leader of tomorrow, and being empowered to reach your greatest potential? If yes, then apply to be a Store Manager with Vans! We are hiring for several locations around the Los Angeles area and would love to hear from you. <br/><br/><strong>Store Manager <br/><br/></strong>As the Store Manager, you inspire, motivate, lead, and develop a store team. You champion business strategies, vision, and values. Additionally, you impact the overall bottom line by maintaining optimal staffing levels, recruiting, hiring, educating, and motivating a team. You are responsible for setting the example for customer engagement that exceeds industry standards. You maximize store profitability by controlling expenses, protecting company assets, and by ensuring that store standards and processes for merchandising, operations, and community participation are well executed. You create an inclusive environment and always put our internal and external customers first.<br/><br/><strong>Join the Vans Family <br/><br/></strong>Vans® is the original action sports footwear company, rooted in authenticity and creativity. Founded in 1966, we have thrived on a legacy of impacting our greater community through four pillars: action sports, music, art and street culture. We are constantly inspired by the creative voyagers within our company and community. For them, creativity is about the journey, not just the output. Our mission is to empower everyone to use creativity to discover themselves. Our vision is to create a world where anyone can be their unique self.<br/><br/>At Vans, our culture sets us apart and influences everything we do. We are driven by our five values: We have HEART – also referred to as the “Van Doren Spirit”. We are relentlessly CURIOUS about our consumers and the world around us. We are UNAPOLOGETICALLY AUTHENTIC and wholeheartedly believe the most “Off the Wall” thing you can do is be yourself. We are driven by a spirit of INGENUITY. And we are passionate about local COMMUNITIES. And most of all, we are a family that has fun together.<br/><br/>At Vans we empower creative exploration and inspire youth culture through a commitment to inclusivity. We welcome anyone and everyone into our global family and proudly celebrate and environment where individuality is embraced, equal opportunities thrive, and everyone is empowered to reach their greatest potential.<br/><br/><strong>How You Will Make a Difference<br/><br/></strong><strong>What you will do:<br/><br/></strong><ul><li>You will strategically lead the team in maximizing and achieving store sales goals and monitor sales progress &amp; results against key targets. </li><li>Model and foster a consumer centric mindset within the store, and model selling behaviors through genuine interactions with consumers for the teams to emulate. </li><li>Attract, recruit and hire high caliber, diverse talent, and maintain a strong succession plan within your store. </li><li>Provide direct coaching, feedback, training and supervision of the associates. </li><li>Demonstrate clear communication, training and coaching the team, set expectations for customer engagement, store policies and procedures as well as hiring and building a strong team. </li><li> Manage expenses to maximize sales and profitability, lead an environment of productivity by ensuring the team has the knowledge and skills to meet store goals for sales and customer engagement. <br/><br/></li></ul><strong>Skills For Success<br/><br/></strong><strong>What you bring:<br/><br/></strong><ul><li>3-5+ years of related professional/retail management experience </li><li>Ability to work a flexible schedule to meet the needs of the business; will require weekends, evenings, and holidays </li><li>Ability to meet business goals by driving results through store teams </li><li>Ability to coach and motivate a team to excel at sales &amp; profit results </li><li>Proven communication skills </li><li>Ability to be solution oriented and flexible in a fast-paced environment </li><li>A formal education and subsequent undergraduate/graduate degrees are nice to have, but we are most interested in your total experience and professional achievements. <br/><br/></li></ul><strong>Free To Be, Inclusion &amp; Diversity<br/><br/></strong>As a purpose-led, performance driven company, we strive to foster a culture of belonging based on respect, connection, openness and authenticity. We are committed to building and maintaining a workplace that celebrates the diversity of our associates, allowing them to bring their authentic selves to work every day.<br/><br/><strong>What’s In It For You<br/><br/></strong>We’re in the business of unleashing human potential, driven by the ideas, energy and commitment of our people. That’s why we offer comprehensive benefits that encourage mental, physical and financial well-being for all VF associates. When it comes to benefits, we’re the total package. Go to MyVFBenefits.com and click on “Looking to Join VF?” to learn more.<br/><br/><strong>Our Parent Company, VF Corporation<br/><br/></strong>VF is one of the world’s largest apparel, footwear and accessories companies connecting people to the lifestyles, activities and experiences they cherish through our family of iconic outdoor, active and workwear brands. At the heart of our journey lies our company-wide purpose: We power movements of sustainable and active lifestyles for the betterment of people and our planet. This is our purpose. It’s the reason we come to work every day. It’s a commitment shared by our global associates across all brands. Our purpose unites us and leads us to pursue our goals, together. This is our calling. Learn more at vfc.com<br/><br/><strong>We just have one question. Are you in?<br/><br/></strong><strong>Hiring Range:<br/><br/></strong>$28.52 USD - $42.78 USD per hour<br/><br/><strong>Minimum Start Rate:<br/><br/></strong>$28.52<br/><br/><strong>Incentive Potential</strong>: This position is eligible for additional compensation awards that may include an annual incentive plan, sales incentive, or commission potential. Specific details of the additional compensation eligibility for this position will be provided during the recruiting and interview process.<br/><br/><strong>Benefits at VF Corporation</strong>: You can review a general overview of each benefit program offered, including this year's medical plan rates on www.MyVFbenefits.com and by clicking <strong>Looking to Join VF?</strong> Detailed information on your benefits will be provided during the hiring process.<br/><br/><strong><em>Please note, our hiring ranges are determined and built from market pay data. Although all positions have a hiring range based upon market data, this position has a minimum starting rate that is listed above. In determining the specific compensation for this position, we comply with all local, state, and federal laws. <br/><br/></em></strong><em>At VF, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individual’s race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at peopleservices@vfc.com. VF will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.<br/><br/></em><em>Pursuant to all applicable local Fair Chance Ordinance requirements, including but not limited to the San Francisco Fair Chance Ordinance, VF will consider for employment qualified applicants with arrest and conviction records.</em>", "responsibilities": "As the Store Manager, you inspire, motivate, lead, and develop a store team. You champion business strategies, vision, and values. Additionally, you impact the overall bottom line by maintaining optimal staffing levels, recruiting, hiring, educating, and motivating a team. You are responsible for setting the example for customer engagement that exceeds industry standards. You maximize store profitability by controlling expenses, protecting company assets, and by ensuring that store standards and processes for merchandising, operations, and community participation are well executed. You create an inclusive environment and always put our internal and external customers first.", "qualifications": {"required": "3-5+ years of related professional/retail management experience, Ability to work a flexible schedule to meet the needs of the business; will require weekends, evenings, and holidays, Ability to meet business goals by driving results through store teams, Ability to coach and motivate a team to excel at sales &amp; profit results, Proven communication skills, Ability to be solution oriented and flexible in a fast-paced environment", "preferred": "A formal education and subsequent undergraduate/graduate degrees are nice to have, but we are most interested in your total experience and professional achievements."}, "skills": ["Retail Management", "Sales", "Customer Service", "Team Leadership", "Communication", "Problem Solving"], "postedDate": "2 weeks ago", "benefits": "We’re in the business of unleashing human potential, driven by the ideas, energy and commitment of our people. That’s why we offer comprehensive benefits that encourage mental, physical and financial well-being for all VF associates. When it comes to benefits, we’re the total package. Go to MyVFBenefits.com and click on “Looking to Join VF?” to learn more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3720906803"}