{"jobTitle": "Regional HR Director", "company": {"name": "Betenu Health", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "description": "A vibrant and growing skilled nursing organization is currently seeking a dynamic, forward-thinking, and experienced Regional Human Resources Director. The Director will be responsible for overseeing all HR functions, ensuring compliance with regulations, and implementing strategies to attract and retain top talent. This role plays a critical part in shaping our company's culture and driving employee engagement.", "responsibilities": "Duties:\n - Develop and implement HR strategies aligned with the company's objectives \n - Communicate with the Administrators on employee relations, performance, workman’s compensation, and leave of      absence\n - Discuss workman’s compensation insurance on mitigating claims\n - Oversee employee orientation programs and ensure effective onboarding processes\n - Utilize HR systems for data management\n - Drive succession planning initiatives to identify and develop future leaders \n - Collaborate with department heads to support organizational goals\n - Ensure compliance with employment laws and regulations", "qualifications": {"required": "Bachelor's degree in human resources or a related field\n - HR certification, PHR, SPHR or SHRM CP or SCP required\n - 5 years of Human Resource experience working as an HR Director or as a Regional HR            Director in a skilled nursing environment or a health-related field\n - 3 years of management experience working as an HR Director\n - Extensive HR experience including all phases of the employment process with up-to-date   knowledge of State and Federal employment processes, wages, and hour laws\n - Experience with the following skillset: compensation, benefits, HR policy, and hiring\n - Strong HR background managing the hiring process, new hire orientation, reference and background checks\n - Experience managing benefit enrollments for employees, maintaining records of insurance coverage, and process monthly invoices to balance with company employee-paid premiums", "preferred": "Bilingual Spanish preferred"}, "skills": ["HR", "Employee Relations", "Succession Planning", "Talent Development", "Performance Management", "Compliance", "Employment Law", "Union Experience", "SEIU"], "postedDate": "2 weeks ago", "benefits": "Comprehensive medical, dental and vision programs\n - PTO, holidays, and sick leave\n - 2 week’s vacation time\n - Life Insurance\n - Supplemental program (Aflac)\n - Competitive salary range", "url": "https://www.linkedin.com/jobs/view/3721955080"}