{"jobTitle": "Sales Development Representative", "company": {"name": "Crexi", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Real Estate and Technology, Information and Internet", "description": "<strong><strong>About Crexi<br/><br/></strong></strong>Crexi is reimagining commercial real estate, building industry-leading software for professionals to more effectively market, analyze, and trade commercial property. With a suite of due diligence tools, transaction services, deal pipeline support, and a dynamic listing marketplace, Crexi accelerates deal efficiency and has empowered millions of monthly users to close more than $615 billion in deals and market over $7 trillion in property value.<br/><br/><strong><strong>About Crexi<br/><br/></strong></strong>We are the commercial real estate industry’s fastest-growing marketplace, data, and technology platform dedicated to supporting the CRE industry and its stakeholders. We enable commercial real estate professionals to quickly streamline, manage, and grow their businesses using the industry’s most advanced technology. Since launching in 2015, we have quickly become the fastest-growing CRE marketplace and most advanced platform in the industry. Crexi has helped buyers, sellers, and brokers transact business on over 300,000 commercial listings totaling more than $1 Trillion in property value.<br/><br/><strong><strong>About This Role<br/><br/></strong></strong>We are hiring for our Sales Development team to help us grow! We are expanding our group of high achievers who are excited about the opportunity to speak with commercial real estate brokers and help position the Crexi platform as the best solution for their business. The Sales Development Role is responsible for acquiring new customers and further developing relationships with existing customers in their market.<br/><br/>Applicants should be curious, coachable, adaptable, positive, goal-oriented, creative and possess the ability to think outside of the box, passionate, active listeners, resilient, articulate, and able to communicate concisely, competitive (mostly against themselves), and hard working.<br/><br/><strong><strong>What You’ll Do<br/><br/></strong></strong><ul><li>Prospect and find potential clients that meet the ICP within the market</li><li>Qualify leads as sales opportunities</li><li>Nurture the initial stages of a sales process</li><li>Contact potential clients through cold calls and emails to present the Crexi solution</li><li>Schedule meetings or calls between potential clients and Account Executives</li><li>Utilize technologies such as Salesforce.com, Outreach, Zoom, RingCentral, Jira, and more<br/><br/><br/></li></ul><strong><strong>Who You Are<br/><br/></strong></strong><ul><li>Positive and team-centric attitude</li><li>Strong work ethic</li><li>Exceptional communication skills</li><li>Ability to enjoy the grind</li><li>Willingness to receive constructive-criticism and improve</li><li>Ability to develop and explore fullest potential – you will be expected to grow</li><li>Ability to meet and exceed established KPI’s (calls, emails, etc.)</li><li>Commercial Real Estate background or work-experience (preferred, not required)<br/><br/><br/></li></ul>The anticipated base salary range for candidates who will work in our Playa Vista, California location is $60,000 to $75,000. The final salary offered to a successful candidate will depend on several factors, which may include, but are not limited to, the type and length of experience applicable to the role and within the industry within the industry, education, geographic location, etc. Commercial Real Estate Exchange, Inc (\" Crexi \") is a multi-state employer, and this salary range may not reflect positions that work in other states.<br/><br/>Crexi is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Crexi will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.", "responsibilities": "<ul><li>Prospect and find potential clients that meet the ICP within the market</li><li>Qualify leads as sales opportunities</li><li>Nurture the initial stages of a sales process</li><li>Contact potential clients through cold calls and emails to present the Crexi solution</li><li>Schedule meetings or calls between potential clients and Account Executives</li><li>Utilize technologies such as Salesforce.com, Outreach, Zoom, RingCentral, Jira, and more<br/><br/><br/></li></ul>", "qualifications": {"preferred": "Commercial Real Estate background or work-experience", "required": "Positive and team-centric attitude, Strong work ethic, Exceptional communication skills, Ability to enjoy the grind, Willingness to receive constructive-criticism and improve, Ability to develop and explore fullest potential – you will be expected to grow, Ability to meet and exceed established KPI’s (calls, emails, etc.)"}, "skills": ["Salesforce.com", "Outreach", "Zoom", "RingCentral", "Jira"], "postedDate": "2 weeks ago", "benefits": "The anticipated base salary range for candidates who will work in our Playa Vista, California location is $60,000 to $75,000. The final salary offered to a successful candidate will depend on several factors, which may include, but are not limited to, the type and length of experience applicable to the role and within the industry within the industry, education, geographic location, etc. Commercial Real Estate Exchange, Inc (\" Crexi \") is a multi-state employer, and this salary range may not reflect positions that work in other states.<br/><br/>Crexi is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Crexi will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3722398231"}