{"jobTitle": "Supervisor de turno", "company": {"name": "AutoZone", "industry": "Retail", "size": "Large", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$18.15 - $18.70", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Los supervisores de turno asisten a los gerentes de la tienda con iniciativas de liderazgo, asegurando máxima productividad, entrenando AutoZoners de alto rendimiento en un espacio de trabajo seguro, impulsando las ventas, controlando y economizando los gastos, y obedeciendo los procedimientos de la compañía en concordancia con las expectativas de AutoZone. Los supervisores de turno exceden las expectativas de los clientes al ofrecer una experiencia de compra WOW! en turnos asignados viviendo la promesa todos los días.", "responsibilities": "Asiste al Gerente de la tienda supervisando, entrenando y desarrollando personal para la tienda. Asume la responsabilidad en turnos asignados de las operaciones de la tienda y del departamento comercial en la ausencia del Gerente de Ventas Comerciales y del Gerente de la tienda. Asiste con la administración de los departamentos de HUB y comerciales, (según aplique), para asegurar que las cuentas comerciales y las tiendas sean atendidas y las entregas sean cumplidas como como fue prometido. Delega y se asegura que las tareas concernientes a la mercancía de la tienda sean completadas en un lapso de tiempo aceptable. Opera las cajas registradoras y sigue obligaciones establecidas en manejo de efectivo, incluyendo, pero no limitado a, depósitos, dinero para gastos menores y responsabilidad de línea. Se asegura que todas las políticas de la compañía y los procedimientos de prevención de perdidas sean seguidos. Utiliza ZNET para ayudar a los clientes a localizar mercancía o encontrar alternativas adecuadas. Mantiene un ambiente de trabajo seguro mientras se asegura de que los AutoZoners implementen esas prácticas incluyendo equipo de protección personal (PPE). Monitorea el flujo de efectivo, inventario y control de seguridad. Mantiene la productividad en las ventas, la apariencia de la tienda y los estándares de comercialización. Conduce y revisa todos los procedimientos de apertura y cierre. Maneja las situaciones de emergencia y conduce procedimientos de emergencia propios. Sigue procedimientos apropiados contra accidentes. Provee retroalimentación respecto al rendimiento del AutoZoner al Gerente de la tienda. Asiste con el monitoreo y administración de todas las actividades relacionadas con la gestión de riesgo y seguridad para mantener un espacio de trabajo seguro. Aborda las preocupaciones y las resuelve con la meta de cambiar una queja en un cumplido. Procesa las devoluciones y efectivamente administra el inventario. Comunica los problemas y preocupaciones de los AutoZoners al Gerente de la tienda en lapso de tiempo aceptable y manteniendo la confidencialidad en todo momento. Motiva a los AutoZoners a proveer un servicio WOW! al cliente, aumenta el nivel de productividad y los productos del mercado para mejorar las ventas y ganancias.", "qualifications": {"required": "Preparatoria o equivalente. Certificación ASE preferido. Demuestra un alto nivel de integridad. Excelentes habilidades de comunicación y toma de decisiones. Habilidad para manejar el servicio al cliente.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "AutoZone se preocupa por la gente. Es por eso que AutoZone ofrece un programa de beneficios bien pensado con programas de guía de beneficios uno a uno diseñado para mejorar el bienestar físico, mental y financiero de los AutoZoners. Algunos De Los Beneficios Incluye: Paga y Tiempo Libre Pagado Competitivo, Cultura empresarial inigualable, Opciones de Seguro Médico, Dental, Visión, Vida, y de Incapacidad a Corto y Largo Plazo, Cuenta de Ahorro de Salud y Gastos Flexibles con recompensas de bienestar, Descuentos y Beneficios Exclusivos, incluyendo descuento en Tienda AutoZone, Plan de Ahorro 401(k) con pareo de la Compañía y Plan de Compra de Acciones, Programa de Bienestar para AutoZoners para salud mental y física, Oportunidades de crecimiento profesional y reembolso de matrícula.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3727832401"}