{"jobTitle": "Scheduler", "company": {"name": "Transdev North America", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full Time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Truck Transportation", "description": "Hourly pay rate: $19.51<br/><br/>Major Responsibilities<br/><br/><ul><li>Ensures that routes are established as efficiently as possible.</li><li>Maintains the routes for accuracy and efficiency.</li><li>May work with software programs to establish routes for drivers. </li><li>Verifies accuracy of driver’s route times and stop times on the actual routes are correct. </li><li>Demonstrates and promotes a safe environment at all times.</li><li>Assists the Contract Manager in establishing standard hours accuracy report.</li><li>May maintain on a spreadsheet driver miles and amount of time for drivers for billing preparation.</li><li>Performs all other duties as assigned.<br/><br/></li></ul><strong>Minimum Education &amp; Certifications Required<br/><br/></strong><ul><li>High School Diploma or equivalent required<br/><br/></li></ul>About Transdev:<br/><br/>Transdev is the largest private sector operator of multiple modes of passenger transit in North America, providing bus, rail, paratransit and shuttle services. We manage over 200 transportation contracts for cities, transit authorities and airports, providing safe, sustainable, and innovative mobility solutions. Our mission is to improve public transportation, to enhance quality of life and contribute to a more sustainable environment.<br/><br/>For more information please visit our website at www.transdevna.jobs<br/><br/>The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified.Transdev is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, national origin, age, disability, veteran status, genetic data, gender identity, sexual orientation, religion or other legally protected status or any other classification protected by federal, state, or local law.<br/><br/>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions upon request.<br/><br/>Transdev is the largest private sector operator of multiple modes of passenger transit in North America, providing bus, rail, paratransit and shuttle services. We manage over 200 transportation contracts for cities, transit authorities and airports, providing safe, sustainable, and innovative mobility solutions. Our mission is to improve public transportation, to enhance quality of life and contribute to a more sustainable environment.<br/><br/>About Transdev:<br/><br/>Based near Chicago, Transdev is the largest private-sector operator of multiple modes of transit in North America, including bus, rail, streetcar, paratransit, and shuttle services. Transdev is committed to being the trusted partner of cities and transit authorities through quality execution and innovations in mobility. Its parent company, Transdev Group, is a leading global operator and integrator of mobility operating in 17 countries and provides passengers every day the freedom to connect to what they care about in their cities.<br/><br/>Job Category: Call Center / Dispatch / Reservationist / Scheduler<br/><br/>Job Type: Full Time<br/><br/>Req ID: 507<br/><br/>Pay Group: UD5<br/><br/>Cost Center: 55373<br/><br/>The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified.<br/><br/>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions upon request.<br/><br/>Transdev is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, national origin, age, disability, veteran status, genetic data, gender identity, sexual orientation, religion or other legally protected status, or any other classification protected by federal, state, or local law.<br/><br/>Drug-free workplace<br/><br/>If based in the United States, applicants must be eligible to work in U.S. without restrictions for any employer at any time; be able to pass a drug screen and background check.<br/><br/>California applicants: Please Click Here for CA Employee Privacy Policy.<br/><br/><strong>About Transdev<br/><br/></strong>Cities, counties, airports, companies, and universities across the U.S. contract with Transdev to operate their transportation systems, maintain their vehicle and fleets, and deliver on mobility solutions. Transdev U.S. employs a team of 32,000 across 400 locations while maintaining more than 17,000 vehicles.<br/><br/>Part of a global company, Transdev is a leader in mobility with operations in 19 countries, proudly operated by 110,000 team members from around the world. As an operator and global integrator of mobility, we are driven by our purpose. Transdev – the mobility company – empowers the freedom to move every day thank to safe, reliable, and innovative solutions that serve the common good. Find out more at http://www.TransdevNA.com or watch an overview video.", "postedDate": "10 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3729907173"}