{"jobTitle": "Fiverr Expert", "company": {"name": "Fud, Inc.", "industry": "Non-profit Organizations and Primary and Secondary Education", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "General Business", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Fud is on a mission to empower people to earn a living on their own terms. As the world's first social hustling community, Fud provides the know-how people need to take action and put more money in their pockets. We are seeking a talented Fiverr Expert to join our community. As a Fiverr Expert, you will work closely with our community to create, implement, and maintain various online projects related to freelancing and independent work. Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers & thrifters, entrepreneurs, solopreneurs, and small business owners. You can experience our community for yourself by downloading our free to use app.", "responsibilities": "Provide one-on-one and group mentoring to side hustlers, Help side hustlers develop their side hustle ideas, Set goals and track progress with side hustlers, Provide support and motivation to side hustlers, Share knowledge and resources with side hustlers, Stay up-to-date on the latest trends in side hustles, Build relationships with side hustlers and other mentors, A willingness to share know-how through video, livestreaming, and text content, Passion for innovation and entrepreneurship.", "qualifications": {"required": "Proven experience as a freelancer or Fiverr seller with a strong portfolio of successful projects. Excellent communication skills, both verbal and written. You are aware of the trends in future of work, personal finance, and entrepreneurship. Ability to work independently and manage your time effectively. High level of initiative and positive approach. Strong communication skills. Comfortable with using social media and other digital tools. A willingness to share know-how through video, livestreaming, and text content. Passion for innovation and entrepreneurship.", "preferred": "Not specified"}, "skills": ["Excellent communication skills", "Ability to work independently", "Strong portfolio of successful projects", "Knowledge of trends in future of work", "Comfortable with using social media and digital tools"], "postedDate": "10 months ago", "applicationDeadline": "Not specified", "benefits": "Be your own boss, Learn how to make money from your passion and interests, Find a community of like-minded hard-working solopreneurs and entrepreneurs, Choose your own schedule and work when you want.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3734626591"}