{"jobTitle": "Insomniac - Production Purchasing Manager", "company": {"name": "Live Nation Entertainment", "location": "Calabasas, CA"}, "location": "Calabasas, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Entertainment Providers", "description": "Job Summary:<br/><br/>WHO ARE YOU?<br/><br/>Do you enjoy music festivals? Are you passionate about the procurement space? Then you’re in luck! We are looking for a highly motivated self-starter who embodies both a passion for music culture and a strong analytical background. Sounds like you? Then keep reading...<br/><br/>WHO ARE WE?<br/><br/>Insomniac produces some of the most innovative, immersive music festivals and events in the world. Enhanced by state-of-the-art lighting, pyrotechnics and sound design, large-scale art installations, theatrical performers and next generation special effects, our events captivate the senses and inspire a unique level of fan interaction. The quality of the Headliner experience is our top priority.<br/><br/>Insomniac produces 10,000 concerts, club nights and festivals for seven million attendees annually across the globe. Since its inception, Insomniac's events have taken place in 13 countries across five continents. The company's premiere annual event, Electric Daisy Carnival Las Vegas, is the world’s largest dance music festival and attracts more than 525,000 fans over three days. The company was founded by Pasquale Rotella and has been based in Los Angeles since it was formed in 1993.<br/><br/>THE ROLE<br/><br/>The Production Purchasing Manager will be responsible for supporting Production Operations with purchase requests from key departmental stakeholders, soliciting price quotes from vendors, creating purchase orders, managing goods receipts, and reconciling outstanding purchase transactions. You will work in an office setting but will at times need to fulfill travel requirements and work on site.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Partner with Production Operations staff to understand business needs and purchase appropriately</li><li>Convert vendor price quotes into Purchase Orders</li><li>Raise timely and accurate Purchase Orders for time-sensitive Production needs</li><li>Goods Receipt Purchase Orders, ensuring timely financial recognition</li><li>Reconcile outstanding purchase transactions for timely resolution</li><li>Research, analyze and determine spend data to identify cost saving opportunities, with an emphasis on production and operations spend</li><li>Partner with Operations, Finance, Procurement personnel to maintain communication channels across key stakeholder departments to provide efficient and effective purchasing support</li><li>Partner and facilitate effective sourcing methods and track &amp; maintain vendor KPIs to ensure vendor compliance</li><li>Ensure product and service quality remain paramount during all vendor discussions and negotiations</li><li>Ensure timely submission of documents for new vendor setup</li><li>Develop strong vendor relationships, ensuring win-win results</li><li>Special projects and tasks as assigned</li><li>Some travel will be required<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in business or technical field</li><li>Prior media and entertainment production experience preferred</li><li>Familiarity with festival equipment and/or event management is a plus</li><li>Must have previous purchasing or vendor relations experience</li><li>Strong foundation and proven experience in finance and business concepts and applications</li><li>Ability to analyze and support vendor negotiations</li><li>Proven ability to navigate through Excel (i.e., V-look up, pivot table, formula driven, etc.)</li><li>Excellent communication skills</li><li>Proven ability to work in a team environment</li><li>Able to work in a fast-paced environment with competing priorities<br/><br/></li></ul>WORK ENVIRONMENT<br/><br/><ul><li>Must be able to tolerate loud noise levels and busy environments</li><li>Must be willing to travel to work and travel to events during holidays, evening and weekend hours, as required, to meet deadlines and work events<br/><br/></li></ul>Applicants for employment in the U.S. must possess work authorization, which does not require sponsorship by Insomniac for a visa.<br/><br/>The expected compensation for this position in California is:<br/><br/>$70,000 - $85,000 USD<br/><br/><ul><li>Please note that the compensation information provided is a good faith estimate for this position only and is provided pursuant to the California Salary Transparency in Job Advertisements Law. It is estimated based on what a successful California applicant might be paid. It assumes that the successful candidate will be in California or perform the position from California. Similar positions located outside of California will not necessarily receive the same compensation. Live Nation takes into consideration a candidate’s education, training, and experience, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the California Law, a potential new employee’s salary history will not be used in compensation decisions.<br/><br/></li></ul>EQUAL EMPLOYMENT OPPORTUNITY<br/><br/>Insomniac strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law.<br/><br/>HIRING PRACTICES<br/><br/>The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>Insomniac recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Insomniac may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms.<br/><br/>", "responsibilities": "Partner with Production Operations staff to understand business needs and purchase appropriately\nConvert vendor price quotes into Purchase Orders\nRaise timely and accurate Purchase Orders for time-sensitive Production needs\nGoods Receipt Purchase Orders, ensuring timely financial recognition\nReconcile outstanding purchase transactions for timely resolution\nResearch, analyze and determine spend data to identify cost saving opportunities, with an emphasis on production and operations spend\nPartner with Operations, Finance, Procurement personnel to maintain communication channels across key stakeholder departments to provide efficient and effective purchasing support\nPartner and facilitate effective sourcing methods and track & maintain vendor KPIs to ensure vendor compliance\nEnsure product and service quality remain paramount during all vendor discussions and negotiations\nEnsure timely submission of documents for new vendor setup\nDevelop strong vendor relationships, ensuring win-win results\nSpecial projects and tasks as assigned\nSome travel will be required", "qualifications": {"required": "Bachelor’s degree in business or technical field\nPrior media and entertainment production experience preferred\nFamiliarity with festival equipment and/or event management is a plus\nMust have previous purchasing or vendor relations experience\nStrong foundation and proven experience in finance and business concepts and applications\nAbility to analyze and support vendor negotiations\nProven ability to navigate through Excel (i.e., V-look up, pivot table, formula driven, etc.)\nExcellent communication skills\nProven ability to work in a team environment\nAble to work in a fast-paced environment with competing priorities", "preferred": "Must be able to tolerate loud noise levels and busy environments\nMust be willing to travel to work and travel to events during holidays, evening and weekend hours, as required, to meet deadlines and work events"}, "skills": ["Excel", "Vendor Relations", "Purchasing", "Event Management", "Production", "Finance", "Communication", "Teamwork"], "postedDate": "2 weeks ago", "salary": {"amount": "70,000 - 85,000", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3742275555"}