{"jobTitle": "Merchandise Planner", "company": {"name": "Naked Wardrobe", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00/yr - $90,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Retail", "description": "Are you detail-oriented and passionate about fashion? Join the rapidly expanding global womenswear brand, Naked Wardrobe team as a Merchandise Planner In this role, you will utilize in-house inventory data and trend analysis to collaborate with various departments such as design, marketing, wholesale, and inventory. As a Merchandise Planner, you will play a key role in overseeing the lifecycle of garments, from their initial concept to being displayed on shop floors to sell through. If you have a keen eye for detail and a love for all things fashion, this role is for you.", "responsibilities": "•\tCollaborate with the design team to develop and execute merchandising strategies that align with our brand vision.\n•\tAnalyze sales data and market trends to make informed decisions on product selection and pricing.\n•\tOptimize sales by ensuring the right products are in stock with the right quantities to capitalize on trends/demand to meet monthly goals.\n•\tLead, create, and drive assortment strategies. Develop strong relationships with vendors and partners to ensure timely delivery of merchandise.\n•\tMonitor inventory levels and make recommendations for restocking or discontinuing products.\n•\tStay up-to-date on industry trends and competitor activities to identify opportunities for growth.\n•\tWork closely with the marketing team to develop promotional campaigns and events.\n•\tExcellent problem-solving and multitasking skills.\n•\tOther duties as assigned.", "qualifications": {"required": "Bachelor's degree in Fashion Merchandising, Marketing, Business, or related field\n4-6 years of extensive background in merchandise planning with a focus on E-commerce apparel and Wholesale\nStrong understanding of current fashion trends and consumer preferences\nNetSuite and Shopify experience a strong plus\nAdvanced Excel skills and other data analysis tools\nExcellent analytical and organizational skills\nStrategic-thinker with a passion for retail and a knack for numbers\nProficiency in Microsoft Office Suite and knowledge of merchandising software\nStrong communication and interpersonal skills\nDetail-oriented with a knack for numbers and a passion for retail\nAbility to work well under pressure and meet deadlines", "preferred": ""}, "skills": ["Fashion Merchandising", "Marketing", "Business", "E-commerce", "Wholesale", "NetSuite", "Shopify", "Excel", "Data Analysis", "Retail", "Microsoft Office Suite", "Merchandising Software", "Communication", "Interpersonal Skills"], "postedDate": "1 month ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3742224908"}