{"jobTitle": "SUPERINTENDENT", "company": {"name": "JG Companies", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Construction", "description": "JG Companies has been a leader in the construction industry serving a diverse range of construction markets since 1979. Our firm maintains its reputation upon our core values, building a culture that encourages our people to lead from the bottom up.<br/><br/><strong>JG Is Looking For Great People Who<br/><br/></strong><ul><li>Believe in the core values, the culture, and encourage other team members growth and success. </li><li>Takes initiative. Our firm believes in bottom-up management. We rely on our people in all positions to lead, provide input and constructive feedback. </li><li>Enjoy what they do. Be optimistic and bring a positive attitude to our company culture and environment. </li><li>Are committed. Our JG family grows with each other for long haul. Have direction of your long-term goals. <br/><br/></li></ul><strong>Expectations<br/><br/></strong>Strive for growth and excellence together. The success of our firm and satisfaction of our clients, starts with the people our team while the success of the people of our team, starts with teamwork. At JG, we are going far together, not fast alone. Teamwork is the critical element that drives the synergy of our divisions working together.<br/><br/><ul><li>Be the underdog &amp; strive for growth and learning. </li><li>Always act like its day 1. Give your best every day. </li><li>Take pride in where you work and what you do. </li><li>Always take the high road. Do the right thing, even if you have to go against the grain. <br/><br/></li></ul><strong>Job Functions<br/><br/></strong><ul><li>Primary manager of the onsite operations. Required to be onsite at all times when work is being performed.</li><li>Manages and oversees all subcontractors and maintains scheduling and coordination of timelines and onsite performance. </li><li>Manages and maintains accurate daily logs with photos for all activity onsite and tracking of deliverables and all items to be entered in daily logs. Ensuring daily sign in sheets are completed.</li><li>Schedules pre-construction meetings onsite with all vendors and project teams. </li><li>Ensures compliance with job site rules &amp; requirements. </li><li>Conducts company onsite safety orientations with all site vendors/personnel working onsite. </li><li>Primary onsite safety manager, ensuring all regulations and company standards above OSHA are followed.</li><li>Manages all jobsite preparation including postings and site mobilization setup, staging and coordination. </li><li>Manages and submits all project required forms for onsite work: RFI’s, safety forms and hazard assessments, equipment checklists and any required items per the projects. </li><li>Ensures all quality control &amp; quality assurance is met per company standards and QA/QC manual. </li><li>Manages and hosts weekly subcontractor meetings; generates meeting agenda &amp; minutes. </li><li>Maintains jobsite housekeeping. Ensures all vendors follow jobsite cleanup requirements. </li><li>Coordinates, schedules, and stands inspections with local jurisdictions.</li><li>Develops and maintains all on-site relationships with clients, subcontractors, material suppliers, city officials, representatives and nearby and neighboring businesses.</li><li>Identifies and reduces punch lists. Generates punch list and coordinates completion. </li><li>Coordinates with project team to generate close out packages. <br/><br/></li></ul><strong>Qualification &amp; Experience<br/><br/></strong><ul><li>Minimum 3 years with related on-site Superintendent experience. </li><li>High school diploma or equivalent. </li><li>Experience managing personnel, vendors and subcontractors.</li><li>Strong knowledge of all general trades of construction, MEP’s and Civil. </li><li>Proficient with computers and Microsoft suite. </li><li>Experience with Procore is a major plus.</li><li>Experience with Smartsheet’s or equivalent is a major plus. </li><li>Experience working with on-site/off-site utilities.</li><li>Ability to read plans, specifications, survey markings and civil plans.</li><li>Strong Ability to strategically coordinate trades in sequence and strive to reduce time on schedule. </li><li>Ability to multi-task and possess strong attention to detail and time management skills. </li><li>Professional with a friendly and positive attitude towards change. </li><li>Ability to manage and host site meetings and safety talks. </li><li>Demonstrates strong written and verbal communication skills through all measures of projects.</li><li>Experience in retail, fast casual restaurants, quick service restaurants, big box, shopping centers are preferred. </li><li>Experience and knowledge of New Construction and remodel/retrofits. </li><li>Demonstrates strong attention to detail and problem solving. </li><li>Have the willingness and know-how to make things happen. </li><li>Values diversity of ideas and others’ opinions. Have good common sense and logical thinking.</li><li>Ability to lead and demonstrates strong communication skills with internal teams.</li><li>Analytical thinking, ability to value engineer complex projects. </li><li>General sales skills, ability to represent the company with pride and integrity.<br/><br/></li></ul><strong>Benefits<br/><br/></strong>JG Companies offers a competitive salary and/or hourly range reflective of the candidates experience along with a comprehensive benefits package for all full-time employees:<br/><br/><ul><li>Medical Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>401k retirement plan</li><li>Vacation and sick time</li><li>Holiday pay</li></ul>", "responsibilities": "Primary manager of the onsite operations. Required to be onsite at all times when work is being performed. Manages and oversees all subcontractors and maintains scheduling and coordination of timelines and onsite performance. Manages and maintains accurate daily logs with photos for all activity onsite and tracking of deliverables and all items to be entered in daily logs. Ensuring daily sign in sheets are completed. Schedules pre-construction meetings onsite with all vendors and project teams. Ensures compliance with job site rules &amp; requirements. Conducts company onsite safety orientations with all site vendors/personnel working onsite. Primary onsite safety manager, ensuring all regulations and company standards above OSHA are followed. Manages all jobsite preparation including postings and site mobilization setup, staging and coordination. Manages and submits all project required forms for onsite work: RFI’s, safety forms and hazard assessments, equipment checklists and any required items per the projects. Ensures all quality control &amp; quality assurance is met per company standards and QA/QC manual. Manages and hosts weekly subcontractor meetings; generates meeting agenda &amp; minutes. Maintains jobsite housekeeping. Ensures all vendors follow jobsite cleanup requirements. Coordinates, schedules, and stands inspections with local jurisdictions. Develops and maintains all on-site relationships with clients, subcontractors, material suppliers, city officials, representatives and nearby and neighboring businesses. Identifies and reduces punch lists. Generates punch list and coordinates completion. Coordinates with project team to generate close out packages.", "qualifications": {"required": "Minimum 3 years with related on-site Superintendent experience. High school diploma or equivalent. Experience managing personnel, vendors and subcontractors. Strong knowledge of all general trades of construction, MEP’s and Civil. Proficient with computers and Microsoft suite. Experience with Procore is a major plus. Experience with Smartsheet’s or equivalent is a major plus. Experience working with on-site/off-site utilities. Ability to read plans, specifications, survey markings and civil plans. Strong Ability to strategically coordinate trades in sequence and strive to reduce time on schedule. Ability to multi-task and possess strong attention to detail and time management skills. Professional with a friendly and positive attitude towards change. Ability to manage and host site meetings and safety talks. Demonstrates strong written and verbal communication skills through all measures of projects. Experience in retail, fast casual restaurants, quick service restaurants, big box, shopping centers are preferred. Experience and knowledge of New Construction and remodel/retrofits. Demonstrates strong attention to detail and problem solving. Have the willingness and know-how to make things happen. Values diversity of ideas and others’ opinions. Have good common sense and logical thinking. Ability to lead and demonstrates strong communication skills with internal teams. Analytical thinking, ability to value engineer complex projects. General sales skills, ability to represent the company with pride and integrity."}, "skills": ["Construction", "Project Management", "Safety", "Quality Control", "Teamwork", "Communication", "Leadership", "Problem Solving", "Microsoft Suite", "Procore", "Smartsheet"], "postedDate": "10 months ago", "benefits": "JG Companies offers a competitive salary and/or hourly range reflective of the candidates experience along with a comprehensive benefits package for all full-time employees:<br/><br/><ul><li>Medical Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>401k retirement plan</li><li>Vacation and sick time</li><li>Holiday pay</li></ul>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3751412411"}