{"jobTitle": "Project/Program Manager", "company": {"name": "Essel", "location": "Santa Fe Springs, CA"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Are you looking for the next step in your Project/Program management career? Or are you a mid-career management professional looking for the next big opportunity?<br/><br/>Have you gained significant experience in the design, fabrication, and installation of projects and are looking to expand your skill set?<br/><br/><strong>Essel is looking for a Project/Program Manager with experience managing mid to large scale projects.<br/><br/></strong><strong>If you are ready to work hard and get back to what you put in, then you are the right person for the job.<br/><br/></strong>YOU ARE A NATURAL BORN LEADER who takes initiative and will play a pivotal role in planning, executing, and overseeing projects that involve the manufacturing and installation of industrial machinery and systems. You will be responsible for managing cross-functional teams, coordinating activities, and ensuring projects are completed on time, within scope, and on budget.<br/><br/>YOU ARE AN EXCELLENT COMMUNICATOR that effectively communicates in a clear and direct manner using easily understood language with the Engineering teams, Sales team, Purchasing team, Clients, and Vendors. You will need to adapt language and communication style to match our audience and work well with a wide range of people and personalities.<br/><br/>YOU ARE KNOWLEDGEABLE, TECHNICAL &amp; PASSIONATE and possess technical competence and strong project management skills. You possess a strong, self-driven mentality as you strategically prioritize, delegate, and follow through with teams.<br/><br/>The Project Manager will lead multiple projects in design, engineering, and fabrication of custom process systems for a diverse range of industries, including defense/aerospace, electronics, chemical, energy, and more.<br/><br/><strong>Requirements<br/><br/></strong><ul><li>10+ years minimum experience and proven track record managing the entire scope of all projects</li><li>Proven experience in program management</li><li>Strong knowledge of all the aspects of production and operations</li><li>High sense of urgency and ability to meet schedule requirements</li><li>Good knowledge of budgeting and resource allocation procedures</li><li>Advanced proficiency with various computer software tools, including Microsoft Project, Word, and Excel</li><li>Demonstrated ability to write, draft execution plans, create schedules and related bid deliverables</li><li>Ability to drive technical solutions into process equipment</li><li>Proven knowledge of how to analyze subcontractor &amp; vendor quotes, understand pre-planning, how to sequence work scopes and plan field execution strategies during the bid cycle</li><li>Ability to prioritize work assignments and operate with continually changing priority needs</li><li>Bachelor's degree in engineering or related field</li><li>Experience in managing projects through ERP is a plus</li><li>Knowledge of fabrication methods including fitting, welding, and cutting methods is a plus<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Competitive Salary, Incentive Program, Medical, Dental, and Vision, 401K, Paid Time Off and Paid Holidays</strong>", "responsibilities": "YOU ARE A NATURAL BORN LEADER who takes initiative and will play a pivotal role in planning, executing, and overseeing projects that involve the manufacturing and installation of industrial machinery and systems. You will be responsible for managing cross-functional teams, coordinating activities, and ensuring projects are completed on time, within scope, and on budget.<br/><br/>YOU ARE AN EXCELLENT COMMUNICATOR that effectively communicates in a clear and direct manner using easily understood language with the Engineering teams, Sales team, Purchasing team, Clients, and Vendors. You will need to adapt language and communication style to match our audience and work well with a wide range of people and personalities.<br/><br/>YOU ARE KNOWLEDGEABLE, TECHNICAL &amp; PASSIONATE and possess technical competence and strong project management skills. You possess a strong, self-driven mentality as you strategically prioritize, delegate, and follow through with teams.<br/><br/>The Project Manager will lead multiple projects in design, engineering, and fabrication of custom process systems for a diverse range of industries, including defense/aerospace, electronics, chemical, energy, and more.", "qualifications": {"required": "10+ years minimum experience and proven track record managing the entire scope of all projects, Proven experience in program management, Strong knowledge of all the aspects of production and operations, High sense of urgency and ability to meet schedule requirements, Good knowledge of budgeting and resource allocation procedures, Advanced proficiency with various computer software tools, including Microsoft Project, Word, and Excel, Demonstrated ability to write, draft execution plans, create schedules and related bid deliverables, Ability to drive technical solutions into process equipment, Proven knowledge of how to analyze subcontractor &amp; vendor quotes, understand pre-planning, how to sequence work scopes and plan field execution strategies during the bid cycle, Ability to prioritize work assignments and operate with continually changing priority needs, Bachelor's degree in engineering or related field, Experience in managing projects through ERP is a plus, Knowledge of fabrication methods including fitting, welding, and cutting methods is a plus", "preferred": ""}, "skills": ["Project Management", "Program Management", "Production", "Operations", "Budgeting", "Resource Allocation", "Microsoft Project", "Word", "Excel", "Engineering", "ERP", "Fabrication"], "postedDate": "9 months ago", "benefits": "Competitive Salary, Incentive Program, Medical, Dental, and Vision, 401K, Paid Time Off and Paid Holidays", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3754765241"}