{"jobTitle": "Assistant General Manager", "company": {"name": "McDonald's", "industry": "Restaurants", "size": "Large", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "$83,200.00 - $112,320.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "Flexible scheduling with a side of always feeling valued. A job at McDonald’s offers a job combo that fits YOU. Perks & Benefits Competitive pay from $83200 - $112320 / year plus cash incentives Employee discounts and free meals 15-25 days paid vacation Tuition reimbursement and/or educational assistance Training and advancement opportunities Weekly direct deposit 401k plan* Medical, dental, and vision benefits* And much, much more! Available to full time employees in select locations. This role is vital to the operations within the restaurant because you’ll: Take action first: Lead important internal functions including Employee Training, Food Safety, and Inventory Management Be results oriented: Effectively delegate tasks to team members and report back results Lead the experience: Directly support the General Manager to achieve restaurant performance and quality standards in three areas: Kitchen: Supervise food quality, safety, cost, and new menu items People: Hire, train, and schedule restaurant staff to meet sales and profit goals Service: Deliver a memorable guest experience by ensuring all staff is trained and organizing key service areas within the restaurant to provide the best service Understand that teamwork is key: Partner with restaurant team to ensure safe and efficient operations of the restaurant To be a successful Assistant General Manager, you’ll need: HSD or GED preferred A passion for helping and serving others (customers and fellow team members) 1+ years’ experience leading, motivating and/or developing others OR US Military Service A commitment to excellence and safety in the workplace Strong customer service and support focus The ability to communicate effectively and anticipate customer needs; and To provide solutions and make decisions in a fast-paced environment. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin or ancestry, sex, gender, gender expression, sexual orientation, pregnancy, age, marital status, veteran status, physical or mental disability status, genetic information, citizenship or any other class characteristic protected by federal or applicable state law. We will ensure that individuals with disabilities are provided reasonable accommodation(s) to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact the restaurant you are applying to request accommodation(s). This job posting contains general information about working in this restaurant. This job posting is not a complete description of all duties of the job. People who work in this restaurant perform several different tasks every shift and this posting does not list every essential function of the job.", "responsibilities": "Lead important internal functions including Employee Training, Food Safety, and Inventory Management. Effectively delegate tasks to team members and report back results. Directly support the General Manager to achieve restaurant performance and quality standards in three areas: Kitchen, People, and Service. Partner with restaurant team to ensure safe and efficient operations of the restaurant.", "qualifications": {"required": "HSD or GED preferred, 1+ years’ experience leading, motivating and/or developing others OR US Military Service, Strong customer service and support focus.", "preferred": "A passion for helping and serving others (customers and fellow team members), A commitment to excellence and safety in the workplace, The ability to communicate effectively and anticipate customer needs."}, "skills": ["Leadership", "Customer Service", "Team Management", "Food Safety", "Inventory Management"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Competitive pay, Employee discounts, Paid vacation, Tuition reimbursement, Training opportunities, 401k plan, Medical, dental, and vision benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3756723931"}