{"jobTitle": "Crew Member", "company": {"name": "McDonald's", "location": "Culver City, CA"}, "location": "Culver City, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "20.00 - 25.45", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "Flexible scheduling with a side of always feeling valued. McDonald’s offers a job combo that will fit YOU.<br/><br/><strong>Perks &amp; Benefits<br/><br/></strong><ul><li>Competitive pay from $20.00 - $25.45 / hour plus cash incentives</li><li>Employee discounts and free meals</li><li>Paid sick leave and/or paid time away</li><li>Tuition reimbursement and/or educational assistance</li><li>Training and advancement opportunities</li><li>Weekly direct deposit and/or Daily Pay</li><li>401(k) plan</li><li>Medical, dental, and vision benefits*</li><li>And much more!</li><li>Available to full time employees in select locations<br/><br/></li></ul>This role is <strong>vital</strong> in the restaurant because you’ll:<br/><br/><ul><li>Lead the experience: Check in with guests and make sure they are enjoying themselves</li><li>Have a side of smile: Help customers order their favorite McDonald’s menu items and/or make menu recommendations</li><li>Focus on the food: Prepare and present delicious food</li><li>Ensure a memorable visit: Help maintain a welcoming, friendly, and clean restaurant environment</li><li>Understand that teamwork is key: Work hand in hand with your team to meet goals and most importantly, have fun!<br/><br/></li></ul><strong>To Be Successful In This Position, You’ll Need<br/><br/></strong><ul><li>A humble and hospitable demeanor</li><li>Passion for helping and serving others (customers and fellow team members)</li><li>A desire to learn and grow</li><li>The ability to communicate effectively and anticipate customer needs<br/><br/></li></ul><strong>So, what’s your job combo?<br/><br/></strong>We are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin or ancestry, sex, gender, gender expression, sexual orientation, pregnancy, age, marital status, veteran status, physical or mental disability status, genetic information, citizenship or any other class characteristic protected by federal or applicable state law. We will ensure that individuals with disabilities are provided reasonable accommodation(s) to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact the restaurant you are applying to request accommodation(s).<br/><br/>This job posting contains general information about working in this restaurant. This job posting is not a complete description of all duties of the job. People who work in this restaurant perform several different tasks every shift and this posting does not list every essential function of the job.<br/><br/>#zr", "responsibilities": "This role is vital in the restaurant because you’ll:<br/><br/><ul><li>Lead the experience: Check in with guests and make sure they are enjoying themselves</li><li>Have a side of smile: Help customers order their favorite McDonald’s menu items and/or make menu recommendations</li><li>Focus on the food: Prepare and present delicious food</li><li>Ensure a memorable visit: Help maintain a welcoming, friendly, and clean restaurant environment</li><li>Understand that teamwork is key: Work hand in hand with your team to meet goals and most importantly, have fun!<br/><br/></li></ul>", "qualifications": {"required": "A humble and hospitable demeanor, Passion for helping and serving others (customers and fellow team members), A desire to learn and grow, The ability to communicate effectively and anticipate customer needs"}, "skills": [], "postedDate": "2 weeks ago", "benefits": "Competitive pay from $20.00 - $25.45 / hour plus cash incentives, Employee discounts and free meals, Paid sick leave and/or paid time away, Tuition reimbursement and/or educational assistance, Training and advancement opportunities, Weekly direct deposit and/or Daily Pay, 401(k) plan, Medical, dental, and vision benefits*, And much more!, Available to full time employees in select locations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3756941068"}