{"jobTitle": "Influencer Marketing Expert and Mentor", "company": {"name": "Fud, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Art/Creative", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "We are seeking a creative and talented Influencer Marketing Expert and Mentor to join our team and share their knowledge on influencer marketing, UGC, and creator economy with our community. As an Influencer Marketing Expert and Mentor, you will be responsible for producing engaging and informative content that will help our community start and grow their own successful side hustles, including influencer marketing, user generated content, and content creating.<br/><br/>Join the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers &amp; thrifters, entrepreneurs, solopreneurs, and small business owners.<br/><br/><strong>You can experience our community for yourself by downloading our free to use app.<br/><br/></strong>You will join a community focused on side hustles, including:<br/><br/><ul><li>Content Creator — YouTube, TikTok, or Instagram</li><li>Reselling and Thrifting — including eBay, Etsy, Mercari, Poshmark, and others</li><li>E-Commerce — including Amazon, Shopify, and your own online store</li><li>Gig Economy — like DoorDash, Uber, or Lyft</li><li>Freelancing and Consulting — social media marketing, graphic design, and more</li><li>Online Business — including blogging, podcasting, and online courses</li><li>Local Services — including cleaning, knife sharpening, notary services, pet waste removal, and more</li><li>Self-Publishing — including Kindle Direct Publishing and Canva<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>You are aware of the trends in future of work, personal finance, and entrepreneurship </li><li>Ability to follow trends and understand the type of content that drives engagement</li><li>A willingness to share know-how through video, livestreaming, and text content</li><li>An abundance mindset</li><li>An entrepreneurial spirit</li><li>High level of initiative and positive approach <br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Be your own boss</li><li>Learn how to make money from your passion and interests</li><li>Find a community of like minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want<br/><br/><br/></li></ul><strong>We are a community that values diversity. We encourage everyone including women and people of color to join us!</strong>", "postedDate": "9 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3761195235"}