{"jobTitle": "Contract Manager", "company": {"name": "Systems Planning & Analysis", "location": "El Segundo, CA"}, "location": "El Segundo, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "210,000.00/yr - 230,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Defense and Space Manufacturing, Aviation and Aerospace Component Manufacturing, and Armed Forces", "description": "<strong>Overview<br/><br/></strong>Systems Planning and Analysis, Inc. (SPA) delivers high-impact, technical solutions to complex national security issues. With over 50 years of business expertise and consistent growth, we are known for continuous innovation for our government customers, in both the US and abroad. Our exceptionally talented team is highly collaborative in spirit and practice, producing Results that Matter . Come work with the best! We offer opportunity, unique challenges, and clear-sighted commitment to the mission. SPA: Objective. Responsive. Trusted.<br/><br/>SPA’s Space and Intelligence Division provides multiple organizations within the United States Space Force and Intelligence Community with timely and objective assessments and recommendations that integrate technical, operational, programmatic, policy and business analysis. We focus on key clients in the space community including the US Space Force’s Space Systems Command (USSF/SSC), one of the three designated Field Commands under the space service branch. We work to provide integrated solutions based on information and communications throughout the chain of command to ensure clear and consistent analysis and recommendations that are aligned to strategic and leadership goals while still being executable by the working level technical communities.<br/><br/>SPA has a near term need for one (1) Contract Manager supporting SSC at Los Angeles AFB in El Segundo, CA.<br/><br/><strong>Responsibilities<br/><br/></strong>The key duties of the Contract Manager includes but is not limited to the following:<br/><br/><ul><li> Provide management, direction, administration, and quality assurance support of the execution of this Task Order; </li><li> Be responsible for supporting quality and efficiency of the Task Order to include both technical issues and business processes; </li><li> Be proactive in alerting the Government to potential contractual or programmatic issues and resource limitations; <br/><br/></li></ul>Support the Program Executive Officer (PEO) Action Group (PAG), which is responsible for, projection and Directorate level coordination to include but not limited to, facilitating and/or coordinating Directorate level strategic briefings, messages (PA/Media), reports, analysis and special projects supporting the portfolio.<br/><br/><strong>Qualifications<br/><br/></strong><strong>Required Qualifications:<br/><br/></strong><ul><li> Active TS/SCI clearance </li><li> Bachelor's degree in a related field, such as Management, Business, Economics, Finance, Accounting, Mathematics, Science, Technology, Engineering, or Statistics </li><li> 17 years of experience including 3 years in Space </li><li> APDP Level III certification or equivalent <br/><br/></li></ul><strong>Desired Qualifications<br/><br/></strong><ul><li> Masters degree <br/><br/></li></ul>At SPA, we strive to deliver a robust total compensation package that will attract and retain top talent. Elements of the compensation package include competitive base pay and variable compensation opportunities.<br/><br/>SPA provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.<br/><br/>The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, etc.<br/><br/>Please note that the salary information shown below is a general guideline only. Salaries are commensurate with experience and qualifications, as well as market and business considerations. California Pay Transparency Range: 210k - 230k", "responsibilities": "The key duties of the Contract Manager includes but is not limited to the following:<br/><br/><ul><li> Provide management, direction, administration, and quality assurance support of the execution of this Task Order; </li><li> Be responsible for supporting quality and efficiency of the Task Order to include both technical issues and business processes; </li><li> Be proactive in alerting the Government to potential contractual or programmatic issues and resource limitations; <br/><br/></li></ul>Support the Program Executive Officer (PEO) Action Group (PAG), which is responsible for, projection and Directorate level coordination to include but not limited to, facilitating and/or coordinating Directorate level strategic briefings, messages (PA/Media), reports, analysis and special projects supporting the portfolio.", "qualifications": {"required": "Active TS/SCI clearance\nBachelor's degree in a related field, such as Management, Business, Economics, Finance, Accounting, Mathematics, Science, Technology, Engineering, or Statistics\n17 years of experience including 3 years in Space\nAPDP Level III certification or equivalent", "preferred": "Masters degree"}, "skills": [], "postedDate": "1 week ago", "benefits": "At SPA, we strive to deliver a robust total compensation package that will attract and retain top talent. Elements of the compensation package include competitive base pay and variable compensation opportunities.<br/><br/>SPA provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.<br/><br/>The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, etc.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3761489019"}