{"jobTitle": "Senior Manager, Business Development & Partnerships", "company": {"name": "Maple Media", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$100,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Software Development", "description": "Job Overview:<br/><br/>Maple Media is a rapidly growing business focused on creating premium, innovative experiences for world-class mobile apps across health &amp; wellness, business productivity, podcasting, games, and additional verticals. This is an exciting time to join this growing business, and we are seeking a Senior Manager, Business Development to develop new business and growth strategies with partners, identify growth initiatives, including new partnerships and bundles, and negotiate partnership deals across the Maple Media established and growing portfolio.<br/><br/>What’s so exciting about joining the team at Maple Media right now?<br/><br/><ul><li>You’ll have real ownership over your area of expertise, to define strategy &amp; process</li><li>You’ll get to work on and impact a diverse set of top-rated mobile apps &amp; games</li><li>You’ll get to partner with bright &amp; dynamic individuals who learn from and challenge each other (and make each other laugh)<br/><br/><br/></li></ul>About the role:<br/><br/><ul><li> Develop partnerships and business development strategies for key products, including established and nascent aspects of Maple Media’s business</li><li> Identify, scope, and execute new partnerships to drive new subscribers, brand recognition, value with partners across a variety of categories</li><li> Identify and evaluate new trends, categories, concepts, and businesses that will grow Maple Media in alignment with long-term objectives</li><li> Build business cases and prospect new partners who can drive meaningful business results</li><li> Lead multiple new partner projects simultaneously while building positive relationships with partners and actively collaborating with the deal team(s), marketing, finance, legal, ad sales, and product to ensure the closing of new opportunities</li><li> Work closely with product, support, and engineering teams to identify and engage potential Partners to enhance our mobile product functionalities and distribution</li><li> Own Client relationship end-to-end, from initial scoping, to negotiations, and launch</li><li> Lead cross-functional team in the deployment of partnerships, including creative, legal, finance, product, marketing, comms, support, etc</li><li> Design and implement necessary analytics to measure and optimize partnerships</li><li> Cold call and email prospects, and work towards building relationships in the industry</li><li> Structure, negotiate and close partnerships</li><li> Gather, organize and evaluate data, KPIs and financials<br/><br/><br/></li></ul>Desired skills and experience:<br/><br/><ul><li> Passion for mobile, mobile games, mobile ad-tech, product management/development and driving overall growth</li><li> 4-6 years of experience in business development and partnerships</li><li> Proven ability to negotiate and close deals ranging from tactical, mid-size opportunities, to strategic, large and complex partners</li><li> Experience creating, researching, and assessing new business plans, including financial and operational viability, and have partnered to execute against them</li><li> Strong analytical skills able to evaluate opportunities from strategic, brand, financial, and operational perspectives<br/><br/><br/></li></ul>Proven ability to work collaboratively with internal and external cross-functional teams.<br/><br/><ul><li> Excellent interpersonal skills with the ability to think and communicate creatively, thoughtfully, and on your feet with diverse technical and non-technical groups, spanning all organizational levels</li><li> Proven ability to develop relationships, negotiate and problem-solve with external partners</li><li> Highly entrepreneurial and comfortable working in a fast-paced environment with the ability to thrive under minimal guidance</li><li> Strategic thinker and tactical executor able to shift from big picture to detailed operations on a dime</li><li> Strong team player with an excellent track record of success in highly matrixed, fast-paced environments with changing priorities</li><li> Extensive database of senior-level contacts with the ability to prospect and network to open new relationships and opportunities</li><li> Creative, resourceful, highly organized, and able to prioritize workload; comfortable with a fast-paced, always-on, highly ambiguous environment</li><li> BA/BS required<br/><br/><br/></li></ul>The Recruiting Process:<br/><br/>After the initial screening process with our recruiting team and the hiring manager, we’ll invite you to 2-3 interviews with other members of the marketing team, including your potential peers and senior management. This is an opportunity to get to know each other and identify if the role is aligned with your skillset and career goals. Typically, candidates we move forward with understand their career goals and have spent a few minutes reviewing our products and the caliber of our team on LinkedIn to get a sense of who we are and what we do.<br/><br/>The interviews may be held remotely or in person, and include some behavioral and problem-solving questions. We may follow up with a take-home assignment that lets you show off your skillset. This exercise doesn’t require any prior company-specific knowledge, should take no more than a few hours to complete and is representative of the work we do every day. We also typically check 1-2 references from former managers to hear about your impact firsthand from someone you’ve worked with, especially to confirm fit with our culture and ability to drive impact in a fast-paced startup environment. We also will make time for any and all questions you have about the role, your impact and your trajectory, should you join our team.<br/><br/>The U.S. base salary range for this position is $100,000 - $150,000 plus bonus opportunities and benefits. Our salary ranges are determined by role and level.<br/><br/>Maple Media is an equal-opportunity employer. We do not discriminate based upon race, religion, color, ancestry, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, age, disability. We are committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations, please let us know.", "responsibilities": "<ul><li> Develop partnerships and business development strategies for key products, including established and nascent aspects of Maple Media’s business</li><li> Identify, scope, and execute new partnerships to drive new subscribers, brand recognition, value with partners across a variety of categories</li><li> Identify and evaluate new trends, categories, concepts, and businesses that will grow Maple Media in alignment with long-term objectives</li><li> Build business cases and prospect new partners who can drive meaningful business results</li><li> Lead multiple new partner projects simultaneously while building positive relationships with partners and actively collaborating with the deal team(s), marketing, finance, legal, ad sales, and product to ensure the closing of new opportunities</li><li> Work closely with product, support, and engineering teams to identify and engage potential Partners to enhance our mobile product functionalities and distribution</li><li> Own Client relationship end-to-end, from initial scoping, to negotiations, and launch</li><li> Lead cross-functional team in the deployment of partnerships, including creative, legal, finance, product, marketing, comms, support, etc</li><li> Design and implement necessary analytics to measure and optimize partnerships</li><li> Cold call and email prospects, and work towards building relationships in the industry</li><li> Structure, negotiate and close partnerships</li><li> Gather, organize and evaluate data, KPIs and financials<br/><br/><br/></li></ul>", "qualifications": {"required": "Passion for mobile, mobile games, mobile ad-tech, product management/development and driving overall growth, 4-6 years of experience in business development and partnerships, Proven ability to negotiate and close deals ranging from tactical, mid-size opportunities, to strategic, large and complex partners, Experience creating, researching, and assessing new business plans, including financial and operational viability, and have partnered to execute against them, Strong analytical skills able to evaluate opportunities from strategic, brand, financial, and operational perspectives, Proven ability to work collaboratively with internal and external cross-functional teams, Excellent interpersonal skills with the ability to think and communicate creatively, thoughtfully, and on your feet with diverse technical and non-technical groups, spanning all organizational levels, Proven ability to develop relationships, negotiate and problem-solve with external partners, Highly entrepreneurial and comfortable working in a fast-paced environment with the ability to thrive under minimal guidance, Strategic thinker and tactical executor able to shift from big picture to detailed operations on a dime, Strong team player with an excellent track record of success in highly matrixed, fast-paced environments with changing priorities, Extensive database of senior-level contacts with the ability to prospect and network to open new relationships and opportunities, Creative, resourceful, highly organized, and able to prioritize workload; comfortable with a fast-paced, always-on, highly ambiguous environment, BA/BS required", "preferred": ""}, "skills": ["Mobile", "Mobile Games", "Mobile Ad-Tech", "Product Management", "Business Development", "Partnerships", "Negotiation", "Deal Closing", "Business Planning", "Financial Analysis", "Operational Viability", "Cross-Functional Collaboration", "Interpersonal Skills", "Communication", "Entrepreneurship", "Strategic Thinking", "Teamwork", "Networking", "Prioritization"], "postedDate": "9 months ago", "applicationDeadline": "", "benefits": "The U.S. base salary range for this position is $100,000 - $150,000 plus bonus opportunities and benefits. Our salary ranges are determined by role and level.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3763379366"}