{"jobTitle": "Driver", "company": {"name": "MV Transportation", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Ground Passenger Transportation", "description": "If you reside in California, please see our California Applicant Privacy Policy for more information about our data handling practices and your data rights.<br/><br/><strong>Responsibilities<br/><br/></strong><strong>Now Hiring Drivers!<br/><br/></strong><strong>I</strong> <strong>ncreased Starting Rate - Now $20.25/hour<br/><br/></strong><strong>Please call Maria at 213-266-1200 to SCHEDULE YOUR PHONE INTERVIEW!</strong> <strong>or apply online <br/><br/></strong>Conditional Job Offers may be presented on the Same Day of your Interview!<br/><br/><strong> Who You Are: <br/><br/></strong>As a <strong> D river, </strong> you will be r esponsible for safely operating a transit motor vehicle, providing reliable and efficient public transportation.<br/><br/><strong> What's In it for YOU: <br/><br/></strong><ul><li> $20.25 per hour starting rate </li><li> Benefits  (Medical, Dental, Vision, Life Insurance for qualified candidates) </li><li> Let us help you get your CDL - Paid CDL Training and Permit Assistance! </li><li> Company provides personal protection equipment (PPE) as the safety and well-being of our employees and the passengers we serve remains our #1 priority! <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> Driver Minimum Requirements: <br/><br/></strong><ul><li> Must be able to pass a pre-employment drug screen and DOT physical. </li><li> Must have a CDL with and Passenger Endorsement. GPPV or School bus cerification. (Paid trainng and assistance for CDL and GPPV permits) </li><li> Possess excellent communication and decision-making skills. <br/><br/></li></ul><strong> We can put you on the road to a great career helping others! <br/><br/></strong>MV Transportation is committed to a policy of Equal Employment Opportunity and will not discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin or ancestry, sex, physical or mental disability, veteran or military status, genetic information or any other legally recognized protected basis under federal, state or local laws, regulations or ordinances.  The information collected by this application is solely to determine suitability for employment, verify identity and maintain employment statistics on applicants. <br/><br/>Where permissible under applicable state and local law, applicants may be subject to a pre-employment drug test and background check after receiving a conditional offer of employment.<br/><br/>#appcast", "responsibilities": "As a  Driver,  you will be responsible for safely operating a transit motor vehicle, providing reliable and efficient public transportation.", "qualifications": {"required": "Must be able to pass a pre-employment drug screen and DOT physical. \nMust have a CDL with and Passenger Endorsement. GPPV or School bus cerification. (Paid trainng and assistance for CDL and GPPV permits) \nPossess excellent communication and decision-making skills."}, "skills": [], "postedDate": "10 months ago", "benefits": "$20.25 per hour starting rate \nBenefits  (Medical, Dental, Vision, Life Insurance for qualified candidates) \nLet us help you get your CDL - Paid CDL Training and Permit Assistance! \nCompany provides personal protection equipment (PPE) as the safety and well-being of our employees and the passengers we serve remains our #1 priority!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3766740046"}