{"jobTitle": "Assistant General Manager", "company": {"name": "MV Transportation", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Ground Passenger Transportation", "description": "If you reside in California, please see our California Applicant Privacy Policy for more information about our data handling practices and your data rights.<br/><br/><strong>Responsibilities<br/><br/></strong>MV Transportation is seeking an  <strong> Assistant General Manager </strong>  to provide support, leadership and direction to assigned operating personnel to ensure delivery of the division business plan in our fast - paced transit business.<br/><br/><strong> Job Responsibilities: <br/><br/></strong><ul><li> Ensures performance indicators meet or exceed client and corporate expectations. </li><li> Ensures division goals and objectives are met or exceeded. </li><li> Ensures subordinate staff are well trained and being successful. </li><li> Ensures all company policies and procedures are in place and being followed. </li><li> Ensures the company vision, values and culture are understood, communicated and promoted throughout operations. </li><li> Ensures liquidated damages are kept to a minimum and failures are corrected. </li><li> Develop and maintain a positive employee and labor relations. </li><li> Directly oversees operations department managers. </li><li> Trains and mentors a future successor for backfill. </li><li> Successfully manages the Operations Department annual budget. </li><li> Assumes responsibility of the General Manager during his/her absence. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong> Talent Requirements: <br/><br/></strong><ul><li> High School diploma or equivalent ; c ollege d egree preferred. </li><li> Certifications according to local contract as r equired. </li><li> Knowledge of State and Federal regulations as well as company policies and procedures. </li><li> Experience in development of runs, shift bids and run cuts. </li><li> Strong organizational skills. </li><li> Strong analytical skills. </li><li> Strong communication skills including written and verbal. </li><li> Ability to work independently and be a self-starter. </li><li> Strong supervision skills with ability to lead others to success. </li><li> Ability to develop solutions to challenge through planning and implementation. </li><li> Ability to write and speak English. <br/><br/></li></ul>Starting salary range: $95,000 - $110,000<br/><br/>MV Transportation is committed to as policy of Equal Employment Opportunity and will not discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin or ancestry, sex, physical or mental disability, veteran or military status, genetic information or any other legally recognized protected basis under federal, state or local laws, regulations or ordinances. The information collected by this application is solely to determine suitability for employment, verify identity and maintain employment statistics on applicants.<br/><br/>Where permissible under applicable state and local law, applicants may be subject to a pre-employment drug test and background check after receiving a conditional offer of employment.", "responsibilities": "MV Transportation is seeking an  <strong> Assistant General Manager </strong>  to provide support, leadership and direction to assigned operating personnel to ensure delivery of the division business plan in our fast - paced transit business.<br/><br/><strong> Job Responsibilities: <br/><br/></strong><ul><li> Ensures performance indicators meet or exceed client and corporate expectations. </li><li> Ensures division goals and objectives are met or exceeded. </li><li> Ensures subordinate staff are well trained and being successful. </li><li> Ensures all company policies and procedures are in place and being followed. </li><li> Ensures the company vision, values and culture are understood, communicated and promoted throughout operations. </li><li> Ensures liquidated damages are kept to a minimum and failures are corrected. </li><li> Develop and maintain a positive employee and labor relations. </li><li> Directly oversees operations department managers. </li><li> Trains and mentors a future successor for backfill. </li><li> Successfully manages the Operations Department annual budget. </li><li> Assumes responsibility of the General Manager during his/her absence. <br/><br/></li></ul>", "qualifications": {"required": "High School diploma or equivalent ; c ollege d egree preferred. <br/>Certifications according to local contract as r equired. <br/>Knowledge of State and Federal regulations as well as company policies and procedures. <br/>Experience in development of runs, shift bids and run cuts. <br/>Strong organizational skills. <br/>Strong analytical skills. <br/>Strong communication skills including written and verbal. <br/>Ability to work independently and be a self-starter. <br/>Strong supervision skills with ability to lead others to success. <br/>Ability to develop solutions to challenge through planning and implementation. <br/>Ability to write and speak English. <br/><br/>", "preferred": ""}, "skills": [], "postedDate": "9 months ago", "salary": {"amount": "95,000.00 - 110,000.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3766737451"}