{"jobTitle": "Sr Accountant", "company": {"name": "Tripalink", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "75,000.00/yr - 100,000.00/yr", "currency": "USD"}, "jobFunction": "Accounting/Auditing and Finance", "industry": "Technology, Information and Internet", "description": "Who We Are: Tripalink is a leading co-living and apartment rental platform that aims to redefine urban living. With a strong presence in major cities across the United States, we offer modern apartments designed to create a sense of community among residents. As a fast-growing startup, we are committed to building a community that supports personal growth, celebrates diversity, and encourages excellence. Our team is dedicated to providing exceptional living experiences through cutting-edge technology and unparalleled customer service. If you're passionate about making a difference and eager to be part of a team that values creativity and teamwork, we invite you to explore our career opportunities and join us on our journey. Accounting and Internal Auditing<br/><br/><ul><li>Prepare GAAP-compliant monthly, quarterly, and annual financial statements (income statement, retained earnings, balance sheet, and cash flow) and summarize overall findings in clear, concise, and comprehensive reports for the management to review</li><li>Accrue expenses for any invoices that have not been received</li><li>Accrue expenses for any wages earned but not yet paid as of the end of the reporting period</li><li>Calculate depreciation and amortization expenses for all fixed assets in the accounting records</li><li>Record adjustments to bank reconciliations and journal entries to match the accounting records to the bank statement</li><li>Compute payroll payments including medical benefits and bonuses and draft final reports</li><li>Cash management for all company functions: review cash balances, prepare cash projections, and calculate available funds for maintenance, equipment purchasing, and payroll</li><li>Work with the department managers to maintain financial records in compliance with accounting procedures and standards</li><li>Assist supervisor in planning and conducting monthly audits by reviewing the company’s agreements, equipment and material purchasing, payroll and employee benefits, and all other financial transactions and draft detailed reports of any mismanagement of the company’s funds</li><li>Assist in the company’s annual external audit by working with staffing agencies, CPAs, and auditors to review work papers</li><li>Perform quarterly audits to corroborate the amounts and disclosures included in the financial statements by obtaining audit evidence through inquiry, physical inspection, observation, third-party confirmations, examination, and analytical procedures;</li><li>Maintain accounting control by recommending policies and procedures for accounting and financial records. </li><li>Perform ad-hoc accounting projects and research as assigned<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Accounting BS/BA degree</li><li>3 years of accounting experience. </li><li>Prefer Real Estate industry experience and Appfolio experience</li><li>Prefer: CPA<br/><br/><br/></li></ul>To perform the foregoing duties, the candidate must possess at least a bachelor’s degree or higher in Accounting, Finance, or a closely related major. The candidate should possess knowledge of financial accounting, cost accounting, financial statements and reporting, and financial modeling and analysis ability to analyze and calculate operating costs and budgets. These minimum prerequisites for the offered position are in line with our industry’s common practices and clearly mark the offered position as a specialty occupation that requires theoretical and practical application of highly specialized knowledge. What We Provide: - Excellent Working Environment: Energetic, Ambitious, Passionate - Great Team Experience - Regular Team Building Activities - Free Community Event Entrance - Leadership Cultivation &amp; Individual Development - Networking &amp; Resources from External Partners - Opportunities of Rotation Among Departments &amp; Locations Diversity &amp; Inclusion at Tripalink Tripalink is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. We are proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status. Note on Pay Transparency: Tripalink provides an estimate of the compensation for roles that may be hired as required by state regulations. This role may also qualify for annual incentive and/or comprehensive benefits. Compensation may vary based on (a) location, as Tripalink factors in specific location when benchmarking compensation for most roles; (b) individual candidate skills and qualifications; and (c) individual candidate experience. Additionally, Tripalink leverages current market data to determine compensation, so posted compensation figures are subject to change as new market data becomes available. The salary, other compensation, and benefits information is accurate as of the date of this posting. Tripalink reserves the right to modify this information at any time, subject to applicable law.", "responsibilities": "Prepare GAAP-compliant monthly, quarterly, and annual financial statements (income statement, retained earnings, balance sheet, and cash flow) and summarize overall findings in clear, concise, and comprehensive reports for the management to review\nAccrue expenses for any invoices that have not been received\nAccrue expenses for any wages earned but not yet paid as of the end of the reporting period\nCalculate depreciation and amortization expenses for all fixed assets in the accounting records\nRecord adjustments to bank reconciliations and journal entries to match the accounting records to the bank statement\nCompute payroll payments including medical benefits and bonuses and draft final reports\nCash management for all company functions: review cash balances, prepare cash projections, and calculate available funds for maintenance, equipment purchasing, and payroll\nWork with the department managers to maintain financial records in compliance with accounting procedures and standards\nAssist supervisor in planning and conducting monthly audits by reviewing the company’s agreements, equipment and material purchasing, payroll and employee benefits, and all other financial transactions and draft detailed reports of any mismanagement of the company’s funds\nAssist in the company’s annual external audit by working with staffing agencies, CPAs, and auditors to review work papers\nPerform quarterly audits to corroborate the amounts and disclosures included in the financial statements by obtaining audit evidence through inquiry, physical inspection, observation, third-party confirmations, examination, and analytical procedures;\nMaintain accounting control by recommending policies and procedures for accounting and financial records. \nPerform ad-hoc accounting projects and research as assigned", "qualifications": {"required": "Accounting BS/BA degree\n3 years of accounting experience. ", "preferred": "Prefer Real Estate industry experience and Appfolio experience\nPrefer: CPA"}, "skills": ["GAAP", "Financial Statements", "Financial Modeling", "Cost Accounting", "Auditing", "Cash Management", "Payroll", "Internal Audit", "Financial Reporting", "Financial Analysis"], "postedDate": "9 months ago", "benefits": "Excellent Working Environment: Energetic, Ambitious, Passionate - Great Team Experience - Regular Team Building Activities - Free Community Event Entrance - Leadership Cultivation &amp; Individual Development - Networking &amp; Resources from External Partners - Opportunities of Rotation Among Departments &amp; Locations", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3768175628"}