{"jobTitle": "General Manager", "company": {"name": "King's Seafood Company", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "110,000.00/yr - 140,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Restaurants", "description": "For over 25 years, the Water Grill has sated the palates of seafood lovers in Southern California. Hailed as \"the best seafood in Southern California\" by the internationally recognized Zagat Guide, Water Grill consistently offers dazzling fish preparations of superior quality and freshness.<br/><br/>Here's What We'll Bring To The Table for General Manager:<br/><br/>\n<ul><li>Competitive Salary: $110,000 to $140,000 based on experience + realized bonus </li><li>Paid Vacation and Sick Days</li><li>Dining Discount for you and up to 5 guests</li><li>401k with a Match</li><li>Education Reimbursement </li><li>Medical insurance, Dental insurance, Vision insurance, Life insurance, and Pet Healthcare Savings Account<br/><br/></li></ul>Our managers are held at a high standard with clear expectations to be the leader of the restaurant, the ambassadors of our product and the executor of our hospitality. As the General Manager, you will be the leader of the restaurant. You will be a role model of our guest first mentality. You will lead and support the rest of the Management team to set goals and successfully achieve results. The General Manager motivates, develops, and leads both crewmembers and managers.<br/><br/>You will be the expert in all areas of the restaurant and support our seamless service while continuing to develop and coach your crew. You will be the go-to person for operations troubleshooting, Guest interactions, and any human resources events.<br/><br/>Once hired, you will be joining a stable company that has a proven track record of developing successful operators over the past 30 plus years. You will be fully trained in financial acumen, quality assurance, daily operations, and leadership. You will learn all aspects of operations from sophisticated operating systems to managing a product centric menu, to the behind-the-scene process of creating cutting edge restaurant designs and concepts. You will be partnered with a Director of Operations and given all the tools to be efficient and effective.<br/><br/>Your personal career path is driven by your own goals and we are prepared to give you all the tools needed to take you to any level of leadership you desire. A successful General Manager with us is “standards-driven” and vigilant, showing a high-level of integrity in their work. They always interact with crewmembers and Guests in a professional manner and take a positive approach to resolving issues.<br/><br/>Essential Responsibilities<br/><br/>\n<ul><li>Oversees the daily operations from ordering, purchasing, receiving, storage, and preparation of all food products to guest relations, flow of business, and service standards.</li><li>Oversees the flow of the business during business hours. Being active in all areas of the restaurant (front desk, bar/lounge, kitchen, and main dining room) for the whole dining period. Walking the building to ensure all areas of service are being met to company standards and course correcting when needed. </li><li>Responsible for financial operations of restaurant.</li><li>Approves all schedules</li><li>Participates in creativity of developing incentive programs, generating sales and marketing services. </li><li>Ensures that all food products meet company recipe specifications for preparation and quality.</li><li>Recognition of crewmembers (coaching)</li><li>Approve payroll, OT, and any exceptions</li><li>Communicate with MP/DO on all financial, crew, property, or guest related issues. </li><li>Makes financial commitments (donated gift cards) to external partners.</li><li>Forecasts sales and labor budget (annual, weekly, daily)</li><li>Coordinate with other managers about updates, sales, policies, and standards</li><li>Touch guest tables each shift to build relationships, ensure return visits and troubleshoot anything that arises. </li><li>Lead pre-shift for FOH crew</li><li>Oversee the training /cross training of the hourly crew</li><li>Complete New Hire paperwork for all crew</li><li>Lead progressive discipline of crewmembers and managers</li><li>Communicate with Home Office on crew related issues</li><li>Interviews and selects new crew; is the final decision on all hires</li><li>Conducts annual performance reviews on all managers</li><li>Sets Departmental goals and follows up with managers on results, measurements, and course corrects when needed.</li><li>Leads weekly Dashboards with all Managers</li><li>Prepares for and represents restaurant at GM meetings and conference calls</li><li>Leads all crew meeting</li><li>Leads and is responsible for MIT training (classroom)</li><li>Formulate restaurant policies and operation policies to continuously enhance our business. </li><li>Investigates and resolves complaints from crew disputes to guest complaints</li><li>Makes the final decision on transfers to other departments and/or locations. <br/><br/></li></ul>Essential Skills/Experience<br/><br/>\n<ul><li>At least 21 years of age.</li><li>Seven years of experience as a Manager in full service, high volume, restaurant.</li><li>Two years of experience as a General Manager in a full service casual or fine dining restaurant of similar concept</li><li>Seafood knowledge and prior kitchen experience preferred.</li><li>College degree in a related field, i.e., business or hotel and restaurant management, preferred.</li><li>Flexible schedule required-able to work nights, weekends and holidays.</li><li>Professional appearance and presentation required.</li><li>Good longevity in current and past positions </li><li>Ability to lift up to 40 lbs., 10-20 is typical</li><li>Ability to carry up to 120 feet</li><li>Ability to reach up to 6 feet, 4 is typical</li><li>Ability to work off counter heights of 36 - 42 inches</li><li>Ability to move through 24 inch aisles and spaces as small as 12 inches</li></ul>", "responsibilities": "Oversees the daily operations from ordering, purchasing, receiving, storage, and preparation of all food products to guest relations, flow of business, and service standards. Oversees the flow of the business during business hours. Being active in all areas of the restaurant (front desk, bar/lounge, kitchen, and main dining room) for the whole dining period. Walking the building to ensure all areas of service are being met to company standards and course correcting when needed. Responsible for financial operations of restaurant. Approves all schedules. Participates in creativity of developing incentive programs, generating sales and marketing services. Ensures that all food products meet company recipe specifications for preparation and quality. Recognition of crewmembers (coaching). Approve payroll, OT, and any exceptions. Communicate with MP/DO on all financial, crew, property, or guest related issues. Makes financial commitments (donated gift cards) to external partners. Forecasts sales and labor budget (annual, weekly, daily). Coordinate with other managers about updates, sales, policies, and standards. Touch guest tables each shift to build relationships, ensure return visits and troubleshoot anything that arises. Lead pre-shift for FOH crew. Oversee the training /cross training of the hourly crew. Complete New Hire paperwork for all crew. Lead progressive discipline of crewmembers and managers. Communicate with Home Office on crew related issues. Interviews and selects new crew; is the final decision on all hires. Conducts annual performance reviews on all managers. Sets Departmental goals and follows up with managers on results, measurements, and course corrects when needed. Leads weekly Dashboards with all Managers. Prepares for and represents restaurant at GM meetings and conference calls. Leads all crew meeting. Leads and is responsible for MIT training (classroom). Formulate restaurant policies and operation policies to continuously enhance our business. Investigates and resolves complaints from crew disputes to guest complaints. Makes the final decision on transfers to other departments and/or locations.", "qualifications": {"required": "At least 21 years of age. Seven years of experience as a Manager in full service, high volume, restaurant. Two years of experience as a General Manager in a full service casual or fine dining restaurant of similar concept. Flexible schedule required-able to work nights, weekends and holidays. Professional appearance and presentation required. Good longevity in current and past positions Ability to lift up to 40 lbs., 10-20 is typical Ability to carry up to 120 feet Ability to reach up to 6 feet, 4 is typical Ability to work off counter heights of 36 - 42 inches Ability to move through 24 inch aisles and spaces as small as 12 inches", "preferred": "Seafood knowledge and prior kitchen experience preferred. College degree in a related field, i.e., business or hotel and restaurant management, preferred."}, "skills": ["Seafood", "Restaurant Management", "Guest Relations", "Financial Management", "Leadership", "Training", "Operations Management", "Hospitality", "Teamwork", "Communication", "Problem Solving"], "postedDate": "9 months ago", "benefits": "Competitive Salary: $110,000 to $140,000 based on experience + realized bonus Paid Vacation and Sick Days Dining Discount for you and up to 5 guests 401k with a Match Education Reimbursement Medical insurance, Dental insurance, Vision insurance, Life insurance, and Pet Healthcare Savings Account", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3774245493"}