{"jobTitle": "Production Assistant (Project-based, W2)", "company": {"name": "Advanced Systems Group, LLC", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "25.00/hr - 50.00/hr", "currency": "USD"}, "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Broadcast Media Production and Distribution, Media Production, and Online Audio and Video Media", "description": "Advanced Systems Group, LLC enables creativity through better technology and operations for media creatives and content owners. From acquisition to delivery, on-premises or in the cloud, ASG ensures our clients’ success through tailored solutions. One of North America’s largest Media and Entertainment Technology and Operations suppliers, we provide engineering services, physical and cloud integration, training, support, and managed services.<br/><br/>Our Managed Services deliver customized operations and services for all phases of media production, including creative and engineering. Founded in 1997, ASG has teams based in Northern California, Los Angeles, the New York Tri-State Area, the Southeastern US, and the Rocky Mountain Region.<br/><br/><strong>We are looking for:<br/><br/></strong>We are looking for Production Assistants to join our talent network to be considered for future opportunities onsite in the San Francisco Bay Area, Seattle, WA, and Austin, TX.<br/><br/>This non-exempt role works on a per-project basis. Sometimes projects are one day, sometimes longer.<br/><br/><strong>Job Responsibilities:<br/><br/></strong><ul><li>Perform a wide variety of tasks which relate to productions </li><li>Going on runs if items need to be acquired, picked up, or delivered </li><li>Help to move and set up equipment. </li><li>Wrangling talent </li><li>Assist with catering and craft services </li><li>Perform data entry tasks &amp; keeping paperwork up to date </li><li>Facilitate productions with in-house and out-of-house producers to ensure that resources are used to maximum effect, and with safety always top of mind </li><li>Help execute procedures and policies which enhance the facility </li><li>Orient out of house producers to the resources available in the facility <br/><br/></li></ul><strong>Qualifications &amp; Experience:<br/><br/></strong><ul><li>Minimum 2 years experience in video production, with a preference for at least 1 year experience in a studio based facility </li><li>Ability to interface with both technical and creative members of the production community </li><li>Ability to take a service-oriented approach to this position, with a desire to help clients achieve their best result </li><li>Responsiveness to queries a must, with updates and follow-through </li><li>Outstanding communication &amp; organizational skills,verbal and written </li><li>Basic understanding of video, audio, lighting, and other production technology. </li><li>Friendly and helpful attitude toward talent, colleagues, and clients. </li><li>Willingness to help other team members, often working together to achieve goals. <br/><br/></li></ul><strong>Compensation &amp; Benefits:<br/><br/></strong><em>At Advanced Systems Group LLC, we strive to provide equitable and competitive compensation. Pay is determined by a candidate’s skills, expertise, experience, and the location where the work is being performed. For this role, our current <strong>hourly</strong> pay ranges for new hires in each geographic territory are:<br/><br/>Los Angeles and San Francisco: $35 - 50<br/><br/></em><em>Austin, TX: $26 - 38<br/><br/></em><em>Seattle, WA: <em>$31 - 45<br/><br/></em></em>Advanced Systems Group LLC provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "responsibilities": "<ul><li>Perform a wide variety of tasks which relate to productions </li><li>Going on runs if items need to be acquired, picked up, or delivered </li><li>Help to move and set up equipment. </li><li>Wrangling talent </li><li>Assist with catering and craft services </li><li>Perform data entry tasks &amp; keeping paperwork up to date </li><li>Facilitate productions with in-house and out-of-house producers to ensure that resources are used to maximum effect, and with safety always top of mind </li><li>Help execute procedures and policies which enhance the facility </li><li>Orient out of house producers to the resources available in the facility <br/><br/></li></ul>", "qualifications": {"required": "Minimum 2 years experience in video production, with a preference for at least 1 year experience in a studio based facility, Ability to interface with both technical and creative members of the production community, Ability to take a service-oriented approach to this position, with a desire to help clients achieve their best result, Responsiveness to queries a must, with updates and follow-through, Outstanding communication &amp; organizational skills,verbal and written, Basic understanding of video, audio, lighting, and other production technology., Friendly and helpful attitude toward talent, colleagues, and clients., Willingness to help other team members, often working together to achieve goals."}, "skills": [], "postedDate": "8 months ago", "applicationDeadline": "", "benefits": "At Advanced Systems Group LLC, we strive to provide equitable and competitive compensation. Pay is determined by a candidate’s skills, expertise, experience, and the location where the work is being performed. For this role, our current hourly pay ranges for new hires in each geographic territory are:<br/><br/>Los Angeles and San Francisco: $35 - 50<br/><br/>Austin, TX: $26 - 38<br/><br/>Seattle, WA: $31 - 45<br/><br/>Advanced Systems Group LLC provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3776471501"}