{"jobTitle": "Store Manager", "company": {"name": "Buck Mason", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "75,000.00/yr - 95,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "Buck Mason is looking for a Store Manager that embodies the spirit of Buck Mason culture, customer experience, and lifestyle. A Store Manager must have the four pillars of a Buck Mason Leader: 1) Business Creator, 2) Adaptability, 3) Merchandising & Operations, and 4) Focus & Prioritization. All aspects of the store’s success will depend on the Store Manager's ability to build a team of exceptional associates, execute processes and procedures that help provide a quality shopping experience for all customers, and ensure that the store exceeds defined financial performance targets. Your day-to-day tasks<br/><br/><ul><li>Establish a constant focus on Brand, continually driving engagement, knowledge and passion for the Brand across the store team</li><li>Establish daily store goals as well as individual goals for each team member</li><li>Be a presence leading on the shop floor, acting as a brand ambassador and role modelling Buck Mason behaviors</li><li>Monitor, coach and provide feedback to the store team to deliver excellent guest experience</li><li>Maintain a professional and organized environment, ensuring excellent execution and maintenance of Visual Merchandising guidelines across the store</li><li>Drive the use of digital assets to enhance the customer experience</li><li>Retain and develop talent</li><li>Ask for feedback from store team, peers or superiors</li><li>Lead, inspire and manage a high performing, positive store team</li><li>Continually elevate the capability of the store team through recruitment, staff development, mobility and effective succession planning<br/><br/><br/></li></ul>Who you are<br/><br/><ul><li>Service Focused</li><li>Commercially Aware</li><li>A passion for and interest in fashion, and a luxury ethos</li><li>Flexible to work as required to meet store needs</li><li>A digital awareness and interest, with an ability to comfortably navigate social media and e-commerce sites</li><li>Experience in a Menswear brand or in a Menswear service and selling environment</li><li>Retail Management experience appropriate to the role, to be assessed based on the size and complexity of previous roles. Metrics will include sales turnover and volume and the number and types of roles previously managed<br/><br/><br/></li></ul>Founded in 2013 by Sasha Koehn and Erik Allen Ford, Buck Mason makes simplified clothing for the modern man. At the heart of everything we do is the unclouded California ethos of quality, restraint, and integrity. We take iconic pieces and reconstruct them in hard-wearing fabrics, with timeless details, and the perfect fit. Our goal is to offer fashion that is less complicated, building pared-down essentials that live beyond a single season. With its corporate offices headquartered in Los Angeles, Buck Mason's retail footprint extends from sea to sea, through e-commerce and brick-and-mortar locations in Los Angeles, San Francisco, New York, Brooklyn, and more. Here at Buck Mason, we're all about transparency and fairness, especially when it comes to compensation. While the base salary range for this role is $75k-$95k, your total compensation package will include an annual bonus of no less than 2% of your store's net profit in addition to applicable bonuses.", "responsibilities": "Buck Mason is looking for a Store Manager that embodies the spirit of Buck Mason culture, customer experience, and lifestyle. A Store Manager must have the four pillars of a Buck Mason Leader: 1) Business Creator, 2) Adaptability, 3) Merchandising & Operations, and 4) Focus & Prioritization. All aspects of the store’s success will depend on the Store Manager's ability to build a team of exceptional associates, execute processes and procedures that help provide a quality shopping experience for all customers, and ensure that the store exceeds defined financial performance targets. Your day-to-day tasks<br/><br/><ul><li>Establish a constant focus on Brand, continually driving engagement, knowledge and passion for the Brand across the store team</li><li>Establish daily store goals as well as individual goals for each team member</li><li>Be a presence leading on the shop floor, acting as a brand ambassador and role modelling Buck Mason behaviors</li><li>Monitor, coach and provide feedback to the store team to deliver excellent guest experience</li><li>Maintain a professional and organized environment, ensuring excellent execution and maintenance of Visual Merchandising guidelines across the store</li><li>Drive the use of digital assets to enhance the customer experience</li><li>Retain and develop talent</li><li>Ask for feedback from store team, peers or superiors</li><li>Lead, inspire and manage a high performing, positive store team</li><li>Continually elevate the capability of the store team through recruitment, staff development, mobility and effective succession planning<br/><br/><br/></li></ul>", "qualifications": {"required": "Service Focused, Commercially Aware, A passion for and interest in fashion, and a luxury ethos, Flexible to work as required to meet store needs, A digital awareness and interest, with an ability to comfortably navigate social media and e-commerce sites, Experience in a Menswear brand or in a Menswear service and selling environment, Retail Management experience appropriate to the role, to be assessed based on the size and complexity of previous roles. Metrics will include sales turnover and volume and the number and types of roles previously managed"}, "skills": [], "postedDate": "9 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3777047888"}