{"jobTitle": "Financial Planning Analyst (FP&A), Restaurant and Retail Operations - Eataly LA", "company": {"name": "Eataly", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00 - 85,000.00", "currency": "USD"}, "jobFunction": "Finance", "industry": "Food and Beverage Services", "description": "<strong>Company Description<br/><br/></strong>Eataly is the world’s largest artisanal Italian food and beverage marketplace! Eataly is not a chain; each Eataly is different, with its own character and own theme – but all with the same aim... for our guests to:<br/><br/><ul><li>EAT authentic Italian food at our restaurants, cafés and to-go counters</li><li>SHOP a selection of high-quality Italian, local and homemade products</li><li>LEARN through our classes and our team’s product knowledge<br/><br/><br/></li></ul><strong>Job Description<br/><br/></strong>The Financial Planning Analyst (FP&A) works onsite at an Eataly location and is fully integrated into operations, partnering with leadership to oversee and forecast all lines of the store’s P&amp;L.<br/><br/>The FP&amp;A Analyst serves as an important link between the store and corporate office, reporting directly to the Director of Store Operations and functionally to the Area FP&amp;A Manager and Corporate Director of FP&amp;A.<br/><br/><ul><li>Supports the store’s senior managers and department heads with in-depth analysis related to costs, labor, margins, and sales performance on a daily basis</li><li>Works with store and corporate managers to create reports tailored to the managers’ data and general reporting needs</li><li>Supports Business Planning Analyst with inventory entry and overall inventory management</li><li>Spends time on the floor to always be in touch with operational and business needs</li><li>Collaborates with senior leaders to develop resourceful and creative approaches to improving efficiencies and profit margins to improve Return on Investment (ROI) in all areas of operations</li><li>Educates and trains team members on processes and procedures, ensuring smooth adoption and compliance</li><li>Supports Business Planning Analyst in training team members on Eataly’s in-house sales database, Excel, and PowerPoint</li><li>Performs other duties as required or assigned<br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's Degree, ideally in Accounting, Finance, Business, Economics or Mathematics</li><li>Demonstrated success in financial modeling</li><li>+1 year of experience in an accounting, finance, or operation role</li><li>Advanced Microsoft Excel skills</li><li>PowerPoint skills preferred</li><li>Data-driven mindset and demonstrated success in financial modeling</li><li>Exceptional communication skills and effective presentation skills</li><li>Familiarity with databases, automation or business intelligence preferred</li><li>Passion for and interest in Italian food<br/><br/><br/></li></ul><strong>Job Requirements<br/><br/></strong><ul><li>Open to relocation<br/><br/><br/></li></ul><strong>Additional Information<br/><br/></strong><strong>Benefits and Perks<br/><br/></strong><ul><li>Medical, Dental, Vision Insurance</li><li>Paid Time Off</li><li>Paid Parental Leave</li><li>401K with match or RRSP</li><li>Bonus program</li><li>Free family meal daily</li><li>Discounts at Eataly</li><li>Classes on products and Italian cuisine</li><li>Referral bonus program</li><li>and more!<br/><br/><br/></li></ul>The base pay range for this position is $75,000 - $85,000 per year.<br/><br/>Eataly is an equal employment opportunity employer. It is the Company’s policy to not unlawfully discriminate against any applicant or employee on the basis of race, color, sex, sexual orientation, religion, national origin, age, disability or any other characteristic made unlawful to consider by applicable federal, state, or local laws. Eataly also prohibits harassment of applicants and employees based on any of these protected categories. It is also Eataly’s policy to comply with all applicable federal, state and local laws regarding consideration of unemployment status, salary history, credit/bankruptcy history and criminal background/conviction history in making hiring decisions. If contacted for an employment opportunity, please advise Human Resources if you require accommodation.", "responsibilities": "The Financial Planning Analyst (FP&A) works onsite at an Eataly location and is fully integrated into operations, partnering with leadership to oversee and forecast all lines of the store’s P&amp;L.<br/><br/>The FP&amp;A Analyst serves as an important link between the store and corporate office, reporting directly to the Director of Store Operations and functionally to the Area FP&amp;A Manager and Corporate Director of FP&amp;A.<br/><br/><ul><li>Supports the store’s senior managers and department heads with in-depth analysis related to costs, labor, margins, and sales performance on a daily basis</li><li>Works with store and corporate managers to create reports tailored to the managers’ data and general reporting needs</li><li>Supports Business Planning Analyst with inventory entry and overall inventory management</li><li>Spends time on the floor to always be in touch with operational and business needs</li><li>Collaborates with senior leaders to develop resourceful and creative approaches to improving efficiencies and profit margins to improve Return on Investment (ROI) in all areas of operations</li><li>Educates and trains team members on processes and procedures, ensuring smooth adoption and compliance</li><li>Supports Business Planning Analyst in training team members on Eataly’s in-house sales database, Excel, and PowerPoint</li><li>Performs other duties as required or assigned<br/><br/><br/></li></ul>", "qualifications": {"required": "Bachelor's Degree, ideally in Accounting, Finance, Business, Economics or Mathematics, Demonstrated success in financial modeling, +1 year of experience in an accounting, finance, or operation role, Advanced Microsoft Excel skills, Data-driven mindset and demonstrated success in financial modeling, Exceptional communication skills and effective presentation skills, Familiarity with databases, automation or business intelligence preferred, Passion for and interest in Italian food", "preferred": "PowerPoint skills preferred"}, "skills": ["Financial Modeling", "Microsoft Excel", "PowerPoint", "Data Analysis", "Communication", "Presentation Skills", "Business Intelligence"], "postedDate": "8 months ago", "benefits": "Medical, Dental, Vision Insurance, Paid Time Off, Paid Parental Leave, 401K with match or RRSP, Bonus program, Free family meal daily, Discounts at Eataly, Classes on products and Italian cuisine, Referral bonus program, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3778934321"}