{"jobTitle": "Timely Support Coordinator", "company": {"name": "California State University, Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$4,610.00 - $6,556.00", "currency": "USD"}, "jobFunction": "Information Technology", "industry": "Higher Education", "description": "Job No: 527368; 6/27/2023 (REVISED)<br/><br/>TIMELY SUPPORT COORDINATOR<br/><br/><strong> Student Services Professional II</strong>Center for Academic Success<br/><br/><strong>Salary Range:</strong> $4,610 - $6,556/Monthly<br/><br/><strong>Work Schedule</strong><strong>:</strong> Full-Time, Monday – Friday, 9:00 a.m. to 6:00 p.m.; exempt classification.<br/><br/><strong>Essential Functions</strong><strong>:</strong> The incumbent coordinates the daily operations of Early Alert Support within the Center for Academic Success and assists the Lead Coordinator to coordinate tutoring. In support of Cal State LA’s Grad 2025 goals and the ongoing efforts to eliminate equity gaps the goals of the services provided by the incumbent are to improve the retention and graduation rates by providing students with support in courses with historically low completion rates and to close the graduation gap.. Responsibilities include the following: coordinate Early Alert and oversee outreach efforts stemming from Timely Support data; track and monitor Timely Support submissions and report on data to the Director and faculty; work directly with identified students needing academic support or referrals to additional campus resources; assist in the development of course support modules by partnering with CETL and departments using Canvas and other best practice technologies; maintain regular and systematic communications with faculty teaching the courses served by academic support; provide input into the evaluation of center tutors and student clerical support staff; schedule and coordinate academic support and tutoring sessions; track and report on program utilization and success rates; and providing recommendations for improvement.<br/><br/><strong>Required Qualifications &amp; Experience</strong><strong>:</strong> Equivalent to graduation from a four-year accredited college or university, in a job related field. Additional specialized experience during which the applicant has acquired and successfully applied the knowledge and abilities shown above may substitute for the required education on a year-for-year basis. A master’s degree in a job-related field may be substituted for one year of the professional experience. Equivalent of two years of professional experience in tutoring, supplemental instruction, or applicable academic support; experience should give evidence of competence and indicate the potential for further growth. The candidate must demonstrate excellent written and/or communication and interpersonal skills, including the ability to communicate by phone, email, and in group settings. The incumbent must have the ability to maintain effective work relationships with students, faculty, and staff in a wide range of areas across the university; exercise tact, courtesy, alertness, and good judgment when responding to others; and exercise good judgment; to plan, organize and prioritize work; be able to multi-task; complete assignments in a timely fashion, and work under pressure; candidate must be computer literate and proficient in standard word processing and database software including Microsoft Word, Excel, Outlook and PowerPoint; possess an understanding of standard office procedures; must be proficient in the use of technology and able to use technology to track program data and make recommendations; demonstrate the ability to work effectively under supervision; and must have familiarity with campus student information systems such as GET/PeopleSoft, Learning Management Systems such as Canvas, website development and maintenance, and online tutoring platforms. The incumbent must have a demonstrated interest and/or ability to work in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the California State University. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current California State University employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California.<br/><br/>As of January 1, 2022 the <strong>CSU Out-of-State Employment Policy</strong> prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/><strong>Desired Qualifications</strong><strong>:</strong> Previous experience working in the CSU system; demonstrated successful experience in promoting or supporting student retention and success; knowledge of Cal CSU policies, priorities, and procedures.<br/><br/><strong>Closing Date</strong> <strong>:</strong> Review of applications will begin on July 11, 2023 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A COMPLETED ON-LINE CAL STATE LA EMPLOYMENT APPLICATION IS REQUIRED. RESUMES WILL NOT BE ACCEPTED IN LIEU OF A COMPLETED APPLICATION.<br/><br/>The person holding this position is considered a \"mandated reporter\" under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 revised July 21, 2017, as a condition of employment.<br/><br/>In addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.<br/><br/>Candidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.<br/><br/><strong>To Obtain Employment Information For The Impaired Call<br/><br/></strong>TDD Line (323) 343-3670<br/><br/>24-hour Dial-A-Job Line (323) 343-3678", "responsibilities": "The incumbent coordinates the daily operations of Early Alert Support within the Center for Academic Success and assists the Lead Coordinator to coordinate tutoring. In support of Cal State LA’s Grad 2025 goals and the ongoing efforts to eliminate equity gaps the goals of the services provided by the incumbent are to improve the retention and graduation rates by providing students with support in courses with historically low completion rates and to close the graduation gap.. Responsibilities include the following: coordinate Early Alert and oversee outreach efforts stemming from Timely Support data; track and monitor Timely Support submissions and report on data to the Director and faculty; work directly with identified students needing academic support or referrals to additional campus resources; assist in the development of course support modules by partnering with CETL and departments using Canvas and other best practice technologies; maintain regular and systematic communications with faculty teaching the courses served by academic support; provide input into the evaluation of center tutors and student clerical support staff; schedule and coordinate academic support and tutoring sessions; track and report on program utilization and success rates; and providing recommendations for improvement.", "qualifications": {"required": "Equivalent to graduation from a four-year accredited college or university, in a job related field. Additional specialized experience during which the applicant has acquired and successfully applied the knowledge and abilities shown above may substitute for the required education on a year-for-year basis. A master’s degree in a job-related field may be substituted for one year of the professional experience. Equivalent of two years of professional experience in tutoring, supplemental instruction, or applicable academic support; experience should give evidence of competence and indicate the potential for further growth. The candidate must demonstrate excellent written and/or communication and interpersonal skills, including the ability to communicate by phone, email, and in group settings. The incumbent must have the ability to maintain effective work relationships with students, faculty, and staff in a wide range of areas across the university; exercise tact, courtesy, alertness, and good judgment when responding to others; and exercise good judgment; to plan, organize and prioritize work; be able to multi-task; complete assignments in a timely fashion, and work under pressure; candidate must be computer literate and proficient in standard word processing and database software including Microsoft Word, Excel, Outlook and PowerPoint; possess an understanding of standard office procedures; must be proficient in the use of technology and able to use technology to track program data and make recommendations; demonstrate the ability to work effectively under supervision; and must have familiarity with campus student information systems such as GET/PeopleSoft, Learning Management Systems such as Canvas, website development and maintenance, and online tutoring platforms. The incumbent must have a demonstrated interest and/or ability to work in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the California State University. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current California State University employees who may apply for the position.", "preferred": "Previous experience working in the CSU system; demonstrated successful experience in promoting or supporting student retention and success; knowledge of Cal CSU policies, priorities, and procedures."}, "skills": ["Microsoft Word", "Excel", "Outlook", "PowerPoint", "Canvas", "Tutoring", "Supplemental Instruction", "Academic Support", "Communication", "Interpersonal Skills", "Technology", "Student Information Systems", "Learning Management Systems", "Website Development", "Online Tutoring Platforms", "Multicultural/Multiethnic Environment"], "postedDate": "8 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3779837488"}