{"jobTitle": "Accountant III", "company": {"name": "California State University, Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$5,504.00 - $10,622.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Higher Education", "description": "Job No: 527200; 03/27/2024 – Re-announced<br/><br/>Accountant III<br/><br/><strong>Accountant III<br/><br/></strong>Controller's Office<br/><br/><strong>Salary Range</strong><strong>:</strong> $5,504 - $10,622/Monthly (Budgeted Hiring Salary Range: $5,504 - $7,500/Monthly)<br/><br/><strong>Work Schedule</strong><strong>:</strong> Full-Time, Monday - Friday, 8:00 a.m. to 5:00 p.m.; exempt classification.<br/><br/><strong>Essential Functions</strong><strong>:</strong> Under the general supervision of the Assistant Controller, the incumbent performs professional accounting work requiring advanced knowledge and understanding of generally accepted accounting principles and practices. The incumbent is responsible for the generation of routine financial reports and statements, maintenance, analysis, reconciliation, and resolution of outstanding items related to assigned accounts; performs analysis and reconciliation of general ledger and subsidiary ledger accounts; prepares monthly and year-end journal entries; researches and resolves discrepancies in account and fund balances; ongoing reconciliation of capital asset and CWIP; identifies actual or potential problems with financial transactions and recommends corrective action ; and assists in the year-end Legal and GAAP and reporting and PBC schedules. The position also participates in developing and documenting accounting procedures, implementing system and procedural changes, and provides assistance to other employees.<br/><br/><strong>Required Qualifications &amp; Experience</strong><strong>:</strong> Incumbent must possess: the equivalent to a bachelor’s degree with a major in accounting, business administration, finance or a closely related field OR a combination of education and experience which provides the required knowledge and abilities; equivalent to five years of professional level accounting experience; and advanced knowledge of Microsoft Office suite, particularly MS Excel. Incumbent must have the ability to: independently interpret applicable rules, regulations, policies and procedures, and apply accounting theory and practices based on generally accepted accounting principles (GAAP); and prepare reconciliations and to investigate and resolve errors, discrepancies, make correcting entries. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022 the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/><strong>Desired Qualifications</strong><strong>:</strong> General knowledge of governmental accounting and internal control methods and related laws, rules, and regulations; PeopleSoft Financials (Student Financials and GL Modules); higher education experience; five years of prior accounting experience in a higher education or not-for-profit environment; possession of superb verbal, written, and interpersonal skills and have outstanding persuasion and presentation skills; and ability to be an articulate communicator and good listener and demonstrate a style that facilitates the sharing of knowledge is preferred.<br/><br/><strong>Closing Date</strong><strong>:</strong> Review of applications will begin on 4/10/2024 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A COMPLETED ON-LINE CAL STATE LA EMPLOYMENT APPLICATION IS REQUIRED. RESUMES WILL NOT BE ACCEPTED IN LIEU OF A COMPLETED APPLICATION.<br/><br/>The person holding this position is considered a \"mandated reporter\" under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 revised July 21, 2017, as a condition of employment.<br/><br/>In addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.<br/><br/>Candidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.<br/><br/><strong>To Obtain Employment Information For The Impaired Call<br/><br/></strong>TDD Line (323) 343-3670<br/><br/>24-hour Dial-A-Job Line (323) 343-3678", "responsibilities": "Under the general supervision of the Assistant Controller, the incumbent performs professional accounting work requiring advanced knowledge and understanding of generally accepted accounting principles and practices. The incumbent is responsible for the generation of routine financial reports and statements, maintenance, analysis, reconciliation, and resolution of outstanding items related to assigned accounts; performs analysis and reconciliation of general ledger and subsidiary ledger accounts; prepares monthly and year-end journal entries; researches and resolves discrepancies in account and fund balances; ongoing reconciliation of capital asset and CWIP; identifies actual or potential problems with financial transactions and recommends corrective action ; and assists in the year-end Legal and GAAP and reporting and PBC schedules. The position also participates in developing and documenting accounting procedures, implementing system and procedural changes, and provides assistance to other employees.", "qualifications": {"required": "Incumbent must possess: the equivalent to a bachelor’s degree with a major in accounting, business administration, finance or a closely related field OR a combination of education and experience which provides the required knowledge and abilities; equivalent to five years of professional level accounting experience; and advanced knowledge of Microsoft Office suite, particularly MS Excel. Incumbent must have the ability to: independently interpret applicable rules, regulations, policies and procedures, and apply accounting theory and practices based on generally accepted accounting principles (GAAP); and prepare reconciliations and to investigate and resolve errors, discrepancies, make correcting entries. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.", "preferred": "General knowledge of governmental accounting and internal control methods and related laws, rules, and regulations; PeopleSoft Financials (Student Financials and GL Modules); higher education experience; five years of prior accounting experience in a higher education or not-for-profit environment; possession of superb verbal, written, and interpersonal skills and have outstanding persuasion and presentation skills; and ability to be an articulate communicator and good listener and demonstrate a style that facilitates the sharing of knowledge is preferred."}, "skills": ["Microsoft Office", "Excel", "GAAP", "Accounting", "Financial Reporting", "Governmental Accounting", "Internal Control", "PeopleSoft Financials", "Higher Education"], "postedDate": "8 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3779839574"}