{"jobTitle": "Warehouse Supervisor", "company": {"name": "Floor & Decor", "location": "Fullerton, CA"}, "location": "Fullerton, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "<strong>Pay Range<br/><br/></strong>$18.25 - $25.75<br/><br/>PURPOSE<br/><br/>The Warehouse Supervisor is responsible for directing and overseeing the warehouse operations of each retail store. In addition, the Warehouse Supervisor is responsible for supervising warehouse specialists, order pickers and forklift operators; will support the Receiving Supervisor in managing the daily freight schedule based on customer and inventory needs.<br/><br/><strong>Major Responsibilities<br/><br/></strong><ul><li>Responsible for the daily scheduling of warehouse personnel to ensure proper manning in order to ship and receive products at the store in a productive and cost-efficient manner</li><li>Direct the day-to-day activities of the warehouse. Such activities include shipping, receiving, maintenance, inventory control, etc.</li><li>Responsible for the warehouse as it pertains to Storage Buy transactions, receiving errors, and staging of products</li><li>Responsible for maintenance of warehouse equipment, providing both preventive maintenance programs and communicating all necessary repairs to CEM and/or Operations Manager. Ensure that the warehouse personnel have safe, efficient equipment in order to perform the distribution functions</li><li>Responsible for warehouse safety programs in order to provide a safe and clean workplace for employees and within the regulations of all OSHA local and state regulations</li><li>Ensure all associates are trained and following all standard operating procedures</li><li>Responsible for the progressive disciplinary process in the area of counseling, oral and written warnings; ensures a productive labor climate in the warehouse operation</li><li>Handle general employee inquiries and solves problems</li><li>Coordinate with other departments to facilitate efficient warehouse operations</li><li>Complete necessary Activity Reports for management</li><li>Monitor the flow of paperwork from Receiving to Inventory Control Specialist for timely data entry</li><li>Resolve discrepancies with shipping, invoices, packing slips, and receiver reports</li><li>Responsible for the execution of the Storage Buy Audit COP. </li><li>Ensure products are staged for counting and inspection</li><li>Ensure products are stored properly to conserve space and comply with safety procedures</li><li>Oversee the rotation of inventories within the warehouse</li><li>Perform other related duties as directed by management<br/><br/></li></ul><strong>Minimum Eligibility Requirements<br/><br/></strong><ul><li>1-3 years of previous supervisory experience required (preferably in a warehouse or distribution center environment)</li><li>Excellent interpersonal, team building, delegating and follow-up skills</li><li>Ability to work with and maintain effective working relationships with other departments in the company</li><li>Effective communication skills (oral and written)</li><li>Competent in performing basic mathematical calculations </li><li>Strong computer skills, with the ability to work in Windows-based systems</li><li>Ability to work in a fast paced environment and meet established deadlines</li><li>Available to work extended hours, especially during peak seasons<br/><br/></li></ul>WORKING CONDITIONS (TRAVEL, HOURS, ENVIRONMENT)<br/><br/><ul><li>While performing the duties of this job, the employee is frequently exposed to a warehouse environment and moving vehicles. The noise level in the work environment is typically moderate to noisy.<br/><br/></li></ul><strong>Physical/Sensory Requirements<br/><br/></strong>Physical Work – Ability exert 30 – 60 pounds of force occasionally, and or 20-30 pounds of force frequently, and/or greater than negligible up to 20 pounds of force constantly to lift, carry push, pull, or otherwise move objects. The employee is often required to use their hands and fingers, to handle or feel. The employee is frequently required to stand, walk, reach with arms and hands, climb or balance, and to stoop, kneel, crouch or crawl.<br/><br/>NOTE: All duties and responsibilities listed are considered to be essential job functions and requirements, and are subject to possible modification to reasonably accommodate individuals with disabilities. Marginal functions of the position (those that are incidental to the performance of fundamental job duties) have not been included. However, the omission of specific statements of duties does not exclude them from the position if the work is similar, related or logical assignment to the position.<br/><br/>This job description does not constitute an employment agreement between the employer and the employee, and is subject to change by the employer as the needs of the business and requirement of the job change.<br/><br/><strong>Store Hours<br/><br/></strong>Monday - Friday 7:00 AM - 7:00 PM<br/><br/>Saturday 8:00 AM - 7:00 PM<br/><br/>Sunday 10:00 AM - 6:00 PM<br/><br/><strong>Benefits &amp; Rewards<br/><br/></strong><ul><li>Bonus opportunities at every level</li><li>Career advancement opportunities</li><li>Relocation opportunities across the country</li><li>401k with discretionary company match</li><li>Employee Stock Purchase Plan</li><li>Referral Bonus Program</li><li>A personal holiday and Volunteer Time Off program</li><li>Medical, Dental, Vision, Life and other Insurance Plans (subject to eligibility criteria)<br/><br/></li></ul><strong>Equal Employment Opportunity<br/><br/></strong>Floor &amp; Decor provides equal employment opportunities to all associates and applicants without regard to age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, disability, veteran status, genetic information, ethnicity, citizenship, or any other category protected by law.<br/><br/>This policy applies to all areas of employment, including recruitment, testing, screening, hiring, selection for training, upgrading, transfer, demotion, layoff, discipline, termination, compensation, benefits and all other privileges, terms and conditions of employment. This policy and the law prohibit employment discrimination against any associate or applicant on the basis of any legally protected status outlined above.<br/><br/><strong>R027028</strong>", "responsibilities": "The Warehouse Supervisor is responsible for directing and overseeing the warehouse operations of each retail store. In addition, the Warehouse Supervisor is responsible for supervising warehouse specialists, order pickers and forklift operators; will support the Receiving Supervisor in managing the daily freight schedule based on customer and inventory needs.", "qualifications": {"required": "1-3 years of previous supervisory experience required (preferably in a warehouse or distribution center environment), Excellent interpersonal, team building, delegating and follow-up skills, Ability to work with and maintain effective working relationships with other departments in the company, Effective communication skills (oral and written), Competent in performing basic mathematical calculations , Strong computer skills, with the ability to work in Windows-based systems, Ability to work in a fast paced environment and meet established deadlines, Available to work extended hours, especially during peak seasons", "preferred": ""}, "skills": [], "postedDate": "2 days ago", "benefits": "Bonus opportunities at every level, Career advancement opportunities, Relocation opportunities across the country, 401k with discretionary company match, Employee Stock Purchase Plan, Referral Bonus Program, A personal holiday and Volunteer Time Off program, Medical, Dental, Vision, Life and other Insurance Plans (subject to eligibility criteria)", "remoteWork": "No", "salary": {"amount": "18.25 - 25.75", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3784789712"}