{"jobTitle": "The Children's Collective, Inc. - Executive Director", "company": {"name": "Envision Consulting, LLC", "industry": "Technology, Information and Internet", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$170,000.00 - $205,000.00", "currency": "USD"}, "jobFunction": "Other", "industry": "Technology, Information and Internet", "description": "EXECUTIVE DIRECTOR\n\nABOUT THE CHILDREN'S COLLECTIVE INC. (SEE CANDIDATE PROFILE)\n\nThe Children's Collective Inc.'s (TCCI) mission is to improve educational, economic, social and health outcomes for children, youth and adults through programs in child development, youth development, family support and health. Serving more than 4800 low income, minority clients each year, program services are provided at 15 locations in South Los Angeles. The staff of 120 is culturally, linguistically and experientially similar to the community it serves. Many of the staff have worked for The Children's Collective, Inc. for 15-20 years, honing their skills and improving their lives as well as the lives of others.\n\nTCCI has been a crucial and uplifting part of the communities they have served for over 50 years. Over the years, the organization has created a culture of care, learning and inclusion. The Children's Collective, Inc. provides both immediate assistance to people in need and creates the foundation for future success. Most services are free. The Children's Collective, Inc. is proud that it has raised and invested more than $200 million in the children and families of its community.\n\nABOUT THE POSITION \n\nReporting to the Board of Directors, TCCI is seeking an experienced, growth-minded executive leader to carry on the legacy of their founder and outgoing Executive Director. A clear and decisive communicator, this leader will maintain internal and external relationships, and continue developing critical community partnerships in Los Angeles County. Overseeing an annual budget of $11M and more than 120 passionate and committed professionals, the ideal candidate is an adaptable and approachable leader who advances the organization's mission in the community. The incoming Executive Director will continue to foster and empower the team while looking for opportunities to improve programs, policies, and organizational culture.\n\nThe Executive Director (ED) should have a history of working in the field of child and family services in underserved communities. The ED will lead strategic planning for the agency and diversify funding with a focus on establishing a major donor program and seeking new funding sources as well as continuing relationships with existing funders and community partners. The ideal candidate has a passion for working with underserved communities and a strong understanding of the funding and political landscape impacting individuals experiencing poverty.\n\nROLES AND RESPONSIBILITIES\n\nOrganizational Leadership\n\n- Oversee operations of The Children's Collective, Inc. including administration, programming, development, human resources, and finance management.\n- Oversee contract implementation, expansion, and compliance with various government contracts.\n- Identify, assess, and inform the Board of Directors of internal and external issues that affect the organization, including organizational relevance to the community and its overall effectiveness.\n- Cultivate a work environment that recruits, retains, and supports quality staff and provides an opportunity for staff professional development and improved organizational culture.\n- Works closely with the Board Chair and Executive Committee (Board officers) to oversee and support Board functions, including planning meeting agendas, retreats, committee meetings, committee reports, and board member recruitment.\n- Access and recommend improved policies, systems, and procedures.\n\nStrategic Planning/Programming\n\n- Work with the Board and senior staff to plan and implement agency growth and capacity expansion.\n- Work with the Board and senior staff to drive and implement the strategic plan and vision of TCCI.\n- Seek programming growth and new opportunities that respond to the needs of the communities that TCCI serves.\n- Work with the Board of Directors to maximize board capacity.\n\nFund Development & Financial Management\n\n- In collaboration with the Board of Directors and development team, lead all fundraising efforts.\n- Update existing fundraising plan to attract new donors, establish a major donor program, and prospect for new corporate and foundation support.\n- Create and cultivate relationships with new donors and prospective Board members.\n- Ensure financial stability and sustainability by maintaining healthy cash flow and adequate reserves. \n- Supervise financial planning, forecasting, and analytical activities, ensuring alignment of the financial plan, strategy, and short and long-term goals. \n- Establish a fund development department.\n\nCommunity Engagement\n\n- Serve as chief spokesperson of TCCI to constituents, the media, local politicians, and the general public.\n- Develop and maintain beneficial relationships with elected officials, peer organizations, and community partners.\n- Serve as an advocate for child and family interests at a policy and planning level.\n- Work with communications staff to develop a communications strategy for branding and marketing in multiple media markets to enhance TCCI's visibility.\n- Meet with participants, volunteers, donors, and the greater community to improve services and generate community involvement.\n\nQUALIFICATIONS\n\n- A minimum of eight (8) years of experience in progressively responsible roles within a nonprofit agency.\n- Five (5) years of experience in the field of child and family services, including demonstrated expertise in staff management.\n- Visible involvement and participation in child and family advocacy.\n- A business mindset with a proven track record managing a strategic planning process, resulting in improved efficiency, program effectiveness, and sustainability of organizational budget.\n- Demonstrated fundraising success with individual donors, foundations, and corporate partnerships resulting in overall organizational growth.\n- Demonstrated commitment to continued professional growth and development of employees and Board members.\n- Previous experience effectively communicating mission to diverse audiences.\n- Passion for providing educational resources and essential support for the underserved in the community.\n- Experience working closely with the South Los Angeles community is a plus.\n\nCOMPENSATION & BENEFITS\n\nThis is an exempt full-time position. The salary range is $170,000 - $205,000 and includes a comprehensive benefits package (i.e. healthcare, dental, vision, and retirement).", "responsibilities": "Organizational Leadership\n- Oversee operations of The Children's Collective, Inc. including administration, programming, development, human resources, and finance management.\n- Oversee contract implementation, expansion, and compliance with various government contracts.\n- Identify, assess, and inform the Board of Directors of internal and external issues that affect the organization, including organizational relevance to the community and its overall effectiveness.\n- Cultivate a work environment that recruits, retains, and supports quality staff and provides an opportunity for staff professional development and improved organizational culture.\n- Works closely with the Board Chair and Executive Committee (Board officers) to oversee and support Board functions, including planning meeting agendas, retreats, committee meetings, committee reports, and board member recruitment.\n- Access and recommend improved policies, systems, and procedures.\n\nStrategic Planning/Programming\n- Work with the Board and senior staff to plan and implement agency growth and capacity expansion.\n- Work with the Board and senior staff to drive and implement the strategic plan and vision of TCCI.\n- Seek programming growth and new opportunities that respond to the needs of the communities that TCCI serves.\n- Work with the Board of Directors to maximize board capacity.\n\nFund Development & Financial Management\n- In collaboration with the Board of Directors and development team, lead all fundraising efforts.\n- Update existing fundraising plan to attract new donors, establish a major donor program, and prospect for new corporate and foundation support.\n- Create and cultivate relationships with new donors and prospective Board members.\n- Ensure financial stability and sustainability by maintaining healthy cash flow and adequate reserves. \n- Supervise financial planning, forecasting, and analytical activities, ensuring alignment of the financial plan, strategy, and short and long-term goals. \n- Establish a fund development department.\n\nCommunity Engagement\n- Serve as chief spokesperson of TCCI to constituents, the media, local politicians, and the general public.\n- Develop and maintain beneficial relationships with elected officials, peer organizations, and community partners.\n- Serve as an advocate for child and family interests at a policy and planning level.\n- Work with communications staff to develop a communications strategy for branding and marketing in multiple media markets to enhance TCCI's visibility.\n- Meet with participants, volunteers, donors, and the greater community to improve services and generate community involvement.", "qualifications": {"required": "A minimum of eight (8) years of experience in progressively responsible roles within a nonprofit agency. Five (5) years of experience in the field of child and family services, including demonstrated expertise in staff management. Visible involvement and participation in child and family advocacy. A business mindset with a proven track record managing a strategic planning process, resulting in improved efficiency, program effectiveness, and sustainability of organizational budget. Demonstrated fundraising success with individual donors, foundations, and corporate partnerships resulting in overall organizational growth. Demonstrated commitment to continued professional growth and development of employees and Board members. Previous experience effectively communicating mission to diverse audiences. Passion for providing educational resources and essential support for the underserved in the community. Experience working closely with the South Los Angeles community is a plus.", "preferred": ""}, "skills": [], "postedDate": "8 months ago", "applicationDeadline": "Not specified", "benefits": "This is an exempt full-time position. The salary range is $170,000 - $205,000 and includes a comprehensive benefits package (i.e. healthcare, dental, vision, and retirement).", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3785762569"}