{"jobTitle": "Interior Designer | Intermediate", "company": {"name": "RH", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$26.00/hr - $45.00/hr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Design Services, Hospitality, and Furniture and Home Furnishings Manufacturing", "description": "RH at its core is about taste, and we believe the idea of scaling taste is large and far reaching.<br/><br/>The RH brand attracts the best designers, artisans, manufacturers and talent in our industry, scaling and rendering their work more valuable across our integrated platform, enabling us to curate the most compelling collection of luxury home furnishings in the world. We are moving the brand beyond curating and selling products to conceptualizing and selling spaces by building an ecosystem of products, places, services and spaces that elevates and establishes the RH brand as a global thought leader, taste and place maker.<br/><br/>At RH we believe deeply that the \"right\" people are our greatest asset. We value people with high energy, who possess the ability to energize others. People who are smart, creative and have a point of view. People who see the answer in every problem, versus those who see the problem in every answer. People who are driven, determined and won't take \"no\" for an answer. We value team players, people who are more concerned with what's right, rather than who's right.<br/><br/>RH Interior Designers play an integral role in providing design services to walk-in clientele within an RH Gallery. They will work in collaboration with Lead Designers and Gallery Leadership. They are innovators with an entrepreneurial spirit and a passion for establishing and fostering relationships.<br/><br/><strong>Your Responsibilities<br/><br/></strong><ul><li>Live Our Vision, Values and Beliefs every day</li><li>Provide a luxury experience for our clientele through RH Interior Design services</li><li>Master and execute the RH Design ethos for residential interior design</li><li>Provide design expertise and execute small-scale design projects</li><li>Support with large-scale projects in partnership with the Interior Design team</li><li>Produce brand-appropriate design presentations and communicate design concepts, space planning and product selections</li><li>Own all phases of the client experience from consultations through delivery and site visits</li><li>Ensure fiscal goals are achieved</li><li>Represent the RH lifestyle brand through communication, personal appearance and professionalism</li><li>Maintain a strong interest in the luxury and design industry</li><li>Support the visual and quality standards within the Gallery<br/><br/></li></ul><strong>Our Requirements<br/><br/></strong><ul><li>2+ years design experience within a design firm or high-end furniture and luxury retail preferred</li><li>Art, Architecture or Interior Design or similar degree preferred</li><li>Professional portfolio required</li><li>Hands-on interior installation experience preferred</li><li>Proficiency in AutoCAD, Adobe Creative Suite, and other related space planning/rendering programs preferred</li><li>Strong artistic skills, including hand rendering and sketching capabilities preferred</li><li>Strategic, highly organized and results-oriented</li><li>Commitment to Quality with exceptional attention to detail </li><li>Possess an entrepreneurial spirit and a passion for building a thriving interior design business</li><li>Excellent verbal and written communication skills</li><li>Proficiency with Mac Operating System, IOS devices, Microsoft Office and Google Applications<br/><br/></li></ul><strong>Our Physical Requirements<br/><br/></strong><ul><li>Ability to lift and mobilize small to medium items up to 25 lbs. while utilizing appropriate equipment and techniques</li><li>Ability to maneuver effectively around gallery floor, stock room and office</li><li>Position entails prolonged standing, twisting, stooping, kneeling, squatting, bending and climbing</li><li>Licensed to drive preferred</li><li>Ability to travel locally or out of state<br/><br/></li></ul><strong>About Us<br/><br/></strong>RH is an equal opportunity employer and does not discriminate against any applicant on the basis of race, color, religion, national origin, gender, marital status, age, disability, sexual orientation, military/veteran status, or any other status protected by federal or state law or local ordinance.<br/><br/>At RH, we are committed to promoting pay equity. Rate of pay is determined based on each individual's experience, qualifications, and the geographic location of the role.", "responsibilities": "RH Interior Designers play an integral role in providing design services to walk-in clientele within an RH Gallery. They will work in collaboration with Lead Designers and Gallery Leadership. They are innovators with an entrepreneurial spirit and a passion for establishing and fostering relationships.<br/><br/><strong>Your Responsibilities<br/><br/></strong><ul><li>Live Our Vision, Values and Beliefs every day</li><li>Provide a luxury experience for our clientele through RH Interior Design services</li><li>Master and execute the RH Design ethos for residential interior design</li><li>Provide design expertise and execute small-scale design projects</li><li>Support with large-scale projects in partnership with the Interior Design team</li><li>Produce brand-appropriate design presentations and communicate design concepts, space planning and product selections</li><li>Own all phases of the client experience from consultations through delivery and site visits</li><li>Ensure fiscal goals are achieved</li><li>Represent the RH lifestyle brand through communication, personal appearance and professionalism</li><li>Maintain a strong interest in the luxury and design industry</li><li>Support the visual and quality standards within the Gallery<br/><br/></li></ul>", "qualifications": {"required": "2+ years design experience within a design firm or high-end furniture and luxury retail preferred, Art, Architecture or Interior Design or similar degree preferred, Professional portfolio required, Hands-on interior installation experience preferred, Proficiency in AutoCAD, Adobe Creative Suite, and other related space planning/rendering programs preferred, Strong artistic skills, including hand rendering and sketching capabilities preferred, Strategic, highly organized and results-oriented, Commitment to Quality with exceptional attention to detail, Possess an entrepreneurial spirit and a passion for building a thriving interior design business, Excellent verbal and written communication skills, Proficiency with Mac Operating System, IOS devices, Microsoft Office and Google Applications", "preferred": "Ability to lift and mobilize small to medium items up to 25 lbs. while utilizing appropriate equipment and techniques, Ability to maneuver effectively around gallery floor, stock room and office, Position entails prolonged standing, twisting, stooping, kneeling, squatting, bending and climbing, Licensed to drive preferred, Ability to travel locally or out of state"}, "skills": ["Interior Design", "AutoCAD", "Adobe Creative Suite", "Space Planning", "Rendering", "Artistic Skills", "Hand Rendering", "Sketching", "Strategic Thinking", "Organization", "Results-Oriented", "Quality Assurance", "Entrepreneurial Spirit", "Communication", "Mac OS", "IOS Devices", "Microsoft Office", "Google Applications"], "postedDate": "14 hours ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3785675125"}