{"jobTitle": "Section Manager III - Procurement & Contracts", "company": {"name": "Orange County Transportation Authority", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Transportation/Trucking/Railroad", "description": "<strong>Job Description<br/><br/></strong><strong>Overview <br/><br/></strong><strong>Why OCTA<br/><br/></strong>Discover work that moves you in a dynamic and innovative setting. Be part of a team delivering Orange County’s transportation network of today and creating a vision for the future.<br/><br/>OCTA is the county’s transportation planning commission and public transit operator. With a focus on safety and accountability, we plan, fund, and implement countywide projects that include bus and rail transit, freeways and express lanes, rideshare, microtransit, paratransit, active transportation, and environmental programs.<br/><br/>We’re passionate about creating a balanced, equitable and sustainable transportation system that reflects the diverse travel needs of the county’s 34 cities and 3.2 million residents.<br/><br/>Our employees rated OCTA as a top workplace in Orange County. Come join us on our mission of keeping Orange County moving.<br/><br/><strong>Overview<br/><br/></strong>Under general guidance, supervises the procurement of goods and services through the use of procurement teams assigned to specific Divisions/Departments. Procurements may include acquisition of commodities, consultant services, public works construction, contract transportation, and other external goods and services.<br/><br/>This is an exempt position in Salary Grade 235: Min $127,545.00 – Mid $153,054.00 – Max $178,563.00 annually. The starting salary will be within this range based on qualifications.<br/><br/><strong>The position will remain open until a candidate is selected.<br/><br/></strong><strong>Responsibilities<br/><br/></strong><em>This list is intended to indicate the general nature and level of work performed by employees within this classification and is not designed to be interpreted as an exhaustive listing of all tasks required of employees assigned to this job.<br/><br/></em><ul><li>Ensures agency compliance with the rulings and decisions of appropriate administrative and judicial authorities pertaining to procurement practices (such as Federal Acquisition Regulations). </li><li>Ensures agency compliance with procurement requirements and regulations of funding agencies for grant fund usage. Acts as key agency resource for procurement information. </li><li>Ensures appropriate procurement practices and policies are defined, updated as necessary, and adhered to by the procurement staff. </li><li>Assigns staff to procurement teams. Evaluates and modifies the procurement teams to balance workloads. Ensures procurement teams have prepared procurement schedules. </li><li>Ensures the procurement team members receive appropriate and on-going training in the areas of procurement, inter personal skills, planning, and basic accounting principles. Supervises the performance and development of staff, including recruiting, career development, discipline, and performance evaluation issues. </li><li>Ensures that agency departments and the procurement teams are communicating effectively. </li><li>Seeks methods and tools to improve service while reducing costs. </li><li>Ensures that the established Disadvantaged Business Enterprise (DBE) and small business goals are being actively pursued by the teams. </li><li>Plans and conducts procurement quality assurance reviews and implements changes as appropriate. Reviews procurement files for conformance and compliance with federal requirements.</li><li>Stays informed of developments in the field. Establishes and maintains network of professional contacts.</li><li>Prepares management reports.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Any combination of education and experience equivalent to a bachelor's degree in Business Administration or related field with a minimum of approximately six years progressively responsible experience in procurement and contracts, three years of which are management.<br/><br/><strong>Knowledge Of<br/><br/></strong><ul><li>Public contracting principles, including proposal preparation, contract negotiation, contract law, and finance. </li><li>Federal and California State laws applicable to contracts and procurement.</li><li>Federal Acquisition Regulations.</li><li>Purchasing principles such as the UCC. </li><li>Use of personal computers to enhance productivity, electronic mail, word processing, and spreadsheets.</li><li>Accounting principles.<br/><br/></li></ul><strong>Ability To<br/><br/></strong><ul><li>Negotiate contracts and develop negotiating strategies.</li><li>Interpret and apply contract principles.</li><li>Analyze supplier and agency requirements and prepare contract clauses which will protect agency while accommodating the supplier's needs.</li><li>Supervise, organize, and coordinate the work of others.<br/><br/></li></ul><strong>Working Conditions/Physical Activities<br/><br/></strong><em>(The physical demands described are representative of those that must be met by the employee to successfully perform the essential functions of this job. OCTA provides reasonable accommodation to enable individuals with disabilities to perform the essential functions.)<br/><br/></em><strong>Positions In This Class Typically Require<br/><br/></strong><ul><li>Work may be performed in a stressful, fast-paced office environment, depending upon assignment.</li><li>Requires ability to understand verbal communication and to respond effectively.</li><li>Positions in this class typically require: Reaching, Finger Dexterity, Grasping, Feeling, Talking, Hearing, Seeing, and Repetitive Motions in computer use.<br/><br/></li></ul><strong>Compensation And Benefits<br/><br/></strong>OCTA offers an attractive compensation and benefits package that includes medical, dental and vision health insurance programs, flex time (may be available), paid sick leave, paid vacation and holidays, short-term and long-term disability, life insurance, flexible spending accounts, retirement, deferred compensation plan, educational reimbursement, excellent in-house training programs, free transportation passes for the employee and dependents, wellness and ergonomic programs, and much more. OCTA has a hybrid remote work program. Eligibility is dependent on manager’s approval.<br/><br/><strong>OCTA is an equal employment opportunity employer that recruits, hires, and promotes qualified people without regard to race, color, religion, creed, ancestry, national origin, age, sex, pregnancy, gender, gender identity and/or expression, sexual orientation, marital status, medical condition, disability, genetic information, military and veteran status, or other legally protected status.</strong>", "responsibilities": "<em>This list is intended to indicate the general nature and level of work performed by employees within this classification and is not designed to be interpreted as an exhaustive listing of all tasks required of employees assigned to this job.<br/><br/></em><ul><li>Ensures agency compliance with the rulings and decisions of appropriate administrative and judicial authorities pertaining to procurement practices (such as Federal Acquisition Regulations). </li><li>Ensures agency compliance with procurement requirements and regulations of funding agencies for grant fund usage. Acts as key agency resource for procurement information. </li><li>Ensures appropriate procurement practices and policies are defined, updated as necessary, and adhered to by the procurement staff. </li><li>Assigns staff to procurement teams. Evaluates and modifies the procurement teams to balance workloads. Ensures procurement teams have prepared procurement schedules. </li><li>Ensures the procurement team members receive appropriate and on-going training in the areas of procurement, inter personal skills, planning, and basic accounting principles. Supervises the performance and development of staff, including recruiting, career development, discipline, and performance evaluation issues. </li><li>Ensures that agency departments and the procurement teams are communicating effectively. </li><li>Seeks methods and tools to improve service while reducing costs. </li><li>Ensures that the established Disadvantaged Business Enterprise (DBE) and small business goals are being actively pursued by the teams. </li><li>Plans and conducts procurement quality assurance reviews and implements changes as appropriate. Reviews procurement files for conformance and compliance with federal requirements.</li><li>Stays informed of developments in the field. Establishes and maintains network of professional contacts.</li><li>Prepares management reports.<br/><br/></li></ul>", "qualifications": {"required": "Any combination of education and experience equivalent to a bachelor's degree in Business Administration or related field with a minimum of approximately six years progressively responsible experience in procurement and contracts, three years of which are management.", "preferred": null}, "skills": ["Federal Acquisition Regulations", "Contract Negotiation", "Contract Law", "Procurement", "Public Contracting"], "postedDate": "8 months ago", "benefits": "OCTA offers an attractive compensation and benefits package that includes medical, dental and vision health insurance programs, flex time (may be available), paid sick leave, paid vacation and holidays, short-term and long-term disability, life insurance, flexible spending accounts, retirement, deferred compensation plan, educational reimbursement, excellent in-house training programs, free transportation passes for the employee and dependents, wellness and ergonomic programs, and much more. OCTA has a hybrid remote work program. Eligibility is dependent on manager’s approval.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3786167044"}