{"jobTitle": "Customer Service (Full Time/Remote)", "company": {"name": "Morphius Corp ", "location": "San Fernando, CA"}, "location": "San Fernando, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Internet Publishing", "description": "MUST RESIDE IN CALIFORNIA!!<br/><br/>We are a rapidly growing company that has more clients than we can see. We understand that it is a good problem to have, but we need more qualified people that will help us keep up with our growth.<br/><br/>What we do is provide benefits for labor unions, credit unions, and associations. Working with police departments, firefighters, teachers, postal workers and other labor unions as well. We have set up direct relationships with over 20,000 union associations around southern California.<br/><br/>What we desire in a candidate: self-motivation, proven leadership abilities, a customer service attitude, integrity, a desire for professional development and growth, a willingness to learn, and exceptional people skills.<br/><br/>What we provide is a genuine career opportunity: training and mentorship, growth opportunities, and financial success.<br/><br/>The role of benefits coordinator is to simply educate these members who request information about the benefits that are available to them through their union affiliation. Sales involved only if the customer desires to opt in for additional benefits. No cold calling as we only work with union associations directly.<br/><br/>Requirements for consideration:<br/><br/><ul><li>Flexible hours</li><li> Fluent in English (Bilingual in any language is a plus but not required)<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health insurance reimbursement for all staff (upon qualification)</li><li>Life insurance at no cost</li><li>Agents have an established career path with collectively bargained progressions and vesting of renewal commissions (retirement plan)</li><li>UNION BENEFITS – Our staff also belong to a union which includes benefits</li><ul><li>Free college classes for all members</li><li>Student Debt Reduction Program</li><li>Scholarship access for members and their children</li><li>Union provides life insurance (in addition to our company) for all members</li><li>Roadside assistance for all members</li><li>Identity Theft Protection for all members<br/></li></ul></ul>Powered by JazzHR<br/><br/>VA7MG1f3yd", "postedDate": "8 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3787754593"}