{"jobTitle": "Project / Interiors Architect", "company": {"name": "Wolcott Architecture", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $120,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Internet Publishing", "description": "<strong>PURPOSE OF POSITION:<br/><br/></strong>Wolcott Architecture (WA) is looking for an experienced Interior Architecture Project Architect who possesses and demonstrates the highest level of Revit and AutoCAD knowledge to work with the Project Manager and design team in managing all phases of a project from design concept through construction. This is a role that requires comfort with client interaction and experience with project and design presentation.<br/><br/>Projects range from medium-large scale commercial interior architecture scope to tenant improvements. Preferred candidate must bring solid experience with medical buildouts.<br/><br/>WA offers a fun, fast paced, creative work environment nestled in our custom office space in the Los Feliz / East Hollywood neighborhood of Los Angeles. This is a full-time position in a hybrid work environment with excellent benefits and 401(k) plan.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li>A Minimum of 10-15 years’ experience (both technical and supervisory) in the medical commercial interiors/architectural field</li><li>Excels at preparing and maintaining all revisions to the architectural documents, coordination of engineering contract documents and project manuals. Excels at directing and coordinating production team in preparation of construction documents</li><li>Thorough knowledge of relevant and applicable codes including IBC, CBC, ADA, Title 24 and of relevant building department jurisdictions and practices. Knowledge of relevant AIA documents</li><li>Knowledge of AutoCAD and Revit sufficient to communicate ideas and direct staff<br/><br/></li></ul>Salary Range:<br/><br/>$90K/yr - $120K/yr<br/><br/>‍<br/><br/>Local, Los Angeles candidates only. This is an onsite position at our office in Los Angeles. No remote candidates please.<br/><br/>Powered by JazzHR<br/><br/>W4pf1QkA8d", "responsibilities": "Wolcott Architecture (WA) is looking for an experienced Interior Architecture Project Architect who possesses and demonstrates the highest level of Revit and AutoCAD knowledge to work with the Project Manager and design team in managing all phases of a project from design concept through construction. This is a role that requires comfort with client interaction and experience with project and design presentation.<br/><br/>Projects range from medium-large scale commercial interior architecture scope to tenant improvements. Preferred candidate must bring solid experience with medical buildouts.", "qualifications": {"required": "A Minimum of 10-15 years’ experience (both technical and supervisory) in the medical commercial interiors/architectural field, Excels at preparing and maintaining all revisions to the architectural documents, coordination of engineering contract documents and project manuals. Excels at directing and coordinating production team in preparation of construction documents, Thorough knowledge of relevant and applicable codes including IBC, CBC, ADA, Title 24 and of relevant building department jurisdictions and practices. Knowledge of relevant AIA documents, Knowledge of AutoCAD and Revit sufficient to communicate ideas and direct staff", "preferred": ""}, "skills": ["Revit", "AutoCAD", "Project Management", "Design", "Client Interaction", "Medical Buildouts"], "postedDate": "8 months ago", "benefits": "WA offers a fun, fast paced, creative work environment nestled in our custom office space in the Los Feliz / East Hollywood neighborhood of Los Angeles. This is a full-time position in a hybrid work environment with excellent benefits and 401(k) plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3787939035"}