{"jobTitle": "Communications Assistant", "company": {"name": "Edge Branding Inc.", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Internet Publishing", "description": "Start Date: Immediate, within the next 2 weeks<br/><br/>Hours: Full-Time availability is preferred, but 25 hours per week is the minimum<br/><br/>Advances in technology have changed the way brands interact with consumers and consumer buying habits have moved online. At Edge, we recognize the value of face-to-face interactions. An experiential event gives brands the chance to engage customers, build trust and boost brand loyalty.<br/><br/>At Edge, we offer ongoing training and support for all of our new communications assistants, therefore no experience is necessary! This role is hands-on and requires somebody with an open mind, a willingness to learn, and a desire to succeed. If that sounds like you,<em>apply today for immediate consideration!<br/><br/></em><strong>About the Communications Assistant Role:<br/><br/></strong>As a Communications Assistant, you will be responsible for humanizing our client's brands. You will be the face and voice of our clients and it will be your job to raise brand awareness and increase their customer base.<br/><br/>At Edge, we put customer experience at the top of the agenda. Our clients can be assured our Communications Assistant will represent them with complete confidence, professionalism, and enthusiasm. As a Communications Assistant, you will be the face of the company helping the sales, marketing, and management team increase brand awareness for our clients.<strong>As part of your role, you will complete the following tasks:<br/><br/></strong><ul><li>Network and develop professional relationships</li><li>Engage with the public through promotional advertising activities within the Marketing Communications Team</li><li>Complete sales transactions with both new and existing customers at our private site events</li><li>Carry out product presentations at private events</li><li>Create innovative marketing strategies to build a customer base and grow revenue at assigned events</li><li>General administrative duties</li><li>General tasks around setting up the events<br/><br/></li></ul><strong>Communications Assistants Won’t Be:<br/><br/></strong><ul><li>Using social media to promote a brand</li><li>Running personal errands for management</li><li>Going on daily coffee runs and ordering lunches</li><li>Sitting in boring meetings taking notes for people</li><li>Expected to have any previous marketing experience</li><li>Getting bored waiting for someone to find something</li><li>Working behind a screen all day suffering digital fatigue<br/><br/></li></ul><strong>Benefits of Working with Edge:<br/><br/></strong><ul><li>Paid training, ongoing guidance, and an open-door policy</li><li>Regional, national (and possibly international) travel opportunities</li><li>A fun, team-oriented work environment with a positive atmosphere</li><li>Flexible hours and responsibilities based on individual career goals</li><li>A detailed payment and advancement structure<br/><br/></li></ul><strong>Communications Assistants will receive recognition, rewards, and other incentives for setting and breaking records, improved performance, high rolling, assisting new team members, and more!<br/><br/></strong><strong>We're interested in meeting people that are:<br/><br/></strong><ul><li>Currently living in or near Santa Ana (willing/able to commute)</li><li>Over 18 years of age and eligible to work in the USA</li><li>Available for full-time hours and at least 12 weeks of work</li><li>Excited about learning and applying new skills</li><li>Wanting to grow personally and professionally</li><li>Able to work well independently and as part of a team</li><li>Able to start right away (or within 2 weeks)<br/><br/></li></ul><em>If you have a pleasant and professional nature, can influence or persuade others, and have a friendly disposition… we want to meet you!<br/><br/></em>Powered by JazzHR<br/><br/>B2o6UkHM5J", "postedDate": "8 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3787921390"}