{"jobTitle": "Virtual Reality Telehealth LCSW", "company": {"name": "XRHealth", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Internet Publishing", "description": "We are actively looking to hire a part time Virtual Reality TelehealthLicensed Clinical Social Worker (LCSW) who is passionate about patient care and committed to clinical excellence. _This is a fully remote position, with flexible scheduling._Are you passionate about leveraging cutting-edge technology to revolutionize the healthcare industry? We are seeking a Virtual Reality Telehealth Specialist to join our innovative team and help shape the future of healthcare delivery. In this role, you will combine your expertise in social work with virtual reality technology via telehealth to provide patients with immersive and personalized remote healthcare experiences.<br/><br/>Requirements:<br/><br/>\n<ul><li>Master's Degree in Social Work by an institution accredited by CSWE, required</li><li>LCSW - Licensed Clinical Social Worker withmultiple state licenses</li><li>Experience with evidenced based therapies strongly preferred, including CBT, DBT, Solution Focused, and Motivational Interviewing</li><li>Experience treating patients with Anxiety Disorders, Depressive Disorders, PTSD, and other mental health conditions</li><li>The ability to express oneself clearly and concisely both orally and in writing</li><li>The ability to plan, organize, prioritize daily tasks and work with minimal supervision</li><li>Private office anddependable internet access<br/><br/></li></ul>Clinician's Telehealth and remote monitoring responsibilities:<br/><br/>\n<ul><li>Perform initial evaluation and ongoing treatment interventionsaccording to standards of practice and state standards</li><li>Complete appropriate assessment and use clinical judgement to determine patient's eligibility to use our Virtual Reality Headsets</li><li>Develop a Plan for remote monitoring and training based on initial evaluation</li><li>Monitor patient performance and adjust the training plan according to progress and data analytics</li><li>Follow up/re-evaluation/discharge according to patient progress and data analytics</li><li>Setting goals to improve in the areas that are scaled to patient abilities and realistically attainable</li><li>Document patient progress according to approved medical documentation and facility documentation procedures</li><li>Send full progress report to the referring physician, if needed<br/><br/></li></ul>_This job allows you to make your own schedule, and work from the comfort of your own home while utilizing innovative VR technology!<br/><br/>_Powered by JazzHR<br/><br/>HumViPyJkO", "postedDate": "8 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3787770277"}