{"jobTitle": "General Manager", "company": {"name": "Club Pilates North Dallas", "location": "Newport Beach, CA"}, "location": "Newport Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Internet Publishing", "description": "COMPANY OVERVIEW:<br/><br/>KLW Fitness, established in 2013, is a multi-unit operator and developer of the Club Pilates franchise system. With locations in Orange and Los Angeles counties, KLW is one of the largest and longest operating franchisees. The Club Pilates brand is well-established in 41 states and 3 countries, with over 650 studios currently in operation.<br/><br/>Club Pilates offers group reformer classes in various formats and levels to accommodate everyone seeking to learn Pilates and hone their fitness expertise. Committed to providing affordable and accessible Pilates to the community, class formats target a wide range of clients’ needs – from young to more senior and beginner to advanced. Club Pilates was one of the first studios to create a 500-hour Teacher Training Program designed to thoroughly and safely teach group Pilates apparatus classes. Its over 2200 instructors provide over 17 million workouts a year to tens of thousands of members. Club Pilates has been recognized in Inc Magazine's Inc. 500 and Inc. 5000 List two years in a row as well as Entrepreneur Magazine's Franchise 500 two years in a row. For more information, visitwww.clubpilates.com<br/><br/>POSITION:<br/><br/>The General Manager will oversee all studio functions from sales to instructors. They will lead all sales efforts; drive membership growth and endeavor to prevent member attrition. The General Manager will hire, train and manage Sales Associates within their studio.<br/><br/>The General Manager will utilize discretion and independent judgment in managing the studio and directing the work of employees.<br/><br/>REQUIREMENTS:<br/><br/><ul><li>2+ years of retail/service sales or fitness sales experience</li><li>Confident in generating personal sales and training Sales Associates in sales</li><li>Ability to manage and drive 4 revenue streams: memberships, retail, private training, and teacher training</li><li>Must be fluent in English and have excellent communication and strong interpersonal skills in person, on the telephone and via email</li><li>Ability to excel in a fast changing, diverse environment</li><li>Ability to recognize areas of improvement and make changes using good judgement</li><li>An affinity and passion for fitness</li><li>Solid writing and grammar skills</li><li>Highly organized, proficient in data management, ability to prioritize and meet deadlines</li><li>Professional, punctual, reliable and neat</li><li>Strong attention to detail and accuracy</li><li>Trustworthy and ability to handle confidential information</li><li>Ability to work harmoniously with co-workers, clients and the general public</li><li>Proficiency with computers and Studio software<br/><br/></li></ul>RESPONSIBILITIES:<br/><br/><ul><li>Lead generation including Grass Roots Marketing and Networking</li><li>Implement sales process to schedule prospects into Intro classes</li><li>Membership sales</li><li>Manage staff schedule</li><li>Ensure that studio retail/products are stocked with accurate inventory counts</li><li>Train and Supervise Sales Associates</li><li>Hire/Manage instructors at the studio</li><li>Proficiency in ClubReady, to include revenue reports, attendance reports, etc</li><li>Review instructor evaluations and assist in mentorship/disciplinary action as needed</li><li>Independently make decisions related to high level customer service</li><li>Collect out-standing dues</li><li>Maintain cleanliness and organization of the Pilates Studio</li><li>Enforce Club Pilates policies and procedures</li><li>Ensure all forms, administrative supplies, and studio literature is stocked and visible</li><li>Schedule and participate in networking/community events and studio promotions</li><li>Strategically manage marketing campaigns to generate leads for the studio<br/><br/></li></ul>BENEFITS AND PERKS:<br/><br/><ul><li>This position offers very competitive base pay; based on experience &amp; performance</li><li>Monthlyperformance bonus opportunities</li><li>Health Benefits</li><li>Paid Time Off</li><li>Free Pilates classes</li><li>Unlimited growth potential within the company. <br/><br/></li></ul>Powered by JazzHR<br/><br/>vjytZhSInA", "responsibilities": "<ul><li>Lead generation including Grass Roots Marketing and Networking</li><li>Implement sales process to schedule prospects into Intro classes</li><li>Membership sales</li><li>Manage staff schedule</li><li>Ensure that studio retail/products are stocked with accurate inventory counts</li><li>Train and Supervise Sales Associates</li><li>Hire/Manage instructors at the studio</li><li>Proficiency in ClubReady, to include revenue reports, attendance reports, etc</li><li>Review instructor evaluations and assist in mentorship/disciplinary action as needed</li><li>Independently make decisions related to high level customer service</li><li>Collect out-standing dues</li><li>Maintain cleanliness and organization of the Pilates Studio</li><li>Enforce Club Pilates policies and procedures</li><li>Ensure all forms, administrative supplies, and studio literature is stocked and visible</li><li>Schedule and participate in networking/community events and studio promotions</li><li>Strategically manage marketing campaigns to generate leads for the studio<br/><br/></li></ul>", "qualifications": {"required": "2+ years of retail/service sales or fitness sales experience, Confident in generating personal sales and training Sales Associates in sales, Ability to manage and drive 4 revenue streams: memberships, retail, private training, and teacher training, Must be fluent in English and have excellent communication and strong interpersonal skills in person, on the telephone and via email, Ability to excel in a fast changing, diverse environment, Ability to recognize areas of improvement and make changes using good judgement, An affinity and passion for fitness, Solid writing and grammar skills, Highly organized, proficient in data management, ability to prioritize and meet deadlines, Professional, punctual, reliable and neat, Strong attention to detail and accuracy, Trustworthy and ability to handle confidential information, Ability to work harmoniously with co-workers, clients and the general public, Proficiency with computers and Studio software<br/><br/>", "preferred": ""}, "skills": [], "postedDate": "8 months ago", "benefits": "This position offers very competitive base pay; based on experience &amp; performance, Monthlyperformance bonus opportunities, Health Benefits, Paid Time Off, Free Pilates classes, Unlimited growth potential within the company. <br/><br/>", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3787758076"}