{"jobTitle": "Sales Associate", "company": {"name": "Club Pilates North Dallas", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Be a part of the growing boutique fitness industry and join our Studio Team! Interact directly with members and prospective members and help them on their fitness journey while you connect and contribute to our studio community in this fun, high-energy and service-focused environment! KLW Fitness, established in 2013, is a multi-unit operator and developer of the Club Pilates franchise system. With locations in CA,CO, AZ, OR, and WA. KLW is one of the largest and longest operating franchisees.<br/><br/>The Club Pilates brand is well-established in 41 states and 3 countries, with over 650 studios currently in operation. Club Pilates offers group reformer classes in various formats and levels to accommodate everyone seeking to learn Pilates and hone their fitness expertise. Club Pilates is a well-established, nation-wide brand, committed to providing affordable and accessible Pilates to the community. For more information, visit www.clubpilates.com<br/><br/>POSITION OVERVIEW: We are seeking a motivated and enthusiastic Sales Associate to join our team at a reputable Pilates studio. As a Sales Associate, you will play a crucial role in supporting the General Manager (GM) in achieving the studio's sales goals and maintaining excellent customer service. Your primary responsibility will be to assist the GM in sales and customer relations to ensure a positive experience for our clients<br/><br/>JOB REQUIREMENTS:<br/><br/><ul><li> Excellent sales, communication, and customer service skills Goal-oriented with an ability to achieve sales targets</li><li> Strong customer service skills Ability to learn and use the Club Ready software system</li><li> Must be fluent in English and have excellent communication skills via in person, phone and email Must be able to work under pressure and meet tight deadlines</li><li> Must have proficient computer skills Daily and/or occasional travel may be required Attend special events and trainings as needed Part time<br/><br/></li></ul>RESPONSIBILITIES:<br/><br/><ul><li> Execute full sales process of lead generation, follow up, and closing the sale Meet and exceed sales goals as established by the General Manager</li><li> Conduct studio tours with new prospects to build rapport to facilitate sales</li><li> Be knowledgeable about products, programs and pricing Emphasize and enforce objectives of the studio as a fitness and wellness provider Book quality appointments to achieve monthly sales quota</li><li> Participate in grassroots/community events (health fairs, grand openings, marathons, and community and hospital events) to promote the studio Assists with maintaining a clean, safe and inviting environment Assumes responsibility for developing selling skills other duties as assigned<br/><br/></li></ul>COMPENSATION &amp; PERKS:<br/><br/><ul><li> This position offers a competitive hourly wage and Commission paid on sales</li><li> Opportunity for growth within the studios including additional sales and management positions<br/><br/></li></ul>Powered by JazzHR<br/><br/>vUIrXl8nSZ", "responsibilities": "Execute full sales process of lead generation, follow up, and closing the sale Meet and exceed sales goals as established by the General Manager\nConduct studio tours with new prospects to build rapport to facilitate sales\nBe knowledgeable about products, programs and pricing Emphasize and enforce objectives of the studio as a fitness and wellness provider Book quality appointments to achieve monthly sales quota\nParticipate in grassroots/community events (health fairs, grand openings, marathons, and community and hospital events) to promote the studio Assists with maintaining a clean, safe and inviting environment Assumes responsibility for developing selling skills other duties as assigned", "qualifications": {"required": "Excellent sales, communication, and customer service skills Goal-oriented with an ability to achieve sales targets\nStrong customer service skills Ability to learn and use the Club Ready software system\nMust be fluent in English and have excellent communication skills via in person, phone and email Must be able to work under pressure and meet tight deadlines\nMust have proficient computer skills Daily and/or occasional travel may be required Attend special events and trainings as needed Part time"}, "skills": ["Sales", "Customer Service", "Communication", "Goal-Oriented", "Software", "English", "Computer Skills"], "postedDate": "8 months ago", "benefits": "This position offers a competitive hourly wage and Commission paid on sales\nOpportunity for growth within the studios including additional sales and management positions", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3787756542"}