{"jobTitle": "E-Commerce Account Manager", "company": {"name": "Sunny Health and Fitness", "location": "City of Industry, CA"}, "location": "City of Industry, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Please be advised the job position is located in the City of Industry, CA. This position is full-time and ON-SITE.*<br/><br/>Sunny Health & Fitnessis an industry leading health and exercise-centric lifestyle brand that is dedicated to cultivating and empowering those within the fitness community. We believe fitness should be accessible to everyone, anywhere, anytime. Our goal is to enable and provide you with the tools you need to become better through a fulfilling fitness experience and lifestyle.<br/><br/>We are looking for a motivated Account Manager to assist our sales team with development of sales and pricing plans, communicate with customers to determine their needs, and conduct research to identify new sales leads. You will contribute to build profitable, long-term relationships with our clients to reach our business objectives. He/she will be reporting to the Sales Operations Manager to drive revenue growth through identification of business expansion opportunities with assigned customers.<br/><br/>Schedule: Monday-Friday 8:30 AM-5:30 PM (1 hour unpaid lunch)<br/><br/>Essential Duties and Responsibilities:<br/><br/><ul><li>Provide ongoing account support to existing customers assigned by the sales team</li><li>Serve as point of contact with customers to provide a superior level of customer service to maintain and ensure growth at profitable level</li><li>Partner with Sales team to ensure seamless service and support; develops and maintains strong relationships with assigned accounts</li><li>Strategic planning to develop sales initiatives that drive performance and revenue. Ability to execute tactics to successful outcomes, pivoting when necessary</li><li>Monitor customer preferences to determine focus of sales efforts</li><li>Identify prospective customers, using business directories, leads from existing clients, participation in organizations, or trade show or conference attendance</li><li>Inform new and existing customers of promotions, upgrade product lines, and offers</li><li>Collaborate with the sales team to identify new sales leads and develop sales plans</li><li>Gather information on assigned clients and contact clients to understand their requirements and work on a sales plan</li><li>Coordinate and build strong customer relationships through regular open communications</li><li>Conduct sales research and identify new sales opportunities</li><li>Other duties may be assigned<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Bachelor’s Degree in Business Administration, OR 4 years of relevant working experience</li><li>2+ years’ experience working in B2B Sales or related market</li><li>E-commerce experience managing B2B accounts and business development</li><li>Bilingual in Spanish is preferred</li><li>Must have the ability to travel, if needed</li><li>Demonstrated ability to communicate, present and influence credibly and effectively at all levels of the organization, including executive and C-level</li><li>Excellent listening, negotiation, and presentation skills</li><li>Strong proficiency in Microsoft Word, Excel, PowerPoint, and statistical analysis software</li><li>Strong (verbal and written) communication skills with an ability to build relationships with interpersonal skills</li><li>Technical skills required to understand and propose products or solutions by focusing on client requirements<br/><br/></li></ul>Benefits:<br/><br/><ul><li>Medical, Dental, Vision Insurance</li><li>Life Insurance: Fully covered by the company</li><li>401k matching, 100% match up to first 3% and 50% match for the next 2%. Eligible to enroll after six months with the company. 100% fully vested</li><li>Paid Sick Leave</li><li>7 Paid Holidays</li><li>Paid Vacation</li><li>Company provides discounts for fitness equipment for our employees<br/><br/></li></ul>If interested in this position, please apply directly on this job post. You may also email your most recent resume along with the job title and desired salary to recruitment@sunnyhealthfitness.com. We are open Monday to Friday 08:30 AM-05:30 PM PST.<br/><br/>Powered by JazzHR<br/><br/>j4aZxeJGm9", "responsibilities": "Provide ongoing account support to existing customers assigned by the sales teamServe as point of contact with customers to provide a superior level of customer service to maintain and ensure growth at profitable levelPartner with Sales team to ensure seamless service and support; develops and maintains strong relationships with assigned accountsStrategic planning to develop sales initiatives that drive performance and revenue. Ability to execute tactics to successful outcomes, pivoting when necessaryMonitor customer preferences to determine focus of sales effortsIdentify prospective customers, using business directories, leads from existing clients, participation in organizations, or trade show or conference attendanceInform new and existing customers of promotions, upgrade product lines, and offersCollaborate with the sales team to identify new sales leads and develop sales plansGather information on assigned clients and contact clients to understand their requirements and work on a sales planCoordinate and build strong customer relationships through regular open communicationsConduct sales research and identify new sales opportunitiesOther duties may be assigned", "qualifications": {"required": "Bachelor’s Degree in Business Administration, OR 4 years of relevant working experience2+ years’ experience working in B2B Sales or related marketE-commerce experience managing B2B accounts and business developmentMust have the ability to travel, if neededDemonstrated ability to communicate, present and influence credibly and effectively at all levels of the organization, including executive and C-levelExcellent listening, negotiation, and presentation skillsStrong proficiency in Microsoft Word, Excel, PowerPoint, and statistical analysis softwareStrong (verbal and written) communication skills with an ability to build relationships with interpersonal skillsTechnical skills required to understand and propose products or solutions by focusing on client requirements", "preferred": "Bilingual in Spanish is preferred"}, "skills": ["Sales", "Business Development", "Customer Service", "Microsoft Word", "Excel", "PowerPoint", "Statistical Analysis"], "postedDate": "8 months ago", "benefits": "Medical, Dental, Vision InsuranceLife Insurance: Fully covered by the company401k matching, 100% match up to first 3% and 50% match for the next 2%. Eligible to enroll after six months with the company. 100% fully vestedPaid Sick Leave7 Paid HolidaysPaid VacationCompany provides discounts for fitness equipment for our employees", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3787917228"}