{"jobTitle": "Customer Service Position (Remote)", "company": {"name": "Apex Talent Solutions", "industry": "Internet Publishing", "size": "Not specified", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Remote", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Other", "industry": "Internet Publishing", "description": "The customer service representative will be responsible for answering client inquiries, provide product information, and help the customer by being informative, empathetic, and eager to quickly solve a customer’s problem. Must be willing to listen, learn, and resolve any customer inquiry.\n\nCustomer Service Job Duties And Responsibilities\n- Excellent customer care and focus; ability to assess customers’ needs and provide the correct answer, path, troubleshooting, or method for a positive customer experience\n- Answer and manage incoming calls, emails, chats, and/or interactive voice response systems\n- Ability to learn and follow all customer service procedures and policies\n- Strive to meet and go above personal and team target goals\n- Record, organize and file customer interactions and account changes\n- Able to up-sell if needed\n- Able to schedule call back and appoints to resolve customer needs\n\nCustomer Service Job Requirements And Qualifications\n- Previous experience in customer support, client services, sales, or a related field\n- Excellent at communicating over the phone and other communication platforms\n- Basic computer skills and experience\n- Able to multitask\n- Excellent time management and prioritization skills\n- Ability to listen actively, relay information, and answer questions and/or concerns\n- Customer-focused for positive customer experience and resolution\n\nBenefits\n- Health Insurance (dental and vision included)\n- Excellent retirement plan\n- Tremendous upward mobility into other positions and management\n- Flexible hours\n- Remote Position(s) available (work from home)", "responsibilities": "The customer service representative will be responsible for answering client inquiries, provide product information, and help the customer by being informative, empathetic, and eager to quickly solve a customer’s problem.", "qualifications": {"required": "Previous experience in customer support, client services, sales, or a related field. Excellent at communicating over the phone and other communication platforms. Basic computer skills and experience. Able to multitask. Excellent time management and prioritization skills. Ability to listen actively, relay information, and answer questions and/or concerns. Customer-focused for positive customer experience and resolution.", "preferred": "Not specified"}, "skills": ["Customer service", "Communication", "Problem-solving", "Time management", "Multitasking"], "postedDate": "8 months ago", "applicationDeadline": "Not specified", "benefits": "Health Insurance (dental and vision included), Excellent retirement plan, Tremendous upward mobility into other positions and management, Flexible hours, Remote Position(s) available (work from home)", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3787919695"}