{"jobTitle": "Business Development Specialist", "company": {"name": "Peregrine Team", "industry": "Internet Publishing", "size": "Not specified", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Business Development and Sales", "industry": "Internet Publishing", "description": "Peregrine Team is looking for a Business Development Specialist to join our team! The Business Development Specialist is responsible for prospecting sales and qualifying leads for new and existing accounts. This person will act as a liaison between our marketing and sales teams. He/she will be naturally curious, results-driven, and eager to bring our product/services to new markets.", "responsibilities": "Contact and qualify leads - Prospect new sales leads by making an initial phone or email contact. Engage the account and prepare them for the Account Executive. Connect with as many leads as possible to encourage the purchase of the product offered. Be the point person for your team's sales lead qualification process. Manage current accounts – Stay in close contact with existing accounts or leads and create brand awareness, educational opportunities, and request referrals. Coordinate in-person meetings and calls between the new clients and Account Executives. Customer support – Answer calls and emails from clients, identify the issue and make suggestions for future or new products or services.", "qualifications": {"required": "BS degree in Marketing or Business Administration is preferred, Account management experience, Hands-on experience with multiple sales techniques, Experience with CRM software, Familiarity with MS Excel (analyzing spreadsheets and charts), Understanding of sales performance metrics", "preferred": ""}, "skills": [], "postedDate": "8 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3787790978"}