{"jobTitle": "Architectural Designer", "company": {"name": "Studio AR&D Architects", "industry": "Internet Publishing", "size": "Small", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Internet Publishing", "description": "Studio AR&D Architects is a Los Angeles based architecture firm that offers a creative and collaborative work environment with a growing portfolio of work that seeks to be both poetic and meaningful in every detail. We are a small firm which provides the opportunity for all team members to touch all aspects of each project from concept through construction. Projects include high‐end residential, hotel | hospitality, interior architecture and landscape. Currently, we are seeking an Architectural Designer who can help contribute to the creative work coming from Studio AR&D Architects. Work tasks will include taking a project from conception through completion with lots of hands on experience and potential for individual growth.", "responsibilities": "Participate in day to day project management, Project/construction site visits, Meeting deadlines in a timely manner, Coordinate effectively with engineering and design consultants, Prepare construction drawings for contractors and permit agencies, Processing of project at various jurisdictions and acquiring necessary permits, Compiling project specifications, Ensuring all vital information and documentation is recorded and maintained, Provide support for any tasks required for the successful completion of the project, which can include running errands, Provide support for any task required to keep office running smoothly (i.e. ordering office supplies, ordering material samples, obtaining pricing for materials, maintaining organization of projects, etc.)", "qualifications": {"required": "Minimum 3-5 years’ experience at an architecture firm, Bachelor’s degree in Architecture or another related field, Proficiency in AutoCAD, Strong interest in modern & contemporary architecture, Ability to multi‐task while maintaining a high level of detail and accuracy, Reliable transportation to travel to and from job sites upon request, Ability to provide support for tasks required for the successful completion of projects including processing documents at various jurisdiction to acquire necessary permits, etc.", "preferred": "Experience working on high end residential architecture, hotel | hospitality & interior architecture, Proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign), Proficiency in Sketchup & Enscape"}, "skills": ["AutoCAD", "Adobe Creative Suite", "Sketchup", "Enscape"], "postedDate": "8 months ago", "applicationDeadline": "Not specified", "benefits": "Health insurance, paid vacation, paid time off and 7 days of paid holidays.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3787788344"}