{"jobTitle": "Buyer", "company": {"name": "Sunny Health and Fitness", "location": "Hacienda Heights, CA"}, "location": "Hacienda Heights, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Purchasing and Supply Chain", "industry": "Internet Publishing", "description": "<strong>Sunny Health &amp; Fitness </strong>is an industry leading health and exercise-centric lifestyle brand that is dedicated to cultivating and empowering those within the fitness community. We believe fitness should be accessible to everyone, anywhere, anytime. Our goal is to enable and provide you with the tools you need to become better through a fulfilling fitness experience and lifestyle.<br/><br/><strong>Schedule: Monday-Friday 8:30 AM-5:30 PM (1 hour unpaid lunch)<br/><br/></strong><strong>Essential Duties and Responsibilities:<br/><br/></strong><ul><li>Developing an effective and accurate system for monitoring purchase orders</li><li>Delivering a weekly purchase order report to supervisors that indicates the invoice number for all closed orders</li><li>Working within the management team to ensure that all deliveries satisfy the assigned orders and report any back ordered or missing products</li><li>Assisting Director of Operations with maintaining inventory levels and materials on a regular basis</li><li>Effectively communicating with the management team to ensure all orders are accurate<br/><br/></li></ul><strong>Qualifications, Skills, and Knowledge:<br/><br/></strong><ul><li>Bachelor’s in Business Administration or related field</li><li>Bilingual in Mandarin (PREFERRED)</li><li>Strong interpersonal skills to work with team members, clients and suppliers</li><li>Negotiation skills to work with suppliers and make better deals for the company</li><li>An understanding of purchase order software platforms</li><li>Good attention to detail to ensure all purchase orders are accurate</li><li>Ability to work with a team</li><li>Math skills to make sure all calculations are correct and avoid any unforeseen losses for the company<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Medical, Dental, Vision Insurance</li><li>Life Insurance: Fully covered by the company</li><li>401k matching, 100% match up to first 3% and 50% match for the next 2%. Eligible to enroll after six months with the company. 100% fully vested</li><li>Paid Sick Leave</li><li>7 Paid Holidays</li><li>Paid Vacation</li><li>Company provides discounts for fitness equipment for our employees<br/><br/></li></ul>If interested in this position, please apply directly on this job post. You may also email your most recent resume along with the job title and desired salary to recruitment@sunnyhealthfitness.com. We are open Monday to Friday 08:30 AM-05:30 PM PST.<br/><br/>Powered by JazzHR<br/><br/>miKo7bxQ30", "postedDate": "8 months ago", "benefits": "Medical, Dental, Vision Insurance, Life Insurance: Fully covered by the company, 401k matching, 100% match up to first 3% and 50% match for the next 2%. Eligible to enroll after six months with the company. 100% fully vested, Paid Sick Leave, 7 Paid Holidays, Paid Vacation, Company provides discounts for fitness equipment for our employees", "skills": ["Mandarin", "Purchase Order", "Inventory Management", "Communication", "Teamwork", "Math Skills", "Negotiation"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3787908869"}