{"jobTitle": "Remote Area Sales Representative", "company": {"name": "The Delaney Agency", "location": "Riverside, CA"}, "location": "Riverside, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "We are currently seeking highly motivated individuals, with a passion for career success and helping families to join our successful, fast-paced team. We are not as concerned about skill set or experience as we are character and work ethic. This is your opportunity to start with a company that promotes only from within, giving you the fastest route from where you are in your career to where you want to be.<br/><br/>We invest a lot of time and resources into our new agents to get them ready to win. Training, scripts, mentorship and a lead program are just some of the ways we provide support to the right candidates. We equip you for acceleration and success. The right candidate will fit the following criteria:<br/><br/><ul><li> Hungry</li><li> Humble</li><li> Good Character</li><li> Business Mindset</li><li> Unreasonably Optimistic<br/><br/></li></ul>If you are ready to give your all and grow your capacity apply to see if you qualify for an interview with one of our Regional Directors.<br/><br/>The Delaney Agency is a brokerage headquartered in Asheville, N.C and operating in 43 states nationally. We are on a mission: <em><strong>Protecting Families is What We Do, Developing Leaders is Who We Are</strong></em>. We Protect Families and individuals from the unexpected with a full suite of products from top rated companies: personalized life insurance, disability, critical illness, retirement, final expense coverage and much more. We Develop Leaders by giving each individual who works with our company an opportunity to build and develop a team of other high caliber individuals through our “Sweat Equity Franchise Model”. What does this mean for you? Ask us for details when we contact you.<br/><br/><strong>What Makes Make Us THE BEST.<br/><br/></strong><ul><li>The best direct mail lead program in the country for both Mortgage Protection and Final Expense</li><li>Access to major A-rated life insurance carriers</li><li>Top commission levels 80%-130%</li><li>Comprehensive training from the industry’s most accomplished Brokers and Leaders</li><li>Free, world-class travel and incentive programs to reward you for your production</li><li>100% Commission Sales; control your time &amp; control your income</li><li>Competitive annuity products to complement your life sales and bolster earnings<br/><br/></li></ul><strong>Do you have what it takes to be a part of our winning team? Send in your resume and schedule an initial interview, one of our hiring managers will contact you within 24 hours.<br/><br/>#ZR<br/><br/></strong>Powered by JazzHR<br/><br/>wc27RyeAMo", "postedDate": "8 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3787925213"}