{"jobTitle": "Sales Representative - Southern California", "company": {"name": "Reiser", "industry": "Food Equipment", "size": "51-200 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Sales", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "With more than 60 years of success in the food equipment industry, REISER is recognized worldwide for its high-quality equipment, innovative engineering, and outstanding service and support. Total commitment to our customers is at the core of who we are, making REISER the one supplier that food manufacturers can trust for better, smarter food processing and food packaging solutions and equipment. We take great pride in providing the resources our customers need to ensure their success. Our team of talented and passionate professionals works hard, embraces challenges and is wholeheartedly dedicated to the success of our customers. As a Field Salesperson with Reiser, you will be responsible for sales growth, gross profit and positive customer relationships in a territory covering Southern Los Angeles, San Diego and Las Vegas. If you are a dynamic and confident sales leader with experience selling processing or packaging capital equipment to food plants, we want to hear from you! Our ideal candidate is smart, energetic, hard-working and likes to have FUN!", "responsibilities": "Professionally represent our lines of food processing and food packaging capital equipment solutions to new and existing customers in Southern California and Las Vegas. Continually build pipeline through cold-calling, networking and maintaining positive relationships; internally and externally. Share best sales practices with the Reiser team. Be actively involved with sales industry associations. Produce accurate sales reports in a timely manner. Help to facilitate quotations, product samples and deliveries. Work closely with field service team to ensure 100% customer satisfaction.", "qualifications": {"required": "Five plus of experience selling food processing and/or food packaging capital equipment. We will consider candidates with experience selling relatable systems or services to the food industry. Experience selling to the meat/protein industry is highly preferred. Aggressive, enthusiastic and determined individual with a proven track record of success. Understands importance of selling equipment with the added service component and working closely with service team. Ability to work independently, prioritize and multi-task. Comfortable communicating with people on the shop floor to presidents of companies. Must reside in Southern California, ideally greater Los Angeles. Undergraduate degree preferred.", "preferred": ""}, "skills": ["Sales", "Customer Relationship Management", "Food Processing", "Food Packaging", "Networking", "Sales Reporting"], "postedDate": "8 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3789382648"}