{"jobTitle": "CENS Navigator (SUD Counselor)", "company": {"name": "HOPICS", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$23.00-$25.00 PerHour", "currency": "USD"}, "jobFunction": "Other, Information Technology, and Management", "industry": "Internet Publishing", "description": "SPECIAL SERVICE FOR GROUPS<br/><br/>Job Announcement<br/><br/>_____________________________________________________________________________<br/><br/><strong>Title:</strong> CENS Navigator (SUD Counselor) <strong>Division:</strong> HOPICS<br/><br/><strong>FLSA:</strong> Non-Exempt, Full-Time <strong>Supervisor:</strong> CENS Manager<br/><br/><strong>Pay Range: </strong>$23.00-$25.00 PerHour <strong>Revised: </strong>05.17.19<br/><br/><strong>Summary<br/><br/></strong>Under the supervision of the CENS Program Manager the Navigator/SUD Counselor will complete brief screening, information, and linkage/referrals, coordination, and follow-up to clients who are referred to the CENS by participating agencies, as well as to clients who are walk-ins, that may be in need of substance used disorder treatment and/or mental health services.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Complete brief screening with clients who are referred to the CENS by participating agencies, who may be in need of substance abuse treatment and/or mental health services</li><li>Will provide clients with information and referrals for treatment services and other ancillary services</li><li>Provide case management services to ensure that all clients’ needs are met</li><li>Coordinate with project approved treatment providers as identified in Service Planning Area 6</li><li>Provide referral and linkage services to appropriate treatment facilities as determined by the ASAM Brief Screening and interview</li><li>Provide the Program Manager with all required client information and screening outcomes</li><li>Communicate with Providers and community partners</li><li>Responsible for preparing project reports in accordance with funding requirements</li><li>Conduct follow-up with clients screened and enrolled in SUD treatment programs</li><li>Input into Tracking, KIOSK, and EHR system</li><li>Input information into the TCPX system daily and weekly</li><li>Administer the ASAM Brief Screening</li><li>Assist with identifying program enhancement opportunities</li><li>Provide individual &amp; group substance abuse counseling</li><li>Perform duties based on professional practice with State/ Federal Government contracts and grants. </li><li>S/he must have the ability to monitor, evaluate, and promote clinical competence, directly and indirectly</li><li>Ensure fidelity to evidence-based practices</li><li>Deliver services using the 12 Core Functions of Substance Abuse Counseling</li><li>Facilitate group, consultation and awareness alumni services, outreach, client retention and cultural competency</li><li>Submit weekly and monthly reports in a timely manner </li><li>Coordinate homeless outreach services </li><li>Maintain appropriate boundaries, and adhere to SSG’s Code of Ethics and HOPICS’ Core Values. </li><li>Represent the Agency in a professional manner at meetings and community events</li><li>Wear proper attire during physical activity classes (yoga class, music therapy, etc.) </li><li>Participate in physical activity training (yoga, music events, etc.) </li><li>Regular attendance required </li><li>Other duties as needed<br/><br/></li></ul>Secondary Functions<br/><br/><ul><li>Attend all meetings associated with the CENS and other projects as assigned by Program Manager or Division Director</li><li>Maintain files/records on client services in compliance with HIPAA, 42 CFR Part 2 and other funding requirements for auditing purposes</li><li>Perform other duties as assigned by the Program Manager or Division Director</li><li>Other duties as needed’ and ‘overtime, holiday, or weekend work may be required<br/><br/></li></ul><strong>Minimum Qualifications – Knowledge, Skills, And Abilities Required<br/><br/></strong><ul><li>Certified or Registered Alcohol and Drug Abuse Counselor with a minimum of three (3) years of job-related experience. Registered employees must complete the certification process within five (5) years of their initial registration date</li><li>Verification of Employment Eligibility and Background Check</li><li>If in recovery, a minimum of three (3) years of being drug and alcohol-free is mandatory</li><li>Ability to work with clients from diverse cultural, ethnic, and socio-economic backgrounds</li><li>Ability to communicate effectively, both written and orally</li><li>Knowledge of core competencies of Substance Abuse Counseling</li><li>Working knowledge of Microsoft Word, Excel, and other database programs</li><li>Knowledge of various community-based treatment providers</li><li>Experience working with the criminal justice population</li><li>Valid California Driver License, Proof of Car Insurance, Reliable transportation</li><li>TB Clearance upon hire and thereafter annually</li><li>CPR and First Aid upon hire and thereafter</li><li>COVID-19 Vaccination Required: All new staff is required to be fully COVID-19 vaccinated and to submit vaccination records to the HR Department during new hire orientation. <br/><br/></li></ul><strong>Non-Essential Qualifications (optional) – Knowledge, Skills, And Abilities<br/><br/></strong>Supervisory Responsibilities<br/><br/><ul><li>This position does not have any supervisory responsibilities<br/><br/></li></ul>Environmental Conditions (Working Conditions)<br/><br/><ul><li>Exposed to aggressive clients: must communicate with many sources including courts, LA County Probation, State Parole and Mental Health Departments and other community agencies. S/he will be co-located at the County jail. Some evenings and weekends may be required. Sometimes noisy, loud and disruptive clients<br/><br/></li></ul>Physical Requirements<br/><br/><ul><li>In the course of performing this job, the incumbent typically spends time sitting, standing, walking, speaking, driving, and listening. Must sit at computer for data entry and reports: sometimes spend time driving and walking and carrying equipment/files/charts. Speak to staff and outside agencies in public meetings and multi-disciplinary team meetings. Represent the Agency in a professional and positive manner. Ability to lift a minimum of 25 pounds. Light physical effort may include occasional light lifting (15 lbs), and some reaching, bending, stooping, walking, and squatting<br/><br/></li></ul>Mental Requirements<br/><br/><ul><li>The incumbent in this position must be able to accommodate any/all of the following: uncontrollable changes in priorities/be able to process information, think, and conceptualize and transfer knowledge on best practices for Substance Abuse Assessments and treatment. Ability to maintain a non-personal/romantic relationship with clients (See Conflict of Interest Policy) <br/><br/></li></ul><strong>Special Service for Groups is an Equal Opportunity/Affirmative Action Employer<br/><br/></strong>Powered by JazzHR<br/><br/>TiCRkUieFA", "responsibilities": "Under the supervision of the CENS Program Manager the Navigator/SUD Counselor will complete brief screening, information, and linkage/referrals, coordination, and follow-up to clients who are referred to the CENS by participating agencies, as well as to clients who are walk-ins, that may be in need of substance used disorder treatment and/or mental health services.", "qualifications": {"required": "Certified or Registered Alcohol and Drug Abuse Counselor with a minimum of three (3) years of job-related experience. Registered employees must complete the certification process within five (5) years of their initial registration date\nVerification of Employment Eligibility and Background Check\nIf in recovery, a minimum of three (3) years of being drug and alcohol-free is mandatory\nAbility to work with clients from diverse cultural, ethnic, and socio-economic backgrounds\nAbility to communicate effectively, both written and orally\nKnowledge of core competencies of Substance Abuse Counseling\nWorking knowledge of Microsoft Word, Excel, and other database programs\nKnowledge of various community-based treatment providers\nExperience working with the criminal justice population\nValid California Driver License, Proof of Car Insurance, Reliable transportation\nTB Clearance upon hire and thereafter annually\nCPR and First Aid upon hire and thereafter\nCOVID-19 Vaccination Required: All new staff is required to be fully COVID-19 vaccinated and to submit vaccination records to the HR Department during new hire orientation.", "preferred": ""}, "skills": ["Substance Abuse Counseling", "Microsoft Word", "Excel", "Database", "Community Outreach", "Case Management", "Client Services", "HIPAA", "42 CFR Part 2", "CPR", "First Aid", "COVID-19 Vaccination"], "postedDate": "8 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3791801845"}