{"jobTitle": "Assistant Store Manager - Chico's", "company": {"name": "Chico's FAS, Inc.", "industry": "Retail and Retail Apparel and Fashion"}, "location": "La Canada Flintridge, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Retail and Retail Apparel and Fashion", "description": "Join our chic team, dedicated to a styling and social experience that inspires women to express their individuality.<br/><br/><strong>Position Objective<br/><br/></strong>The Assistant Store Manager is responsible for supporting the Store Manager in promoting a customer and product-focused sales culture, where our values and guiding principles are at the forefront of all store operations, including managing sales operations, asset protection, and human resources functions to ensure great customer experience and maximum profitability. We love what we do, and believe that with our teams, we are the most amazing place to work, learn, and grow!<br/><br/><strong>Functional Responsibilities<br/><br/></strong>Performance Culture<br/><br/><ul><li> Analyzes sales reports and KPIs to determine the needs of the business; In partnership with Store Manager, executes in store business and sales strategies.</li><li> Establishes and communicates clear expectations, holding store team and themselves accountable for achieving all brand, performance, and behavior standards.</li><li> Controls payroll and supply budget.</li><li> Performs and oversees basic operational activities such as scheduling, target shrink audits, physical inventory, opening and closing duties, time sheet review and payroll accuracy documents, and merchandise flow processes.</li><li> Performs all financial activities effectively and in accordance with policy, including cash handling and reporting, price changes, and merchandise handling; ensures all register transactions are completed accurately and in accordance with policy.</li><li> Ensures compliance with all applicable laws, loss prevention policies, operating procedures and controls; conducts associate training to reinforce proper controls.</li><li> Administers all operational process including inventory receipt/dispatch, daily replenishment of floor merchandise levels, and execution and preparation of physical inventories.</li><li> Ensures visual presentation, organization, and facility maintenance are representative of the Brand.</li><li> Develops a high performance culture, motivating sales team to meet assigned sales and productivity goals.</li><li> Trains and coaches to ensure selling team is fluent in all aspects of product knowledge on line and in store.</li><li> Trains, coaches and assists with locate fulfillment and selling.<br/><br/></li></ul>Building High Performing Teams<br/><br/><ul><li> Motivates and inspires store team, developing a shared vision while modeling core values.</li><li> Promotes an inclusive, collaborative approach to problem solving.</li><li> Communicates with store teams and Store Manager to effectively lead positive change.</li><li> Seeks personal developmental opportunities and readily solicits feedback to build leadership skill set.<br/><br/></li></ul>Customer Experience<br/><br/><ul><li> Models, teaches, and promotes the Most Amazing Personal Service (MAPS) principles and standards, offering a cohesive omni channel experience.</li><li> Models sales expectations by utilizing various techniques and communicating product knowledge to the customer; recommends merchandise selections or helps to locate or obtain merchandise based on customer needs and desires.</li><li> Ensures prompt resolution of customer concerns.</li><li> Ensures a fast and efficient register experience, remaining current on policies regarding payments, coupon acceptance, returns and exchanges, security practices and other applicable operations.</li><li> Ensures team maintains consistent client communication through utilization of customer book, rewards program participation, and customer capture sign up.<br/><br/></li></ul>Talent<br/><br/><ul><li> Assists in recruiting, hiring and developing a high performing team.</li><li> Supports, implements, and provides follow-up for all training programs, seminars, etc.</li><li> Assesses and coaches store team on performance.</li><li> In partnership with the SM, resolves human resources issues in a timely and effective manner.</li><li> Drives associate and team engagement by recognizing and rewarding employees for outstanding performance.</li><li> Ensures that store team adheres to all employment practices and policies.<br/><br/></li></ul>Other duties as assigned.<br/><br/>This position may be found in multiple brands. Some duties may vary from brand to brand.<br/><br/><strong>Qualifications<br/><br/></strong><ul><li> High School diploma or equivalent</li><li> 2+ years of retail management experience preferred</li><li> Must be 18 years of age or older</li><li> Excellent communication, verbal, and written skills</li><li> Able to learn or adapt to technology provided by the company</li><li> Proven excellent customer service skills with statistical track record in all areas of sales and leadership</li><li> Strong organizational skills and ability to multi-task in a fast-paced environment</li><li> Strong leadership qualities, training and team building skills</li><li> Knowledge of administrative aspects of store operations</li><li> Able to communicate with customers and staff</li><li> Regular attendance is essential to this position to ensure adequate coverage to meet company objectives. Ability to work a flexible work schedule, including nights, weekends, and holidays is required<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li> Constant Walking/Standing- 67-100% of 8-hour shift</li><li> Occasional Lifting up to 50 lbs.- 1-33% of 8-hour shift</li><li> Frequent Climbing- 34%-66% of 8-hour shift<br/><br/></li></ul>The wage range for this position is $24.00 to $30.00. Successful candidates’ wage rates will be determined based on their individual qualifications for the position.<br/><br/>Due to our growth, we are always accepting applications for top talent to join our store teams. When we do have an open position, we will review your application to determine if your qualifications are a match with our position requirements. You may apply to any location or position at any time; however, the position to which you apply may not currently be open. Accommodation is available to applicants for employment with disabilities. To request accommodation during the application process, please contact your local Store Manager for assistance.<br/><br/>Chico’s FAS, Inc. is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, childbirth and related medical conditions, lactation, genetic information, gender, sexual orientation, gender identity or expression, military service, veteran status, or any other category protected under federal, state, or local law.", "responsibilities": "The Assistant Store Manager is responsible for supporting the Store Manager in promoting a customer and product-focused sales culture, where our values and guiding principles are at the forefront of all store operations, including managing sales operations, asset protection, and human resources functions to ensure great customer experience and maximum profitability. We love what we do, and believe that with our teams, we are the most amazing place to work, learn, and grow!", "qualifications": {"required": "High School diploma or equivalent, 2+ years of retail management experience preferred, Must be 18 years of age or older, Excellent communication, verbal, and written skills, Able to learn or adapt to technology provided by the company, Proven excellent customer service skills with statistical track record in all areas of sales and leadership, Strong organizational skills and ability to multi-task in a fast-paced environment, Strong leadership qualities, training and team building skills, Knowledge of administrative aspects of store operations, Able to communicate with customers and staff, Regular attendance is essential to this position to ensure adequate coverage to meet company objectives. Ability to work a flexible work schedule, including nights, weekends, and holidays is required", "preferred": "2+ years of retail management experience"}, "skills": [], "postedDate": "2 weeks ago", "salary": {"amount": "24.00 to 30.00", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3791781834"}