{"jobTitle": "Psychiatric Mental Health Nurse Practitioner (PMHNP)", "company": {"name": "BlueSky Telepsych, LLC", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Technology, Information and Internet", "description": "<strong>About BlueSky:<br/><br/></strong>We are a clinician-led, patient-centered, collaborative behavioral health company of mental health professionals committed to improving access to extremely high-quality mental health care! Each clinician is dedicated to evidence-based care. Our objective is to make our services more available to those in need of high-quality mental health care. We aim to serve not only those in rural areas but be available to all regions for those who would prefer to make use of the privacy, security, and convenience of a telehealth consultation.<br/><br/><strong>About the job:<br/><br/></strong><ul><li>Provide effective individual psychiatric care via telehealth in an outpatient setting.</li><li>Provide direct patient care, conduct patient assessments, develop treatment plans, and prescribe medications as necessary.</li><li>Ensure that all patient care is delivered in accordance with applicable laws, regulations, and ethical standards.</li><li>We are not affiliated with any hospitals or clinics; enjoy the autonomy of practicing in the best interest of the patient without corporate administrative interference.</li><li>We are growing in the form of teams composed of multiple therapists and a prescriber. With onboarding, you meet multiple eligible psychotherapists looking for additions to their team and a match is made.</li><li>We emphasize regular staffing with your collaborating therapists, at least monthly, to discuss patient cases or clinical topics.</li><li>Clinical work is performed from home, days and hours are per the clinician's choosing (this includes mornings, afternoons, evenings, weekends, holidays, etc.). Clinical team meetings are also virtual.</li><li>Clinical conferences are held four times a week. It is required that you attend at least one per week for the first 90 days of employment; after that, it is required that you attend one monthly.<br/><br/></li></ul><strong>Job Requirements:<br/><br/></strong><ul><li>Must have a PMHNP license and open to licensing in alternative states.</li><li>Prior work as a PMHNP preferred but not required</li><li>Ability to work collaboratively with a diverse group of healthcare professionals.</li><li>Solid computer and basic technology skills</li><li>Strong clinical background in psychiatry</li><li>Strong background in the diagnosis of psychiatric disorders and psychopharmacological treatments and familiarity with non-pharmacological interventions</li><li>Excellent verbal and written communication, organizational, and time management skills.<br/><br/></li></ul>HOURLY<br/><br/>Salary Range<br/><br/>$70—$100 USD", "postedDate": "8 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3792037645"}