{"jobTitle": "VP, Defined Benefit Sales", "company": {"name": "USI Insurance Services", "industry": "Insurance", "size": "600 employees", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$100,000 to $150,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Insurance", "description": "The VP, Defined Benefit Sales Producer is responsible for promoting all aspects of USI Consulting Group’s (USICG) defined benefit solutions and driving new business sales. Services include actuarial consulting, investment advisory, benefit administration co-sourcing and full outsourcing, and annuity placement services. The Producer will cover a large geographic region and work with CG sales peers focused on Defined Contribution sales.", "responsibilities": "Accountable for new business development. Includes lead generation campaigns, cold calling, and distribution of letters. Achieve annual new business sales target. Drive consistent and predictable profitability and organic growth to meet overall revenue goals. Build new relationships with plan sponsors, centers of influence, and strategic partners. Develop relationships with sales representatives on a local and regional level. Ensure wide distribution of products and services. Use USI resources to research prospects and develop customized messaging. Complete sales due diligence process. Understand and explain USI’s competitive differentiation to clients and prospects. Manage full-cycle of sales process. Coordinate meetings and develop client materials. Complete follow-up tasks, phone calls, proposals, presentations, and close business. Use USI’s contact management and sales automation tools to support sales processes. Input timely and accurate information to facilitate sales and revenue projections. Engage in meetings on preparing for first appointments, advancing and closing of business. Oversee preparation of proposals for USICG prospects. Includes gathering necessary information and working with department heads and consultants. Coordinate with appropriate team members to complete RFPs. Actively participate in USI sales training sessions.", "qualifications": {"required": "5+ years' experience in a sales related capacity. Bachelor’s Degree or equivalent combination of education and experience. Strong conceptual knowledge of defined benefit plans and key issues for plan sponsors. Series 6, 63 and 65 licenses or Series 7 and 66 licenses and state insurance license required or willing to obtain. Able to travel approximately 25% of the time based on territory. Personable, highly motivated and goal oriented. Driven to achieve individual sales goals. Strong financial aptitude. Strong center of influence connections. Comfortable presenting to C-Suite executives and multiple decision makers. Broad working knowledge of Microsoft Office suite, including Excel, Word, and PowerPoint. Detail oriented and strong organizational skills. Excellent oral, written and interpersonal communication skills.", "preferred": ""}, "skills": [], "postedDate": "1 week ago", "applicationDeadline": "", "benefits": "USI is committed to providing a full-suite of competitive benefits for our growing population and its diverse needs. We offer a wide range of health, welfare and financial benefits including medical, wellness, dental and vision, 401(k), flexible spending and health savings accounts, short and long-term disability, life insurance and other unique employer-sponsored and voluntary programs. USI also offers a generous paid family leave benefit as well as paid holiday time.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3797070964"}