{"jobTitle": "Stock Associate", "company": {"name": "Steve Madden", "industry": "Retail", "size": "51-200 employees", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$17.28/hr - $19.00/hr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Retail", "description": "Stock Associate (P/T)\n\nThe Stock Associate is responsible for verifying merchandise receipts, deliveries, and placement of merchandise in the stockroom.", "responsibilities": "Maintain a passion for both the product and delivering an exceptional customer experience. Process and replenish merchandise as needed, receive and monitor floor stock, and handle product movement in and out of the store. Ensure accurate and efficient stockroom operations, especially during peak hours. Provide clear and timely communication to management regarding product levels and any other needs related to stockroom operations. Assist in various store operations, including floor moves, visual merchandising, display maintenance, cleaning duties when necessary, and returning products to inventory as needed. Be flexible and occasionally perform work outside your specific role.", "qualifications": {"required": "1-2 years of retail experience preferred. High school diploma or equivalent preferred. Strong verbal and written communication skills. Ability to process information or merchandise through the computer system and POS register system. Ability to work a flexible schedule with retail hours, including day, evening, weekends, and/or holidays.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "50% off employee discount and 40% off immediate family discount, Friends and Family Discount Events, Free shoe every season/quarter, Employee Assistance Program, Flexible schedule, Career Growth, Employee Referral Program, Access to Steve Madden’s Perk Spot Program, 401K eligibility over the age of 21 with Company match after 6 months of employment, Paid time to vote, Experience at a fast-paced growing company that takes sustainability seriously; read our latest Sustainability Report.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3797995616"}