{"jobTitle": "Manager of Customer Service Administration", "company": {"name": "Crane Aerospace & Electronics", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "135,100 to 181,200", "currency": "USD"}, "jobFunction": "Other", "industry": "Manufacturing", "description": "<strong><strong>Crane Aerospace and Electronics </strong> has an exciting opportunity for </strong> a <strong> Manager of Customer Service Administration</strong>at ourBurbank, CA location.<br/><br/><strong> About Crane: <br/><br/></strong>Crane Aerospace &amp; Electronics supplies critical systems and components to the aerospace and defense markets. You’ll find Crane Aerospace &amp; Electronics in some of the toughest environments: from engines to landing gear; from satellites to medical implants and from missiles to unmanned aerial systems (UAS).<br/><br/>Every 1.2 seconds, product built at our Crane Aerospace &amp; Electronics Burbank facility is stopping aircraft – delivering passengers and military personnel safely to their destination. Home to our Landing &amp; Cabin Systems team, Crane A&amp;E’s brake control systems and premium cabin actuation solutions are flying on tens of thousands of aircraft throughout the world. You’ll join a business with a long track record of engineering excellence, set in the wonderful town of Burbank filled with great community atmosphere, schools, weather and no shortage of entertainment. Start the next chapter of your career with Crane Aerospace &amp; Electronics!<br/><br/><strong>Job Summary:<br/><br/></strong>Manager of Customer Service Administration leads and manages order management activities including contract administration, order fulfillment and customer service utilizing Crane Aerospace &amp; Electronics common policies and procedures. The Manager, Customer Service is responsible for managing the Customer Service team, ensuring that all necessary actions are taken to adhere to Crane Aerospace &amp; Electronics business processes, the annual operating plan is supported and order management activities are achieved in the most cost effective, efficient manner.<br/><br/><strong>Essential Functions:<br/><br/></strong><ul><li> Produce and manage metrics to support the annual operating plan, increase productivity and ensures compliance with Crane policies and procedures. </li><li> Manage customer assignments across the Customer Service team to balance workload, to effectively satisfy business needs and customers and ensure accurate and timely execution of order administration. </li><li> Responsible for customer satisfaction relative to the order fulfillment process including common processes, standard work and tools </li><li> Drives continuous improvement activities with the Customer Service team to increase the productivity of the team and ensures compliance with Crane policies and procedures. </li><li> Serves as an escalation point for the Customer Service team. </li><li> Enter and manage orders and reschedules, as necessary </li><li> Any other task assigned by supervisor or management <br/><br/><br/></li></ul><strong>Minimum Qualifications:</strong> <br/><br/><ul><li> Experience: 5+ years’ related experience. 3+ years of previous management experience. </li><li> Knowledge:</li><ul><li> Familiar with a variety of the field's concepts, practices, and procedures. </li><li> Knowledge of Aerospace and Defense Order Management, Contract terms, Manufacturing, People Management, Operational Excellence and lean office </li><li> Knowledge of ERP systems (preferably Oracle systems) </li></ul><li> Skills/Abilities:</li><ul><li> Demonstrated ability to plan and accomplish goals based on extensive experience and judgment. Demonstrated ADVANCED skills in all of the following responsibilities: employee development, team building, business acumen, continuous improvement, systems and tools, project management and Communication (written and verbal). </li><li> Proficient working and leading cross functional teams as well as demonstrated ability to solve problems </li><li> Strong communication skills and proven track record building relationships with internal and external customers. </li><li> Scorecard management knowledge and proven experience </li><li> Understands specific customer demand and coordinates with demand management as well as other stakeholders across the business </li></ul><li> Education/Certification: BS in Business or related field. </li><li> Eligibility Requirement: This position may require access to controlled data or information and therefore only US persons will be considered. As a US Department of Defense contractor, we are bound by the International Traffic in Arms Regulations (ITAR). <br/><br/></li></ul><strong> Top Benefits: <br/><br/></strong><strong><em>Salary range: $135,100 to $181,200. </em></strong> Several factors contribute to actual salary, including experience in a similar role or performing comparable job responsibilities, skills, training, and other qualifications. Some roles may be eligible for participation in performance-based bonus programs.<br/><br/>As a team member at Crane Aerospace and Electronics, you’ll enjoy:<br/><br/><ul><li> Benefits: Health care, dental or life insurance starting the first day of the month </li><li> Time Off: 15 days of paid time off that start accruing your first day at Crane and 12 paid holidays per year. </li><li> 401k Retirement Plan: 401k plan with company match </li><li> Education Reimbursement: eligible after 90 days of employment </li><li> Flexible work schedule: This position is eligible for our Crane Flex Hybrid schedule which allows for the option of up to 2 days/week of work-from-home. Some conditions apply which will be discussed during the interview process. Full policy to be provided after hire. <br/><br/><br/></li></ul>You can see a list of our benefits at https://www.craneae.com/company/careers or visit our website at www.CraneAE.com for more information on our company and great opportunities.<br/><br/>We are committed to operational excellence and world class processes. We employ Lean manufacturing techniques to optimize manufacturing efficiency and accuracy on all product lines. Our products are known for their technical strength, proven reliability and overall value.<br/><br/>In our efforts to maintain a safe and drug-free workplace, Crane Aerospace &amp; Electronics requires that candidates complete a satisfactory background check. FAA sensitive positions require employees to participate in a random drug test pool.<br/><br/>This description has been designed to indicate the general nature and level of work being performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.<br/><br/>Crane Company is an Equal Opportunity Employer and does not discriminate on the basis of race, color, creed, religion, sex, national origin, marital status, age, sexual orientation, gender identity, disability, pregnancy, medical condition, genetic information, protected veteran status or any other characteristic protected under federal, state, or applicable local law.", "responsibilities": "Manager of Customer Service Administration leads and manages order management activities including contract administration, order fulfillment and customer service utilizing Crane Aerospace &amp; Electronics common policies and procedures. The Manager, Customer Service is responsible for managing the Customer Service team, ensuring that all necessary actions are taken to adhere to Crane Aerospace &amp; Electronics business processes, the annual operating plan is supported and order management activities are achieved in the most cost effective, efficient manner.", "qualifications": {"required": "Experience: 5+ years’ related experience. 3+ years of previous management experience. \nKnowledge:\nFamiliar with a variety of the field's concepts, practices, and procedures. \nKnowledge of Aerospace and Defense Order Management, Contract terms, Manufacturing, People Management, Operational Excellence and lean office \nKnowledge of ERP systems (preferably Oracle systems) \nSkills/Abilities:\nDemonstrated ability to plan and accomplish goals based on extensive experience and judgment. Demonstrated ADVANCED skills in all of the following responsibilities: employee development, team building, business acumen, continuous improvement, systems and tools, project management and Communication (written and verbal). \nProficient working and leading cross functional teams as well as demonstrated ability to solve problems \nStrong communication skills and proven track record building relationships with internal and external customers. \nScorecard management knowledge and proven experience \nUnderstands specific customer demand and coordinates with demand management as well as other stakeholders across the business \nEducation/Certification: BS in Business or related field. \nEligibility Requirement: This position may require access to controlled data or information and therefore only US persons will be considered. As a US Department of Defense contractor, we are bound by the International Traffic in Arms Regulations (ITAR). ", "preferred": null}, "skills": ["Aerospace", "Defense", "Order Management", "Contract terms", "Manufacturing", "People Management", "Operational Excellence", "lean office", "ERP systems", "Oracle systems", "employee development", "team building", "business acumen", "continuous improvement", "systems and tools", "project management", "Communication", "cross functional teams", "problem solving", "Scorecard management", "customer demand", "demand management", "stakeholders"], "postedDate": "7 months ago", "applicationDeadline": null, "benefits": "Benefits: Health care, dental or life insurance starting the first day of the month \nTime Off: 15 days of paid time off that start accruing your first day at Crane and 12 paid holidays per year. \n401k Retirement Plan: 401k plan with company match \nEducation Reimbursement: eligible after 90 days of employment \nFlexible work schedule: This position is eligible for our Crane Flex Hybrid schedule which allows for the option of up to 2 days/week of work-from-home. Some conditions apply which will be discussed during the interview process. Full policy to be provided after hire.", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3799893357"}