{"jobTitle": "Chief of Staff", "company": {"name": "Universe Energy", "location": "Los Angeles, CA", "industry": "Technology, Information and Internet"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "postedDate": "7 months ago", "description": "We are Universe Energy, and we are the battery dismantling and repurposing company.<br/><br/>Our mission is to scale battery reuse as the largest source of the next billion batteries. The world needs 2 billion batteries by 2050, but this comes at a huge cost to the planet, as we need to mine 30x more. We dismantle and sort used battery packs 7x faster and 50% cheaper than by hand using robotics, AI and sound for EV OEMs, battery makers and fleets. Once we dismantle 1000s of battery packs, we repurpose them into $4000 cheap grid batteries that are 20% cheaper than making new ones. Our vision is to become the leading maker of zero-impact batteries by building 1 million batteries/year by 2035. This will power a truly clean energy revolution at scale and reduce 6 Giga tons of CO2 by 2050. We are Universe Energy, and we make batteries eternal.<br/><br/>Job objective<br/><br/>You will help shape go-to-market strategy and analyze scenarios for sourcing used batteries from suppliers and selling them to end-users as grid batteries. It entails developing financial &amp; economic models for battery manufacturers, repurposers, and recyclers. You will shape customer profiles, quantify pain points and grow funnels in grid storage, EV car makers, and recyclers. You help craft scenarios to define products and business models based on available battery volumes, grid storage pricing, and critical materials markets. You will track development in the state-of-the-art of battery models, architectures, and cells. You will work closely with the Head of Business Development and cofounding team on go-to-market strategy, business development, and ramping up operations. It is your opportunity to make the leap into a climate-tech startup and the battery industry with impact from day one.<br/><br/>How you will contribute<br/><br/><ul><li>Perform strategy analyses to define the go-to-market strategy, run value chain analyses, quantify business models and size markets for testing batteries, repurposing used batteries, and reselling raw materials.</li><li>Quantify the supply side for sourcing used batteries and demand for reselling batteries and materials. Provide support in interviewing suppliers, customers and partners in the value chain.</li><li>Run financial models and size markets of battery manufacturers, recyclers, and raw material refiners. Build pricing and cost models of used batteries, recycling operations, and critical materials.</li><li>Integrate and synthesize databases about mineral supply &amp; demand, battery pack capacity &amp; pricing, and end-of-first-life volumes.</li><li>Model environmental impact in energy, CO2, and fresh water in mining, processing, producing, and shipping batteries. </li><li>Analyze macroeconomic trends, regulations, and grant programs in the EU &amp; US markets on energy markets, raw materials, and battery demand.</li><li>Perform competitive landscaping of technologies, markets, and research groups in battery reuse and recycling. Track battery designs, volumes, and manufacturers for types, cells, and architectures.<br/><br/></li></ul><strong>The Skills &amp; Experience That You Bring<br/><br/></strong><ul><li>At least a B.Sc. in physics, engineering, mathematics, economics, or finance.</li><li>MBA program or M.Sc. in business, quantitative economics, finance, or operations.</li><li>2-3 yrs Experience in Strategy consultancy experience applied to product development, manufacturing, operations, or supply chain domains.</li><li>2-3 yrs experience in business or operational roles within high-growth startups or scale-ups in climate-tech, battery &amp; EV space, supply chains &amp; automation/manufacturing.</li><li>2-3 yrs Experience in building analytical models in Excel, SQL, and Python to run scenarios and build financial models while processing large amounts of raw data.</li><li>2-3 yrs Experience in financial modeling, cash flow projections, unit economics, market sizing, value chain analyses, and impact analyses.</li><li>Fluent in presenting data and insight in compelling slide decks to communicate the main findings. Verbally strong in reasoning towards best solutions based on first principles and latest data.<br/><br/></li></ul>How to hit a homerun<br/><br/><ul><li>Exposure to battery manufacturing, automation, or operational environments.<br/><br/></li></ul>Reach out to careers@universeenergy.ai for questions, comments and/or feedback before applying.", "jobFunction": "Administrative", "skills": [], "url": "https://www.linkedin.com/jobs/view/3800629849"}