{"jobTitle": "PR Manager", "company": {"name": "Partner Engineering Test Company", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Technology, Information and Internet", "description": "We are seeking a Public Relations Manager (PR Manager) to nurture a strong industry network, increase awareness and develop an enviable corporate image by developing and executing effective communication and media relations programs.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Develop a marketing communications plan including strategy, goals, budget and tactics</li><li>Develop media relations strategy, seeking high-level placements in print, broadcast and online media</li><li>Coordinate all public relations activities</li><li>Direct social media team to engage audiences across traditional and new media</li><li>Leverage existing media relationships and cultivate new contacts within business and industry media</li><li>Manage media inquiries and interview requests</li><li>Create content for press releases, byline articles and keynote presentations</li><li>Monitor, analyze and communicate PR results on a quarterly basis</li><li>Evaluate opportunities for partnerships, sponsorships and advertising on an on-going basis. </li><li>Build relationships with thought leaders to grow industry awareness</li><li>Maintain a keen understanding of industry trends affecting clients and make appropriate recommendations regarding communication strategy surrounding them<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Proven working experience in public relations required</li><li>Proven track record designing and executing successful public relations campaigns at both a local and national level</li><li>Strong relationships with both local and national business and industry media outlets</li><li>Experience in acting as a company spokesperson; comfortable and skilled in both broadcast and print media interviews</li><li>Exceptional writing and editing skills</li><li>Solid experience with social media including blogs, Facebook, Twitter, etc. </li><li>Event planning experience</li><li>BA/MA degree in Marketing, Advertising, Communications or a related discipline</li></ul>", "postedDate": "8 months ago", "skills": ["Public Relations", "Media Relations", "Marketing Communications", "Social Media", "Event Planning", "Writing", "Editing"], "url": "https://www.linkedin.com/jobs/view/3802907731"}