{"jobTitle": "Assistant Store Manager - Merchandising", "company": {"name": "The Home Depot", "location": "Santa Ana, CA"}, "location": "Santa Ana, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "<strong>Position Purpose<br/><br/></strong>Assistant Store Managers in Training are learning the various responsibilities and functions of the following roles: Assistant Store Manager, Operations Assistant Store Manager, Night Operations Assistant Store Manager, and Specialty Assistant Store Manager. At a high level, ASM's in Training will learn how to support the Store Manager in developing strategies and objectives toward driving store sales and profitability. They will learn how to accomplish these objectives through effective leadership of and communication to their Associates.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>General Customer Service Initiatives to include supervising Associates in the selling effort, ensuring the store's in-stock position, and maintaining an appealing and organized store</li><li>appearance. ASM's in Training will learn the following tactics to support this key accountability: staffing and scheduling, identifying and resolving stock deficiencies, supervisor associates in selling behaviors, resolving customer issues and concerns, and supporting service needs for both installed sales/special orders and product sales.</li><li>Supervising Store Associates to include interviewing, hiring, motivating, coaching, training,developing, and communicating to associates. ASM's in Training will also learn the performance management process, to include semi-annual review of associate performance and how to execute the associate disciplinary process when necessary.</li><li>Operations Management to include supervision of front end processes involving sales and return transactions, as well as special services and lot support. ASM's in Training will also learn</li><li>how to oversee the back end processes, including receiving and freight teams to ensure that merchandise is received and stocked appropriately. They will also learn how to maintain and</li><li>operate all store equipment and systems as well as how to manage daily financial operations. ASM's in Training should develop a command of store standard operating procedures (SOP's),</li><li>especially those involving Safety compliance.</li><li>Business Analysis and Merchandise Planning Initiatives to include driving department profitability through analysis of sales trends. ASM's in Training will learn how to work with key partners (Store Managers, Field Merchandising, MET Teams) to plan merchandise placement and signing. They will also learn how to support stock integrity through inventory management processes.<br/><br/></li></ul><strong>Direct Manager/Direct Reports<br/><br/></strong><ul><li>ASM's in Training will report to a Store Manager. Once complete with their training process, they will gradually assume accountability supervision of work activities of associates.<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong><ul><li>Typically requires overnight travel less than 10% of the time.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.<br/><br/></li></ul><strong>Working Conditions<br/><br/></strong><ul><li>Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable.<br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Must be eighteen years of age or older.</li><li>Must be legally permitted to work in the United States.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>No additional qualifications<br/><br/></li></ul><strong>Minimum Education<br/><br/></strong><ul><li>The knowledge, skills and abilities typically acquired through the completion of a high school diploma and/or GED.<br/><br/></li></ul><strong>Preferred Education<br/><br/></strong><ul><li>No additional education<br/><br/></li></ul><strong>Minimum Years Of Work Experience<br/><br/></strong><ul><li>3<br/><br/></li></ul><strong>Preferred Years Of Work Experience<br/><br/></strong><ul><li>No additional years of experience<br/><br/></li></ul><strong>Minimum Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Preferred Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Certifications<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Acts with Integrity: Role model for ethical behavior; consistent and fair in dealings with others.</li><li>Product Knowledge: Knows and effectively promotes all areas, products, services, and procedures. Knows the competition</li><li>Excels in Customer Service: Creates customer focused environment; provides excellent service.</li><li>Inspires Achievement: Initiates actions to develop Associates; provides performance feedback and recognizes accomplishments</li><li>Safety Orientation: Enforces safety policies and procedures; is a safety role model</li><li>Delivers Results: Creates a sense of urgency; delegates appropriately; motivates self and team to accomplish objectives.</li></ul>", "postedDate": "7 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3803536984"}