{"jobTitle": "Retail Store Associate - Citadel Outlets, 6202, Commerce, CA", "company": {"name": "adidas", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "size": "Not specified", "location": "Commerce, CA"}, "location": "Commerce, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$16.50/hr - $21.45/hr", "currency": "USD"}, "jobFunction": "Sales and Customer Service", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "description": "At adidas we have been challenging the status quo for over 70 years and we’re not done yet. We are calling all Store Associates who don’t accept what “was” or what “is,” but those who want to create what will be, and who share our desire to make a difference. We believe sport has the power to change lives. To bring this mission to life we foster a culture centered on creativity, confidence, and collaboration, and while we will never rest on our laurels, we are humbled that this has allowed us to be recognized as one of the “world’s most attractive employers.” We also understand that the future runs on diverse and fresh perspectives. True to this spirit, we believe in assembling talented teams from far and wide and unite by a common goal: to change the world through sport. Ready to apply? Here’s what you need to know: Availability must be flexible and include evenings and weekends. Hours are part time and will vary based on business needs. You must have or be pursuing a high school diploma or general education degree (GED). Three to six month’s experience working in a retail environment preferred. Basic numeracy, literacy, and verbal communication skills required. Must be 16 years of age or older. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and ability to adjust focus. Why adidas? Diversity, Equity, and Inclusion at adidas means championing individual uniqueness and cultivating a culture of belonging in which everyone can create at their best. We embrace diverse backgrounds, experiences, and perspectives and seek to create a workforce that reflects our consumers and communities. adidas offers Part-Time employees working between 20-29 hours per week a robust and progressive medical plan, including HSA (Health Savings Account) prescription drug coverage and fertility support. adidas offers Part-Time employees working less than 20 hours per week receive discounts for prescription drug coverage and vision services. Once eligibility criteria is met, employees are able to enroll in adidas’ 401k plan, Stock Purchase Plan with employer match and for education assistance. Employees are eligible to earn monthly and quarterly incentives. Employees accrue prorated flexible time off in the amount 1 hour per every 30 hours worked. Part-time employees receive premium pay when working on one of the seven retail designated holidays. The anticipated low and high end of the base pay range for this position is $17.28-$21.45. Actual salary will be based on various factors, such as a candidate’s experience, qualifications, skills and competencies, proficiency for the role. Though our teammates hail from all corners of the world, our working language is English. adidas participates in E-Verify. For more information, visit https://www.uscis.gov/e-verify.", "responsibilities": "Availability must be flexible and include evenings and weekends. Hours are part time and will vary based on business needs. You must have or be pursuing a high school diploma or general education degree (GED). Three to six month’s experience working in a retail environment preferred. Basic numeracy, literacy, and verbal communication skills required. Must be 16 years of age or older. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and ability to adjust focus.", "qualifications": {"required": "You must have or be pursuing a high school diploma or general education degree (GED). Three to six month’s experience working in a retail environment preferred. Basic numeracy, literacy, and verbal communication skills required. Must be 16 years of age or older.", "preferred": "Availability must be flexible and include evenings and weekends."}, "skills": ["Retail experience", "Customer service", "Communication skills", "Teamwork", "Flexibility"], "postedDate": "1 week ago", "applicationDeadline": "Not specified", "benefits": "adidas offers Part-Time employees working between 20-29 hours per week a robust and progressive medical plan, including HSA (Health Savings Account) prescription drug coverage and fertility support. adidas offers Part-Time employees working less than 20 hours per week receive discounts for prescription drug coverage and vision services. Once eligibility criteria is met, employees are able to enroll in adidas’ 401k plan, Stock Purchase Plan with employer match and for education assistance. Employees are eligible to earn monthly and quarterly incentives. Employees accrue prorated flexible time off in the amount 1 hour per every 30 hours worked. Part-time employees receive premium pay when working on one of the seven retail designated holidays.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3803808457"}