{"jobTitle": "Senior Associate / Associate Manager, Sales Strategy and Planning", "company": {"name": "DoorDash", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$99,400.00/yr - $165,600.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "About The Team<br/><br/>Our sales and partner management teams are the heart and soul of DoorDash, enabling us to partner with top restaurants across the country to drive revenue and help our partners operate even better. As DoorDash grows both in scale and breadth of offering, the strength of our sales engine and organizational structure must grow with it.<br/><br/>About The Role<br/><br/>DoorDash is looking for a strong individual contributor within Sales Strategy - Sales Planning &amp; Incentives, to execute top company business objectives and help define our sales strategy and planning roadmap.<br/><br/>In this role within the Sales Strategy and Planning team, you will combine strategic planning and analysis with operational execution. Responsibilities will range from strategic (designing incentives aligned to the company's goals and strategy, integrating new products into sales GTM strategy and building consensus among sales leadership) to operational/tactical (designing compensation plans, driving plan implementation and ensuring key metrics can be communicated, tracked and commissions calculated). You will bring a strategic mindset and deliver critical insights using analytical and technical support to the successful administration of sales incentive programs globally while proactively building partnerships, promoting open dialogue and creative insights expertise to issues in real time.<br/><br/>We are open to Senior Associate and Associate Manager level for this role based on your experience and interview performance. You will report into the Senior Manager of Sales Strategy and Planning within the Sales Planning &amp; Incentives organization.<br/><br/>You’re Excited About This Opportunity Because You Will…<br/><br/>• Work closely with sales leadership, sales strategy, finance, and product teams to own the development, implementation and administration of new and existing sales incentive structures<br/>• Work closely with cross-functional partners (product, finance, sales, sales operations) to build and maintain complex forecast models that drive the sales organization’s goals<br/>• Continuously assess business performance, drive diagnostics and deliver data-driven recommendations on ways to improve output<br/>• Set and track to accurate quota targets across various Sales Organizations that align with our strategic topline goals<br/>• Work cross functionally with product managers and sales leadership to ladder sales goals into company and product goals<br/>• Incorporate new products into Sales Organizations by partnering to design GTM Strategy and the correct goals/incentives<br/>• Translate data into effective narratives to present to cross-functional business partners<br/>• Create compelling and accurate visualization reports that track sales commissions while providing insights into business performance <br/>• Focus on improving standardization and automation of all processes to do with quota, incentive design and attainment/commissions tracking<br/>• Become the subject matter expert on sales data, sales incentives, while also gaining a comprehensive understanding of the sales process and drivers for each business unit we support<br/><br/>We’re Excited About You Because…<br/><br/>• You have 3+ years (Senior Associate) or 4+ years (Associate Manager) of experience in any of the following fields: sales/business planning, strategy &amp; operations, business consulting, analytics<br/>• You have a proven track record of leading cross-functional initiatives, hitting goals, and succeeding in a complex and fast moving environment<br/>• You’re an excellent analytical thinker who can deliver actionable recommendations out of complex datasets; SQL experience strongly preferred as is experience with Salesforce/Excel<br/>• You have expert communication and interpersonal skills<br/>• You’re entrepreneurial – You have a bias towards action, an ownership mentality and are able to thrive in a fast-paced, constantly changing work environment<br/>• You’re naturally curious – You always look for ways to innovate and improve and want to share the vision and direction of the company<br/>• You’re a relationship-builder – You can influence and motivate people at all levels across a variety of job functions<br/>• You’re a problem solver – You can independently translate high-level goals into actionable plans<br/><br/>Nice to Haves <br/><br/>• You have experience working with sales organizations<br/>• You have experience with sales incentive design<br/>• You have experience with Incentive Management tools (e.g. Anaplan)<br/><br/>About DoorDash<br/><br/>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users—from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods.<br/><br/>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees’ happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br/><br/>Our Commitment to Diversity and Inclusion<br/><br/>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br/><br/>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on “protected categories,” we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce – people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br/><br/>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br/><br/>If you need any accommodations, please inform your recruiting contact upon initial connection.<br/><br/>Compensation<br/><br/>The location-specific base salary range for this position is listed below. Compensation in other geographies may vary.<br/><br/>Actual compensation within the pay range will be decided based on factors including, but not limited to, skills, prior relevant experience, and specific work location. For roles that are available to be filled remotely, base salary is localized according to employee work location. Please discuss your intended work location with your recruiter for more information.<br/><br/>DoorDash cares about you and your overall well-being, and that’s why we offer a comprehensive benefits package, for full-time employees, that includes healthcare benefits, a 401(k) plan including an employer match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, paid time off, paid parental leave, and several paid holidays, among others.<br/><br/>In addition to base salary, the compensation package for this role also includes opportunities for equity grants.<br/><br/>Applications for this position are accepted on an ongoing basis<br/><br/>We use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on June 20, 2024.<br/><br/>Please see the independent bias audit report covering our use of Covey here.<br/><br/>Colorado Pay Range:<br/><br/>$99,400—$149,000 USD<br/><br/>California Pay Range:<br/><br/>$104,900—$165,600 USD<br/><br/>New York Pay Range:<br/><br/>$110,400—$165,600 USD<br/><br/>Washington Pay Range:<br/><br/>$104,900—$157,300 USD<br/><br/>Washington D.C. Pay Range:<br/><br/>$104,900—$157,300 USD", "responsibilities": "Work closely with sales leadership, sales strategy, finance, and product teams to own the development, implementation and administration of new and existing sales incentive structures\nWork closely with cross-functional partners (product, finance, sales, sales operations) to build and maintain complex forecast models that drive the sales organization’s goals\nContinuously assess business performance, drive diagnostics and deliver data-driven recommendations on ways to improve output\nSet and track to accurate quota targets across various Sales Organizations that align with our strategic topline goals\nWork cross functionally with product managers and sales leadership to ladder sales goals into company and product goals\nIncorporate new products into Sales Organizations by partnering to design GTM Strategy and the correct goals/incentives\nTranslate data into effective narratives to present to cross-functional business partners\nCreate compelling and accurate visualization reports that track sales commissions while providing insights into business performance \nFocus on improving standardization and automation of all processes to do with quota, incentive design and attainment/commissions tracking\nBecome the subject matter expert on sales data, sales incentives, while also gaining a comprehensive understanding of the sales process and drivers for each business unit we support", "qualifications": {"required": "You have 3+ years (Senior Associate) or 4+ years (Associate Manager) of experience in any of the following fields: sales/business planning, strategy &amp; operations, business consulting, analytics\nYou have a proven track record of leading cross-functional initiatives, hitting goals, and succeeding in a complex and fast moving environment\nYou’re an excellent analytical thinker who can deliver actionable recommendations out of complex datasets; SQL experience strongly preferred as is experience with Salesforce/Excel\nYou have expert communication and interpersonal skills\nYou’re entrepreneurial – You have a bias towards action, an ownership mentality and are able to thrive in a fast-paced, constantly changing work environment\nYou’re naturally curious – You always look for ways to innovate and improve and want to share the vision and direction of the company\nYou’re a relationship-builder – You can influence and motivate people at all levels across a variety of job functions\nYou’re a problem solver – You can independently translate high-level goals into actionable plans", "preferred": "You have experience working with sales organizations\nYou have experience with sales incentive design\nYou have experience with Incentive Management tools (e.g. Anaplan)"}, "skills": ["Sales", "Business Development", "Sales Strategy", "Sales Operations", "Sales Planning", "Incentive Design", "Analytics", "SQL", "Salesforce", "Excel", "Communication", "Interpersonal Skills", "Entrepreneurial", "Problem Solving"], "postedDate": "6 days ago", "benefits": "DoorDash cares about you and your overall well-being, and that’s why we offer a comprehensive benefits package, for full-time employees, that includes healthcare benefits, a 401(k) plan including an employer match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, paid time off, paid parental leave, and several paid holidays, among others.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3805570078"}