{"jobTitle": "Executive Medical Director - GP/Urgent Care", "company": {"name": "Papaya Veterinary Care", "location": "Los Angeles Metropolitan Area", "industry": "Veterinary Services"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "salary": {"amount": "150,000.00 - 200,000.00", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Veterinary Services", "description": "Executive Medical Director - GP/Urgent Care – Culver City<br/><br/>Papaya Veterinary Care is looking for an Executive Medical Director for our brand new Culver City GP/Urgent Care Hospital.<br/><br/>The Executive Medical Director is the key leader of each hospital and will partner with the Hospital Manager<br/><br/>to grow and manage the practice. This position is for a start-up company, with 4 hospitals planned to open in the Los Angeles and San Diego markets. This is a ground level opportunity to earn ownership equity by being an early leader and growing their home hospital. This start-up is aiming to make the industry's top veterinarians' business partners.<br/><br/>We are a transformative veterinary hospital that offers an elevated level of care to both our patients (fur<br/><br/>babies) and caregivers (clients). At Papaya Veterinary Care, our mission is to disrupt the current standard that<br/><br/>falls short in providing thorough, available, and continuous care. By providing a positive and healthy work<br/><br/>culture for our staff, we can commit to creating an exceptional and uplifting experience for all our clients,<br/><br/>patients, and employees.<br/><br/>Our hospital is in the wonderful neighborhood of Sawtelle. Our hospital is just 4000 square feet with a spacious lobby designed for comfort of those waiting, an urgent care room, dental suite with two dental tables, a doctor’s office, and spacious break room for staff to put up their feet. We share a common passion for animals and thrive in a collaborative environment. If you are looking for an elevated experience in Veterinary Care, you have come to the right place!<br/><br/>Duties and Responsibilities: <br/><br/>\n<ul><li>Spearhead recruiting, hiring, mentoring and development of hospital DVM staff for a GP/UC veterinary hospital. </li><li>In addition to Leadership duties, the Medical Director will also be a practicing veterinarian. </li><li>Participate in new hospital opening training. Provide constructive feedback to improve future iterations. </li><li>Partner with Field Leadership to interview and select the Hospital Manager</li><li>Support and partner with Hospital Manager in the recruiting, hiring, training and development of hospital staff. </li><li>Foster an environment of responsibility and resilience. </li><li>Participate in future quarterly Advisory Board meetings. </li><li>Help roll out and provide timely feedback on company initiatives, tech developments and other programs that impact hospital operations. </li><li>Actively participate in Company Leadership training. Provide constructive feedback to improve future iterations. </li><li>Other duties as assigned. </li><li>Fosters a culture of friendly client service. </li><li>Engage with staff and clients in a friendly and approachable manner. </li><li>Develop and drive hospital standards of care. </li><li>In partnership with the Hospital Manager, develop and execute hospital strategic plan to achieve key growth targets. </li><li>In partnership with the Hospital Manager, manage expenses and drive business to meet budgetary goals. </li><li>In partnership with Hospital Manager develop hospital specific SOPs<br/><br/></li></ul>Requirements: <br/><br/>\n<ul><li>Minimum of 6 years in practice </li><li>Minimum of 3 years management experience with P&amp;L responsibility </li><li>Ability and willingness to see Urgent Care cases</li><li>Valid license to practice veterinary medicine in the state of California </li><li>Ability and desire to see urgent care cases </li><li>Ability to mentor and train associate veterinarians in every facet of their job </li><li>Willing and able to work in an ever-changing environment<br/><br/></li></ul>Benefits:<br/><br/>\n<ul><li>401(K) matches, 100% up to 4%</li><li>DEA and Veterinary License reimbursement</li><li>Professional Liability Insurance</li><li>Medical, Dental and Vision benefits</li><li>Paid time off</li><li>Pet care discount</li><li>Professional Development</li><li>Equity Incentive Program<br/><br/></li></ul>Job Type: Full-time<br/><br/>Salary: $150,000 - $200,000 per year<br/><br/>Medical specialties:<br/><br/>\n<ul><li>Primary Care</li><li>Urgent Care<br/><br/></li></ul>Schedule:<br/><br/>\n<ul><li>10-hour shift<br/><br/></li></ul>Supplemental pay types:<br/><br/>\n<ul><li>Production Bonus<br/><br/></li></ul>Ability to commute/relocate: Culver City, CA 90066: Reliably commute or willing to relocate with an employer provided relocation package (Required)<br/><br/>Work Location: In person", "responsibilities": "Spearhead recruiting, hiring, mentoring and development of hospital DVM staff for a GP/UC veterinary hospital. In addition to Leadership duties, the Medical Director will also be a practicing veterinarian. Participate in new hospital opening training. Provide constructive feedback to improve future iterations. Partner with Field Leadership to interview and select the Hospital ManagerSupport and partner with Hospital Manager in the recruiting, hiring, training and development of hospital staff. Foster an environment of responsibility and resilience. Participate in future quarterly Advisory Board meetings. Help roll out and provide timely feedback on company initiatives, tech developments and other programs that impact hospital operations. Actively participate in Company Leadership training. Provide constructive feedback to improve future iterations. Other duties as assigned. Fosters a culture of friendly client service. Engage with staff and clients in a friendly and approachable manner. Develop and drive hospital standards of care. In partnership with the Hospital Manager, develop and execute hospital strategic plan to achieve key growth targets. In partnership with the Hospital Manager, manage expenses and drive business to meet budgetary goals. In partnership with Hospital Manager develop hospital specific SOPs", "qualifications": {"required": "Minimum of 6 years in practice Minimum of 3 years management experience with P&L responsibility Ability and willingness to see Urgent Care casesValid license to practice veterinary medicine in the state of California Ability and desire to see urgent care cases Ability to mentor and train associate veterinarians in every facet of their job Willing and able to work in an ever-changing environment", "preferred": null}, "skills": [], "postedDate": "7 months ago", "applicationDeadline": null, "benefits": "401(K) matches, 100% up to 4%DEA and Veterinary License reimbursementProfessional Liability InsuranceMedical, Dental and Vision benefitsPaid time offPet care discountProfessional DevelopmentEquity Incentive Program", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3806498454"}