{"jobTitle": "Field Crew Lead", "company": {"name": "PRO EM National Event Services", "location": "Vernon, CA"}, "location": "Vernon, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Events Services", "description": "The Crew Lead performs tasks involving management of crew, on-site point-of-contact for the client, physical labor at job sites and heavy construction projects. The position may operate a variety of hand and power tools and may clean and prepare sites, unload erect and dismantle event equipment such as (but not limited to) structures, tenting, flooring, power and HVAC.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Manage onsite field crew.</li><li>Liaison between sales rep and client on-site.</li><li>On-site point-of-contact for the client.</li><li>Load and unload trucks on job sites.</li><li>Unload erect and dismantle event equipment Crew Lead or Project Manager such as, but not limited to the following</li><li>Temporary structures/tents.</li><li>Flooring, scaffolding and staging.</li><li>Power, distribution, and HVAC.</li><li>Lighting and décor.</li><li>Fencing and barricades <br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Fluent in Spanish and English.</li><li>Must be able to lift 50+ lbs.</li><li>Able to be on their feet for upwards of 8 hours a day.</li><li>Previous tent construction and take down experience preferred.</li><li>Must be able to pass a pre-employment drug screen.</li><li>Excellent customer service skills.</li><li>Ability to work nights, weekends and holidays.</li><li>Ability to communicate effectively with others both orally and in writing.</li><li>Ability to walk, climb stairs, and stand for extended periods of time (8+ hours).</li><li>Ability to work outside in extreme weather conditions.</li><li>Ability to comprehend numerous policies, procedures, concepts and to respond using discretion based on general and client-specific policies.</li></ul>", "postedDate": "7 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3807693654"}