{"jobTitle": "BOH Supervisor", "company": {"name": "Tocaya Modern Mexican", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Other", "industry": "Restaurants", "description": "We are looking for future leaders who are ready to grow with our brand!<br/><br/><strong>At Tocaya we use bold flavors and the best ingredients to proudly create our signature \"Modern Mexican\" cuisine. Our versatile menu is rooted in traditional Mexican recipes and naturally accommodates a variety of preferences including vegan, vegetarian, and gluten-free.<br/><br/></strong><strong>Our methods and flavor-focused menu inspire a growing group of loyal guests who join us multiple times a week, eager to introduce the Tocaya experience to their friends as well.<br/><br/></strong>The Supervisor is responsible for assisting the Executive Chef and General Manager in maintaining a positive environment and setting a positive tone and flow for the shift. Supervisors are responsible for overseeing opening/closing setup and procedures, perform daily food safety and quality checks, and lead pre-shift meetings. Supervisors should also be fully capable of interviewing, hiring and training staff, submitting nightly reporting (including large monetary handling), and being fully versed in, and capable of performing, all positions as needed in addition to assisting guests and handling guest complaints.<br/><br/><strong>Setting the tone:<br/><br/></strong>A Successful Supervisor:<br/><br/><ul><li>Knows the importance of leading a team with positivity and \"leaving our baggage at the door.\"</li><li>Uses pre-shifts to inform our team of any menu changes or special events and to motivate them before a shift</li><li>Establishes effective and positive communication with all team members<br/><br/></li></ul><strong>Store Operations:<br/><br/></strong><ul><li>Maintains a clean, organized and stocked environment</li><li>Performs successful opening and closing procedures of the store, including set up, break down, and prep and distribution of all catering orders</li><li>Assists the General Manager in ensuring that the store maintains customer service standards and team members adhere to meal and break policies</li><li>Ensures all cash handling procedures are upheld. Is accountable for store funds while running a shift</li><li>Assigns duties to staff during shifts</li><li>Consistently sets an example for all team members by adhering to and enforcing policies</li><li>Effectively implements new menu rollouts and educates team members on said rollouts</li><li>Promotes and enforces safe work practices, maintaining safety standards and procedures in the restaurant and filing appropriate reports for any incidents that occur</li><li>Reports potential safety hazards and operational inconsistencies<br/><br/></li></ul><strong>Product:<br/><br/></strong><ul><li>Tastes products during the shift for quality control</li><li>Follows and enforces all company recipes/procedures/processes</li><li>Ensures all team members have the most up to date menu and SOP knowledge<br/><br/></li></ul><strong>Qualifications:<br/><br/></strong><ul><li>Basic computer skills required</li><li>Capable of working overtime, weekends, evenings, and special events as needed</li><li>Must be well organized, capable of multitasking, and extremely detail oriented</li><li>Must have excellent verbal and written communication skills</li><li>Knowledge of the industry and relevant health and safety regulations. Current manager food handler card</li><li>Has leadership skills and ability to make decisions quickly and under pressure<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Must be able to lift up to 50 lbs, and frequently lift and bend from the waist</li><li>Must be able to stand for long periods</li><li>This position requires frequent use of hands and arms in repetitive motions</li><li>Must be able to adjust vision to both day and night lighting, and be able to focus on both distant and close ranges</li><li>Regularly required to handle hot food and alcoholic beverages</li><li>High school diploma or GED is preferred<br/><br/></li></ul>Pay rate: $19.25 + Tips", "responsibilities": "The Supervisor is responsible for assisting the Executive Chef and General Manager in maintaining a positive environment and setting a positive tone and flow for the shift. Supervisors are responsible for overseeing opening/closing setup and procedures, perform daily food safety and quality checks, and lead pre-shift meetings. Supervisors should also be fully capable of interviewing, hiring and training staff, submitting nightly reporting (including large monetary handling), and being fully versed in, and capable of performing, all positions as needed in addition to assisting guests and handling guest complaints.", "qualifications": {"required": "Basic computer skills required, Capable of working overtime, weekends, evenings, and special events as needed, Must be well organized, capable of multitasking, and extremely detail oriented, Must have excellent verbal and written communication skills, Knowledge of the industry and relevant health and safety regulations. Current manager food handler card, Has leadership skills and ability to make decisions quickly and under pressure", "preferred": "High school diploma or GED is preferred"}, "skills": ["Computer Skills", "Communication", "Leadership", "Food Safety", "Customer Service"], "postedDate": "7 months ago", "benefits": null, "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3807985253"}