{"jobTitle": "Legal Assistant", "company": {"name": "Klinedinst PC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Legal", "industry": "Internet Publishing", "description": "Put your career into high gear as a Legal Assistant at Klinedinst’s Los Angelesoffice. Across the West, Klinedinst is dedicated to providing top-caliber legal services, while nurturing the professional development and personal advancement of each and every employee. We work hard to promote a positive, vibrant culture built on teamwork and inclusion. If you are interested in joining our team of professionals and are ready for immediate responsibility with growth opportunities, Klinedinst is the place.<br/><br/>Our staff and lawyers work side-by-side throughout every client’s matter to ensure success at every step. At Klinedinst, lawyers and professional staff alike reach across practice areas and geographies to work together in a connected, collegial and entrepreneurial atmosphere.<br/><br/>Applicants should have at least 5 years of experience, and be seeking opportunity on a fast-paced legal team servicing clients. This role allows for the development of working relationships within a team, and will be working alongside fascinating attorneys and other team members in a fast-paced environment.<br/><br/>The core essential traits ideal for this role include:<br/><br/> <ul><li>Intricate knowledge of the civil litigation process (state and federal)</li><li>Minimum 5 years of experience as a legal assistant or legal secretary</li><li>Excellent organizational and communication skills</li><li>Dedication to excellence in legal services</li><li>Self-starting, positive attitude</li><li>Proactive thinker</li><li>Pay range: $37.02-$40.86 per hour(depends on experience)<br/><br/></li></ul>We provide support in a friendly, team-oriented environment that allows for immediate responsibility and growth potential. Pay ranges are provided in compliance with SB1162, California’s pay transparency law; actual pay may vary based on a variety of factors, including education, applicable experience, etc. Come join our team and you will have the opportunity to work with a dynamic and talented group of professionals!<br/><br/>The Klinedinst environment includes:<br/><br/> <ul><li>Supportive team-based law firm, with excellent support staff</li><li>Opportunities to grow personally and professionally</li><li>Opportunities to work on complex cases with significant responsibilities and client interaction</li><li>Open, honest, and transparent communication within the firm</li><li>Merit-based compensation</li><li>This job requires regular attendance to the office for the first 180 days, though as adynamic culture we embraceopportunities for remote working arrangements when eligible<br/><br/></li></ul>Please submit your resume today. Recruiters need not apply.<br/><br/>Powered by JazzHR<br/><br/>GLAC3smZYc", "postedDate": "7 months ago", "salary": {"amount": "37.02/hr - $40.86/hr", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3808135542"}