{"jobTitle": "Couriers & Delivery Drivers Wanted! Earn up to $30/hr on Your Schedule", "company": {"name": "Jackalope", "location": "San Bernardino, CA"}, "location": "San Bernardino, CA", "jobType": "Full-time", "employmentType": "Freelancer", "experienceLevel": "Entry level", "salary": {"amount": "30", "currency": "Per hour"}, "jobFunction": "Management and Manufacturing", "industry": "Consumer Services", "description": "Meet Jackalope, the app that makes it easier to be your own boss, earn more, and work smarter, not harder. We're hiring couriers and delivery drivers for food delivery opportunities in your area. You have the choice of mode of transportation, so you can use a car, bike, motorcycle, or even walk, to complete deliveries.Download the Jackalope app to begin the Gig Matching process, where you'll provide your preferences and area, and you'll be matched with specific opportunities where you can complete your application. You choose your schedule, only work when you want to. Top earners on the platform consistently make up to $30/hr and you keep 100% of the tips.Juggling multiple gigs is never easy, that's why we built Jackalope's Scheduling tool from the ground up to help you plan your work week. Manage all your jobs, tasks and errands all in one place.Being your own boss means tracking your own finances. It's important to keep track of all your expenses and mileage so that you can maximize your tax deductions when tax season rolls around. That's why we've built a streamlined Finance tool to make money management a breeze.Self-employment doesn't have to be so complicated. Our community also gets access to curated promos and exclusive rewards. Are you ready to make the leap? Download Jackalope today — it's free.iOS: https://apps.apple.com/us/app/id1517552234Android: https://play.google.com/store/apps/details?id=com.jackalopework.jackalope<br/><br/>Additional information:Salary: 30Frequency: Per hourEmployment type: Freelancer", "postedDate": "7 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3809110643"}