{"jobTitle": "Office Representative - State Farm Agent Team Member", "company": {"name": "State Farm Agent", "location": "Burbank, CA"}, "location": "Burbank, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "44,000.00 - 62,000.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Insurance", "description": "Responsive recruiter<br/><br/>Replies within 24 hours<br/><br/><strong>Role Description<br/><br/></strong>As a Office Representative - State Farm Agent Team Member with Isabel Munoz - State Farm Agent, you will generate the kind of exceptional client experiences that reinforce the growth of a successful insurance agency. Your attention to detail, customer service skills, and desire to help people make you an ideal fit. You will enhance your career while resolving customer inquiries, coordinating with other agency team members, and anticipating the needs of the community members you support.<br/><br/>We look forward to connecting with you if you are the ideal customer-focused and empathetic team member we are searching for. We anticipate internal growth opportunities for especially driven and sales-minded candidates.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Establish customer relationships and follow up with customers as needed.</li><li>Provide prompt, accurate, and friendly customer service. Service can include responding to inquiries regarding insurance availability, eligibility, coverages, policy changes, transfers, claim submissions and billing clarification.</li><li>Use a customer-focused, needs-based review process to educate customers about insurance options.</li><li>Use exemplary communication to efficiently meet the needs of customers while promoting the development of our business. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Dedicated to customer service</li><li>Able to effectively relate to a customer, answer their questions, and anticipate their needs.</li><li>Excellent communication skills to assist customers and coordinate with other agency team members</li><li>Proactive in problem-solving</li><li>Property and Casualty license (must be able to obtain)</li><li>Life and Health license (must be able to obtain)<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Hourly pay plus commission/bonus</li><li>Growth potential/Opportunity for advancement within my office</li><li>Paid time off (vacation and personal/sick days)</li><li>Valuable career-building experience<br/><br/></li></ul>Compensation: $44,000.00 - $62,000.00 per year<br/><br/><strong>We're Hiring!<br/><br/></strong>Our team works hard to reach our goals together as a team and have fun while we are doing it! We want to work alongside those who are equally committed to excellence and personal achievement. If you're willing to work hard and you expect to get results from yourself and those around you, we want to meet you and talk about the opportunity we have for you. If you believe in having fun in a stable working environment and have a willingness to learn, we should meet to discuss our career opportunity.<br/><br/><strong>About Our Agency<br/><br/></strong><ul><li>Our mission is to help people manage the risks of everyday life, recover from the unexpected and realize their dreams.</li><li>I have been a State Farm agent since 2006.</li><li>I am a proud graduate of California State University of Northridge. </li><li>Additional languages spoken: Spanish <br/><br/></li></ul><strong>We look forward to speaking with you!<br/><br/></strong><em>State Farm agents are independent contractors who hire their own employees. State Farm agents’ employees are not employees of State Farm. Agents are responsible for and make all employment decisions regarding their employees.</em>", "responsibilities": "Establish customer relationships and follow up with customers as needed. Provide prompt, accurate, and friendly customer service. Service can include responding to inquiries regarding insurance availability, eligibility, coverages, policy changes, transfers, claim submissions and billing clarification. Use a customer-focused, needs-based review process to educate customers about insurance options. Use exemplary communication to efficiently meet the needs of customers while promoting the development of our business.", "qualifications": {"required": "Dedicated to customer service Able to effectively relate to a customer, answer their questions, and anticipate their needs. Excellent communication skills to assist customers and coordinate with other agency team members Proactive in problem-solving Property and Casualty license (must be able to obtain) Life and Health license (must be able to obtain)"}, "skills": [], "postedDate": "7 months ago", "benefits": "Hourly pay plus commission/bonus Growth potential/Opportunity for advancement within my office Paid time off (vacation and personal/sick days) Valuable career-building experience", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3810723334"}