{"jobTitle": "Sales Represetative - California", "company": {"name": "KREWE", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "KREWE is an independent high-fashion eyewear company inspired by the creativity and spirit of New Orleans, our hometown. Since launching in 2013 the brand has continued to grow and evolve with an extensive offering of unique, hand-crafted sun and optical frames designed in New Orleans and crafted with the utmost attention to detail. In addition to brick &amp; mortar locations, “Tiny House” concept stores, and a robust ecommerce business the brand is also available at many notable independent and major retailers such as Bloomingdales, Neiman Marcus, Nordstrom, and Shopbop. KREWE’s unique approach to eyewear has created a cult-following amongst consumers and influencers alike. Our frames have appeared in publications from GQ to VOGUE and on celebrities such as Beyonce, Gigi Hadid, Meghan Markle, Carrie Underwood, Hailey Bieber, Zayne Malik, Scott Disick, Adam Huber, among others.<br/><br/>As the business grows, we are seeking smart, creative, and experienced individuals to join our talented team! Key attributes and qualities we are looking for in candidates for all open roles include an entrepreneurial spirit, innovative and solution-oriented, adaptable and resilient, best-practices methodology, team-oriented with a lean-in attitude, highest standards for execution, and a high level of accountability.<br/><br/>The Role:<br/><br/>KREWE is seeking a highly motivated, goal-oriented independent sales representative to join our Wholesale sales team and manage the California territory. As the KREWE brand continues to grow, we are focused on building a greater brand presence in new territories. To excel, you must thrive in working for a fast-paced, high-growth fashion brand and be motivated to exceed sales targets.<br/><br/>Reporting to the Wholesale Sales &amp; Operations Manager, we are looking for someone based in California.<br/><br/>Responsibilities:<br/><br/><ul><li>Build and cultivate relationships through extensive outreach to potential and current accounts</li><li>Drive growth of existing accounts while delivering exceptional customer service</li><li>Travel to current and prospective accounts throughout sales territory, including trade shows</li><li>Meet and exceed sales quotas and revenue targets</li><li>Act as an ambassador representative of KREWE eyewear at all times</li><li>Responsible for planning all aspects of travel and working within the allotted budget<br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Minimum 3-5 of wholesale sales experience including prior experience in eyewear</li><li>Motivated team player with proven sales ability to meet and exceed specified sales targets</li><li>Outstanding written and verbal communication skills</li><li>Competitive spirit with a desire to grow both personally and professionally</li><li>Exudes a positive, energetic, and can-do anything attitude</li><li>Displays honest and committed character</li><li>Willingness to work flexible hours and travel</li><li>Based in Midwest territory</li><li>Full-time employee with benefits plus commission<br/><br/></li></ul>Diversity &amp; Inclusion:<br/><br/>KREWE believes in providing an inclusive workplace where all individuals have the opportunity to succeed. We are proud to provide equal employment opportunities (EEO) to all employees and applicants without discrimination or retaliation because of race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity, gender expression, veteran status, pregnancy or any other protected characteristic as established by applicable local, state, or federal law.<br/><br/>Powered by JazzHR<br/><br/>2UyXpmoqqc", "postedDate": "7 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3810597904"}