{"jobTitle": "Marketing Manager - 1st Century Bank", "company": {"name": "MidFirst Bank", "industry": "Banking", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$85,000.00 - $140,000.00", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Banking", "description": "1st Century Bank, a division of MidFirst Bank, is a full service bank with a vision of unparalleled client service in Los Angeles. The Bank's core principles are flexibility, responsiveness, and the ability to create tailored solutions, coupled with its commitment to provide exceptional client service. Our bankers work in a team effort to develop a deep understanding of their clients, and work with and on their behalf to develop solutions tailored to meet their needs. Nothing is overlooked. Everything is considered.<br/><br/>The Marketing Manager is an essential position for managing all marketing related goals, objectives and initiatives for the 1st Century Bank division of MidFirst Bank. This position works with 1st Century management and sales and operations teams to effectively develop and execute marketing strategy in a timely manner, and to established quality standards and expectations. Advanced planning and proactive thinking are keys to the success of this position, the marketing department and the lines of business served. Position is eligible for a hybrid schedule working up to two days from home.<br/><br/><strong>Duties and Responsibilities:<br/><br/><br/></strong><ul><li>Develop and execute marketing consistent with the strategic goals and objectives </li><li>Proactively make marketing strategy and plan recommendations based on content and road map information</li><li>Create comprehensive marketing plans and timelines to support the sales and revenue objectives while meeting changing marketing demands</li><li>Present regularly to senior and executive management</li><li>Create and manage marketing projects and timelines in alignment with overall corporate goals and objectives</li><li>Coordinate projects and ensure projects are completed correctly and efficiently</li><li>Work with management, sales and operations teams as necessary to clearly define project elements, specifications and timelines</li><li>Ensure specifications and content information is complete, compliant and accurate</li><li>Coordinate with other MidFirst business lines when necessary to launch products, campaigns and/or promotions in the California market to ensure all aspects are completed consistently in a timely manner</li><li>Create and maintain process and planning spreadsheets to track and manage marketing projects</li><li>Coordinate with agency partners and provide feedback on projects as necessary</li><li>Review collateral items to ensure accuracy and consistency, while ensuring they are clear, easy to understand, and compliant</li><li>Support client events as needed, including branch openings</li><li>Assist with the creation, production, and distribution of promotional items and client gifts</li><li>Travel up to 25% may be required<br/><br/><br/></li></ul><strong>Position Requirements:<br/><br/><br/></strong><ul><li>Bachelor’s degree</li><li>5+ years of Marketing and Manager experience, or equivalent work experience of 10+ years. Financial institution/advertising agency experience is strongly preferred</li><li>Deep knowledge of the Southern California market, including but not limited to Los Angeles, San Diego and Santa Barbara</li><li>Confident in writing marketing plans and strategy development</li><li>Strong problem solving skills/solution-oriented</li><li>Familiar with marketing agency workflows </li><li>Highly organized and Self-motivated</li><li>Thrive in fast-paced environment and contribute to team structure</li><li>Experience with managing and multi-tasking large project volumes while assessing priorities and managing time effectively</li><li>Excellent writing and communication skills</li><li>High attention to detail</li><li>Calm in stressful and pressure situations</li><li>Quick and thorough strategic thinker</li><li>Ability to lead brainstorming sessions</li><li>Proficiency in Microsoft Office suite – Word, Outlook, Excel, PowerPoint<br/><br/><br/></li></ul>Salary Range: $85,000.00 - $140,000.00.", "responsibilities": "Develop and execute marketing consistent with the strategic goals and objectives, Proactively make marketing strategy and plan recommendations based on content and road map information, Create comprehensive marketing plans and timelines to support the sales and revenue objectives while meeting changing marketing demands, Present regularly to senior and executive management, Create and manage marketing projects and timelines in alignment with overall corporate goals and objectives, Coordinate projects and ensure projects are completed correctly and efficiently, Work with management, sales and operations teams as necessary to clearly define project elements, specifications and timelines, Ensure specifications and content information is complete, compliant and accurate, Coordinate with other MidFirst business lines when necessary to launch products, campaigns and/or promotions in the California market to ensure all aspects are completed consistently in a timely manner, Create and maintain process and planning spreadsheets to track and manage marketing projects, Coordinate with agency partners and provide feedback on projects as necessary, Review collateral items to ensure accuracy and consistency, while ensuring they are clear, easy to understand, and compliant, Support client events as needed, including branch openings, Assist with the creation, production, and distribution of promotional items and client gifts, Travel up to 25% may be required", "qualifications": {"required": "Bachelor’s degree, 5+ years of Marketing and Manager experience, or equivalent work experience of 10+ years. Financial institution/advertising agency experience is strongly preferred, Deep knowledge of the Southern California market, including but not limited to Los Angeles, San Diego and Santa Barbara, Confident in writing marketing plans and strategy development, Strong problem solving skills/solution-oriented, Familiar with marketing agency workflows, Highly organized and Self-motivated, Thrive in fast-paced environment and contribute to team structure, Experience with managing and multi-tasking large project volumes while assessing priorities and managing time effectively, Excellent writing and communication skills, High attention to detail, Calm in stressful and pressure situations, Quick and thorough strategic thinker, Ability to lead brainstorming sessions, Proficiency in Microsoft Office suite – Word, Outlook, Excel, PowerPoint"}, "skills": ["Marketing", "Management", "Financial Institutions", "Advertising", "Southern California Market", "Marketing Plans", "Strategy Development", "Problem Solving", "Marketing Agency Workflows", "Project Management", "Multi-tasking", "Time Management", "Communication", "Writing", "Microsoft Office", "Word", "Outlook", "Excel", "PowerPoint"], "postedDate": "7 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3810820315"}