{"jobTitle": "Data Engineering Manager, Analytics", "company": {"name": "Meta", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "173,000.00/yr - $242,000.00/yr", "currency": "USD"}, "jobFunction": "Engineering and Information Technology", "industry": "Technology, Information and Internet", "description": "Do you want to use data to help drive the direction of products that impact the lives of over 1 billion people every day? If yes, we want to talk to you. We're looking for a leader in our Data Engineering team to work closely with Product Managers, Data Scientists and Software Engineers to support product launches and roadmaps by building the data architecture that informs and drives insight. In this role, you'll see a direct link between your work, company growth, and user satisfaction. You'll work with some of the brightest minds in the industry, work with one of the richest data sets in the world, use cutting edge technology, and see your efforts affect products and people on a regular basis.<br/><br/>The perfect candidate will have strong data infrastructure and data architecture skills, a proven track record of leading and scaling BI teams, strong operational skills to drive efficiency and speed, strong project management leadership, and a strong vision for how BI can proactively improve companies.<br/><br/>Data Engineering Manager, Analytics Responsibilities:<br/><br/><ul><li>Proactively drive the vision for BI and Data Warehousing across a product vertical, and define and execute on a plan to achieve that vision.</li><li>Define the processes needed to achieve operational excellence in all areas, including project management and system reliability.</li><li>Build a high-quality BI and Data Warehousing team and design the team to scale.</li><li>Build cross-functional relationships with Data Scientists, Product Managers and Software Engineers to understand data needs and deliver on those needs.</li><li>Manage data warehouse plans across a product vertical.</li><li>Drive the design, building, and launching of new data models and data pipelines in production.</li><li>Drive data quality across the product vertical and related business areas.</li><li>Manage the delivery of high impact dashboards and data visualizations.</li><li>Define and manage SLA’s for all data sets and processes running in production.<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>8+ years of experience in BI and Data Warehousing.</li><li>Experience scaling and managing 3+ person teams.</li><li>Communication and leadership experience, with experience initiating and driving projects.</li><li>Project management experience.</li><li>Data architecture experience.</li><li>Experience in SQL or similar languages.</li><li>Development experience in at least one object-oriented language (Python, Java, etc.).</li><li>BA/BS in Computer Science, Math, Physics, or other technical fields.<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience in a consumer web or mobile company.</li><li>Experience with data sets, Hadoop, and data visualization tools.</li><li>Advanced degree<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$173,000/year to $242,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Proactively drive the vision for BI and Data Warehousing across a product vertical, and define and execute on a plan to achieve that vision.\nDefine the processes needed to achieve operational excellence in all areas, including project management and system reliability.\nBuild a high-quality BI and Data Warehousing team and design the team to scale.\nBuild cross-functional relationships with Data Scientists, Product Managers and Software Engineers to understand data needs and deliver on those needs.\nManage data warehouse plans across a product vertical.\nDrive the design, building, and launching of new data models and data pipelines in production.\nDrive data quality across the product vertical and related business areas.\nManage the delivery of high impact dashboards and data visualizations.\nDefine and manage SLA’s for all data sets and processes running in production.", "qualifications": {"required": "8+ years of experience in BI and Data Warehousing.\nExperience scaling and managing 3+ person teams.\nCommunication and leadership experience, with experience initiating and driving projects.\nProject management experience.\nData architecture experience.\nExperience in SQL or similar languages.\nDevelopment experience in at least one object-oriented language (Python, Java, etc.).\nBA/BS in Computer Science, Math, Physics, or other technical fields.", "preferred": "Experience in a consumer web or mobile company.\nExperience with data sets, Hadoop, and data visualization tools.\nAdvanced degree"}, "skills": ["Data Warehousing", "BI", "SQL", "Python", "Java", "Hadoop", "Data Visualization"], "postedDate": "2 weeks ago", "benefits": "$173,000/year to $242,000/year + bonus + equity + benefits\n\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3811300840"}