{"jobTitle": "Division Director Executive Assistant", "company": {"name": "HOPICS", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Administrative", "industry": "Non-profit Organizations", "description": "<strong>Title<br/><br/></strong>Executive Assistant to Division Director<br/><br/>Division: HOPICS<br/><br/>FLSA: Non-Exempt, 30-40 hours/week<br/><br/>Supervisor: Division Director of HOPICS<br/><br/>Pay Range or Rate: DOE<br/><br/>Revised: 07.29.2021 Summary: Performs administrative duties for senior/executive management. Responsibilities may include screening calls; managing calendars; making travel, meeting, and event arrangements; preparing reports and financial data; drafting written documents, training and supporting other administrative staff; and customer relations.<br/><br/>Experience working in homeless outreach or social services would be ideal. Essential Functions: Prepare and edit correspondence, communications, presentations, and other documents.<br/><br/>Design and maintain databases.<br/><br/>Review financial assistance and another check request for quality control.<br/><br/>Extensive experience with excel expert level preferred. Extensive experience handling heavy calendar management. 2 to 4 years supporting non-profit executive director management level positions. 2 to 4 years working in social services / homeless outreach programs. Experience working in a fast paste administrative setting. File and retrieve documents and reference materials.<br/><br/>Conduct research, collect and analyze data to prepare reports and documents.<br/><br/>Manage and maintain executives' schedules, appointments, and travel arrangements.<br/><br/>Arrange and coordinate meetings and events.<br/><br/>Record, transcribe and distribute minutes of meetings.<br/><br/>Monitor, screen, respond to and distribute incoming communications.<br/><br/>Answer and manage incoming calls.<br/><br/>Receive and interact with incoming visitors.<br/><br/>Liaise with internal staff at all levels.<br/><br/>Interact with external partner organizations.<br/><br/>Coordinate project-based work. Provide scheduling and calendar maintenance support.<br/><br/>Analyze and accumulate submitted management reports.<br/><br/>Review operating practices and implement improvements where necessary.<br/><br/>Provide training as necessary and appropriate to train lower-level staff.<br/><br/>Must utilize processors, create spreadsheets and database applications, and conduct internet research as necessary.<br/><br/>Develop flow charts, organizational charts, and other visual aid materials.<br/><br/>Coordinate, plan and set up for meetings.<br/><br/>Provide administrative support to the Director.<br/><br/>Provide support to communications platforms, branding, and website.<br/><br/>Work collaboratively with program staff, agency partners, and outside agencies.<br/><br/>Attend all mandatory program and division meetings and training, as assigned by his/her supervisor and division director.<br/><br/>Support for special projects.<br/><br/>Assist with preparation for meetings and training and other group sessions as assigned.<br/><br/>Maintain appropriate boundaries, and adhere to SSG’s Code of Ethics and HOPICS Core Values.<br/><br/>Represent the Agency in a professional manner at meetings and community events.<br/><br/>Maintain files/records on client services in compliance with HIPAA, 42 CFR Part 2, and other funding requirements for audit purposes.<br/><br/>Regular attendance is required.<br/><br/>Other duties as needed.<br/><br/>A monthly Covid19 Test is required for all full vaccination staff Mandatory Covid19 Vaccination Requirement: COVID-19 Vaccination Required:<br/><br/>All staff is required to be fully COVID-19 vaccinated and to submit vaccination records to the HR Department during new hire orientation.<br/><br/><strong>Required<br/><br/></strong>Fully COVID-19 vaccinated (2 weeks from last vaccination dose to be considered fully vaccinated) Maintain and uphold the Agency mission statement, values, policies, procedures, and principles All staff are required to take a monthly Covid19 test and submit it to the HR department Secondary Functions:<br/><br/>Perform other duties as assigned<br/><br/>Overtime, holiday, or weekend work may be required periodically.<br/><br/>Supervisory Responsibilities.<br/><br/>This position does not have any supervisory responsibilities.<br/><br/>Environmental Conditions. (Working Conditions)<br/><br/>This position is in response to working in “client-friendly” environments and may be required to visit other shelters and partner agencies.<br/><br/>There is some responsibility to work in noisy environments where children and unstable adults are few to talk loud and expressive.<br/><br/>Physical Requirements: S/he typically spends time sitting, standing, reading, writing, walking, thinking, filing, reaching, stapling and binding, typing, driving, carrying (max 25lbs), thinking, listening, and speaking.<br/><br/>Mental Requirements: This position will require the individual to be able to handle any/all the following: constant distractions, interruptions, uncontrollable changes in priorities/work schedules: to be able to process information, think, and conceptualize.<br/><br/>Minimum Qualifications - Knowledge, Skills, and Abilities Required: Bachelor’s Degree in Business administration, organizational leadership, human services, or a related field.<br/><br/>More than two years of administrative support or analyst experience.<br/><br/>High proficiency in Microsoft Word, Excel, PowerPoint, Visio (or similar software), Constant Contact (or similar web-based applications), and the Internet.<br/><br/>If in recovery, a minimum of three (3) years of being drug and alcohol-free is required.<br/><br/>Knowledge of basic filling structure, ability to organize and manage multiple priorities.<br/><br/>Ability to do concise documentation and effectively communicate in written and verbal form.<br/><br/>Experience working with individuals from diverse cultural, ethnic, and socio-economic backgrounds.<br/><br/>Neat and professional appearance.<br/><br/>Attention to detail and punctuality are required; the ability to communicate effectively, both written and orally required.<br/><br/>TB test, CPR, and First Aid certification required.<br/><br/>(Note: Results may not be more than (3) months prior to or (7) days after the date of hire and renewed annually thereafter.)<br/><br/>Special Service for Groups is an Equal Opportunity Employer.", "postedDate": "7 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3812577702"}