{"jobTitle": "Research Assistant - SOPMFT", "company": {"name": "Fuller Theological Seminary", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Internship", "salary": {"amount": "16.93 - 18.00 per hour", "currency": "USD"}, "jobFunction": "Research, Analyst, and Information Technology", "industry": "Higher Education", "description": "<strong>SCHOOL OF PSYCHOLOGY &amp; MARRIAGE AND FAMILY THERAPY <br/><br/></strong><strong> RESEARCH ASSISTANT <br/><br/></strong><strong> DEPT: </strong> School of Psychology &amp; Marriage and Family Therapy<br/><br/><strong> REPORTS TO: </strong> RESEARCH ADMINISTRATOR<br/><br/><strong> HOURS: </strong> On-Call <br/><br/><strong> STATUS: </strong> NON EXEMPT<br/><br/><strong>Brief Description<br/><br/></strong>Research Assistants (RAs) will work with faculty in the School of Psychology &amp; Marriage and Family Therapy on research project(s). Under general supervision, RAs perform varied support functions requiring knowledge and skills specific to the research study. RAs may be trained to administer several standardized assessments and/or to conduct clinical interviews. RAs will perform duties under the supervision of, and with direction from, the study’s Project Coordinator and Principal Investigator and will work collaboratively with the research team.<br/><br/><strong>ESSENTIAL FUNCTIONS (as Applicable To Particular Project)<br/><br/></strong><ul><li> Screen prospective participants to determine eligibility according to research protocol entrance criteria </li><li> Review and explain consent forms, questionnaires, and surveys with prospective participants </li><li> Conduct clinical interviews in the greater Los Angeles area. Each research project will have different populations that might be interviewed. </li><li> Conduct focus groups </li><li> Maintain confidentiality of subject records and document subject payment </li><li> Gather, record, organize, transcribe and verify the accuracy of research study data </li><li> Prepare data for computer input </li><li> Perform qualitative or quantitative data analysis </li><li> Answer participants' questions regarding study protocol </li><li> Notify appropriate research personnel regarding problems or complications reported by participants </li><li> Attend project meetings and perform related duties as required <br/><br/></li></ul><strong>Knowledge And Skills Required<br/><br/></strong><ul><li> Current MFT or Psychology student in the School of Psychology &amp; Marriage and Family Therapy </li><li> Excellent interpersonal and communication skills; ability to interact with a large variety of individuals </li><li> Candidates should also be detail oriented, highly organized, reliable, and a strong team player </li><li> Familiarity with basic research methodology and design skills relevant to the project and role <br/><br/></li></ul><strong>Application And Evaluation Procedure<br/><br/></strong><ul><li> Candidates should prepare to submit the following:</li><ul><li> Current curriculum vitae </li><li> Cover letter detailing the experience <br/></li></ul></ul><strong>Additional Remarks<br/><br/></strong><ul><li> Must be willing to abide by Fuller Community Standards </li><li> The Research Assistant position in SOPMFT is an evergreen, pooled position. Applicants are reviewed and selected on an as-need basis based on faculty assignments </li><li> Fully remote work within the United States is subject to payroll state approval by Fuller Theological Seminary <br/><br/></li></ul>Pay Scale<br/><br/><ul><li> Salary range the seminary expects to pay: $16.93 - $18.00 per hour <br/><br/></li></ul>Fuller Theological Seminary is an Equal Employment Opportunity/Affirmative Action employer. To the extent required by law, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status. As a religious institution, Fuller Theological Seminary is permitted and reserves the right to prefer employees or prospective employees for certain positions on the basis of religion.<br/><br/>2, E2A, research assistant", "responsibilities": "Research Assistants (RAs) will work with faculty in the School of Psychology &amp; Marriage and Family Therapy on research project(s). Under general supervision, RAs perform varied support functions requiring knowledge and skills specific to the research study. RAs may be trained to administer several standardized assessments and/or to conduct clinical interviews. RAs will perform duties under the supervision of, and with direction from, the study’s Project Coordinator and Principal Investigator and will work collaboratively with the research team.", "qualifications": {"required": "Current MFT or Psychology student in the School of Psychology &amp; Marriage and Family Therapy, Excellent interpersonal and communication skills; ability to interact with a large variety of individuals, Candidates should also be detail oriented, highly organized, reliable, and a strong team player, Familiarity with basic research methodology and design skills relevant to the project and role"}, "skills": [], "postedDate": "7 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3813447502"}