{"jobTitle": "Automotive Sales Assistant", "company": {"name": "Mercedes-Benz of Ontario", "location": "Ontario, CA"}, "location": "Ontario, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "18 / hour", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Technology, Information and Internet", "description": "Your next opportunity awaits at Mercedes-Benz of Ontario. We are hiring an Automotive Sales Assistant to join our team!<br/><br/>The Automotive Sales Assistant provides support to a senior salesperson in presenting the product, aiding in the sales process and delivering New or Pre-owned vehicles to the customer. The Automotive Sales Assistant must be comfortable providing information and accommodating the guest to ensure an exceptional experience. The assistant must be friendly, enthusiastic, articulate, and a self-motivated team player, maintaining a positive attitude and excellent work ethic.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Respond to incoming sales leads in a professional manner.</li><li>Assist customers in appropriate vehicle selection providing the highest level of product and industry knowledge to ensure the highest level of customer happiness.</li><li>Direct customers to product</li><li>Maintain appropriate levels of customer service and client retention by resolving customer complaints or concerns immediately and appropriately; assume ownership of the customer's experience by carrying out those additional assignments that allow the dealership to leave a positive impression with the customer.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>High School Diploma or equivalent</li><li>Previous experience in a similar role preferred</li><li>Previous experience with a CRM preferred</li><li>Valid in-state driver's license and clean driving record<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health insurance</li><li>Dental insurance</li><li>Vision insurance</li><li>Paid time off</li><li>401(k)</li><li>401(k) matching</li><li>Flexible spending account</li><li>Professional development assistance</li><li>Life insurance</li><li>Employee assistance plan</li><li>Disability insurance<br/><br/></li></ul><strong>Pay: </strong>$18 / hour<br/><br/>At Mercedes-Benz of Ontario, we attract, nurture, and retain the most talented people in the industry by providing the highest quality work environment where productivity, creativity, and personal and professional growth can flourish. We believe our team sits behind the wheel of the Fletcher Jones brand that drives our company toward success.<br/><br/><em>We are an Equal Opportunity Employer<br/><br/></em>Privacy Policy", "postedDate": "7 months ago", "benefits": "Health insurance, Dental insurance, Vision insurance, Paid time off, 401(k), 401(k) matching, Flexible spending account, Professional development assistance, Life insurance, Employee assistance plan, Disability insurance", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3814649043"}