{"jobTitle": "Retail Department Manager of Visual - Melrose, 6578, West Hollywood, CA", "company": {"name": "adidas", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "size": "Over 55,000 employees", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$26.68 - $40.02", "currency": "USD"}, "jobFunction": "Sales and Customer Service", "industry": "Manufacturing, Retail, and Sporting Goods Manufacturing", "description": "At adidas we have been challenging the status quo for 70 years and we’re not done yet. We are calling all Department Managers who don’t accept what “was” or what “is,” but those who want to create what will be, and who share our desire to make a difference. We believe sport has the power to change lives. To bring this mission to life we foster a culture centered on creativity, confidence, and collaboration, and while we will never rest on our laurels, we are humbled that this has allowed us to be recognized as one of the “world’s most attractive employers.” We also understand that the future runs on diverse and fresh perspectives. True to this spirit, we believe in assembling talented teams from far and wide and unite by a common goal: to be the best sports company in the world. As an international company with over 55 thousand employees and over 160 retail stores across the U.S. alone, adidas employees are exposed to different cultures, languages, and life experiences, which we believe is the fastest way to grow. The future is in your hands. Ready to apply? Here’s what you need to know: Must possess and consistently exhibit the competencies relative to the position. Excellent Skills in operating personal computers, POS systems, and various software packages including MS office. Knowledge and understanding of profit and loss statement and store KPIs to make commercial decisions based on sound financial judgment. Ability to learn and adapt quickly in a fast-paced environment. Strong interpersonal and communication skills including the ability to lead discussions in diverse groups of varying size. Ability to operate independently and with discretion, and work effectively under pressure. Demonstrates an inspirational attitude that contributes to a positive team environment. Ability to build and maintain effective working relationships with team members along with willingness to set and maintain high standards of performance. Well-developed ability to speak, read, comprehend, and write English. Ability to maintain reliable and consistent attendance and punctuality. Ability and willingness to travel by car and air domestically. While performing the duties of this job, the employee is occasionally exposed to outside weather conditions. The noise level in the work environment is usually moderate. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Must be 18 years or older. 4 year college or university degree in business, retail management, or related field. or equivalent combination of education and experience. Experience managing a team. Ability to effectively communicate with customers and store personnel. Ability to work a flexible schedule to meet the needs of the business, including evening, overnight and weekend shifts.", "responsibilities": "Creators- If you want to build a tomorrow better than the day that came before, you’re a creator. Creators find inspiration in unlikely places, look at the world in their own unique way, are confident and have an uncanny ability to connect dots that others just don’t see. Innovators- You can dive into a complex problem and come out the other end with the simple solution no one else saw coming. Confident- Be bold and bring a fresh perspective to the table. It’s the people who see the world a little differently than the rest that create the breakthroughs that inspire us all. Determined - Never settle. Our work space is about discovery. Competition exists...but only by competing with your personal best, not your team members. Discover your boundaries and push them. Discover your team’s strengths and build them. Collaborators – You thrive on building relationships and creating partnerships to help us be the best sports brand in the world. Genuine- Be real. Tell it how it is. Being a leader isn’t about winning a popularity contest. Being a leader is about inspiring others to be their very best!", "qualifications": {"required": "Must possess and consistently exhibit the competencies relative to the position. Excellent Skills in operating personal computers, POS systems, and various software packages including MS office. Knowledge and understanding of profit and loss statement and store KPIs to make commercial decisions based on sound financial judgment. Ability to learn and adapt quickly in a fast-paced environment. Strong interpersonal and communication skills including the ability to lead discussions in diverse groups of varying size. Ability to operate independently and with discretion, and work effectively under pressure. Demonstrates an inspirational attitude that contributes to a positive team environment. Ability to build and maintain effective working relationships with team members along with willingness to set and maintain high standards of performance. Well-developed ability to speak, read, comprehend, and write English. Ability to maintain reliable and consistent attendance and punctuality. Ability and willingness to travel by car and air domestically. While performing the duties of this job, the employee is occasionally exposed to outside weather conditions. The noise level in the work environment is usually moderate. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch, crawl, and operate a Brannock device. The employee must frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Must be 18 years or older. 4 year college or university degree in business, retail management, or related field. or equivalent combination of education and experience. Experience managing a team. Ability to effectively communicate with customers and store personnel. Ability to work a flexible schedule to meet the needs of the business, including evening, overnight and weekend shifts.", "preferred": ""}, "skills": ["Excellent Skills in operating personal computers", "POS systems", "various software packages including MS office", "Knowledge and understanding of profit and loss statement", "store KPIs", "Strong interpersonal and communication skills", "Ability to operate independently and with discretion", "Ability to maintain reliable and consistent attendance and punctuality", "Ability and willingness to travel by car and air domestically", "Ability to learn and adapt quickly in a fast-paced environment", "Ability to build and maintain effective working relationships with team members"], "postedDate": "3 days ago", "applicationDeadline": "", "benefits": "A Generous Benefits Package Which Includes Diversity, Equity, and Inclusion at adidas means championing individual uniqueness and cultivating a culture of belonging in which everyone can create at their best. We embrace diverse backgrounds, experiences, and perspectives and seek to create a workforce that reflects our consumers and communities. adidas offers robust and progressive medical, including HSA (Health Savings Account) with employer funding or FSA (Flexible Spending Account) options, dental, vision, prescription drug coverage, adoption, with surrogate and fertility support, short and long-term disability, and basic life and AD&D insurance, which can be supplemented with employee-paid coverage. Employees are able to enroll in adidas’ 401k plan and Stock Purchase Plan with employer match. Full-time employees are eligible for education assistance and generous Leave policies including 12 weeks of paid parental leave. Employees are eligible to earn monthly and quarterly incentives. Employees accrue prorated flexible time off in the amount .3512 hours per day that increases with years of service, seven paid holidays throughout the calendar year and Service Time Off during milestone years.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3815747432"}