{"jobTitle": "Sales Associate", "company": {"name": "Comoto Family of Brands", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing", "industry": "Retail", "description": "<strong>Job Description<br/><br/></strong>What to expect when you work here<br/><br/>As a Sales Associate, you would be responsible for providing every customer with a great experience. You will be expected to maintain a strong sense of product knowledge, and to provide customers with in-depth information on product features and benefits.<br/><br/>You can expect our 5 Core Values to drive everything we do.<br/><br/>Aim For The Podium<br/><br/><ul><li>We provide an outstanding shopping experience and deliver exceptional customer service. Sales Associates are responsible for hitting their daily/weekly/monthly sales goals </li><li>Maintain store aesthetics by cleaning, stocking, organizing and following merchandising plans </li><li>Stay up-to-date with our brand and product knowledge, company information, sales and company-wide events, truly becoming a resource to our customer base <br/><br/></li></ul>Take Risks; Wear a Helmet:<br/><br/><ul><li>It never hurts to try something new. We are always looking to grow and progress and want to hear all your new ideas </li><li>Don't be afraid to fail; no one is right all the time, but you can always be well-prepared <br/><br/></li></ul>Share The Road<br/><br/><ul><li>We take the health, safety, and wellness of our employees seriously. Our Wellness program and safety committee offers workshops, classes, resources, etc. to all of our team members </li><li>Our Diversity, Equity, and Inclusion council and employee resource groups promote open and honest communication, remove barriers, and champion policies to build a more equitable environment </li><li>Do the right thing, always. A friendly and upbeat personality is a must <br/><br/></li></ul>Keep It Real<br/><br/><ul><li>This is a part-time position. You'll earn an hourly base rate, plus you'll have a chance to earn commission on a tiered system, based on meeting your sales goal </li><li>Additional incentives available, such as SPIFFS, plus we offer generous employee discounts on all products </li><li>Because a whole lot of life happens between paychecks, Comoto also offers a voluntary benefit to all team members called DailyPay which allows for secure, instant transfers of earned pay before payday. This benefit is available to all team members immediately upon hire </li><li>We strongly value training and development - with that, your first 5 shifts will be base pay only, so your only focus is learning <br/><br/></li></ul>Fuel Your Passion<br/><br/><ul><li>Work in an industry that you are passionate about! </li><li>We are a growing company, and we promote from within - career opportunities! </li><li>Exciting opportunities to represent Cycle Gear at special events -- International Motorcycle Show, motocross races, etc. </li><li>We have the best customers! Riders are passionate, friendly, charitable, community-minded people, and we get to interact with them every day!</li></ul>", "postedDate": "7 months ago", "benefits": "This is a part-time position. You'll earn an hourly base rate, plus you'll have a chance to earn commission on a tiered system, based on meeting your sales goal. Additional incentives available, such as SPIFFS, plus we offer generous employee discounts on all products. Because a whole lot of life happens between paychecks, Comoto also offers a voluntary benefit to all team members called DailyPay which allows for secure, instant transfers of earned pay before payday. This benefit is available to all team members immediately upon hire. We strongly value training and development - with that, your first 5 shifts will be base pay only, so your only focus is learning.", "url": "https://www.linkedin.com/jobs/view/3815592919"}