{"jobTitle": "Production Planner/Scheduler", "company": {"name": "dormakaba Americas", "location": "Chino, CA"}, "location": "Chino, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "70,000.00 - 85,000.00", "currency": "USD"}, "jobFunction": "Production and Manufacturing", "industry": "Wholesale Building Materials", "description": "<strong>Position Overview<br/><br/></strong>dormakaba is seeking a Production Planner/Scheduler to join our Alvarado team in Chino, CA. This position is responsible for coordinating between multiple departments to ensure orders are executed and shipped on time. They will ensure seamless flow of work by turning customer orders into work orders, creating production schedules, and conferring with Production, Warehouse and Purchasing to determine progress of work and completion dates.<br/><br/>HIRING SALARY RANGE: $ 70,000 - $ 85,000 (Salary to be determined by the education, experience, knowledge, skills, and abilities of the applicant, internal equity, and alignment with market data.) This position includes a competitive benefits package. Please visit our career site for more information on benefits.<br/><br/><strong>What You Will Do<br/><br/></strong><ul><li> Develop, prepare, and maintain production schedules to guide production activities and resources </li><li> Accurately create and maintain work orders, bills of materials and routings </li><li> Maintain MRP data to ensure proper stocking levels on both manufactured and purchased parts </li><li> Coordinate with the Purchasing team to obtain purchased parts and materials </li><li> Work with Customer Service to provide lead times, relay information about production status, support expedited orders and research delivery discrepancies <br/><br/></li></ul><strong>What We Require<br/><br/></strong><ul><li> High school diploma or GED equivalent </li><li> 5+ years of relevant production planning experience in a manufacturing environment </li><li> Experience in forecasting and driving purchasing requirements </li><li> Experience with MRP/ERP systems </li><li> Advanced proficiency in Microsoft Office applications, including Microsoft Excel </li><li> Working knowledge of inventory control and scheduling activities <br/><br/></li></ul><strong>What We Prefer<br/><br/></strong><ul><li> Bachelor’s degree in manufacturing or supply chain management; or equivalent combination of education and experience </li><li> Experience in cell-driven industrial manufacturing production </li><li> Previous experience in an assembly/production environment </li><li> Lean skills <br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li> Taking Care of our Employees on Day One with Medical, Dental, Vision, Life and Disability Insurance coverage options. No waiting periods! </li><li> Your health is our priority, we offer Medical Wellness Programs to aid in your well-being. </li><li> Vacation and Personal Time Off </li><li> We support your growing family; we provide Parental Leave for Moms and Dads! </li><li> Wisely plan for your future with our 401k Matching plan beginning on Day One. </li><li> Supporting your career development with our Tuition Reimbursement Program. </li><li> Robust culture supporting internal advancement with our Learn and Grow Program. </li><li> Discover your best attributes using CliftonStrengths to pave the way for success at dormakaba. </li><li> 24/7 access to over 15,000 LinkedIn Learning courses to assist in your professional development and to expand on your individual interests. </li><li> Employee Assistance Programs </li><li> Voluntary Legal Insurance </li><li> Unlimited Referral Reward Bonuses </li><li> Corporate Discounts for shopping, travel and more! <br/><br/></li></ul><strong> WHY JOIN DORMAKABA? <br/><br/></strong>Our work is IMPORTANT. YOU are important. At schools and universities, in stadiums, airports, hospitals and workplaces; for every place that matters. We provide safety, security, and sustainability, providing people with the tools to shape their careers for growth. EVERY team member contributes to our mission and can make a positive difference. Our culture focuses on Growing the Business, Growing Together and Growing Ourselves. We are a global company with more than 16,000 employees worldwide giving you endless opportunities for growth and advancement.<br/><br/>Learn why our employees enjoy working for dormakaba: dormakaba Testimonials<br/><br/>", "responsibilities": "This position is responsible for coordinating between multiple departments to ensure orders are executed and shipped on time. They will ensure seamless flow of work by turning customer orders into work orders, creating production schedules, and conferring with Production, Warehouse and Purchasing to determine progress of work and completion dates.", "qualifications": {"required": "High school diploma or GED equivalent, 5+ years of relevant production planning experience in a manufacturing environment, Experience in forecasting and driving purchasing requirements, Experience with MRP/ERP systems, Advanced proficiency in Microsoft Office applications, including Microsoft Excel, Working knowledge of inventory control and scheduling activities", "preferred": "Bachelor’s degree in manufacturing or supply chain management; or equivalent combination of education and experience, Experience in cell-driven industrial manufacturing production, Previous experience in an assembly/production environment, Lean skills"}, "skills": ["MRP", "ERP", "Microsoft Excel", "Production Planning", "Inventory Control", "Scheduling", "Purchasing", "Forecasting", "Customer Service"], "postedDate": "1 week ago", "benefits": "Medical, Dental, Vision, Life and Disability Insurance coverage options, Medical Wellness Programs, Vacation and Personal Time Off, Parental Leave, 401k Matching plan, Tuition Reimbursement Program, Learn and Grow Program, CliftonStrengths, LinkedIn Learning courses, Employee Assistance Programs, Voluntary Legal Insurance, Unlimited Referral Reward Bonuses, Corporate Discounts", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3815140743"}