{"jobTitle": "Restaurant Manager - Popeyes #11259 - Garden Grove, CA", "company": {"name": "Denco Family, Inc.", "industry": "Hospitality", "size": "Not specified", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Not specified", "employmentType": "Other", "experienceLevel": "Mid-Senior level", "salary": {"amount": "Not specified", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "We are looking for an organized and goal-oriented Restaurant Manager to oversee the running of our Popeyes restaurant. This position will profitably operate the restaurant within the practice and procedures established by company operations. Having sole charge responsibility for the restaurant.", "responsibilities": "Promotes Company Mission, Vision and Core Values. Willingly assists others without being asked. Prepares and interprets financial and operational reports and schedules, analyzes data and develops solutions to ensure operating goals are achieved. Directs restaurant operations with responsibility for guest service, brand standards execution and employee training. Achieves controllable profit and flow thru goals by overseeing all controllable costs and taking the appropriate corrective action to achieve the desired result. Ensures timely implementation, training and ongoing execution of all corporate initiatives and marketing promotions. Develops Assistant Managers, shift leaders, and other hourly employees through corporate training programs, individual development plans and assignments; provides coaching and constructive feedback to employees as needed. Ensures all equipment and facilities are in compliance with Brand Standards and all government regulations and takes corrective action when required. Attracts, hires, onboards and retains the best hourly talent to meet staffing requirements and guest service standards. Proactively handles employee relations issues and deviations from Brand Standards; involves the AM and Human Resources Manager as appropriate to resolve issues. Develops and executes the local store marketing plan to build relationships with civic, business, school, and professional organizations to drive sales and guest counts. Monitors that proper security procedures are in place to protect employees, guests and company assets. Enforces sanitary practices for food handling, general cleanliness and maintenance of kitchen, dining areas and restrooms. Works to create and maintain an enjoyable and respectful environment for our guests and employees. Maintains compliance with all employer’s employment policies and Brand Standards to include all state, local and federal regulations. Follows management cash handling, inventory and other operational procedures as outlined by the employer. Maintains & implements a strong commitment to guest satisfaction. Responsible for maintaining all hourly personnel files in accordance with federal, state and local law. Completes all other tasks and duties as assigned.", "qualifications": {"required": "Minimum of 2 years experience in restaurant, hospitality or retail management, additional operations and/or leadership experience strongly preferred. Associate’s or Bachelor’s degree preferred or equivalent combination of education and experience. Ability to work a minimum of 55 hours a week. Food Safety Manager certification required. Strong organizational skills with excellent oral and written communication skills and the ability to communicate with all levels of the organization. Ability to communicate effectively, both orally and in writing, in the English language. Possesses basic math skills (add, subtract, multiply, divide). Places a value on diversity and shows respect for others. Proven ability to problem solve and handle high stress situations. Ability to interpret financial statements and understand contributing factors. Must be able to perform job duties of every position. Must be prepared to multitask in accordance with the demands of the business. Ability to identify and anticipate opportunities and implement corrective action steps. Ability to work weekends, holidays, and evenings. Has reliable transportation in order to meet banking obligations. Must be capable of exerting up to 100 pounds of force occasionally, and/or up to 50 pounds of force frequently, and/or up to 20 pounds of force constantly to move objects.", "preferred": "Not specified"}, "skills": [], "postedDate": "6 months ago", "applicationDeadline": "Not specified", "benefits": "We offer 401k, Medical, Dental and Vision insurance to full-time employees. Employee Discount - receive a 50% discount on meals during your shifts. FREE Beverages - receive free soft drinks, tea and water during your shifts. FREE Uniform - receive a brand-new uniform at orientation. Company-wide discount - receive a 25% discount at over 40 company-affiliated restaurants! Flexible Schedules - we’ll work with you because employee work/life balance matters! Employee Referral Bonus - refer a friend and get paid! Employee Assistance Program - receive confidential, personal, & web-based support on a variety of important topics such as stress management, dependent care, nutrition, legal & finances. Advancement - On-the-job skills training to prepare employees for upward mobility opportunities.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3817273175"}