{"jobTitle": "Business Analyst IT L3", "company": {"name": "UNICON International", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Motor Vehicle Manufacturing", "description": "We are currently accepting resumes for a  Business Analyst IT L3 position in  Torrance CA.<br/><br/>This position is  Hybrid.<br/><br/>Salary Range: $107k-$117k<br/><br/>Benefits offered: Medical, Vision, Dental, 401 K<br/><br/>Duties<br/><br/> The selected candidate will perform the following duties:<br/><br/>\" Collaborate with project/ team managers and business sponsors to determine scope, vision, business objectives, and benefits.<br/><br/>\" Conduct interviews to gather user requirements, use cases, and scenarios.<br/><br/>Analyze and verify requirements for completeness, consistency, and comprehensibility. Work with stakeholders and project team to prioritize collected requirements. Where applicable, develop prototypes of interfaces and attributes based on the user requirements.<br/><br/>\" Develop and conduct peer reviews of the business requirements to ensure that requirement specifications are correctly interpreted.<br/><br/>\" Translate conceptual user requirements into functional requirements in a clear manner that is comprehensible to developers/project team. Create process models, specifications, diagrams, and charts to provide direction to developers and/or the project team.<br/><br/>\" Review existing application and documentation and gain a good understanding of it.<br/><br/>\" Create systems specifications, diagrams, and charts to provide direction to system developers. Where applicable, perform analysis of existing applications and assess impact of the change to the current system processes.<br/><br/>\" Coordinate and perform in-depth tests, including end-user reviews, for modified and new systems. Provide orientation and training to end users for all modified and new systems.<br/><br/>\" Assist &amp; guide technical team in resolution of system-related problems.<br/><br/>\" Coordinate testing, validate performance, and support till steady state.<br/><br/>What will this person be working on<br/><br/>The IT Business System Analysts role is to assist in the planning, design, development, of new applications and enhancements to existing applications. This role serves as partner with business units to integrate IS technology with business needs to provide solutions. This includes interviewing stakeholders and gathering and compiling user requirements to understand and prioritize the requirements and analyzing existing systems processes. This individual will apply proven communication, analytical and problem-solving skills to help identify system solutions for business system issues.<br/><br/>Position Success Criteria (Desired) - 'WANTS'<br/><br/>Requirements<br/><br/>\" IS related bachelors degree and/or equivalent work experience.<br/><br/>\" 5+ years of IT business work experience.<br/><br/>\" Proven experience with business and technical requirements analysis, elicitation, and verification on medium to large projects and enhancements.<br/><br/>\" Ability to create systematic and consistent requirements specifications in both technical and user-friendly language.<br/><br/>\" Advanced ability to identify best practices and provide technical support for activities throughout all phases of SDLC.<br/><br/>\" Participate in business meetings and walkthroughs to analyze problems giving business user support. Advanced ability to research, analyze impact, and suggest solutions for complex problems.<br/><br/>\" Advanced ability to develop and update technical design specifications, diagrams, flowcharts, architecture documents, and deployment plan.<br/><br/>\" Working knowledge of software engineering, software development, solution architecture and implementation of medium to large scale systems across multiple platforms.<br/><br/>\" Advanced ability to assess corporate impacts of changes and recommend strategies to senior management.<br/><br/>\" Excellent understanding of the organizations goals and objectives.<br/><br/>\" Able to exercise independent judgment and act on it.<br/><br/>\" Excellent analytical, and creative problem-solving skills.<br/><br/>\" Excellent listening, interpersonal, written, and oral communication skills.<br/><br/>\" Logical and efficient, with keen attention to detail.<br/><br/>\" Highly self-motivated and directed.<br/><br/>UNICON International, Inc. is an Equal Opportunity Employer.<br/><br/>If you are interested in working for an organization where honesty, integrity, and quality are among the core principles, click apply today!", "postedDate": "6 months ago", "salary": {"amount": "107,000.00/yr - 117,000.00/yr", "currency": "USD"}, "skills": [], "url": "https://www.linkedin.com/jobs/view/3818369738"}