{"jobTitle": "Entry Level Data Scientist (remote)", "company": {"name": "SynergisticIT", "industry": "IT Services and IT Consulting", "size": "Not specified", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Remote", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "Not specified", "currency": "Not specified"}, "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting", "description": "2024 is finally here and we hope the Job market improves however as per a resume builder survey based on response from more than 900 companies 4 out of 10 companies are planning to have layoffs in 2024 or have a hiring freeze. Almost 390,000 tech employees have been laid off since 2022 and it's still ongoing. The effect of this has led hundreds of thousands of laid off Tech employees competing with existing Jobseekers. AI is replacing many normal jobs which were done by people. As per news reports Google is planning to Client off 30,000 employees in its ad sales who will be replaed by AI ad technology. Entry level Job seekers struggle to get responses to their applications, are getting ghosted after interviews. In such a scenario the Job seekers need to differentiate themselves by ensuring to obtain exceptional skills and technologies so that they can wear multiple roles at a client as clients now would want to expand roles and responsibilities assigned to a particular job to save costs. Since 2010 Synergisticit has helped Jobseekers differentiate themselves by providing candidates the requisite skills and experience to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a Job we make careers. All Positions are open for all visas and US citizens. We are matchmakers we provide clients with candidates who can perform from day 1 of starting work. In this challenging economy every client wants to save $$$'s and they want the best value for their money. Jobseekers need to self-evaluate if they have the requisite skills to meet client requirements and needs as Clients now post covid can also hire remote workers which increases even more competition for jobseekers. We at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart lab s etc to name a few. We have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, Java Full stack developers, Python/Java developers, Data analysts/ Data Scientists, Machine Learning engineers for full time positions with clients. Who Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry. We assist in filing for STEM extension and also for H1b and Green card filing to Candidates. We also offer Skill and technology enhancement programs for candidates who are either missing skills or are lacking Industry/Client experience with Projects and skills. Candidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. If a Jobseeker is qualified with enough skills and have hands on project work at clients then they should be good to be submitted to clients. Shortlisting and selection are totally based on clients discretion not ours. If you applied for a job and got emails from our skill enhancement team please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team. please check the below links to see success outcomes of our candidates and our participation at different Tech industry events and how we are different from other organizations in helping Jobseekers secure Tech careers. For preparing for interviews please visit https://www.synergisticit.com/interview-questions/ We are looking for the right matching candidates for our clients. Please apply via the job posting.", "responsibilities": "Not specified", "qualifications": {"required": "Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT. Highly motivated, self-learner, and technically inquisitive. Experience in programming language Java and understanding of the software development life cycle. Project work on the skills. Knowledge of Core Java, javascript, C+. or software programming. Spring boot, Microservices, Docker, Jenkins and REST API's experience. Excellent written and verbal communication skills.", "preferred": "NLP, Text mining, Tableau, PowerBI, SAS, Tensorflow."}, "skills": ["Java", "Python", "Data Science", "Machine Learning", "Statistics", "SAS", "Computer Vision", "Data Visualization", "Core Java", "JavaScript", "C++", "Spring Boot", "Microservices", "Docker", "Jenkins", "REST APIs"], "postedDate": "6 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3818364595"}