{"jobTitle": "Office Administration - Clerk III", "company": {"name": "Veterans Sourcing Group, LLC", "industry": "Staffing and Recruiting", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Woodland Hills, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$22/hr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Staffing and Recruiting", "description": "Will be expected to perform a combination of all the outlined duties below to ensure the location is ready for employee return to work. There are three different lists of job duties (Please read them carefully). This will not be a position that will be stationary at a desk all day. The resource will be required to perform duties throughout the building.", "responsibilities": "Sorting on inbound mail into pre labeled mail bins, Scan or deliver inbound mail to the designated recipient or mail stop, Sort and research all unidentifiable mail within 48 hours, Pick up and sort interoffice mail, Pick up and process outbound mail and prepare for presort pick up, Process certified mail for courier services to deliver to the post office, Pick up and process outbound mail and prepare for presort pick up, Replenish postage meter utilizing the 'Postage by Phone process', Reconcile postage account monthly, Sign for and process inbound accountable packages, Outbound packages are either picked up by the mailroom or shipping personnel or dropped off by Customer, Packages are processed on the overnight shipping system, Coordinate records pick up by Iron Mountain, Direct Iron Mountain shredding bin pick up, Remove filled shredding bins and replace with empty bins as requested, Refresh of copy areas in all offices including restock of basic supplies, check of facilities (garbage levels, power) and general tidiness, Refresh of kitchen/social hub areas in the HQ office including restock of coffee supplies, coffee machines (beans, milk etc.), check of facilities (garbage levels, sink working, appliances working, power), Daily and weekly maintenance of coffee machines in all offices to be completed per training instruction and manual, Stocking of supplied visitor mugs in all office kitchen/social hubs, Collection of visitor mugs for cleaning from kitchen/social hubs in the HQ office daily, utilize dishwasher in Executive Pantry and Conference Room Social Hub, Collection of visitor mugs for cleaning from kitchen/social hubs in field offices, wash, dry and store mugs, Inventory and inspect supply of visitor coffee mugs, Notify Facilities when replacements are needed, Partner with coffee machine vendor for service, trends, recommendations in all offices, Report SLAs and feedback on kitchen/social hub services in all offices, Act as Liaison on the Farmer's behalf with Building Property Management for the maintenance and repair of the office space, Interface with Farmers community as representative of Farmers, Schedule Vendor deliveries, including coordinating access, elevator usage, check COI requirements and be onsite as needed, Open work tickets with both internal and external vendors as needed, Consult with IT for data and phone line needs, Consult with building for electrical and HVAC needs, Coordinate with central managers for all equipment installs, moves, adds and changes, Complete duties for office restack, Possess above average communication skills and can work independently in a professional manner, Complete special projects as requested, Coordinate elevator usage, deliveries, lighting needs, air or heating needs etc with Customer Building management, Perform mail/supply functions as back-us support for breaks, lunch or unexpected absences, Proficiency in Excel, Word, Power Point and other Windows Office platforms, Create/maintain documents in Microsoft Word and Excel, as directed by the Customer, Work successfully with all levels of the organization to achieve goals and to contain/reduce expenses.", "qualifications": {"required": "High school diploma or equivalent required", "preferred": "Possess above average communication skills and can work independently in a professional manner."}, "skills": ["Excel", "Word", "PowerPoint"], "postedDate": "6 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3818801045"}