{"jobTitle": "Clinical Manager - SUD LA", "company": {"name": "Valeo Resources", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Health Care Provider", "industry": "Staffing and Recruiting", "description": "Valeo Resources has partnered with a community mental health/SUD organization organization. We are currently seeking candidates for a full-time SUD Clinical Manager to join the team in Los Angeles, CA! In this role, you will be overseeing the residential substance use disorder (SUD) program which is a new program contracted with Department of Public Health's (DPH) Substance Abuse Prevention and Control (SAPC) program for residential drug Medi-Cal (DMC) services for up to 99 adult men and women.<br/><br/>Position: Clinical Manager<br/><br/>Location: Los Angeles, CA 90059<br/><br/>Schedule: M-F, day shifts (Full time - W2)<br/><br/>Responsibilities<br/><br/><ul><li>Manages day to day program operations and oversight of assigned programs and facility.</li><li>Responsible for all facility related matters to ensure that program(s) operate efficiently and safely.</li><li>Assumes ownership for any facility or program crisis situation and sees it through to completion.</li><li>Responsible for program staff providing treatment in accordance with our mission and values.</li><li>Ensures for all treatment services are provided in an ethical and legal manner.<br/><br/></li></ul>Requirements: <br/><br/><ul><li>LCSW, LMFT, LPCC, or PsyD with license through Board of Behavioral Sciences (BBS) or the California Board of Psychology (CBP).</li><li>Experience Minimum of two years' experience providing supervision to direct service providers in comparable size agencies with similar clients.</li><li>Experience with efficient and effective treatment and management of adult clients with co-occurring mental health and substance use disorders.<br/><br/></li></ul>Benefits And Perks<br/><br/><ul><li>Robust benefits package, including PTO, 15 paid holidays, commuter benefits, retirement plans, and more!</li><li>Employees qualify for public loan forgiveness programs</li><li>Training and professional development opportunities</li><li>Work with mission driven, compassionate colleagues and make a difference every day in the work that you do<br/><br/></li></ul>Please send your resume to Gia at ggonzalez@valeoresources.com to learn more about the position and interview process!", "postedDate": "6 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3818396477"}