{"jobTitle": "Maintenance Supervisor", "company": {"name": "AZUL Hospitality Group", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Management and Manufacturing", "industry": "Hospitality", "description": "<strong>POSITION PURPOSE<br/><br/></strong>The Maintenance Supervisor manages the day-to-day and long term operations of the maintenance department including the upkeep of all rooms, building exterior (façade, sidewalks, parking lot, etc.) and both public and back-of-house spaces. Assure regular maintenance is scheduled and completed on all hotel equipment including HVAC systems (chillers, boilers, steam/gas lines, etc.), electrical equipment, laundry facilities and the pool equipment. The Maintenance Supervisor takes personal responsibility and pride in the product where initiative and follow-up are innate.<br/><br/><strong>Essential Responsiblities<br/><br/></strong><ul><li>Ensure all projects are completed according to specifications and are completed on time.</li><li>Work closely with the Chief Engineer/Operations Manager to ensure coordination of activities.</li><li>Schedule work, order materials and complete assignments by a specified date.</li><li>Perform work within departmental expense plans.</li><li>Study work schedules and estimate worker-hour requirements for completion of job assignment.</li><li>Interpret specifications, job orders, and company policies to staff and enforces safety regulations.</li><li>Analyze and resolve work problems or assists staff in solving work problems.</li><li>Initiate or suggest plans to motivate staff.</li><li>Practice safe work habits and ensure safe work practices to avoid injury to self and others.</li><li>May estimate, requisition, and inspect materials.</li><li>May confer with other supervisors to coordinate activities or individual departments.</li><li>Must have thorough knowledge of all types of mechanical equipment such as chillers, boilers, water softeners, and refrigeration equipment.</li><li>Must have thorough knowledge of plumbing and electrical systems, maintenance of records of power, water, and fuel consumption.</li><li>Must have experience in office procedures, ordering materials, securing bids, city codes and other applicable building laws, building construction, blueprint reading.</li><li>Working knowledge of federal, state, and local laws governing equal employment opportunity and civil rights, occupational safety and health, wage and hour issues, and labor relations.</li><li>Pay particular attention to the overall maintenance detail owning the hotel, taking pride in executing perfectly and assuring the property is always in perfect working order.</li><li>Be proactive in always monitoring the general condition of the building and surroundings, walking the property regularly with a critical eye resolving issues as they arise.</li><li>Understand and regularly communicate with staff members the desired guest experience and how critical their role is in the successful delivery of that experience.</li><li>Develop strong interdepartmental relationships and open communication lines to assure efficient problem resolution.<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong><ul><li>Walks approximately 60% of shift. Sits at desk or in meetings approximately 40% of shift. Strength, flexibility, and good reflexes required operating power-driven machinery.</li><li>Noise and vibration are sufficient noise, either constant or intermittent, to cause marked distraction or possible injury to the sense of hearing, and / or sufficient vibration (production of an oscillating movement or strain on the body or its extremities from repeated motion or shock) to cause bodily harm if endured day after day.</li><li>Environmental conditions are both, inside and outside, a job is considered both if the activities occur inside or outside in approximately equal amounts. Temperature is moderate and controlled by hotel environmental systems.</li><li>Must be able to exert well-paced ability to reach other departments of the hotel on a timely basis.</li><li>Must be able to exert well-paced ability to maneuver between functions occurring simultaneously. </li><li>Must be able to lift up to 75 lbs. occasionally.</li><li>Must be able to push and pull carts and equipment weighing up to 250 lbs. occasionally.</li><li>Requires grasping, writing, standing, sitting, walking, repetitive motions, bending, climbing, listening, and hearing ability and visual acuity.</li><li>Talking and hearing occur continuously in the process of communicating with guests, supervisors, and subordinates.</li><li>Vision occurs continuously with the most common visual functions being those of near and color vision and depth perception.</li><li>Must be able to bend, stoop, squat and stretch to fulfill tasks occasionally.</li><li>Requires manual dexterity to use and operate all necessary equipment.</li><li>Ability to work primarily with fingers to pick, pinch, type and carry out substantial movements (motions) of the wrists and hands as well.</li><li>Must have finger dexterity to be able to operate office equipment such as computers, printers, 10-key adding machine, multi-line touch tone phone, filing cabinets, FAX machines, photocopiers, dolly and other office equipment as needed. <br/><br/></li></ul><strong>Supportive Functions<br/><br/></strong>In addition to performance of the essential functions, this position may be required to perform a combination of the following supportive functions, with the percentage of time performing each function to be solely determined by the manager based upon the particular requirements of the hotel:<br/><br/><ul><li>Assist with any guest inquiry.</li><li>Follow all company and safety and security policies and procedures.</li><li>Report maintenance problems, safety hazards, accidents, or injuries.</li><li>Complete safety training and certifications.</li><li>Develop and maintain positive working relationships with others and listen and respond appropriately to the concerns of other employees.</li><li>Any other duties as requested by direct and indirect supervisors.<br/><br/></li></ul><strong>Specific Job Knowledge, Skills And Abilities<br/><br/></strong>The individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of the job, with or without reasonable accommodation, using some other combination of knowledge, skills, and abilities:<br/><br/><ul><li>Must be able to speak, read, write, and understand the primary language used in the workplace.</li><li>Must be able to read and write to facilitate the communication process. </li><li>Requires good communication skills, both verbal and written. </li><li>Considerable knowledge of complex mathematical calculations and computer accounting programs. Budgetary analysis capabilities required.</li><li>Most tasks are performed in a team environment with the staff member acting as a team leader. There is minimal direct supervision.</li><li>Understand the technologies required in the work you are directing.</li><li>Work with a variety of situations.</li><li>Solve problems using facts and personal judgment.</li><li>React quickly in emergency situations and make decisions that may involve large expenditures or the safety of others.</li><li>Ability to analyze, forecast data, and make judgments to ensure proper payroll and production control.</li><li>Ability to supervise staff and accomplish goals on a timely basis.</li><li>Ability to effectively deal with internal and external customers some of whom will require high levels of patience, tact and diplomacy and collect accurate information to resolve conflicts.</li><li>Must be able to read and interpret drawings, diagrams, and design plans of all trades. <br/><br/></li></ul><strong>EDUCATION <br/><br/></strong><ul><li>Must have minimum two years post High School education, preferably in related area of studies, or equivalent work experience. </li><li>English fluency required. <br/><br/></li></ul><strong>Experience<br/><br/></strong><ul><li>Must have three to five years of experience in Engineering. </li><li>Engineering and maintenance background required, within the hospitality industry preferred. <br/><br/></li></ul><strong>LICENSES OR CERTIFICATIONS <br/><br/></strong>Ability to provide and maintain a valid drivers license as the position may require the operation of motorized and electric vehicles.<br/><br/><strong>GROOMING<br/><br/></strong>All Staff Members must maintain a neat, clean and well-groomed appearance per Azul Hospitality standards. Refer to the property specific required grooming and uniform standards policy.<br/><br/><strong>ATTENDANCE<br/><br/></strong>Regular attendance in conformance with the standards, which may be established by Azul Hospitality, from time to time, is essential to the successful performance of this position. Staff with irregular attendance / tardiness will be subject to disciplinary action, up to and including termination of employment. Upon employment, all staff is required to fully comply with Azul Hospitality rules and regulations for the safe and effective operation of the hotels facilities. Staff members who violate hotel rules and regulations will be subject to disciplinary action, up to and including termination of employment. Due to the cyclical nature of the hospitality industry, staff members may be required to work varying schedules to reflect the business needs of the hotel. In addition, attendance at all scheduled training sessions and meetings is required. This job description is not an exclusive or exhaustive list of all job functions that a staff member in this position may be asked to perform from time to time.", "responsibilities": "Ensure all projects are completed according to specifications and are completed on time.Work closely with the Chief Engineer/Operations Manager to ensure coordination of activities.Schedule work, order materials and complete assignments by a specified date.Perform work within departmental expense plans.Study work schedules and estimate worker-hour requirements for completion of job assignment.Interpret specifications, job orders, and company policies to staff and enforces safety regulations.Analyze and resolve work problems or assists staff in solving work problems.Initiate or suggest plans to motivate staff.Practice safe work habits and ensure safe work practices to avoid injury to self and others.May estimate, requisition, and inspect materials.May confer with other supervisors to coordinate activities or individual departments.Must have thorough knowledge of all types of mechanical equipment such as chillers, boilers, water softeners, and refrigeration equipment.Must have thorough knowledge of plumbing and electrical systems, maintenance of records of power, water, and fuel consumption.Must have experience in office procedures, ordering materials, securing bids, city codes and other applicable building laws, building construction, blueprint reading.Working knowledge of federal, state, and local laws governing equal employment opportunity and civil rights, occupational safety and health, wage and hour issues, and labor relations.Pay particular attention to the overall maintenance detail owning the hotel, taking pride in executing perfectly and assuring the property is always in perfect working order.Be proactive in always monitoring the general condition of the building and surroundings, walking the property regularly with a critical eye resolving issues as they arise.Understand and regularly communicate with staff members the desired guest experience and how critical their role is in the successful delivery of that experience.Develop strong interdepartmental relationships and open communication lines to assure efficient problem resolution.", "qualifications": {"required": "Must be able to speak, read, write, and understand the primary language used in the workplace.Must be able to read and write to facilitate the communication process. Requires good communication skills, both verbal and written. Considerable knowledge of complex mathematical calculations and computer accounting programs. Budgetary analysis capabilities required.Most tasks are performed in a team environment with the staff member acting as a team leader. There is minimal direct supervision.Understand the technologies required in the work you are directing.Work with a variety of situations.Solve problems using facts and personal judgment.React quickly in emergency situations and make decisions that may involve large expenditures or the safety of others.Ability to analyze, forecast data, and make judgments to ensure proper payroll and production control.Ability to supervise staff and accomplish goals on a timely basis.Ability to effectively deal with internal and external customers some of whom will require high levels of patience, tact and diplomacy and collect accurate information to resolve conflicts.Must be able to read and interpret drawings, diagrams, and design plans of all trades.", "preferred": "Must have minimum two years post High School education, preferably in related area of studies, or equivalent work experience. English fluency required. Must have three to five years of experience in Engineering. Engineering and maintenance background required, within the hospitality industry preferred."}, "skills": ["Communication", "Problem Solving", "Teamwork", "Leadership", "Supervisory Skills", "Maintenance", "Engineering", "HVAC", "Electrical", "Plumbing", "Blueprint Reading", "City Codes", "Building Construction", "Budgeting", "Customer Service"], "postedDate": "6 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3821936093"}