{"jobTitle": "Outside Sales Representative", "company": {"name": "Coneybeare", "location": "Buena Park, CA"}, "location": "Buena Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$130,000.00/yr - $150,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Staffing and Recruiting", "description": "<strong>Outside Sales Representative - Door and Windows <br/><br/></strong>We are looking for a hungry <strong>Door and Windows Outside Sales Super Star</strong> to join our sales team and thriving family-and employee-owned <strong>building materials and lumber company</strong>! <strong>$130K - $150K </strong>total comp. with <strong>lucrative commissions</strong>. We also offer an <strong>excellent benefits package</strong> and a <strong>very generous ESOP program!<br/><br/></strong><strong>About The Role<br/><br/></strong><ul><li>You should possess a hunter mentality and consistently prospect and pursue new business opportunities (i.e. acquire new customers, increase sales and cross-sell building materials to existing lumber customers)</li><li>About 85% of time will be spent prospecting, being on the field, cold calling, face-to-face sales. 10%-15% of time will be dedicated to in store team meetings, one-on-ones, trainings, etc.</li><li>Build and cultivate your own book of business</li><li>Learn and master the company's internal sales software</li><li>Will target contractors for residential or commercial construction projects</li><li>Company sells hardware and lumber to contractors and DIY enthusiasts<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>5-10 yr. Outside Sales experience</li><li>Ideal candidates have sales experience selling Door and Windows to contractors for residential and commercial construction projects</li><li>An entrepreneurial spirit</li><li>Hungry and incentivized by high earning potential commission structure<br/><br/></li></ul><strong>Perks<br/><br/></strong><ul><li>$130K - $150K+ total compensation in first year (includes base salary + UNCAPPED commissions)</li><li>Extremely high earning potential in following years due to uncapped commission structure</li><li>Generous Employee Stock Ownership Program (ESOP)</li><li>Excellent Comprehensive Benefits Package</li><li>Hybrid schedule allowing for some work from home, office and field time</li><li>A company that truly values its' people and their professional growth<br/><br/></li></ul><strong>More Than Just a Great Job<br/><br/></strong>If you are a passionate sales person with an entrepreneurial spirit searching for a successful career in outside sales - we want to speak with you! Join a family- and employee-owned business that fosters many exciting opportunities for professional development and advancement.", "responsibilities": "You should possess a hunter mentality and consistently prospect and pursue new business opportunities (i.e. acquire new customers, increase sales and cross-sell building materials to existing lumber customers), About 85% of time will be spent prospecting, being on the field, cold calling, face-to-face sales. 10%-15% of time will be dedicated to in store team meetings, one-on-ones, trainings, etc., Build and cultivate your own book of business, Learn and master the company's internal sales software, Will target contractors for residential or commercial construction projects, Company sells hardware and lumber to contractors and DIY enthusiasts", "qualifications": {"required": "5-10 yr. Outside Sales experience, Ideal candidates have sales experience selling Door and Windows to contractors for residential and commercial construction projects, An entrepreneurial spirit, Hungry and incentivized by high earning potential commission structure"}, "skills": [], "postedDate": "6 months ago", "applicationDeadline": "", "benefits": "$130K - $150K total comp. with lucrative commissions, excellent benefits package, very generous ESOP program, Extremely high earning potential in following years due to uncapped commission structure, Generous Employee Stock Ownership Program (ESOP), Excellent Comprehensive Benefits Package, Hybrid schedule allowing for some work from home, office and field time, A company that truly values its' people and their professional growth", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3821222054"}