{"jobTitle": "School Linked Services and Community Access Program Manager", "company": {"name": "Wellnest", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Project Management and Information Technology", "industry": "Mental Health Care", "description": "<strong>Role Summary<br/><br/></strong>The School Linked Services and Community Access Program Manager is responsible for building strategic partnerships with schools and other community partners to expand access to Wellnest’s services. This role supports building school and community culture as a Leadership team member at Wellnest.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Creates, develops, and maintains relationships with schools, community partners, and other important stakeholders of the community including but not limited to LAUSD and affiliated charter schools, the Department of Parks and Recreation, local social justice organizations, and faith-based organizations and colleges and other Institutions of higher learning.</li><li>Works with schools and community partners to ensure partners are aware of the type of services provided at Wellnest, funding sources, and program requirements to sustain adequate and ongoing referrals to Wellnest.</li><li>In collaboration with Division Directors and Chief Program Officer, builds and implements a strong outreach plan to reach as many schools and potential community partners within our targeted services areas.</li><li>Works closely with Division Directors and Chief Program Officer to develop strategic objectives centered around expanding community access to Wellnest’s services.</li><li>Leads the development of materials that educates schools and other community partners on the resources, services and programs offered at Wellnest.</li><li>Establishes and oversees Memorandums of Understanding (MOU) with LAUSD.</li><li>Develops Service Delivery Agreements (SDA) with individual schools in collaboration with the school’s principal and school leadership team (e.g., PSW’s teachers, and counselors).</li><li>Receives and reviews all referrals and triages each for medical necessity and appropriateness of referral based on potential DSM 5 diagnosis, risk and acuity level of referral, and programs and services offered at Wellnest.</li><li>Responsible for the clinical assessment for risk of harm to self and others and collaborating with the referring party to ensure an immediate safety plan when significant risk has been identified.</li><li>Works collaboratively with the Access Program Manager to ensure that caseload assignments are balanced between school and Access referral sources.</li><li>Maintains ongoing communication with referring party on the ongoing disposition of referrals as well as through the county-wide Service Request Tracking System (SRTS) and Service Request Log (SRL).</li><li>Collaborates with Clinical Supervisors to monitor the clinical progress of cases assigned through SLS/Community Partners and trains staff on providing timely intake assessments and progression through appropriate treatment models.</li><li>Maintains effective communication with staff across Wellnest programs to manage issues related to field-based and school-linked services.</li><li>Plans, coordinates participation, and represents Wellnest in community health fairs and other events.</li><li>Collaborates with Wellnest leadership teams to inform and plan ongoing relationships with community stakeholders as it relates to Wellnest’s Strategic Plan.</li><li>Participates in and provides ongoing training and professional development.</li><li>Participates in, conducts, and sustains performance quality improvement activities according to designated roles and responsibilities.</li><li>Other duties as assigned.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong>A minimum of a Master’s degree in psychology, social work, or a related field from an accredited college or university. A minimum of two (2) years of experience working within the mental health field within or outside of school settings. Must hold a valid license as a Licensed Clinical Social Worker (LCSW), Licensed Marriage and Family Therapist (LMFT) or Licensed Psychologist.<br/><br/><strong>CONDITIONS OF EMPLOYMENT<br/><br/></strong>Employee may be asked to pursue additional training when it is determined to be in the best interest of the Company. Employee must have the ability to use a personal vehicle with the required insurance coverage to complete the essential duties of their job and conduct agency business. Employee must maintain a valid California driver’s license and clean driving record that meets Wellnest’s insurance carrier’s criteria for liability coverage. In keeping with Company policy for all employees, the successful applicant must also complete a test for TB, and fingerprint clearance by the Department of Justice. Proof that you will be fully vaccinated against COVID-19 and boosted per eligibility guidelines by your employment start date. Per the CDC and Department of Public Health, individuals are considered fully vaccinated for COVID-19: two weeks or more after they have received the second dose in a 2-dose series (Pfizer-BioNTech or Moderna or vaccine authorized by the World Health Organization), or two weeks or more after they have received a single-dose vaccine (Johnson and Johnson [J&amp;J]/Janssen). The Company will provide exemptions in accordance with applicable law.<br/><br/><strong>WORKING CONDITIONS<br/><br/></strong>Employee regularly works out in the field and an office environment. Employee may be required to work flexible hours, evening and/or weekend hours, to attend events, and for time-sensitive projects.<br/><br/><strong>REASONING ABILITY<br/><br/></strong><ul><li>Strong interpersonal skills with an ability to build and maintain relationships with cultural humility.</li><li>Strong critical thinking skills with an ability to respond calmly to difficult situations.</li><li>Excellent listening and verbal communication skills.</li><li>Ability to collaborate with other providers and staff to ensure excellent clinical care.</li><li>Dedicated to continued learning to strengthen clinical practices.</li><li>Working knowledge of other community mental health services and resources.</li><li>Proficient with Microsoft Office Suite (i.e., MS Word, Excel, and Outlook). General ability to adapt to new technology systems and applications such as Zoom and Microsoft Teams.</li><li>Ability to read, analyze and interpret manual and office documents.</li><li>Ability to interpret various instructions furnished in written, oral, diagram, or schedule form.</li><li>Ability to define problems, gather, transcribe, and post data, analyze, synthesize and classify information, and draw valid conclusions where only limited standardization exists.</li><li>Ability to work independently and with others - including other employees, clients, and members of the public - in face-to-face and telephonic contexts</li><li>Ability to multi-task, establish priorities and manage time, meet deadlines and perform duties under time constraints</li><li>Ability to be flexible and adapt to changing work demands</li><li>Maintain high level of concentration and attention to detail for extended periods of time</li><li>Ability to respond effectively to sensitive inquiries or complaints</li><li>Maintain a high level of ethical and professional standards in accordance with agency and community policy<br/><br/></li></ul><strong>PHYSICAL DEMANDS<br/><br/></strong><ul><li>Ability to talk or hear in order to give and receive information and instructions.</li><li>Ability to stand, walk, sit, use hands to finger, handle or feel objects, tools or controls</li><li>Ability to reach with hands and arms.</li><li>Ability to use computer keyboard up to 75% of the day.</li><li>Visual acuity, ability to adjust focus and peripheral vision for work on a laptop or other computer equipment.</li><li>Lift and/or move up to 25 pounds.</li><li>Able to use telephone, office copier, calculator, fax machine, computer printer and scanner, or other equipment as required.<br/><br/></li></ul>This description is only intended to illustrate the duties, responsibilities and requirements for it. It is not intended, nor should it be interpreted to describe each and every duty the employee may be required to perform.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>Annualized Salary Range: $88,243to $99,150</li><li>Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.</li><li>Wellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.</li></ul>", "responsibilities": "The School Linked Services and Community Access Program Manager is responsible for building strategic partnerships with schools and other community partners to expand access to Wellnest’s services. This role supports building school and community culture as a Leadership team member at Wellnest.", "qualifications": {"required": "A minimum of a Master’s degree in psychology, social work, or a related field from an accredited college or university. A minimum of two (2) years of experience working within the mental health field within or outside of school settings. Must hold a valid license as a Licensed Clinical Social Worker (LCSW), Licensed Marriage and Family Therapist (LMFT) or Licensed Psychologist.", "preferred": ""}, "skills": [], "postedDate": "6 months ago", "benefits": "Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.\nWellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3821927002"}