{"jobTitle": "Receptionist - University Park", "company": {"name": "Wellnest", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Mental Health Care", "description": "<strong>Scope Of Responsibility<br/><br/></strong>The Receptionist is responsible for providing general office and clerical support to a program/department, by receiving visitors and members, determining the nature of their visit and notifying the appropriate Wellnest staff. Other responsibilities include answering and transferring telephone calls; representing Wellnest to callers, members and visitors in a friendly, professional manner.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Provides reception services, greets visitors, ascertains nature of business, signs-in visitors and directs visitors to appropriate person.</li><li>Operates telephone console to receive incoming calls; provides information to caller or routes caller to appropriate staff; places outgoing phone calls as needed.</li><li>Records accurate phone messages including name, time of call, nature of business and person called upon. (When needed, for example if the providers phone is not available)</li><li>Maintains general reception area and work area in a clean and professional business manner.</li><li>Performs receptionist duties, which include routine typing, filing, copying, faxing, completing and submitting Company forms, data entry and distributing communications.</li><li>Assists in ensuring all safety and health standards are followed and responds to safety issues within the facility in a timely manner.</li><li>Develops and maintains Department of Mental Health forms, trainings and materials.</li><li>Attends and actively participates in all team and staff meetings.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong>Minimum of a High School diploma/GED required, Associate’s degree preferred. Two years of receptionist experience in a customer service environment, and two years of proven experience in the area of mental health services. Experience with DMH regulations preferred. Spanish speaking required. Must have excellent communication, spelling, punctuation, and general office practices and procedures skills. Presents ideas, information, and viewpoints clearly, both verbally and in writing. Demonstrated customer service skills with ability to provide prompt, friendly courteous service to callers, visitors, clients and staff. Basic computer skills in Microsoft Office programs (Word, Excel, etc.). Effective work organization skills and ability to work with minimal supervision.<br/><br/><strong>Conditions Of Employment<br/><br/></strong>Employee must be able to work closely and effectively with Service Providers, Management Team, clients and their families. In keeping with Company policy for all employees, the successful applicant must also complete a test for TB, and fingerprint clearance by the Department of Justice. Proof that you will be fully vaccinated against COVID-19 and boosted per eligibility guidelines by your employment start date. Per the CDC and Department of Public Health, individuals are considered fully vaccinated for COVID-19: two weeks or more after they have received the second dose in a 2-dose series (Pfizer-BioNTech or Moderna or vaccine authorized by the World Health Organization), or two weeks or more after they have received a single-dose vaccine (Johnson and Johnson [J&amp;J]/Janssen). The Company will provide exemptions in accordance with applicable law.<br/><br/><strong>Working Conditions<br/><br/></strong>Employee regularly works in an office environment and comes in direct contact with Wellnest staff, clients and the public.<br/><br/><strong>Reasoning Ability<br/><br/></strong><ul><li>Ability to effectively present information and respond to questions from clients, employees and the general public</li><li>Professional, respectful, caring approach toward clients and staff</li><li>Demonstrates initiative, a positive attitude, honesty, and integrity</li><li>Team-orientation with office staff</li><li>Calm approach to problem-solving and stressful situations</li><li>Uses excellent written and oral communication skills</li><li>Strong organization, attention to detail, accurate data entry and excellent computer skills</li><li>Understands HIPAA guidelines and maintains confidentiality</li><li>Ability to read, analyze and interpret manual and office documents</li><li>Ability to interpret a variety of instructions furnished in written, oral, diagram or schedule form. </li><li>Ability to define problems, gather, transcribe and post data, analyze, synthesize and classify information, and draw valid conclusions where only limited standardization exists.</li><li>Maintain high level of concentration and attention to detail for extended periods of time. Able to manage time and priorities effectively<br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Ability to talk or hear in order to give and receive information and instructions</li><li>Ability to stand, walk, sit, use hands to finger, handle or feel objects, tools or controls</li><li>Ability to reach with hands and arms</li><li>Ability to use computer keyboard up to 75% of the day</li><li>Visual acuity, ability to adjust focus and peripheral vision for work on a laptop or other computer equipment</li><li>Lift and/or move up to 40 pounds</li><li>Able to use telephone, office copier, calculator, fax machine, computer printer and scanner, or other equipment as required<br/><br/></li></ul>This description is only intended to illustrate the duties, responsibilities and requirements for it. It is not intended, nor should it be interpreted to describe each and every duty the employee may be required to perform.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>Annualized Salary Range: $34,531 to $43,357</li><li>This position is also eligible for an annual $2,500 bilingual Spanish differential</li><li>Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.</li><li>Wellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.</li></ul>", "responsibilities": "The Receptionist is responsible for providing general office and clerical support to a program/department, by receiving visitors and members, determining the nature of their visit and notifying the appropriate Wellnest staff. Other responsibilities include answering and transferring telephone calls; representing Wellnest to callers, members and visitors in a friendly, professional manner.", "qualifications": {"required": "Minimum of a High School diploma/GED required, Associate’s degree preferred. Two years of receptionist experience in a customer service environment, and two years of proven experience in the area of mental health services. Experience with DMH regulations preferred. Spanish speaking required. Must have excellent communication, spelling, punctuation, and general office practices and procedures skills. Presents ideas, information, and viewpoints clearly, both verbally and in writing. Demonstrated customer service skills with ability to provide prompt, friendly courteous service to callers, visitors, clients and staff. Basic computer skills in Microsoft Office programs (Word, Excel, etc.). Effective work organization skills and ability to work with minimal supervision.", "preferred": "Associate’s degree"}, "skills": ["Microsoft Office", "Customer Service", "Communication", "Spanish"], "postedDate": "6 months ago", "benefits": "Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.\nWellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.", "salary": {"amount": "34,531 to 43,357", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3821921681"}