{"jobTitle": "Shift Lead-Quail Hill", "company": {"name": "Nekter Juice Bar", "location": "Irvine, CA"}, "location": "Irvine, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "16.00-18.00/hourly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food and Beverage Services", "description": "Nekter Juice Bar believes that each employee makes a significant contribution to our success. Individual contribution can be both within and outside of assigned accountability. It is our expectation that each employee will offer his/her services wherever and whenever necessary to ensure the success of our endeavors.<br/><br/><strong>Job Summary<br/><br/></strong>A Shift Leader is required to deliver the ultimate guest experience of the Nekter brand. The team member should be knowledgeable, efficient, and provide an energizing guest experience. The Shift Lead is responsible for the overall shift operations, sales performance, and execution of brand excellence in the absence of the Assistant General Manager and/or General Manager. Shift Leads typically supervise a staff of 3-7 team members and carry out management responsibilities consistent with Nekter Juice Bar standards.<br/><br/><strong>Essential Duties And Responsibilities<br/><br/></strong>Clean equipment and work areas to Nekter Juice Bar Standards. Stock supplies on an ongoing basis. Clean and maintain customer access areas to include front area, restrooms, parking lot, and any other area to Nekter Juice Bar standards. Consistently serve all Nekter Juice Bar products to specifications. Follow all health, safety, and sanitation guidelines for all products. Ensure cleanses and information pertaining to Nekter products are handed out in a timely manner. Rinse and wash product before serving. Work register, prep, clean, and juice as directed by the manager on duty. Execute proper portion control with all ingredients. Must be able to operate the cash register. Handle cash transactions while adhering to Nekter cash handling policies. Knows and effectively executes Nekter Juice Bar promotions. Handles Nekter Juice Bar coupons and gift cards according to standards.<br/><br/><strong>Work Environment<br/><br/></strong>The work environment characteristics and physical demands described here are representative of those an employee encounters while performing the essential functions of this job.<br/><br/><ul><li>1 Year of experience in the restaurant or retail industry preferred, but not required</li><li>High school degree preferred</li><li>Food Handler card provided prior to employment</li><li>Must be at least 16 years of age</li><li>Extended periods of standing (4-8 hours)</li><li>Reaching, bending, and lifting a minimum of 50 lbs</li><li>Communication Skills</li><li>Critical Thinking and Problem Solving Skills</li><li>Multi-Tasking and working in a fast paced environment</li><li>Teamwork</li><li>Attention to detail<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Sick PT</li><li>401k Program</li><li>Employee Discount</li><li>Flexible Schedule</li><li>$3 or more per hour in tips<br/><br/></li></ul>As required by applicable Pay Transparency Laws, Nekter Juice Bar provides a range of compensation for roles that may be hired in locations under these requirements. Factors that may be used to determine your actual salary may include a wide array of factors, including: your specific skills and experience, geographic location or other relevant factors.<br/><br/>The pay range for this role is: $16.00-18.00/hourly<br/><br/><em><strong>Nekter Juice Bar is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.</strong></em>", "responsibilities": "Clean equipment and work areas to Nekter Juice Bar Standards. Stock supplies on an ongoing basis. Clean and maintain customer access areas to include front area, restrooms, parking lot, and any other area to Nekter Juice Bar standards. Consistently serve all Nekter Juice Bar products to specifications. Follow all health, safety, and sanitation guidelines for all products. Ensure cleanses and information pertaining to Nekter products are handed out in a timely manner. Rinse and wash product before serving. Work register, prep, clean, and juice as directed by the manager on duty. Execute proper portion control with all ingredients. Must be able to operate the cash register. Handle cash transactions while adhering to Nekter cash handling policies. Knows and effectively executes Nekter Juice Bar promotions. Handles Nekter Juice Bar coupons and gift cards according to standards.", "qualifications": {"required": "1 Year of experience in the restaurant or retail industry preferred, but not required\nHigh school degree preferred\nFood Handler card provided prior to employment\nMust be at least 16 years of age\nExtended periods of standing (4-8 hours)\nReaching, bending, and lifting a minimum of 50 lbs\nCommunication Skills\nCritical Thinking and Problem Solving Skills\nMulti-Tasking and working in a fast paced environment\nTeamwork\nAttention to detail", "preferred": ""}, "skills": [], "postedDate": "6 months ago", "applicationDeadline": "", "benefits": "Sick PT\n401k Program\nEmployee Discount\nFlexible Schedule\n$3 or more per hour in tips", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3821974327"}