{"jobTitle": "Child and Family Specialist", "company": {"name": "Wellnest", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Other", "industry": "Mental Health Care", "description": "<strong>Scope Of Responsibility<br/><br/></strong>Specialists will work on a team providing services to children and their families/caregivers involved in the Los Angeles County foster care system using a Wraparound services delivery model. In Wraparound, the team assists high need children to be successful in school, home and their communities with the goal being to maintain children in community settings. Specialists work together with Facilitators and participate on the Child and Family Team, work directly with the children and family/caregivers per the Plan of Care in their respective environments, including but not limited to in homes, out-of-home placement(s), schools and/or in the community to help achieve permanent placement for the child(ren). Services provided will include but are not limited to mental health, crisis intervention and case management per requirements of a Los Angeles County Department of Mental Health Services contract. Specialists who understand and demonstrate independent initiative to perform in a team environment that endorses the family-driven, group decision making process at the heart of this model are preferred. Use of own car, and timely completion of duties including but not limited to paperwork, keeping records, and performing other, similar paraprofessional job duties are required.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Provides community linkages and resources for the child or youth.</li><li>Encourages the child or youth to utilize their formal and informal supports appropriately.</li><li>Promotes functional skills building and teaches coping skills that will allow the child or youth to participate in CFT meetings and reduce functional impairments (academic, social, emotional, medical, and occupational). </li><li>Collaborates in gathering information regarding the youth or family’s past trauma experiences.</li><li>Consults with the clinician on the child or youth’s underlying needs and trauma and collaborates with the clinician on improving the symptoms and behaviors of the child or youth.</li><li>Works with school personnel to recognize signs of trauma that may be causing behavioral issues at school.</li><li>Assists formal and informal supports with re-labeling behaviors associated with trauma and provides increased awareness of the emotional needs of children and youth.</li><li>Advocates for positive behavior interventions such as support, guidance, social and emotional learning, mediation, and conflict resolution. </li><li>Other duties as assigned.<br/><br/></li></ul><strong>Required Qualifications<br/><br/></strong>Bachelor’s degree in social work, counseling or psychology from an accredited college or university is required. A minimum of two (2) years of experience working with children or adolescents and their families is required.<br/><br/><strong>Conditions Of Employment<br/><br/></strong>Employee may be asked to pursue additional training when it is determined to be in the best interest of the Company. Employee must have the ability to use a personal vehicle with the required insurance coverage to complete the essential duties of their job and conduct agency business. Employee must maintain a valid California driver’s license and clean driving record that meets Wellnest’s insurance carrier’s criteria for liability coverage. In keeping with Company policy for all employees, the successful applicant must also complete a test for TB, and fingerprint clearance by the Department of Justice. Proof that you will be fully vaccinated against COVID-19 and boosted per eligibility guidelines by your employment start date. Per the CDC and Department of Public Health, individuals are considered fully vaccinated for COVID-19: two weeks or more after they have received the second dose in a 2-dose series (Pfizer-BioNTech or Moderna or vaccine authorized by the World Health Organization), or two weeks or more after they have received a single-dose vaccine (Johnson and Johnson [J&amp;J]/Janssen). The Company will provide exemptions in accordance with applicable law.<br/><br/><strong>Working Conditions<br/><br/></strong>Employee regularly works out in the field and in an office environment. Employee may be required to work flexible, evening and/or weekend hours for time-sensitive projects.<br/><br/><strong>Reasoning Ability<br/><br/></strong><ul><li>Ability to effectively present information and respond to questions</li><li>Ability to read, analyze and interpret manual and office documents</li><li>Ability to interpret a variety of instructions furnished in written, oral, diagram or schedule form. </li><li>Ability to define problems, gather, transcribe and post data, analyze, synthesize and classify information, and draw valid conclusions.</li><li>Ability to work independently and with others - including other employees, clients and members of the public - in face-to-face and telephonic contexts.</li><li>Ability to multi-task, establish priorities and manage time, meet deadlines and perform duties under time constraints.</li><li>Ability to be flexible and adapt to changing work demands.</li><li>Maintain a high level of concentration and attention to detail for extended periods of time.</li><li>Maintain a high level of ethical and professional standards in accordance with agency policy. <br/><br/></li></ul><strong>Physical Demands<br/><br/></strong><ul><li>Ability to talk or hear in order to give and receive information and instructions.</li><li>Ability to stand, walk, sit, use hands to finger, handle or feel objects, tools or controls</li><li>Ability to reach with hands and arms.</li><li>Ability to use computer keyboard up to 50% of the day.</li><li>Visual acuity, ability to adjust focus and peripheral vision for work on a laptop or other computer equipment.</li><li>Lift and/or move up to 25 pounds.</li><li>Able to use telephone, office copier, calculator, fax machine, computer printer and scanner, or other equipment as required.<br/><br/></li></ul>This description is only intended to illustrate the duties, responsibilities and requirements for it. It is not intended, nor should it be interpreted to describe each and every duty the employee may be required to perform.<br/><br/><strong>Compensation And Benefits<br/><br/></strong><ul><li>Annualized Salary Range: $45,987 to $51,671</li><li>This position is also eligible for an annual $3,000 bilingual Spanish differential, and a $2,500 Intensive Services differential</li><li>Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.</li><li>Wellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.</li></ul>", "responsibilities": "Specialists will work on a team providing services to children and their families/caregivers involved in the Los Angeles County foster care system using a Wraparound services delivery model. In Wraparound, the team assists high need children to be successful in school, home and their communities with the goal being to maintain children in community settings. Specialists work together with Facilitators and participate on the Child and Family Team, work directly with the children and family/caregivers per the Plan of Care in their respective environments, including but not limited to in homes, out-of-home placement(s), schools and/or in the community to help achieve permanent placement for the child(ren). Services provided will include but are not limited to mental health, crisis intervention and case management per requirements of a Los Angeles County Department of Mental Health Services contract. Specialists who understand and demonstrate independent initiative to perform in a team environment that endorses the family-driven, group decision making process at the heart of this model are preferred. Use of own car, and timely completion of duties including but not limited to paperwork, keeping records, and performing other, similar paraprofessional job duties are required.", "qualifications": {"required": "Bachelor’s degree in social work, counseling or psychology from an accredited college or university is required. A minimum of two (2) years of experience working with children or adolescents and their families is required."}, "skills": [], "postedDate": "6 months ago", "benefits": "Wellnest offers $10,000/year to build a personalized health benefits package from a choice of available medical, dental, and vision coverage plans, as well as an employer-paid $50,000 life insurance policy.\nWellnest employees benefit from an employer-sponsored 401(k) company match, dollar for dollar, up to 4%, and a profit-sharing contribution benefit of up to 5%.", "remoteWork": null, "salary": {"amount": "45,987 to $51,671", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3821922524"}