{"jobTitle": "Merchandiser", "company": {"name": "Straub Distributing", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Other", "experienceLevel": "Entry level", "jobFunction": "Marketing and Sales", "industry": "Beverage Manufacturing", "description": "Merchandisers work in local stores to keep Anheuser- Busch products stocked on the shelves. This position is primarily responsible for maintaining product availability and merchandising products at all designated accounts.<br/><br/>Account Territories: Orange County, Norco, Corona, Lake Elsinore and Murrieta. (Once assigned a territory, Merchandisers will begin their work day by driving to their first account. Daily trips to Orange County will not be required.<br/><br/>Tasks / Responsibilities<br/><br/><ul><li>Ensure proper level of beer and other beverages are stocked. </li><li>Ensure all merchandise is displayed appropriately with proper signage and favorable shelf placement.</li><li>Responsible for proper product rotation on shelves and complying with proper product rotation standards for product freshness and quality.</li><li>Prepare and organize back rooms of stores and condense back stock each time in store to keep these areas clean at all times.</li><li>Responsible for building, setting, securing and moving displays.</li><li>Submit daily summary of activities and installations to your supervisor and return all work order slips to the appropriate Chain Sales representative.</li><li>Responsible for check/hang/point of sale.</li><li>Establish and maintain friendly and professional relationships with customers.</li><li>Adhere to company merchandising standards.</li><li>Must be able to work weekends and holidays.</li><li>Responsible for servicing 9 to 12 stops daily.</li><li>Any other tasks or responsibilities assigned to you by your supervisor.<br/><br/></li></ul><strong>Abilities<br/><br/></strong><ul><li>Be organized, focused, patient, and flexible.</li><li>Ability to work well independently.</li><li>Must have excellent customer service skills.</li><li>A sense of urgency, comfort with ambiguity, drive for results and ability to remain true to the company’s brand and image.</li><li>Must be self-motivated with a high degree of integrity and be able perform job duties with minimal supervision on a timely basis.</li><li>Must be able to calculate (add, subtract, multiply, divide) decimals and whole numbers.<br/><br/></li></ul>Physical Demands<br/><br/>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Must be able to stand and walk for long periods of time.</li><li>Must be able to climb stairs/ladders, balance, stoop, kneel, crouch, talk, hear, and reach with both hands and arms repetitively throughout the day.</li><li>Must have good vision (close, color vision, peripheral, depth perception, adjust focus).</li><li>Must be able to lift up to 50 lbs repetitively throughout day.</li><li>Must be willing to adapt to various environments including but not limited to: Extreme cold (coolers), Grocery Stores, Enclosed spaces, high places (second stories/stoops) and messy/dirty areas.</li><li> This position requires a pre-employment physical ability test<br/><br/></li></ul>Non-Exempt: This position will be paid on an hourly basis for all hours worked, and is considered eligible for payment of overtime pay per applicable state law.<br/><br/><strong>Straub Benefit Offerings For Full-time Employees<br/><br/></strong><ul><li>Medical (HMO, PPO, HSA)</li><li>Dental (HMO, PPO)</li><li>Vision</li><li>Basic Life and AD&amp;D</li><li>Supplemental Life and AD&amp;D</li><li>Long Term Disability</li><li>Employee Assistance Program</li><li>Voluntary Accident and Hospital<br/><br/></li></ul>Vacation Pay, Sick Pay, Bereavement Leave, Holiday Pay, 401K and Profit Sharing", "responsibilities": "Ensure proper level of beer and other beverages are stocked. Ensure all merchandise is displayed appropriately with proper signage and favorable shelf placement. Responsible for proper product rotation on shelves and complying with proper product rotation standards for product freshness and quality. Prepare and organize back rooms of stores and condense back stock each time in store to keep these areas clean at all times. Responsible for building, setting, securing and moving displays. Submit daily summary of activities and installations to your supervisor and return all work order slips to the appropriate Chain Sales representative. Responsible for check/hang/point of sale. Establish and maintain friendly and professional relationships with customers. Adhere to company merchandising standards. Must be able to work weekends and holidays. Responsible for servicing 9 to 12 stops daily. Any other tasks or responsibilities assigned to you by your supervisor.", "qualifications": {"required": "Be organized, focused, patient, and flexible. Ability to work well independently. Must have excellent customer service skills. A sense of urgency, comfort with ambiguity, drive for results and ability to remain true to the company’s brand and image. Must be self-motivated with a high degree of integrity and be able perform job duties with minimal supervision on a timely basis. Must be able to calculate (add, subtract, multiply, divide) decimals and whole numbers."}, "skills": [], "postedDate": "6 months ago", "benefits": "Medical (HMO, PPO, HSA), Dental (HMO, PPO), Vision, Basic Life and AD&amp;D, Supplemental Life and AD&amp;D, Long Term Disability, Employee Assistance Program, Voluntary Accident and Hospital, Vacation Pay, Sick Pay, Bereavement Leave, Holiday Pay, 401K and Profit Sharing", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3821962592"}