{"jobTitle": "Program Manager - Conservation Programs - South LA", "company": {"name": "LA Conservation Corps", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Project Management and Information Technology", "industry": "Non-profit Organizations", "description": "<strong>Organization Summary<br/><br/></strong>The LA Conservation Corps (“the Corps”) is a private, non-profit organization that has helped at-risk young adults develop themselves since 1986. To date, more than 20,000 young people have participated in the Corps classes and service projects, learning new skills while contributing to the quality of life for residents of the greater Los Angeles area.<br/><br/><strong>Mission <br/><br/></strong>We create equitable opportunities for young people to build resilience in themselves, their communities and the environment through a program of work, education and support.<br/><br/><strong>Position Summary<br/><br/></strong>Reporting to the SLA Program Director, the Program Manager is a key contributor to the organization’s success and sustainability by contributing to the accomplishment of the organization’s mission, business goals and vision by establishing new and maintaining current development resources that will identify and cultivate funding to grow and sustain the organization. This position provides primary management for the organization’s Restoration Projects assigned to the South LA Site. Current list of active projects includes the following projects: BHSO Restoration Project, MWD Annual Vegetation Management Project, USFS IRA Wildfire/Restoration Project, and the Cheeseboro Fire Fuel Management Project. The primary responsibility of the Program Manager is to ensure the delivery of program and services for the purpose of enhancing the development of youth and communities served by the Corps. Responsibilities include the development, coordination and implementation of programs and projects as they are developed as well. Other duties may be assigned, as required.<br/><br/><strong>Essential Responsibilities<br/><br/></strong><strong>Compliance <br/><br/></strong><ul><li>Oversees the development of the Beatification and Restoration Projects assigned to the South LA Site</li><li>Maintains necessary files and documentation for contractual requirements.</li><li>Oversees contract compliance and program outcomes.</li><li>Provides detail-oriented project management.<br/><br/></li></ul><strong>Facilitation and Partnerships<br/><br/></strong><ul><li>Co-designs, oversees, and implements day-to-day project activities.</li><li>Assists Site Director with overseeing budgets and provide necessary information for invoicing and reporting. </li><li>Plans and attends regular program meetings with project sponsors and other subcontractors to ensure that operations and program goals are being met.</li><li>Supervises, coaches, and mentors all program staff under his/her responsibility.</li><li>Manages various projects and other duties assigned.</li><li>Prepares reports, budgets, correspondence, proposals, and other documents.</li><li>Keeps abreast of current trends and issues in Los Angeles nonprofit sectors.</li><li>Participates in monthly Senior Management Team meetings, Safety Meetings, and Financial Meetings.</li><li>Works and communicates with program sponsors, local community organizations and other public and private agencies to guarantee that scheduled goals are met.<br/><br/></li></ul><strong>Fiscal Management<br/><br/></strong><ul><li>Reviews program spending and budgeting.</li><li>Assists with the development of annual budgets for the site.</li><li>Ensures staff activities and program spending meet departmental and program goals.</li><li>Manages approximately $2 to 4 million in program funding annually and over 40-50 participants.<br/><br/></li></ul><strong>Program Management<br/><br/></strong><ul><li>Submits Sponsor Agreements and Independent Contract Agreements on an annual basis and as needed for projects.</li><li>Responsible for program deliverables, goals, and outcomes for all managed projects.</li><li>Responsible for overseeing staff and participant payroll.<br/><br/></li></ul><strong>Reporting <br/><br/></strong><ul><li>Prepares monthly, quarterly and final reports for projects/programs being managed.</li><li>Creates and maintains accurate program budgets in Sage and/or other financial platforms.</li><li>Submits weekly reports on all active projects.</li><li>Supports data entry into Paycom payroll system for Corpsmembers and Supervisors.</li><li>Updates Corpsmember records in Salesforce software application as needed.</li><li>Prepares Project Information Sheets for supervisors as needed for projects.<br/><br/></li></ul><strong>Site Management and Operations<br/><br/></strong><ul><li>Provides support and assistance to The Director of Conservation Programs South LA.</li><li>Conducts regular site visits on active projects.</li><li>Participates in the development of the South LA site’s weekly roster.</li><li>Performs quality assurance and quality control to ensure successful deliverables.</li><li>Maintains relationships with elected city officials, Councilmember staff, partner organizations, and constituents.</li><li>Tracks deliverables, outcomes, and generates reports for city and state contracts, and other funders.</li><li>Ensures successful execution of programs and projects annually, including, outreach and education projects, community beautification initiatives and program, recreational projects, and environmental projects.<br/><br/></li></ul><strong>Staff Management and Professional Development<br/><br/></strong><ul><li>Oversees and manage program staff that support the above mentioned projects.</li><li>Conducts quarterly and annual reviews for directly supervised employees.</li><li>Reviews quarterly Corpsmember evaluations.</li><li>Attends professional development opportunities as funding allows.</li><li>Other duties may be assigned as needed.<br/><br/></li></ul><em>The Corps’ provides a great work environment that includes great work-life balance, top-tier benefits, and an excellent vacation package.<br/><br/></em><em>Please note that this job announcement is not designed to cover or contact a comprehensive listing of activities, duties and/or responsibilities that may be required of the employee for this job. Duties responsibilities and activities may change at any time and without notice.<br/><br/></em><em>Due to the organization’s response to the COVID-19 pandemic, your essential functions and responsibilities may change to accommodate the needs of the program and to stay in compliance with CDC and County of LA Public Health Department requirements.<br/><br/></em><strong>Minimum Requirements/Qualifications<br/><br/></strong><ul><li>Demonstrate excellent analytical and organizational skills; characterized by identifying, assimilating and comprehending the critical elements of various situations, and extracting and interpreting the implications of courses of action.</li><li>Demonstrate excellent communication and presentation skills (verbal and written); characterized by actively listening and ensuring respectful two-way communication.</li><li>Demonstrate sensitivity, understanding, and the ability to effectively interact with individuals (internal and external) from diverse cultural, socioeconomic, disability and ethnic backgrounds.</li><li>Demonstrate strong time management skills and a high level of attention to detail.</li><li>Demonstrate a high level of accountability, responsibility, and dependability.</li><li>Demonstrate teamwork through cooperation and collaboration with others.</li><li>Demonstrate a positive attitude, self-discipline and self-awareness.</li><li>Ability to prepare concise, logical and grammatically correct documents, reports, and presentations.</li><li>Ability to accept, direct and perform responsibilities and assigned tasks as a project team member in support of the overall project.</li><li>Ability to explain policies, procedures, directions and represent the Corps’ philosophy and values to a wide range of audiences including corpsmembers, programmatic staff, management and the public.</li><li>Ability to structure tasks, establish priorities and set goals.</li><li>Ability to effectively perform the physical requirements of the job, as well as train others.</li><li>Ability to balance competing priorities and multiple stakeholders. </li><li>Ability to work independently.</li><li>Intermediate level of computer skills (Microsoft Office environment) including Excel, Word, PowerPoint, software and Internet research.</li><li>High level of interpersonal skills, integrity and the ability to keep information confidential.</li><li>Uses good judgment, evaluates alternatives in the achievement of quality outcomes. </li><li>Results-/Solution-oriented; flexible.</li><li>Passion for the Corps and ability to articulate its mission.<br/><br/></li></ul><strong>Required Education And Experience<br/><br/></strong><ul><li>A Bachelor’s degree (from an accredited institution) in a related field or A minimum of four (4) years of experience in project management; A minimum of four (4) years of experience in contract management, construction management, budgeting, contract compliance and/or youth development youth and workforce development; Or any combination of experience and education that would achieve the desired outcome, as determined by the Executive, Deputy and Human Resource Directors.</li><li>Proficiency in using and providing instruction for tools appropriate for various work projects. </li><li>Minimum of six (6) years of experience of project management, construction management, contract management, budgeting, contract compliance and youth development preferred.</li><li>Previous experience working in the non-profit or public sector preferred. <br/><br/></li></ul><strong>Other Duties And Requirements<br/><br/></strong><ul><li>Attend events and meetings in the community to support the program. This can involve working Saturdays or Sundays, as needed. </li><li>Standard multi-media first aid certification. If you do not currently possess a standard multi-media first aid certification, you will have 90 days from the effective date of acquiring this position to secure it. </li><li>Pass a post-offer drug/alcohol screen test before commencing employment (required to submit for the drug/alcohol screening at a company designated facility). </li><li>Pass a post-offer Live Scan (fingerprint/background clearance-Department of Justice) before commencing employment. </li><li>California Driver’s License, validation of driving record for commercial policy insurability per the requirements of the state of California. </li><li>If a private vehicle is utilized for company purposes validation of a California Class C Driver’s License, validation of driving record and approval of commercial policy insurability is required in conjunction with proof of personal minimum liability insurance coverage per the requirements of the state of California. </li><li>Reference checks will be conducted; employment is contingent upon receipt of acceptable references. </li><li>Must be COVID-19 vaccinated and be able to provide supporting documentation. <br/><br/></li></ul><strong>Salary And Benefits<br/><br/></strong><ul><li>Salary $65,765 - $84,044 annually (reflects the entire salary range). A starting salary higher than $65,765 annually is based on a level of experience and education that significantly exceeds the minimum requirements and is commensurate with the compensation scale (salary range).</li><li>Medical, Dental, Vision Benefits with 93% employer coverage of costs for employee and 79% coverage for additional family members. </li><li>3 weeks of vacation accrued per year; 11 paid Holidays and 80 hours of sick time accrued per year. </li><li>401k retirement plan with match of up to 4%. <br/><br/></li></ul><strong>Application Procedure <br/><br/></strong>Complete application and provide resume and cover letter at www.lacorps.org. The Los Angeles Conservation Corps only employs individuals who are lawfully authorized to work in the United States.<br/><br/>Based upon a review of your application and supportive information, applicants will be considered for the interview portion. The interview will cover education and experience requirements. Applicants who need reasonable accommodations to apply or interview for this position must notify Human Resources at least four (4) business days before the closing date of the position or, if applicable, at the time an interview is scheduled.<br/><br/>AAO/EEO Statement<br/><br/>It is the policy of LA Conservation Corps to seek and employ qualified workforce at all locations, job sites, and facilities, and to provide equal employment opportunities for all applicants and employees in recruiting, hiring, placement, training, compensation and benefits, promotion, transfer, and termination.<br/><br/>LA Conservation Corps<br/><br/>Equal Opportunity Employer<br/><br/><strong>www.lacorps.org</strong>", "responsibilities": "<strong>Essential Responsibilities<br/><br/></strong><strong>Compliance <br/><br/></strong><ul><li>Oversees the development of the Beatification and Restoration Projects assigned to the South LA Site</li><li>Maintains necessary files and documentation for contractual requirements.</li><li>Oversees contract compliance and program outcomes.</li><li>Provides detail-oriented project management.<br/><br/></li></ul><strong>Facilitation and Partnerships<br/><br/></strong><ul><li>Co-designs, oversees, and implements day-to-day project activities.</li><li>Assists Site Director with overseeing budgets and provide necessary information for invoicing and reporting. </li><li>Plans and attends regular program meetings with project sponsors and other subcontractors to ensure that operations and program goals are being met.</li><li>Supervises, coaches, and mentors all program staff under his/her responsibility.</li><li>Manages various projects and other duties assigned.</li><li>Prepares reports, budgets, correspondence, proposals, and other documents.</li><li>Keeps abreast of current trends and issues in Los Angeles nonprofit sectors.</li><li>Participates in monthly Senior Management Team meetings, Safety Meetings, and Financial Meetings.</li><li>Works and communicates with program sponsors, local community organizations and other public and private agencies to guarantee that scheduled goals are met.<br/><br/></li></ul><strong>Fiscal Management<br/><br/></strong><ul><li>Reviews program spending and budgeting.</li><li>Assists with the development of annual budgets for the site.</li><li>Ensures staff activities and program spending meet departmental and program goals.</li><li>Manages approximately $2 to 4 million in program funding annually and over 40-50 participants.<br/><br/></li></ul><strong>Program Management<br/><br/></strong><ul><li>Submits Sponsor Agreements and Independent Contract Agreements on an annual basis and as needed for projects.</li><li>Responsible for program deliverables, goals, and outcomes for all managed projects.</li><li>Responsible for overseeing staff and participant payroll.<br/><br/></li></ul><strong>Reporting <br/><br/></strong><ul><li>Prepares monthly, quarterly and final reports for projects/programs being managed.</li><li>Creates and maintains accurate program budgets in Sage and/or other financial platforms.</li><li>Submits weekly reports on all active projects.</li><li>Supports data entry into Paycom payroll system for Corpsmembers and Supervisors.</li><li>Updates Corpsmember records in Salesforce software application as needed.</li><li>Prepares Project Information Sheets for supervisors as needed for projects.<br/><br/></li></ul><strong>Site Management and Operations<br/><br/></strong><ul><li>Provides support and assistance to The Director of Conservation Programs South LA.</li><li>Conducts regular site visits on active projects.</li><li>Participates in the development of the South LA site’s weekly roster.</li><li>Performs quality assurance and quality control to ensure successful deliverables.</li><li>Maintains relationships with elected city officials, Councilmember staff, partner organizations, and constituents.</li><li>Tracks deliverables, outcomes, and generates reports for city and state contracts, and other funders.</li><li>Ensures successful execution of programs and projects annually, including, outreach and education projects, community beautification initiatives and program, recreational projects, and environmental projects.<br/><br/></li></ul><strong>Staff Management and Professional Development<br/><br/></strong><ul><li>Oversees and manage program staff that support the above mentioned projects.</li><li>Conducts quarterly and annual reviews for directly supervised employees.</li><li>Reviews quarterly Corpsmember evaluations.</li><li>Attends professional development opportunities as funding allows.</li><li>Other duties may be assigned as needed.<br/><br/></li></ul>", "qualifications": {"required": "Demonstrate excellent analytical and organizational skills; characterized by identifying, assimilating and comprehending the critical elements of various situations, and extracting and interpreting the implications of courses of action.\nDemonstrate excellent communication and presentation skills (verbal and written); characterized by actively listening and ensuring respectful two-way communication.\nDemonstrate sensitivity, understanding, and the ability to effectively interact with individuals (internal and external) from diverse cultural, socioeconomic, disability and ethnic backgrounds.\nDemonstrate strong time management skills and a high level of attention to detail.\nDemonstrate a high level of accountability, responsibility, and dependability.\nDemonstrate teamwork through cooperation and collaboration with others.\nDemonstrate a positive attitude, self-discipline and self-awareness.\nAbility to prepare concise, logical and grammatically correct documents, reports, and presentations.\nAbility to accept, direct and perform responsibilities and assigned tasks as a project team member in support of the overall project.\nAbility to explain policies, procedures, directions and represent the Corps’ philosophy and values to a wide range of audiences including corpsmembers, programmatic staff, management and the public.\nAbility to structure tasks, establish priorities and set goals.\nAbility to effectively perform the physical requirements of the job, as well as train others.\nAbility to balance competing priorities and multiple stakeholders. \nAbility to work independently.\nIntermediate level of computer skills (Microsoft Office environment) including Excel, Word, PowerPoint, software and Internet research.\nHigh level of interpersonal skills, integrity and the ability to keep information confidential.\nUses good judgment, evaluates alternatives in the achievement of quality outcomes. \nResults-/Solution-oriented; flexible.\nPassion for the Corps and ability to articulate its mission.<br/><br/>", "preferred": "A Bachelor’s degree (from an accredited institution) in a related field or A minimum of four (4) years of experience in project management; A minimum of four (4) years of experience in contract management, construction management, budgeting, contract compliance and/or youth development youth and workforce development; Or any combination of experience and education that would achieve the desired outcome, as determined by the Executive, Deputy and Human Resource Directors.\nProficiency in using and providing instruction for tools appropriate for various work projects. \nMinimum of six (6) years of experience of project management, construction management, contract management, budgeting, contract compliance and youth development preferred.\nPrevious experience working in the non-profit or public sector preferred. <br/><br/>"}, "skills": ["Project Management", "Contract Management", "Construction Management", "Budgeting", "Contract Compliance", "Youth Development", "Non-profit", "Public Sector", "Microsoft Office", "Excel", "Word", "PowerPoint", "Software", "Internet Research", "Interpersonal Skills", "Integrity", "Confidentiality", "Judgment", "Problem Solving", "Teamwork", "Communication", "Presentation Skills", "Time Management", "Attention to Detail", "Accountability", "Responsibility", "Dependability", "Positive Attitude", "Self-Discipline", "Self-Awareness", "Passion"], "postedDate": "6 months ago", "benefits": "The Corps’ provides a great work environment that includes great work-life balance, top-tier benefits, and an excellent vacation package.<br/><br/>\nSalary $65,765 - $84,044 annually (reflects the entire salary range). A starting salary higher than $65,765 annually is based on a level of experience and education that significantly exceeds the minimum requirements and is commensurate with the compensation scale (salary range).\nMedical, Dental, Vision Benefits with 93% employer coverage of costs for employee and 79% coverage for additional family members. \n3 weeks of vacation accrued per year; 11 paid Holidays and 80 hours of sick time accrued per year. \n401k retirement plan with match of up to 4%. <br/><br/>", "remoteWork": "No", "salary": {"amount": "65,765.00 - 84,044.00", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3822380082"}