{"jobTitle": "Etsy Consultant", "company": {"name": "Fud, Inc.", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "Fud, the World's First Social Hustling Community, is seeking a talented Etsy Consultant to join our growing community. As a Etsy Consultant, you will be responsible for helping our users optimize their Etsy stores and increase conversions. This is a key role within our community that requires expert knowledge of Etsy and retail industry experience.<br/><br/>At Fud, we're on a mission to help people put more money in their pockets. As a member of the community, you'll play a critical role in helping others achieve their financial goals. We're a close-knit community of hustlers helping hustlers, and we're looking for an experienced Etsy Consultant to join us and help us continue to grow.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Work directly with users to optimize their Etsy stores</li><li>Analyze conversion data and provide recommendations for improvements</li><li>Stay up-to-date with the latest Etsy best practices and industry trends</li><li>Manage multiple projects and clients simultaneously, ensuring deadlines are met<br/><br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>3+ years of experience as a Etsy seller/expert</li><li>Strong understanding of retail industry and ecommerce best practices</li><li>Experience working with ecommerce tools such as Google Analytics, email marketing tools, and SEO optimization tools</li><li>Ability to work independently and efficiently manage time and priorities</li><li>Excellent communication and collaboration skills<br/><br/><br/></li></ul><strong>Benefits<br/><br/></strong><strong>Why should you join Fud?<br/><br/></strong><ul><li>Find a community of like-minded hard working solopreneurs and entrepreneurs</li><li>Choose your own schedule and work when you want.</li></ul>", "responsibilities": "Work directly with users to optimize their Etsy stores, Analyze conversion data and provide recommendations for improvements, Stay up-to-date with the latest Etsy best practices and industry trends, Manage multiple projects and clients simultaneously, ensuring deadlines are met", "qualifications": {"required": "3+ years of experience as a Etsy seller/expert, Strong understanding of retail industry and ecommerce best practices, Experience working with ecommerce tools such as Google Analytics, email marketing tools, and SEO optimization tools, Ability to work independently and efficiently manage time and priorities, Excellent communication and collaboration skills"}, "skills": ["Etsy", "Retail", "Ecommerce", "Google Analytics", "Email Marketing", "SEO"], "postedDate": "7 months ago", "benefits": "Find a community of like-minded hard working solopreneurs and entrepreneurs, Choose your own schedule and work when you want.", "url": "https://www.linkedin.com/jobs/view/3823207575"}