{"jobTitle": "Administrative Assistant", "company": {"name": "RAND", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "43,500 - 90,800", "currency": "USD"}, "jobFunction": "Research, Science, and Analyst", "industry": "Think Tanks, Research Services, and Non-profit Organizations", "description": "<strong>Job Type<br/><br/></strong>Regular<br/><br/><strong>Job Description<br/><br/></strong><strong><em>Want to work in an exciting, challenging and intellectual environment? <br/><br/></em></strong>We are always seeking passionate and technically savvy <strong>Administrative Assistants </strong>to support Researchers in various disciplines.<br/><br/>Multiple administrative assistant positions supporting Researchers and Directors across the organization depending upon experience level. This role requires a team player who is flexible, able to swiftly change pace, adapts to changing priorities and juggle a varied work mix while working under minimal supervision.<br/><br/>We want individuals who are committed to our core values of quality and objectivity and who want to make an impact. We value qualified candidates with unique backgrounds and work experience.<br/><br/><strong>Successful Candidates Will Possess<br/><br/></strong><ul><li>Excellent oral and written communication skills.</li><li>Solid technical skills</li><li>Prioritizing professionalism within the workplace, demonstrating tact, courtesy, and discretion when working with clients and other staff members</li><li>Work both independently and effectively as a team player.</li><li>Excellent organization skills with emphasis on multitasking</li><li>The capacity to work accurately with an attention to detail.</li><li>Ability to be proactive and take initiative.</li><li>Ability to multitask and prioritize a wide range of support responsibilities.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>Intermediate to advanced knowledge of Mac and/or PC platforms, Microsoft Word, PowerPoint and Excel.<br/><br/><strong>Security Clearance<br/><br/></strong>U.S. Citizenship may be required for positions requiring a U.S. government security clearance.<br/><br/><strong>Experience<br/><br/></strong>Junior: up to one-year minimum experience; 3-5 years preferred<br/><br/>Mid/Senior Level: 1-2 years minimum experience; 6-8 years preferred<br/><br/><strong>Education Requirements<br/><br/></strong>Minimum: High School; Preferred: BS/BA<br/><br/><strong>Location</strong><strong>:<br/><br/></strong>Santa Monica, CA (some roles offer hybrid and flexible schedules)<br/><br/><strong>Salary Rang</strong><strong>e</strong><strong>:</strong> $43,500 - $90,800<br/><br/>Administrative Assistant II $43,500 - $62,900<br/><br/>Administrative Assistant III $49,900 - $72,300<br/><br/>Administrative Assistant IV $54,700 - $ 81,400<br/><br/>Administrative Assistant V $60,900 - $90,800<br/><br/>RAND considers a variety of factors when formulating an offer, including but not limited to, the specific role and associated responsibilities; a candidate’s work experience, education/training, skills, expertise; and internal equity. This position is overtime eligible. Successful candidates will be offered employment in a specific title, as determined by the candidate's education and experience. In addition, RAND provides strong benefits including health insurance coverage, life and disability insurance, savings plan, paid time-off and more.<br/><br/><strong><em>Diversity at RAND<br/><br/></em></strong>Diversity, equity, and inclusivity are essential operating principles at RAND. We are committed to maintaining a collegial environment that respects the contributions and dignity of all staff, where individual differences are recognized, appreciated, and responded to in ways that fully develop and utilize each person’s talents and strengths. This commitment is guided by an organization-wide framework for advancing diversity, equity, and inclusion, and paired with significant investments to sustain and center these principles in leadership, research, and community and stakeholder engagement. An advisory council comprised of staff at all levels provides critical feedback and perspective on the organization's diversity, equity, and inclusion plans and activities. Employee Resource Groups are staff-driven grassroots communities that seek to advance diversity, equity, and inclusion at RAND by facilitating community, connection, and a greater sense of belonging and well-being among colleagues. In our recruitment and retention efforts, we seek unique backgrounds, original views, and diversity in academic training, work experience, and ideological outlook.<br/><br/><em>Equal Opportunity Employer: race/color/religion/sex/sexual orientation/gender identity/national origin/disability/vet</em>", "responsibilities": "This role requires a team player who is flexible, able to swiftly change pace, adapts to changing priorities and juggle a varied work mix while working under minimal supervision.", "qualifications": {"required": "Excellent oral and written communication skills. Solid technical skills Prioritizing professionalism within the workplace, demonstrating tact, courtesy, and discretion when working with clients and other staff members Work both independently and effectively as a team player. Excellent organization skills with emphasis on multitasking The capacity to work accurately with an attention to detail. Ability to be proactive and take initiative. Ability to multitask and prioritize a wide range of support responsibilities.", "preferred": "Intermediate to advanced knowledge of Mac and/or PC platforms, Microsoft Word, PowerPoint and Excel."}, "skills": ["Communication", "Technical Skills", "Organization", "Multitasking", "Microsoft Word", "PowerPoint", "Excel"], "postedDate": "2 weeks ago", "benefits": "RAND provides strong benefits including health insurance coverage, life and disability insurance, savings plan, paid time-off and more.", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3824678420"}