{"jobTitle": "Warehouse Associate - 2nd Shift", "company": {"name": "TW Metals LLC", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Mining", "description": "This position is from 3:30 pm to 11 PM, Monday to Friday. <br/><br/>There is a $2 shift differential<br/><br/>Responsibilities:  Although a material handler may perform any and all warehouse duties, the majority of time is spent pulling material to fill sales orders, weighing and counting such material, writing in the necessary information on a sales order, and packaging the material; in the case of Metal Joining material and/or material to be shipped via UPS, forwarding these goods to packers who will package them.<br/><br/><ul><li>Pulls material from stock to fill sales orders.</li><li>Weighs or counts such material and writes the necessary information on sales orders.</li><li>Packs material for shipment.</li><li>Performs miscellaneous duties such as department “clean-up”.</li><li>Operates equipment such as cranes, high-lifts, and fork trucks.<br/><br/><br/></li></ul>Requirements<br/><br/><ul><li>High school diploma or general education degree (GED)</li><li>One to three months related experience and/or training; or equivalent combination of education and experience</li><li>Mechanical ability to function on a forklift/side loader</li><li>The ability to read a tape measure, micrometer, or other measuring devices is required</li><li>Basic math skills are required, the ability to add, subtract, multiply, and divide</li><li>Knowledgeable with computers</li><li>Capability to work steadily and independently to complete the assigned tasks<br/><br/><br/></li></ul>Physical Demands: Physical demands are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><ul><li>Position requires standing, sitting, stooping, and kneeling</li><li>The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds, with assistance</li><li>Specific vision requirements include close vision, distance vision, peripheral vision, and depth perception with or without corrected vision</li><li>Willingness to work in an environment with varying temperature degrees<br/><br/><br/></li></ul>We Treat Our Employees Right<br/><br/>We offer a full comprehensive benefits program that includes: medical, dental, vision, company-paid life insurance, short and long-term disability, paid vacation, 401(k), tuition reimbursement among other competitive benefits.<br/><br/>TW Metals, LLC. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will be considered for employment regardless of race, religion, gender, gender identity, sexual orientation, national origin, disability, age, or veteran status. TW Metals is also committed to complying with all fair employment practices regarding citizenship and immigration status.<br/><br/>The right opportunity is waiting for you here at TW Metals, LLC. APPLY NOW!<br/><br/>www.twmetals.com<br/><br/>#CB", "responsibilities": "Although a material handler may perform any and all warehouse duties, the majority of time is spent pulling material to fill sales orders, weighing and counting such material, writing in the necessary information on a sales order, and packaging the material; in the case of Metal Joining material and/or material to be shipped via UPS, forwarding these goods to packers who will package them.<br/><br/><ul><li>Pulls material from stock to fill sales orders.</li><li>Weighs or counts such material and writes the necessary information on sales orders.</li><li>Packs material for shipment.</li><li>Performs miscellaneous duties such as department “clean-up”.</li><li>Operates equipment such as cranes, high-lifts, and fork trucks.<br/><br/><br/></li></ul>", "qualifications": {"required": "High school diploma or general education degree (GED)\nOne to three months related experience and/or training; or equivalent combination of education and experience\nMechanical ability to function on a forklift/side loader\nThe ability to read a tape measure, micrometer, or other measuring devices is required\nBasic math skills are required, the ability to add, subtract, multiply, and divide\nKnowledgeable with computers\nCapability to work steadily and independently to complete the assigned tasks<br/><br/><br/>", "preferred": ""}, "skills": [], "postedDate": "7 months ago", "benefits": "We offer a full comprehensive benefits program that includes: medical, dental, vision, company-paid life insurance, short and long-term disability, paid vacation, 401(k), tuition reimbursement among other competitive benefits.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3825297374"}