{"jobTitle": "Director, Supply Chain", "company": {"name": "Relativity Space", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$181,000—$232,000", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Company Overview<br/><br/></strong>At Relativity Space, we have two audacious goals: to build the next great commercial launch company with Terran R and to become America's leading force in additive manufacturing innovation. Both contribute to our long-term vision of creating humanity’s industrial base on Mars, paving the way for interplanetary life to expand the possibilities of the human experience. This journey begins right here on Earth – where we design, build, and fly rockets to deliver customer payloads to orbit. Terran R, our medium-to-heavy lift reusable rocket, fulfills the growing demand for launch capacity, thanks to our iterative approach that accelerates design, testing, and development while minimizing costs. While our groundbreaking research and development in 3D printing pushes the boundaries of large-scale additive manufacturing.<br/><br/>Your journey with us is more than just a job – it’s an opportunity to shape the future of aerospace technology, additive manufacturing, and the human experience alongside a community of passionate, creative individuals. Join us on this extraordinary journey, as we work together to transform our vision into reality.<br/><br/><strong>Team<br/><br/></strong>Supply Chain at Relativity Space is responsible for designing, implementing, and optimizing the end-to-end supply chain networks required to manufacture, test, and launch the next-generation reusable launch vehicle – Terran-R. Being both an internal and external facing function, we closely partner with an extensive number of groups to develop the operational strategies, processes, and tools that are utilized to fulfill end-customer demand for our launch services.<br/><br/><strong>What You’ll Do<br/><br/></strong><ul><li>Be the head for Indirect Supply Management for the company, responsible for all planning, sourcing and procurement of non-flight purchases. </li><li>Develop and implement indirect procurement strategies to drive cost savings, operational efficiencies, improved contract terms and conditions, supplier performance and reduced supply chain risk. </li><li>Provide strategic indirect source-to-pay support – Sourcing, RFx, Negotiations, Contract Management, Vendor Payment Resolution – to cross-functional stakeholders within Capital Equipment, Infrastructure, Information Technology, Launch and Test Operations, Professional Services, and all other Indirect services and commodities. </li><li>Analyze both historical spend data and future spend forecasts to construct an indirect commodity hierarchy that will underpin procurement strategy and operations, quantify near-term spend performance opportunities, and act as input to organizational roadmap. </li><li>Develop immediate- and long-term business process architecture for indirect source-to-pay operations from contract/purchase request through payment and contract closure. </li><li>Collaborate with Enterprise Application Systems team to incorporate indirect procurement processes into Enterprise Resource Planning (ERP) platform and other digital tools. </li><li>Provide leadership and direction to a highly talented team of Category Managers and Procurement Specialists, based in Long Beach (CA)</li><li>Hire, train, and develop the team to support centralization of all source-to-pay activities for the indirect portfolio. <br/><br/></li></ul><strong>What You Need To Know<br/><br/></strong><ul><li>Bachelor’s degree in Finance, Supply Chain/Operations Management, Engineering, or similar. </li><li>7+ years of working in an indirect procurement role within a fast-paced manufacturing/operations or technology environment. </li><li>5+ years of working as a people manager. </li><li>Strong knowledge of Capital Equipment/Ground Support Equipment markets. </li><li>Incredibly strong knowledge of fundamental Strategic Sourcing principles and contracts. </li><li>Demonstrated ability to work in a fast-paced, dynamic, start-up environment. </li><li>Ability to develop a present recommendations confidently to Sr. and Executive leadership </li><li>Strong knowledge of enterprise applications (i.e., PLM, ERP, P2P, MES) and data analysis applications/tools (i.e., MS Excel, SQL, Tableau).<br/><br/></li></ul><strong>Nice To Haves But Not Required<br/><br/></strong><ul><li>Master’s degree in Engineering, Supply Chain/Operations Management, or similar.</li><li>Experience supporting high-growth manufacturing/operations organizations as an indirect procurement leader.<br/><br/></li></ul><strong>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<br/><br/></strong>At Relativity Space, we are committed to transparency and fairness in our compensation practices. Actual compensation will be determined based on experience, qualifications, and other job-related factors.<br/><br/>Compensation is only one part of our total rewards package. Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more! To see some of the benefits &amp; perks we offer, please visit here.<br/><br/><strong>Hiring Range<br/><br/></strong>$181,000—$232,000 USD", "responsibilities": "Be the head for Indirect Supply Management for the company, responsible for all planning, sourcing and procurement of non-flight purchases. Develop and implement indirect procurement strategies to drive cost savings, operational efficiencies, improved contract terms and conditions, supplier performance and reduced supply chain risk. Provide strategic indirect source-to-pay support – Sourcing, RFx, Negotiations, Contract Management, Vendor Payment Resolution – to cross-functional stakeholders within Capital Equipment, Infrastructure, Information Technology, Launch and Test Operations, Professional Services, and all other Indirect services and commodities. Analyze both historical spend data and future spend forecasts to construct an indirect commodity hierarchy that will underpin procurement strategy and operations, quantify near-term spend performance opportunities, and act as input to organizational roadmap. Develop immediate- and long-term business process architecture for indirect source-to-pay operations from contract/purchase request through payment and contract closure. Collaborate with Enterprise Application Systems team to incorporate indirect procurement processes into Enterprise Resource Planning (ERP) platform and other digital tools. Provide leadership and direction to a highly talented team of Category Managers and Procurement Specialists, based in Long Beach (CA)Hire, train, and develop the team to support centralization of all source-to-pay activities for the indirect portfolio.", "qualifications": {"required": "Bachelor’s degree in Finance, Supply Chain/Operations Management, Engineering, or similar. 7+ years of working in an indirect procurement role within a fast-paced manufacturing/operations or technology environment. 5+ years of working as a people manager. Strong knowledge of Capital Equipment/Ground Support Equipment markets. Incredibly strong knowledge of fundamental Strategic Sourcing principles and contracts. Demonstrated ability to work in a fast-paced, dynamic, start-up environment. Ability to develop a present recommendations confidently to Sr. and Executive leadership Strong knowledge of enterprise applications (i.e., PLM, ERP, P2P, MES) and data analysis applications/tools (i.e., MS Excel, SQL, Tableau).", "preferred": "Master’s degree in Engineering, Supply Chain/Operations Management, or similar. Experience supporting high-growth manufacturing/operations organizations as an indirect procurement leader."}, "skills": ["Supply Chain Management", "Procurement", "Strategic Sourcing", "Contract Management", "Vendor Management", "Capital Equipment", "Ground Support Equipment", "ERP", "PLM", "P2P", "MES", "Data Analysis", "MS Excel", "SQL", "Tableau"], "postedDate": "2 weeks ago", "benefits": "Relativity Space offers competitive salary and equity, a generous PTO and sick leave policy, parental leave, an annual learning and development stipend, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3825291802"}