{"jobTitle": "Administrative Assistant 3 yr Exp - Administrative", "company": {"name": "Compu-Vision Consulting Inc.", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "jobFunction": "Administrative", "industry": "Hospitals and Health Care, Staffing and Recruiting, and Wellness and Fitness Services", "description": "<strong>Position: Administrative Assistant 3 yr Exp - Administrative<br/><br/></strong><strong>Location:10833 Le Conte Avenue, Los Angeles, CA 90095<br/><br/>Duration: 3 Months<br/><br/>Additional Details<br/><br/></strong><strong>REQUIRED: 3 yrs of office administrative experience in laboratory or healthcare/academic setting | SHIFT: 40 D M-F 0800-1630| UNIFORM: Business Casual<br/><br/></strong><strong>Summary Statement<br/><br/></strong><ul><li>The Administrative Assistant III is responsible for executing their duties by performing high-level administrative service support to Pathologists, Residents, and Fellows in the Department of Pathology and Laboratory Medicine as assigned.</li><li>The Administrative Assistant III executes a wide range of high-level administrative duties including providing backup coverage for members of the team, acting as the primary coordinator of complex anatomic and service/call schedules, managing and delegating service conferences, coordinating patient service requests in support of assigned faculty and coordinating complex case inquiries with Client Services. Duties also include administrative training, and faculty committee searches. </li><li>The Administrative Assistant III independently performs administrative support duties such as word processing, collection of patient demographic and billing information in relation to consult cases, coordinating complex case inquiries with Client Services, triaging phone inquiries, meeting logistics, ensuring proper reimbursement of travel &amp; expenses, assisting in the preparation of grant documents and educational materials, maintaining files, prepare correspondence and spreadsheets, and performs other clerical duties as needed. Incumbent will perform library searches, publication searches, prepare manuscripts and research documentation, update CVs, and prepare quality assurance/performance improvement reports as related to service activity. Demonstrated ability to work independently with minimal supervision, maintain confidentiality in all assignments, show </li><li>initiative in identifying and solving problems as they occur, and possesses appropriate interpersonal skills in interacting with physicians, staff and management, patients, and clients of the department. <br/><br/></li></ul><strong>TYPE OF SUPERVISION RECEIVED<br/><br/></strong><ul><li>The Administrative Assistant III reports to the Supervisor, Pathology Administrative Services. The Administrative Assistant III communicates often with the Supervisor, Pathology Administrative Services, keeping them aware of any concerns or challenges impacting the team. The Administrative Assistant III is expected to operate with minimal supervision in the execution of routine and new assigned duties, tasks, and special projects.<br/><br/></li></ul><strong>TIME DUTIES AND TASKS<br/><br/></strong><ul><li>Provide high level administrative and special project support for Pathologists, Residents, and Fellows within the Department of Pathology &amp; Laboratory Medicine</li><li>Initiate, coordinate, follow up and assure completion of assigned departmental and nondepartmental activities. Analyze current processes and provide recommendation to streamline process and increased efficiency. </li><li>understanding of all areas of coverage.2. Provide back-up coverage for absences/vacancies for other services, maintaining a thorough </li><li>Provide administrative and technical training to others on the team as assigned by the Supervisor appointments and recording service rotations and travel.4. Utilize Microsoft Outlook to maintain the calendars for Pathologists exercising judgment in setting </li><li>C reate, update, and maintain complex anatomic and service/call schedules </li><li>adhere to deadlines.6. Prioritize with a sense of urgency and be ready to assist with follow up on all tasks and projects to </li><li>Screen incoming calls and use independent judgment and problem-solving skills to satisfy requests or route calls to appropriate personnel for resolution. Record accurate and complete phone and with outside facilities.messages. Coordinating patient service requests and complex case inquiries with Client Services </li><li>Prioritize, sort, and distribute mail. </li><li>Prepare/Draft correspondence including letters, memos, manuscripts, research documentation grant applications, email correspondence, and other documented graphed materials </li><li>Create, update, and maintain spreadsheets, including data entry, forms, presentations, charts, and Update and maintain CVs, dossiers, and biosketches. </li><li>Prepare documentation for contracts and grants, and photocopy packages for submission in accordance with UC and granting agency regulation submissions and related reports. </li><li>Prepare Quality Assurance/Performance Improvement documentation and reports related to service activities. </li><li>Liaison with Pathology Facilities and other units and departments as requested. C orrespondence </li><li>Identify, collect, interpret and organize information and data from various sources for reports and materials and reports. Appropriately edit, revise and clarify reports without altering the integrity or16. Recognize, interpret, and evaluate inconsistencies, discrepancies and inaccuracies in written content of the report. </li><li>Use reference material appropriately and efficiently. </li><li>Assesses, responds, and demonstrates a commitment to meeting internal and external customer </li><li>requirements according to established procedures. </li><li>Logistic Support for meetings, conferences, committees, faculty searches, and task forces. </li><li>Arrange in-person or virtual events, meetings, service conferences, committees, faculty searches, and task forces including reserving rooms, ordering catering, notifying attendees, creating agendas or itineraries, and sending out informational materials. </li><li>Confirm meeting(s) utilizing manual and electronic scheduling systems. </li><li>Collect appropriate preparatory information and data as required. </li><li>Order and/or operate audio visual equipment when needed. members in a timely manner. </li><li>Record and transcribe accurate and articulate minutes of meetings and distribute to meeting </li><li>Follow up on action items and/or provide updates and status reports as necessary. <br/><br/></li></ul><strong>Record Management<br/><br/></strong><ul><li>Maintain electronic and hard copy files. Establish new files, update existing files and purge old files according to the department policy &amp; procedures.</li><li>Retrieve information from computer system and/or hard copy files as needed. </li><li>Maintain confidentiality of all correspondence and records <br/><br/></li></ul><strong>Miscellaneous Office Support<br/><br/></strong><ul><li>Arrange travel and accommodations for assigned faculty, or guests of faculty or department, utilizing approved Travel agency. Submit departmental training and travel records.</li><li>Submit requests for expense reimbursement. </li><li>Perform library and publication searches through PubMed, Orchid, and other applications. </li><li>Provide back-up for incoming inquiries for client services, respond to service problems, requests for information, or requests for pathology reports. </li><li>Maintain current knowledge in job function and duties by attending and participating in meetings, in-service, and continuing education activities and reading pertinent literature. </li><li>Makes effective suggestions for improvement and/or resolves work-related problems to the appropriate chain of command. </li><li>Maintain inventory of and order office and laboratory supplies as needed. </li><li>Assist with administrative training as requested. </li><li>Perform other duties and tasks as requested by supervisor. <br/><br/></li></ul><strong>Skills, Knowledge And Abilities Task<br/><br/></strong><ul><li>1-3 years of office administrative experience</li><li>Ability to manage short-term and long-term projects and committees. </li><li>Working knowledge of applicable University of California, School of Medicine, and Department of Pathology &amp; Laboratory Medicine policies and procedures </li><li>Ability to interpret documents, including University policies and procedures andDepartmental manuals, memos, policies, and procedures. </li><li>Ability to prepare forms, correspondence, and memos with accuracy and speed to meet deadlines, including knowledge of different font styles and sizes and graphics to produce various effects </li><li>Demonstrated working knowledge and skill in using various computer programs such as Word, Excel, PowerPoint, Outlook email, Outlook calendar, Teams programs, Zoom, and basic database and scheduling software. </li><li>Skill in making travel arrangements including knowledge of travel modes, reservations techniques, air and ground transportation and time zone changes </li><li>Ability to prioritize assignments from multiple faculty members to complete work in a timely manner under the pressure of deadlines, changes in assignments and competing requirements. </li><li>Skill in working as a team in order to assist as a backup when needed. </li><li>Skill in performing duties with frequent interruptions and/or distractions. </li><li>Ability to maintain confidentiality of patient records and discussion in the strictest conformity to HIPAA. </li><li>Ability to establish and maintain cooperative working relationships with coworkers, faculty students, University representatives, patients and the public. </li><li>Demonstrated the values of the organization: respect, honesty, integrity, compassion, fairness, innovation and stewardship of our resources. </li><li>Ability to speak clearly and distinctly using appropriate vocabulary and grammar to obtain and convey information. </li><li>Ability to arrange appointments, schedules and several calendars without conflicts. </li><li>Ability to compose routine and complex drafts from verbal instructions and/or discussion of business and medical correspondence and memos. </li><li>Ability to proofread documents for completeness and content. </li><li>Ability to occasionally vary work hours or work weekends to meet Department or Program requirements. </li><li>Maintains satisfactory attendance and punctuality records according to Pathology and Laboratory Work Rules. </li><li>Ability to work safely in an environment with variations in temperature, instrument noise, usage of toxic or hazardous chemicals, fumes, odors, and biological agents, and interaction with ill patients. </li><li>Ability to transport up to 25 lbs.</li></ul>", "postedDate": "6 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3826721988"}