{"jobTitle": "Buyer", "company": {"name": "ACCO Engineered Systems", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "70,000 - 84,000", "currency": "USD"}, "jobFunction": "Purchasing and Supply Chain", "industry": "Construction", "description": "<strong>Job Description<br/><br/></strong><strong>General Job Description:<br/><br/></strong>The Buyer position provides a turnkey procurement solution to the Project Manager (PM) for all Procurement related activities. This position is responsible for the procurement needs of the assigned groups of Project Managers. Buyers are a part of the Purchasing Department and will report to their respective Purchasing Managers, but the daily direction will come from the Project Managers included in their group. The incumbent in this role is expected to have routine interaction with their PMs, as well as all suppliers to ensure that ACCO is well represented in the supplier marketplace. This is accomplished by being able to represent a comprehensive picture of ACCOs requirements to the suppliers, as well as by being able to communicate suppliers' capabilities and needs back into ACCO.<br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li>Using Bidtracer, and working with the Bid Desk Coordinator, acquire supplier bids in support of projects being bid.</li><li>Working with the Project Manager, negotiate and procure equipment, goods, and services in support of projects.</li><li>Issue subcontract agreements. Ensure that agreements are in place prior to work beginning on the project site.</li><li>Working with the Subcontract Administrators and the</li><li>Requesting, and compiling, equipment, and subcontract submittals.</li><li>Work with PMs and Suppliers to maintain an \"expediting log\" to track equipment lead times to ensure equipment is released in time for project requirements.</li><li>Follow up throughout equipment production to ensure that equipment is delivered as promised by the Supplier.</li><li>Working with the Project Manager, negotiate and settle Back charges as applicable to ensure fair costs are charged to the supplier as well as proper reimbursement to ACCO.</li><li>Maintaining knowledge of market conditions as they pertain to pricing, service, and known product issues.</li><li>Working with other Buyers, updating, and maintaining unit cost pricing database.</li><li>Identify areas of potential cost reduction and analyze the impact of pricing changes for goods and services.</li><li>Track costs in unit measurement. Evaluate market trends.</li><li>Develop/maintain vendor relationships.</li><li>Other duties and responsibilities as assigned by the supervisor.<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong><ul><li>Proficient-plus level user of MS Excel and MS Word</li><li>Strong verbal communication and listening skills, both over the phone and in person</li><li>Able to work effectively and professionally in a team environment</li><li>Strong business writing skills, including the use of proper grammar and terminology</li><li>While previous purchasing position experience is preferred, it is not required</li><li>Knowledge of the industry is preferred but not required</li><li>Able to demonstrate high customer service skills</li><li>Able to organize large amounts of information</li><li>Must be goal oriented and meet deadlines<br/><br/></li></ul><strong>Acco Competencies<br/><br/></strong><ul><li>Proactivity / Initiative: Recognizes what needs to be done and accomplishes it in a manner appropriate for one’s level/position and with minimal supervision.</li><li>Perseverance: Shows the wherewithal to fight for difficult goals despite challenges and to bounce back from adversity.</li><li>Insight: The ability to gather and make sense of information that suggests new possibilities.</li><li>Engagement: Shows a knack for using emotion and logic to communicate a persuasive vision and connect with people.</li><li>Teamwork: The ability to effectively work toward common goals with others by supporting, encouraging, and sharing information in an authentic and approachable manner.</li><li>Big Picture: Understands and contributes to organizations’ short- and long-term business strategy. On a personal level has independently developed a vision for short- and long-term career success.</li><li>Motivation / Dedication: Commits to excellence in pursuing unselfish goals. Initiating action with collective goals takes responsibility and shows personal humility.</li><li>Technical Curiosity / Willingness to Learn: Interest in seeking out new experiences, knowledge, and candid feed, back; demonstrating openness to learning and change.</li><li>Problem-Solver: Ability to identify, analyze, and solve a problem in support of personal, group, department, or organizational objectives.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong>(The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.)<br/><br/><ul><li>The employee may regularly lift and /or move up to 10 pounds, and occasionally lift and/or move up to 30 pounds.</li><li>Specific vision abilities required by this job include Close vision and Distance vision.</li><li>While performing the duties of this Job, the employee is regularly required to stand; use hands to finger, handle, or feel; reach with hands and arms and talk or hear.</li><li>The employee is occasionally required to walk and sit; climb or balance and stoop, kneel, crouch, or crawl (for purposes of assisting with project job walks and site inspections).</li><li>The employee is occasionally required to reach above shoulder height to access storage cabinets and shelves.<br/><br/></li></ul><strong>Hours<br/><br/></strong>This is an exempt position. Workdays are scheduled from Monday through Friday. Typically, work hours begin and end between 7:00 am and 5:00 pm as scheduled with the position's supervisor. Occasional overtime may be necessary per business needs.<br/><br/><strong>Competitive Wages<br/><br/></strong>$70,000 - $84,000 Annual Salary. Applicants please note that actual compensation is determined by several factors that are unique to each candidate, including but not limited to job-related skills, depth of experience, certifications, relevant education or training, and specific work location, among others. The offered wage or salary is only one aspect of an employee's total compensation.<br/><br/>#ACCO<br/><br/><strong>About Us<br/><br/></strong>Why join ACCO? ACCO Engineered Systems is one of the largest mechanical contractors in the country. Since 1934, owners and builders have selected ACCO to design, install, and maintain more than 250,000 mechanical projects. ACCO is dedicated to the design, fabrication, installation, maintenance and service of commercial and industrial HVAC, refrigeration, plumbing, process piping, and building automation systems. Whether your project is a low or high-rise office building, a shopping mall, hospital, semi-conductor fabrication facility or pharmaceutical manufacturing plant…ACCO can design, build, install, and maintain a mechanical system to meet your needs.<br/><br/>Here at ACCO, we are a part of something bigger. Just ask our customers: California Academy of Sciences, L.A. Live, and San Francisco 49ers Stadium. While we have been around for 80+ years, we continue to grow at a dynamic pace. And we are looking for talented individuals to join our team.<br/><br/>What's great about working at ACCO is that we’re a big enough company to be the leader in HVAC mechanical contracting in California and the Southwest U.S., but as a 100% employee-owned ESOP, we’re a private company with a family-oriented feel. Several of our employees have worked at ACCO for twenty-five, thirty, and even over forty years! Together, the employees of ACCO are comprised of intelligent, dedicated, and entrepreneurial team members who put customers first and enjoy what they do.<br/><br/><strong>ACCO IS AN EQUAL OPPORTUNITY EMPLOYER AA M/F/V/D. <br/><br/></strong>We proudly hire U.S. Military Veterans, and those qualified are encouraged to apply.<br/><br/>Equal Employment Opportunity is The Law.|Pay Transparency Nondiscrimination Provision<br/><br/><em>ACCO will consider qualified applicants with criminal histories for employment.<br/><br/></em>", "responsibilities": "The Buyer position provides a turnkey procurement solution to the Project Manager (PM) for all Procurement related activities. This position is responsible for the procurement needs of the assigned groups of Project Managers. Buyers are a part of the Purchasing Department and will report to their respective Purchasing Managers, but the daily direction will come from the Project Managers included in their group. The incumbent in this role is expected to have routine interaction with their PMs, as well as all suppliers to ensure that ACCO is well represented in the supplier marketplace. This is accomplished by being able to represent a comprehensive picture of ACCOs requirements to the suppliers, as well as by being able to communicate suppliers' capabilities and needs back into ACCO.<br/><br/><strong>Essential Duties &amp; Responsibilities<br/><br/></strong><ul><li>Using Bidtracer, and working with the Bid Desk Coordinator, acquire supplier bids in support of projects being bid.</li><li>Working with the Project Manager, negotiate and procure equipment, goods, and services in support of projects.</li><li>Issue subcontract agreements. Ensure that agreements are in place prior to work beginning on the project site.</li><li>Working with the Subcontract Administrators and the</li><li>Requesting, and compiling, equipment, and subcontract submittals.</li><li>Work with PMs and Suppliers to maintain an \"expediting log\" to track equipment lead times to ensure equipment is released in time for project requirements.</li><li>Follow up throughout equipment production to ensure that equipment is delivered as promised by the Supplier.</li><li>Working with the Project Manager, negotiate and settle Back charges as applicable to ensure fair costs are charged to the supplier as well as proper reimbursement to ACCO.</li><li>Maintaining knowledge of market conditions as they pertain to pricing, service, and known product issues.</li><li>Working with other Buyers, updating, and maintaining unit cost pricing database.</li><li>Identify areas of potential cost reduction and analyze the impact of pricing changes for goods and services.</li><li>Track costs in unit measurement. Evaluate market trends.</li><li>Develop/maintain vendor relationships.</li><li>Other duties and responsibilities as assigned by the supervisor.<br/><br/></li></ul>", "qualifications": {"required": "Proficient-plus level user of MS Excel and MS Word, Strong verbal communication and listening skills, both over the phone and in person, Able to work effectively and professionally in a team environment, Strong business writing skills, including the use of proper grammar and terminology, While previous purchasing position experience is preferred, it is not required, Knowledge of the industry is preferred but not required, Able to demonstrate high customer service skills, Able to organize large amounts of information, Must be goal oriented and meet deadlines", "preferred": "While previous purchasing position experience is preferred, it is not required, Knowledge of the industry is preferred but not required"}, "skills": ["MS Excel", "MS Word", "Communication", "Teamwork", "Customer Service"], "postedDate": "5 days ago", "benefits": "Competitive Wages<br/><br/>$70,000 - $84,000 Annual Salary. Applicants please note that actual compensation is determined by several factors that are unique to each candidate, including but not limited to job-related skills, depth of experience, certifications, relevant education or training, and specific work location, among others. The offered wage or salary is only one aspect of an employee's total compensation.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3826321232"}