{"jobTitle": "Paralegal (Remote)", "company": {"name": "Superior Executive And Legal Recruiting", "industry": "Staffing and Recruiting", "size": "Not Specified", "location": "Los Angeles, CA"}, "location": "Remote", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "Not Specified", "currency": "USD"}, "jobFunction": "Legal", "industry": "Staffing and Recruiting", "description": "Law firm located in Los Angeles, CA seeks an experienced and professional full-time Paralegal (Remote) with a minimum of one year experience. Candidate will support a Team of attorneys in U.S. wage and hour litigation. The candidate must be proficient in Microsoft Office (i.e. Microsoft Outlook, Excel, and Word). The ideal candidate can communicate effectively and professionally with a Team of Attorneys and clients, is highly organized and detail-oriented, a team player, excels in deadline driven environments, and takes initiative to anticipate attorney needs.", "responsibilities": "Efficiently handle and organize legal documents in a remote work environment. Utilize court websites, court vendor websites and others as needed to gather requested case information. Handle calendaring, scheduling, and deadlines as needed. Keep attorneys organized and on track. Track deadlines, maintain follow-up and be aware of current status on all Team cases. File documents accurately and promptly to meet court rules and deadlines if necessary. Provide administrative support to your Attorney Team. Understand and adhere to legal ethics and confidentiality requirements.", "qualifications": {"required": "Experience working within the U.S. legal system. Proficiency in English with excellent written and verbal communication skills. Experience as a Paralegal professional providing administrative support to a team of Attorneys. Knowledge of MS Office. Outstanding time-management and typing skills. Ability to multitask and being comfortable dealing with a team of Attorneys. Relevant certifications or diploma. Willing to work hours: 830AM-530PM PST. Working knowledge of litigation management software systems is a plus.", "preferred": "Own Laptop or Desktop (8GB RAM, Core i5 or above) with an internet connection of at least 20 Mbps. 1 main computer with at least core i5 processor. A backup computer with at least core i3 processor. Internet service provider with at least 20 mbps speed with no capping / data limit. At least 10 mbps backup internet service."}, "skills": ["Microsoft Office", "Legal Research", "Time Management", "Communication", "Organizational Skills"], "postedDate": "6 months ago", "applicationDeadline": "Not Specified", "benefits": "Not Specified", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3826773171"}