{"jobTitle": "PART TIME MULTI FUNCTIONAL SALES ASSISTANTS", "company": {"name": "MANGO", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "jobFunction": "Sales and Business Development", "industry": "Retail Apparel and Fashion", "description": "At Mango we inspire and we unite through our passion for style and culture. We are present in 118 countries and our online presence extends to more than 80 countries. Our team is made up of people of 112 nationalities and 80% of them are women.<br/><br/>We are looking for<br/><br/>PART TIME MULTI FUNCTIONAL SALES ASSISTANTS<br/><br/><strong>WHAT WOULD YOUR DAY TO DAY BE LIKE AT MANGO?<br/><br/></strong>Guarantee the <strong>best customer experience</strong> within the store providing all the support that customer might require. To achieve this, it will be key to possess <strong>good product and fashion knowledge</strong>, appropriate <strong>attitude</strong> and <strong>will to make customers feel at home</strong>.<br/><br/>It will be necessary to be familiar with the <strong>sales indicators</strong> and focus on improving them. To accomplish this, our Multifunctional Sale Assistant will have to be focus on all the tools available to foster the <strong>omnichannel</strong> experience.<br/><br/>Assure that the <strong>standards of the shopfloor</strong> are spotless: product well replenished and store clean, tidy and merchandised in an attractive way in order to <strong>maximize sales</strong> and offer the experience that our customers deserve. In terms of <strong>security standards</strong> either in fitting room, stockroom, shopfloor or cashdesk, they must be always followed.<br/><br/>Different <strong>tools</strong> will be provided to cover the tasks mentioned above and it is crucial that these tools are used efficiently and in a respectful and appropriate way.<br/><br/>While working in <strong>cashdesk</strong>, our Multifunctional Sales Assistants are expected to process all the till transactions on a smooth, efficient and accurate way to assure that the final part of the experience in the store is enjoyable and satisfactory for the customer and assure that all the policies and procedures are followed strictly.<br/><br/>When working on the <strong>stockrooms</strong>, our Multifunctional Sale Assistant is expected to get involved in all the duties related with the operative of the back areas: delivery, replenishment, transfers in &amp; out, operate product, maintenance of the standards of the stockroom, inventories and keeping the area clean, tidy and organized.<br/><br/>Our multifunctional Sales Assistants are expected to share their knowledge with new starters them providing basic <strong>training</strong> and collaborating on their onboardings. At all times, they will be expected to behave according to the <strong>values</strong> of Mango.<br/><br/>The wellbeing of all our staff is key, and because of that, it is expected to carry all the above following at all the times our <strong>H&amp;S</strong> standards.<br/><br/><strong>WHAT MAKES US SPECIAL?<br/><br/></strong><ul><li>You will be part of a leading company in the fashion industry, dynamic and in full innovation</li><li>Close, inspiring and ambitious work environment</li><li>Uniform per season</li><li>Constant development opportunities with varied challenges that generate on-the-job learning</li><li>Insurance Benefit: You only pay 40% of the value!</li><li>401(K) Pension Plan</li><li>Holidays + Floating Holidays</li><li>Vacation Days</li><li>KPI Metric Bonus Incentive<br/><br/></li></ul><strong>You got it?<br/><br/></strong><strong>We like you!</strong>", "postedDate": "6 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3827940042"}