{"jobTitle": "Business Development Representative - Los Angeles, CA", "company": {"name": "Lima One Capital", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "$100,000.00/yr - $200,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Real Estate", "description": "Job Type<br/><br/>Full-time<br/><br/><strong>Description<br/><br/></strong><strong>Job Summary:<br/><br/></strong>In this key Outside Sales position, you will be responsible for selling the Lima One product suite by growing business partner relationships, tapping into your network, and ultimately sourcing and developing relationships with successful real estate investors. You clearly educate the market on the Lima One product set and company advantages, negotiating and closing loans. You will have access to selling the entire Lima One product suite of Fix and Flip loans, New Construction Loans, Rental Property Loans, and Multi-Family loans. These products are in high demand and you will have a best in class team to support you in everything you do.<br/><br/>You will have incredible impact in our growth which means tremendous opportunities for you. You will achieve both the sales goals and service levels of the organization by developing and maintaining strong partnerships and always striving to exceed expectations.<br/><br/><strong>Duties And Responsibilities<br/><br/></strong><ul><li>Personally, source and fund $3+ million in closed loans per month (after initial training and ramp period)</li><li>Carry yourself with the highest level of professionalism in the industry</li><li>Fully understand the real estate investment property industry and be able to effectively communicate how the Lima One product set can help our clients grow and prosper</li><li>Educate business partners, referral sources, brokers, and investors on the Lima One value proposition, and become a trusted advisor in your markets for all things real estate investment property finance</li><li>Speak at industry events, host meetups, seminars, and industry networking functions to build your book of business and promote the Lima One brand</li><li>Act with urgency and attack each day with great motivation to succeed and be the best in the industry</li><li>Provide unmatched customer service</li><li>Functioning as the Responsible Individual for Nevada state licensing <br/><br/></li></ul><strong>Requirements<br/><br/></strong><strong>Qualifications:<br/><br/></strong><ul><li>Bachelor’s degree </li><li>Must possess current NMLS license or must obtain within 30 days of hire, and 2 years of loan origination experience</li><li>2+ years experience in the Private Lending industry (FNF, Bridge, New Construction and/or Perm Debt) in single family and multifamily asset classes.</li><li>Excellent communication and presentation skills</li><li>Proven ability to creatively source and develop new business</li><li>Energetic and passionate about providing the best customer experience in the industry<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Competitive salary</li><li>Uncapped Commissions</li><li>First year income $100k-$200k with top performers earning more than $200k</li><li>Amazing Culture</li><li>Medical, Dental and Vision benefits</li><li>Life, Short-Term Disability, Long-Term Disability</li><li>Additional benefits such as Pet, Hospitalization and Accidental Insurance</li><li>401K with company match</li><li>Excellent training</li><li>PTO, sick days and holidays</li><li>Parental Leave</li><li>Growth opportunities<br/><br/></li></ul><strong>About Lima One Capital<br/><br/></strong>Lima One Capital is the nation’s premier lender for real estate investors. Recognized by the Inc.5000 as one of America’s fastest growing companies, Lima One specializes in providing real estate investors with financing for their rental, fix-and-flip, multifamily properties, and new construction. The company, founded by Marines, is distinguished as one of South Carolina’s Best Places to Work and Top Workplaces. Lima One is headquartered in downtown Greenville, South Carolina, and is a wholly owned subsidiary of MFA Financial, Inc (NYSE) and markets its lending products over a national footprint of 46 states and the District of Columbia. Learn more about us at limaone.com.<br/><br/><em><strong>Notice to Third Party Recruiters and Agencies<br/><br/></strong></em>Lima One Capital does not accept unsolicited resumes or candidate submissions from recruiters or employment agencies. In the absence of a fully executed agreement for a specified position, Lima One Capital has no obligation to pay any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without an agreement, Lima One Capital explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, referrals, or candidate submissions, including those communicated to a member of the Human Resources team or a hiring manager, shall be deemed the property of Lima One Capital. If you or your agency would like to be considered as a future recruiting partner, please email employment@limaone.com (Subject: Agency Partner Request).", "postedDate": "2 weeks ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3827773621"}