{"jobTitle": "Digital Content Coordinator", "company": {"name": "Petersen Automotive Museum", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing, Public Relations, and Writing/Editing", "industry": "Museums, Historical Sites, and Zoos", "description": "The Digital Content Coordinator will work with our marketing team to drive the growth and standardization of digital platforms and channels for the museum. They will be responsible for supporting brand building and awareness, digital acquisition, audience and customer engagement. The role requires proven skills along with experience working in a fast-paced environment. The ideal candidate must be able to demonstrate strong project management skills and creative ideation capabilities to yield the highest impact and performance.<br/><br/><strong>Duties/Responsibilities<br/><br/></strong><ul><li>Content ideation, development, production and / or coordination, including editorial, social media posts, videos, podcast scheduling and executing content calendar</li><li>Ensures timely, accurate and consistent distribution across platforms</li><li>Working closely with the Marketing department to build and execute campaigns, assess key challenges, and develop solutions to optimize future campaigns</li><li>Optimize content for maximum engagement and ensure posts across all platforms support our brand and satisfy partnership deliverables when applicable</li><li>Social media management and engagement to drive content creation, engagement and growth both internally and through influencers collaborations</li><li>Identify social media opportunities, harnessing metrics and other data-driven insights to evaluate the digital and social channels performance regularly</li><li>Grow and manage influencers network</li><li>Own and manage social media channels including Facebook, Instagram, Youtube, Tiktok, Twitter and Threads</li><li>Develop/execute audience growth strategies in tandem with new exhibitions and programs</li><li>Establish and implement procedures and workflows for the content life cycle</li><li>Manage contributor's relationships and scheduling from content ideation to delivery</li><li>Report and analyze the performance of content and promotions at recurring and ad hoc intervals</li><li>Provide support at museum’s own events and coordinate (or execute) event coverage (entails occasional evening and weekend work)<br/><br/></li></ul><strong>Required Skills/Abilities<br/><br/></strong><ul><li>Knowledge of cars and passion for automotive culture</li><li>A keen eye for automotive content aesthetics</li><li>Driven to deliver results and enjoys working in an agile, fast-paced environment</li><li>Experience with supporting digital marketing channels - email, paid social, affiliates, display</li><li>Ability to efficiently and effectively prioritize tasks, manage workload, and meet deadlines</li><li>Minimum 3 years in digital commerce and marketing, ideally within the automotive industry or strong social media/content portfolio.</li><li>Familiarity with driving traffic to digital commerce channels and conversions</li><li>Ability to report insights and project progress/risks in a clear and concise format</li><li>Advanced experience using Google Suite to manage, evaluate, and report data</li><li>Experience with design tools and graphics integration for social posting<br/><br/></li></ul><strong>Education And Experience<br/><br/></strong>Minimum Education (or substitute experience) required:<br/><br/><ul><li>Associates degree in Marketing or related field preferred<br/><br/></li></ul><strong>Minimum Experience Required<br/><br/></strong><ul><li>3 years in digital commerce and marketing, ideally in the automotive industry</li></ul>", "postedDate": "6 months ago", "skills": ["Digital Marketing", "Social Media", "Content Creation", "Content Strategy", "Project Management", "Automotive", "Google Suite", "Design Tools", "Marketing", "Influencer Marketing"], "url": "https://www.linkedin.com/jobs/view/3828205113"}