{"jobTitle": "Business Development Manager (B2B) West Coast", "company": {"name": "Exoticca", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales, Business Development, and Customer Service", "industry": "Non-profit Organizations and Primary and Secondary Education", "description": "What is Exoticca?\n\nExoticca is a pioneering online travel agency that has revolutionized the conception, production, and e-commerce of long-distance dream trips. At the core of Exoticca's brand equity is the commitment to \"creating life milestones.\" We believe in delivering best-value trips, exploring unique destinations, curating extraordinary travel experiences, and demonstrating genuine care for both our customers and the planet.\n\nWe are a professional, dynamic, multicultural team in rapid international growth, seeking new partners to help us create the best and most forward-thinking travel company of our generation.\n\nWhat do we do?\n\nThe Growth Team is the main responsible for defining and developing the growth strategy of the company. Identify and develop international geographical expansion opportunities and new growth channels. Explore \"grey label\" opportunities, resellers partnerships, joint ventures, and other growth strategies by market.\n\nWhat will you do?\n\nThe Business Development Manager (BDM) is a field sales role responsible for selling guided travel and identifying potential growth areas, opening new accounts, and developing long-term relationships with travel professionals in their specified region. Traveling throughout their territory, the BDM promotes the benefits of Exoticca, actively supports partner marketing efforts, and presents to potential travelers daily. Responsible for soliciting new accounts and maintaining relationships with existing accounts to meet and exceed revenue goals in support of the organization's strategic priorities.\n\n<ul><li>Execute successful field sales strategies to drive business growth targets</li><li>Attend all relevant clients' events, tend to the booth and/or present when required</li><li>Effectively account manage and retain existing clients with a focus on increasing revenue year over year</li><li>Work closely with internal teams to ensure strong communication and alignment in consistent delivery of quality products and service to clients</li><li>Drive the collection of data using Salesforce CRM and use of the data as an effective selling tool</li><li>Ensure all contact and interactions are of the highest standards, communicating clearly and appropriately</li><li>Prepare weekly sales and monthly expense reports</li><li>Seek group business from Travel Advisors</li><li>Meet minimum standards of performance for KPIs</li><li>Perform any other duties as may be required. This job description is not intended to be an all-inclusive list of duties and responsibilities<br/><br/><br/></li></ul>Requirements\n\n<ul><li>Minimum of 3 years of travel industry sales experience in a similar role</li><li>Existing client base of Travel Advisors in your area</li><li>Regular travel to brick &amp; mortar Travel Agencies, North American sales conferences, events, FAM trips, and Barcelona HQ</li><li>Typical months include 10 days of field sales with remaining home-based days focused on virtual sales appointments and administrative work</li><li>Some weekend travel to attend trade shows may also be required</li><li>Entrepreneurial. Comfortable in a dynamic, fast-changing, complex and pioneering environment</li><li>Willingness to benefit from hands-on coaching. </li><li>Bold enough to take calculated risks but humble enough to admit mistakes and learn from them<br/><br/><br/></li></ul>Benefits\n\n<ul><li>Competitive compensation package in line with job responsibilities and experience</li><li>Travel packages at reduced prices!</li><li>English/Spanish lesson, bi-annual company parties. </li><li>Referral bonus, if you bring people as talented as you</li><li>And last but not least, becoming part of a fun and motivated multicultural team at an agile and rapid growing organization!<br/><br/></li></ul>Join Exoticca and play a pivotal role in creating life milestones through unforgettable travel experiences! This is your opportunity to shape the future of a dynamic and innovative travel brand on a global scale.\n\n<em>Exoticca es una empresa que ofrece igualdad de oportunidades. La diversidad y la inclusión son nuestro núcleo. No discriminamos por motivos de raza, color, religión, estado civil, edad, origen nacional, ascendencia, discapacidad física o mental, condición médica, embarazo, información genética, género, orientación sexual, identidad o expresión de género, condición de veterano, o cualquier otro estado protegido por la legislación europea, nacional o local.<br/><br/>En cumplimiento con el LISMI, esta posición queda reservada para personas con discapacidad mayor del 33%.<br/><br/></em>", "responsibilities": "Execute successful field sales strategies to drive business growth targets\nAttend all relevant clients' events, tend to the booth and/or present when required\nEffectively account manage and retain existing clients with a focus on increasing revenue year over year\nWork closely with internal teams to ensure strong communication and alignment in consistent delivery of quality products and service to clients\nDrive the collection of data using Salesforce CRM and use of the data as an effective selling tool\nEnsure all contact and interactions are of the highest standards, communicating clearly and appropriately\nPrepare weekly sales and monthly expense reports\nSeek group business from Travel Advisors\nMeet minimum standards of performance for KPIs\nPerform any other duties as may be required. This job description is not intended to be an all-inclusive list of duties and responsibilities", "qualifications": {"required": "Minimum of 3 years of travel industry sales experience in a similar role\nExisting client base of Travel Advisors in your area\nRegular travel to brick & mortar Travel Agencies, North American sales conferences, events, FAM trips, and Barcelona HQ\nTypical months include 10 days of field sales with remaining home-based days focused on virtual sales appointments and administrative work\nSome weekend travel to attend trade shows may also be required\nEntrepreneurial. Comfortable in a dynamic, fast-changing, complex and pioneering environment\nWillingness to benefit from hands-on coaching.\nBold enough to take calculated risks but humble enough to admit mistakes and learn from them", "preferred": ""}, "skills": [], "postedDate": "7 months ago", "benefits": "Competitive compensation package in line with job responsibilities and experience\nTravel packages at reduced prices!\nEnglish/Spanish lesson, bi-annual company parties.\nReferral bonus, if you bring people as talented as you\nAnd last but not least, becoming part of a fun and motivated multicultural team at an agile and rapid growing organization!", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3828083754"}