{"jobTitle": "Senior Designer (Interior Design/Architecture)", "company": {"name": "Rapt Studio", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$90,000.00/yr - $140,000.00/yr", "currency": "USD"}, "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Design", "description": "About Us Rapt is an award-winning design and strategy studio that helps leading brands navigate the complex challenges of this ever-changing world. With locations in San Francisco, Los Angeles, and New York — and with clients spanning the globe — we bring fresh thinking and a highly customized approach to each and every partnership. Our interdisciplinary teams blend architecture, interior design, brand experience, graphic design, and strategic thinking into holistic solutions that further our clients’ missions. Our agile approach earned us the distinction of being named one of Fast Company’s Most Innovative Companies. We’re embracing the future of work with a hybrid approach. We spend 3 days in the studio each week as a team, and we also have days where we work from home. Ultimately, we trust our staff to know how and where they will do their best work. About the Role At Rapt, Senior Designers maintain a keen eye for detail while managing multiple projects, from conception to realization. They lead our designers and work closely with Studio Leads and Design Directors to ensure each project’s success. We’re currently looking for someone who’s got the confidence and creativity required to be on the frontlines of our work. Qualifications:<br/><br/><ul><li>Bachelor’s or Master’s degree in Architecture or Interior Design</li><li>8+ years of experience working at an architecture or design studio</li><li>Expertise with Revit, AutoCAD, SketchUp, Microsoft Office, and Adobe Creative Suite</li><li>Expertise working with project teams from concept design through construction</li><li>Expertise with project management, construction administration, budget review, building codes, consultant coordination, and client relations</li><li>Proficiency with jurisdictional agencies and multi-disciplinary consultants</li><li>Proficiency with commercial projects, including ground-up construction, core and shell repositioning, and creative workplace</li><li>State licensure or pursuance of state licensure is encouraged<br/><br/><br/></li></ul>We’re looking for:<br/><br/><ul><li>A team player with a positive attitude who’s enthusiastic about tackling the unexpected and unknown</li><li>A creative person with strong graphic, organizational, and communication skills</li><li>A conceptual thinker who’s always seeking inspiration</li><li>A confident decision-maker and risk-taker</li><li>A leader who’s interested in mentoring fellow design staff</li><li>Someone who can both design conceptually and detail thoroughly, with an ability to zoom in and out along the project timeline from the macro to the micro and back again</li><li>A leader who doesn’t allow ego to push teams or projects in ways that don’t benefit everyone, and who provides guidance not for their own benefit but for the benefit of the project and team<br/><br/><br/></li></ul>Compensation is based on relevant experience and qualifications. Salary for this role is estimated between $90,000 to $140,000 plus benefits and bonuses. Benefits and Perks: Generous options for medical, dental, vision insurance Location flexibility and unlimited paid time off (PTO) Tax-deferred savings through FSA, parking and transit allocations 401K with employer contribution Complimentary One Medical memberships New hire referral bonus", "responsibilities": "At Rapt, Senior Designers maintain a keen eye for detail while managing multiple projects, from conception to realization. They lead our designers and work closely with Studio Leads and Design Directors to ensure each project’s success. We’re currently looking for someone who’s got the confidence and creativity required to be on the frontlines of our work.", "qualifications": {"required": "Bachelor’s or Master’s degree in Architecture or Interior Design, 8+ years of experience working at an architecture or design studio, Expertise with Revit, AutoCAD, SketchUp, Microsoft Office, and Adobe Creative Suite, Expertise working with project teams from concept design through construction, Expertise with project management, construction administration, budget review, building codes, consultant coordination, and client relations, Proficiency with jurisdictional agencies and multi-disciplinary consultants, Proficiency with commercial projects, including ground-up construction, core and shell repositioning, and creative workplace, State licensure or pursuance of state licensure is encouraged", "preferred": "A team player with a positive attitude who’s enthusiastic about tackling the unexpected and unknown, A creative person with strong graphic, organizational, and communication skills, A conceptual thinker who’s always seeking inspiration, A confident decision-maker and risk-taker, A leader who’s interested in mentoring fellow design staff, Someone who can both design conceptually and detail thoroughly, with an ability to zoom in and out along the project timeline from the macro to the micro and back again, A leader who doesn’t allow ego to push teams or projects in ways that don’t benefit everyone, and who provides guidance not for their own benefit but for the benefit of the project and team"}, "skills": ["Revit", "AutoCAD", "SketchUp", "Microsoft Office", "Adobe Creative Suite", "Project Management", "Construction Administration", "Budget Review", "Building Codes", "Consultant Coordination", "Client Relations", "Jurisdictional Agencies", "Multi-disciplinary Consultants", "Commercial Projects", "Ground-up Construction", "Core and Shell Repositioning", "Creative Workplace", "State Licensure"], "postedDate": "6 months ago", "benefits": "Generous options for medical, dental, vision insurance Location flexibility and unlimited paid time off (PTO) Tax-deferred savings through FSA, parking and transit allocations 401K with employer contribution Complimentary One Medical memberships New hire referral bonus", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3829121200"}