{"jobTitle": "Regional Distribution Sales Manager", "company": {"name": "Ruhrpumpen", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Industrial Machinery Manufacturing", "description": "<em>Working at</em><strong><em>Ruhrpumpen</em></strong><em>means being part of a team that values innovation, dynamism, and creativity. Join our team, experience making a difference and build your career!</em>\n\nAs<strong>Regional Distribution Sales Manager</strong>at Ruhrpumpen, you will be responsible for growing distribution and OEM sales in the <strong>West Coast</strong>, to increase market share by managing the current network and adding additional channel partners where needed in order to meet sales goals.\n\n<strong>Primary Responsibilities:</strong>\n\n<ul>\n<li>Growing the indirect sales channel/distribution segment along with OEM accounts.</li>\n<li>Through joint sales calls (in person or virtual) and other contact methods, evaluate the current channel’s effectiveness to sell and market all Ruhrpumpen products.</li>\n<li>Identify, interview, and propose new distributors as required to achieve sales goals.</li>\n<li>Take appropriate steps to not only support and document growth within the company’s parameters for each distributor, but also manage, provide support/corrective measures and, if needed, professionally terminate ineffective channel partners.</li>\n<li>Proper record keeping and use of the CRM system will be vital to this role.</li>\n<li>Assist your distributors to increase competency in Ruhrpumpen products, processes, policies and procedures.</li>\n<li>assist the distributor personnel to become self-sufficient through use of electronic programs and materials provided by Ruhrpumpen for the purpose of selection, presentation, and quotation of Ruhrpumpen products.</li>\n<li>Provide feedback to the North American Distributor Sales Manager concerning distributor sales performance, expenses related to the job, competitive information, product development needs that are provided by the distribution and pricing information.</li>\n<li>Maintain adequate communication with distribution to discuss goals, potential and actual performance, promotional material, campaigns, advertising, inventories, obsolescence, service and new products.</li>\n<li>Ensure sales objectives are met relative to market conditions and competitive factors.</li>\n<li>Work with Market Managers to identify, establish and develop distribution channels to increase their penetration.</li>\n<li>Provide and organize scheduled sales training meetings and assist distributor personnel with specific sales and application issues.</li>\n<li>Complete and follow up with the Target Account Form program for each distributor salesperson</li>\n<li>Assist distributor sales personnel with customer calls as required to penetrate accounts and grow territory sales</li>\n<li>Prepare and present sales materials/reports and attend required meetings and training seminars</li>\n</ul>\n\n\n<strong>Qualifications:</strong>\n\n<ul>\n<li>Willingness and availability to travel upto 60-70% of the time within the region. These regions will cover a large geographical area and require overnight travel.</li>\n<li>Excellent understanding of how the Distribution Sales Channel works and be able to support what’s best for company growth.</li>\n<li>Ability to respond with a strong sense of urgency and care to distributor and customer requests, inquiries, and problems.</li>\n<li>The ability to maintain positive and constructive relationships both internally and externally is paramount, even under difficult circumstances.</li>\n<li>Must have at least 3 years’ experience in pumps and related products.</li>\n</ul>\n\n<em>At Ruhrpumpen, we value every employee, recognizing that each person contributes to our success through their position. We are a growing team, join us and live Rurhpumpen!</em>\n\nThis position is based out of your home office and the ideal candidate should live near a major airport in the West Coast.", "responsibilities": "Growing the indirect sales channel/distribution segment along with OEM accounts. Through joint sales calls (in person or virtual) and other contact methods, evaluate the current channel’s effectiveness to sell and market all Ruhrpumpen products. Identify, interview, and propose new distributors as required to achieve sales goals. Take appropriate steps to not only support and document growth within the company’s parameters for each distributor, but also manage, provide support/corrective measures and, if needed, professionally terminate ineffective channel partners. Proper record keeping and use of the CRM system will be vital to this role. Assist your distributors to increase competency in Ruhrpumpen products, processes, policies and procedures. assist the distributor personnel to become self-sufficient through use of electronic programs and materials provided by Ruhrpumpen for the purpose of selection, presentation, and quotation of Ruhrpumpen products. Provide feedback to the North American Distributor Sales Manager concerning distributor sales performance, expenses related to the job, competitive information, product development needs that are provided by the distribution and pricing information. Maintain adequate communication with distribution to discuss goals, potential and actual performance, promotional material, campaigns, advertising, inventories, obsolescence, service and new products. Ensure sales objectives are met relative to market conditions and competitive factors. Work with Market Managers to identify, establish and develop distribution channels to increase their penetration. Provide and organize scheduled sales training meetings and assist distributor personnel with specific sales and application issues. Complete and follow up with the Target Account Form program for each distributor salesperson Assist distributor sales personnel with customer calls as required to penetrate accounts and grow territory sales Prepare and present sales materials/reports and attend required meetings and training seminars", "qualifications": {"required": "Willingness and availability to travel upto 60-70% of the time within the region. These regions will cover a large geographical area and require overnight travel. Excellent understanding of how the Distribution Sales Channel works and be able to support what’s best for company growth. Ability to respond with a strong sense of urgency and care to distributor and customer requests, inquiries, and problems. The ability to maintain positive and constructive relationships both internally and externally is paramount, even under difficult circumstances. Must have at least 3 years’ experience in pumps and related products.", "preferred": ""}, "skills": [], "postedDate": "6 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3829122983"}