{"jobTitle": "Regional Sales Representative", "company": {"name": "Suburban Propane", "location": "Placentia, CA"}, "location": "Placentia, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "65,000.00/yr - 75,000.00/yr", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Oil and Gas", "description": "We are currently looking for a talented, dynamic and motivated outside sales professional to join our team in the LA/San Diego Market Area . Reporting to an Region Sales and Business Development Manager, in this position you will independently prospect, develop and nurture relationships with businesses and industry entities.<br/><br/>Responsibilities<br/><br/>\n<ul><li> Develop new sales leads by prospecting and pursuing targeted new business through calling or visiting potential customers, attending trade shows, initiating mailings and other related activities </li><li> Negotiate and close new sales contracts and service agreements to achieve year over year customer base growth </li><li> Develop and leverage relationships with businesses and industry entities such as real estate companies, home builder associations and other trade organizations to cultivate new business prospects </li><li> Actively participate in industry organizations to continually build a professional network </li><li> Partner with Regional Management and the National Accounts group to aggressively pursue Regional and National Accounts business opportunities </li><li> Champion a positive, professional image of Suburban Propane to create customer goodwill and foster referrals and repeat business </li><li> Follow up with new accounts to ensure customer satisfaction and fulfillment of the job <br/><br/></li></ul>Benefits<br/><br/>\nWhy join the Suburban Propane team?  Because we care about the physical, mental, and financial wellbeing of our employees and provide them with competitive pay plus incentive potential and an outstanding benefits package including:<br/><br/>\n<ul><li> Medical, dental, and vision (eligibility after just 30 days of employment) </li><li> Paid time off that increases with tenure </li><li> A 401(k) with company match and immediate vesting </li><li> A new employee training program and many opportunities for continued learning and career development </li><li> Disability and life insurance </li><li> Employee recognition program </li><li> Generous tuition assistance program </li><li> Propane discounts, and more! <br/><br/></li></ul>For eligibility and a full list of our benefit offerings please visit: https://jobs.suburbanpropane.com/benefits/ .<br/><br/>Starting Base Salary*: $65,000 - $75,000 (plus commission)<br/><br/>\n<ul><li>Subject to change over time, to allow adequate time to build a commissionable platform.<br/><br/></li></ul>Qualifications<br/><br/>\n<ul><li> Minimum of 5 years of business-to-business sales experience </li><li> Some college or equivalent in experience and education (Business related Bachelor’s Degree preferred) </li><li> Excellent verbal communication skills including the ability to negotiate and convincingly persuade others </li><li> Professional and articulate with an enthusiastic and positive attitude </li><li> Industry knowledge is preferred but not required </li><li> Basic understanding of oil and gas fired appliances and related distribution systems (training is provided) <br/><br/></li></ul> As part of our pre-employment hiring process, background checks and drug screens are performed.<br/><br/>Applications will be accepted until the position is filled. <br/><br/>\nHeadquartered in Whippany, New Jersey, Suburban Propane Partners, L.P. (NYSE:SPH) is a nationwide marketer and distributor of a diverse array of products to meet the energy needs of our customers, specializing in heating oil and refined fuels, as well as the marketing of propane, natural gas and electricity in deregulated markets. With over 3,000 employees and as the 3 rd largest propane retailer in the country, Suburban Propane maintains business operations in 42 states, providing prompt, reliable service to over one million residential, commercial, industrial and agricultural customers. We are committed to supporting the growth and innovation of propane as a sustainable energy source and investing in the next generation of even cleaner and lower carbon renewable energy sources.<br/><br/>It’s an amazing time to become a part of our team as we expand our national footprint and<br/><br/>make strides toward a sustainable, clean energy future!<br/><br/>At Suburban Propane, we know that our strength comes from our diverse and inclusive team of employees who make a difference in the communities we serve across the country every day. All applicants for employment shall be considered without regard to race, religion, color, creed, national origin, ancestry, age, gender, sex, pregnancy, sexual orientation, gender identity, gender expression, marital status, physical or mental disability, medical condition, genetic information, military or veteran status, or any other classification protected by law.<br/><br/>For more information about our hiring process, please visit: https://jobs.suburbanpropane.com/our-hiring-process/", "responsibilities": "Develop new sales leads by prospecting and pursuing targeted new business through calling or visiting potential customers, attending trade shows, initiating mailings and other related activities\nNegotiate and close new sales contracts and service agreements to achieve year over year customer base growth\nDevelop and leverage relationships with businesses and industry entities such as real estate companies, home builder associations and other trade organizations to cultivate new business prospects\nActively participate in industry organizations to continually build a professional network\nPartner with Regional Management and the National Accounts group to aggressively pursue Regional and National Accounts business opportunities\nChampion a positive, professional image of Suburban Propane to create customer goodwill and foster referrals and repeat business\nFollow up with new accounts to ensure customer satisfaction and fulfillment of the job", "qualifications": {"required": "Minimum of 5 years of business-to-business sales experience\nSome college or equivalent in experience and education (Business related Bachelor’s Degree preferred)\nExcellent verbal communication skills including the ability to negotiate and convincingly persuade others\nProfessional and articulate with an enthusiastic and positive attitude\nIndustry knowledge is preferred but not required\nBasic understanding of oil and gas fired appliances and related distribution systems (training is provided)", "preferred": "Business related Bachelor’s Degree"}, "skills": [], "postedDate": "6 months ago", "benefits": "Medical, dental, and vision (eligibility after just 30 days of employment)\nPaid time off that increases with tenure\nA 401(k) with company match and immediate vesting\nA new employee training program and many opportunities for continued learning and career development\nDisability and life insurance\nEmployee recognition program\nGenerous tuition assistance program\nPropane discounts, and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3829188243"}