{"jobTitle": "Delivery Driver Vernon/LA (Non-CDL Driver) - 21/hour", "company": {"name": "Farmer's Fridge", "industry": "Food & Beverages"}, "location": "Vernon, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "21.00", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Food & Beverages", "description": "Farmer’s Fridge makes fruits and vegetables accessible and approachable for everyone. We offer a variety of fresh, healthy, ready-to-eat meals and snacks through our fresh food vending machines, wholesale partners, and our office pantry solution — providing chef-curated meals to customers within seconds. Today, we operate a network of Fridges and partner with clients nationwide in high-foot-traffic areas, such as airports, hospitals, universities, and large office buildings — where there is limited accessibility to fresh, healthy, grab-n-go options.\n\nWe care deeply about what we’re creating and aspire to make sure our customers feel that through every touchpoint. This shows up in many ways across the business. We are committed to prioritizing food safety, we are passionate about product quality, we value our employees, we champion the best idea no matter where it comes from, and we’re committed to making an overall positive impact as we scale.\n\nYou’ll get…\n\n* Traditional benefits for full-time hourly – Health, Dental, Vision, Life, Short Term and Long Term Disability.\n* Competitive Salary & 401K company match that vests immediately upon participation\n* Equity available to full time employees after 1 year of employment\n* Generous sick leave & PTO policy\n* Paid holidays\n* $50 cell phone credit\n\nAbout the Role:\n\nThe Delivery Driver role is a crucial part of achieving our mission of making healthy food more accessible for everyone. You’ll deliver food to our wholesale retail partners and Smart Fridges. Your job is to own your route by making sure that deliveries are sent to the correct address, during the correct time window, and ensuring our customers are getting the best possible delivery experience. You will be the face of Farmer’s Fridge when making deliveries so it is crucial that you have a positive and professional attitude.\n\n* Drivers safely and efficiently maneuver city streets in a company-owned refrigerated van, deliver food to customers, fridges, and retail partners, and then use an iPad to communicate completed deliveries\n* Success will be measured by consistent on-time deliveries and your ability to follow our delivery processes\n* You’ll be the only Farmer’s Fridge employee that people see so you must be friendly and knowledgeable\n\nNecessary knowledge, skills, and experience:\n\n* Professional driving particularly with food shipment using a refrigerated box truck (Preferred)\n* Ability to use technology: computers, Microsoft and iPads\n* Some knowledge of mechanics (minor repairs to vans or smart fridges)\n* Ability to read and understand delivery instructions\n* Ability to lift at least 50 pounds\n* Non-CDL Driver\n\nPersonal characteristics:\n\n* Friendly: Your team needs to trust and feel empowered by you. Your friendly demeanor will make them feel comfortable approaching you with problems.\n* Organization: You need to have a plan for your drivers and make sure that they’re enabled to carry out their routes.\n* Teamwork: Even though you’ll be working solo most of the time, we’re also a team and we need to be able to depend on one another.\n* Improvement Oriented: You always look for ways to do things better, smarter, and faster.\n\nInnovate & Elevate - We're all teachers and learners. You'll grow, and help grow the company through cross-functional collaboration, open access to leadership, and regular business updates. You have a direct impact on the company’s bottom line. You can also impact your bottom line by participating in our 401(k) plan that includes a company match with immediate vesting.", "responsibilities": "Drivers safely and efficiently maneuver city streets in a company-owned refrigerated van, deliver food to customers, fridges, and retail partners, and then use an iPad to communicate completed deliveries", "qualifications": {"required": "Professional driving particularly with food shipment using a refrigerated box truck (Preferred), Ability to use technology: computers, Microsoft and iPads, Some knowledge of mechanics (minor repairs to vans or smart fridges), Ability to read and understand delivery instructions, Ability to lift at least 50 pounds, Non-CDL Driver", "preferred": ""}, "skills": ["Driving", "Delivery", "Customer Service", "Refrigerated Truck", "iPad", "Microsoft", "Mechanics"], "postedDate": "6 months ago", "benefits": "Traditional benefits for full-time hourly – Health, Dental, Vision, Life, Short Term and Long Term Disability., Competitive Salary & 401K company match that vests immediately upon participation, Equity available to full time employees after 1 year of employment, Generous sick leave & PTO policy, Paid holidays, $50 cell phone credit", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3830376724"}