{"jobTitle": "Hub Warehouse Associate - Los Angeles, CA", "company": {"name": "PrimeSource Building Products", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Wholesale Building Materials", "description": "PrimeSource Building Products Inc., one of the nation's largest wholesale distributors of building supply products and has an immediate opportunity for a Warehouse Associate.<br/><br/>Full-time M-F, great pay, and benefits within 30 days!<br/><br/>Benefits include medical, dental, vision, life, matched 401K, with paid holidays and PTO.<br/><br/>Summary:<br/><br/>Receives, stores, picks, loads, and distributes building product materials inside and outside of the Distribution Center. Also drives propane, or electric powered industrial truck equipped with lifting devices such as forklifts, order pickers, reach trucks or similar equipment to lift, stack, tier, or move products or materials by performing the following duties.<br/><br/>Responsibilities include but not limited to the following:<br/><br/>Variety of tasks based on prioritized business needs including:<br/><br/><ul><li>Transporting Materials: to and from receiving, storge and production areas with position fork, lifting platform, or other lifting device under, over, or around loaded pallets, skids, boxes, products, or materials.</li><li>Organizing Product: sort and place items on racks, shelves, or in bins according to predetermined sequence such as size, type, style, color, or product code.</li><li>Fulfillment: pull customer orders promptly from stock and placement on pallets, transporting orders to packing station, shipping department or directly to trucks.</li><li>Track Production: customer orders, work order, shipping order, or requisition to achieve daily goals.</li><li>Maintain Records: verify accuracy and product quality of items received and loaded for delivery.</li><li>Inventory: participate in annual physical inventory and product counts as directed, ensuring accurate labels or tags.<br/><br/><br/></li></ul>Qualifications:<br/><br/><ul><li>Dependable attendance and are team oriented.</li><li>Experience with driving a forklift or cherry picker equipment preferred.</li><li>Dependable attendance and are team oriented.</li><li>Experience with DC equipment preferred.</li><li>Safety awareness with focus on results and accuracy.</li><li>Schedule flexibility, overtime as necessary to meet customer expectations.</li><li>Education preferred, HS Diploma or GED.<br/><br/><br/></li></ul>Location(s)<br/><br/>1477-Los Angeles Hub<br/><br/>Please consider:<br/><br/><ul><li>Position requires physical effort: moving 560 units daily, weight average 30 pounds (70 times per hour).</li><li>Repetitive motion: properly handling up to 50 pounds, reaching-lowering to ground, and left-right movements.</li><li>Fall protection device weight limitation is 310 lbs.<br/><br/><br/></li></ul>Education:<br/><br/>High School Diploma or G.E.D education; or up to one month related experience or training; or equivalent combination of education and experience.<br/><br/>Other Requirements:<br/><br/><ul><li>Reaching for box from the ground, raising to waist height, 50lbs, at a minimum rate of 70 times an hour.</li><li>Reaching for box from shoulder height, lowering to waist height, 50lbs, at a minimum of 70 times an hour.</li><li>Truncated movement from left to right picking up box and lowering again, 50lbs, at a minimum of 70 times an hour.</li><li>Truncated movement from right to left picking up box and lowering again, 50lbs, at a minimum of 70 times an hour.<br/><br/><br/></li></ul>About PrimeSource Building Products Inc.<br/><br/><ul><li>With more than 1,200 employees we operate 34 distribution centers supporting North America.</li><li>One of the largest building supply wholesaler and distributor, providing professional builders with the tools they require to complete almost any project.</li><li>The company offers 22,000 sku's: Nails, screws, and collated fasteners; tools, compressors, and accessories; residential and commercial roofing products; diamond blades and accessories, gypsum accessories, weather protection and covers, adhesives and caulks, contractor bags and poly sheeting, building accessories; rebar and concrete accessories; and fencing and wire.</li><li>PrimeSource sells major brands and makes its own line of fasteners under the Grip-Rite and Pro-Twist brands.</li><li>PrimeSource Building Products roots trace back to 1938.<br/><br/><br/></li></ul>With more than 1,200 employees we operate over 34 distribution centers supporting North America. PrimeSource Building Products, Inc. is an Equal Opportunity Employer. PrimeSource Building Products, Inc. is fully committed to equal employment opportunity (EEO) and maintaining a workplace free of discrimination and harassment based on race, gender, religion, age, color, national origin, disability, sexual orientation, genetic information, and other non-merit factors. All persons shall be afforded equal employment opportunity at PrimeSource Building Products, Inc.<br/><br/>PrimeSource Building Products, Inc. prohibits discrimination in all aspects of its personnel policies, program practices and operations and relationships with employees and applicants, including but not limited to recruitment, hiring and merit promotion. PrimeSource Building Products, Inc. promotes programs of affirmative recruitment and employment at all levels of PrimeSource Building Products, Inc. PrimeSource Building Products, Inc. subscribes to, and will implement to the full extent, all applicable laws that promote equality of opportunity.<br/><br/>PrimeSource Building Products, Inc. welcomes and encourages applications from persons with disabilities, and will reasonably accommodate the needs of those persons. PrimeSource Building Products, Inc. is firmly committed to satisfying its affirmative obligations under the Rehabilitation Act of 1973, to ensure that persons with disabilities have every opportunity to be hired and advanced based on merit within PrimeSource Building Products, Inc.", "responsibilities": "Variety of tasks based on prioritized business needs including:<br/><br/><ul><li>Transporting Materials: to and from receiving, storge and production areas with position fork, lifting platform, or other lifting device under, over, or around loaded pallets, skids, boxes, products, or materials.</li><li>Organizing Product: sort and place items on racks, shelves, or in bins according to predetermined sequence such as size, type, style, color, or product code.</li><li>Fulfillment: pull customer orders promptly from stock and placement on pallets, transporting orders to packing station, shipping department or directly to trucks.</li><li>Track Production: customer orders, work order, shipping order, or requisition to achieve daily goals.</li><li>Maintain Records: verify accuracy and product quality of items received and loaded for delivery.</li><li>Inventory: participate in annual physical inventory and product counts as directed, ensuring accurate labels or tags.<br/><br/><br/></li></ul>", "qualifications": {"required": "Dependable attendance and are team oriented.", "preferred": "Experience with driving a forklift or cherry picker equipment preferred.\nDependable attendance and are team oriented.\nExperience with DC equipment preferred.\nSafety awareness with focus on results and accuracy.\nSchedule flexibility, overtime as necessary to meet customer expectations.\nEducation preferred, HS Diploma or GED."}, "skills": [], "postedDate": "6 months ago", "benefits": "Full-time M-F, great pay, and benefits within 30 days!<br/><br/>Benefits include medical, dental, vision, life, matched 401K, with paid holidays and PTO.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3831689540"}