{"jobTitle": "Patient Service Representative", "company": {"name": "DermCare Management", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "17.00/hr - 23.00/hr", "currency": "USD"}, "jobFunction": "Health Care Provider", "industry": "Hospitals and Health Care", "description": "The Patient Service Representative is primarily responsible for supporting our clinics daily operations through providing excellent customer service, administrative support and fulfilling general clerical office duties. Contributes to the overall positive work environment of the office by treating peers, managers, providers and patients with fairness, professionalism and courtesy. This role must ensure adherence to all HIPAA, OSHA, federal and state guidelines specific to patient care and privacy.<br/><br/><strong>Essential Functions<br/><br/></strong><ul><li>Greet patients &amp; caregivers, providing welcoming and professional customer service.</li><li>Scheduling &amp; rescheduling patient appointments as needed.</li><li>Chart preparation for following business day.</li><li>Verifying eligibility &amp; benefits:</li><ul><li>Listing co-pay, deductible, coinsurance on fee ticket.</li><li>Obtaining prior authorizations or referrals as required for patient visit.</li><li>Notify patients at check in if they will have to pay a deductible or co-insurance at checkout.</li></ul><li>Collect all monies due at time of service and post payments collected from patient copays &amp; balances.</li><li>Maintain public spaces, such as waiting rooms to ensure they are clean, comfortable and organized.</li><li>Competently navigate and use all computer applications, including practice management systems, EMRs, internet-based applications and standard office applications.</li><li>Assist patients at check in, including, but not limited to:</li><ul><li>Confirming/entering patient demographics into the practice management system.</li><li>Assisting patients in completing consents, forms &amp; obtaining copies of identification and insurance cards.</li><li>Document and call no shows.</li></ul><li>Assist patients at check out, including but not limited to:</li><ul><li>Collecting &amp; posting payments from deductibles, elective procedures &amp; cosmetic treatments.</li><li>Assisting with product sales.</li><li>Scheduling follow up appointments as directed by the providers/clinical staff.</li><li>Document and call no shows as needed.</li><li>Scan completed fee ticket into patients’ chart at end of visit.</li></ul><li>End of day fee ticket, batch submission and cash reconciliation with the highest degree of accuracy.</li><li>Call center offices: All front desk staff logged in daily into the communication portal, and stay in close contact with call center.</li><li>Process and submit medical records request in accordance with HIPAA guidelines.</li><li>Distribute faxes as received to appropriate parties.</li><li>Relay updates and information between patients, staff members and providers as needed in order to maintain a smooth patient flow, and service patient needs in a timely manner.</li><li>Other duties as assigned by management from time to time.<br/></li></ul><em>Range: $17-$23 based on experience. <br/><br/></em><strong>Qualifications &amp; Skills<br/><br/></strong><ul><li>Healthcare experience preferred</li><li>Minimum High School diploma or equivalent</li><li>Minimum 1-year prior customer service experience</li><li>Proper demeanor for a Dermatology office</li><li>Prior experience in Dermatology office setting a +</li><li>Bilingual - Spanish speaking a + (not required)</li><li>Detail and outcome oriented</li><li>Able to handle a multitude of tasks in a sometimes, ever-changing environment</li><li>Effective at listening, to understand, clarifying and responding to questions/concerns raised by patients<br/><br/></li></ul><strong>Benefits<br/><br/></strong><ul><li>Health Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>Paid time off</li><li>Retirement plan</li><li>Health Savings Account<br/><br/></li></ul>Wage Range - $19.00/hr to $22.00/hr DOE", "responsibilities": "The Patient Service Representative is primarily responsible for supporting our clinics daily operations through providing excellent customer service, administrative support and fulfilling general clerical office duties. Contributes to the overall positive work environment of the office by treating peers, managers, providers and patients with fairness, professionalism and courtesy. This role must ensure adherence to all HIPAA, OSHA, federal and state guidelines specific to patient care and privacy.", "qualifications": {"required": "Minimum High School diploma or equivalent, Minimum 1-year prior customer service experience, Proper demeanor for a Dermatology office, Detail and outcome oriented, Able to handle a multitude of tasks in a sometimes, ever-changing environment, Effective at listening, to understand, clarifying and responding to questions/concerns raised by patients", "preferred": "Healthcare experience, Prior experience in Dermatology office setting, Bilingual - Spanish speaking"}, "skills": ["HIPAA", "OSHA", "Customer Service", "Scheduling", "EMR", "Practice Management", "Patient Care", "Benefits Verification", "Cash Handling", "Medical Records", "Faxing"], "postedDate": "6 months ago", "benefits": "Health Insurance, Dental Insurance, Vision Insurance, Paid time off, Retirement plan, Health Savings Account", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3832311369"}