{"jobTitle": "Strategy and Operations Manager, Creative Product Marketing", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "$99,000.00/yr - $260,000.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/>TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo. <br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>We are looking for a Strategy Operations Manager to join the Global Creative Strategy and Operations team to support the Creative Operations team. The ideal candidate will have a robust analytical background supported by an equivalent degree, experience in data-driven roles within strategy or operations. <br/>Creativity is the soul of advertising. The TikTok Ads Creative &amp; Ecosystem team develops world-leading tech solutions for ads creative production, interpretation and optimization, to empower and inspire advertisers, creators, and other 3rd parties in the ecosystem to create and deliver the best engaging creative experiences to the end users.<br/>We are user-oriented and dedicated to technical excellence. We aim to drive and lead the technology renovation in the ads tech and creative industry, powering products and driving values for our clients, creators, and the whole ecosystem. <br/><br/>Responsibilities:<br/>Operational Excellence &amp; Business Planning<br/>- Shape go-to-market strategies by collaborating with Operations members using a data-driven approach, to identify priorities or gaps and recommend actionable plans for Operations to execute on. <br/>- Drive strategic planning with operational rigor, including operational reviews and tracking performance against regional goals.<br/>- Lead critical regional projects, ensuring alignment with cross-functional teams and buy-in from Operations stakeholders.<br/>- Systematically analyze the efficiency of TikTok's creative product revenue growth, subsidy efficiency, ROI and identify measures for improvement<br/>- Estimate the total addressable market and identify high-quality business opportunities globally for all products to ensure an effective GTM strategy<br/><br/>Data Analysis and Reporting<br/>- Own the regional data analytics framework, from data hygiene, data FAQs, data set improvement, metrics alignment and dashboard creation while effectively leveraging workflow with DE teams.  <br/>- Conduct ad-hoc market research into potential business opportunities, e.g. new partnerships and technologies, competitor products<br/>- Design and govern attainment reporting cadences, enabling effective comprehension and accountability amongst Ops members.  <br/>- Conduct deep-dive analyses on priority advertisers, pods, or industries to support the Operations team and unlock further revenue.<br/>- Guide the team in quantifying creative KPIs and identifying specific areas of improvement, providing data-driven insights to inform strategic decisions.<br/><br/>Cross-functional Collaboration<br/>- Provide thought leadership on creative industry trends and emerging monetization opportunities in digital advertising<br/>- Collaborate with creative product management and engineering teams to develop monetization strategies<br/>- Coordinate with other internal teams, including strategy and product teams, to bring industry-specific creative playbooks to advertisers and sales teams. <br/><br/>Qualifications<br/><br/>Minimum Qualifications:<br/>- Bachelor's degree in economics, statistics, engineering, or a related field<br/>- 3+ years of experience in management consulting, investment banking, or tech corporate strategy<br/>- Strong analytical skills with experience in market analysis and financial modeling. Preferred proficiency in SQL and data analysis tools with the ability to derive insights from data and use them to inform decision-making<br/>- Excellent communication and interpersonal skills, with the ability to build strong relationships with internal and external stakeholders<br/>- Strong project management skills with the ability to manage multiple projects simultaneously in a fast-paced environment with tight deadlines<br/>-------<br/>Preferred Qualifications:<br/>- Strong executive presence and ability to excel under pressure<br/>- Excellent communicator and comfortable managing multiple tasks, engaging and influencing with cross-functional groups<br/>- Detail-oriented to find solutions for clients while improving internal processes and delivering feedback<br/>- Self-starter and motivated to learns<br/>- Strong oral &amp; written communication skills for internal and external forums<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at TiktokOps.accommodations@tiktok.com <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $99000 - $260000 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "Operational Excellence &amp; Business Planning\n- Shape go-to-market strategies by collaborating with Operations members using a data-driven approach, to identify priorities or gaps and recommend actionable plans for Operations to execute on. \n- Drive strategic planning with operational rigor, including operational reviews and tracking performance against regional goals.\n- Lead critical regional projects, ensuring alignment with cross-functional teams and buy-in from Operations stakeholders.\n- Systematically analyze the efficiency of TikTok's creative product revenue growth, subsidy efficiency, ROI and identify measures for improvement\n- Estimate the total addressable market and identify high-quality business opportunities globally for all products to ensure an effective GTM strategy\n\nData Analysis and Reporting\n- Own the regional data analytics framework, from data hygiene, data FAQs, data set improvement, metrics alignment and dashboard creation while effectively leveraging workflow with DE teams.  \n- Conduct ad-hoc market research into potential business opportunities, e.g. new partnerships and technologies, competitor products\n- Design and govern attainment reporting cadences, enabling effective comprehension and accountability amongst Ops members.  \n- Conduct deep-dive analyses on priority advertisers, pods, or industries to support the Operations team and unlock further revenue.\n- Guide the team in quantifying creative KPIs and identifying specific areas of improvement, providing data-driven insights to inform strategic decisions.\n\nCross-functional Collaboration\n- Provide thought leadership on creative industry trends and emerging monetization opportunities in digital advertising\n- Collaborate with creative product management and engineering teams to develop monetization strategies\n- Coordinate with other internal teams, including strategy and product teams, to bring industry-specific creative playbooks to advertisers and sales teams. ", "qualifications": {"required": "Bachelor's degree in economics, statistics, engineering, or a related field\n- 3+ years of experience in management consulting, investment banking, or tech corporate strategy\n- Strong analytical skills with experience in market analysis and financial modeling. Preferred proficiency in SQL and data analysis tools with the ability to derive insights from data and use them to inform decision-making\n- Excellent communication and interpersonal skills, with the ability to build strong relationships with internal and external stakeholders\n- Strong project management skills with the ability to manage multiple projects simultaneously in a fast-paced environment with tight deadlines", "preferred": "Strong executive presence and ability to excel under pressure\n- Excellent communicator and comfortable managing multiple tasks, engaging and influencing with cross-functional groups\n- Detail-oriented to find solutions for clients while improving internal processes and delivering feedback\n- Self-starter and motivated to learns\n- Strong oral &amp; written communication skills for internal and external forums"}, "skills": ["SQL", "Data Analysis", "Market Analysis", "Financial Modeling", "Project Management", "Communication", "Interpersonal Skills"], "postedDate": "2 weeks ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \n\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \n\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3834426854"}