{"jobTitle": "Senior Architectural Designer", "company": {"name": "Zyscovich", "location": "Miami, FL"}, "location": "Miami, FL", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Design, Art/Creative, and Information Technology", "industry": "Architecture and Planning", "description": "Zyscovich Architects is a nationally renowned integrated Urban Design, Architecture, and Interior Design firm headquartered in Miami, with additional locations in New York City, Orlando, Bogota and Tobago. Zyscovich's 45-year portfolio includes aviation, education, mixed-use, multi-family, hospitality, retail, and commercial facilities.<br/><br/><ul><li>Leads the development of a project from inception through construction documents ensuring the quality and intent of the design.</li><li>Works independently on architectural design projects and coordinates project design efforts.</li><li>Identifies, through consultation, clients' requirements, approximate budget, timetable, and possible needs for future expansion.</li><li>Determines clients' preferences regarding materials, styles, colors, and other variables.</li><li>Attempts to identify through collaboration clients' priorities in terms of needs vs. desires.</li><li>Assists clients in defining their priorities and vision by preparing preliminary sketches of options.</li><li>Prepares and presents designs, specifications, estimated costs, and proposed construction schedule.</li><li>Modifies new or existing plans as required.</li><li>Performs other related duties as assigned. <br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Strong knowledge of design and construction methods.</li><li>Understanding of building tectonics and applicable codes.</li><li>Strong design and graphic skills.</li><li>Proficient in AutoCAD, Revit, Sketchup, and Adobe Creative Suite such as Photoshop, Illustrator, and InDesign desired.</li><li>Excellent communication and writing skills, attention to detail and highly organized. Self-starter, able to work independently and able to multi-task.</li><li>Knowledge with Academic projects a plus.</li><li>B.A. in Architecture</li><li>10+ years experience</li></ul>", "postedDate": "1 week ago", "benefits": "401(k), Dental insurance, Vision insurance, Medical insurance, Pension plan, Paid maternity leave, Paid paternity leave, Commuter benefits, Disability insurance", "remoteWork": "No", "skills": ["AutoCAD", "Revit", "Sketchup", "Adobe Creative Suite", "Photoshop", "Illustrator", "InDesign", "Communication", "Writing", "Design", "Construction", "Building Tectonics", "Graphic Skills", "Multi-tasking", "Academic Projects", "Architecture"], "url": "https://www.linkedin.com/jobs/view/3835401352"}