{"jobTitle": "Marketing Researcher", "company": {"name": "Meta", "location": "New York, NY"}, "location": "New York, NY", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "160,000.00/yr - 219,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Sales", "industry": "Technology, Information and Internet", "description": "At Meta, we believe that every creator can turn their passion into something more. We want our apps to be creators’ most used and loved, and we champion the unique ways that our apps can help creators build toward sustainable success. Understanding the needs of creators is more important than ever in order for Meta to meet the needs of this critical audience - and promote the connection that is driven by public consumption among the billions of people that use our apps every day. The Marketing Insights team are the stewards and enablers of our creator brand strategies throughout the organization. Across Facebook, Instagram, and Threads, we identify and evangelize what is unique about the apps, help more creators unlock more value from it, and ensure that all communications reinforce the brand and drive measurable business outcomes.Marketing Insights is an integral part of the marketing team and works cross-functionally with brand strategy, product, UX research, and data science teams. We influence marketing strategy, campaign development, and product roadmaps to help every creator that uses any of Meta’s apps. This Marketing Insights Researcher will be dedicated to identifying and championing the needs of creators to help them unlock more value from our Family of Apps, helping us win with our target creator and consumer audiences. This researcher will flex across both all three apps and all touchpoints we have with our creators - understanding the needs of creators at each stage of their journey; unpacking our brand positionings; steering GTM and outbound creator campaigns; and inspiring creator-focused productsThe Marketing Insights Researcher is as much a strategist as a researcher. They will design, execute, and deliver high-impact primary and secondary research (both quantitative and qualitative) in order to develop strategic recommendations and drive outcomes for the business. The ideal candidate will be a flexible and agile market research expert with phenomenal analytical and communication skills. Experience with creator-focused research is a plus. This is an individual contributor role.<br/><br/>Marketing Researcher Responsibilities:<br/><br/><ul><li>Lead research that addresses core business problems for Facebook, Instagram, or Threads</li><li>Design and execute innovative quantitative and qualitative research to support the marketing organization, the Family of Apps, and Meta at large</li><li>Translate research findings into actionable insights and strategic recommendations that will have an effect on reaching hundreds of millions of people</li><li>Set campaign strategy and test creative execution</li><li>Inspire product creation and influence product roadmaps to bring our brand to life within the product</li><li>Communicate effectively in order to motivate people to take action in marketing and across the organization</li><li>Develop and drive research strategy globally<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li>Demonstrated track record of identifying business opportunities and using research to drive strategy</li><li>Experience with independently executing full-cycle research from research design to reporting and socialization of results</li><li>Bachelor’s degree with 10+ years of experience with extensive background in quantitative or qualitative research, including hands-on experience in writing research instruments (e.g., such as discussion guides or survey questionnaires) and analysis (e.g., weighting, data cleaning, regression, cluster/segmentation analysis, content analysis, narrative analysis, thematic analysis)</li><li>Experience directing agencies/vendors to deliver results</li><li>Experience with content creator audience</li><li>Experience using primary and secondary research to influence executives and colleagues</li><li>Experience with international research</li><li>Experience with product optimization, brand strategy, creative testing, marketing campaign measurement, or lifecycle research<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Experience with data analysis tool (e.g., SPSS, R, Python, SQL)</li><li>Experience with survey programming tool (e.g., Qualtrics or SurveyMonkey)</li><li>Master’s degree and 8+ years relevant experience, or a PhD and 5+ years of relevant experience 10+ years of experience<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$160,000/year to $219,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "responsibilities": "Lead research that addresses core business problems for Facebook, Instagram, or ThreadsDesign and execute innovative quantitative and qualitative research to support the marketing organization, the Family of Apps, and Meta at largeTranslate research findings into actionable insights and strategic recommendations that will have an effect on reaching hundreds of millions of peopleSet campaign strategy and test creative executionInspire product creation and influence product roadmaps to bring our brand to life within the productCommunicate effectively in order to motivate people to take action in marketing and across the organizationDevelop and drive research strategy globally", "qualifications": {"required": "Demonstrated track record of identifying business opportunities and using research to drive strategyExperience with independently executing full-cycle research from research design to reporting and socialization of resultsBachelor’s degree with 10+ years of experience with extensive background in quantitative or qualitative research, including hands-on experience in writing research instruments (e.g., such as discussion guides or survey questionnaires) and analysis (e.g., weighting, data cleaning, regression, cluster/segmentation analysis, content analysis, narrative analysis, thematic analysis)Experience directing agencies/vendors to deliver resultsExperience with content creator audienceExperience using primary and secondary research to influence executives and colleaguesExperience with international researchExperience with product optimization, brand strategy, creative testing, marketing campaign measurement, or lifecycle research", "preferred": "Experience with data analysis tool (e.g., SPSS, R, Python, SQL)Experience with survey programming tool (e.g., Qualtrics or SurveyMonkey)Master’s degree and 8+ years relevant experience, or a PhD and 5+ years of relevant experience 10+ years of experience"}, "skills": ["Research", "Marketing", "Data Analysis", "Quantitative Research", "Qualitative Research", "Strategy", "Communication", "Product Development", "Brand Strategy", "Campaign Management", "Market Research", "Analytics", "Product Optimization", "Creative Testing", "Marketing Campaign Measurement", "Lifecycle Research", "SPSS", "R", "Python", "SQL", "Qualtrics", "SurveyMonkey"], "postedDate": "2 weeks ago", "benefits": "$160,000/year to $219,000/year + bonus + equity + benefitsIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3836099981"}