{"jobTitle": "Director of Manufacturing Engineering (66177)", "company": {"name": "The Gill Corporation", "location": "El Monte, CA"}, "location": "El Monte, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "jobFunction": "Engineering and Information Technology", "industry": "Aviation and Aerospace Component Manufacturing", "description": "<strong>Who We Are<br/><br/></strong>The Gill Corporation is one of the world's largest manufacturers of honeycomb, high performance floor panels, cargo compartment liners and original equipment for passenger and freighter aircraft. The company also excels in many other types of reinforced plastics including interior sandwich panels for creating structures such as aircraft galleys and bulkheads, honeycomb core and related products.<br/><br/><strong>Summary<br/><br/></strong>Direct, coordinate, plan, and organize all facilities and manufacturing engineering activities to safely deliver the perfect order at the lowest total cost each and every time.<br/><br/><strong>Essential Duties and Responsibilities </strong>include the following. Other duties may be assigned.<br/><br/><ul><li>Understand, develop and implement strategic objectives, capacity status, constraints, needs for growth in support of corporate goals and providing organizational recommendations as required to accomplish these goals</li><li>Develop capacity process analyses tools and lead efforts to ensure in-place capacity is ready in advance of needs</li><li>Develop and manage capital expenditure budgeting process and oversee budget spend for all expenditures</li><li>Work directly with vendors to ensure sufficient equipment capacity is in place to meet expected future demand</li><li>Drive cost reduction year over year by at least 2% of Cost of Goods Sold (COGS)</li><li>Lead Continuous Improvement projects to increase labor efficiency, increase yield and reduce scrap</li><li>Increase throughput of critical machines with the same equipment and direct labor hours</li><li>Eliminate waste of raw materials, utilities, staffing, and other company resources wherever possible</li><li>Participate in intra-company activities and committees as a representative of the Operations department in support of The Gill Corporation's goals and strategic objectives.</li><li>Ensure all facilities are maintained in top condition as expected by the corporation</li><li>Coordinate with R&amp;D and Sales to provide new equipment and processes for new projects, and review additions and updates to current in-house databases </li><li>Manage and direct all engineering staff, including Tooling, Process, Manufacturing, Technicians, and Mechanics</li><li>Manage and develop the Manufacturing Engineering team in El Monte to support and improve the equipment condition and reliability</li><li>Continually assess, develop and staff the subordinate groups with the talent necessary to operate at a high level of accuracy and productivity</li><li>Mentor other Gill personnel to help navigate Gill processes, policies and procedures and set them up for success<br/><br/></li></ul>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/><strong>Qualifications And Education (Required)<br/><br/></strong><ul><li>B.S. degree in Engineering; MBA or advanced technical degree is a plus</li><li>Fifteen (15) years Engineering Leadership experience in a manufacturing/process environment</li><li>Intermediate knowledge of mechanical, electrical and chemical systems used in industrial settings</li><li>Understanding of capital justification, procurement, and installation processes </li><li>Understanding of facilities and preventive maintenance procedures/best practices</li><li>Software – proficiency in: MS-Office, Access, MiniTab, Smartsheet, CAD software, &amp; SAP a plus</li><li>DoD Security Clearance a plus<br/><br/></li></ul><strong>ITAR Requirement<br/><br/></strong>This position requires access to information that is subject to compliance with the International Traffic Arms Regulations (“ITAR”) and/or the Export Administration Regulations (“EAR”). In order to comply with the requirements of the ITAR and/or the EAR, applicants will be asked to provide specific documentation to verify U.S. person status under the ITAR and the EAR. A “U.S. person” according to their definition is a U.S. citizen, U.S. lawful permanent resident (green card holder), or protected individual such as a refugee, or asylee.<br/><br/><em><strong>The Gill Corporation is an Equal Opportunity Employer</strong>. Applicants for all job openings are welcome and will be considered without regard to race, religious creed, color, age, sex, gender identity, gender expression, genetic information, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, veteran status, pregnancy, childbirth and related medical conditions, or any other classification protected by federal, state, and local laws and ordinances.<br/><br/></em><em><strong>The Gill Corporation provides reasonable accommodations</strong> to qualified individuals with disabilities in accordance with the Americans with Disability Act and applicable state and local law. If you require an accommodation in the application process, please notify the Human Resources Department</em>", "postedDate": "5 months ago", "skills": ["Engineering", "Manufacturing", "Process Engineering", "Continuous Improvement", "Capital Budgeting", "Project Management", "MS-Office", "Access", "MiniTab", "Smartsheet", "CAD", "SAP", "DoD Security Clearance", "ITAR", "EAR"], "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3836798104"}