{"jobTitle": "Product Manager, WhatsApp", "company": {"name": "WhatsApp", "location": "Menlo Park, CA"}, "location": "Menlo Park, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "171,000.00/yr - 238,000.00/yr", "currency": "USD"}, "jobFunction": "Product Management and Marketing", "industry": "Technology, Information and Internet", "description": "More than 2 billion people in over 180 countries use WhatsApp to stay in touch with friends and family, anytime and anywhere. By focusing on serving users who are new to the internet, with low-end devices, unreliable network connection, and of low-tech literacy, we’ve helped to bridge the digital divide, making the world feel a little smaller. Building on our strengths, we are now striving to bridge the financial divide to make the world a little more equal. Payments is the first step in this direction.Our goal is to make the exchange of money as simple and reliable as the exchange of a WhatsApp message. Imagine paying a friend for dinner, or your favorite small business for their services, without needing to download or even open another app.We launched peer to peer payments in India, WhatsApp’s largest market, just a year ago and have seen rapid growth. We are now looking for mission driven product managers to help unlock the next frontier of innovative consumer payments products and take our commerce payments experience from zero to one.The opportunity is momentous, the responsibility is huge and our ambitions are bold.<br/><br/>Product Manager, WhatsApp Responsibilities:<br/><br/><ul><li></li><li> Lead the ideation, development and launch of expressive and delightful features that help our users feel closer with every exchange</li><li></li><li> Empower merchants large and small to get paid by the half a billion Indian consumers who are already using WhatsApp to connect with businesses</li><li></li><li> Create mechanisms to take care of users when things go wrong by prioritizing risk and customer support initiatives</li><li></li><li> Collaborate with a vast group of cross functional experts (beyond engineering and design) to define the long term strategy for payments in India and create prioritization frameworks to drive alignment, especially with local regulators</li><li></li><li> Help grow the team as the product grows and succeeds<br/><br/></li></ul>Minimum Qualifications:<br/><br/><ul><li></li><li> 6+ years of experience as a Product Manager</li><li></li><li> Experience reasoning from first principles and making decisions with minimal data</li><li></li><li> Experience developing mobile products, technologies and platforms</li><li></li><li> Experience crafting simple user experiences and executing them from start to finish</li><li></li><li> Experience working in or interest in emerging markets</li><li></li><li> Enthusiasm for and/or a frequent user of WhatsApp<br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li></li><li> Experience working with API businesses and/or payment gateways</li><li></li><li> Experience working on a regulated product (e.g., healthcare, fintech)</li><li></li><li> Understanding of customer support and/or risk<br/><br/></li></ul>About Meta:<br/><br/>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.<br/><br/>Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.<br/><br/>Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.<br/><br/>$171,000/year to $238,000/year + bonus + equity + benefits<br/><br/>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.<br/><br/>", "responsibilities": "Lead the ideation, development and launch of expressive and delightful features that help our users feel closer with every exchange\nEmpower merchants large and small to get paid by the half a billion Indian consumers who are already using WhatsApp to connect with businesses\nCreate mechanisms to take care of users when things go wrong by prioritizing risk and customer support initiatives\nCollaborate with a vast group of cross functional experts (beyond engineering and design) to define the long term strategy for payments in India and create prioritization frameworks to drive alignment, especially with local regulators\nHelp grow the team as the product grows and succeeds", "qualifications": {"required": "6+ years of experience as a Product Manager\nExperience reasoning from first principles and making decisions with minimal data\nExperience developing mobile products, technologies and platforms\nExperience crafting simple user experiences and executing them from start to finish\nExperience working in or interest in emerging markets\nEnthusiasm for and/or a frequent user of WhatsApp", "preferred": "Experience working with API businesses and/or payment gateways\nExperience working on a regulated product (e.g., healthcare, fintech)\nUnderstanding of customer support and/or risk"}, "skills": [], "postedDate": "7 hours ago", "applicationDeadline": "", "benefits": "$171,000/year to $238,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3837298409"}