{"jobTitle": "Benefits Consultant", "company": {"name": "American Income Life Insurance Company", "location": "Downey, CA"}, "location": "Downey, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "Globe Life is an international Fortune 500 Company that provides supplemental life insurance benefits for over 40,000 different unions, credit unions, and veterans associations throughout the United States. Its subsidiary, American Income Life has been exclusively handling union benefits since 1951, their most notable union contracts being with our police officers, firefighters, nurses, teachers, and the NFL.<br/><br/>Our agency, , is looking for individuals with a desire to establish a career in the life insurance industry. If you have ever thought about starting your own business or agency, building with AO will give you the opportunity to achieve that freedom while having incredible support from the company and your team at the same time. You will not only be trained to protect families yourself, but you will learn from the best how to hire, train, motivate and coach new agents on your team. Your personal production is important, but building your team alongside you allows for exponential growth. Here at AIL, the rate that your career advances is determined solely on you and your performance.<br/><br/>No experience in sales or insurance is required, as we have industry-leading training and a great support system to provide you the tools to be successful. Life insurance is a highly regulated industry which does require you to hold a professional license. The laws do vary from state to state, but obtaining your license is generally an inexpensive and simple process that can be completed in 5-10 days. Our hiring team is there to guide you through the process every step of the way. This is an entirely remote position, allowing us to build a nationwide agency and service customers all around the country.<br/><br/>Company Accolades:<br/><br/><ul><li>Forbes Top 25 Happiest Companies to Work For 2017, 2018, 2019, 2020</li><li>Fortune 500 Company</li><li>Rated A+ Superior on AM Best for financial strength</li><li>A+ rating from the BBB<br/><br/></li></ul>What We Offer:<br/><br/><ul><li>Complete training program provided</li><li>Leads provided by the company</li><li>Commission with bonuses paid weekly</li><li>Vested renewals for life</li><li>Work for home - completely remote</li><li>Travel incentives!<br/><br/></li></ul>Top Candidates Must Have:<br/><br/><ul><li>Entrepreneurial Spirit</li><li>Excellent Leadership Skills</li><li>Ability to train and motivate others</li><li>Drive to succeed</li><li>A work ethic to match their goals<br/><br/></li></ul>Program Qualifications:<br/><br/><ul><li>Access to laptop/computer with webcam and strong internet connection</li><li>Able to pass background check</li><li>Already licensed insurance agent/willing to get licensed (Life &amp; Health)<br/><br/></li></ul>Powered by JazzHR<br/><br/>er8p50rOag", "postedDate": "6 months ago", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3837223839"}