{"jobTitle": "Sr. HR Generalist", "company": {"name": "Trojan Battery Company", "location": "Santa Fe Springs, CA", "industry": "Appliances, Electrical, and Electronics Manufacturing"}, "location": "Santa Fe Springs, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "75,000.00 - 90,000.00", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Appliances, Electrical, and Electronics Manufacturing", "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!<br/><br/><em>We're committed to bringing passion and customer focus to the business.<br/><br/></em><strong>Title</strong>: Sr Human Resource Generalist<br/><br/><strong>Location</strong>: Santa Fe Springs, CA<br/><br/><strong>Position Overview<br/><br/></strong>The Sr. Human Resources Generalist a hands-on role that provides full cycle Human Resources to our manufacturing plant, and plant team members. The role is critical in executing our people initiatives, providing great internal customer support, and driving HR functional excellence and process improvement.<br/><br/><strong>Areas of Focus<br/><br/></strong><ul><li>Understand business goals &amp; KPI’s</li><li>Recommend new approaches, policies and procedures </li><li>Effect improvements in business objectives </li><li>Training and development,</li><li>Employee engagement &amp; retention</li><li>Employee relations</li><li>Overall employee services<br/><br/></li></ul><strong>Responsibilities<br/><br/></strong><ul><li>Analyze relevant government rules and regulations and keep the management updated as well as ensure company’s relevant policies and procedures in line with government’s statutory requirements.</li><li>Optimize performance management process and track the status of performance improvement plan.</li><li>Performance related projects and other HR projects if necessary.</li><li>Other HR tasks assigned by the manager.</li><li>Prepare, update, track and maintain various records and reports, including policy manuals, HR Activity Reports, new hire and termination lists, organization charts.</li><li>Partner with client group leadership to ensure employee performance is maximized.</li><li>Evaluate training needs, develop and provide a variety of trainings</li><li>Assist in the communication and delivery of recognition processes and events</li><li>Works with Safety Committee and maintaining compliance.</li><li>Support and lead engagement initiatives<br/><br/></li></ul><strong>Basic Qualifications<br/><br/></strong><ul><li>Bachelor’s degree in human resources, economics or business management.</li><li>Minimum 5 - 7 years of relevant experience in HR, Employee Relations, On-Boarding, Recruitment and Training.</li><li>Microsoft Office Suite, intermediate experience in Excel data analytics and Power Point Presentation</li><li>Ability to write clear and concise reports, business correspondence, policies and procedures. </li><li>Strong translation skills, in communication and documentation</li><li>Strong knowledge of HR principles, industry practices, and legal requirements related to HR policies and practices. </li><li>Ability to work in a manufacturing environment</li><li>Bilingual Spanish/English required</li><li>Ability to work and support multiple shifts<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Manufacturing Experience</li><li>Workday Experience</li><li>PHR or SPHR</li><li>Master’s level education<br/><br/></li></ul><strong>Salary Range: $75,000 - $90,000/year<br/><br/></strong><strong>Our salary ranges are determined by role, education and experience level, and location<br/><br/></strong><em>if you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!<br/><br/></em><em>if you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!</em>", "responsibilities": "Analyze relevant government rules and regulations and keep the management updated as well as ensure company’s relevant policies and procedures in line with government’s statutory requirements. Optimize performance management process and track the status of performance improvement plan. Performance related projects and other HR projects if necessary. Other HR tasks assigned by the manager. Prepare, update, track and maintain various records and reports, including policy manuals, HR Activity Reports, new hire and termination lists, organization charts. Partner with client group leadership to ensure employee performance is maximized. Evaluate training needs, develop and provide a variety of trainings Assist in the communication and delivery of recognition processes and events Works with Safety Committee and maintaining compliance. Support and lead engagement initiatives", "qualifications": {"required": "Bachelor’s degree in human resources, economics or business management. Minimum 5 - 7 years of relevant experience in HR, Employee Relations, On-Boarding, Recruitment and Training. Microsoft Office Suite, intermediate experience in Excel data analytics and Power Point Presentation Ability to write clear and concise reports, business correspondence, policies and procedures. Strong translation skills, in communication and documentation Strong knowledge of HR principles, industry practices, and legal requirements related to HR policies and practices. Ability to work in a manufacturing environment Bilingual Spanish/English required Ability to work and support multiple shifts", "preferred": "Manufacturing Experience Workday Experience PHR or SPHR Master’s level education"}, "skills": ["HR", "Employee Relations", "On-Boarding", "Recruitment", "Training", "Microsoft Office Suite", "Excel", "Power Point Presentation", "Spanish", "English", "Manufacturing Experience", "Workday Experience", "PHR", "SPHR"], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3838662639"}