{"jobTitle": "TikTok LIVE US Strategic Operations Manager - USDS", "company": {"name": "TikTok", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Not Applicable", "salary": {"amount": "104,711.00/yr - 192,533.00/yr", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Entertainment Providers", "description": "Responsibilities<br/><br/> About TikTok U.S. Data Security<br/>TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. U.S. Data Security (“USDS”) is a subsidiary of TikTok in the U.S. This new, security-first division was created to bring heightened focus and governance to our data protection policies and content assurance protocols to keep U.S. users safe. Our focus is on providing oversight and protection of the TikTok platform and U.S. user data, so millions of Americans can continue turning to TikTok to learn something new, earn a living, express themselves creatively, or be entertained. The teams within USDS that deliver on this commitment daily span across Trust &amp; Safety, Security &amp; Privacy, Engineering, User &amp; Product Ops, Corporate Functions and more.<br/><br/>Why Join Us<br/>Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. <br/>Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. <br/>To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. <br/>At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. <br/>Join us.<br/><br/>In order to enhance collaboration and cross-functional partnerships, among other things, at this time, our organization follows a hybrid work schedule that requires employees to work in the office 3 days a week, or as directed by their manager/department. We regularly review our hybrid work model, and the specific requirements may change at any time.<br/><br/>About the team<br/>The TikTok LIVE team's mission is to work hand-in-hand with creators &amp; influencers, agencies, and partner organizations to create an environment that brings communities together in real-time to create meaningful and interactive connections around the globe.<br/><br/>Responsibilities<br/>- As the strategic operations manager for TikTok LIVE, USDS team, you will play a critical role in helping drive the growth and success of our team;<br/>- Set a long-term vision for team ownership, build roadmaps and development plans. Navigate technical and compliance details with cross functional teams while effectively conveying goals and prioritization - proficient in addressing both the 10-feet and 10K-feet level details;<br/>- Lead and organize team OKRs, monitor and track performance across multiple operation verticals, identify areas for improvement and drive continuous improvement initiatives;<br/>- Partners with senior leadership and leverage data to inform and influence new strategies, SOPs and/or collaboration models that bring business impact and improve efficiencies;<br/>- Build relationships and ensure tight alignment with cross-functional stakeholders (e.g., Product, Regional Ops, Analytics, Legal, Compliance, etc) to drive execution excellence and align resources to deliver best output;<br/>- Deeply understand TikTok USDS Privacy, Safety, and Security guidelines, as well as business partners' priorities across TikTok LIVE team, be the bridge and advocate to build the compliant and efficient TikTok LIVE business;<br/>- Coaching and developing team members. <br/><br/>Qualifications<br/><br/> Minimum Qualifications<br/>- Bachelor's degree; MBA or Master's degree preferred;<br/>- 5+ years of experience working in product operations, user growth, and/or technology companies' strategy/business ops roles; <br/>- 3+ years of experience directly managing teams;<br/>-Intermediate to advanced Excel skills;<br/>- Analytical mindset and skills for decision making, experiences in goal setting, results-driven performance management, and/or growth strategies;<br/>- Deep understanding of social media platforms, user lifecycle and marketplace dynamics;<br/>- Ability to work independently and time manage multiple high impact initiatives; Proactively identifying opportunities to optimize products and processes<br/><br/>Preferred Qualifications<br/>- An in-depth understanding of content business and its related technologies;<br/>- Excellent communication and presentation skills with the ability to take complex, ambiguous topics and turn them into digestable and insightful narratives for audiences;<br/>- Speed, resourcefulness, and a go-getter attitude;<br/>- Mandarin-speaking<br/><br/>TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.<br/><br/>TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https://shorturl.at/ktJP6<br/><br/>This role requires the ability to work with and support systems designed to protect sensitive data and information. As such, this role will be subject to strict national security-related screening. <br/><br/>Job Information:<br/><br/>【For Pay Transparency】Compensation Description (annually) <p>The base salary range for this position in the selected city is $104711 - $192533 annually.<span>​</span></p><p>Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.<span>​</span></p><p>Our company benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support our employees to give their best in both work and life. We offer the following benefits to eligible employees: <span>​</span></p><p>We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. <span>​</span></p><p>Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. <span>​</span></p><p>We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.<span>​</span></p><p>For Los Angeles County (unincorporated) Candidates:<span>​</span></p><p>Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:<span>​</span></p><p>1. Interacting and occasionally having unsupervised contact with internal/external clients and/or colleagues;<span>​</span></p><p>2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and<span>​</span></p><p>3. Exercising sound judgment.<span>​</span></p>", "responsibilities": "- As the strategic operations manager for TikTok LIVE, USDS team, you will play a critical role in helping drive the growth and success of our team;\n- Set a long-term vision for team ownership, build roadmaps and development plans. Navigate technical and compliance details with cross functional teams while effectively conveying goals and prioritization - proficient in addressing both the 10-feet and 10K-feet level details;\n- Lead and organize team OKRs, monitor and track performance across multiple operation verticals, identify areas for improvement and drive continuous improvement initiatives;\n- Partners with senior leadership and leverage data to inform and influence new strategies, SOPs and/or collaboration models that bring business impact and improve efficiencies;\n- Build relationships and ensure tight alignment with cross-functional stakeholders (e.g., Product, Regional Ops, Analytics, Legal, Compliance, etc) to drive execution excellence and align resources to deliver best output;\n- Deeply understand TikTok USDS Privacy, Safety, and Security guidelines, as well as business partners' priorities across TikTok LIVE team, be the bridge and advocate to build the compliant and efficient TikTok LIVE business;\n- Coaching and developing team members.", "qualifications": {"required": "- Bachelor's degree; MBA or Master's degree preferred;\n- 5+ years of experience working in product operations, user growth, and/or technology companies' strategy/business ops roles; \n- 3+ years of experience directly managing teams;\n-Intermediate to advanced Excel skills;\n- Analytical mindset and skills for decision making, experiences in goal setting, results-driven performance management, and/or growth strategies;\n- Deep understanding of social media platforms, user lifecycle and marketplace dynamics;\n- Ability to work independently and time manage multiple high impact initiatives; Proactively identifying opportunities to optimize products and processes", "preferred": "- An in-depth understanding of content business and its related technologies;\n- Excellent communication and presentation skills with the ability to take complex, ambiguous topics and turn them into digestable and insightful narratives for audiences;\n- Speed, resourcefulness, and a go-getter attitude;\n- Mandarin-speaking"}, "skills": ["Excel", "Data Analysis", "Strategy", "Operations", "Management", "Social Media", "Product Management", "Business Operations", "Team Leadership", "Communication", "Presentation Skills"], "postedDate": "2 weeks ago", "benefits": "We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&amp;D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. \n\nOur time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off (PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. \n\nWe also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3838484677"}