{"jobTitle": "Restaurant Manager, General Manager", "company": {"name": "DD Factor", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Director", "salary": {"amount": "$130,000.00 - $140,000.00", "currency": "USD"}, "jobFunction": "Strategy/Planning and Information Technology", "industry": "Restaurants", "description": "<strong>Restaurant General Manager</strong> with compensation of $130,000.00 to $140,000.00 as well as full benefits.<br/><br/>We are seeking an experienced Restaurant General Manager to oversee the operations of our Beverly Hills restaurant. As the Restaurant General Manager, you will be responsible for leading both the FOH and BOH teams while, ensuring excellent customer service across all areas. This includes not only our dine-in guests but our delivery, pick-up and catering.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li> Mayor of the Restaurant</li><li> Oversee the hiring, training, and scheduling of restaurant staff, ensuring they are equipped with the necessary tools and knowledge to deliver an exceptional experience</li><li> Ability and background in creating SOP’s for smooth operations and future growth</li><li> LRM</li><li> Monitor and analyze financial data such as sales, expenses, and profitability for each revenue stream to make informed business decisions and implement strategies to improve performance<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li> Proven tenured, experience as a Restaurant General Manager, managing multi-revenue streams</li><li> Strong leadership skills</li><li> Excellent communication and interpersonal skills, with the ability to effectively interact with customers, employees, and vendors.</li><li> Excellent financial acumen</li><li> Exceptional problem-solving and decision-making skills, with the ability to handle challenging situations effectively and quickly</li><li> Strong organizational and time management skills, with the ability to prioritize tasks and meet deadlines</li><li> Flexibility to work in a fast-paced environment and adapt to changing priorities across all areas</li><li> Hands on Restaurant Management style<br/><br/></li></ul>If you are a Restaurant General Manager who no longer wants to work late nights (we close at 9pm) and has longevity with past employers, please send us your resume.<br/><br/><strong>Restaurant General Manager</strong> with compensation of $130,000.00 to $140,000.00 as well as full benefits.", "postedDate": "6 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3838805183"}