{"jobTitle": "VP of Manufacturing", "company": {"name": "Olympian Motors", "industry": "Automotive", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Executive", "jobFunction": "Management and Manufacturing", "industry": "Automotive", "description": "<strong>Location</strong>: Los Angeles, California.<p> </p><p><strong>VP of Manufacturing:</strong></p><p>Olympian Motors is hiring a VP of Manufacturing in Los Angeles to expand its modular EV manufacturing capacity in California.</p><p> </p><p><strong>Company Description</strong>: Olympian Motors is a modular electric vehicle company. Olympian combines innovative modular EV systems with timeless design aesthetics. We are pioneering the transition to fully-modular EV manufacturing while offering aesthetic and sustainable vehicles.</p><p> </p><p>We are seeking a dynamic and entrepreneurial VP of Manufacturing to join our team, as one of the Olympian's critical early-employees. She/he will lead the manufacturing &amp; assembly operations in LA.</p><p> </p><p>Inviting pioneers to join Olympian and build the next big automotive story of the 21st century.</p><p><br/></p><p> </p><p><strong>Job Requirements:</strong></p><ul><li>Experienced in electric vehicle and automotive</li><li>Understanding of modular vehicle and hardware systems.</li><li>Direct experience in EV or smartphone assembly and factory management functions.</li><li>Technical Expertise: A deep understanding of manufacturing and assembly processes, especially in the electric vehicle, automotive or related industries.</li><li>Strong execution. Set clear objectives, and execute plans to achieve production goals.</li><li>Graduated from one of the top colleges</li></ul><p> </p><p>At Olympian Motors, we embrace diversity and inclusivity as key drivers of innovation. We welcome applicants from all backgrounds to apply and join us in our mission to revolutionize the electric vehicle industry.</p><p><br/></p><p><strong>Responsibilities:</strong></p><ul><li>Modular manufacturing.</li><li>Operations</li><li>Quality Assurance</li><li>Supply Chain Management</li><li>Team Leadership.</li><li>Budget and Cost Control.</li></ul><p><br/></p><p>Please send your resume to careers(at)olympianmotors.com</p><p><br/></p><p>Olympian Motors, Inc.</p>", "responsibilities": "Modular manufacturing. Operations Quality Assurance Supply Chain Management Team Leadership. Budget and Cost Control.", "qualifications": {"required": "Experienced in electric vehicle and automotive Understanding of modular vehicle and hardware systems. Direct experience in EV or smartphone assembly and factory management functions. Technical Expertise: A deep understanding of manufacturing and assembly processes, especially in the electric vehicle, automotive or related industries. Strong execution. Set clear objectives, and execute plans to achieve production goals. Graduated from one of the top colleges", "preferred": ""}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3840892317"}