{"jobTitle": "Manufacturing Quality Manager", "company": {"name": "Arktura", "location": "Carson, CA"}, "location": "Carson, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$80,000.00-$110,000.00", "currency": "USD"}, "jobFunction": "Quality Assurance", "industry": "Design Services, Civil Engineering, and Construction", "description": "Arktura is an industry-leading manufacturer of cutting-edge architectural systems and innovative custom solutions, driven by state-of-the-art design &amp; manufacturing technology. We are currently seeking a highly organized, proactive and energetic Quality Manager to join our team of architects, designers, engineers, machinists and software developers at our headquarters in Los Angeles.<br/><br/>Responsible for day-to-day tactical leadership of the Quality department to execute the defined Strategic Quality Plan in conjunction with Quality functional leadership. Provides quality assurance support to customers, suppliers, partners and internal manufacturing departments. Leads continuous improvement activities in targeted areas. Ensures compliance to quality standards as it relates to the inspection environment. Oversees the inspection of incoming and assembled parts as well as the day-to-day supervision of employees within QC. Acts as primary contact point for department problem resolution. Coordinates with all functional and service groups to meet customer requirements. Drives performance to achieve or exceed financial plans and strategic goals. Leverages resources and motivates personnel to create high performance culture.<br/><br/>Responsibilities<br/><br/>\n<ul><li>Work with General Manager, Supervisors and Team Lead to evaluate product acceptability against production quality standards.</li><li>Leading continuous improvement programs within operations according to Lean and Six Sigma methodology</li><li>Maintaining prompt and thorough RCA (Root Cause Analysis) of internal Quality deviations with a strong emphasis on corrective and preventative actions</li><li>Prioritizing the review of field / customer-based issues / incidents, especially those where the charging service is interrupted, performing in-depth forensic analysis to determine the root cause.</li><li>Preparing internal &amp; external Quality report / documentation; including times lines, analysis, recommendations etc.</li><li>Quantifying the \"Cost of Poor Quality\", using this as evidence to support the Quality plan.</li><li>Identifying, authoring, and deploying QBP’s (Quality Best Practices) across all aspects of the organization</li><li>Provide training on all aspects of Quality Engineering, with a focus on RCA.</li><li>Preparing &amp; Leading integrated ISO audits and similar standards including systems.</li><li>Creates project plans and guides team members to complete project in a timely manner</li><li>Oversees processes to ensure leadership’s awareness of compliance issues, activities, and federal, state and local regulatory activities that affect technical and quality compliance</li><li>Performs all assigned duties in compliance with internal SOP’s and external regulations</li><li>Develops monitoring processes (e.g.: trending and tracking of errors, inspection findings, and internal audit results) to review and analyze data to determine if modifications or additions to the current QA program are necessary and creates recommendations to ensure organizational compliance</li><li>Develops measurement systems based on quality assessment tools and practices, and manages the data</li><li>Institute’s quality management processes for the company through technical training and education programs and materials<br/><br/><br/></li></ul>Requirements<br/><br/>\n<ul><li>Minimum of 5 years of QC managerial experience within the metal manufacturing industry</li><li>Will have experience in Total Quality Management and/or additional quality processes.</li><li>Candidate should possess advanced knowledge of OSHA laws and best-in-class Safety techniques and processes.</li><li>B.S. degree in Engineering, Quality Control or equivalent years of relevant experience.</li><li>Experience with Quality Management System implementation</li><li>Experience with the application of Lean methodologies</li><li>Experience with 5 Why Root Cause Methodology</li><li>Experience leading a strong culture initiative in regards to Quality practices</li><li>Excellent computer skills in a Microsoft Windows environment. Must include Excel and demonstrated skills in database management and record keeping.</li><li>This role is not remote, applicants must be Los Angeles based.</li><li>Physical Demands<br/><br/><br/></li></ul>The physical requirements described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br/><br/>While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to stand; walk; use hands to finger, handle or feel; and reach with hands and arms. The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch or crawl. The employee must frequently lift and move up to 25 pounds and occasionally lift and move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.<br/><br/>Work Environment<br/><br/>\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.<br/><br/>\n<ul><li> Office Environment – This position operates in a professional office environment and is not exposed to adverse environmental conditions. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. No PPE is required.</li><li> Plant Environment – This position operates in a manufacturing setting and can be subject to extreme cold and hot temperatures; uneven walking surfaces with cords, tools and other obstacles; intermittent loud noises; and dusty or dirty conditions. Required PPE includes Hard hat (when required), safety glasses, earplugs, steel toe/composite boots, and fall protection.<br/><br/><br/></li></ul>Benefits And Perks<br/><br/>\n<ul><li>Working at Arktura is the best! Benefits include 401k with employee match, robust health care options, paid time off and professional development. </li><li>We have a casual dress code, and quarterly events! </li><li>As a company, we love to engage in community service activities with our local organizations.</li><li>We provide access to 100’s of discounts, specialty savings and voluntary benefits through LifeMart such as car and hotel rentals and auto, home, and pet insurance, legal services, and childcare</li><li>We support Employee Resource Groups created to connect employees with common interests to promote inclusion and provide perspective.<br/><br/><br/></li></ul>About Arktura<br/><br/>\nAt Arktura, we make design happen. Creativity, expert knowledge and cutting-edge technology shape everything we do whether it's exploring form and function in our standard architectural product, adapting our pre-configured architectural systems to meet project needs, or partnering with clients through our Solutions Studio. Our multidisciplinary team brings together architects, designers, programmers, engineers and artists with a deep understanding of the creative process. We use our collective ingenuity to bridge the gaps between design intent and manufacturing capabilities, creating proprietary software and machinery to meet evolving demands.<br/><br/>Arktura is an Equal Opportunity Employer.<br/><br/>Arktura is an E-Verify Employer.<br/><br/>The estimated base salary range for this role is $80,000.00-$110,000.00 a year. Individual pay is based upon location, skills and expertise, experience and other relevant factors.", "responsibilities": "Responsible for day-to-day tactical leadership of the Quality department to execute the defined Strategic Quality Plan in conjunction with Quality functional leadership. Provides quality assurance support to customers, suppliers, partners and internal manufacturing departments. Leads continuous improvement activities in targeted areas. Ensures compliance to quality standards as it relates to the inspection environment. Oversees the inspection of incoming and assembled parts as well as the day-to-day supervision of employees within QC. Acts as primary contact point for department problem resolution. Coordinates with all functional and service groups to meet customer requirements. Drives performance to achieve or exceed financial plans and strategic goals. Leverages resources and motivates personnel to create high performance culture.", "qualifications": {"required": "Minimum of 5 years of QC managerial experience within the metal manufacturing industry\nWill have experience in Total Quality Management and/or additional quality processes.\nCandidate should possess advanced knowledge of OSHA laws and best-in-class Safety techniques and processes.\nB.S. degree in Engineering, Quality Control or equivalent years of relevant experience.\nExperience with Quality Management System implementation\nExperience with the application of Lean methodologies\nExperience with 5 Why Root Cause Methodology\nExperience leading a strong culture initiative in regards to Quality practices\nExcellent computer skills in a Microsoft Windows environment. Must include Excel and demonstrated skills in database management and record keeping.\nThis role is not remote, applicants must be Los Angeles based.", "preferred": ""}, "skills": ["Quality Assurance", "Quality Management", "Lean", "Six Sigma", "ISO", "OSHA", "Excel", "Database Management", "Record Keeping"], "postedDate": "5 months ago", "benefits": "Benefits include 401k with employee match, robust health care options, paid time off and professional development. \nWe have a casual dress code, and quarterly events! \nAs a company, we love to engage in community service activities with our local organizations.\nWe provide access to 100’s of discounts, specialty savings and voluntary benefits through LifeMart such as car and hotel rentals and auto, home, and pet insurance, legal services, and childcare\nWe support Employee Resource Groups created to connect employees with common interests to promote inclusion and provide perspective.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3840853086"}