{"jobTitle": "Dispatcher - Install Coordinator", "company": {"name": "Barker and Sons Plumbing & Rooter", "location": "Orange, CA"}, "location": "Orange, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "24 - 28 hourly", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Consumer Services", "description": "You are a master at keeping ALL the plates spinning at once. <br/><br/>That's why you’re such a great dispatcher.<br/><br/>But you’re looking for a change.<br/><br/>To work for a company that knows how important you are to the organization.<br/><br/>Plumbers are an Essential Service after all.<br/><br/>And there's simply no way they can be successful without a crackerjack dispatcher staying on top of their schedule, communicating like a ninja with customers, and getting the right person to the right job, every time.<br/><br/><ul><li>Do you love being the conductor of the symphony?</li><li>Do you find it cathartic to watch your work all dance so beautifully on the appointment board? </li><li>Do you love connecting with customers, giving them hope and confidence in our company and the services we provide?<br/><br/></li></ul>We’re looking for the kind of person that would be uncomfortable leaving a job incomplete.<br/><br/>For the person who believes in helping others over themselves.<br/><br/>For the person who believes it is their duty to ensure no one should be left behind.<br/><br/>And we think that person might very well be you.<br/><br/>It’s your precision to detail, leaving no stone unturned, that makes you so perfect for this role.<br/><br/>Your ability to gracefully handle a constant stream of communication as the conduit between Plumber and Prospect.<br/><br/>You are the lynchpin, and we honor you.<br/><br/>If you are humble and keen to deliver a world-class experience, we want you to join our tribe.<br/><br/><strong>We do great work because we have great people like YOU. <br/><br/></strong>That means we do <strong>Not</strong> give our time, energy, or money to No-Show-Nicks, Lazy-Larrys, or Angry-Als.<br/><br/>No need to apply if you're not a stand-up human being.<br/><br/>We're only looking for happy, hard-working, hands-on, and hungry leaders for our organization.<br/><br/>Yes, leaders. This opportunity <strong>Literally Only Exists </strong>for those that we genuinely believe will someday be leaders in our organization.<br/><br/><strong>At Barker and Sons, we are always working really hard to make it about people. <br/><br/></strong><strong>We Have All The Perks You'd Expect, Including<br/><br/></strong><ul><li>Health, Vision, Dental and Life insurance</li><li>401(k) plan with company matching</li><li>Paid holidays and paid time off</li><li>Onboarding and ongoing training and development</li><li>All the tools for the job</li><li>and a whole bunch more.<br/><br/></li></ul>The real question is, are you ready to step into your genius zone so we can start celebrating you already?!<br/><br/>If your heart is saying yes, come join me at Barker &amp; Sons.<br/><br/>It's your time to take control of your future at a place you enjoy coming to each day.<br/><br/><strong>Brenda Barker<br/><br/></strong><strong>Owner<br/><br/></strong><strong>Barker &amp; Sons Plumbing &amp; Rooter<br/><br/></strong>Compensation: $24 - $28 hourly", "postedDate": "5 months ago", "benefits": "Health, Vision, Dental and Life insurance, 401(k) plan with company matching, Paid holidays and paid time off, Onboarding and ongoing training and development, All the tools for the job, and a whole bunch more.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3841555483"}