{"jobTitle": "Escrow Assistant", "company": {"name": "SummitHR", "location": "Pasadena, CA"}, "location": "Pasadena, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "salary": {"amount": "55000 - 70000 per year", "currency": "USD"}, "jobFunction": "Sales and Management", "industry": "Staffing and Recruiting", "description": "Responsibilities<br/><br/>\n<ul><li>Sending title commitments, curing title, reviewing surveys, preparing preliminary CDs, helping clients on incoming calls and in office.</li><li>Paperless office with high volume and fast paced environment. Experience in Ramquest, Outlook, FileScan and Dashboard a plus.</li><li>Assisting the Escrow Officer in preparing files for closing.</li><li>Order title work, taxes, HOA documents, payoffs and any documentation needed for the file.</li><li>Receipt contracts and deposit earnest money.</li><li>Set up new files.</li><li>Send out tile commitments, taxes and wiring instructions to lenders, agents and buyer and sellers.</li><li>Answer phone calls and emails when Escrow Officer is not available.</li><li>Assist in helping Escrow Officer with returning calls and emails.</li><li>Promptly notifies marketing representative for contract pickups.</li><li>Funding and shipping of files after closing.</li><li>Policy preparation after closing.</li><li>Assists marketing with projects as needed (mail outs, etc.).</li><li>Must be consistently on time for work each day and have dependable consistent attendance.</li><li>Will be required to perform escrow tasks on the company's RamQuest system (training provided).</li><li>Must be personable, positive and a professional representative of the Company.</li><li>Regular consistent attendance is required, that could include attendance at after hour Company events.</li><li>Ability to accept supervision.</li><li>Ability to foster, develop and maintain professional and collaborative working relationships. Must be able to get along with others, i.e., peers, supervisors, outside customers, and vendors.</li><li>Ability to interact effectively and professionally with all levels of management, employees and customers by email, phone and in person.</li><li>Ability to work overtime as requested and approved by supervisor.</li><li>Perform other duties as assigned by supervisor.<br/><br/></li></ul>Knowledge/Skills/Experience<br/><br/>\n<ul><li>Experience in customer service, clerical or administrative support work.</li><li>Maintain courteous, business-like composure, use pleasant voice mannerisms and greeting, when answering telephone and greeting customers.</li><li>Excellent verbal and written communication skills.</li><li>Excellent interpersonal and customer service skills.</li><li>Ability to prioritize and handle multiple projects.</li><li>Strong attention to detail and organizational skills.</li><li>Proficient in Microsoft Office Suite and Outlook.<br/><br/></li></ul>Physical/Mental Demands<br/><br/>\n<ul><li>Must have a professional appearance and good customer service skills, including conversing with all levels of management, employees, vendors, and customers</li><li>Ability to perform under pressure and be flexible with disruptions throughout the workday.</li><li>Must be able to work approved and requested overtime, by supervisor.</li><li>Repetitive and continual typing motion is required.</li><li>Sedentary work: Exerting up to 15 pounds of force occasionally, and/or a negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting a majority of the time. Walking and standing are required, occasionally.<br/><br/></li></ul>Experience<br/><br/>\n<ul><li>1 - 3 years<br/><br/></li></ul>Salary: $55000 - $70000 per year<br/><br/>\n<em>Job Posted by ApplicantPro</em>", "responsibilities": "Sending title commitments, curing title, reviewing surveys, preparing preliminary CDs, helping clients on incoming calls and in office. Paperless office with high volume and fast paced environment. Experience in Ramquest, Outlook, FileScan and Dashboard a plus. Assisting the Escrow Officer in preparing files for closing. Order title work, taxes, HOA documents, payoffs and any documentation needed for the file. Receipt contracts and deposit earnest money. Set up new files. Send out tile commitments, taxes and wiring instructions to lenders, agents and buyer and sellers. Answer phone calls and emails when Escrow Officer is not available. Assist in helping Escrow Officer with returning calls and emails. Promptly notifies marketing representative for contract pickups. Funding and shipping of files after closing. Policy preparation after closing. Assists marketing with projects as needed (mail outs, etc.). Must be consistently on time for work each day and have dependable consistent attendance. Will be required to perform escrow tasks on the company's RamQuest system (training provided). Must be personable, positive and a professional representative of the Company. Regular consistent attendance is required, that could include attendance at after hour Company events. Ability to accept supervision. Ability to foster, develop and maintain professional and collaborative working relationships. Must be able to get along with others, i.e., peers, supervisors, outside customers, and vendors. Ability to interact effectively and professionally with all levels of management, employees and customers by email, phone and in person. Ability to work overtime as requested and approved by supervisor. Perform other duties as assigned by supervisor.", "qualifications": {"required": "Experience in customer service, clerical or administrative support work. Maintain courteous, business-like composure, use pleasant voice mannerisms and greeting, when answering telephone and greeting customers. Excellent verbal and written communication skills. Excellent interpersonal and customer service skills. Ability to prioritize and handle multiple projects. Strong attention to detail and organizational skills. Proficient in Microsoft Office Suite and Outlook."}, "skills": ["Ramquest", "Outlook", "FileScan", "Dashboard", "Microsoft Office Suite"], "postedDate": "6 months ago", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3841729297"}