{"jobTitle": "Marketing Communications Assistant", "company": {"name": "Moon Moments", "location": "East Los Angeles, CA"}, "location": "East Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Marketing and Sales", "industry": "Internet Publishing", "description": "Location: Santa Ana, CA<br/><br/>We are proud to be able to represent our client as a thriving company nestled in the heart of sunny California. They believe in creating meaningful connections with our audience while having a blast along the way. Their team is composed of fun-creative individuals who are constantly learning, growing, and pushing the boundaries of creativity.<br/><br/>Are you an enthusiastic and driven individual eager to dive into the world of marketing communications?<br/><br/>Are you excited to work with a vibrant team of like-minded professionals who are passionate about their craft?<br/><br/>If so, we have an opportunity you won't want to miss!<br/><br/>Marketing Communications Assistant<br/><br/>Your Role As a Marketing Communications Assistant, you'll be an essential part of the journey to success. You'll have the chance to gain hands-on experience in a variety of exciting projects, all while working alongside a group of enthusiastic professionals who are excited about what they do.<br/><br/>What You'll Do<br/><br/><ul><li>Collaborate on innovative marketing campaigns</li><li>Drive sales and upselling where possible directly with customers</li><li>Distributing product content that resonates with the audience</li><li>Provide general support to the team</li><li>Support event execution and promotion plans</li><li>Work closely with a dynamic team to brainstorm and execute fresh ideas<br/><br/></li></ul>What We're Looking For<br/><br/><ul><li>A passion for marketing and communications</li><li>Strong written and verbal communication skills</li><li>A creative mindset with an eye for detail</li><li>A team player who thrives in a collaborative environment</li><li>A desire to learn and grow in the industry<br/><br/></li></ul>Why Join The Team - At the company, you won't just be another cog in the machine. They value your unique perspectives and ideas, and we're committed to helping you develop your skills and reach your full potential. You'll be part of a fun, forward-thinking team in one of the most exciting cities in the world, where every day is a chance to create something special.<br/><br/>How to Apply - If you're ready to kick-start your marketing communications career and you're excited about working with a vibrant group of professionals, send your resume today.<br/><br/>Application Deadline -Don't wait! We're eager to meet you!<br/><br/>Powered by JazzHR<br/><br/>ffIu8LhCLi", "postedDate": "5 months ago", "skills": ["Marketing", "Communications", "Sales", "Event Planning", "Teamwork", "Creativity"], "url": "https://www.linkedin.com/jobs/view/3841513812"}