{"jobTitle": "House Manager", "company": {"name": "California State University, Northridge", "industry": "Higher Education", "size": "Not specified", "location": "Northridge, CA"}, "location": "Northridge, CA", "jobType": "Not specified", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$5,537.00/mo - $10,014.00/mo", "currency": "USD"}, "jobFunction": "Management and Manufacturing", "industry": "Higher Education", "description": "CSUN strives to be a destination workplace, where everyone understands that they belong to a community that is vital in advancing student success and providing exemplary service to all stakeholders. We foster an environment of success, both for our students and our employees. We have a relentless passion for celebrating diversity, equity, and inclusion as well as being an employer of choice. You will also have the opportunity to realize your own personal goals and be recognized for the work you do, and enjoy the unique value the CSUN community can offer. If this sounds like you, you’ve come to the right place. Learn more: https://www.csun.edu/about-csun. Major Duties Under the general direction of the Director, Audience Services, the House Manager serves as the primary Front-of-House (FOH) for all Soraya-presented events and Rental events held at The Soraya and its other venues (Plaza del Sol, Rehearsal Room, Gallery, etc). The incumbent oversees FOH operations before, during, and after each performance, including but not limited to prepping the venue for guests, greeting and seating patrons, assisting patrons who require help, and closing out the venue following performances. Completes a post-event report following every performance and event that summarizes and memorializes the activities of the event, any issues that arose in the event, and how they were resolved. Oversees the FOH hourly pooled staff of approximately 80 individuals including Ushers, Powered Cart Operators, Lead Ushers, and Senior Lead Ushers. Ensures consistently high levels of service, safety, and professionalism and assists with hiring, training, scheduling, and overseeing timesheets and timekeeping for all employees. Performs other duties as assigned. NOTE: To view the full position description including all of the required qualifications copy and paste this link into your browser: https://mycsun.box.com/s/aa58kyd6qlh836flklh5bioiicz5xf1f", "responsibilities": "Under the general direction of the Director, Audience Services, the House Manager serves as the primary Front-of-House (FOH) for all Soraya-presented events and Rental events held at The Soraya and its other venues (Plaza del Sol, Rehearsal Room, Gallery, etc). The incumbent oversees FOH operations before, during, and after each performance, including but not limited to prepping the venue for guests, greeting and seating patrons, assisting patrons who require help, and closing out the venue following performances. Completes a post-event report following every performance and event that summarizes and memorializes the activities of the event, any issues that arose in the event, and how they were resolved. Oversees the FOH hourly pooled staff of approximately 80 individuals including Ushers, Powered Cart Operators, Lead Ushers, and Senior Lead Ushers. Ensures consistently high levels of service, safety, and professionalism and assists with hiring, training, scheduling, and overseeing timesheets and timekeeping for all employees. Performs other duties as assigned.", "qualifications": {"required": "Equivalent to graduation from an accredited four-year college or university in a job-related field required. Equivalent to five (5) years of full-time, progressively responsible relevant experience. Three (3) years of experience in house management or customer service role is preferred. Oversight and administration of a program with supervision and/or lead experience.", "preferred": "Working knowledge of theatre etiquette and performing arts center customer service standards and protocols. Thorough knowledge of general practices, programs, and/or administrative specialty, and operational and fiscal analysis and techniques. Advanced knowledge of policies, procedures, and outside regulations pertaining to Performing Arts, Audience Services, House Management, and Theatre or related filed and programs."}, "skills": ["Excellent customer service skills", "Ability to effectively work crowd control", "Excellent verbal and written communication skills", "Flexibility and patience when interacting with others", "Ability to establish and maintain strong working relationships with colleagues, team supervisors, artists/artist management, rental clients, and patrons."], "postedDate": "5 months ago", "applicationDeadline": "Applications received through March 13, 2024, will be considered in the initial review and review of applications will continue until position is filled.", "benefits": "The university offers an excellent benefits package, including but not limited to: medical, dental, vision, retirement & savings, tuition waiver and more.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3841317991"}