{"jobTitle": "Accounting Associate, TV", "company": {"name": "Creative Artists Agency", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "25.00-30.00", "currency": "USD"}, "jobFunction": "Accounting/Auditing", "industry": "Entertainment Providers", "description": "<strong>Job Description<br/><br/></strong><strong>Who We Are <br/><br/></strong>Creative Artists Agency (CAA) is the leading entertainment and sports agency, with global expertise in filmed and live entertainment, digital media, publishing, sponsorship sales and endorsements, media finance, consumer investing, fashion, trademark licensing, and philanthropy. Distinguished by its culture of collaboration and exceptional client service, CAA’s diverse workforce identifies, innovates, and amplifies opportunities for the people and organizations that shape culture and inspire the world. The trailblazer of the agency business, CAA was the first to build a sports business, create an investment bank, launch a venture fund, found technology start-up companies, establish a philanthropic arm, build a business in China, and form a brand marketing services division, among other innovations. Named Most Valuable Sports Agency by Forbes for eight consecutive years, CAA represents more than 2,000 of the world’s top athletes in football, baseball, basketball, hockey, soccer, in addition to coaches, on-air broadcasters, and sports personalities and works in the areas of broadcast rights, corporate marketing initiatives, social impact, and sports properties for sales and sponsorship opportunities. Founded in 1975, CAA is headquartered in Los Angeles, and has offices in New York, Nashville, Memphis, Chicago, Miami, London, Munich, Geneva, Stockholm, Shanghai, and Beijing, among other locations globally.<br/><br/><strong>The Role<br/><br/></strong>We are seeking a professional to strengthen the accounting team. This position will be focused on various accounting tasks and will be responsible for providing accurate, timely accounting information to assist decision-making. This is a perfect opportunity for a professional who thrives in a fast-paced, dynamic accounting environment. <br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Match and apply cash receipts to payment lines on booking reports (i.e. cash receipt application) </li><li>Follow research procedures (i.e. reach out to studio/agent/business manager back-up) and resolve all cash receipts that have insufficient information or do not match the booking </li><li>Update bookings and client profiles for their cash receipts as needed </li><li>Attach supporting back-up documents to the payment lines they belong to </li><li>Correct misapplied receipts by carrying out process such as refunds or transferring funds </li><li>Work with team members to resolve held checks or other Trust accounting issues as needed in a timely manner </li><li>Trade and Release funds from escrow on the appropriate dates for escrow deals </li><li>Close paid in full bookings that meet certain criteria </li><li>Handle agent/client emails regarding cash receipt, processing corrections, reissues or if payment received </li><li>Coordinate activities with the other Trust Accounting teams </li><li>Perform other assigned tasks and duties necessary to support the Trust Account team </li><li>Escalate issues, as needed, to the responsible Trust Accounting Supervisor </li><li>Support system and process improvement projects <br/><br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor’s degree preferred; Must have 3+ years Finance/Accounting experience </li><li>Experience reconciling accounts, statements, etc. and resolving discrepancies </li><li>Entertainment experience is preferred </li><li>Strong interpersonal and communication skills </li><li>Ability to work well with a team and represent the culture of the company </li><li>Demonstrated ability to multitask and manage conflicting priorities </li><li>Ability to succeed in a fast paced, highly demanding, high volume, dynamic, corporate environment </li><li>Unimpeachable integrity and can be trusted to maintain confidential information </li><li>Must be proficient in Microsoft Office Suite </li><li>10-key by touch </li><li>Typing – 45 wpm min </li><li>Good organizational skills; able to multi-task </li><li>Will take initiative; ask for more work if needed<br/><br/><br/></li></ul><strong>Scope<br/><br/></strong>The scope of responsibility includes U.S. Trust Accounting for the TV department.<br/><br/><strong>Location<br/><br/></strong>This role is based out of the Los Angeles office; Hybrid.<br/><br/><strong>Compensation: </strong>The base hourly rate for this position is in the range of $25.00-$30.00. This position also is eligible for benefits and discretionary bonus. Ultimately, wages may vary based upon, but not limited to, relevant experience, time in role, business sector, and geographic location, among other criteria. Please talk with a CAA Recruiter to learn more.<br/><br/>Please provide complete and legible information. An incomplete application may affect your consideration for employment.<br/><br/>Creative Artists Agency, LLC (the “Company”) is committed to a policy of Equal Employment Opportunity and will not discriminate on the basis of race (inclusive of traits historically associated with race, including hair texture and protective hairstyles), color, religion, creed, gender or sex (including pregnancy, childbirth, breastfeeding or related medical conditions), national origin, ancestry, age, physical disability, mental disability, medical condition, genetic information, family and medical care leave status, military or veteran status, marital status, family status, sexual orientation, gender identity, gender expression, political affiliation, an employee’s or their dependent’s reproductive health decision making (e.g., the decision to use or access a particular drug, device or medical service), or any other characteristic protected by applicable law.<br/><br/>The Company also complies with the Americans with Disabilities Act and applicable state and local laws with regard to providing reasonable accommodation for qualified individuals with disabilities.<br/><br/>CAA does not accept unsolicited resumes from third-party recruiters unless they were contractually engaged by CAA to provide candidates for a specified opening. Any such employment agency, person or entity that submits an unsolicited resume does so with the acknowledgement and agreement that CAA will have the right to hire that applicant at its discretion without any fee owed to the submitting employment agency, person or entity.", "responsibilities": "<ul><li>Match and apply cash receipts to payment lines on booking reports (i.e. cash receipt application) </li><li>Follow research procedures (i.e. reach out to studio/agent/business manager back-up) and resolve all cash receipts that have insufficient information or do not match the booking </li><li>Update bookings and client profiles for their cash receipts as needed </li><li>Attach supporting back-up documents to the payment lines they belong to </li><li>Correct misapplied receipts by carrying out process such as refunds or transferring funds </li><li>Work with team members to resolve held checks or other Trust accounting issues as needed in a timely manner </li><li>Trade and Release funds from escrow on the appropriate dates for escrow deals </li><li>Close paid in full bookings that meet certain criteria </li><li>Handle agent/client emails regarding cash receipt, processing corrections, reissues or if payment received </li><li>Coordinate activities with the other Trust Accounting teams </li><li>Perform other assigned tasks and duties necessary to support the Trust Account team </li><li>Escalate issues, as needed, to the responsible Trust Accounting Supervisor </li><li>Support system and process improvement projects <br/><br/><br/></li></ul>", "qualifications": {"required": "Must have 3+ years Finance/Accounting experience, Experience reconciling accounts, statements, etc. and resolving discrepancies, Strong interpersonal and communication skills, Ability to work well with a team and represent the culture of the company, Demonstrated ability to multitask and manage conflicting priorities, Ability to succeed in a fast paced, highly demanding, high volume, dynamic, corporate environment, Unimpeachable integrity and can be trusted to maintain confidential information, Must be proficient in Microsoft Office Suite, 10-key by touch, Typing – 45 wpm min, Good organizational skills; able to multi-task, Will take initiative; ask for more work if needed", "preferred": "Bachelor’s degree"}, "skills": ["Microsoft Office Suite", "10-key", "Typing"], "postedDate": "2 weeks ago", "benefits": "This position also is eligible for benefits and discretionary bonus.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3843378099"}