{"jobTitle": "Manager, Paid Social", "company": {"name": "KINESSO", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$90,000.00/yr - $95,000.00/yr", "currency": "USD"}, "jobFunction": "Marketing and Advertising", "industry": "Advertising Services, Marketing Services, and Technology, Information and Media", "description": "<strong>Business Overview </strong><p>KINESSO is the technology-driven performance marketing agency that sits at the very heart of IPG Mediabrands, providing actionable growth for both our agency partners and clients. We turn 'action' into 'outcome' for our clients, leveraging our unique capabilities in optimization, analytics, AI, and experimentation. KINESSO has brought together the collective power of what was formerly Matterkind, Reprise, and Kinesso under one collective entity that will serve as the most powerful delivery engine in the industry. We have extensive offerings spanning across performance marketing and data and technology. Fueled by a deep understanding of consumer behavior, we offer an end-to-end engine of planning and optimization while also delivering on data-driven strategy for social platforms, actionable growth in e-commerce, and creating curated marketplaces specific to each client's function and needs. The company has more than 6,000 employees operating in more than 60 countries. Learn more at www.KINESSO.com.</p><p><br/></p><p><strong>Position Summary</strong></p><p>Who you are: A passionate and driven paid social professional, you excel at translating the digital strategy set at the senior level into daily tactical execution. You’re ready to challenge the norm to produce world-class paid social campaigns for high profile brands and take pride in your ability to clearly articulate the outcomes of the tactics and the strategy to the client as the day-to-day client lead. You thrive in a multi-functional role and enjoy training and coaching team members to ensure flawless tactical execution.</p><p><br/></p><p><strong>Responsibilities</strong></p><ul><li>Responsibilities will be across social media platforms such as Facebook, Instagram, Pinterest, SnapChat, Twitter, LinkedIn, TikTok and Reddit</li><li>Responsible for overseeing Paid Social Senior Specialists, Specialists and Associates on the team and owning their career development</li><li>Developing and overseeing optimizing, and maintaining paid social campaigns for clients, including coordination of assets between creative agencies and budget management</li><li>Developing, executing, and testing across campaign variables that create client-specific insight and feed future successions of testing</li><li>Maintaining and optimizing client campaigns to improve overall performance against pre-determined benchmarks on an ongoing basis</li><li>Understanding client goals and how to maximize those measures of success through tactical strategies and technologies</li><li>Brainstorming and researching new first to market ideas including new betas and opportunities with our partners.</li><li>Strong familiarity with 3rd-party tracking vendors and integrating with social platforms</li></ul><p> </p><p><strong>Required Skills &amp; Experience</strong></p><ul><li>Substantial experience in account management, planning, and/or performance media experience</li><li>Strong working understanding of the Paid Social platforms, including major players and supporting technology Facebook Ad Manager, Twitter Ads, etc.</li><li>Demonstrable experience working with multiple partners, on enterprise level paid social media accounts with diverse budget levels and objectives</li><li>Proven ability to understand high-level client goals and how they translate into paid media strategy when applied via online technologies</li><li>Ability to effectively communicate processes and tactics to clients, peers, and junior members of the team</li><li>Excellent written and verbal communication skills</li><li>KINESSO does not require candidates to have a college degree</li></ul><p> </p><p><strong>Desired Skills &amp; Experience</strong></p><ul><li>Agency experience strongly preferred</li><li>Detail and process oriented, with the ability to multitask and prioritize tasks based on client objectives</li><li>Time management skills</li></ul><p><br/></p><p><strong>We See You </strong> </p><p>At IPG Mediabrands, we are unified behind a commitment to fostering a culture of inclusion and belonging. Together, we shine through a set of shared values and behaviors. We take pride in our responsibility to our clients, communities, and to each other. We embrace differences and recognize the unique value that each of us brings to our community. </p><p>We encourage you to apply, as unique backgrounds, perspectives, and lived experiences are welcomed. </p><p>We See You at IPG Mediabrands. </p><p><br/></p><p><strong>Wage and Benefits</strong></p><p>We offer a Total Rewards package that includes medical and dental coverage, 401(k) plans, flex spending, life insurance, disability, employee discount program, employee stock purchase program and paid family benefits to support you and your family. To give you the ability to better meet your personal needs, and in support of your physical and emotional well-being, you will receive discretionary time off days and company-wide Appreciation Weeks and Wellness Days. </p><p>We also offer a competitive Total Compensation package, including a competitive salary and eligibility for an annual discretionary incentive award or a relevant incentive award. </p><p>The salary range for this position is posted below. Where an employee or prospective employee is paid within this range will depend on, among other factors, actual ranges for current/former employees in the subject position, market considerations, budgetary considerations, tenure and standing with the Company (applicable to current employees), as well as the employee’s/applicant’s skill set, level of experience, and qualifications. </p><p><br/></p><p><strong>Employment Transparency</strong></p><p>It is the policy of Mediabrands, division of the Interpublic group, to provide equal employment opportunities to all employees and applicants for employment without regard to race, color, ethnicity, gender, age, religion, creed, national origin, sexual orientation, gender identity, marital status, citizenship, genetic information, veteran status, disability, or any other basis prohibited by applicable federal, state, or local law. </p><p>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. </p><p>The employer will make reasonable accommodations in compliance with the American with Disabilities Act of 1990. The job description will be reviewed periodically as duties and responsibilities change with business necessity. Essential and other job functions are subject to modification. Reasonable accommodations may be provided to enable individuals with disabilities to perform the essential functions. </p><p>For applicants to jobs in the United States: In compliance with the current Americans with Disabilities Act and state and local laws, if you have a disability and would like to request an accommodation to apply for a position with Mediabrands, please email accommodation@mbww.com.</p><p><br/></p><p><strong>About IPG Mediabrands</strong> </p><p>IPG Mediabrands is the media and marketing solutions division of Interpublic Group (NYSE: IPG). IPG Mediabrands manages over $47 billion in marketing investment globally on behalf of its clients across its full-service agency networks UM, Initiative and Mediahub and through its award-winning specialty business units Healix, Kinesso, MAGNA, Mediabrands Content Studio, Orion Holdings, Rapport, and the IPG Media Lab. IPG Mediabrands clients include many of the world’s most recognizable and iconic brands from a broad portfolio of industry sectors including automotive, personal finance, consumer product goods (CPG), pharma, health and wellness, entertainment, financial services, energy, toys and gaming, direct to consumer and e-commerce, retail, hospitality, food and beverage, fashion and beauty. The company employs more than 18,000 diverse marketing communication professionals in more than 130 countries. Learn more at www.ipgmediabrands.com.</p>", "responsibilities": "<ul><li>Responsibilities will be across social media platforms such as Facebook, Instagram, Pinterest, SnapChat, Twitter, LinkedIn, TikTok and Reddit</li><li>Responsible for overseeing Paid Social Senior Specialists, Specialists and Associates on the team and owning their career development</li><li>Developing and overseeing optimizing, and maintaining paid social campaigns for clients, including coordination of assets between creative agencies and budget management</li><li>Developing, executing, and testing across campaign variables that create client-specific insight and feed future successions of testing</li><li>Maintaining and optimizing client campaigns to improve overall performance against pre-determined benchmarks on an ongoing basis</li><li>Understanding client goals and how to maximize those measures of success through tactical strategies and technologies</li><li>Brainstorming and researching new first to market ideas including new betas and opportunities with our partners.</li><li>Strong familiarity with 3rd-party tracking vendors and integrating with social platforms</li></ul>", "qualifications": {"required": "<ul><li>Substantial experience in account management, planning, and/or performance media experience</li><li>Strong working understanding of the Paid Social platforms, including major players and supporting technology Facebook Ad Manager, Twitter Ads, etc.</li><li>Demonstrable experience working with multiple partners, on enterprise level paid social media accounts with diverse budget levels and objectives</li><li>Proven ability to understand high-level client goals and how they translate into paid media strategy when applied via online technologies</li><li>Ability to effectively communicate processes and tactics to clients, peers, and junior members of the team</li><li>Excellent written and verbal communication skills</li><li>KINESSO does not require candidates to have a college degree</li></ul>", "preferred": "<ul><li>Agency experience strongly preferred</li><li>Detail and process oriented, with the ability to multitask and prioritize tasks based on client objectives</li><li>Time management skills</li></ul>"}, "skills": ["Paid Social", "Facebook", "Instagram", "Pinterest", "SnapChat", "Twitter", "LinkedIn", "TikTok", "Reddit", "Facebook Ad Manager", "Twitter Ads", "Account Management", "Planning", "Performance Media", "Client Management", "Campaign Optimization", "Budget Management", "Testing", "Analytics", "AI", "Experimentation", "Communication", "Team Leadership", "Training", "Coaching"], "postedDate": "11 hours ago", "benefits": "We offer a Total Rewards package that includes medical and dental coverage, 401(k) plans, flex spending, life insurance, disability, employee discount program, employee stock purchase program and paid family benefits to support you and your family. To give you the ability to better meet your personal needs, and in support of your physical and emotional well-being, you will receive discretionary time off days and company-wide Appreciation Weeks and Wellness Days. \nWe also offer a competitive Total Compensation package, including a competitive salary and eligibility for an annual discretionary incentive award or a relevant incentive award.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3843142202"}