{"jobTitle": "Buyer I", "company": {"name": "California State University, Los Angeles", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Entry level", "jobFunction": "Purchasing and Supply Chain", "industry": "Higher Education", "description": "Job No: 536443; 2/29/2024<br/><br/><strong>BUYER I<br/><br/></strong>Procurement and Contracts<br/><br/><strong>Salary Range</strong><strong>:</strong> $3700 - $6692/Monthly (Budgeted Hiring Salary Range $3700 - $4375/Monthly)<br/><br/><strong>Work Schedule</strong><strong>:</strong> Full-Time, Monday - Friday, 8:00 a.m. to 5:00 p.m.; Temporary appointment expires one-year from date of hire; may be extended one additional year; non-exempt classification.<br/><br/><strong>Essential Functions</strong><strong>:</strong> Under the direct supervision of the Director of Procurement &amp; Contracts, the Level I Buyer is tasked with overseeing daily routine and recurring procurement activities. The Buyer I handles the purchase of a diverse range of routine commodities and services, prepares purchase documents, and manages informal bids. This role involves evaluating literature and/or sales presentations, offering guidance to staff and faculty on procurement needs, and maintaining direct communication with vendors to address procurement issues and facilitate problem resolution. The incumbent also undertakes additional assigned duties, which may include some clerical tasks, to ensure the timely completion of all projects.<br/><br/><strong>Required Qualifications &amp; Experience</strong><strong>:</strong> Equivalent to a bachelor’s degree from an accredited four-year college or university. One year of purchasing experience as a buyer or buyer trainee. General knowledge of purchasing principles, practices, and procedures. Must possess the ability to: perform or learn campus routine purchasing, ordering, and contract processes; write specifications; follow processes; read and write clearly in English; analyze competitive bids; conduct business transactions; be sensitive to the needs of campus users; work independently; communicate well; and possess good phone etiquette. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.<br/><br/>California State University, Los Angeles, as part of the CSU system, is a State of California Employer. As such, the University requires all employees upon date of hire to reside in the State of California. As of January 1, 2022 the CSU Out-of-State Employment Policy prohibits the hiring of employees to perform CSU-related work outside the state of California.<br/><br/><strong>Desired Qualifications</strong><strong>:</strong> Peoplesoft experience and computer skills.<br/><br/><strong>Closing Date</strong><strong>:</strong> Review of applications will begin on March 14, 2024 and will continue until the position is filled; however, the position may close when an adequate number of qualified applications are received. A COMPLETED ON-LINE CAL STATE LA EMPLOYMENT APPLICATION IS REQUIRED. RESUMES WILL NOT BE ACCEPTED IN LIEU OF A COMPLETED APPLICATION.<br/><br/>The person holding this position is considered a \"mandated reporter\" under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 revised July 21, 2017, as a condition of employment.<br/><br/>In addition to meeting fully its obligations under federal and state law, California State University, Los Angeles is committed to creating a community in which a diverse population can live and work in an atmosphere of tolerance, civility and respect for the rights and sensibilities of each individual. To that end, all qualified individuals will receive equal consideration without regard to economic status, race, ethnicity, color, religion, disability, national origin or cultural background, political views, sex or sexual orientation, gender, or other personal characteristics or beliefs.<br/><br/>Candidates must demonstrate ability and/or interest in working in a multicultural/multiethnic environment. Certain positions require fingerprinting. The University actively encourages qualified minorities, women and persons with a disability to apply. Upon request, reasonable accommodation will be provided to individuals with protected disabilities to (a) complete the employment process and (b) perform essential job functions when this does not cause an undue hardship. We are an Equal Opportunity/Title IX Employer.<br/><br/><strong>To Obtain Employment Information For The Impaired Call<br/><br/></strong>TDD Line (323) 343-3670<br/><br/>24-hour Dial-A-Job Line (323) 343-3678", "responsibilities": "Under the direct supervision of the Director of Procurement &amp; Contracts, the Level I Buyer is tasked with overseeing daily routine and recurring procurement activities. The Buyer I handles the purchase of a diverse range of routine commodities and services, prepares purchase documents, and manages informal bids. This role involves evaluating literature and/or sales presentations, offering guidance to staff and faculty on procurement needs, and maintaining direct communication with vendors to address procurement issues and facilitate problem resolution. The incumbent also undertakes additional assigned duties, which may include some clerical tasks, to ensure the timely completion of all projects.", "qualifications": {"required": "Equivalent to a bachelor’s degree from an accredited four-year college or university. One year of purchasing experience as a buyer or buyer trainee. General knowledge of purchasing principles, practices, and procedures. Must possess the ability to: perform or learn campus routine purchasing, ordering, and contract processes; write specifications; follow processes; read and write clearly in English; analyze competitive bids; conduct business transactions; be sensitive to the needs of campus users; work independently; communicate well; and possess good phone etiquette. The incumbent must have a demonstrated interest and/or ability in working in a multicultural/multiethnic environment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who may apply for the position.", "preferred": "Peoplesoft experience and computer skills."}, "skills": ["Purchasing", "Procurement", "Contract Management", "Vendor Management", "Communication", "Problem Solving", "Microsoft Excel", "Peoplesoft"], "postedDate": "5 months ago", "salary": {"amount": "3700 - 6692/Monthly", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3843378158"}