{"jobTitle": "California Workers' Compensation Auditor", "company": {"name": "iMedX", "location": "Glendale, CA"}, "location": "Glendale, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Internet Publishing", "description": "iMedX is looking for a California Workers's Compensation Coding Auditor. This position requires proficiency in DRG-based auditing and a minimum of 5 years experience: at least 3 years of California workers' compensation production coding and 2 years of California workers' compensation auditing experience. Applications are being accepted for full-time status. This position is remote.<br/><br/><strong>PURPOSE<br/><br/></strong>The California Workers's Compensation Coding Auditor reviews client records to assure coders have assigned accurate and complete ICD-10-CM and PCS codes, in accordance with California regulations and the Official Guidelines for Coding and Reporting, and results in the appropriate DRG assignment. Qualified candidates must possess strong knowledge of California workers' compensation laws and statutes.<br/><br/>This position has a significant impact on overall company strategy in that, as a service organization, the company’s success is dependent upon the performance of our employees.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Performs coding quality and accuracy audits</li><li>Identifies and verifies the principal and secondary diagnoses based on Official Guidelines for Coding and Reporting</li><li>Identifies procedures based on OfficialCoding Guidelines and validates ICD-10-PCS codes</li><li>Validates the MS-DRG or other DRG for inpatient cases based on official guidelines</li><li>Reviews facility health records for accuracy and completeness of coding and DRG assignment, where applicable</li><li>Provides education to coders on proper utilization of facility guidelines, Official Coding Guidelines, and Coding Clinic advice</li><li>Performs coding audits in an efficient and productive manner utilizing good time management and professional work habits. Meets productivity standards for the position</li><li>Refers coding questions to a manager or designee in a timely manner for feedback and coding guideline development. Seeks assistance only after exhausting all resources</li><li>Continually enhances coding skills. Participates in coding roundtables, meetings, and educational conferences to ensure coding practice is up-to-date</li><li>Maintains confidentiality and safeguards the privacy of protected health information</li><li>Promote the company’s values</li><li>Perform other job-related duties as may be assigned or required<br/><br/></li></ul><strong>Qualifications &amp; Experience<br/><br/></strong><strong>Education:<br/><br/></strong><ul><li>High school diploma or GED certificate</li><li>Completion of a formal coding program with one of these coding credentials:Certified Coding Specialist (CCS), Registered Health Information Administrator (RHIA), Registered Health Information Technician (RHIT), or other AHIMA or AAPC approved coding credential<br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>Minimum of five (5) years ofCalifornia workers' compensation coding work experience</li><li>Two years of California workers' compensation coding review experience and coder education experience with working knowledge of the ICD-10-CM and CPT-4 coding systems</li><li>PC proficiency in word processing, spreadsheets, and database software</li><li>Daily communicationwith clients and supervisors, exhibiting adaptability, excellent customer service, and professional written and verbal communications skills<br/><br/></li></ul><strong>Other:</strong> A personal computer meeting the requirements of the position<br/><br/>iMedX is a Rapid Care Group company.<br/><br/>Powered by JazzHR<br/><br/>B3KbAKWrhx", "postedDate": "5 months ago", "qualifications": {"required": "Proficiency in DRG-based auditing, Minimum of 5 years experience: at least 3 years of California workers' compensation production coding and 2 years of California workers' compensation auditing experience, Strong knowledge of California workers' compensation laws and statutes", "preferred": "High school diploma or GED certificate, Completion of a formal coding program with one of these coding credentials:Certified Coding Specialist (CCS), Registered Health Information Administrator (RHIA), Registered Health Information Technician (RHIT), or other AHIMA or AAPC approved coding credential, Minimum of five (5) years ofCalifornia workers' compensation coding work experience, Two years of California workers' compensation coding review experience and coder education experience with working knowledge of the ICD-10-CM and CPT-4 coding systems, PC proficiency in word processing, spreadsheets, and database software, Daily communicationwith clients and supervisors, exhibiting adaptability, excellent customer service, and professional written and verbal communications skills"}, "skills": ["DRG", "Auditing", "ICD-10-CM", "PCS", "California Workers' Compensation", "Coding", "CPT-4", "MS-DRG", "Coding Clinic", "Time Management", "Customer Service", "Communication", "PC Proficiency", "Word Processing", "Spreadsheets", "Database Software"], "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3843591826"}