{"jobTitle": "After School Program Leader: Part-Time, South LA", "company": {"name": "After-School All-Stars, Los Angeles", "industry": "Education Management", "size": "Not specified", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$20.50", "currency": "USD"}, "jobFunction": "Education and Training", "industry": "Education Management", "description": "The Program Leader will assist in providing leadership and support in academic, cultural and recreational enrichment. Under the direct supervision of the ASAS-LA Program Coordinator, the Program Leader will provide a safe environment that educates, enlightens and inspires youth in a school setting.", "responsibilities": "Lead and assist in planning (prep time) & implementation of the daily after-school program under the direction of a Program Coordinator. Maintain a 20:1 ratio using dynamic student recruitment and retention strategies. Lead and assist in preparing a creative environment using academic, cultural and recreational enrichment including the preparation of needed supplies and materials. Use age appropriate methods that include youth development principles. Supervise students in the activity areas. Maintain professional attitude, rapport and appearance with all program stakeholders. Communicate with school staff, parents and other family members regarding program activities, student needs academic performance and events. Attend all required staff meetings and trainings. Escort/supervise youth to ASAS-LA field trips and events. Responsible for the distribution of supper/snack and daily attendance tracking. Availability to work evenings and weekends if necessary. Willing to travel off-site meetings, trainings and events. To perform other duties as assigned.", "qualifications": {"required": "Must be 18 years of age. Must have obtained high school graduate or GED, have an Associates Degree, or have 60 completed college units or have successfully passed ASAS-LA Instructional Aide exam. Criminal record clearance by being fingerprinted prior to working with youth. Clearance of TB Test within 60 days of hire. Physical ability to lead and participate in structured activities.", "preferred": "Fluency in a language other than English highly desirable."}, "skills": ["Experience working with students in grades K-12 in recreational, educational and/or community youth outreach setting.", "Ability to work cooperatively and collaboratively with School District staff, parents and community leaders.", "Familiarity with quality criteria for after school programs.", "Ability to communicate effectively and demonstrate sensitivity to others as well as respond to critical incidents and act swiftly in an emergency situation.", "CPR and First Aid Certifications."], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Not specified", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3844617225"}