{"jobTitle": "Sales Associate", "company": {"name": "Foot Locker", "industry": "Retail", "size": "Large", "location": "Torrance, CA"}, "location": "Torrance, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Entry level", "salary": {"amount": "$17.00", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Overview\n\nYou recognize yourself when you enter one of our stores. You love to talk about athletic sneakers and apparel as much as you love to collect them. You always scope out the latest styles, and enjoy sharing your enthusiasm with Customers. It’s easy for you to start up natural, friendly conversations, adapt to different types of Customers, and resolve issues with a smile. You like to work as part of a team as you improve your individual skills on the sales floor. Your success in this role will be measured through personal and productivity goals plus your ability to provide a great in-store experience to every Customer.", "responsibilities": "Ensuring high levels of customer satisfaction by being knowledgeable on all products offered, and teaming up with co-workers to provide excellent sales service. Delivering sales, outstanding customer experience, and operational expectations. Maintaining personal and productivity goals. Connects with every customer by asking open-ended questions to assess needs. Ability to learn and share expertise of products and trends to fit customer’s needs. Maintains an awareness of all product knowledge, and current or upcoming product / trends. Contributes to a positive and inclusive work environment.", "qualifications": {"required": "0-3 year of retail experience. Confident and comfortable engaging customers to deliver an elevated experience. Motivated to achieve great results because of one's enthusiasm from interacting with customers and athletic products. Initiates completion of tasks or activities without necessary supervision. Flexible availability – including nights, weekends, and holidays.", "preferred": ""}, "skills": [], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Rate of Pay: $17.00 / hour", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3846333522"}