{"jobTitle": "Sales Account Executive – International Logistics", "company": {"name": "Laufer Group International", "location": "Long Beach, CA"}, "location": "Long Beach, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "80,000-120,000", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Internet Publishing", "description": "Headquartered in New York withanother 7 offices in the United States and dedicated partners strategically located throughout the world, Laufer Group International has the expertise, resources, and market knowledge to provide customers with true global logistics solutions. Laufer has an established logistics and service solution that provides customers with improved shipping flexibility, enhanced operational control, and exceptional customer service. Each customer has access to a customized logistics platform providing air freight and ocean services, logistics, customs brokerage, and purchase order and export management.<br/><br/>Laufer is a different type of logistics company. We strive to make our industry more progressive. We challenge conventional ways of doing business by developing innovative and customized supply chain solutions. We help our customers break away from yesterday's business model to succeed in today's world.<br/><br/><strong>Position Summary: <br/><br/></strong>The Sales Account Executive maintains and grows relationships with assigned customers while achieving an assigned sales and revenue goals. Reporting to the local Branch Manager, the Sales Account Executive is expected to retain existing business, expand the firm’s market share for each assigned customer, introduce and promote new products and services to assigned customer accounts, develop new relationships and increase Laufer’s market share in the territory.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Retain customer volume, sales and profitability through proactive stewardship of the firm’s relationships with assigned customers</li><li>Penetrate and expand relationships and revenue potential with assigned accounts by:</li><ul><li>Selling new or additional products or services to current buyers; and/or</li><li>Finding additional buyers and stakeholders within the existing customer location; and/or</li><li>Selling additional customer locations</li></ul><li>Sell and support the full suite of the firm’s product and service offerings</li><li>Develop and manage robust pipeline of new opportunities to help increase Laufer’s market share in the territory</li><li>Support and actively participate in all aspects of the sales process, and calling upon others to assist in solution development and proposal delivery, as needed, or as directed by management</li><li>Direct joint customer planning efforts in assigned accounts</li><li>Proactively manage customer satisfaction and service delivery by anticipating potential service problems, monitoring satisfaction, and recommending process and delivery improvements</li><li>Assist other sales team members, when directed, with customers outside the assigned account base when required</li><li>Support and manage assigned customer transition from the Business Development Group during customer implementation</li><li>Design, manage, and deliver Quarterly Business Reviews, in collaboration with other internal stakeholders, to assigned customers</li><li>Insure all assigned customer’s pricing, RFP responses, and bids are completed and delivered accurately and timely</li><li>Support SOP creation, management, updating and adherence for assigned customers</li><li>Travel when necessary within region to branch offices, customer field offices, and assigned customers to help accomplish assigned customer objectives<br/><br/></li></ul><strong>Accountabilities and Performance Measures</strong>:<br/><br/><ul><li>Achieves assigned sales and revenue budgets</li><li>Meets assigned expectations for profitability</li><li>Achieves customer retention and growth targets</li><li>Maintains high customer satisfaction ratings that meet company standards</li><li>Completes required training and development objectives within the assigned time frame<br/><br/></li></ul><strong>Alignment: <br/><br/></strong><ul><li>Reports to the local Branch Manager</li><li>Enlists the support of sales specialists, implementation resources, service resources, and other sales and management resources as needed</li><li>Works closely with the Customer Service Team members to ensure customer satisfaction and problem resolution</li><li>This position has no direct reports<br/><br/></li></ul><strong>Requirements:<br/><br/></strong><ul><li>Minimum 3 years of freight forwarding sales experience<br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Medical, Dental, and Vision Benefits with company cost-sharing</li><li>Health Savings Account medical benefit option with a company contribution to the health savings account</li><li>No cost Medical Bridge Program to assist with costs that may be attributable to the plan deductible</li><li>Medical and Dependent Care Flexible Spending Accounts</li><li>No cost Short-term disability, Long-term disability, Life, and AD&amp;D insurance</li><li>401(k) Retirement Plan with a generous company match</li><li>Paid Time Off (over 4 weeks of PTO by year 5 with Laufer)</li><li>No cost Employee Assistance Plan to assist with emotional well-being, family and relationships, legal and financial matters, and more</li><li>Employee Recognition Program</li><li>Giveback Program – each employee is given $500/year to donate to a charity (Laufer has donated over $1 million!!!)</li><li>Commuter Benefits for employees traveling to and from the NYC office<br/><br/></li></ul>Salary range: $80,000-120,000 depending on experience.<br/><br/>INDHP<br/><br/>Please click here for information on the privacy policy for California residents.<br/><br/>Powered by JazzHR<br/><br/>kMeukCdKnc", "responsibilities": "The Sales Account Executive maintains and grows relationships with assigned customers while achieving an assigned sales and revenue goals. Reporting to the local Branch Manager, the Sales Account Executive is expected to retain existing business, expand the firm’s market share for each assigned customer, introduce and promote new products and services to assigned customer accounts, develop new relationships and increase Laufer’s market share in the territory.", "qualifications": {"required": "Minimum 3 years of freight forwarding sales experience"}, "skills": [], "postedDate": "5 months ago", "benefits": "Medical, Dental, and Vision Benefits with company cost-sharing\nHealth Savings Account medical benefit option with a company contribution to the health savings account\nNo cost Medical Bridge Program to assist with costs that may be attributable to the plan deductible\nMedical and Dependent Care Flexible Spending Accounts\nNo cost Short-term disability, Long-term disability, Life, and AD&amp;D insurance\n401(k) Retirement Plan with a generous company match\nPaid Time Off (over 4 weeks of PTO by year 5 with Laufer)\nNo cost Employee Assistance Plan to assist with emotional well-being, family and relationships, legal and financial matters, and more\nEmployee Recognition Program\nGiveback Program – each employee is given $500/year to donate to a charity (Laufer has donated over $1 million!!!)\nCommuter Benefits for employees traveling to and from the NYC office", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3846616739"}