{"jobTitle": "Intake Center Supervisor", "company": {"name": "Wise & Healthy Aging", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Health Care Provider", "industry": "Civic and Social Organizations", "description": "The Intake Center Supervisor will supervise the day-to-day operations of the Long-Term Care Ombudsman Program Central Intake Department by providing oversight of the intake team who are tasked with triaging incoming calls/inquiries from a variety of sources directed to the LTC Ombudsman program and its regional offices. The Supervisor ensures quality control by maintaining intake tracking, reporting, and documentation, and trains and supervises the intake team. The Supervisor will ensure that data is accurately inputted and handle the reporting for program performance management and reports to funders.<br/><br/><ul><li>PRIMARY RESPONSIBILITIES: </li><li>Ensure that Intake Team (e.g., Coordinators/Specialists) are reviewing changes and/or errors in source documents as appropriate.</li><li>Supervise the process of intakes and review and recommend improvements as needed.</li><li>Generate reports for Ombudsman funding sources as required, meeting all prescribed deadlines.</li><li>Ensure that data is accurately inputted and handle the reporting for program performance management and reports to funders.</li><li>Collaborate with Regional Managers and other colleagues on best practices and intake process improvements.</li><li>Provide back-up to Coordinators when needed.</li><li>Assists in the performance review process, recruitment, and training of all direct reports.</li><li>Utilize knowledge of the Ombudsman role to ensure the best intake services.</li><li>Apply knowledge of services and resources available to Older Adults and answer questions that may arise through calls.</li><li>ESSENTIAL JOB FUNCTIONS: </li><li>Ability to directly supervisor staff including training, performance coaching, morale building, development and disciplinary actions as needed.</li><li>Ability to oversee the Intake process and make changes/improvements as needed. </li><li>Ability to analyze and synthesis data to make sound recommendations.</li><li>Able to sit at desk and using a computer keyboard at the office. </li><li>Ability to lift to 25 pounds</li><li>Ability to interact with the public and maintain a professional composure</li><li>POSITION QUALIFICATIONS:</li></ul><li> Education – High school diploma required. Bachelor’s degree in human services, social services, or related field preferred.</li><li>Experience</li><ul><li>A minimum of five (5) years of work experience in a fast-paced environment with prior experience supervising staff and/or volunteers.</li><li>A minimum of two years’ work experience in social services, community outreach, and customer service, preferably with senior programs, including senior centers and/or multipurpose centers.</li><li>A minimum of two years of experience in database management and data collection</li><li>Strong writing and communication skills, including the ability to build relationships</li><li>Ability to independently plan, streamline processes, and carry out assignments</li><li>Other</li><li>Self-starter with a professional demeanor with a positive attitude, flexible, adaptable with exemplary customer service skills</li><li>Strong proficiency with Microsoft Office software programs (Word, Excel, PowerPoint, and Outlook)</li><li>Excellent written and verbal communication skills with the ability to prioritize workload</li><li>Detail-oriented with the ability to handle multiple tasks and answer busy phones efficiently and pleasantly</li><li>Excellent judgment while working with callers</li><li>Successful clearance of a criminal background check</li><li>Valid driver’s license and proof of auto insurance</li><li>Complete Health Screening (includes proof of TB clearance).<br/><br/></li></ul><strong>Benefits &amp; Compensation<br/><br/></strong>We offer competitive salaries and comprehensive benefits: 80% company-paid medical, 100% company-paid dental, 401(k) plan with competitive employer match, Flexible Spending Account (FSA), optional life and vision insurance, 11 paid holidays plus paid time-off (PTO) and mileage reimbursement.<br/><br/>This position is located at the corporate office of WISE &amp; Healthy Aging located in Santa Monica, California but may also work from other Regional offices as needed.<br/><br/>Don’t see a specific job that matches your qualifications? Please fill out the general application as we are always looking to hire new talent to join the Wise &amp; Healthy Aging team!", "responsibilities": "Ensure that Intake Team (e.g., Coordinators/Specialists) are reviewing changes and/or errors in source documents as appropriate.Supervise the process of intakes and review and recommend improvements as needed.Generate reports for Ombudsman funding sources as required, meeting all prescribed deadlines.Ensure that data is accurately inputted and handle the reporting for program performance management and reports to funders.Collaborate with Regional Managers and other colleagues on best practices and intake process improvements.Provide back-up to Coordinators when needed.Assists in the performance review process, recruitment, and training of all direct reports.Utilize knowledge of the Ombudsman role to ensure the best intake services.Apply knowledge of services and resources available to Older Adults and answer questions that may arise through calls.", "qualifications": {"required": "High school diploma required. Bachelor’s degree in human services, social services, or related field preferred.A minimum of five (5) years of work experience in a fast-paced environment with prior experience supervising staff and/or volunteers.A minimum of two years’ work experience in social services, community outreach, and customer service, preferably with senior programs, including senior centers and/or multipurpose centers.A minimum of two years of experience in database management and data collectionStrong writing and communication skills, including the ability to build relationshipsAbility to independently plan, streamline processes, and carry out assignmentsSelf-starter with a professional demeanor with a positive attitude, flexible, adaptable with exemplary customer service skillsStrong proficiency with Microsoft Office software programs (Word, Excel, PowerPoint, and Outlook)Excellent written and verbal communication skills with the ability to prioritize workloadDetail-oriented with the ability to handle multiple tasks and answer busy phones efficiently and pleasantlyExcellent judgment while working with callersSuccessful clearance of a criminal background checkValid driver’s license and proof of auto insuranceComplete Health Screening (includes proof of TB clearance).", "preferred": ""}, "skills": ["Microsoft Office", "Customer Service", "Data Management", "Communication", "Supervising"], "postedDate": "5 months ago", "benefits": "We offer competitive salaries and comprehensive benefits: 80% company-paid medical, 100% company-paid dental, 401(k) plan with competitive employer match, Flexible Spending Account (FSA), optional life and vision insurance, 11 paid holidays plus paid time-off (PTO) and mileage reimbursement.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3846203087"}