{"jobTitle": "Temporary Operations Associate, Westwood, #659", "company": {"name": "Gopuff", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Temporary", "employmentType": "Temporary", "experienceLevel": "Entry level", "jobFunction": "Management and Manufacturing", "industry": "Software Development", "description": "Gopuff is looking for **Operations Associates (OAs)** to join the operations team. Directly reporting to a Site Leader, OAs play an essential role at Gopuff that requires drive, perseverance, positivity, and enthusiasm for the challenge. You will accomplish a variety of operations responsibilities including picking, packing, receiving product both within our site and accompanying kitchen (if applicable), and working with our partner drivers. This is a temporary position with the opportunity to be converted to permanent employment based on tenure and performance.<br/><br/>Customers turn to Gopuff to provide their everyday essentials—day and night, rain or shine. We're assembling a team of thinkers, dreamers and risk takers who are ready to help us reshape the world of retail faster than ever before. And it doesn't hurt if you like snacks.<br/><br/>**Responsibilities:**<br/><br/><ul><li>Pick and pack items for dispatch to customers</li><li>Receive and unpack pallets of product from vendors, ensure physical inventory count matches purchase order/invoice, and resolve discrepancies</li><li>Manage inventory and re-shelving of canceled orders</li><li>Clean and organize sales floor and overall facility</li><li>Manage waste and spoilage through strict compliance with FIFO practice</li><li>Contact customer for substituted or out-of-stock items</li><li>Handle, scan and move product in a safe and well-organized manner</li><li>Stand, push, pull, squat, bend, reach and walk during shifts</li><li>Use carts, pallet jacks, dollies and other equipment to move product</li><li>Handle products that may contain tobacco, nicotine, and/or alcohol</li><li>Work in freezer locations periodically throughout shifts</li><li>Capability to walk several flights of steps periodically throughout the day</li><li>Prepare quality beverages and food menu items for all customers by observing all recipes and presentation standards</li><li>Ensure accuracy of all food and beverage packaged for delivery</li><li>Follow health, safety and sanitation guidelines for all products</li><li>Receive and put away order/invoice, and resolve discrepancies when they do not match expiration requirements</li><li>Maintain Kitchen Facility organization and standards to ensure resources can be accessed while managing waste and spoilage through mindful pouring and food preparation</li><li>Prepare, package and stage/handoff orders<br/><br/></li></ul>**Qualifications:**<br/><br/><ul><li>High School Diploma or GED Equivalent</li><li>Experience working in a restaurant or retail environment (preferred, not required)</li><li>The ability to work a fluid schedule and be available during peak shifts (1st, 2nd, 3rd shifts)</li><li>General working knowledge of basic web-based software applications (e.g. Google G-Suite)</li><li>Stand and walk for the duration of an assigned shift</li><li>Lift up to 49 pounds</li><li>Available to work flexible hours that may include mornings, evenings, weekends, nights and holidays<br/><br/></li></ul>**Pay**<br/><br/><ul><li>$15.96/hr <br/><br/></li></ul>At Gopuff, we know that life can be unpredictable. Sometimes you forget the milk at the store, run out of pet food for Fido, or just really need ice cream at 11 pm. We get it—stuff happens. But that’s where we come in, delivering all your wants and needs in just minutes.<br/><br/>And now, we’re assembling a team of motivated people to help us drive forward that vision to bring a new age of convenience and predictability to an unpredictable world.<br/><br/>Like what you’re hearing? Then join us on Team Blue.<br/><br/><em>Gopuff is an equal employment opportunity employer, committed to an inclusive workplace where we do not discriminate on the basis of race, sex, gender, national origin, religion, sexual orientation, gender identity, marital or familial status, age, ancestry, disability, genetic information, or any other characteristic protected by applicable laws. We believe in diversity and encourage any qualified individual to apply.</em>", "responsibilities": "Pick and pack items for dispatch to customers\nReceive and unpack pallets of product from vendors, ensure physical inventory count matches purchase order/invoice, and resolve discrepancies\nManage inventory and re-shelving of canceled orders\nClean and organize sales floor and overall facility\nManage waste and spoilage through strict compliance with FIFO practice\nContact customer for substituted or out-of-stock items\nHandle, scan and move product in a safe and well-organized manner\nStand, push, pull, squat, bend, reach and walk during shifts\nUse carts, pallet jacks, dollies and other equipment to move product\nHandle products that may contain tobacco, nicotine, and/or alcohol\nWork in freezer locations periodically throughout shifts\nCapability to walk several flights of steps periodically throughout the day\nPrepare quality beverages and food menu items for all customers by observing all recipes and presentation standards\nEnsure accuracy of all food and beverage packaged for delivery\nFollow health, safety and sanitation guidelines for all products\nReceive and put away order/invoice, and resolve discrepancies when they do not match expiration requirements\nMaintain Kitchen Facility organization and standards to ensure resources can be accessed while managing waste and spoilage through mindful pouring and food preparation\nPrepare, package and stage/handoff orders", "qualifications": {"required": "High School Diploma or GED Equivalent", "preferred": "Experience working in a restaurant or retail environment"}, "skills": ["Google G-Suite"], "postedDate": "6 months ago", "salary": {"amount": "15.96", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3846148674"}