{"jobTitle": "Retail Store Manager II, South Orange County", "company": {"name": "Gopuff", "location": "Orange County, CA"}, "location": "Orange County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Sales and Business Development", "industry": "Software Development", "description": "The Store Manager motivates and inspires the team to achieve store productivity goals. They will do this by analyzing business and market trends as well as historical data to create strategies to drive top line sales. They will lead a team including Assistant Manager, Head Clerks, Receiving Manager, and Sales employees; as well as manage payroll budgets and store controlled expenses to ensure the store's contribution is on target.<br/><br/><strong>Key Roles And Responsibilities<br/><br/></strong><ul><li>Assumes overall responsibility for the store</li><li>Consistently creates a welcoming environment for the customer by greeting and assisting and as well as quickly responding to customer inquiries and needs</li><li>Demonstrates desired behaviors for staff including driving sales, handling difficult and/or complicated sales, cash management, inventory, and follow-up with customers</li><li>Maintains a strong leadership presence in store, while ensuring that all customers receive exceptional service</li><li>Ensures company standards are met for store and associate appearance at all times</li><li>Prioritizes, plans, and adjusts schedules as necessary to maximize sales</li><li>Consistently reviews payroll, ensuring appropriate staff levels at all times</li><li>Plans, coordinates, and executes all merchandising direction, campaigns, and sales promotions in a timely manner</li><li>Coaches team in the moment, providing consistent and constructive feedback</li><li>Utilizes company tools to diagnose opportunities and develops action plans to improve performance</li><li>Ensures staff is trained and knowledgeable in customer service, merchandise and operations</li><li>Manages and assesses staff performance through consistent feedback, coaching, developmental plans, and performance appraisals</li><li>Forecasts/reforecast business, focusing on productivity to meet sales goals</li><li>Enforce all company policies and procedures, including health, safety, and security</li><li>Manages store controlled expenses to budget, identifying opportunities to increase contribution</li><li>Manages and controls shrink</li><li>Regularly communicates with District Manager to discuss strengths, opportunities, and trends in business</li><li>Identifies opportunities to drive traffic into the store through community events (weddings, parties, etc.)</li><li>Partner with corporate office personnel to increase sales, drive/promote merchandise categories, and expand markets</li><li>Creates customer loyalty and creates relationships within local community</li><li>Ensures all pricing, signage, and displays are correct at all times</li><li>Receives regular vendor deliveries and stock sales floor in a timely manner</li><li>Responsible for monitoring inventory stock levels<br/><br/></li></ul><strong>Skills Required<br/><br/></strong><ul><li>Financial and Business Acumen: Ability to evaluate financial and business indicators and translate data into actionable information to drive results</li><li>Problem Solving &amp; Decision Quality: Able to use rigorous logic and methods to solve problems with effective solutions</li><li>Relationship Management: Able to build constructive and effective relationships</li><li>Ability to influence at all levels, as well as a demonstrated ability to work effectively within a team and be assertive in driving successful management strategies</li><li>Influencing and Negotiation: Can present ideas and directions that lead others to action</li><li>Planning and Priority Setting: Demonstrate an ability to set objectives and goals and organize work appropriately to meet and exceed goals. Possess strong organizational and time management skills</li><li>Demonstrates strong listening, written and oral communication skills<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>3-5 years experience in retail store management</li><li>Strong verbal and written communications skills</li><li>Must be an excellent organizer and problem solver with strong project management skills</li><li>Possess strong interpersonal skills to communicate with confidence to both internal and external customers<br/><br/></li></ul><strong>Pay<br/><br/></strong><ul><li>Gopuff/Bevmo! pays employees based on market pricing and pay may vary depending on your location. Compensation for U.S. locations is based on a cost of labor index for that geographic area. </li><li>Orange County, CA: $54,000 - $90,600</li><li>The salary range above reflects what we’d reasonably expect to pay candidates. A candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future. For additional information on this role’s compensation package, please reach out to the designated recruiter for this role. <br/><br/></li></ul><strong>At Gopuff, we know that life can be unpredictable.</strong> Sometimes you forget the milk at the store, run out of pet food for Fido, or just really need ice cream at 11 pm. We get it—stuff happens. But that’s where we come in, delivering all your wants and needs in just minutes.<br/><br/>And now, we’re assembling a team of motivated people to help us drive forward that vision to bring a new age of convenience and predictability to an unpredictable world.<br/><br/>Like what you’re hearing? Then join us on Team Blue.<br/><br/><em>Gopuff is an equal employment opportunity employer, committed to an inclusive workplace where we do not discriminate on the basis of race, sex, gender, national origin, religion, sexual orientation, gender identity, marital or familial status, age, ancestry, disability, genetic information, or any other characteristic protected by applicable laws. We believe in diversity and encourage any qualified individual to apply.</em>", "responsibilities": "The Store Manager motivates and inspires the team to achieve store productivity goals. They will do this by analyzing business and market trends as well as historical data to create strategies to drive top line sales. They will lead a team including Assistant Manager, Head Clerks, Receiving Manager, and Sales employees; as well as manage payroll budgets and store controlled expenses to ensure the store's contribution is on target.", "qualifications": {"required": "3-5 years experience in retail store management, Strong verbal and written communications skills, Must be an excellent organizer and problem solver with strong project management skills, Possess strong interpersonal skills to communicate with confidence to both internal and external customers", "preferred": ""}, "skills": ["Financial and Business Acumen", "Problem Solving & Decision Quality", "Relationship Management", "Influencing and Negotiation", "Planning and Priority Setting", "Communication"], "postedDate": "6 months ago", "benefits": "Gopuff/Bevmo! pays employees based on market pricing and pay may vary depending on your location. Compensation for U.S. locations is based on a cost of labor index for that geographic area.", "remoteWork": "No", "salary": {"amount": "54,000 - 90,600", "currency": "USD"}, "url": "https://www.linkedin.com/jobs/view/3846149356"}