{"jobTitle": "Showing Assistant/Buyer's Agent", "company": {"name": "PLACE", "industry": "Real Estate", "size": "Not specified", "location": "Hesperia, CA"}, "location": "Hesperia, CA", "jobType": "Not specified", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "$85,000.00/yr - $135,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Real Estate", "description": "Elevate your career by joining our elite team as a Buyers Agent, where you'll collaborate with the top 20% of real estate professionals in North America. We provide a powerful platform for your success, complete with proven strategies, cutting-edge systems, and essential tools, all backed by thorough coaching and training in an accountability-focused environment. Your dedication and ambition will fuel your professional growth with us. In addition to outstanding career advancement opportunities, you'll benefit from revenue sharing, health benefits, extensive growth share options, and pathways to vesting and investment.", "responsibilities": "Execute PLACE lead generation systems weekly, Conduct two open houses monthly, Convert prospecting and lead generation activities to appointments, Participate in weekly script practice per team standards, Participate in team activities per team standards, Commit to weekly 1:1 coaching session, weekly trainings, and Partner Call, Consult with buyers, convert with signed buyer agreements and identify homes, Write and negotiate offers on behalf of your buyers, Track activities and clients with PLACE Technology", "qualifications": {"required": "Licensed real estate professional, Strong written and verbal communication skills, Learning based, growth-minded, Organized, Willingness to learn scripts and dialogues, Excellent time management skills, Industry experience preferred", "preferred": "Team player, Intrinsically motivated sales professional with a competitive spirit, Excellent at building rapport, listening to the needs of others and identifying solutions, Prospecting and lead generation are your strength zones, Overcoming objections comes naturally, Strong communicator and committed to service."}, "skills": ["Real Estate", "Sales", "Communication", "Time Management", "Teamwork"], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Revenue sharing, health benefits, extensive growth share options, pathways to vesting and investment.", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3849736985"}