{"jobTitle": "Showing Assistant", "company": {"name": "PLACE", "location": "Hesperia, CA"}, "location": "Hesperia, CA", "jobType": "Full-time", "employmentType": "Contract", "experienceLevel": "Entry level", "salary": {"amount": "75,000.00/yr - 125,000.00/yr", "currency": "USD"}, "jobFunction": "Administrative", "industry": "Real Estate", "description": "<strong>Summary<br/><br/></strong><strong>Job Description<br/><br/></strong><strong>Join Our Elite Team As a Showing Assistant<br/><br/></strong>Take advantage of an exceptional opportunity to collaborate with the top 20% of real estate professionals in North America by becoming a part of our vibrant team. As a Showing Assistant, you will embark on a path of professional growth, supported by a detailed success plan that includes state-of-the-art models, systems, tools, mentorship, and a wide array of educational programs. Our strong accountability structure ensures you achieve your objectives.<br/><br/>Your commitment and drive are essential. This role not only paves the way for limitless career advancement but also offers benefits such as revenue sharing, comprehensive health insurance, growth share, and opportunities for vesting and investment.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Graduate from PLACE New Agent Launch </li><li>Work with sales agent to guide their clients to homes</li><li>Provide detailed, written feedback to confirm or refine clients’ search criteria</li><li>Write and negotiate offers on behalf of the sales agent and clients</li><li>Lead generate a minimum of 10 hours a week</li><li>Participate in weekly script practice per team standards</li><li>Participate in team activities per team standards</li><li>Commit to weekly 1:1 coaching session, weekly trainings and Partner Call</li><li>Track tasks and activities in PLACE Technology<br/><br/></li></ul><strong>Qualifications<br/><br/></strong>You are energized by working with people and pride yourself in your ability to develop and maintain professional relationships. You have a compelling desire to support others, while being committed to your growth in real estate and leadership skills.<br/><br/><ul><li>People oriented</li><li>Positive, happy attitude</li><li>Ability to spend a large amount of time driving in their car</li><li>Ability to analyze clients’ needs and wants and match them to homes</li><li>Learning based</li><li>Ambitious with proven ability to succeed</li><li>High school graduate</li><li>Real estate license<br/><br/></li></ul><strong>About-our-team<br/><br/></strong>We are powered by PLACE, a broker-agnostic business services and technology platform transforming the industry for top agents and their customers. Join and gain in-house marketing and design services, daily live professional development opportunities, superior technology that eliminates up to 75% of daily tasks, and more. We invest in your future by providing opportunities for personal and professional growth, so you can dream bigger while gaining exponential leverage and success within our powered by PLACE team.", "responsibilities": "Graduate from PLACE New Agent Launch \nWork with sales agent to guide their clients to homes\nProvide detailed, written feedback to confirm or refine clients’ search criteria\nWrite and negotiate offers on behalf of the sales agent and clients\nLead generate a minimum of 10 hours a week\nParticipate in weekly script practice per team standards\nParticipate in team activities per team standards\nCommit to weekly 1:1 coaching session, weekly trainings and Partner Call\nTrack tasks and activities in PLACE Technology", "qualifications": {"required": "People oriented\nPositive, happy attitude\nAbility to spend a large amount of time driving in their car\nAbility to analyze clients’ needs and wants and match them to homes\nLearning based\nAmbitious with proven ability to succeed\nHigh school graduate\nReal estate license"}, "skills": [], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "", "remoteWork": "", "url": "https://www.linkedin.com/jobs/view/3849737816"}