{"jobTitle": "Director, Materials Management", "company": {"name": "AHMC HealthCare", "location": "Anaheim, CA"}, "location": "Anaheim, CA", "jobType": "Full-time", "employmentType": "Full-time", "jobFunction": "Management and Manufacturing", "industry": "Hospitals and Health Care", "description": "This position is responsible for all materials management activities, i.e., demand/utilization management, order management, supplier management, logistics management, and inventory/ assets management for AHMC- Anaheim Regional Medical Center.<br/><br/>Provides strategic direction and leadership for the management of all non-labor supplies and services expenses, excluding physician contracts, for the Medical Center.<br/><br/>This position also is responsible for providing financial oversight and direction to the medical center by establishing and maintaining internal controls and reporting systems which provide accurate and timely financial information to management for decision making and for the oversight of facilities materials management activities.<br/><br/><ul><li>Participates in strategic direction for AHMC-ARMC Materials Management &amp; provides leadership for operations management and project implementation to ensure objectives are achieved successfully and timely. </li><li>Lead the redesign, consolidation and systemization of the AHMC-ARMC Materials Management, purchasing, central supply and, receiving/ distribution &amp; transportation operations under the AHMC-ARMC Alliance to gain economies of scale and enhance service levels. Direct AHMC-ARMC Supply Chain cost initiatives. </li><li>Provide leadership and guidance to the Medical Center to provide for a standardization of goods &amp; services as well as other related programs and initiatives. </li><li>Coordinate effective communication between hospital departments, suppliers, GPOs, Material Management and AHMC’s contract and Purchasing office. </li><li>Provide necessary education to all areas regarding new policies &amp; procedures associated with AHMC-ARMC &amp; AHMC.</li><li>BS or BA Degree in Business Administration or related science preferred.</li><li>Seven to ten years of progressively responsible experience in healthcare materiel management with management emphasis in a purchasing managerial role.</li><li>Knowledge of and ability to apply effective negotiating skills with emphasis in contract terminology and legal requirements.</li><li>Knowledge of General Accepted Accounting Principles (GAAP)</li><li>Knowledge of current materials management technology, practices and information systems.</li></ul>", "postedDate": "5 months ago", "skills": [], "url": "https://www.linkedin.com/jobs/view/3849217445"}