{"jobTitle": "Maintenance Supervisor", "company": {"name": "City of Costa Mesa", "location": "Costa Mesa, CA"}, "location": "Costa Mesa, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "jobFunction": "Other", "industry": "Government Administration", "description": "<strong>Description<br/><br/></strong><strong>1 full-time vacancy assigned to Facilities<br/><br/></strong><strong>The Position<br/><br/></strong>Under general direction, to perform skilled and supervisory work in the maintenance and repair of City owned vehicles and equipment, minor construction of municipal landscaped areas such as parks, parkways, traffic signs &amp; roadway markings, streets and storm drains, buildings and related facilities; and to perform other work as required.<br/><br/><strong>Class Characteristics<br/><br/></strong>An incumbent in this classification is responsible foreffectively planning, organizing, supervising and participating in the work of subordinate staff members engaged in the maintenance operations of assigned areas or projects. Work also involves responsibility for the correct and safe operation of a variety of tools and City owned equipment. Assignments are performed with considerable independent judgment and action within established policies, procedures and techniques. Work is subject to general supervision and is reviewed while in progress and/or upon completion through conferences, reports and results obtained.<br/><br/><strong>Application And Selection Process<br/><br/></strong>Applications must be completed and submitted online. This recruitment will remain open until filled and may close without prior notice, therefore prompt application is encouraged.<br/><br/><strong>First application review date: March 13, 2024.<br/><br/></strong>Candidates are requested to provide specific information regarding their education and experience as it relates to the position by completing all fields of the application. Do not include \"see attached resume\" in your responses, as they will not be accepted or reviewed in the application process. Applications may be rejected if incomplete . Additional documents will not be reviewed during the application evaluation process. If selected to proceed further in the recruitment process, an opportunity to provide work samples, letters of recommendation, etc. will be appropriate during the interview process.<br/><br/>Based upon the information presented on the application, a limited number of candidates who possess qualifications most pertinent to the position will be invited to participate in the selection process. The selection process may include but is not limited to the following components: application review and evaluation, written examination or exercise, physical examination, practical exercise and interview evaluation. Please notify the Human Resources Division 72 hours in advance of the test date if you have a disability which requires accommodation for the testing process. The eligibility list will be in effect for one (1) year, unless exhausted sooner. The eligibility list from this recruitment may be utilized to fill lower-level vacancies which occur during the life of the list.<br/><br/>It is recommended you use a personal email address on your application instead of a work email address <strong>. </strong> N otifications during this recruitment will be sent by email only (regardless of the notification preference selected during the online application process). Notifications will be sent to the email address that is listed on your online application.<br/><br/>All employment offers made by the City are contingent upon establishing proof of a prospective candidate's legal authorization to work in the United States and successfully passing all components of the pre-employment process which may include, but is not limited to: comprehensive background check, criminal history check (Live Scan fingerprint check), polygraph examination, post-offer psychological evaluation and post-offer medical evaluation (may include drug screen).<br/><br/>Based upon current and/or future assignments, an employee may be subject to pre-employment, random, reasonable and post-accident drug and alcohol testing pursuant to the Department of Transportation Regulations.<br/><br/>Note: The provisions of this job bulletin do not constitute an expressed or implied contract. Any provisions contained within may be modified or revoked without notice.<br/><br/><strong>Essential Functions<br/><br/></strong>These functions may not be present in all positions in this class. When a position is to be filled, the essential functions will be noted in the announcement of position availability. Management reserves the right to add, modify, change or rescind work assignments as needed.<br/><br/><strong>Responsibilities<br/><br/></strong>Maintenance Supervisors work in divisions of the Public Services Department. Depending upon the work unit to which incumbents are assigned, typical tasks or projects, which they supervise, occasionally participate in, and are responsible for include, but are not limited to, the following:<br/><br/>Inspects, tracks, and evaluates contractor performance in accordance with service contract agreement.<br/><br/>Monitors expenses, maintains up to date records on costs, materials and labor estimates, and assists Superintendent with budget preparation.<br/><br/>Prepares and maintains pertinent reports and records.<br/><br/>Reviews documents and evaluates the work of subordinates, including appropriate participation in disciplinary actions.<br/><br/>Plans and coordinates work schedules and work management program data.<br/><br/>Performs other tasks related to the area of assignments as required.<br/><br/><strong>When Assigned To The Fleet Section<br/><br/></strong>Progressive maintenance and repair of City owned equipment. Work performed consists of proactive repair and maintenance of gasoline, diesel, CNG, LPG, other alternate fueled powered equipment, and all related fuel infrastructure.<br/><br/><strong>When Assigned To The Streets/Signs And Marking Section<br/><br/></strong>Street striping; painting traffic lines and legends; installing and maintaining traffic and street signs; laying out street markings in accordance with drawings or blueprints; and the design and manufacturing of traffic control or guide signs.<br/><br/>Maintenance, repair and minor construction work of sidewalks, curbs, gutters and approaches; and laying and finishing concrete.<br/><br/>Maintenance, repair and minor construction of streets and alleys including general patch work; and repairing damaged asphalt or concrete.<br/><br/>Maintenance, repair and minor construction of catch basins, and manholes; updating catch basin maps, inspecting and maintaining storm drains and other drainage structures.<br/><br/><strong>When Assigned To The Facilities Section<br/><br/></strong>Interpret building codes and apply them to the building permitting process and ADA requirements.<br/><br/>Assist in the development and organization of preventive maintenance and safety inspection programs for all facilities.<br/><br/><strong>When Assigned To The Parks And Landscape Section<br/><br/></strong>Maintenance, repair and care of landscaped areas such as parks, ball fields, playgrounds and other facilities.<br/><br/>General maintenance of trees, shrubs, flowers and ground covers of city parkways. Applications of fertilizers, insecticides, fungicides and weed killers.<br/><br/><strong>Qualification Guidelines<br/><br/></strong><strong>Education, Training And/Or Experience<br/><br/></strong>A typical way to obtain the requisite knowledge and abilities to perform the duties and responsibilities of this classification is as follows:<br/><br/>Three years of progressively responsible experience in maintenance, repair and minor construction work in the area of assignment. Previous supervisory experience is desirable.<br/><br/>Graduation from high school or its equivalent. Supplementary advanced coursework related to the area of assignment is preferred.<br/><br/>An equivalent combination of education and relevant experience that provides the desired knowledge, skills and abilities to successfully perform essential functions may also be considered.<br/><br/><strong>License And/Or Certificate<br/><br/></strong>Class C California Driver's License. Revocation of license during employment may result in disciplinary action or reassignment.<br/><br/>Depending on assignments, some positions may require a Class A or B California Driver’s License with standard transmission and tanker endorsement. Revocation of license during employment may result in disciplinary action or reassignment.<br/><br/><strong>Requisite Knowledge And Skill Levels<br/><br/></strong>Requisite knowledge and abilities listed below may vary by assignment.<br/><br/>Knowledge of materials, equipment and methods used in the correct and safe maintenance and repair of a diverse complement of cars, trucks and specialized equipment and minor construction work of the area of assignment.<br/><br/>Knowledge of building or other structural repair, maintenance and minor construction including non-journey level carpentry, plumbing, painting, electrical, masonry and other related trades work.<br/><br/>Knowledge of word processing, spreadsheet and related software applications.<br/><br/>Skill in planning, coordinating and supervising journey level, semi-skilled and unskilled subordinates.<br/><br/>Skill in interpreting and following technical instructions and specifications relating to assigned work.<br/><br/><strong>Requisite Abilities<br/><br/></strong>Ability to communicate clearly both orally and in writing.<br/><br/>Ability to read and understand construction drawings and specifications.<br/><br/>Effectively plan and manage the overall work of the area of assignment for optimum results.<br/><br/>Prepare and maintain reports and records.<br/><br/>Establish and maintain effective working relationships with City official, staff, vendors, contractors, and the general public.<br/><br/><strong>Supplemental Information<br/><br/></strong><strong>Public Employee Disaster Service Worker<br/><br/></strong>In accordance with Government Code Section 3100 - all City of Costa Mesa employees are required to perform assigned disaster service worker duties in the event of an emergency or a disaster.<br/><br/><strong>Physical Tasks And Environmental Conditions<br/><br/></strong>Please contact Human Resources for a summary of the essential tasks and environmental factors for this classification.<br/><br/>Employee accommodations for physical or mental disabilities will be considered on a case-by-case basis.<br/><br/>To view benefit information for all groups, Click Here<br/><br/>New employees contribute 9% of their salary on a pre-tax basis towards the 2%@60 or 2%@62 CalPERS retirement formula depending on eligibility.<br/><br/><strong>Employees Receive The Following Health Insurance Flexible Benefits Contribution<br/><br/></strong><ul><li>Current: $1,600monthly </li><li>Effective January 2025: $1,650monthly<br/><br/></li></ul>The City does not participate in the Social Security system; however, federal mandate requires new employees to contribute 1.45% of wages to Medicare. As a condition of employment, all new employees are required to enroll and participate in the direct deposit program.<br/><br/>Closing Date/Time: Continuous", "responsibilities": "Maintenance Supervisors work in divisions of the Public Services Department. Depending upon the work unit to which incumbents are assigned, typical tasks or projects, which they supervise, occasionally participate in, and are responsible for include, but are not limited to, the following:<br/><br/>Inspects, tracks, and evaluates contractor performance in accordance with service contract agreement.<br/><br/>Monitors expenses, maintains up to date records on costs, materials and labor estimates, and assists Superintendent with budget preparation.<br/><br/>Prepares and maintains pertinent reports and records.<br/><br/>Reviews documents and evaluates the work of subordinates, including appropriate participation in disciplinary actions.<br/><br/>Plans and coordinates work schedules and work management program data.<br/><br/>Performs other tasks related to the area of assignments as required.", "qualifications": {"required": "Three years of progressively responsible experience in maintenance, repair and minor construction work in the area of assignment. Previous supervisory experience is desirable.<br/><br/>Graduation from high school or its equivalent. Supplementary advanced coursework related to the area of assignment is preferred.<br/><br/>An equivalent combination of education and relevant experience that provides the desired knowledge, skills and abilities to successfully perform essential functions may also be considered.", "preferred": "Class C California Driver's License. Revocation of license during employment may result in disciplinary action or reassignment.<br/><br/>Depending on assignments, some positions may require a Class A or B California Driver’s License with standard transmission and tanker endorsement. Revocation of license during employment may result in disciplinary action or reassignment."}, "skills": [], "postedDate": "5 months ago", "salary": {"amount": "1,600.00/mo - 1,650.00/mo", "currency": "USD"}, "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3849562435"}