{"jobTitle": "Senior Product Analyst", "company": {"name": "forhyre.com", "location": "Los Angeles County, CA"}, "location": "Los Angeles County, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Business Consulting and Services", "description": "<strong>About GoBook.me<br/><br/></strong>GoBook.me is dedicated to building an ecosystem that empowers entrepreneurs to thrive. We provide small business owners with a suite of business management tools such as booking and scheduling, marketing, analytics, payment processing, and more.<br/><br/>With a rapidly growing user base of small business owners relying on GoBook.me daily, our platform combines powerful functionality with a vibrant brand, making us a unique blend of fintech, SMB software, and consumer services.<br/><br/><strong>About The Role<br/><br/></strong>As a Senior Product Analyst at GoBook.me, you will play a crucial role in shaping our product roadmap and the future of our company by uncovering and sharing valuable insights. Collaborating with leaders across Product, Design, Analytics Engineering, Data Engineering, and the Go-to-Market team, you will work to enhance our product data infrastructure, develop analytical frameworks, and expand our analytical tools for more data-driven decision-making.<br/><br/>We are currently seeking Analysts to join our Booking and Teams product teams. The Booking Product Analyst will focus on enhancing conversion rates on customer booking sites and improving operational efficiency in client management. The Teams Product Analyst will contribute to the acceleration of our up-market strategy.<br/><br/>This position reports to the Manager of Product Analytics and offers the flexibility to work remotely from anywhere in United States.<br/><br/>What You'll Do<br/><br/><ul><li>Define, analyze, and promote KPIs for your assigned product team</li><li>Identify opportunities to enhance the customer experience, increase conversion, retention, engagement, and lifetime value through data analysis and a deep understanding of our customers</li><li>Collaborate with the Product Management Lead to shape the product roadmap</li><li>Work with Data Engineering and fellow Analytics teams to implement top-notch analytical frameworks and testing structures throughout the product<br/><br/></li></ul>What We're Looking For<br/><br/><ul><li>4+ years of experience in an analytical role, with at least 2 years in product analytics, preferably in a SaaS company</li><li>Advanced proficiency in SQL</li><li>A proactive individual with excellent communication and project management skills</li><li>Enthusiasm for working in a fast-paced startup environment and the willingness to engage in foundational work</li><li>Proficiency with tools like dbt, Looker, or other data visualization tools, along with a solid grasp of statistical fundamentals (A/B testing, regression)</li><li>Familiarity with leading product analytics tech stacks such as Mixpanel and Segment (or similar tools) is advantageous<br/><br/></li></ul>Benefits &amp; Perks<br/><br/><ul><li>Flexible PTO</li><li>Competitive health &amp; dental insurance options, with premiums covered by GoBook.me</li><li>Generous fully-paid parental leave policy</li><li>Retirement Savings Plan</li><li>Professional Development stipend for approved learning and educational expenses</li><li>Home office support</li><li>Team Bonding opportunities to foster meaningful connections within our distributed team<br/><br/></li></ul>At GoBook.me, we value diversity and are dedicated to creating a supportive workplace where all employees can excel. We believe that this not only benefits our team but also enhances our products, serves our customers better, and strengthens our community. GoBook.me is proud to be an Equal Opportunity and Affirmative Action Employer.", "responsibilities": "<ul><li>Define, analyze, and promote KPIs for your assigned product team</li><li>Identify opportunities to enhance the customer experience, increase conversion, retention, engagement, and lifetime value through data analysis and a deep understanding of our customers</li><li>Collaborate with the Product Management Lead to shape the product roadmap</li><li>Work with Data Engineering and fellow Analytics teams to implement top-notch analytical frameworks and testing structures throughout the product<br/><br/></li></ul>", "qualifications": {"required": "4+ years of experience in an analytical role, with at least 2 years in product analytics, preferably in a SaaS company, Advanced proficiency in SQL, A proactive individual with excellent communication and project management skills, Enthusiasm for working in a fast-paced startup environment and the willingness to engage in foundational work, Proficiency with tools like dbt, Looker, or other data visualization tools, along with a solid grasp of statistical fundamentals (A/B testing, regression), Familiarity with leading product analytics tech stacks such as Mixpanel and Segment (or similar tools) is advantageous<br/><br/>", "preferred": null}, "skills": ["SQL", "A/B testing", "regression", "Mixpanel", "Segment", "dbt", "Looker"], "postedDate": "5 months ago", "benefits": "<ul><li>Flexible PTO</li><li>Competitive health &amp; dental insurance options, with premiums covered by GoBook.me</li><li>Generous fully-paid parental leave policy</li><li>Retirement Savings Plan</li><li>Professional Development stipend for approved learning and educational expenses</li><li>Home office support</li><li>Team Bonding opportunities to foster meaningful connections within our distributed team<br/><br/></li></ul>", "remoteWork": null, "url": "https://www.linkedin.com/jobs/view/3850802549"}