{"jobTitle": "Decentralized Learning Manager (Pacific Standard Time Zone)", "company": {"name": "Panda Restaurant Group", "location": "Rosemead, CA"}, "location": "Rosemead, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "jobFunction": "Human Resources", "industry": "Restaurants", "description": "<strong>Summary of Job Description:<br/><br/></strong>The Decentralized Learning Manager (DLM) is responsible for designing, implementing, and evaluating comprehensive and applicable training programs to meet the learning and development needs of Store Managers, General Managers, and other leadership positions. This position collaborates with other departments and Regional and Zone leaders to enhance the knowledge, skills, and performance of individuals and teams, which leads to career growth and enhanced business performance. This position conducts mindset, skillset, and toolset training for Operations Leaders within their assigned regions. The DLM trains, coaches, and mentors Decentralized Learning Specialists (DLS). The DLM and DLS work together in partnership to support building a strong talent pipeline for their assigned regions.<br/><br/><strong>You’ll get a chance to:<br/><br/></strong><ul><li>Plan, organize, facilitate, and track the field training programs that focus on courses that address the mindset, skillset, and toolset to elevate the performance of Operations Leadership. </li><li>Attend Operations meetings (Area, Regional, Zone) to provide leadership training for Operations.</li><li>Develop, design, and facilitate engaging and relevant learning sessions that align with culture and business needs utilizing various delivery methods including instructor-led, experiential, self-study, e-Learning, in store, classroom, and virtual sessions in the field to provide the most effective training for Operations management. </li><li>Employ a variety of teaching strategies that motivate learning, including examples, practice and interactivity.</li><li>Create training and development strategic and operational plans that are aligned with company goals and objectives to achieve results. </li><li>Review existing training programs and suggests enhancements and modifications to improve engagement, learning, and retention.</li><li>Design and develop curriculum in a timely and relevant manner, with value proposition for each training program, meeting performance improvement objectives and ensuring return on investment. </li><li>Conduct mindset, skillset, and toolset training for Operations Leaders within their assigned regions. </li><li>Work together with other departments and the zone leadership team to assess training needs and develop plans to bridge skill and competency gaps.</li><li>Work collaboratively with Subject Matter Experts (SMEs) within the company to identify training needs and trends.</li><li>Complete needs analysis; develops and validates training content, methods, and materials and ensures effective transfer of learning.</li><li>Support the career growth and development of Operations managers through store visits, people assessment, mentorship, and by participating in the regional People Planning process. </li><li>Work with Zone and Regional Leaders to mentor and prepare subordinate managers for promotion. </li><li>Provide advice, feedback, and support on people development.</li><li>Develop Decentralized Learning Specialists to elevate instructor performance and recommends improvements to program content and/or instructor presentation methods. </li><li>Coordinate each region’s development plans together with Decentralized Learning Specialists.</li><li>Lead and participate in Operations and Support Center projects as assigned. <br/><br/><br/></li></ul><strong>How we reward you:<br/><br/></strong><ul><li>Hybrid Work schedule</li><li>401K with company match</li><li>Yearly bonus opportunity*</li><li>Full medical, dental, and vision insurance *</li><li>On-site fitness center, biometric screen, and flu shot clinic</li><li>Discounts at Panda restaurants, theme parks, and gym memberships</li><li>Paid time off starting at 15 days with 7 federal holidays*</li><li>Continuous education assistance and scholarships*</li><li>Income protection including Disability, Life and AD&amp;D insurance*</li><li>Bereavement leave*</li><li>Benefits available for eligible permanent full time associates<br/><br/><br/></li></ul><strong>Your background and experience: <br/><br/></strong><ul><li>Bachelor’s degree in business administration, hospitality, communication, adult learning, or related field </li><li>Minimum five years of experience in Learning &amp; Development and/or Operations, with increasing management responsibility, preferably in a retail/hospitality operations environment; formal training in facilitation skills from a reputable training organization </li><li>Successful completion of initial and periodically required trainings.</li><li>Obtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position.<br/><br/><br/></li></ul><strong>Work Environment:<br/><br/></strong><ul><li>Field-based position: Travel, meeting, and store environment, 40% plus (includes local travel to stores, training site, and meeting location as well as overnight trips to support as required), varies by regions. <br/><br/><br/></li></ul><strong>Panda Strong since 1983<br/><br/></strong>Founded in Glendale, California, we are now the largest family-owned American Chinese Restaurant concept in America. With close to 2,000 locations globally, we continue our mission of delivering exceptional Asian dining experiences by building an organization where people are inspired to better their lives. Whether it’s impacting our team or the communities we work in, we’re proud to be an organization that embraces family values.<br/><br/><strong>You’re wanted here<br/><br/></strong>We value diversity in all forms and know the strength it brings. Workplace equality allows for creative ideas to blossom, diverse points of view to be heard, and improves overall happiness. We like the sound of that.<br/><br/><em>Panda Restaurant Group, Inc. is an Equal Opportunity Employer and prohibits discrimination and harassment on the basis of race, color, religion, sex, national origin, disability, age and any other basis protected by the laws which apply where we operate. Panda provides accommodations for disabilities and religious observance purposes as required by law.<br/><br/></em>", "responsibilities": "The Decentralized Learning Manager (DLM) is responsible for designing, implementing, and evaluating comprehensive and applicable training programs to meet the learning and development needs of Store Managers, General Managers, and other leadership positions. This position collaborates with other departments and Regional and Zone leaders to enhance the knowledge, skills, and performance of individuals and teams, which leads to career growth and enhanced business performance. This position conducts mindset, skillset, and toolset training for Operations Leaders within their assigned regions. The DLM trains, coaches, and mentors Decentralized Learning Specialists (DLS). The DLM and DLS work together in partnership to support building a strong talent pipeline for their assigned regions.", "qualifications": {"required": "Bachelor’s degree in business administration, hospitality, communication, adult learning, or related field\nMinimum five years of experience in Learning & Development and/or Operations, with increasing management responsibility, preferably in a retail/hospitality operations environment; formal training in facilitation skills from a reputable training organization\nSuccessful completion of initial and periodically required trainings.\nObtaining a valid Food Handler's Card within 30 days of employment is a requirement of this position.", "preferred": ""}, "skills": ["Learning & Development", "Operations", "Training", "Facilitation", "Leadership", "Retail", "Hospitality", "Management", "Curriculum Development", "Instructional Design", "Needs Analysis", "Performance Improvement", "Mentorship", "Coaching", "Project Management"], "postedDate": "2 weeks ago", "benefits": "Hybrid Work schedule\n401K with company match\nYearly bonus opportunity*\nFull medical, dental, and vision insurance *\nOn-site fitness center, biometric screen, and flu shot clinic\nDiscounts at Panda restaurants, theme parks, and gym memberships\nPaid time off starting at 15 days with 7 federal holidays*\nContinuous education assistance and scholarships*\nIncome protection including Disability, Life and AD&amp;D insurance*\nBereavement leave*\nBenefits available for eligible permanent full time associates", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3851011967"}