{"jobTitle": "Sales Supervisor: Dolce Vita (footwear)", "company": {"name": "Leap", "industry": "Retail", "size": "Not specified", "location": "West Hollywood, CA"}, "location": "West Hollywood, CA", "jobType": "Not specified", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$21/hr. - $23/hr.", "currency": "USD"}, "jobFunction": "Sales and Business Development", "industry": "Retail", "description": "Our store teams are the heart of Leap! We are looking for a driven Sales Supervisor for our Dolce Vita boutique on Melrose in Los Angeles. This leader will play an integral role in developing a world-class store team and delivering top-notch customer experience. The Leap platform launches and operates insight-driven retail stores for modern brands with better performance and less risk. Among the trailblazing brands we work with are: ASTR the Label, Frankies Bikinis, Malbon Golf, ThirdLove, True Classic Tees and many more.", "responsibilities": "Influence and inspire a team to create memorable in store experiences and foster a positive environment. Execute action plans in partnership with the Store Leader to drive sales and client engagement. Ensure store standards are maintained; cleanliness, visual merchandising and operational tasks (inventory counts, tagging, receiving + processing shipment). Support with activations and new store openings as needed. Embrace learning and leveraging new technologies, systems, apps, etc.; experience with Shopify, Endear, Slack, Google Office is a plus. Ability to operate independently and work effectively under pressure, support completion of store opening/closing procedures. Keep an agile work schedule; including days, nights, weekends, holidays. One or more years of direct and/or indirect management experience. Two or more years of retail experience; preferably in shoes or a similar category. Must be at least 18+ years of age. Maintain an active floor presence, including standing and walking for extended periods of time. Comfortability using a ladder and lifting a maximum of 50lbs.", "qualifications": {"required": "Must be at least 18+ years of age. One or more years of direct and/or indirect management experience. Two or more years of retail experience; preferably in shoes or a similar category.", "preferred": "Experience with Shopify, Endear, Slack, Google Office is a plus."}, "skills": ["Sales", "Customer Service", "Retail Management", "Team Leadership", "Visual Merchandising"], "postedDate": "5 months ago", "applicationDeadline": "Not specified", "benefits": "Employee discount, Commission + Bonus Eligible, 401K, Accrued PTO for those eligible (blackout periods apply), Medical, Dental & Vision benefits (must avg 32hrs+/wk), Employee Assistance Program", "remoteWork": "Not specified", "url": "https://www.linkedin.com/jobs/view/3854339475"}