{"jobTitle": "Interim Director of Human Resources", "company": {"name": "Dowbuilt", "location": "Los Angeles, CA"}, "location": "Los Angeles, CA", "jobType": "Part-time", "employmentType": "Part-time", "experienceLevel": "Director", "salary": {"amount": "110,000 - 128,000", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Construction", "description": "Dowbuilt is starting a search for an interim HR Director to step in 32 hours per week between May of 2024 and January of 2025. This position provides input and priority setting direction around Dowbuilt’s payroll, benefits, employment practices and employee relations functions. They will serve as an internal advisor and consultant with peers and mid-level managers. Reporting to the COO, they will support the interests of the business in having employment policies and practices that are flexible and readily adaptable to a wide array of business needs. The Interim Director of Human Resource will lead a 2-person HR and benefits team while maintaining and continuously improving upon Dowbuilt’s strategic driver: “Best People, Best Work”. <br/>\n\nWHAT YOU’LL DO\n\nCulture and Strategy\n\n* Participate as a member of the management team, contributing to discussions, reviews, planning sessions, and decision-making across the broader business, as well as providing the human resources perspective. \n* Assist management team to shape policies and people strategies that are aligned with Dowbuilt’s vision, mission and goals. Develop, implement and maintain people policies for the company, and ensure these policies are communicated and enforced consistently.\n\nCompliance and Employee Relations\n\n* Guide Dowbuilt through all employment law and regulatory matters to ensure continuous compliance.\n* Ensure employee relations activities comply with applicable employment laws, are creative, maintain and improve partnerships to the fullest extent possible with operational efficiency and profitability.\n* Work with outside counsel to manage employment related legal claims and costs. Advise COO and executive team on strategy. \n* Ensure Dowbuilt not only meets compliance requirements but achieves best-practice objectives around leased employees and all joint-employer responsibilities, including contractual language.\n* Oversee performance improvement procedures and guide managers through conception and execution of performance improvement plans. \n* Lead investigations and resolve all grievances with compassion, diplomacy, professionalism, and confidentiality. Balance the dual priorities of supporting all parties while developing fair, equitable and prudent resolutions for the company and the employees involved.\n* Oversee Workers’ Compensation companywide. Support HR Generalist in claims management for all regions.\n* Maintain updated Employee Policy Handbook and determine appropriate language translation as needed.\n* Ensure appropriate solutions are in place to achieve 100% compliance with mandated training requirements.\n\nHuman Resources Department\n\n* Oversee maintenance of digital personnel records and ensure company is compliant with state and Federal recordkeeping rules.\n* Ensure HR processes and systems meet company needs and drive continual improvement.\n* Develop HR policies that align with corporate vision, mission, and values.\n* Provide overall leadership and day-to-day management of the HR Generalist and HR Coordinator. \n* Serve as a role model and mentor to others within the business.\n* Manage the delivery of payroll, benefits, and employee relations services for all employees.\n\nHealth and Welfare Benefits\n\n* Assess, develop and implement strategies that ensure Dowbuilt is offering competitive health and welfare packages that motivate employees and incentivize high performance.\n* Collaborate with leadership and brokers to evaluate and implement plan components and make recommendations for changes as necessary based on industry benchmarks.\n* Oversee company benefit programs including but not limited to: healthcare, 401(k) retirement plan, PTO and leaves of absence.\n* Support the HR Generalist with annual open enrollment and oversee plan design and cost strategies. \n\nWHAT YOU NEED TO SUCCEED\n\n* A degree in Organization Development, Industrial-Organizational Psychology, Human Resources, Business, or a related field\n* Minimum of 8 years of progressively more complex work experience that demonstrates the required business and organizational development expertise; or the equivalent combination of education and experience.\n* PHR, SPHR, SHRM-SCP or SHRM-CP certification highly desired. \n* Construction industry experience highly preferred. \n* Dowbuilt HR team members are held to the following standards around effective communication (both written and verbal):\n* Clear—main ideas easily identified and understood.\n* Concise—gets to the point without using unneeded words or images.\n* Concrete—includes specific examples or explanations.\n* Persuasive - refer to objective criteria such as industry practice, project limitations and precedent.\n* Self-aware - remain flexible, curious, and courteous in all communications.\n* Proficiency with Payroll and HRIS; ADP and BambooHR highly preferred.\n* Strong organizational skills and able to juggle competing deadlines and projects.\n* Enthusiasm for fostering an inclusive work environment, leading diverse teams, and a commitment to increasing equity for all employees.\n* Experience in high-change environments as an active leader successfully prioritizing work and competing interests to achieve organizational goals.\n* Demonstrated business acumen, with a track record of success in coaching managers for organizational assimilation and improved performance.\n* Demonstrated ability to identify different personality styles and individual learning preferences and tailor communication and coaching style and interactions to meet individual needs.\n* Ability to think strategically and back it up with tactical plans and actions.\n* Reputation for an unrelenting pursuit of excellence, along with a very high level of tact, maturity, and flexibility. Must possess compassion in all dealings, with demonstrated success in delivering tough information and mediating + diffusing challenging interpersonal conflicts.\n* Impeccable integrity and character are required, along with the personal strength and confidence to self-examine and freely admit mistakes in a dynamic team environment where honest, forthright communication is expected.\n* Must have and consistently demonstrate an excellent work ethic, positive attitude, and a well-honed sense of humor.\n* U.S. work authorization.\n* LA based, working from the Dowbuilt LA office is highly preferred. \n\nWHAT WE OFFER\n\nWe are a fun, easygoing bunch of professionals who take a lot of pride in the work we do. We acknowledge the contributions and talents of our team members by providing benefits that support you at work and in life:\n\n* Competitive pay commensurate with skills and experience\n* 100% paid medical, dental, vision, and $50,000 basic life insurance for full-time employees (30% coverage for dependents), first of the month following DOH\n* Company-paid short-term disability policy for all full-time employees\n* 401(k) retirement savings plan with employer profit sharing contribution\n* 8 paid holidays each year, no waiting period\n* Paid Time-Off (PTO) Salaried/Exempt employees accrue 2.31 hours per week, or 120 hours per year, with one additional day of service per year until reaching a max accrual of 160 hours\n* Mentorship and career development opportunities\n* Education reimbursement\n* Discretionary bonus\n\nThe compensation for this position is: $110,000 - $128,000 annually (based on 80% FTE schedule)\n\nWHO WE ARE\n\nDowbuilt is a construction company founded in 1980, and today our talented teams can be found from coast to coast. We excel at cutting-edge, innovative, never-been-done-before residential projects and home service—all of which require precision and impeccable attention to detail. We work with top architects, and our builds are regularly featured in publications such as *Architectural Digest* and *Architectural Record*.\n\nThe Dowbuilt culture is one of care—care for our employees, clients, and the talented craftspeople we partner with—resulting in care for the incredible designs we bring to life.\n\nHOW YOU’LL MAKE AN IMPACT\n\nWe’re committed to investing in our team members’ ongoing professional development, and as a leader with Dowbuilt, you play a big part in ensuring that your team has equal opportunity to play to their strengths, fill gaps in knowledge and grow professionally.\n\nEffective career development requires two-way, open communication between employee and manager. This means expectation setting happens on both sides, along with support, mentorship, and goal setting at regular intervals. Find out how you can take your own career to the next level and inspire the next generation of talent with Dowbuilt.\n\n<br/>\n*Dowbuilt is an equal opportunity employer that values diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*", "responsibilities": "Participate as a member of the management team, contributing to discussions, reviews, planning sessions, and decision-making across the broader business, as well as providing the human resources perspective. \nAssist management team to shape policies and people strategies that are aligned with Dowbuilt’s vision, mission and goals. Develop, implement and maintain people policies for the company, and ensure these policies are communicated and enforced consistently.\nGuide Dowbuilt through all employment law and regulatory matters to ensure continuous compliance.\nEnsure employee relations activities comply with applicable employment laws, are creative, maintain and improve partnerships to the fullest extent possible with operational efficiency and profitability.\nWork with outside counsel to manage employment related legal claims and costs. Advise COO and executive team on strategy. \nEnsure Dowbuilt not only meets compliance requirements but achieves best-practice objectives around leased employees and all joint-employer responsibilities, including contractual language.\nOversee performance improvement procedures and guide managers through conception and execution of performance improvement plans. \nLead investigations and resolve all grievances with compassion, diplomacy, professionalism, and confidentiality. Balance the dual priorities of supporting all parties while developing fair, equitable and prudent resolutions for the company and the employees involved.\nOversee Workers’ Compensation companywide. Support HR Generalist in claims management for all regions.\nMaintain updated Employee Policy Handbook and determine appropriate language translation as needed.\nEnsure appropriate solutions are in place to achieve 100% compliance with mandated training requirements.\nOversee maintenance of digital personnel records and ensure company is compliant with state and Federal recordkeeping rules.\nEnsure HR processes and systems meet company needs and drive continual improvement.\nDevelop HR policies that align with corporate vision, mission, and values.\nProvide overall leadership and day-to-day management of the HR Generalist and HR Coordinator. \nServe as a role model and mentor to others within the business.\nManage the delivery of payroll, benefits, and employee relations services for all employees.\nAssess, develop and implement strategies that ensure Dowbuilt is offering competitive health and welfare packages that motivate employees and incentivize high performance.\nCollaborate with leadership and brokers to evaluate and implement plan components and make recommendations for changes as necessary based on industry benchmarks.\nOversee company benefit programs including but not limited to: healthcare, 401(k) retirement plan, PTO and leaves of absence.\nSupport the HR Generalist with annual open enrollment and oversee plan design and cost strategies.", "qualifications": {"required": "A degree in Organization Development, Industrial-Organizational Psychology, Human Resources, Business, or a related field\nMinimum of 8 years of progressively more complex work experience that demonstrates the required business and organizational development expertise; or the equivalent combination of education and experience.\nProficiency with Payroll and HRIS; ADP and BambooHR highly preferred.\nStrong organizational skills and able to juggle competing deadlines and projects.\nEnthusiasm for fostering an inclusive work environment, leading diverse teams, and a commitment to increasing equity for all employees.\nExperience in high-change environments as an active leader successfully prioritizing work and competing interests to achieve organizational goals.\nDemonstrated business acumen, with a track record of success in coaching managers for organizational assimilation and improved performance.\nDemonstrated ability to identify different personality styles and individual learning preferences and tailor communication and coaching style and interactions to meet individual needs.\nAbility to think strategically and back it up with tactical plans and actions.\nReputation for an unrelenting pursuit of excellence, along with a very high level of tact, maturity, and flexibility. Must possess compassion in all dealings, with demonstrated success in delivering tough information and mediating + diffusing challenging interpersonal conflicts.\nImpeccable integrity and character are required, along with the personal strength and confidence to self-examine and freely admit mistakes in a dynamic team environment where honest, forthright communication is expected.\nMust have and consistently demonstrate an excellent work ethic, positive attitude, and a well-honed sense of humor.\nU.S. work authorization.\nLA based, working from the Dowbuilt LA office is highly preferred.", "preferred": "PHR, SPHR, SHRM-SCP or SHRM-CP certification highly desired. \nConstruction industry experience highly preferred."}, "skills": ["Payroll", "HRIS", "ADP", "BambooHR", "Employee Relations", "Compliance", "Benefits", "Leadership", "Management", "Communication", "Strategy", "Organizational Development", "Business Acumen", "Coaching", "Performance Improvement", "Workers' Compensation", "Training", "Recordkeeping", "Mentorship", "Diversity", "Equity", "Professional Development"], "postedDate": "5 months ago", "benefits": "Competitive pay commensurate with skills and experience\n100% paid medical, dental, vision, and $50,000 basic life insurance for full-time employees (30% coverage for dependents), first of the month following DOH\nCompany-paid short-term disability policy for all full-time employees\n401(k) retirement savings plan with employer profit sharing contribution\n8 paid holidays each year, no waiting period\nPaid Time-Off (PTO) Salaried/Exempt employees accrue 2.31 hours per week, or 120 hours per year, with one additional day of service per year until reaching a max accrual of 160 hours\nMentorship and career development opportunities\nEducation reimbursement\nDiscretionary bonus", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3854346865"}