{"jobTitle": "Supplier Performance Manager", "company": {"name": "Safran", "location": "Garden Grove, CA"}, "location": "Garden Grove, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Associate", "salary": {"amount": "105,400.00/yr - 134,200.00/yr", "currency": "USD"}, "jobFunction": "Supply Chain, Purchasing, and Manufacturing", "industry": "Aviation and Aerospace Component Manufacturing and Transportation, Logistics, Supply Chain and Storage", "description": "Are you passionate about technology or aviation? Come invent the solutions of tomorrow in the aerospace and defense industry, with an international group where innovation, teamwork and continuing, daily education are fundamental values. Join us!\n<br/>\nSafran Cabin headquarters are in Huntington Beach, California, with a global presence of over 10,000 employees at 36 sites. Site locations are in the United States, Mexico, Brazil, Canada, Germany, France, Czech Republic, the Netherlands, Tunisia and Thailand. Safran Cabin serves over 400 airlines and leasing companies globally and delivers to all airframe OEM manufacturers with a heritage spanning over 80 years in the industry.\n<br/>\n• Your Career: Safran is committed to providing internal mobility to our employees. We operate globally so the sky is the limit of where your Safran journey can take you.\n• Your Development: Safran employees have free access to Safran University courses and external tuition reimbursement for approved programs or certifications.\n<br/>\n• Your Benefits: Our suite of comprehensive benefits include health care (medical, dental and vision), life insurance, 401(k) savings plans with company match, paid time off, Safran Perks with BenefitHub – Employee Discounts & Rewards Marketplace for consumer products/services and more!\n<br/>\nJob Summary:\nThe Supplier Performance Manager is responsible for mitigating crisis at specific suppliers, ensuring effective supplier performance, and managing multiple customers. This role holds full responsibility and accountability for monitoring failing suppliers and leading the supplier recovery plan. The Supplier Performance Manager must possess strong project management skills, a supply chain background, and the ability to coordinate with multiple customers, both internal and external.\nTravel specificity\nWillingness and ability to travel domestically and internationally, as required.\n<br/>\nThe expected salary range for this position is between $105,400 - $134,200 USD. Actual compensation will be determined based on experience, education, and other factors permitted by law.\n<br/>\nSummary of Duties:\n• Mitigate crises at specific supplier(s) by identifying and addressing performance issues, ensuring timely resolution to minimize disruptions in the supply chain.\n• Take full accountability for managing failing suppliers, closely tracking their performance, and identifying root causes of their underperformance.\n• Lead the development and execution of a comprehensive supplier recovery plan, collaborating with internal and external stakeholders to ensure alignment and successful implementation.\n• Coordinate with multiple customers, both internal and external, to understand their requirements and expectations, and proactively address any concerns related to supplier performance.\n• Conduct regular assessments of supplier performance and deliverables, monitoring key performance indicators (KPIs), and implementing improvement initiatives as needed.\n• Collaborate with cross-functional teams, including procurement, quality, engineering, and logistics, to define and execute corrective actions, driving continuous improvement in supplier performance.\n• Develop and maintain strong relationships with suppliers and customers, fostering open communication and collaboration to address issues and drive mutual success.\n• Perform and maintain program risk & opportunity assessment (quantitative and qualitative)\n• Review the supplier contract compliance and control scope\n• Provide regular updates and reports on supplier performance to senior management\nCandidate skills & requirements\nQualifications:\nEducation: Bachelor's degree in Engineering, Supply Chain Management, Business Administration, or a related field. Master's degree is a plus.\nExperience:\n• Minimum of 10 years of progressive experience in supplier performance management, supplier development, program management, or related roles, within a complex and fast-paced manufacturing environment; preferable commercial aerospace\n• Proven track record of successfully mitigating supplier crises and leading supplier recovery plans.\n• Strong project management skills with a demonstrated ability to manage complex projects, meet deadlines, and achieve desired outcomes.\n• Extensive experience in supply chain management, including supplier selection, performance monitoring, and improvement initiatives.\n• Solid understanding of quality management principles, lean manufacturing concepts, and continuous improvement methodologies.\n• Experience in coordinating with multiple customers, both internal and external, and managing their expectations and requirements.\n• Previous experience working with suppliers in crisis situations and leading cross-functional teams to resolve issues effectively.\n• Excellent negotiation, communication, and interpersonal skills, with the ability to build strong relationships with internal and external stakeholders.\n• Demonstrated leadership abilities, including the ability to influence and motivate teams towards achieving project objectives.\n• Strong analytical and problem-solving skills, with the ability to analyze complex data, identify trends, and develop data-driven solutions.\n• Proficient in project management tools and software.\n• Willingness and ability to travel domestically and internationally, as required.\n<br/>\nPreferred Skills:\n• Master's degree in Engineering, Supply Chain Management, Business Administration, or a related field.\n• Professional certifications in project management (PMP), supply chain management (APICS), or related areas.\n• Experience working in a global or multinational organization.\n• Familiarity with ERP systems and other supply chain management software.", "responsibilities": "• Mitigate crises at specific supplier(s) by identifying and addressing performance issues, ensuring timely resolution to minimize disruptions in the supply chain.\n• Take full accountability for managing failing suppliers, closely tracking their performance, and identifying root causes of their underperformance.\n• Lead the development and execution of a comprehensive supplier recovery plan, collaborating with internal and external stakeholders to ensure alignment and successful implementation.\n• Coordinate with multiple customers, both internal and external, to understand their requirements and expectations, and proactively address any concerns related to supplier performance.\n• Conduct regular assessments of supplier performance and deliverables, monitoring key performance indicators (KPIs), and implementing improvement initiatives as needed.\n• Collaborate with cross-functional teams, including procurement, quality, engineering, and logistics, to define and execute corrective actions, driving continuous improvement in supplier performance.\n• Develop and maintain strong relationships with suppliers and customers, fostering open communication and collaboration to address issues and drive mutual success.\n• Perform and maintain program risk & opportunity assessment (quantitative and qualitative)\n• Review the supplier contract compliance and control scope\n• Provide regular updates and reports on supplier performance to senior management", "qualifications": {"required": "Education: Bachelor's degree in Engineering, Supply Chain Management, Business Administration, or a related field. Master's degree is a plus.\nExperience:\n• Minimum of 10 years of progressive experience in supplier performance management, supplier development, program management, or related roles, within a complex and fast-paced manufacturing environment; preferable commercial aerospace\n• Proven track record of successfully mitigating supplier crises and leading supplier recovery plans.\n• Strong project management skills with a demonstrated ability to manage complex projects, meet deadlines, and achieve desired outcomes.\n• Extensive experience in supply chain management, including supplier selection, performance monitoring, and improvement initiatives.\n• Solid understanding of quality management principles, lean manufacturing concepts, and continuous improvement methodologies.\n• Experience in coordinating with multiple customers, both internal and external, and managing their expectations and requirements.\n• Previous experience working with suppliers in crisis situations and leading cross-functional teams to resolve issues effectively.\n• Excellent negotiation, communication, and interpersonal skills, with the ability to build strong relationships with internal and external stakeholders.\n• Demonstrated leadership abilities, including the ability to influence and motivate teams towards achieving project objectives.\n• Strong analytical and problem-solving skills, with the ability to analyze complex data, identify trends, and develop data-driven solutions.\n• Proficient in project management tools and software.\n• Willingness and ability to travel domestically and internationally, as required.", "preferred": "• Master's degree in Engineering, Supply Chain Management, Business Administration, or a related field.\n• Professional certifications in project management (PMP), supply chain management (APICS), or related areas.\n• Experience working in a global or multinational organization.\n• Familiarity with ERP systems and other supply chain management software."}, "skills": ["Supply Chain Management", "Supplier Performance Management", "Project Management", "Crisis Management", "Supplier Development", "Program Management", "Quality Management", "Lean Manufacturing", "Continuous Improvement", "Negotiation", "Communication", "Interpersonal Skills", "Leadership", "Analytical Skills", "Problem Solving", "ERP Systems", "Supply Chain Software"], "postedDate": "1 week ago", "benefits": "Our suite of comprehensive benefits include health care (medical, dental and vision), life insurance, 401(k) savings plans with company match, paid time off, Safran Perks with BenefitHub – Employee Discounts & Rewards Marketplace for consumer products/services and more!", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3855456369"}