{"jobTitle": "Human Resources Coordinator", "company": {"name": "Sinclair Inc.", "industry": "Broadcast Media Production and Distribution", "size": "185 television stations in 86 markets", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$24.70/hr - $27.45/hr", "currency": "USD"}, "jobFunction": "Human Resources", "industry": "Broadcast Media Production and Distribution", "description": "We’re seeking an experienced human resources professional who is detail oriented, self-motivated, and highly customer focused. This is an exciting opportunity for an individual with a passion for providing an outstanding employee experience and an eagerness to expand their human resources knowledge. There will also be opportunities to be involved in various global HR assignments. This role is based in our Santa Monica, CA office.", "responsibilities": "Perform day to day HR support by responding to employee and applicant requests and questions. Take initiative for self-learning to increase effectiveness in role and for personal career development. Conduct audits of various benefits and other HR programs and recommend and perform corrective action. Prepare a variety of human resources reports and assist with the development of forms and documents. Assist with the performance review process. Review, track and send out reminders for employee training. Assist with open enrollment and benefits administration. Assist with recruiting process, scheduling interviews and onboarding process. Conduct New Hire orientations and all follow-up to ensure required paperwork is complete. Complete I-9s for new hires and maintain I-9 records. Handle administration of COVID-19 cases. Update HRIS database records and process paperwork for new hires, terminations and other status changes. Create and maintain digital employee personnel files. Maintain organizational charts using Microsoft Visio. Assist with or prepare correspondence. Assist Human Resources team with various research projects and/or special projects.", "qualifications": {"required": "Two to three years' experience in a Human Resources role required. Demonstrated human resources knowledge, skills and judgement. Intermediate to Advanced Proficiency in MS Office including Word, Excel and Outlook. Ability to read, write with strong grammatical skills and communicate fluently in English. Strong attention to detail. Must be honest, respectful and trustworthy. Eager, willing to learn and follow established policies and procedures. Have a positive demeanor and approach to the work. High degree of professional personal presentation. Bachelor’s degree in human resources or related field a plus. Previous experience in entertainment sports or broadcast media is a plus.", "preferred": ""}, "skills": ["Human Resources", "MS Office", "Communication", "Detail-oriented", "Customer-focused"], "postedDate": "5 months ago", "applicationDeadline": "", "benefits": "Full time positions are eligible for benefits that include participation in a retirement plan, life and disability insurance, health, dental and vision plans, flexible spending accounts, sick leave, vacation time, personal time, parental leave and employee stock purchase plan.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3858586677"}