{"jobTitle": "Area Business Manager - Hematology/Oncology - W. Los Angeles, CA", "company": {"name": "Sanofi", "industry": "Pharmaceutical Manufacturing, Chemical Manufacturing, and Biotechnology Research", "size": "Large", "location": "Los Angeles Metropolitan Area"}, "location": "Los Angeles Metropolitan Area", "jobType": "Full-time", "employmentType": "Full-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "$120,000.00 - $160,000.00", "currency": "USD"}, "jobFunction": "Sales, Strategy/Planning, and Marketing", "industry": "Pharmaceutical Manufacturing, Chemical Manufacturing, and Biotechnology Research", "description": "We are an innovative global healthcare company, committed to transforming the lives of people with immune challenges, rare diseases and blood disorders, cancers, and neurological disorders. From R&D to sales, our talented teams work together, revolutionizing treatment, continually improving products, understanding unmet needs, and connecting communities. We chase the miracles of science every single day, pursuing progress to make a real impact on millions of patients around the world.", "responsibilities": "Develop and utilize a business plan aligned with marketing strategies through territory analysis, cross-functional collaboration and customer insights (updated quarterly). Implement business plans through leveraging all appropriate resources, both human and physical, with Hematologists and Oncologists and other appropriate key customers. Develop as product, disease state and marketplace expert. Effectively communicate and position product information to customers in order to successfully promote the appropriate use of the Sanofi Genzyme oncology portfolio within territory. Work closely with all field partners, including, but not limited to Oncology Transplant Network Manager (ONM), other Sanofi-Genzyme ABMs and Medical (within confines of compliance) as necessary to ensure strategy pull through from key IDNs, academic institutions and community accounts. Complete call reporting, business plan updates and expense reports. Operate within all Pharma compliance guidelines. Implement effective account targeting and time management tactics. Attend training sessions as required and conventions and symposia, as necessary. Complete all fleet safety training and maintain an acceptable driving record regarding accidents and incidents.", "qualifications": {"required": "BA/BS degree from an accredited school required. Focus in business or life science preferred. Minimum two years of Oncology/Hematology sales experience OR one year previous Sanofi Oncology/Transplant sales experience.", "preferred": "Ability to think, plan, and act strategically. Effective oral and written communication skills. Up to 2 years successful experience in the sale of chemotherapeutic agents or bio-tech products preferred. Working knowledge of and familiarity with the hospital and cancer center environment preferred."}, "skills": ["Oncology", "Hematology", "Sales", "Business Development", "Customer Relationship Management"], "postedDate": "2 weeks ago", "applicationDeadline": "", "benefits": "Wide range of health and wellbeing benefits including high-quality healthcare, prevention and wellness programs and at least 14 weeks’ gender-neutral parental leave.", "remoteWork": "No", "url": "https://www.linkedin.com/jobs/view/3858604754"}