{"jobTitle": "Account Manager", "company": {"name": "Murphy Research", "location": "Santa Monica, CA"}, "location": "Santa Monica, CA", "jobType": "Full-time", "employmentType": "Part-time", "experienceLevel": "Mid-Senior level", "salary": {"amount": "100,000.00/yr - 300,000.00/yr", "currency": "USD"}, "jobFunction": "Sales", "industry": "Technology, Information and Internet", "description": "Murphy Research is a full-service custom market research firm known for our innovative research design and consultative approach. We produce groundbreaking qualitative and quantitative research through our focus on creative design, rigorous execution, and enduring insights. Our team thinks out of the box, follows a steady execution process, and is empowered to produce the highest quality research product that truly matters to our clients.\n\nWe are actively seeking an **Account Manager** to join the Murphy Research team. In this role, you will identify new business opportunities and grow existing client relationships. We currently work with a diverse range of Fortune 500 companies like PepsiCo, Anheuser-Busch, Disney, Glassdoor, Visa, and Delta Airlines across technology, CPG, retail, media, communication, and financial services. We look forward to the new research projects you'll bring to our team!\n\n**About you{{:}}**\n\n<ul> <li>You have at least 8 years of market research or consumer insights experience on either the supplier or client side</li> <li>You demonstrate experience serving clients in a fast-paced deadline-driven environment, ideally in a business development or consulting role</li> <li>You are self-motivated and driven to achieve business development revenue and profit targets as you grow your own book of business with the Murphy team</li> <li>You have an ability to provide customized results to diverse clients across industries</li> <li>You exhibit leadership skills, are excited by collaboration, and create natural opportunities to coach and mentor  junior team members</li> <li>You possess an ambitious curiosity and thrive when challenged by new opportunities</li> <li>You are tech-savvy, with excellent written and verbal communication skills, strong presentation skills, and attention to detail and organization. </li> </ul>\n\n**What you'll be doing{{:}}**\n\n<ul> <li>Identify and manage a targeted list of prospective clients, seeking new business opportunities, while growing existing client relationships</li> <li>Conduct daily outbound sales prospecting activities and contribute to marketing efforts that grow Murphy's brand profile and generate inbound leads and RFPs</li> <li>Develop winning proposals; design innovative qualitative and quantitative research studies</li> <li>Collaborate with the research team to manage and direct the execution of projects sold{{:}} ensure methodology is executed, resolve issues as they arise, approve design or cost decisions, oversee story-driven analysis and story plans, and ultimately deliver final reports that delight and exceed client expectations</li> <li>Partner with clients to ensure that their strategic business research objectives are met; become a trusted advisor and serve as main client contact throughout the research process, while always on the hunt for ways to expand our services to the client</li> </ul>\n\n**What we offer{{:}}**\n\n<ul> <li>Daily opportunity for variety, challenge, and growth</li> <li>Great career advancement and mentorship opportunities</li> <li>A collaborative, team-oriented, and high-performing atmosphere</li> <li>Salary commensurate with demonstrated experience and skills to achieve mutually agreed upon sales goals. Compensation ranges{{:}} $100,000 - $300,000 with opportunities for full-time, part-time, or commission-only structured positions</li> <li>Potential eligibility to competitive benefits package, including medical, dental, vision, 401k matching, paid time off, in-person and virtual social activities. </li> </ul><ul><li>Flexibility to work remotely, with an option for hybrid in our Santa Monica office!<br/> </li></ul>\n\n**We are now a Remote First company. **Since March 2020, Murphy Research has supported its employees in working 100% remotely to protect the health and safety of the team during the COVID-19 Pandemic. We have embraced this transition, and all positions will continue to work remotely into the future.\n\nAll new hires, however, must work/reside in the Greater Los Angeles or Minneapolis/St. Paul areas available to join in-person meet-ups that enhance our collaboration, mentorship, and team bonding. At this time, any employee attending an in-person company function or site visit will be required to show proof of COVID-19 vaccination.<br/> \n\n**Application Details{{:}}**\n\n<ul> <li>Applying to this posting means you are located in CA or MN</li> <li>Relocation is not offered and while this is a remote first position, Murphy Research can only hire in the states of CA or MN at this time. In your application, please indicate which city you plan to work/reside</li> <li>Applications will be considered on a rolling basis and will remain open until all positions are filled</li></ul>", "responsibilities": "Identify and manage a targeted list of prospective clients, seeking new business opportunities, while growing existing client relationships\nConduct daily outbound sales prospecting activities and contribute to marketing efforts that grow Murphy's brand profile and generate inbound leads and RFPs\nDevelop winning proposals; design innovative qualitative and quantitative research studies\nCollaborate with the research team to manage and direct the execution of projects sold{{:}} ensure methodology is executed, resolve issues as they arise, approve design or cost decisions, oversee story-driven analysis and story plans, and ultimately deliver final reports that delight and exceed client expectations\nPartner with clients to ensure that their strategic business research objectives are met; become a trusted advisor and serve as main client contact throughout the research process, while always on the hunt for ways to expand our services to the client", "qualifications": {"required": "You have at least 8 years of market research or consumer insights experience on either the supplier or client side\nYou demonstrate experience serving clients in a fast-paced deadline-driven environment, ideally in a business development or consulting role\nYou are self-motivated and driven to achieve business development revenue and profit targets as you grow your own book of business with the Murphy team\nYou have an ability to provide customized results to diverse clients across industries\nYou exhibit leadership skills, are excited by collaboration, and create natural opportunities to coach and mentor  junior team members\nYou possess an ambitious curiosity and thrive when challenged by new opportunities\nYou are tech-savvy, with excellent written and verbal communication skills, strong presentation skills, and attention to detail and organization. "}, "skills": ["Market Research", "Consumer Insights", "Business Development", "Consulting", "Sales", "Leadership", "Collaboration", "Mentorship", "Communication", "Presentation Skills", "Organization"], "postedDate": "5 months ago", "benefits": "Daily opportunity for variety, challenge, and growth\nGreat career advancement and mentorship opportunities\nA collaborative, team-oriented, and high-performing atmosphere\nSalary commensurate with demonstrated experience and skills to achieve mutually agreed upon sales goals. Compensation ranges{{:}} $100,000 - $300,000 with opportunities for full-time, part-time, or commission-only structured positions\nPotential eligibility to competitive benefits package, including medical, dental, vision, 401k matching, paid time off, in-person and virtual social activities. \nFlexibility to work remotely, with an option for hybrid in our Santa Monica office!<br/> ", "remoteWork": "Yes", "url": "https://www.linkedin.com/jobs/view/3859502181"}